{"data":{"movies":[{"title":"That Old Feeling","originalTitle":"","year":"1997","releaseDate":"19970404","directors":[{"name":"Carl Reiner","id":"nm0005348"}],"writers":[{"name":"Leslie Dixon","id":"nm0228908"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUyY2NlOGItZDRjOC00NGI3LWE1NzUtYWNmMGFhNDc5OGU4XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Lily and Dan are a couple who have been divorced for years. When their daughter, Molly gets married she invites them. At the reception, Lily and Dan bicker loudly so Molly asks them to leave. It's while they are alone that their banter turns into passion and they get it on. Later while Molly is having her wedding night she discovers her parents together and freaks out. The next day they run off and their partners are wondering where they are. Molly decides to try and find them and she enlists a paparazzi who's been following her mother to help find them.","simplePlot":"A bride's divorced parents find their old feelings for each other during the wedding reception and over the course of the next few days upsetting the newlywed's honeymoon.","actors":[{"actorName":"Bette Midler","urlProfile":"http://www.imdb.com/name/nm0000541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNjU3NDYyMl5BMl5BanBnXkFtZTcwODUyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1945","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Bette Davis Midler","height":"5' 1\" (1.55 m)","bio":"Multi Grammy Award-winning singer/comedienne/author Bette Midler has also proven herself to be a very capable actress in a string of both dramatic and comedic roles. Midler was born in Honolulu, Hawaii, on December 1, 1945. She is the daughter of Ruth (Schindel), a seamstress, and Fred Midler, a painter. Her parents, originally from New Jersey, were both from Jewish immigrant families (from Russia, Poland, and the Austro-Hungarian Empire). Midler studied drama at the University of Hawaii and got her musical career started by performing in gay bathhouses with piano accompaniment from Barry Manilow. Her first album was \"The Divine Miss M\" released in November 1972, followed by the self-titled \"Bette Midler\" released in November 1973, both of which took off up the music charts, and Bette's popularity swiftly escalated from there. After minor roles in several film/TV productions, she surprised all with her knockout performance of a hard-living rock-and-roll singer (loosely based on the life of Janis Joplin) in The Rose (1979), for which she received an Academy Award nomination for Best Actress. In 1986, director Paul Mazursky cast Midler opposite Nick Nolte and Richard Dreyfuss in the hilarious Down and Out in Beverly Hills (1986), and so began a string of very funny comedic film roles. She played an obnoxious wife who was the victim of a kidnap plot by her scoundrel husband, played by Danny DeVito, in Ruthless People (1986), was pursued by CIA and KGB spies in Outrageous Fortune (1987), played mismatched twins with Lily Tomlin in Big Business (1988) and shone in the tear-jerker Beaches (1988). Bette matched feisty James Caan in the WWII drama For the Boys (1991), made a dynamic trio with Goldie Hawn and Diane Keaton in The First Wives Club (1996), was back on screen with DeVito for the tepid comedy Drowning Mona (2000) and turned up in the glossy remake of The Stepford Wives (2004). Apart from her four Grammy awards, Bette Midler has also won four Golden Globes, one Tony Award, and three Emmy Awards, plus she has sold in excess of 15 million albums worldwide. Most recently, she toured with her sassy \"Kiss My Brass\" show, and is promoting her album \"Bette Midler Sings the Rosemary Clooney Songbook\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNjU3NDYyMl5BMl5BanBnXkFtZTcwODUyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000541","name":"Bette Midler","nicknames":["The Divine Miss M","Bathhouse Betty","The Rose"],"idIMDB":"nm0000541"},"actorId":"nm0000541","character":"Lilly Leonard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Farina","urlProfile":"http://www.imdb.com/name/nm0001199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzE0NTU2OV5BMl5BanBnXkFtZTYwODQxODc1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 February 1944","placeOfBirth":" Chicago, Illinois, USA","height":"6' (1.83 m)","bio":"Dennis Farina was one of Hollywood's busiest actors and a familiar face to moviegoers and television viewers alike. Recently, he appeared in the feature films, \"The Grand,\" a comedy about a Vegas poker tournament with Woody Harrelson, Cheryl Hines and Ray Romano; \"Bottle Shock,\" also starring Alan Rickman, Bill Pullman and Bradley Whitford; and Fox's \"What Happens in Vegas,\" in which Dennis starred as Cameron Diaz's boss. Farina also appeared on the NBC series \"Law and Order\" and in the HBO miniseries, \"Empire Falls,\" for which he won a Golden Globe Award for Best Mini-Series. Farina is well remembered for his role in memorable features such as Steven Soderbergh's \"Out of Sight,\" in which he played the retired lawman father of Jennifer Lopez's character. This was Farina's second outing in an Elmore Leonard best seller, the previous one being \"Get Shorty,\" directed by Barry Sonnenfeld and co-starring John Travolta, Rene Russo and Gene Hackman. Farina received an American Comedy Award for Funniest Supporting Male for his performance as \"Ray 'Bones' Barboni.\" In 1998's \"Saving Private Ryan,\" directed by Steven Spielberg, Farina played \"Col. Anderson,\" a pivotal role in the film. It is this character who convinces Tom Hanks character to lead a squad deep into Nazi territory to rescue \"Pvt. Ryan.\" He also co-starred with Brad Pitt and Oscar-winner Benicio Del Toro in the darkly comedic crime drama \"Snatch,\" directed by Guy Ritchie. Farina's numerous other screen credits include John Frankenheimer's \"Reindeer Games,\" \"Paparazzi,\" Martin Brest's \"Midnight Run,\" the Michael Mann film \"Manhunter\", among many other feature films. Farina is also recognized for his role in the critically acclaimed television series, NBC's \"Crime Story\". A veteran of the Chicago theater, Farina has appeared in Joseph Mantegna's \"Bleacher Bums,\" and \"A Prayer For My Daughter,\" directed by John Malkovich, and many others. He died on July 22, 2013 in Scottsdale, Arizona at age 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzE0NTU2OV5BMl5BanBnXkFtZTYwODQxODc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001199","name":"Dennis Farina","idIMDB":"nm0001199"},"actorId":"nm0001199","character":"Dan De Mora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Marshall","urlProfile":"http://www.imdb.com/name/nm0005191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBkNzVkZGItMjA3NC00NDU4LTliZGMtY2NlYmUxNGU4YzFlL2ltYWdlXkEyXkFqcGdeQXVyMDgxNzEwMA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1964","placeOfBirth":" Rockville, Maryland, USA","birthName":"Paula Marie Marshall","height":"5' 7½\" (1.71 m)","bio":"Paula Marshall was born on June 12, 1964 in Rockville, Maryland, USA as Paula Marie Marshall. She is known for her work on Cheaper by the Dozen (2003), Gary Unmarried (2008) and Hellraiser III: Hell on Earth (1992). She has been married to Danny Nucci since October 12, 2003. They have one child. She was previously married to Tom Ardavany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBkNzVkZGItMjA3NC00NDU4LTliZGMtY2NlYmUxNGU4YzFlL2ltYWdlXkEyXkFqcGdeQXVyMDgxNzEwMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005191","name":"Paula Marshall","idIMDB":"nm0005191"},"actorId":"nm0005191","character":"Molly De Mora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gail O'Grady","urlProfile":"http://www.imdb.com/name/nm0641097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MzE1NDY3OF5BMl5BanBnXkFtZTYwMzQ0NzY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1963","placeOfBirth":" Detroit, Michigan, USA","birthName":"Gail Ann O'Grady","height":"5' 3\" (1.6 m)","bio":"Gail O'Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O'Grady. She is an actress, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MzE1NDY3OF5BMl5BanBnXkFtZTYwMzQ0NzY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641097","name":"Gail O'Grady","idIMDB":"nm0641097"},"actorId":"nm0641097","character":"Rowena","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Rasche","urlProfile":"http://www.imdb.com/name/nm0711058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTE4MzA5NV5BMl5BanBnXkFtZTgwOTIzNzcxOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1944","placeOfBirth":" St. Louis, Missouri, USA","height":"6' (1.83 m)","bio":"David Rasche was born on August 7, 1944 in St. Louis, Missouri, USA. He is an actor, known for Burn After Reading (2008), Men in Black 3 (2012) and Sledge Hammer! (1986). He has been married to Heather Lupton since 1979. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTE4MzA5NV5BMl5BanBnXkFtZTgwOTIzNzcxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711058","name":"David Rasche","idIMDB":"nm0711058"},"actorId":"nm0711058","character":"Alan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Denton","urlProfile":"http://www.imdb.com/name/nm0219835","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWE2YTZkNGEtNDA4My00MDkwLWJmNTUtN2MzNmNmY2Y2MDVhL2ltYWdlXkEyXkFqcGdeQXVyMTQzNDk4MjQ@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1963","placeOfBirth":" Nashville, Tennessee, USA","birthName":"James Thomas Denton Jr.","height":"6' 1\" (1.85 m)","bio":"The second of three children born to a dentist and his wife in Nashville, Tennessee, Denton grew up in Goodlettsville, Tennessee, attended Goodlettsville High School, briefly played basketball at a junior college, then went on to graduate with honors from the (national champion) University of Tennessee at Knoxville, snagging a degree in advertising as a television/journalism major on the way out the door. Even though his father was involved in community theater, Jamie didn't jump in until he was 23, during the Tennessee bicentennial in Nashville, Tennessee. His role as \"George Gibbs\" in a production of \"Our Town\" turned out to be only the first in a long line of plays that he would do, first in Nashville and then, later, in North Carolina, Chicago and California. Although he spent the next four years selling advertising for two radio stations and then for the CBS affiliate in Nashville, Jamie's heart was already in another place and, after a short stint in North Carolina, he headed to Chicago to try his hand at acting full-time. In Chicago, his first role was as \"Stanley\" in \"A Streetcar Named Desire\" and his last was as the terrorist \"Bebert\" in the French farce \"Lapin Lapin\". In the years that came between the two, JD was a company member at The Griffin Theater and at Strawdog Theater Ensemble. He added a steady string of roles and accolades to his quickly growing list of achievements, including one of the leads in the world premiere of \"Flesh and Blood\", performing in and composing the music for \"the Night Hank Williams Died\", and his portrayal of Kentucky preacher \"C.C. Showers\" in \"The Diviners\" - which gained him a much coveted nomination for a Best Actor Joseph Jefferson Award (Chicago's only theater award). A small part in The Untouchables (1993) (the series, not the movie), JAG (1995), Sliders (1995) and Dark Skies (1996). A spot on Moloney (1996), a pilot for ABC called \"L.A. Med\" and a stint on the silver screen in That Old Feeling (1997), were preludes to his first appearance as \"Mr. Lyle\" on The Pretender (1996). Immediately afterward, JD made another pilot, this time for his own series, \"The Hanleys\". When ABC shelved the sitcom at the last minute, Denton continued producing chilling portrayals as \"Mr. Lyle\" on NBC's The Pretender (1996), as a series regular. Summer of 1999 found Jamie heading back to the theater, starring in the world premiere of the play, \"In Walked Monk\". During the 4th season of The Pretender (1996), Jamie added three more guest-starring roles to his credits - the first on Two Guys, a Girl and a Pizza Place (1998), another on Ally McBeal (1997) and the last on the hugely popular The West Wing (1999). That summer, he co-starred in \"Asylum\", at The Court Theatre and, at the end of the year, headed for Canada to film two MOWs for TNT - The Pretender 2001 (2001) and The Pretender: Island of the Haunted (2001). 2001 found Jamie back at ABC after Steven Bochco cast him as \"Judge Augustus \"Jack\" Ripley\", in his struggling new series, Philly (2001). Viewers liked \"Judge Ripley\" and hopes were high that the sizzling on-screen chemistry between Jamie's character and the one portrayed by Kim Delaney would convince ABC to give the show another season to improve its ratings. Ironically, Jamie was in Australia, promoting Philly (2001), when he received word that ABC had passed on renewing the show for a second season. Jamie ended 2002 with a two-part guest-starring role on The Drew Carey Show (1995). Jamie returned as a guest star on JAG (1995) in 2003, and pilot season landed him the opportunity to once again head up the cast of an ABC series in Threat Matrix (2003), a Touchstone production offering up fictionalized events relating to terrorist activity around the world. Jamie played \"John Kilmer\", the man who lead the ultra-covert team of anti-terrorist specialists and who answered solely to the President of the United States. The timely and serious role also gave Jamie the opportunity to change his professional billing from \"Jamie Denton\" to \"James Denton\". Only days before the annual up-fronts in New York, where the major networks announce their new fall season line-ups, ABC picked up the show for September, 2003. Although Threat Matrix (2003) held its own in one of the worst time-slots of the season (sandwiched between the hugely popular \"Survivor\" and the last season of Friends (1994)), ABC nonetheless pulled the series after only fourteen episodes aired (sixteen episodes were filmed). Threat Matrix (2003) was officially canceled on the same day as Jamie's role as \"Mike Delfino\" on Desperate Housewives (2004), a new ABC series scheduled for the Fall, was announced at the 2004 up-fronts in New York. On October 3, 2004, Desperate Housewives (2004) garnered incredible ratings with its debut episode and ABC picked up the rest of the first season before the end of the month. Less than three months later, Jamie was included in People Magazine's 2004 \"Sexiest Men Alive\" issue. During the first and second seasons of Desperate Housewives (2004), Jamie managed to schedule a sweeps week guest star spot on Reba (2001) and, toward the end of the second season, played the role of \"Brother John Brown\" in Ascension Day (2007). Years after composing the music for and performing in \"The Night Hank Williams Died\" - a play from his days in Chicago - Jamie accepted an invitation that was proffered to him by Greg Grunberg (Heroes (2006)) and became a singer and guitar player for a band that was first known as \"16:9\" and then, later, as \"The Band From TV\". Other members of the band include, and have included, (the founder and drummer)Greg Grunberg, Hugh Laurie (keyboards, House (2004)), 'Bonnie Somerville' (singer, Cashmere Mafia (2008)) and Bob Guiney (singer, Bachelor #4 on The Bachelor (2002)). The band largely plays at Hollywood events but does, on occasion, play elsewhere. The band donates any money that it makes to charities that are selected by each of its primary members. When the WGA writer's strike of 2007 shut down production on TV series, there was talk of a tour for the temporarily unemployed band members. A CD that the band made in 2007, \"Hoggin' All The Covers\" is available for sale at Amazon.com. In addition, at least one of the band's songs are on the soundtrack for House (2004) and two of its songs, \"Minnie the Moocher\" and \"You Can't Always Get What You Want\", are available for purchase on iTunes. While on hiatus, between the second and third seasons of Desperate Housewives (2004), Jamie teamed up with Chris Kattan in the straight-to-DVD film, Undead or Alive: A Zombedy (2007). 2007 was a busy year for Denton. In addition to traveling all over the country in order to lend his celebrity to dozens of charitable causes, he also completed three projects - ABC's Masters of Science Fiction (2007)'s episode, Masters of Science Fiction: The Discarded (2007); Custody (2007), which aired on Lifetime and Tortured (2008). The same year, Denton, a lifelong fan of baseball, joined an Orange County investment group that purchased the Golden Baseball League Team, \"The Fullerton Flyers\". Shortly after the purchase and, although the team's home field remained at Cal State Fullerton, the group changed the name of the team to \"The Orange County Flyers\". Not content to merely be an investor, Jamie took as active a role as his schedule and the team structure allowed, attending try-outs, where he had a hand in selecting some of the players during his first season as a co-owner, and attending quite a few of the home games. When \"Housewives\" isn't in production, JD still takes part in other productions. These have included Group Sex (2010) and bringing the voice of \"Superman\" to life in the animated video, All-Star Superman (2011). He played the role of \"Slim\" in the independent film, Karaoke Man (2012). Jamie announced on the Christopher Gabriel radio program that he and his family were moving to Minnesota in August of 2012 and that he would pursue whatever comes next from there. His fans didn't have to wait long to hear from him again. In 2013 JD took on the role of Johnny Trey in \"Grace Unplugged\" and in short order won an award for Outstanding Performance by an Actor. The film won a Top Ten Family Film of the Year and the Grand Prize, \"The Epiphany Award\" for Most Inspirational Film of 2013. Jamie went on to do the Hallmark Channel's \"Stranded In Paradise\", \"Ovation\", \"Strangers\", \"The Dancer and the Dame\" and \"Revelation Road 3: The Black Rider\". 2014 found Jamie making a deal with The Hallmark Channel to become (as \"Dr. Sam\") part of their original series, \"The Good Witch\". His episodes will begin airing in February, 2015. On the home front, a lot of JD's free time is now spent at Bring It! Studios and Crossfit Channhassen, MN, which is the latest business venture which Jamie and his wife have undertaken.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWE2YTZkNGEtNDA4My00MDkwLWJmNTUtN2MzNmNmY2Y2MDVhL2ltYWdlXkEyXkFqcGdeQXVyMTQzNDk4MjQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0219835","name":"James Denton","nicknames":["Jamie"],"idIMDB":"nm0219835"},"actorId":"nm0219835","character":"Keith Marks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Nucci","urlProfile":"http://www.imdb.com/name/nm0001572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5OGRkYjktZmJmZS00NTAwLTgzMWEtMDc0ZWIxYWVhMTdiXkEyXkFqcGdeQXVyNzMxNDM0NDQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1968","placeOfBirth":" Klagenfurt, Carinthia, Austria","height":"5' 10\" (1.78 m)","bio":"Danny Nucci was born on September 15, 1968 in Klagenfurt, Carinthia, Austria. He is an actor, known for Titanic (1997), The Rock (1996) and The Fosters (2013). He has been married to Paula Marshall since October 12, 2003. They have one child. He was previously married to Terre Bridgham.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5OGRkYjktZmJmZS00NTAwLTgzMWEtMDc0ZWIxYWVhMTdiXkEyXkFqcGdeQXVyNzMxNDM0NDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001572","name":"Danny Nucci","idIMDB":"nm0001572"},"actorId":"nm0001572","character":"Joey Donna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Blu Mankuma","urlProfile":"http://www.imdb.com/name/nm0542558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDc3MjkxOV5BMl5BanBnXkFtZTcwMDM5NDMxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1948","placeOfBirth":" Seattle, Washington, USA","height":"6' (1.83 m)","bio":"A native of Seattle, Washington, Mankuma made Vancouver his home during the turbulent years of the Vietnam war. This unique actor with an easy grace on film despite his commanding six foot, 230 lb. girth, Mankuma quickly established a following among producers and directors, building an impressive resume of film, television and theatre credits, becoming one of Canada's busiest actors. Blu Mankuma is also an avid musician, singer, songwriter and stage actor, who has also provided voiceovers for radio and appeared in numerous television commercials. He and his family, including sons Rene and Cusee, and as of this publication resides in Vancouver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDc3MjkxOV5BMl5BanBnXkFtZTcwMDM5NDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0542558","name":"Blu Mankuma","idIMDB":"nm0542558"},"actorId":"nm0542558","character":"Piano Player","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jayne Eastwood","urlProfile":"http://www.imdb.com/name/nm0247720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0OTMyMDk1NDFeQTJeQWpwZ15BbWU4MDM2NDQ3OTIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1946","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 6\" (1.68 m)","bio":"Jayne Eastwood was born on December 17, 1946 in Toronto, Ontario, Canada. She is an actress, known for Chicago (2002), Dawn of the Dead (2004) and Hairspray (2007). She is married to David Flaherty. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0OTMyMDk1NDFeQTJeQWpwZ15BbWU4MDM2NDQ3OTIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247720","name":"Jayne Eastwood","idIMDB":"nm0247720"},"actorId":"nm0247720","character":"Aunt Iris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael J. Reynolds","urlProfile":"http://www.imdb.com/name/nm0721866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTUwNzUxNF5BMl5BanBnXkFtZTYwMzI3MzEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1939","placeOfBirth":" Toronto, Ontario, Canada","bio":"Michael J. Reynolds was born on August 15, 1939 in Toronto, Ontario, Canada. He is an actor, known for The Descent: Part 2 (2009), Fly Away Home (1996) and Police Academy (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTUwNzUxNF5BMl5BanBnXkFtZTYwMzI3MzEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721866","name":"Michael J. Reynolds","idIMDB":"nm0721866"},"actorId":"nm0721866","character":"Senator Marks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan Luchak","urlProfile":"http://www.imdb.com/name/nm0524506","urlPhoto":"","biography":{"bio":"Joan Luchak is an actress, known for That Old Feeling (1997), Mrs. Winterbourne (1996) and Queer as Folk (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0524506","name":"Joan Luchak","idIMDB":"nm0524506"},"actorId":"nm0524506","character":"Senator Marks' Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Wilmot","urlProfile":"http://www.imdb.com/name/nm0932852","urlPhoto":"","biography":{"bio":"Mike Wilmot is an actor and writer, known for It's All Gone Pete Tong (2004), Badly Funded Think Tank (2001) and What If (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0932852","name":"Mike Wilmot","idIMDB":"nm0932852"},"actorId":"nm0932852","character":"Man at Wedding","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lula Franklin","urlProfile":"http://www.imdb.com/name/nm0291484","urlPhoto":"","biography":{"bio":"Lula Franklin is an actress, known for That Old Feeling (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0291484","name":"Lula Franklin","idIMDB":"nm0291484"},"actorId":"nm0291484","character":"Granny Tapper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Hevenor","urlProfile":"http://www.imdb.com/name/nm0381937","urlPhoto":"","biography":{"bio":"George Hevenor is an actor, known for That Old Feeling (1997), Kaleidoscope (1990) and Nightstick (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0381937","name":"George Hevenor","idIMDB":"nm0381937"},"actorId":"nm0381937","character":"Bandleader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arlene Meadows","urlProfile":"http://www.imdb.com/name/nm0575030","urlPhoto":"","biography":{"bio":"Arlene Meadows is an actress, known for Focus (2001), Anne of Avonlea (1987) and That Old Feeling (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0575030","name":"Arlene Meadows","idIMDB":"nm0575030"},"actorId":"nm0575030","character":"Inn Proprietress","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0120318","urlIMDB":"http://www.imdb.com/title/tt0120318","business":{"budget":null,"openingWeekend":[{"money":"$5,103,075","country":"USA","day":"06","month":"04","year":"1997","remarks":"1,575 Screens"}],"gross":[{"money":"$16,325,542","country":"USA","day":"26","month":"05","year":"1997","remarks":""},{"money":"$16,262,872","country":"USA","day":"18","month":"05","year":"1997","remarks":""},{"money":"$16,112,878","country":"USA","day":"11","month":"05","year":"1997","remarks":""},{"money":"$15,792,425","country":"USA","day":"04","month":"05","year":"1997","remarks":""},{"money":"$15,012,945","country":"USA","day":"27","month":"04","year":"1997","remarks":""},{"money":"$13,201,235","country":"USA","day":"20","month":"04","year":"1997","remarks":""},{"money":"$10,090,075","country":"USA","day":"13","month":"04","year":"1997","remarks":""},{"money":"$5,103,075","country":"USA","day":"06","month":"04","year":"1997","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1997/\">1997</a>"},{"money":"46,821","country":"Germany","day":"22","month":"09","year":"1997","remarks":"opening week"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1996/\">1996</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":["2,946 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"Campeau Mansion, Toronto, Ontario, Canada"}],"rated":"PG-13","awards":[{"award":"The Stinkers Bad Movie Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Actress","names":[{"name":"Bette Midler","id":"nm0000541","role":null}]},{"category":"Worst On-Screen Couple","names":[{"name":"Bette Midler","id":"nm0000541","role":null},{"name":"Dennis Farina","id":"nm0001199","role":null}]}]}]}],"votes":"3,041","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023403","name":"All Girl Productions"},{"idCompany":"co0053368","name":"Boy of the Year"},{"idCompany":"co0073541","name":"Bubble Factory, The"}],"keywords":{"keywords":["paparazzi","wedding night","bride","manhattan new york city","restaurant","new york city","dance","central park manhattan new york city","writer","wedding party","wedding ceremony","waitress","waiter","unfaithful wife","unfaithful husband","tuxedo","therapist","tap dancing","sleeping on a couch","sex in car","senator","rivalry","red dress","public phone","politician","policeman","pillow talk","pianist","photograph","photographer","new york skyline","nervous breakdown","mother daughter relationship","mirror","marital reconciliation","manic depression","lingerie","jealousy","intimidation","hotel lobby","hotel bar","horse carriage","heimlich maneuver","hair transplant","groom","grandmother granddaughter relationship","fiance fiancee relationship","father daughter relationship","ex husband ex wife relationship","escalator","engagement ring","dessert","department store","choking","champagne","celebrity","bust","break up","bow tie","bathrobe","airport","actress","adultery","fling","niagara falls"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:42:13"}}