{"data":{"movies":[{"title":"Ring of Fire II: Blood and Steel","originalTitle":"","year":"1993","releaseDate":"19930317","directors":[{"name":"Richard W. Munchkin","id":"nm0612671"}],"writers":[{"name":"Paul Maslak","id":"nm0002622"},{"name":"Richard W. Munchkin","id":"nm0612671"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzIzNjQ1N15BMl5BanBnXkFtZTcwMzE1NDUxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","Sport"],"plot":"A martial-arts fighter battles murderous gang members and the henchmen of an evil underground fighting champion to save his girlfriend.","simplePlot":"A martial-arts fighter battles murderous gang members and the henchmen of an evil underground fighting champion to save his girlfriend.","actors":[{"actorName":"Don Wilson","urlProfile":"http://www.imdb.com/name/nm0933310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzMxNjY2Ml5BMl5BanBnXkFtZTgwNTU1MDIwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1954","placeOfBirth":" Cocoa Beach, Florida, USA","height":"6' 1\" (1.85 m)","bio":"Don \"The Dragon\" Wilson is considered the greatest kick-boxing champion in the sport's history. A native of South Florida, Wilson began fighting in the late 1970s. In a career which spanned 4 decades, he won 11 world kick-boxing championships, among them the WKA, STAR, WKC, PKO Lightheavyweight World Championships, WKA, STAR, ISKA World Cruiserweight Titles, and the WKA and STAR Super-Lightheavyweight World Championships. He posted a record of 72-5-2 with 47 wins by knockout. Wilson defeated such world champions as Dennis Alexio, Oaktree Edwards, and Dick Kimber. He retired from the sport in 1990, but launched a comeback on May 14, 1999. Since his return he has knocked-out Dick Kimber and defeated Dewey Cooper.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzMxNjY2Ml5BMl5BanBnXkFtZTgwNTU1MDIwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933310","name":"Don Wilson","idIMDB":"nm0933310"},"actorId":"nm0933310","character":"Johnny Woo","urlCharacter":"http://www.imdb.com/character/ch0107520","main":true},{"actorName":"Maria Ford","urlProfile":"http://www.imdb.com/name/nm0285768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmQ5ODhlYTktODFhZi00OGE4LWFiMWItYmVmMGExYTdlMjJiXkEyXkFqcGdeQXVyNzMxNjkyNjM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1966","placeOfBirth":" Pikes Peak, Colorado, USA","height":"5' 7\" (1.7 m)","bio":"It's not every day a young actor's career does a 360 and ends up standing pretty on her own two feet. Well, Maria Ford is here to prove it can be done! From being Quentin Tarantino's \"favorite B actress\" to guest-starring on The Drew Carey Show (1995), Maria is moving in a whole new direction. Under new management, she is uncovering more than just her astonishing physical attributes. Her natural comic ability, beautiful smile, and quirkiness give Maria an edge. What kind of an edge? Well, how about a quiet beauty suddenly going into a spinning back-kick? A professionally trained martial artist, she can handle herself in Hollywood's toughest places. She may look harmless, but behind that beautiful smile and bubbly personality is a butt-kicking athlete. Hollywood is starting to take Maria Ford seriously - that is, seeing her acting in a whole light. She's always prepared, studied and ready to work. It's obvious how much Maria loves to act and now she's ready to move ahead. Currently, the Latin American actress is a constantly working professional model and performing dancer. Based in Los Angeles, she works worldwide.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmQ5ODhlYTktODFhZi00OGE4LWFiMWItYmVmMGExYTdlMjJiXkEyXkFqcGdeQXVyNzMxNjkyNjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285768","name":"Maria Ford","idIMDB":"nm0285768"},"actorId":"nm0285768","character":"Julie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sy Richardson","urlProfile":"http://www.imdb.com/name/nm0724784","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzdjNDctMmJhMi00MWM5LWFiNjgtZGM0NThmZWM0Yjc0L2ltYWdlXkEyXkFqcGdeQXVyMTk3NjIzNw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1941","placeOfBirth":" Cincinnati, Ohio, USA","height":"5' 10\" (1.78 m)","bio":"Sy Richardson was born in Cincinnati, Ohio and raised in Chicago Illinois. He attended fourteen elementary schools, five high schools and three colleges before he figured it out. An artist is a free spirit and boredom is a breath away from than death. He is married to a former Blue Satin model. Sy has one step daughter and two granddaughters. He started singing at twelve and recorded his first record with Lil June and the Januarys at sixteen. Served two years on active duty with the United States Navy. Richardson graduated from UC Boulder with a BS in Journalism specializing in advertising. After a short stint with several Colorado newspapers, he opted to act and joined the Heritage Square Opera House. He performed in vaudeville shows and Olios for two years and moved to Hollywood. His career has taken him to film locations from the US to Europe, South America and Australia. Sy Richardson has traveled around the country doing lectures on How to Live in Work in Hollywood. He co-produced and directed the Symposium 98, a documentary, for the SAG/AFTRA EEOC department. He directed \"TREE\" for the Los Angeles Opera Foundation. His direction of \"South Of Where We Live\" won one out of three nominations for the NAACP Image Awards in 1988. Summers In Suffolk was nominated for three NAACP Image Awards in 1996. Passing won two out ten NAACP nominations in 1997. Sy's (someone stole your fries) McDonald's spot, received the 3 star positions for Advertising Age Magazine in 1998. Mr. Richardson teaches a Bible Study class for adult entertainers. Sy is a member of the Desi International Film Festival, Fisk University International Black Film Festival board, the Biola University Studio Task Force, Board of Directors for the Towne Street Theater, He chaired the SAG Casting Committee for three years and taught a cold reading class for the SAG Conservatory and a former member on the Board of Directors for the Screen Actors Guild. Sy teaches his own Acting Workshop in No Ho California, a Children's Musical Theater Camp and a beginning acting workshop for the Towne Street Theater. He is also a member of the International Society for Excellence in Christian Film and Television. He is the artistic director for the Drama Ministry at Heart of the Canyons Church in Newhall, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzdjNDctMmJhMi00MWM5LWFiNjgtZGM0NThmZWM0Yjc0L2ltYWdlXkEyXkFqcGdeQXVyMTk3NjIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724784","name":"Sy Richardson","idIMDB":"nm0724784"},"actorId":"nm0724784","character":"Ernest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dale Jacoby","urlProfile":"http://www.imdb.com/name/nm0414979","urlPhoto":"","biography":{"bio":"Dale Jacoby is known for his work on Die Hard 2 (1990), No Retreat, No Surrender (1986) and Rocky V (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0414979","name":"Dale Jacoby","idIMDB":"nm0414979"},"actorId":"nm0414979","character":"Brad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vince Murdocco","urlProfile":"http://www.imdb.com/name/nm0613741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjYzNjIyMF5BMl5BanBnXkFtZTYwNDc3Mzcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Vince Murdocco gained fame in the kickboxing world when he was the North American Cruiserweight Champion. He soon made the transition from kickboxing to film, like many world champions back in the 1990s. However, Vince made his film debut in a softcore porn comedy, Le retour de Flesh Gordon (1990), as the titled character. In 1990 he starred as Sasha Mitchell's former friend in Kickboxer 2: The Road Back (1991), where he faced the awesome machine that is Michel Qissi (aka Tong Po). From there, Vince began work for PM Entertainment, starring in a variety of roles, from a racist kickboxer in Ring of Fire (1991) to a former prisoner turned hero in Private Wars (1997). After Death Game (1997), however, Vince took a break from acting. In but 2001, though, came back as a government agent in The Barber (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjYzNjIyMF5BMl5BanBnXkFtZTYwNDc3Mzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0613741","name":"Vince Murdocco","idIMDB":"nm0613741"},"actorId":"nm0613741","character":"Chuck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Jacklin","urlProfile":"http://www.imdb.com/name/nm0413146","urlPhoto":"","biography":{"height":"6' 3\" (1.91 m)","bio":"Ian Jacklin is a great martial artist, mostly popular for the martial arts genre. He is a former Kickboxing champion, and still able to throw some kicks and does some fight choreography. He started playing bad guys, but turned good later. In 1994 he was the hero in \"Death Match\". A great action movie in which he starred alongside WMAC-Master Michele 'Mouse' Krasnoo. He starred in several movies alongside stars as Nicholas Hill, Gary Daniels, Lorenzo Lamas and Don 'The Dragon' Wilson.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0413146","name":"Ian Jacklin","nicknames":["The Jackal"],"idIMDB":"nm0413146"},"actorId":"nm0413146","character":"Kalin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Evan Lurie","urlProfile":"http://www.imdb.com/name/nm0527093","urlPhoto":"","biography":{"dateOfBirth":"28 September 1954","placeOfBirth":" Worcester, Massachusetts, USA","bio":"Evan Lurie was born on September 28, 1954 in Worcester, Massachusetts, USA. He is an actor and writer, known for Hologram Man (1995), T-Force (1994) and Double Impact (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0527093","name":"Evan Lurie","idIMDB":"nm0527093"},"actorId":"nm0527093","character":"Predator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlie Ganis","urlProfile":"http://www.imdb.com/name/nm0304395","urlPhoto":"","biography":{"bio":"Charlie Ganis is an actor, known for Emperor of the Bronx (1990), Night of the Wilding (1990) and Ring of Fire II: Blood and Steel (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0304395","name":"Charlie Ganis","idIMDB":"nm0304395"},"actorId":"nm0304395","character":"D.J.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Lee","urlProfile":"http://www.imdb.com/name/nm0497224","urlPhoto":"","biography":{"dateOfBirth":"30 July 1948","placeOfBirth":" Zhongshan, Guangdong, China","bio":"Eric started his training with his father after dinner. The martial art was Choi Li Fut. At that time, everybody practiced Kung Fu. Eric Lee was inspired by the black and white series Won Duck Hing. Eric and his family moved to California and at the age of 15 his formal martial arts training started. Now he trained some Wing Chun and Southern Hunang Ga. For 5 years Eric also studied with Al Dacascos, and several other instructors. From 1986 till 1972 Eric had his own club where several arts were taught. Eric also masters many weapons. Eric started competing in sparring, Kata and weapons. Eric would be undefeated in Kata and weapons as a black belt.. Eric also introduced the music while doing Katas. Eric retired from competition in 1974. Eric has some great stats: 1970-1974 King of Kata, Over 100 titles in Kata championships, 2 Golden Fist Awards, Black Belt Hall of Fame, etc.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0497224","name":"Eric Lee","idIMDB":"nm0497224"},"actorId":"nm0497224","character":"Kwong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Yuan","urlProfile":"http://www.imdb.com/name/nm0950620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjE5MzkyOF5BMl5BanBnXkFtZTcwNDY4Mzg3OQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1973","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Winston Yuan","bio":"Ron Yuan becomes new series regular on the hit Netflix/ The Weinstein Company's \"Marco Polo\" created by John Fusco. Yuan Will play Prince Nayan, a fiery eyed descendant of Genghis Khan. Nayan is a converted Christian that rules all of Manchuria and whose closely watched actions will affect Kublai's control of Asia. Yuan has been a force in front of and behind camera. Hollywood's secret weapon. Yuan is filming Roland Emmerich's Independence Day sequel (IDR) playing Yeong, the main weapons engineer. Before that, Yuan was on the \"The Accountant\" with Ben Affleck,JK Simmons and Anna Kendrick playing a reluctant Silat Master for \"Warrior\" director Gavin O'Connor. You can also see Yuan on Jon Bokenkamp's hit show \"The Blacklist\" as mysterious Blacklister Quon Zhang. Yuan was also seen in the final season of \"Sons of Anarchy\" as the intense and unpredictable Ryu Tom. Yuan cameos in Martin Scorsese's \"Revenge of the Green Dragons\" directed by Andrew Lau (Infernal Affairs) and Andrew Loo, playing the feared leader of the notorious BTK. Yuan played hard-nosed Lt. Peter Kang in the short lived CBS series \"Golden Boy\" from Nicholas Wootton and Greg Berlanti. Yuan also had recent cameo special guest appearances on\"Castle\" and \"Justified\". Yuan joins Francesca Eastwood and Annie Q in \"Cardinal X\" produced by Richard Bosner (Fruitvale Station) and Cassian Elwes in a semi- autobiographical film from first time director Angie Wang based on a college freshman in the 1980's who becomes an expert manufacturer and dealer of ecstasy. Yuan also played the iconic Japanese character Scorpion for Warner Bros' secret Mortal Kombat X \"Generations\" Yuan designed the fight sequences as well as going behind camera as Action Director for Steve Chasman/ Jason Statham's \"Wild Card\" scripted by William Goldman and directed by Simon West. Yuan just finished designing and directing the action on the popular Taiwanese/ Chinese/ International action franchise \"PiZi Ying Xiong 2\"(Black&White 2) shot all in Taiwan. In the past, Yuan was cast in a leading role on HBO pilot \"All Signs of Death\" opposite Ben Whishaw, directed by Alan Ball (True Blood). Yuan recently had character arcs on FOX's \"Touch\" opposite Keifer Sutherland created by Tim Kring (Heroes), NBC's \"Awake\" opposite Jason Issacs and FOX pilot \"Exit Strategy\" with Ethan Hawke directed by Antoine Fuqua (Training Day). Yuan also had memorable turns on hit series and films (Prison Break, CSI:NY, 24, Burn Notice, NCIS:LA, Pushing Daisies, Entourage, Art of War, Fast and Furious, Cradle 2 the Grave, Blood and Bone, Red Dawn) as well as being the voice behind major gaming campaigns (Call of Duty-Black Ops 2, Halo, Star War's Old Republic, Resident Evil, World of Warcraft, Medal of Honor, Army of Two, Guild Wars 2, Deus Ex, Drake's Uncharted, and many more). Yuan's MiniFlix Films with Sony Television (SPE) co-produced three edgy graphic novel stylized films(Three Bullets, Tea and Remembrance, Lollipops) in which Yuan wrote, produced and directed. Yuan's award winning work in short film and features has premiered in over 30 festivals worldwide (including Toronto, Sundance, Tribeca, Greece, Egypt, Beijing, Macao, Newport, Texas, Seattle, Kansas City, Los Angeles and Comic Con). In development are Yuan's \"Wind and Water\" \"Unspoken\" \"Cold\" and twisted post-apocalyptic martial arts western \"Forgotten 8\" in which the latter pairs Alex Tse(Watchmen) as producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjE5MzkyOF5BMl5BanBnXkFtZTcwNDY4Mzg3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950620","name":"Ron Yuan","idIMDB":"nm0950620"},"actorId":"nm0950620","character":"Li","urlCharacter":"http://www.imdb.com/character/ch0107521","main":true},{"actorName":"Elena Sahagun","urlProfile":"http://www.imdb.com/name/nm0756278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MTkzMTMwNjFeQTJeQWpwZ15BbWU4MDEzNDMzNDAx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Elena Sahagun is of Mexican/French-Moroccan decent. Born and raised in Los Angeles, she attended UCLA were she combined acting and pre-med courses. While attending UCLA, on a dare Elena tried out with 3000 other hopefuls for a spot on the Los Angeles Raiders Cheerleading squad and made it. She cheered as a Raiderette for two seasons for the Los Angeles Raiders Football Team. She then decided her true passion was in acting. Elena Sahagun has appeared in 22 films and several television shows in the past 10 years. She has also won an Alma Award Winner in 1998 for Outstanding Actress in an Ensemble Cast for her portrayal in a PBS special entitled \"Fotonovelas\" directed by Carlos Avila. Elena made her first film debut as a young Villainess \"Carmen\" in 20th' Century Fox's Action/Thriller \"Marked For Death\" starring Steven Seagal. She also starred in \"Stigmata 44\" in which she plays a young mother who has a son possessed with the power to shoot \"real\" bullets out of his bare hand. This critically-acclaimed film deals with moral issues between parents and children, and has won 5 awards Worldwide, including Best Film at the Sweden's Children's Film Festival. She has also appeared in several national magazines one including \"People Magazine En Espanol\" worldwide. She sold her first project on her first pitch to \"Showtime\" that she created based on her life experience as an assistant to a major action star entitled \"The Assistant.\" David Ward (two-time academy award winner writer) was hired by Showtime to write her dramedy based on her life. Aside from that project, she has also created a one-hour dramedy and has produced a pilot presentation entitled \"Sideliners\" inspired by her life when she was an NFL Cheerleader \"Raiderette\" with the Los Angeles Raiders. The dramedy is a sexy, bold intimate look at a few charismatic, and manic group of professional cheerleaders. Conceptually, it can be thought of as \"Sex In the City\" meets girl version of \"Entourage\" with the arena being professional cheerleading.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MTkzMTMwNjFeQTJeQWpwZ15BbWU4MDEzNDMzNDAx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0756278","name":"Elena Sahagun","idIMDB":"nm0756278"},"actorId":"nm0756278","character":"Teez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael DeLano","urlProfile":"http://www.imdb.com/name/nm0216399","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDM4NjU0OF5BMl5BanBnXkFtZTgwMDU3MTM0NzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1940","placeOfBirth":" New York City, New York, USA","bio":"Michael DeLano was born on November 26, 1940 in New York City, New York, USA. He is an actor, known for General Hospital (1963), Ocean's Eleven (2001) and Commando (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDM4NjU0OF5BMl5BanBnXkFtZTgwMDU3MTM0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0216399","name":"Michael DeLano","idIMDB":"nm0216399"},"actorId":"nm0216399","character":"Lopez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Bassett","urlProfile":"http://www.imdb.com/name/nm0060248","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTE1NTE1OV5BMl5BanBnXkFtZTcwMTMzOTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1935","placeOfBirth":" Evanston, Illinois, USA","birthName":"William Henry Bassett","bio":"William Bassett was born on December 28, 1935 in Evanston, Illinois, USA as William Henry Bassett. He is an actor, known for House of 1000 Corpses (2003), General Hospital (1963) and Black Dynamite (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTE1NTE1OV5BMl5BanBnXkFtZTcwMTMzOTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0060248","name":"William Bassett","idIMDB":"nm0060248"},"actorId":"nm0060248","character":"Aaron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diana Phipps","urlProfile":"http://www.imdb.com/name/nm0681019","urlPhoto":"","biography":{"bio":"Diana Phipps is known for her work on Final Impact (1992), Street Crimes (1992) and CIA Code Name: Alexa (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0681019","name":"Diana Phipps","idIMDB":"nm0681019"},"actorId":"nm0681019","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Hawley","urlProfile":"http://www.imdb.com/name/nm0370350","urlPhoto":"","biography":{"bio":"Victoria Hawley is known for her work on Ring of Fire II: Blood and Steel (1993), Maximum Force (1992) and Fist of Honor (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0370350","name":"Victoria Hawley","idIMDB":"nm0370350"},"actorId":"nm0370350","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0107962","urlIMDB":"http://www.imdb.com/title/tt0107962","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"07","year":"1992","remarks":null},{"money":null,"country":null,"day":"14","month":"08","year":"1992","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min) (USA)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":null,"camera":["Arriflex Cameras"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"3.9","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"R","awards":[],"votes":"389","type":"Movie","companyCreditsSimple":[{"idCompany":"co0027550","name":"PM Entertainment Group"}],"keywords":{"keywords":["underground","martial arts","combat","hand to hand combat","cult film","murder","bank robbery","m 16","machine gun","roundhouse kick","kickboxer","second part","karate chop","karate kick","kung fu classic","kiss","explosion","beretta","pistol","semiautomatic pistol","ski mask","cage fight","cage fighting","chase","car chase","beefcake martial arts","blood","blood spatter","fistfight","brawl","bare chested male","bare chested male bondage","stick fight","duel","disarming someone","shotgun","pump action shotgun","showdown","violence","kung fu master","kung fu fighting","mixed martial arts","martial artist","martial arts master","wrestling","warrior","tough guy","one against many","one man army","action hero","hero","karate","kung fu","comic relief","kickboxing","beefcake","martial arts tournament","hit in the crotch","fight to the death","female bodybuilder","chop socky","brother brother relationship","b movie","asian american","sequel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:16:55"}}