{"data":{"movies":[{"title":"Tall Tale","originalTitle":"","year":"1995","releaseDate":"19950324","directors":[{"name":"Jeremiah S. Chechik","id":"nm0154819"}],"writers":[{"name":"Steve Bloom","id":"nm0089237"},{"name":"Robert Rodat","id":"nm0734441"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzExNjkwMV5BMl5BanBnXkFtZTYwMTQ4Mjg5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Family","Fantasy","Western"],"plot":"A young boy draws on the inspiration of legendary western characters to find the strength to fight an evil land baron in the old west who wants to steal his family's farm and destroy their idyllic community. When Daniel Hackett sees his father Jonas gravely wounded by the villainous Stiles, his first urge is for his family to flee the danger, and give up their life on a farm which Daniel has come to despise anyway. Going alone to a lake to try to decide what to do, he falls asleep on a boat and wakes to find himself in the wild west, in the company of such \"tall tale\" legends as Pecos Bill, Paul Bunyan, John Henry and Calamity Jane. Together, they battle the same villains Daniel is facing in his \"real\" world.","simplePlot":"A young boy draws on the inspiration of legendary western characters to find the strength to fight an evil land baron in the old west who wants to steal his family's farm and destroy their ... ","actors":[{"actorName":"Patrick Swayze","urlProfile":"http://www.imdb.com/name/nm0000664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM2NjI0MjYyMV5BMl5BanBnXkFtZTYwMjY1ODMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1952","placeOfBirth":" Houston, Texas, USA","birthName":"Patrick Wayne Swayze","height":"5' 10\" (1.78 m)","bio":"Patrick Wayne Swayze was born on August 18, 1952 in Houston, Texas, to Patsy Swayze (née Yvonne Helen Karnes), a choreographer, and Jesse Wayne Swayze, a chemical plant engineer draftsman. His mother owned a dance school in Houston, where Patrick was also a student. His father passed away in 1982. He graduated from Waltrip High School in Houston, and attended San Jacinto College in Pasadena, Texas. He married actress/dancer Lisa Niemi on June 12, 1975, whom he had known when she was 15 and a student at his mother's dance school. His New York City dance training included the Harkness Ballet School and Joffrey Ballet School. He first danced professionally as \"Prince Charming\" in \"Disney on Parade\". After a stint as \"Danny Zuko\" in the original Broadway production of \"Grease\", he made his film debut with a small role in Skatetown, U.S.A. (1979). He made his television debut in 1981 on M*A*S*H (1972), as a soldier diagnosed with leukemia. After many supporting roles in films and a lead role in the TV mini-series North and South (1985), he landed his breakthrough role as dance instructor \"Johnny Castle\" in the hit film Dirty Dancing (1987), for which he received a Golden Globe nomination. He received a second nomination for his portrayal of \"Sam Wheat\" in the blockbuster Ghost (1990). Ghost (1990) was the highest-grossing film of 1990, and at one point, the fourth highest-grossing film of all time. Unfortunately, he did not capitalize on its success. His subsequent films like La cité de la joie (1992), Tall Tale (1995), Black Dog (1998), and Waking Up in Reno (2002) did not fare well with critics or audiences. In December 2003, he returned to Broadway as a replacement for the lead role of \"Billy Flynn\" in the acclaimed revival of John Kander & Fred Ebb's musical, \"Chicago\". The production also went on tour in several cities of the United States, including Los Angeles. In January 2008, he was diagnosed with pancreatic cancer. He fought the illness for well over a year and was able to continue working, but died on September 14, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM2NjI0MjYyMV5BMl5BanBnXkFtZTYwMjY1ODMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000664","name":"Patrick Swayze","nicknames":["Buddy"],"idIMDB":"nm0000664"},"actorId":"nm0000664","character":"Pecos Bill","urlCharacter":"http://www.imdb.com/character/ch0501717","main":true},{"actorName":"Oliver Platt","urlProfile":"http://www.imdb.com/name/nm0001624","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkzNDgzNjEyM15BMl5BanBnXkFtZTYwNzQzODA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1960","placeOfBirth":" Windsor, Ontario, Canada","birthName":"Oliver James Platt","height":"6' 3½\" (1.92 m)","bio":"Oliver Platt was born in Windsor, Ontario, to American parents, Sheila Maynard, a social worker, and Nicholas Platt, a career diplomat. His parents were both from upper-class families, and his maternal great-grandmother, Cynthia Roche, was the sister of Princess Diana's maternal grandfather, Maurice Roche. Platt spent his childhood in Washington DC, Asia, and the middle east. Oliver graduated with a Bachelor of Arts degree with a major in Drama in 1983 from Tufts University. He then trained at Shakespeare & Co. with Kristine Linklater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkzNDgzNjEyM15BMl5BanBnXkFtZTYwNzQzODA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001624","name":"Oliver Platt","idIMDB":"nm0001624"},"actorId":"nm0001624","character":"Paul Bunyan","urlCharacter":"http://www.imdb.com/character/ch0072336","main":true},{"actorName":"Roger Aaron Brown","urlProfile":"http://www.imdb.com/name/nm0114578","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNjExNjE3NF5BMl5BanBnXkFtZTcwMzAwMDEzMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1949","placeOfBirth":" Washington, District of Columbia, USA","bio":"Roger Aaron Brown was born on June 12, 1949 in Washington, District of Columbia, USA. He is known for his work on The District (2000), Seeking a Friend for the End of the World (2012) and RoboCop 2 (1990). He has been married to Janet Mitsui since July 1987. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNjExNjE3NF5BMl5BanBnXkFtZTcwMzAwMDEzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114578","name":"Roger Aaron Brown","idIMDB":"nm0114578"},"actorId":"nm0114578","character":"John Henry","urlCharacter":"http://www.imdb.com/character/ch0039990","main":true},{"actorName":"Nick Stahl","urlProfile":"http://www.imdb.com/name/nm0001763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTAyMTU4NF5BMl5BanBnXkFtZTcwMjg2NDI2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1979","placeOfBirth":" Harlingen, Texas, USA","birthName":"Nicolas Kent Stahl","height":"5' 10\" (1.78 m)","bio":"Nick Stahl was born in Harlingen, Texas on December 5, 1979, to Donna Lynn, a brokerage assistant, and William Kent Stahl, a businessman. After his mother took him to see a children's play at the age of four, Nick confidently declared that acting would be his future. Commercials and community plays followed, two television movies were also released in the early 90s. The breakthrough he needed came next when he starred alongside Mel Gibson, who hand-selected Nick for the role, in The Man Without a Face (1993). Nick played Chuck, the little boy who befriends a stranger that was disfigured in an accident. At age 17 he was cast in Comportements troublants (1998) and the ensemble film The Thin Red Line (1998), which was nominated for Best Picture by the Academy Awards. He has continued to find success with acting, and though he has been featured in major studio productions he is still, to date, more widely known for his edgier and darker indie film roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTAyMTU4NF5BMl5BanBnXkFtZTcwMjg2NDI2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001763","name":"Nick Stahl","idIMDB":"nm0001763"},"actorId":"nm0001763","character":"Daniel Hackett","urlCharacter":"http://www.imdb.com/character/ch0142252","main":true},{"actorName":"Scott Glenn","urlProfile":"http://www.imdb.com/name/nm0001277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzAwMzE1OF5BMl5BanBnXkFtZTYwMjkzOTY0._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1941","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Theodore Scott Glenn","height":"6' (1.83 m)","bio":"Scott Glenn was born January 26, 1941, in Pittsburgh, Pennsylvania, to Elizabeth and Theodore Glenn, a salesman. As he grew up in Appalachia, his health was poor; he was bedridden for a year and doctors predicted he would limp for the rest of his life. During long periods of illness, Glenn was reading a lot and \"dreaming of becoming Lord Byron\". He challenged his illness by intense training programs and eventually got rid of his limp. Glenn entered William and Mary College where he majored in English. He spent three years in the Marines and then tried to combine his passion for storytelling with his passion for adventures by working for five months as a criminal reporter at the Kenosha Evening News. Glenn planned to become an author but found out he had \"problems with dialogs\", so he decided to overcome it by studying acting. In 1966, he headed to New York where he joined George Morrison acting class. He helped in directing student plays to pay for his studies and appeared onstage in La MaMa Experimental Theatre Club productions. Soon after arriving in New York, Glenn became a fan of martial arts. In 1968, he joined The Actors Studio and began working in professional theater and TV. In 1970, James Bridges offered him his first movie work in The Baby Maker (1970). Glenn left for L.A., where he spent seven of the \"most miserable years of [his] life\". He couldn't find interesting film roles and, doing brief TV stints, he felt \"like a person who had to paint the Sistine Chapel with a house-painter's brush\". On a brighter side, he worked episodically with Jonathan Demme (Angels Hard as They Come (1971), Fighting Mad (1976)), Robert Altman (Nashville (1975)) and Francis Ford Coppola (Apocalypse Now (1979)). In 1978, Glenn got tired of Hollywood and moved his family to Ketchum, Idaho, where he worked as a barman, huntsman and mountain ranger for two years (occasionally acting in Seattle stage productions). James Bridges once more changed the course of Glenn's life in 1980 when he offered him the role of John Travolta's rival in Urban Cowboy (1980) and made him a star. Glenn's acting abilities and physical presence helped him to excel both in action (Silverado (1985), The Challenge (1982)) and drama (The Right Stuff (1983), Countdown to Looking Glass (1984), The River (1984)) as he alternately played good guys and bad guys. In the beginning of the '90s, his career was at its peak - he appeared in such indisputable masterpieces as The Silence of the Lambs (1991), and The Hunt for Red October (1990). Established as one of Hollywood's most solid and respected character actors he has appeared in a wide variety of films, such as the black Freudian farce Reckless (1995), the tragicomedy Edie & Pen (1996) and Ken Loach's socio-political declaration Carla's Song (1996), alternating mainstream (Courage Under Fire (1996), Absolute Power (1997)) with independent projects (Lesser Prophets (1997) and Larga distancia (1998)), written by his daughter Dakota Glenn), and TV (Naked City: A Killer Christmas (1998)). Continuing into the 21st century, Glenn has also appeared in Training Day (2001), W. (2008) (as Donald Rumsfeld), Secretariat (2010), Sucker Punch (2011), The Paperboy (2012), and two of the Bourne films: The Bourne Ultimatum (2007) and The Bourne Legacy (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzAwMzE1OF5BMl5BanBnXkFtZTYwMjkzOTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001277","name":"Scott Glenn","idIMDB":"nm0001277"},"actorId":"nm0001277","character":"J.P. Stiles","urlCharacter":"http://www.imdb.com/character/ch0142253","main":true},{"actorName":"Stephen Lang","urlProfile":"http://www.imdb.com/name/nm0002332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzYwNTc5Nl5BMl5BanBnXkFtZTcwMzQzOTUyNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1952","placeOfBirth":" New York City, New York, USA","height":"5' 10½\" (1.79 m)","bio":"A stage actor of great recognition, Stephen Lang has shaped a formidable career on and off the various stages of the United States and abroad. Though he is arguably most well-known for his acclaimed performance in James Cameron's Avatar (2009), Lang began his career in theater. Broadway roles include his Tony-nominated performance as Lou in \"The Speed of Darkness\", Happy in the Dustin Hoffman revival of \"Death of a Salesman\", Colonel Jessep in \"A Few Good Men\", and Mike Tallman alongside Quentin Tarantino and Marisa Tomei in \"Wait Until Dark\". Off-Broadway credits include John Patrick Shanley's \"Defiance\", Anne Nelson's \"The Guys\", Arthur Miller's \"Finishing the Picture\" and his own play, \"Beyond Glory\", for which he received numerous accolades. The play premiered in Washington, D.C. and has played the Goodman Theatre in Chicago, the Roundabout in New York City and a USO tour to various military bases and battleships around the world. In the fall of 2010, Lang received the Patriot Award from the Medal of Honor Society in honor of his theatrical and charitable works for the United States military. Television and film credits include celebrated performances as Babe Ruth in Babe Ruth (1991), Stonewall Jackson in Gods and Generals (2003) as well as acclaimed performances in Last Exit to Brooklyn (1989), Tombstone (1993), Gettysburg (1993), Public Enemies (2009), The Men Who Stare at Goats (2009), Michael Mann's hit TV show Crime Story (1986) , the NBC revival of The Fugitive (2000), featuring Tim Daly, and Fox's sci-fi epic Terra Nova (2011). He has been nominated for and won numerous awards including the Grace Prize, Outer Critics Circle, Drama Desk, Helen Hayes, and Tony Awards, as well as acting prizes at 2010's VisionFest and the Buffalo Niagara Film Festival. Stephen was born in New York City, New York, to Theresa (Volmer) and Eugene Lang, a prominent businessperson and philanthropist. He is of Hungarian Jewish and Irish Catholic descent. He is married to Kristina Watson, a costume designer and teacher, with whom he has four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzYwNTc5Nl5BMl5BanBnXkFtZTcwMzQzOTUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002332","name":"Stephen Lang","idIMDB":"nm0002332"},"actorId":"nm0002332","character":"Jonas Hackett","urlCharacter":"http://www.imdb.com/character/ch0142254","main":true},{"actorName":"Jared Harris","urlProfile":"http://www.imdb.com/name/nm0364813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ3MDYwM15BMl5BanBnXkFtZTcwNTE5MjQ1Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1961","placeOfBirth":" London, England, UK","birthName":"Jared Francis Harris","height":"5' 11¾\" (1.82 m)","bio":"Jared Francis Harris was born in London, England. He is the son of Irish actor Richard Harris and Welsh actress Elizabeth Harris (Elizabeth Rees), and brother of Damian Harris and Jamie Harris. Despite his lineage, Jared showed little interest in becoming an actor, until he was cast in a college production while attending North Carolina's Duke University (USA), where he studied drama and literature, in the early 1980s. After graduation, Jared returned to the UK where he attended Central School of Speech and Drama, along such future stars as Jason Isaacs and James Nesbitt. After graduation, Jared joined the Royal Shakespeare Company, performing in Mark Rylance's Hamlet, Romeo & Juliet, the Silent Woman and A Clockwork Orange. In 1989, he had his screen debut in The Rachel Papers (1989). In 1990, while on vacation in New York, Jared auditioned for the role of Hotspur in Henry IV part 1, which he played at the New York Shakespeare Festival. Still in New York, Jared appeared in the off-Broadway play Ecstasy, for which he won an Obie Award in 1992. In 1996, he won recognition by playing famous pop artist Andy Warhol in I Shot Andy Warhol (1996). After that success, Jared has gone on to many independent films, with a few titles being: Natural Born Killers (1994), Smoke (1995), Happiness (1998), Comment tuer le chien de son voisin (2000), Igby Goes Down (2002), B. Monkey (1998), Shadow Magic (2000) and VH1's Two of Us (2000) where he portrayed John Lennon. He has also starred in blockbusters movies, including: The Last of the Mohicans (1992), Mr. Deeds (2002), Resident Evil: Apocalypse (2004), The Curious Case of Benjamin Button (2008), Sherlock Holmes: A Game of Shadows (2011), Lincoln (2012). And has created memorable characters on such popular TV shows as: The Riches (2007), Fringe (2008), Mad Men (2007). Jared is married to Allegra Riggio, a well-known lighting designer and TV host.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ3MDYwM15BMl5BanBnXkFtZTcwNTE5MjQ1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364813","name":"Jared Harris","nicknames":["Hot Buns"],"idIMDB":"nm0364813"},"actorId":"nm0364813","character":"Head Thug Pug","urlCharacter":"http://www.imdb.com/character/ch0142255","main":true},{"actorName":"Catherine O'Hara","urlProfile":"http://www.imdb.com/name/nm0001573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MzA0NjYwN15BMl5BanBnXkFtZTYwODk4NTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1954","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Catherine Anne O'Hara","height":"5' 4\" (1.63 m)","bio":"Born March 4, 1954 in Ontario, Canada. Attended Burnhamthorpe Collegiate Institute. Began career with starring on television series SCTV (1976). Notable films roles include: the over-dramatic and self-centered Delia Deetz in Tim Burton's Beetlejuice (1988), Kate McCallister, Macaulay Culkin's on-screen mother in Home Alone (1990) and its sequel Home Alone 2: Lost in New York (1992). Catherine would later star in a string of Christopher Guest's mockumentary films including: Waiting for Guffman (1996), Best in Show (2000), A Mighty Wind (2003), and For Your Consideration (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MzA0NjYwN15BMl5BanBnXkFtZTYwODk4NTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001573","name":"Catherine O'Hara","nicknames":["Cath"],"idIMDB":"nm0001573"},"actorId":"nm0001573","character":"Calamity Jane","urlCharacter":"http://www.imdb.com/character/ch0018348","main":true},{"actorName":"Moira Sinise","urlProfile":"http://www.imdb.com/name/nm0365128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNDI4NDgxMF5BMl5BanBnXkFtZTcwMjg0NjQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1954","placeOfBirth":" Pontiac, Illinois, USA","birthName":"Moira Jane Harris","bio":"Moira Harris was born on April 19, 1954 in Pontiac, Illinois, to the well-respected Harris family. She attended and graduated from Illinois State University in Normal, Illinois, (also where John Malkovich attended) and met Gary Sinise during her college years. They have three children: Sophie Sinise, McCanna Anthony Sinise and Ella Sinise. She is the daughter-in-law of Robert L. Sinise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNDI4NDgxMF5BMl5BanBnXkFtZTcwMjg0NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0365128","name":"Moira Sinise","idIMDB":"nm0365128"},"actorId":"nm0365128","character":"Sarah Hackett","urlCharacter":"http://www.imdb.com/character/ch0142256","main":true},{"actorName":"Joe Grifasi","urlProfile":"http://www.imdb.com/name/nm0341055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODA3MTg1M15BMl5BanBnXkFtZTYwOTk3ODAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1944","placeOfBirth":" Buffalo, New York, USA","birthName":"Joseph G. Grifasi","height":"5' 5¾\" (1.67 m)","bio":"Joe Grifasi was born on June 14, 1944 in Buffalo, New York, USA as Joseph G. Grifasi. He is an actor, known for The Deer Hunter (1978), Batman Forever (1995) and 13 Going on 30 (2004). He has been married to Jane Ira Bloom since 1974.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODA3MTg1M15BMl5BanBnXkFtZTYwOTk3ODAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341055","name":"Joe Grifasi","idIMDB":"nm0341055"},"actorId":"nm0341055","character":"Man in Top Hat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John P. Ryan","urlProfile":"http://www.imdb.com/name/nm0752636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDIyNjM4OF5BMl5BanBnXkFtZTcwNjMzOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1936","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Character actor John P. Ryan was born on July 30, 1936 in New York City. The son of Irish immigrant parents, Ryan graduated from Rice High School and studied English at the City College of New York, where he first developed an interest in acting. He served six years in the US Army and worked as a welfare investigator prior to pursuing an acting career. John made his film debut in the 1967 comedy \"The Tiger Makes Out.\" He appeared in five pictures for Jack Nicholson; he's especially memorable as male nurse Spicer in \"Five Easy Pieces.\" Manic, pale-eyed and craggy-faced, with an often intense and explosive screen presence, Ryan was frequently cast as nasty villains, hard-boiled police officers, and strict military men. John gave a strong and touching performance in a rare change-of-pace sympathetic role as Frank Davis, the bitter and regretful father of a murderous monster mutant baby in Larry Cohen's excellent \"It's Alive.\" He also portrayed Davis in the okay sequel \"It Lives Again.\" Other notable movie parts include the fanatical Colonel Hardcore in \"Shamus,\" shrewd mob capo Patsy O'Neill in the witty \"Cops and Robbers,\" evil scientist Schneider in \"Futureworld,\" the dogged Lt. Parmental in \"Breathless,\" vicious Irish mobster Joe Flynn in \"The Cotten Club;\" at his ferocious best as sadistic prison Warden Ranken in the powerful \"Runaway Train,\" hateful fascist lunatic Glastenbury in the exciting \"Avenging Force,\" ruthless drug kingpin Nathan White in the cruddy \"Death Wish IV: The Crackdown,\" ramrod high school principal Mr. O'Rourke in the amusing \"Three O'Clock High,\" and lethal robot history teacher Mr. Hardin in \"Class of 1999.\" Among the TV shows Ryan did guest spots on are \"M.A.S.H.,\" \"The Rockford Files,\" \"Hawaii Five-O,\" \"Buck Rogers in the 25th Century,\" \"Starsky & Hutch,\" \"Kojak,\" \"Hart to Hart,\" \"The F.B.I.,\" and \"Miami Vice.\" John had a recurring role on the TV series \"Archer.\" In addition to his film and TV credits, Ryan also appeared in over 90 stage plays. Following his final film appearance in \"Bound,\" John spent his later years giving acting lessons and was an advocate of spiritual healing. John P. Ryan died from a stroke at age 70 on March 20, 2007 in Los Angeles, California; he's survived by two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDIyNjM4OF5BMl5BanBnXkFtZTcwNjMzOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752636","name":"John P. Ryan","idIMDB":"nm0752636"},"actorId":"nm0752636","character":"Grub","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Wilson","urlProfile":"http://www.imdb.com/name/nm0934113","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjA2MDA4NF5BMl5BanBnXkFtZTgwNDM4MzMzNDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1942","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 10¾\" (1.8 m)","bio":"One chillingly infamous screen role for Scott Wilson in 1967 set the tone for an actor who went on to prove himself an invaluable character player for the past five decades. The Georgia-born native (Atlanta born and raised) was awarded a basketball scholarship following high school at Georgia's Southern Tech University to study architecture. Instead, Wilson hitchhiked to Los Angeles on a whim and hooked up one day with an actor he met in a bar who took him to one of his auditions. Allowed to audition himself by chance, Wilson lost the part but was absolutely hooked. Working an assortment of menial jobs, he studied for nearly five years while gaining experience in such local theater productions as \"The Importance of Being Earnest.\" Scott's fledgling career took off big time after being discovered by director Norman Jewison who cast him as a murder suspect in In the Heat of the Night (1967) starring Sidney Poitier and \"Best Actor\" Oscar winner Rod Steiger. If that weren't a sufficient beginning, Wilson immediately followed this with the co-lead role of murderer Richard Hickok in the stark and disturbing In Cold Blood (1967), a superlative adaptation of Truman Capote best-selling docu-novel. It didn't hurt that Scott himself had a startling resemblance to the real-life killer. Partnering up with Robert Blake as two ex-cons who are eventually executed for the senseless, brutal slaughter of an entire Kansas farm family, the critically acclaimed film put both men squarely on the movie map. Although a serious contender, out-and-out stardom did not come about for the quietly handsome, slightly forlorn-looking actor. Major roles in major pictures, however, did. Among Scott's early film work were Castle Keep (1969) and The Gypsy Moths (1969), both starring Burt Lancaster; The Grissom Gang (1971); Lolly-Madonna XXX (1973) (again with Steiger); The New Centurions (1972); The Great Gatsby (1974), in which he earned raves as the garage owner who shoots Robert Redford's title character to death in Gatsby's backyard swimming pool; The Ninth Configuration (1980), for which he received a Golden Globe nomination; The Right Stuff (1983); the Venice Film Festival winner L'année du soleil calme (1984) [A Year of the Quiet Sun]; Malone (1987) and Johnny Handsome (1989). TV also showed off Scott's dark, controlled intensity and wide range in later years, appearing in guest spots on such popular dramas as \"The X-Files\" and \"The Twilight Zone,\" and in a recurring role as Marg Helgenberger's unscrupulous mobster father in \"CSI.\" In minimovies Scott played everything from Elvis's father in Elvis and the Colonel: The Untold Story (1993) to a Wyoming governor in The Jack Bull (1999). Hardly one of Hollywood's flashiest good ol' boys, the taciturn, unassuming actor has preferred to remain discrete and let his performances do the talking. His output has been minimal compared with other character stars, but he has remained in the quality ranks nevertheless, mixing his standard penchant for darker movies with such family-oriented films as Shiloh (1996) and its 2006 sequel. Supporting the newer \"young guns\" these days, he appeared with Vince Vaughn in Clay Pigeons (1998) and Ryan Phillippe in The Way of the Gun (2000), and ended up one of serial killer Charlize Theron's victims in Monster (2003). Other strong showings on the big screen have included a lead part as a rockabilly star in Don't Let Go (2002) and his down-home patriarch in the superb ensemble art film Junebug (2005), a breakout hit with Academy voters. More recently, Scott has gained a following sporting a full grey beard and ponytailed as grizzled farm owner Hershel Greene in the cable series The Walking Dead: Webisodes (2011). Wilson resides in Los Angeles along with his wife of nearly four decades, Heavenly, an attorney and accomplished artist and writer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjA2MDA4NF5BMl5BanBnXkFtZTgwNDM4MzMzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934113","name":"Scott Wilson","idIMDB":"nm0934113"},"actorId":"nm0934113","character":"Zeb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bert Kramer","urlProfile":"http://www.imdb.com/name/nm0469463","urlPhoto":"","biography":{"dateOfBirth":"10 October 1934","placeOfBirth":" San Diego, California, USA","birthName":"Albert George Kohnhorst","height":"5' 10¾\" (1.8 m)","bio":"Bert Kramer was born on October 10, 1934 in San Diego, California, USA as Albert George Kohnhorst. He was an actor, known for Another World (1964), Volcano (1997) and The Confession (2000). He was married to Patricia Lynn. He died on June 20, 2001 in Los Angeles, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0469463","name":"Bert Kramer","idIMDB":"nm0469463"},"actorId":"nm0469463","character":"Bronson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Lawson","urlProfile":"http://www.imdb.com/name/nm0493211","urlPhoto":"","biography":{"dateOfBirth":"28 December 1941","placeOfBirth":" Glendale, California, USA","birthName":"Eric Layton Lawson","bio":"Eric Lawson was born on December 28, 1941 in Glendale, California, USA as Eric Layton Lawson. He was an actor, known for Gymkata (1985), King Cobra (1999) and Kids on the Move (1998). He was married to Susan. He died on January 10, 2014 in San Luis Obispo, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0493211","name":"Eric Lawson","idIMDB":"nm0493211"},"actorId":"nm0493211","character":"Sheriff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Rodgers","urlProfile":"http://www.imdb.com/name/nm0734673","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDk2OTUzOV5BMl5BanBnXkFtZTgwMTk3NzY0MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Bill Rodgers was born in Lincolnshire, England. He is an actor, known for Switchback (1997), Tall Tale (1995) and Girls' Night (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDk2OTUzOV5BMl5BanBnXkFtZTgwMTk3NzY0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0734673","name":"Bill Rodgers","idIMDB":"nm0734673"},"actorId":"nm0734673","character":"Captain of Industry","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0111359","urlIMDB":"http://www.imdb.com/title/tt0111359","business":{"budget":{"money":"$32,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,046,181","country":"USA","day":"26","month":"03","year":"1995","remarks":"2 Screens"}],"gross":[{"money":"$2,800,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$1,757,648","country":"USA","day":"02","month":"04","year":"1995","remarks":"2 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"12","month":"09","year":"1993","remarks":null},{"money":null,"country":null,"day":"16","month":"12","year":"1993","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Dolby SR"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Lenses and Panaflex Cameras by Panavision"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm (Eastman)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Eastman)"]},"rating":"5.9","filmingLocations":[{"location":"Barstow, California, USA"}],"rated":"PG","awards":[],"votes":"2,748","type":"Movie","companyCreditsSimple":[{"idCompany":"co0072626","name":"Caravan Pictures"},{"idCompany":"co0008970","name":"Walt Disney Pictures"}],"keywords":{"keywords":["boy","wild west","old west","legend","john henry","calamity jane","paul bunyan","tall tale","horseback riding","work horse","black horse","horse drawn plow","plow horse","plow","belgian horse","husband wife relationship","mother son relationship","family relationships","man horse relationship","boy horse relationship","rider horse relationship","riding a horse","horse","year 1905","1900s","father son relationship","cowboy and outlaw","land grabbing","code","saloon","cowboy hat","bar fight","violence","teenager fighting adult","teenage boy","teenage hero","crushed to death","good versus evil","cowboy","showdown","gunfight","shootout","axe throwing","axe","repeating rifle","jail break","winchester rifle","stick fight","shovel","foot chase","chase","angry mob","double barreled shotgun","shotgun","carbine","gunslinger","gunfighter","fast draw","colt 45","six shooter","revolver","pistol","dual wield","gun shot out of hand","three man army","nightmare","legendary hero","small town","western town","western hero","hero","miniaturization","giant","train","train tunnel","valley"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:40:40"}}