{"data":{"movies":[{"title":"Needful Things","originalTitle":"","year":"1993","releaseDate":"19930827","directors":[{"name":"Fraser C. Heston","id":"nm0381699"}],"writers":[{"name":"Stephen King","id":"nm0000175"},{"name":"W.D. Richter","id":"nm0725379"}],"runtime":"120 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODFjMzIyM2UtZGE5Mi00ODM3LTlhODQtODI3NmU0ZDRiM2RiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Fantasy","Horror","Thriller"],"plot":"Castle Rock, New England, is a nice place to live and grow and Sheriff Alan Pangborn moves from the big city to the town expecting a quiet life. When Leland Gaunt opens the store Needful Things, he seems to have the object of desire for each dweller. He charges small amounts to the things but requests a practical joke for each of them against another inhabitant. Soon hell breaks loose in town with deaths, violence and riot and Sheriff Pangborn discovers that Leland Gaunt is the devil himself. Further, Gaunt is manipulating the population like puppets exploring the weakness and greed of each person.","simplePlot":"A mysterious new shop opens in a small town which always seems to stock the deepest desires of each shopper, with a price far heavier than expected.","actors":[{"actorName":"Max von Sydow","urlProfile":"http://www.imdb.com/name/nm0001884","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDQzOTMwN15BMl5BanBnXkFtZTYwMDgyMjM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1929","placeOfBirth":" Lund, Skåne län, Sweden","birthName":"Max Carl Adolf von Sydow","height":"6' 4\" (1.93 m)","bio":"Max von Sydow was born Carl Adolf von Sydow on April 10, 1929 in Lund, Skåne, Sweden, to a middle-class family. He is the son of Baroness Maria Margareta (Rappe), a teacher, and Carl Wilhelm von Sydow, an ethnologist and folklore professor. His surname traces back to his father's partial German ancestry. When he was in high school, he and a few fellow students, including Yvonne Lombard, started a theatre club which encouraged his interest in acting. After conscription, he began to study at the Royal Dramatic Theatre's acting school (1948-1951), together with Lars Ekborg, Margaretha Krook and Ingrid Thulin. His first role was as Nils the crofter in Alf Sjöberg's Only a Mother (1949). After graduation, he worked at the city theatres in Norrköping and Malmö. His work in the movies by Ingmar Bergman (especially The Seventh Seal (1957), that includes the iconic scenes in which he plays chess with Death) made him well-known internationally, and he started to get offers from abroad. His career abroad began with him playing Jesus in The Greatest Story Ever Told (1965); Hawaii (1966) and The Quiller Memorandum (1966). Since then, his career includes very different kind of characters, like Karl Oskar Nilsson in The Emigrants (1971); Father Lankester Merrin in The Exorcist (1973); Joubert the assassin in Three Days of the Condor (1975), Emperor Ming in Flash Gordon (1980); the villain Ernst Stavro Blofeld in the Never Say Never Again (1983); Liet-Kynes in Dune (1984) the artist Frederick in Hannah and Her Sisters (1986); Lassefar in Pelle the Conqueror (1987), for which he received his first Academy Award nomination; Dr. Peter Ingham in Awakenings (1990); Lamar Burgess in Minority Report (2002) and The Renter in Extremely Loud & Incredibly Close (2011), which earned him his second Academy Award nomination. He has become one of Sweden's most admired and professional actors and is the only male Swedish actor to receive an Oscar nomination. Max has been nominated twice: for Pelle the Conqueror (1987) in 1988 and for Extremely Loud & Incredibly Close (2011) in 2012. He received the Guldbagge Award for Best Director in his directing debut, the drama film Katinka (1988). In 2016, he joined the sixth season of the HBO series Game of Thrones (2011) as the Three-eyed Raven, which earned him his Primetime Emmy Award nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDQzOTMwN15BMl5BanBnXkFtZTYwMDgyMjM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001884","name":"Max von Sydow","idIMDB":"nm0001884"},"actorId":"nm0001884","character":"Leland Gaunt","urlCharacter":"http://www.imdb.com/character/ch0017771","main":true},{"actorName":"Ed Harris","urlProfile":"http://www.imdb.com/name/nm0000438","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDM4ODc2OV5BMl5BanBnXkFtZTcwNzA5NjQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1950","placeOfBirth":" Tenafly, New Jersey, USA","birthName":"Edward Allen Harris","height":"5' 9\" (1.75 m)","bio":"By transforming into his characters and pulling the audience in, Ed Harris has earned the reputation as one of the most talented actors of our time. Ed Harris was born in Tenafly, New Jersey, to Margaret (Sholl), a travel agent, and Robert Lee Harris, a bookstore worker who also sang professionally. Both of his parents were originally from Oklahoma. Harris grew up as the middle child. After graduating high school, he attended New York's Columbia University, where he played football. After viewing local theater productions, Harris took a sudden interest in acting. He left Columbia, headed to Oklahoma, where his parents were living, and enrolled in the University of Oklahoma's theater department. After graduation, he moved to Los Angeles to find work. He started acting in theater and television guest spots. Harris landed his first leading role in a film in cult-favorite George A. Romero's Knightriders (1981). Two years later, he got his first taste of critical acclaim, playing astronaut John Glenn in The Right Stuff (1983). Also that year, he made his New York stage debut in Sam Shepard's \"Fool for Love\", a performance that earned him an Obie for Outstanding Actor. Harris' career gathered momentum after that. In 2000, he made his debut as a director in the Oscar-winning film Pollock (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDM4ODc2OV5BMl5BanBnXkFtZTcwNzA5NjQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000438","name":"Ed Harris","idIMDB":"nm0000438"},"actorId":"nm0000438","character":"Sheriff Alan Pangborn","urlCharacter":"http://www.imdb.com/character/ch0017770","main":true},{"actorName":"Bonnie Bedelia","urlProfile":"http://www.imdb.com/name/nm0000889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEyOTA4MTM5OV5BMl5BanBnXkFtZTcwNTQ4NTQzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1948","placeOfBirth":" New York City, New York, USA","birthName":"Bonnie Bedelia Culkin","height":"5' 4\" (1.63 m)","bio":"The native New Yorker was born Bonnie Bedelia Culkin on March 25, 1948, the daughter of Phillip Harley Culkin, a journalist, and Marian Ethel Wagner Culkin, a writer and editor. Trained in ballet, her parents guided all of the children at one time or another into acting (which included Christopher (Kit), Terry and Candace Culkin). Bonnie herself attended Quintano School for Young Professionals in New York at one point and Bonnie and Kit went on to appear on the local stage and TV. Brother Kit would later be known more for siring a handful of talented child actors and/or stars (Macaulay Culkin, Kieran Culkin, and the rest). It was Bonnie who was first spotted among the other acting siblings by a talent scout who happened to catch her in a school production of \"Tom Sawyer\", and encouraged her. She made her professional debut at age 9 in a 1957 North Jersey Playhouse production of \"Dr. Praetorius\" and then was handed a full scholarship to study at George Balanchine's New York City Ballet. But the acting bug had bitten and after dancing in only four productions (including playing the role of Clara in \"The Nutcracker\"), she decided to hang up her ballet slippers. She proceeded to study at both the HB Studio and Actors Studio in New York. Bonnie nabbed a five-year role as young teen \"Sandy Porter\" in the New York-based daytime soap Love of Life (1951) starting in 1961. During that time, she took her first Broadway bow in \"Isle of Children\", a show that lasted but a week in March of 1962. She was also a replacement in the established hit comedy \"Enter Laughing\", a year later. After appearing in the stage play \"The Playroom\" in 1965, she earned strong reviews for her touching performance in \"My Sweet Charlie\", for which she won the 1967 Theatre World Award for \"promising new artist\". In it, she played a pregnant young Southern girl on the lam with a black lawyer. Patty Duke recreated the role a few years later on TV and captured an Emmy. Films beckoned at this point and Bonnie made her debut lending topnotch support in The Gypsy Moths (1969) which reunited From Here to Eternity (1953) stars Burt Lancaster and Deborah Kerr. She earned even better marks in her next two films, one performance simply haunting and the other one hilarious. Once again playing pregnant and once again delivering a touching pathos, she played the dirt-poor marathon dancer who pitches songs for pennies and the almost-mother of Bruce Dern's child in the superb, award-winning, Depression-era drama They Shoot Horses, Don't They? (1969). On the other end of the acting spectrum, she played the lovable bride-to-be in the side-splitting comedy classic Lovers and Other Strangers (1970). By this time, Bonnie had started concentrating on family values. She married scriptwriter Ken Luber on April 24, 1969, and bore him a son, Yuri, the following year. The time off to focus on motherhood (she had second son, Jonah Luber, in 1976) proved detrimental to her rising star. The remaining decade was uneventful at best, despite some fine showings in a splattering of TV-movies. Her big comeback came again on the movie trail in the early 1980s when she absolutely nailed the role of race car driver Shirley Muldowney in Heart Like a Wheel (1983). She was surprisingly overlooked at Oscar time, however, despite the praise she received. Despite respected work in subsequent movies such as Violets Are Blue... (1986), The Prince of Pennsylvania (1988), Presumed Innocent (1990) and a running role as Bruce Willis's put-upon wife in Die Hard (1988) and its sequel, she found better and more frequent parts on TV. She found her niche in TV-movies with social themes and tugged at more hearts in Switched at Birth (1991), A Mother's Right: The Elizabeth Morgan Story (1992), Any Mother's Son (1997) and To Live Again (1998). In a change of pace, Bonnie joined the ensemble cast of the low-budget cult comedy Sordid Lives (2000), as \"Latrelle\", a homophobic woman dealing with her mother's death, the imprisonment of her gay brother and her own son's \"coming out\". The movie has recently evolved into a TV series, which is scheduled for some time in 2008 and reunites her with original cast members Leslie Jordan and Olivia Newton-John. Divorced from the father of her two children, she is presently married to third husband (or fourth, depending on your source of reference) actor Michael MacRae, whom she married in 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEyOTA4MTM5OV5BMl5BanBnXkFtZTcwNTQ4NTQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000889","name":"Bonnie Bedelia","idIMDB":"nm0000889"},"actorId":"nm0000889","character":"Polly Chalmers","urlCharacter":"http://www.imdb.com/character/ch0186927","main":true},{"actorName":"Amanda Plummer","urlProfile":"http://www.imdb.com/name/nm0001625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjIyNTY3NF5BMl5BanBnXkFtZTcwOTUwMzg4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1957","placeOfBirth":" New York City, New York, USA","birthName":"Amanda Michael Plummer","height":"5' 4\" (1.63 m)","bio":"The daughter of Canadian actor Christopher Plummer and American actress Tammy Grimes, Amanda Plummer was born in New York City on March 23, 1957. Her breakthrough role came when she starred opposite Robin Williams in The Fisher King (1991). However, Plummer may be best remembered for her work in the Quentin Tarantino classic Pulp Fiction (1994). Tarantino wrote the parts of two robbers who hold up a restaurant specifically for Plummer and her partner-in-screen-crime Tim Roth. Since that stand-out role, Plummer has continued to appear in a wide variety of films, including The Prophecy (1995), Freeway (1996), and Ma vie sans moi (2003). Plummer has also appeared in the films Butterfly Kiss (1995) as \"Eunice\" by Michael Winterbottom, Ma vie sans moi (2003) by Isabel Coixet, Pax (1994) by Eduardo Guedes, Daniel (1983) by Sidney Lumet, Ken Park (2002) by Larry Clark and, lately, The Making of Plus One (2010) and Inconceivable (2008) both by 'Mary Mcguckian', among others. She has often performed on stage. Her highly acclaimed work on Broadway has garnered her a Tony award and two Tony Award nominations as well as the Outer Critics Circle Award and Drama Desk Award. She was honored with three Emmy awards, and one Emmy nomination, a Saturn Award, and DVDX nomination, CableAce Award and Golden Globe nomination. In 1988, she was honored with the Anti-Defamation League Award for Woman of Achievement. On stage, Plummer appeared as Alma in Tennessee Williams's \"Summer and Smoke\" with Kevin Anderson, directed by Michael Wilson. At the Stratford Theater in Ontario, she was Joan of Arc in an original adaptation of \"The Lark\" by Jean Anouilh, directed by Michael Lindsay-Hogg. She appeared as Polly in \"The Gnadiges Fraulein\" with Elizabeth Ashley, and as Kyra in the world premiere of \"One Exception\", both by by Tennessee Williams, at the Hartford Stage. On Broadway: \"A Taste of Honey\" as Jo (nominated for a Tony Award, and Drama Desk Award, and received the Outer Critics Circle, and Theatre World Awards); as Agnes in \"Agnes of God\" with Geraldine Page (Tony Award, Drama Desk Award, Outer Critics Circle, and Boston Critics Awards); as Eliza in \"Pygmalion\" with Peter O'Toole and John Mills (Tony Award nomination); as Laura in \"The Glass Menagerie\" with Jessica Tandy; as Dolly in \"You Never Can Tell\" by George Bernard Shaw. Among her off-Broadway shows are \"A Lie of the Mind\" as Beth, directed and written by Sam Shepard with Harvey Keitel, Aidan Quinn and Geraldine Page, \"Killer Joe\" by Tracy Letts, \"The Milk Train Doesn't Stop Here Any More\" by Tennessee Williams, and \"A Taste of Honey\" with Valerie French. In England, at the Guilford Theatre she appeared as Eliza Doolittle in \"Pygmalion,\" and at the Royal Court Theatre did \"This Is a Chair\", directed by Stephen Daldry and written by Carol Churchill. Her regional work includes Juliet in \"Romeo & Juliet\" (Hollywood Dramalogue Award) and Sonya in \"Uncle Vanya,\" Frankie in \"A Member of the Wedding,\" \"Two Rooms,\" and \"The Wake of Jamey Foster\" by Beth Henley. In television, she is the recipient of three Emmy Awards, one Emmy nomination, a Cable Ace Award, and a Golden Globe nomination. She appeared as Lucky in the filmed workshop, \"Core Sample - Goli Otok\" with Vanessa Redgrave and Lynn Redgrave, directed by Lenka Udovicki, the artistic director of The Ulysses Theater on Brijuni, Croatia, and also in Lucky McKee's film Red (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjIyNTY3NF5BMl5BanBnXkFtZTcwOTUwMzg4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001625","name":"Amanda Plummer","idIMDB":"nm0001625"},"actorId":"nm0001625","character":"Nettie Cobb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.T. Walsh","urlProfile":"http://www.imdb.com/name/nm0000687","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTc5ODk1MV5BMl5BanBnXkFtZTcwMDQzNDg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1943","placeOfBirth":" San Francisco, California, USA","birthName":"James Thomas Patrick Walsh","height":"5' 11½\" (1.82 m)","bio":"J.T. Walsh was born on September 28, 1943 in San Francisco, California, USA as James Thomas Patrick Walsh. He was an actor, known for Sling Blade (1996), A Few Good Men (1992) and Pleasantville (1998). He was married to Susan West. He died on February 27, 1998 in La Mesa, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTc5ODk1MV5BMl5BanBnXkFtZTcwMDQzNDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000687","name":"J.T. Walsh","idIMDB":"nm0000687"},"actorId":"nm0000687","character":"Danforth Keeton III","urlCharacter":"http://www.imdb.com/character/ch0186929","main":true},{"actorName":"Ray McKinnon","urlProfile":"http://www.imdb.com/name/nm0571964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzE3NjIwOV5BMl5BanBnXkFtZTcwMjgwNTg2Mw@@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1957","placeOfBirth":" Adel, Georgia, USA","height":"6' 2\" (1.88 m)","bio":"Ray McKinnon was born on November 15, 1957 in Adel, Georgia, USA. He is an actor and writer, known for Rectify (2013), Deadwood (2004) and Mud (2012). He was previously married to Lisa Blount.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzE3NjIwOV5BMl5BanBnXkFtZTcwMjgwNTg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571964","name":"Ray McKinnon","idIMDB":"nm0571964"},"actorId":"nm0571964","character":"Deputy Norris Ridgewick","urlCharacter":"http://www.imdb.com/character/ch0253710","main":true},{"actorName":"Duncan Fraser","urlProfile":"http://www.imdb.com/name/nm0292114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAzOTA3NzA4NF5BMl5BanBnXkFtZTYwNjMxMTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Duncan Fraser was born in Greater Manchester, England. He is an actor, known for The Exorcism of Emily Rose (2005), Seven Years in Tibet (1997) and Needful Things (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAzOTA3NzA4NF5BMl5BanBnXkFtZTYwNjMxMTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292114","name":"Duncan Fraser","idIMDB":"nm0292114"},"actorId":"nm0292114","character":"Hugh Priest","urlCharacter":"http://www.imdb.com/character/ch0186931","main":true},{"actorName":"Valri Bromfield","urlProfile":"http://www.imdb.com/name/nm0111315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzM2ZTk0NWEtYTM3Yi00NjE1LWJiZmItZjk4NmYwY2QwOTkxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1949","placeOfBirth":" Toronto, Ontario, Canada","bio":"Valri Bromfield was born on February 10, 1949 in Toronto, Ontario, Canada. She is a writer and actress, known for The Rosie O'Donnell Show (1996), Inside America's Totally Unsolved Lifestyles (1992) and Nothing But Trouble (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzM2ZTk0NWEtYTM3Yi00NjE1LWJiZmItZjk4NmYwY2QwOTkxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0111315","name":"Valri Bromfield","idIMDB":"nm0111315"},"actorId":"nm0111315","character":"Wilma Jerzyck","urlCharacter":"http://www.imdb.com/character/ch0186932","main":true},{"actorName":"Shane Meier","urlProfile":"http://www.imdb.com/name/nm0576721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzMyOTYwNF5BMl5BanBnXkFtZTYwNjUwMDA3._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1977","placeOfBirth":" Saskatoon, Saskatchewan, Canada","height":"5' 7½\" (1.71 m)","bio":"Shane started his film career when he was just 12-yrs-old playing Clint Eastwood's son in Unforgiven (1992). He got a chance to play his childhood idol on television by playing \"Young MacGyver\" for a number of episodes of MacGyver (1985). He was flown to LA by Steven Spielberg to audition for Hook (1991). Shane has appeared alongside Ed Harris, Chuck Norris, Max von Sydow, Jean-Claude Van Damme and Stockard Channing. He is the second of three boys from parents John Meier and Jane Weir. His brothers names are Ash and Travis Meier.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzMyOTYwNF5BMl5BanBnXkFtZTYwNjUwMDA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0576721","name":"Shane Meier","nicknames":["Shaner"],"idIMDB":"nm0576721"},"actorId":"nm0576721","character":"Brian Rusk","urlCharacter":"http://www.imdb.com/character/ch0186933","main":true},{"actorName":"William Morgan Sheppard","urlProfile":"http://www.imdb.com/name/nm0792003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTQ2NjM3M15BMl5BanBnXkFtZTYwMjk3MjAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1932","placeOfBirth":" London, England, UK","height":"5' 9\" (1.75 m)","bio":"William Sheppard was born and raised in London, England to an Anglo-Irish family. He is a graduate of the Royal Academy of Dramatic Art in London. He was an Associate Artist with the Royal Shakespeare Company for 12 years. He appeared on Broadway in 1966 with \"Marat-Sade\" and later in 1975 with \"Sherlock Holmes\". He won the Los Angeles Drama Critics Circle award for \"The Homecoming\" in 1995, at the Matrix Theatre. He voiced the narrator in the popular computer game Civilization 5.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTQ2NjM3M15BMl5BanBnXkFtZTYwMjk3MjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0792003","name":"William Morgan Sheppard","idIMDB":"nm0792003"},"actorId":"nm0792003","character":"Father Meehan","urlCharacter":"http://www.imdb.com/character/ch0017772","main":true},{"actorName":"Don S. Davis","urlProfile":"http://www.imdb.com/name/nm0204493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEyOTI5MTIxOV5BMl5BanBnXkFtZTcwODkwNDI3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1942","placeOfBirth":" Aurora, Missouri, USA","birthName":"Don Sinclair Davis","height":"5' 8\" (1.73 m)","bio":"Don S. Davis was born on August 4, 1942 in Aurora, Missouri, USA as Don Sinclair Davis. He was an actor, known for Stargate SG-1 (1997), Cliffhanger (1993) and The Uninvited (2009). He was married to Ruby Fleming-Davis. He died on June 29, 2008 in Gibsons, British Columbia, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEyOTI5MTIxOV5BMl5BanBnXkFtZTcwODkwNDI3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0204493","name":"Don S. Davis","idIMDB":"nm0204493"},"actorId":"nm0204493","character":"Reverend Rose","urlCharacter":"http://www.imdb.com/character/ch0186934","main":true},{"actorName":"Campbell Lane","urlProfile":"http://www.imdb.com/name/nm0132655","urlPhoto":"","biography":{"dateOfBirth":"15 July 1935","placeOfBirth":" Montreal, Québec, Canada","birthName":"Campbell Francis Lane","bio":"Campbell Lane was born on July 15, 1935 in Montreal, Québec, Canada as Campbell Francis Lane. He was an actor, known for Cool Runnings (1993), Dreamcatcher (2003) and RoboCop: Alpha Commando (1998). He was married to Diane Lane. He died on January 30, 2014 in Vancouver, British Columbia, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0132655","name":"Campbell Lane","nicknames":["Cam"],"idIMDB":"nm0132655"},"actorId":"nm0132655","character":"Frank Jewett","urlCharacter":"http://www.imdb.com/character/ch0186935","main":true},{"actorName":"Eric Schneider","urlProfile":"http://www.imdb.com/name/nm0773796","urlPhoto":"","biography":{"bio":"Eric Schneider is an actor, known for Needful Things (1993), Capitaines courageux (1996) and Stargate SG-1: Children of the Gods - Final Cut (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0773796","name":"Eric Schneider","idIMDB":"nm0773796"},"actorId":"nm0773796","character":"Henry Beaufort","urlCharacter":"http://www.imdb.com/character/ch0186936","main":true},{"actorName":"Frank C. Turner","urlProfile":"http://www.imdb.com/name/nm0003964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MDAzNTQ2M15BMl5BanBnXkFtZTgwOTE1NjczMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1951","placeOfBirth":" Wainwright, Alberta, Canada","birthName":"Francis Charles Turner","height":"6' (1.83 m)","bio":"Frank C. Turner is an actor and iconographer born in Wainwright, Alberta and now living in Port Coquitlam, British Columbia. He received his theatrical training at the University of Alberta, graduating in 1975 with a BFA. For the first few years after graduation he acted in theatres across western Canada and Ontario. In 1983 he moved to Vancouver, BC and has worked mainly in film since then. His favourite credits include, Air Bud (1997), Air Bud: Golden Receiver (1998), Air Bud 3 (2000), Un chien du tonnerre (2002), La nouvelle famille Addams: Addams Family Feud (1999), Lonesome Dove: The Outlaw Years (1995), Cats & Dogs (2001), Chiens des neiges (2002) and The Duke (1999). Frank has previously performed the GKC - GBS debate in Calgary, St. Paul, Minnesota, and on Apostle of Common Sense with EWTN. In 1991 he began studying iconography under Vladislav Andreyev. He has completed about 50 icons in the Byzantine tradition for individuals and churches in the Vancouver area. A frequent attendee of the Mount Angel Iconography Institute where he studied with Charles Rohrbacher, Mary Katsilometes, and Cathy Sievers; more recently he studied with Father Gianluca Busi from Bologna, spending six weeks there in 2007. He gives private instruction in iconography. Along with Chris Kielsinki and Michal Janek, Frank was a founding member of Epiphany Sacred Arts Guild, and has served as its president for four years. He also served on the curriculum advisory board of Living Waters College, soon to be opened in Derwent, Alberta.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MDAzNTQ2M15BMl5BanBnXkFtZTgwOTE1NjczMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003964","name":"Frank C. Turner","idIMDB":"nm0003964"},"actorId":"nm0003964","character":"Pete Jerzyck","urlCharacter":"http://www.imdb.com/character/ch0186937","main":true},{"actorName":"Gillian Barber","urlProfile":"http://www.imdb.com/name/nm0053390","urlPhoto":"","biography":{"dateOfBirth":"22 February 1958","placeOfBirth":" Coventry, West Midlands, England, UK","height":"5' 8\" (1.73 m)","bio":"Gillian Barber was born on February 22, 1958 in Coventry, West Midlands, England. She is an actress, known for Jumanji (1995), Double Jeopardy (1999) and Cats & Dogs (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0053390","name":"Gillian Barber","idIMDB":"nm0053390"},"actorId":"nm0053390","character":"Myrtle Keeton","urlCharacter":"http://www.imdb.com/character/ch0186938","main":true}],"seasons":[],"idIMDB":"tt0107665","urlIMDB":"http://www.imdb.com/title/tt0107665","business":{"budget":null,"openingWeekend":[{"money":"$5,202,478","country":"USA","day":"29","month":"08","year":"1993","remarks":"1,963 Screens"}],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1992/\">1992</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr (120 min)","3 hr 3 min (183 min) (TV) (USA)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,415 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"Molly's Reach, 647 School Road, Gibsons, British Columbia, Canada"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1994","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Amanda Plummer","id":"nm0001625","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Actor","names":[{"name":"Max von Sydow","id":"nm0001884","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"J.T. Walsh","id":"nm0000687","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Actor","names":[{"name":"Max von Sydow","id":"nm0001884","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Amanda Plummer","id":"nm0001625","role":null}]}]}]}],"votes":"17,403","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040620","name":"Castle Rock Entertainment"},{"idCompany":"co0046718","name":"New Line Cinema"}],"keywords":{"keywords":["manipulation","occult","antique shop","based on novel","sheriff","devil","desire","prank","death","greed","pain","murder","small town","siren the alarm","supernatural power","good versus evil","watching television","evidence","rivalry","catfight","armor","gambler","painting","knife","reverend","scream","notebook","stadium","woods","sea","magician","hatred","river","village","forest","coastline","flat tire","beacon","waterfront","trap","police station","religion","stabbing","reference to new york yankees","scarecrow","baseball glove","horse racing","agony","roman catholic","objet d'art","collector","suicide","deputy","reference to whitey ford","thunder","baseball","reference to roy campanella","old man","hay","antique","farmer","pills","magic","police car","meat cleaver","remote control","shock","reference to robert louis stevenson","bartender","drunkenness","suspicion","little boy","bicycling","flashback","salesman","marriage proposal","artifact","fireplace","photograph","cigar smoking","gore","pet dog","flashlight","grand opening","candle","blood","gunshot","uniform","toast","phonograph record","crying","book","farm","toy","supernatural","turkey","bell","badge","bridge","waitress","banner","apology","necklace","anger","diner","pistol","rain","paranoia","covetousness","jukebox","slashed tire","arthritis","evil","embezzlement","church","bomb","explosion","shotgun","bar","feud","reference to mickey mantle","baseball card","vandalism","maine","dog","gambling debt","catholic priest","catholic","baptist","small town sheriff","cafe","pastor","priest","stranger in town","nightie","lighthouse","attempted child suicide","title appears in writing","based on the works of stephen king","second hand store","cult film","satanism","castle rock maine","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:46:33"}}