{"data":{"movies":[{"title":"Playboy: Farrah Fawcett, All of Me","originalTitle":"","year":"1997","releaseDate":"19970611","directors":[{"name":"Davis Factor","id":"nm2144664"},{"name":"Mark S. Manos","id":"nm0543622"}],"writers":[{"name":"Monica Ochoa","id":"nm0643758"}],"runtime":"71 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5OTk2Mjc3MV5BMl5BanBnXkFtZTcwMzQ4OTgxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary"],"plot":"At fifty years of age actress Farrah Fawcett reveals her body to the camera in this one off special.","simplePlot":"At fifty years of age actress Farrah Fawcett reveals her body to the camera in this one off special.","actors":[{"actorName":"Farrah Fawcett","urlProfile":"http://www.imdb.com/name/nm0000396","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE3OTAzMTQ3OF5BMl5BanBnXkFtZTcwODkyMDU4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1947","placeOfBirth":" Corpus Christi, Texas, USA","birthName":"Farrah Leni Fawcett","height":"5' 6\" (1.68 m)","bio":"Farrah Fawcett is a true Hollywood success story. A native of Texas, she was the daughter of Pauline Alice (Evans), a homemaker, and James Fawcett, an oil field contractor. She was a natural athlete, something that her father encouraged, and she attended a high school with a strong arts program. She attended University of Texas in Austin, graduating with a degree in Microbiology, but only wanted to be an actress. Winning a campus beauty contest got her noticed by an agent, who encouraged her to pursue acting. After graduating, she moved to Los Angeles and her healthy, all-American blond beauty was immediately noticed. She quickly got roles in various television commercials for such products as Ultra-Brite toothpaste, and Wella Balsam shampoo, and also made appearances in some TV series. In 1968, she met another Southerner, actor Lee Majors, star of the popular TV series The Big Valley (1965), on a blind date set up by their publicists. He became very taken with her and also used his own standing to promote her career. In 1969, she made her film debut in Love Is a Funny Thing (1969). The next year, she appeared in the film adaptation of the Gore Vidal bestselling novel Myra Breckinridge (1970). The shooting was very unpleasant, with much feuding on the set, and Farrah was embarrassed by the finished film, which was a major failure. But Farrah was undamaged and continued to win roles. In 1973, she and Majors married, and the following year, she won a recurring role in the crime series Harry O (1973). She had her first taste of major success when she won a supporting role in the science fiction film Logan's Run (1976). She came to the attention to the highly successful producer Aaron Spelling, who was impressed by her beauty and vivacious personality. That won her a role in the TV series Charlie's Angels (1976). She played a private investigator who works for a wealthy and mysterious businessman, along with two other glamorous female detectives, played by Kate Jackson and Jaclyn Smith. The show immediately became the most popular series on television, earning record ratings and a huge audience. All three actresses became very popular, but Farrah became by far the best known. She won People's Choice Award for Favorite Female Performer in a New TV program in 1977. Her lush, free-wheeling, wavy blond hair also became a phenomenon, with millions of women begging their hairstylists to give them \"The Farrah,\" as her hairstyle was called. Fawcett was also a savvy businesswoman, and she received 10% profit from the proceeds of her famous poster in a red swimsuit. It sold millions and she became the \"It Girl\" of the 1970s. Fawcett was America's sweetheart and found herself on every celebrity magazine and pursued by photographers and fans. While she enjoyed the success and got along well with her co-stars (both of whom were also of Southern origin), she found the material lightweight. Also, the long hours she worked were beginning to take a toll on her marriage to Majors, who found himself eclipsed by her popularity. So the following year, when the show was at its peak, she left to pursue a movie career. Charlie's Angels producers sued her, and the studios shied away from her, and she lost out on the lead role in the hit feature film Foul Play (1978) to Goldie Hawn. Eventually, she and the Charlie's Angels producers reached a settlement, where she would make guest appearances on the series. As a result of the negative publicity and some poor script choices, her career briefly hit a slow spot. In addition, she and Majors separated in 1979. She had starring roles in Somebody Killed Her Husband (1978), Sunburn (1979), and Saturn 3 (1980) (which she did a topless scene in), but all three failed financially. She appeared in the Burt Reynolds chase comedy The Cannonball Run (1981), which was successful financially, but it was met not only with bad reviews but also with bad publicity when Farrah's stunt double Heidi Von Beltz was involved in a stunt that went horribly wrong and left her a quadriplegic. Farrah's feature film career came to a halt, and she and Majors were drifting apart. In 1981, she met Ryan O'Neal, a friend of her husband's, and they began became friends and spent a great deal of time together. He also encouraged her to go back to television and she received good reviews in the well-received miniseries \"Murder in Texas\" (1981). In 1982, she filed for divorce, which Majors readily agreed to. Soon, she and O'Neal were a couple and moved in together. She set on sights on becoming a serious dramatic actress. She took over for Susan Sarandon in the stage play \"Extremities\" where she played a rape victim who turns the tables on her rapist. That, in turn, led her to her major comeback when she starred in the searing story of a battered wife in The Burning Bed (1984), based on a true story. It garnered a very large audience, and critics gave her the best reviews she had ever received for her heartfelt performance. She was nominated for both an Emmy and Golden Globe and also became involved in helping organizations for battered women. The following year, she and O'Neal became the parents of a son, 'Redmond O'Neal'. She tried to continue her momentum with a starring role in the feature film adaptation of Extremities (1986), and while she garnered a Golden Globe nomination, the film, itself, was not a hit. She continued to seek out serious roles, appearing mainly on television. She scored success again in Small Sacrifices (1989), again based on a true crime. Portraying an unhappy woman who is so obsessed with the man she loves that she shoots her children to make herself available and disguises it as a carjacking, Farrah again won rave reviews and helped draw a large audience, and was nominated for an Emmy again. Shortly afterwards, she and O'Neal co-starred in Good Sports (1991), playing a couple who co-star in a sports news program, but O'Neil's performance was lambasted and only 9 episodes were aired. In 1995, she surprised her fans by posing for \"Playboy\" at the age of 48, it became the magazine's best-selling issue of that decade. Her relationship with O'Neal was deteriorating, however, and in 1997, they broke up. The breakup took a toll, and she posed for Playboy again at the age of 50. To promote it, she appeared on Late Show with David Letterman (1993) and gave a rambling interview, sparking rumors of drug use. That same year, however, she made another comeback in The Apostle (1997), playing the neglected wife of a Pentacostal preacher, played by Robert Duvall. Both stars were praised and the film became a surprise hit. She also began dating James Orr, who had directed her earlier in the feature film Man of the House (1995). An incident occurred between them in 1998, and Farrah suffered injuries. The scandal drew nationwide headlines, especially after the tabloids published photos of Farrah with her injuries. The authorities compelled Fawcett to testify against Orr in court, and he was found guilty of assault and given a minimum sentence. Embarrassed, she lowered her profile and her career lost momentum, but she continued to work in television and films. She and O'Neal also started seeing each other again when he was diagnosed with leukemia. The new millennium brought her highs and lows. In 2000, she acted with Richard Gere in Robert Altman's film Dr. T & the Women (2000). Her son Redmond has had problems with drug abuse and has been in and out of jail. In 2001, she lost her only sister to cancer. In 2004, she received her third Emmy nomination for her performance in The Guardian (2003), and she starred in her own reality show titled \"Chasing Farrah\" in 2005 along with Ryan O'Neal, but that ended after only 7 episodes. That same year, she was devastated when her beloved mother died. In 2006, producer Aaron Spelling died, and she famously reunited with her Charlie's Angels co-stars Kate Jackson and Jaclyn Smith at the Emmys in a tribute to him. She looked tan and healthy, but soon, she was diagnosed with anal cancer. She asked her friend Alana Stewart to accompany her and videotape her during her doctor's visits. Those video journals resulted in the documentary \"Farrah's Story,\" co-executive produced by Fawcett. It aired in 2009, and viewers were shocked to see Farrah with a shaved head and in a continuous state of pain. Ryan O'Neal and Alana Stewart were constantly by her side, and her Charlie's Angels co-stars Kate Jackson and Jaclyn Smith also visited her, marking the final time that all three original angels appeared together on television. The documentary became a ratings success, and it earned a Emmy nomination as Outstanding Nonfiction Special. On June 25, 2009 Farrah lost her battle with cancer and passed away at aged 62. She left the bulk of her estate to her only son Redmond, and her trust fund allowed for the creation of The Farrah Fawcett Foundation, which provides funding for cancer research and prevention. Alana Stewart is the president of the Foundation and Jaclyn Smith's husband Dr. Brad Allen is one of the Board of Directors. Ryan O'Neal and Farrah's nephew Greg Walls are also on the Advisory Board, keeping alive her legacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE3OTAzMTQ3OF5BMl5BanBnXkFtZTcwODkyMDU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000396","name":"Farrah Fawcett","idIMDB":"nm0000396"},"actorId":"nm0000396","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Fawcett","urlProfile":"http://www.imdb.com/name/nm2147082","urlPhoto":"","biography":{"dateOfBirth":"14 October 1917","placeOfBirth":" USA","birthName":"James William Fawcett","bio":"James Fawcett was born on October 14, 1917 in the USA as James William Fawcett. He was married to Rosenda Sofia Fawcett and Pauline Fawcett. He died on August 23, 2010 in Houston, Texas, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2147082","name":"James Fawcett","idIMDB":"nm2147082"},"actorId":"nm2147082","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pauline Fawcett","urlProfile":"http://www.imdb.com/name/nm2039910","urlPhoto":"","biography":{"dateOfBirth":"30 January 1914","placeOfBirth":" Henryetta, Oklahoma, USA","birthName":"Pauline Alice Evans","bio":"Pauline Fawcett was born on January 30, 1914 in Henryetta, Oklahoma, USA as Pauline Alice Evans. She was an actress, known for Richard Simmons and the Silver Foxes: Fitness for Silver Citizens (1986) and Sunburn (1979). She was married to James Fawcett. She died on March 4, 2005 in Houston, Texas, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2039910","name":"Pauline Fawcett","idIMDB":"nm2039910"},"actorId":"nm2039910","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Majors","urlProfile":"http://www.imdb.com/name/nm0000516","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ1MTU4OTIxMF5BMl5BanBnXkFtZTgwNjQ1MTkxMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1939","placeOfBirth":" Wyandotte, Michigan, USA","birthName":"Harvey Lee Yeary","height":"5' 11\" (1.8 m)","bio":"Lee Majors was born on April 23, 1939 in Wyandotte, Michigan, USA as Harvey Lee Yeary. He is known for his work on The Fall Guy (1981), The Six Million Dollar Man (1974) and The Big Valley (1965). He has been married to Faith Majors since November 9, 2002. He was previously married to Karen Velez, Farrah Fawcett and Thelma Kathleen Robinson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ1MTU4OTIxMF5BMl5BanBnXkFtZTgwNjQ1MTkxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000516","name":"Lee Majors","idIMDB":"nm0000516"},"actorId":"nm0000516","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan O'Neal","urlProfile":"http://www.imdb.com/name/nm0641939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxOTMwMTI1N15BMl5BanBnXkFtZTcwOTUxMDkwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1941","placeOfBirth":" Los Angeles, California, USA","birthName":"Charles Samuel Eldridge Patrick Ryan O'Neal III","height":"6' 1\" (1.85 m)","bio":"Ryan O'Neal was born on April 20, 1941 in Los Angeles, California, USA as Charles Samuel Eldridge Patrick Ryan O'Neal III. He is an actor, known for Peyton Place (1964), Barry Lyndon (1975) and Paper Moon (1973). He was previously married to Leigh Taylor-Young and Joanna Moore.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxOTMwMTI1N15BMl5BanBnXkFtZTcwOTUxMDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641939","name":"Ryan O'Neal","idIMDB":"nm0641939"},"actorId":"nm0641939","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jaclyn Smith","urlProfile":"http://www.imdb.com/name/nm0000646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTUyMjA1NF5BMl5BanBnXkFtZTYwMzI2ODI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1945","placeOfBirth":" Houston, Texas, USA","birthName":"Jacquelyn Ellen Smith","height":"5' 7\" (1.7 m)","bio":"Jaclyn Smith was born Jaclyn Ellen Smith on October 26, 1945 in Houston, Texas. She graduated from high school and originally aspired to be a famous ballerina. In 1973, she landed a job as a Breck shampoo model. In 1976, she was offered a chance to star in a new pilot for a planned television series, entitled Charlie's Angels (1976). The pilot was slick and the show was an instant hit when it debuted on September 22, 1976 on ABC. Smith has the distinct honor of being the only Angel *not* to leave the show in its entire five-season run (1976-1981). After Charlie's Angels (1976), she went the TV-movie route and starred in such TV films as Jacqueline Bouvier Kennedy (1981) for which she received a Golden Globe nomination, and such miniseries as The Bourne Identity (1988), Rage of Angels (1983) and Windmills of the Gods (1988). She has had her own extremely successful clothing line at Kmart since 1985, and is often a spokesperson. Her first two marriages to actors Roger Davis and Dennis Cole ended in divorce. She has two children from her third marriage to cinematographer Anthony B. Richmond (they divorced in 1989). Her fourth marriage is to her father's physician Dr. Brad Allen. She married him in 1997 and they both created a skincare line.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTUyMjA1NF5BMl5BanBnXkFtZTYwMzI2ODI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000646","name":"Jaclyn Smith","idIMDB":"nm0000646"},"actorId":"nm0000646","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kate Jackson","urlProfile":"http://www.imdb.com/name/nm0000462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg2MDk5Mzg0OF5BMl5BanBnXkFtZTcwMjM2MTUzNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1948","placeOfBirth":" Birmingham, Alabama, USA","birthName":"Lucy Kate Jackson","height":"5' 8½\" (1.74 m)","bio":"Lucy Kate Jackson was born in Birmingham, AL on October 29.1948. She attended the University of Mississippi but left during her sophomore year to begin studying at the American Academy of Dramatic Arts. She was supporting cast on Dark Shadows (Daphne, 1970-1971) and on The Rookies (Jill Danko, 1972-1976). She starred as one of the original Angels (Sabrina Duncan, 1976-1979) on the mega-hit show Charlie's Angels. She delighted fans as the dauntless Amanda King in the television show \"Scarecrow and Mrs. King\" (1983-1987) which was partially owned by her production company, Shoot the Moon Enterprises. She appeared in numerous other film and television productions. She is an actor, director and producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg2MDk5Mzg0OF5BMl5BanBnXkFtZTcwMjM2MTUzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000462","name":"Kate Jackson","nicknames":["Katie"],"idIMDB":"nm0000462"},"actorId":"nm0000462","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Doyle","urlProfile":"http://www.imdb.com/name/nm0236329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjY5NjY4M15BMl5BanBnXkFtZTcwNDA1MTYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1929","placeOfBirth":" Lincoln, Nebraska, USA","birthName":"David Fitzgerald Doyle","bio":"David Fitzgerald Doyle was born in Lincoln, Nebraska December 1, 1929. He was the son of Mary Ruth Fitzgerald and Lewis Raymond (Lum) Doyle, a prominent Lincoln attorney. His maternal grandfather was John Fitzgerald, a prominent banker and railroad builder in Nebraska. His paternal grandfather was T. J. Doyle, also an attorney. He was one of three children, including brother John, an attorney, and sister Mary, an actress. He grew up in Lincoln and attended Cathedral grade school. He then went to Campion, a Jesuit prep school in Wisconsin. He made his acting debut at age six and played children's roles in local productions. He was a member of the Community Theater in Lincoln. He was in Life with Father (1947). Doyle entered the University of Nebraska in 1945 and he was expected to become a lawyer, as had four generations of Doyles. But the young Doyle preferred to spend him time in the theater department. A fellow classmate at the University of Nebraska was Johnny Carson. Doyle appeared frequently on his college buddy's late night talk show during the 1960s. Doyle ranked sixth in the state on his law school entrance exams. But the theater still called him and he chose acting over a career in law. He moved to New York after college. He got his break in 1956 when he replaced Walter Matthau in the Broadway production of Will Success Spoil Rock Hunter? (1957). His first wife, Rachel, died after injuries in a freak fall from a stairway in 1968. While doing a revival of \"South Pacific\" a year later, he met Anne Nathan and they were married. After Broadway, Doyle moved to California and was cast as Walt Fitzgerald in the television series, Bridget Loves Bernie (1972). A string of character roles followed, and Doyle is probably best remembered as the lovable private detective, Bosley, on the Charlie's Angels (1976) series. Doyle couldn't escape the legal profession and portrayed an attorney, Ted Holmes, on the daytime soap opera, General Hospital (1963) during 1986. Doyle is best remembered for his distinctive, raspy voice which earned him the voice role in several animated series and movies. He died of a heart attack in Los Angeles on February 26, 1997 at age 67.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjY5NjY4M15BMl5BanBnXkFtZTcwNDA1MTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236329","name":"David Doyle","idIMDB":"nm0236329"},"actorId":"nm0236329","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh M. Hefner","urlProfile":"http://www.imdb.com/name/nm0005005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzY1Mzk2OF5BMl5BanBnXkFtZTYwMDQxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1926","placeOfBirth":" Chicago, Illinois, USA","birthName":"Hugh Marston Hefner","height":"5' 9\" (1.75 m)","bio":"Hugh M. Hefner was born on April 9, 1926 in Chicago, Illinois, USA as Hugh Marston Hefner. He is a producer, known for The House Bunny (2008), Beverly Hills Cop II (1987) and Bettie Page Reveals All (2012). He has been married to Crystal Hefner since December 31, 2012. He was previously married to Kimberley Conrad and Mildred Williams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzY1Mzk2OF5BMl5BanBnXkFtZTYwMDQxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005005","name":"Hugh M. Hefner","nicknames":["Hef","Puffin"],"idIMDB":"nm0005005"},"actorId":"nm0005005","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Camille Paglia","urlProfile":"http://www.imdb.com/name/nm0656468","urlPhoto":"","biography":{"dateOfBirth":"2 April 1947","placeOfBirth":" Endicott, New York, USA","birthName":"Camille Anna Paglia","height":"5' 3\" (1.6 m)","bio":"Author, social critic, avowed feminist, and teacher Camille Anna Paglia was born on 2 April 1947 in Endicott, New York, to Pasquale and Lydia Paglia, who had immigrated to the United States from Italy. She has published \"Sexual Personae: Art and Decadence from Nefertiti to Emily Dickinson\", \"Sex, Art, and American Culture\", \"Vamps & Tramps: New Essays\", \"The Birds, a study of Alfred Hitchcock\" and \"Break, Blow, Burn: Camille Paglia Reads Forty-Three of the World's Best Poems\". She is a contributing editor at Interview magazine and has written articles on art, literature, popular culture, feminism, and politics for newspapers and magazines around the world. Paglia is a professor of humanities and media studies at the University of the Arts in Philadelphia. She is currently at work on a new collection of essays, among other things. She's also starred in the short film \"Dr. Paglia\" (1992), directed by Monika Treut.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0656468","name":"Camille Paglia","nicknames":["Hurricane Camille"],"idIMDB":"nm0656468"},"actorId":"nm0656468","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Mirisch","urlProfile":"http://www.imdb.com/name/nm2144390","urlPhoto":"","biography":{"bio":"David Mirisch is the president of David Mirisch Enterprises, an international promotional firm with an office in Los Angeles, California. His company has produced over 2,500 celebrity events, including more than 150 tennis tournaments 200 golf tournaments and 50 ski events that have raised more than $20,000,000 dollars for charities of all kinds. He has a list of more than 6,000 Hollywood personalities and well-known athletes who participate in many of his charity events which include golf, tennis, softball, snow-skiing, horseback riding, fishing, bowling, casino parties, dinner galas and variety shows. David has produced events in the United States, Canada, Mexico, Japan, Indonesia, Malaysia, Ecuador and The Bahamas. David is also a member of the famous Mirisch Film Company that has produced 72 feature films, won a total of 28 Academy Awards and Three Best Picture Awards. Their films have been nominated for 87 Academy Awards. Some of the films the Mirisch family has produced are Moby Dick, West Side Story, Fiddler on the Roof, The Great Scape, The Pink Panther, Somelike it Hot, In the Heat of the Night, Midway and The Magnificent Seven. Because he has been affiliated with the entertainment industry for more than 30 years, he has connections in all levels of the entertainment industry and commands the respect of people at all levels of agency, ownership and management at motion picture studios, television networks and distribution companies. He has also handled the public relations careers of more than 500 personalities including among many Merv Griffin, Omar Sharif, Johnny Mathis, Pat Boone, Lindsay Wagner, Raquel Welch, The Supremes and Perry Como. David is also responsible for discovering actress Farrah Fawcett in 1968.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2144390","name":"David Mirisch","idIMDB":"nm2144390"},"actorId":"nm2144390","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Bernstein","urlProfile":"http://www.imdb.com/name/nm0077070","urlPhoto":"","biography":{"dateOfBirth":"7 June 1936","placeOfBirth":" Oklahoma City, Oklahoma, USA","bio":"Jay Bernstein was born on June 7, 1936 in Oklahoma City, Oklahoma, USA. He was a producer and writer, known for The New Mike Hammer (1984), Mike Hammer, Private Eye (1997) and Murder Me, Murder You (1983). He was married to Cabrina Finn. He died on April 30, 2006 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0077070","name":"Jay Bernstein","idIMDB":"nm0077070"},"actorId":"nm0077070","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betty Grable","urlProfile":"http://www.imdb.com/name/nm0002107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDk3ODkwMl5BMl5BanBnXkFtZTYwMTEwNzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1916","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Elizabeth Ruth Grable","height":"5' 4\" (1.63 m)","bio":"Elizabeth Ruth Grable was born on December 18, 1916 in St. Louis, Missouri, to Lillian Rose (Hofmann) and John Charles Grable, a stockbroker. She had German, English, Irish, and Dutch ancestry. Her mother was a stubborn and materialistic woman who was determined to make her daughter a star. Elizabeth, who later became Betty, was enrolled in Clark's Dancing School at the age of three. With her mother's guidance, Betty studied ballet and tap dancing. At age 13, Betty and her mother set out for Hollywood with the hopes of stardom. Lillian lied about her daughter's age, and Ruth landed several minor parts in films in 1930, such as Whoopee! (1930), New Movietone Follies of 1930 (1930), Happy Days (1929) and Let's Go Places (1930). In 1932, she signed with RKO Radio Pictures. The bit parts continued for the next three years. Betty finally landed a substantial part in By Your Leave (1934). One of her big roles was in College Swing (1938). Unfortunately, the public did not seem to take notice. She was beginning to think she was a failure. The next year, she married former child star Jackie Coogan. His success boosted hers, but they divorced in 1940. When she landed the role of Glenda Crawford in Down Argentine Way (1940), the public finally took notice of this shining bright star. Stardom came through comedies such as Coney Island (1943) and Sweet Rosie O'Grady (1943). The public was enchanted with Betty. Her famous pin-up pose during World War II adorned barracks all around the world. With that pin-up and as the star of lavish musicals, Betty became the highest-paid star in Hollywood. After the war, her star continued to rise. In 1947, the United States Treasury Department noted that she was the highest paid star in America, earning about $300,000 a year - a phenomenal sum even by today's standards. Later, 20th Century-Fox, who had her under contract, insured her legs with Lloyds of London for a million dollars. Betty continued to be popular until the mid-1950s, when musicals went into a decline. Her last film was How to Be Very, Very Popular (1955). She then concentrated on Broadway and nightclubs. In 1965, she divorced band leader Harry James, whom she had wed in 1943. Betty Grable died at age 56 of lung cancer on July 2, 1973 in Santa Monica, California. Her life was an active one, devoid of the scandals that plagued many stars in one way or another. In reality, she cared for her family and the family life more than stardom. In that way, she was a true star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDk3ODkwMl5BMl5BanBnXkFtZTYwMTEwNzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002107","name":"Betty Grable","nicknames":["The Girl With the Million Dollar Legs","The Pin-Up Girl","America's Ideal Girl","The Quicksilver Blonde"],"idIMDB":"nm0002107"},"actorId":"nm0002107","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rita Hayworth","urlProfile":"http://www.imdb.com/name/nm0000028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTk1NTQ1M15BMl5BanBnXkFtZTcwMjI1MDAwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1918","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Margarita Carmen Cansino","height":"5' 6\" (1.68 m)","bio":"Spanish dancer Eduardo Cansino's daughter Margarita studied dancing beginning in her girlhood. At age 12, the mature-looking Rita joined Eduardo's stage act, in which she was spotted three years later by Fox studio head Winfield R. Sheehan, leading to her first studio contract and film debut at age 16 in Dante's Inferno (1935). Fox dropped her after five small roles, but expert, exploitative promotion by her first husband Edward Judson soon brought Rita a new contract at Columbia Pictures, where studio head Harry Cohn changed her surname to Hayworth and approved raising her hairline by electrolysis. After 13 mainly minor roles, Columbia lent her to Warner Bros. for her first big success, The Strawberry Blonde (1941); her splendid dancing with Fred Astaire in You'll Never Get Rich (1941) made her a star. In person Rita was shy, quiet and unassuming; only when the cameras rolled did she turn on the explosive sexual charisma that in Gilda (1946) made her a superstar. To Rita, though, domestic bliss was a more important, if elusive, goal, and in 1949 she interrupted her career for marriage - unfortunately an unhappy one almost from the start - to the playboy Prince Aly Khan. Her films after her divorce from Khan include perhaps her best straight acting performances, Miss Sadie Thompson (1953) and They Came to Cordura (1959). Beginning in 1960 (age 42), early onset of Alzheimer's disease (undiagnosed until 1980) limited Rita's ability. The last few roles in her 60-film career were increasingly small. Almost helpless by 1981, Rita was cared for by her daughter Yasmin Khan until her death at age 68.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTk1NTQ1M15BMl5BanBnXkFtZTcwMjI1MDAwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000028","name":"Rita Hayworth","nicknames":["The Love Goddess"],"idIMDB":"nm0000028"},"actorId":"nm0000028","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aaron Spelling","urlProfile":"http://www.imdb.com/name/nm0005455","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjY3Mjk0OV5BMl5BanBnXkFtZTYwMDE0OTkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1923","placeOfBirth":" Dallas, Texas, USA","bio":"Aaron Spelling graduated from Southern Methodist University in Dallas, Texas, with a Bachelor of Arts Degree. Before that, he attended Forest Avenue High. He started as a writer and sold his first script to Jane Wyman Presents The Fireside Theatre (1955). He wrote for various television shows, including Playhouse 90 (1956). After he wrote his first pilot he became a producer for Four Star Productions. He partnered with Danny Thomas and formed Thomas-Spelling Productions. In 1972 he formed Aaron Spelling Productions, and then joined with Leonard Goldberg for Spelling-Goldberg Productions. In 1986 his company went public and formed Spelling Entertainment, Inc. In 1995, he became vice-chairman of Spelling Entertainment, Inc., and chairman of Spelling Television, a subsidiary. Spelling Entertainment owns World Vision (syndication), Hamilton Projects and Republic Pictures. It also owns a software company called Virgin Interactive. Hamilton Projects handles merchandising for Spelling's shows. The main office is located at 5700 Wilshire Blvd, Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjY3Mjk0OV5BMl5BanBnXkFtZTYwMDE0OTkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005455","name":"Aaron Spelling","idIMDB":"nm0005455"},"actorId":"nm0005455","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0123835","urlIMDB":"http://www.imdb.com/title/tt0123835","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 11 min (71 min)"],"soundMix":["Stereo"],"color":["Black and White","Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.3","filmingLocations":[],"rated":"R","awards":[],"votes":"119","type":"Video","companyCreditsSimple":[{"idCompany":"co0065641","name":"Playboy Video Enterprises"}],"keywords":{"keywords":["actress","photograph","erotica","bare breasts","hugh hefner","female rear nudity","tv star","tv show","television","television series","swimsuit","pubic hair","posing nude","photography","photographer","photo studio","paint","painting","nude photo shoot","nude modeling","movie star","movie actress","film star","film actress","controversy","brunette","body paint","body painting","blonde","1990s","1980s","1970s","1960s","stripping","female frontal nudity","sensuality","nudity","nipples","female nudity","playboy magazine","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:44:33"}}