{"data":{"movies":[{"title":"Dead Man","originalTitle":"","year":"1995","releaseDate":"19960510","directors":[{"name":"Jim Jarmusch","id":"nm0000464"}],"writers":[{"name":"Jim Jarmusch","id":"nm0000464"}],"runtime":"121 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTJlZmQ1OTAtODQzZi00NGIzLWI1MmEtZGE4NjFlOWRhODIyXkEyXkFqcGdeQXVyNTc1NTQxODI@._V1.jpg","countries":["USA","Germany","Japan"],"languages":["English","Cree"],"genres":["Drama","Fantasy","Western"],"plot":"Dead Man is the story of a young man's journey, both physically and spiritually, into very unfamiliar terrain. William Blake travels to the extreme western frontiers of America sometime in the 2nd half of the 19th century. Lost and badly wounded, he encounters a very odd, outcast Native American, named \"Nobody\", who believes Blake is actually the dead English poet of the same name. The story, with Nobody's help, leads William Blake through situations that are in turn comical and violent. Contrary to his nature, circumstances transform Blake into a hunted outlaw, a killer, and a man whose physical existence is slowly slipping away. Thrown into a world that is cruel and chaotic, his eyes are opened to the fragility that defines the realm of the living. It is as though he passes through the surface of a mirror, and emerges into a previously-unknown world that exists on the other side.","simplePlot":"On the run after murdering a man, accountant William Blake encounters a strange North American man named Nobody who prepares him for his journey into the spiritual world.","actors":[{"actorName":"Johnny Depp","urlProfile":"http://www.imdb.com/name/nm0000136","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1963","placeOfBirth":" Owensboro, Kentucky, USA","birthName":"John Christopher Depp II","height":"5' 10\" (1.78 m)","bio":"Johnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15, and fronted a series of music-garage bands, including one named 'The Kids'. However, it was when he married Lori Anne Allison (Lori A. Depp) that he took up the job of being a ballpoint-pen salesman to support himself and his wife. A visit to Los Angeles, California, with his wife, however, happened to be a blessing in disguise, when he met up with actor Nicolas Cage, who advised him to turn to acting, which culminated in Depp's film debut in the low-budget horror film, A Nightmare on Elm Street (1984), where he played a teenager who falls prey to dream-stalking demon Freddy Krueger. In 1987 he shot to stardom when he replaced Jeff Yagher in the role of undercover cop Tommy Hanson in the popular TV series 21 Jump Street (1987). In 1990, after numerous roles in teen-oriented films, his first of a handful of great collaborations with director Tim Burton came about when Depp played the title role in Edward Scissorhands (1990). Following the film's success, Depp carved a niche for himself as a serious, somewhat dark, idiosyncratic performer, consistently selecting roles that surprised critics and audiences alike. He continued to gain critical acclaim and increasing popularity by appearing in many features before re-joining with Burton in the lead role of Ed Wood (1994). In 1997 he played an undercover FBI agent in the fact-based film Donnie Brasco (1997), opposite Al Pacino; in 1998 he appeared in Fear and Loathing in Las Vegas (1998), directed by Terry Gilliam; and then, in 1999, he appeared in the sci-fi/horror film The Astronaut's Wife (1999). The same year he teamed up again with Burton in Sleepy Hollow (1999), brilliantly portraying Ichabod Crane. Depp has played many characters in his career, including another fact-based one, Insp. Fred Abberline in From Hell (2001). He stole the show from screen greats such as Antonio Banderas in the finale to Robert Rodriguez's \"mariachi\" trilogy, Once Upon a Time in Mexico (2003). In that same year he starred in the marvelous family blockbuster Pirates of the Caribbean: The Curse of the Black Pearl (2003), playing a character that only the likes of Depp could pull off: the charming, conniving and roguish Capt. Jack Sparrow. The film's enormous success has opened several doors for his career and included an Oscar nomination. He appeared as the central character in the Stephen King-based movie, Secret Window (2004); as the kind-hearted novelist James Barrie in the factually-based Finding Neverland (2004), where he co-starred with Kate Winslet; and Rochester in the British film, The Libertine (2004). Depp collaborated again with Burton in a screen adaptation of Roald Dahl's novel, Charlie and the Chocolate Factory (2005), and later in Alice in Wonderland (2010) and Dark Shadows (2012). Off-screen, Depp has dated several female celebrities, and has been engaged to Sherilyn Fenn, Jennifer Grey, Winona Ryder and Kate Moss. He was married to Lori Anne Allison in 1983, but divorced her in 1985. Depp has two children with French singer/actress Vanessa Paradis: Lily-Rose Melody, born in 1999 and Jack, born in 2002. He married actress/producer Amber Heard in 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000136","name":"Johnny Depp","nicknames":["Mr. Stench","Colonel"],"idIMDB":"nm0000136"},"actorId":"nm0000136","character":"William Blake","urlCharacter":"http://www.imdb.com/character/ch0007124","main":true},{"actorName":"Gary Farmer","urlProfile":"http://www.imdb.com/name/nm0001200","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQzNTcyNzg1M15BMl5BanBnXkFtZTcwMTA5OTgyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1953","placeOfBirth":" Ohsweken, Ontario, Canada","birthName":"Gary Dale Farmer","height":"6' 2½\" (1.89 m)","bio":"Gary Dale Farmer is a Canadian character actor with plenty of character. With over 100 Film and TV appearances attached to his resume, and plenty more in the pipeline, Gary has shown he can adapt easily to any genre when necessary. He was born in Ohsweken, Ontario, into the Cayuga nation and Wolf Clan, and studied photography and Film at both the Syracuse University and Ryerson Polytechnic University. He then began a successful career as an actor, first taking small roles in movies such as Police Academy (1984), the John Schlesinger film The Believers (1987) with Martin Sheen, the Matt Dillon vehicle, The Big Town (1987), and Renegades (1989) starring Kiefer Sutherland and Lou Diamond Phillips. By the early 1990s, Gary was starring in more substantial roles. He portrayed Cowboy Dashee in the Robert Redford- produced thriller, The Dark Wind (1991) - again opposite Lou Diamond Phillips","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQzNTcyNzg1M15BMl5BanBnXkFtZTcwMTA5OTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001200","name":"Gary Farmer","idIMDB":"nm0001200"},"actorId":"nm0001200","character":"Nobody","urlCharacter":"http://www.imdb.com/character/ch0007135","main":true},{"actorName":"Crispin Glover","urlProfile":"http://www.imdb.com/name/nm0000417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDQ1NzE2MF5BMl5BanBnXkFtZTcwODg1NjU4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1964","placeOfBirth":" New York City, New York, USA","birthName":"Crispin Hellion Glover","height":"5' 10\" (1.78 m)","bio":"While he's never been a typical leading man, Crispin Glover has distinguished himself as one of the most intriguing personalities in the movie business. His unusual characters and personal projects have inspired a cult-like following that has dubbed him both madman and genius. The son of actor Bruce Glover, Crispin Hellion Glover was born in New York City and raised in Southern California. He picked up his father's trade while still in elementary school--by age 13, he already had an agent scouting out parts. A lead in a stage production of \"The Sound of Music\" (starring Florence Henderson) led to guest spots on the TV shows Happy Days (1974), Hill Street Blues (1981) and Family Ties (1982), which in turn led to roles in made-for-TV movies. The adolescent Glover felt \"confined\" by TV work, however, so he opted to stick to movie parts. He made his big-screen debut in the teen hi-jinx movie in My Tutor (1983), then followed up with a supporting role in Friday the 13th: The Final Chapter (1984). Glover's most defining Hollywood moment happened the next year, when he appeared as George McFly (Michael J. Fox's father) in the instant classic Back to the Future (1985). The underdog character struck a chord with moviegoers. Oddly enough, the actor delivered one of his favorite performances around the same time - playing a small-town kid obsessed with Olivia Newton-John in the indie The Orkly Kid (1985)--but the smaller film was completely overshadowed by his commercial success. Glover did, however, receive critical praise for his next indie role, a starring turn as a high-strung murder witness in River's Edge (1986). Glover and the producers did not come to a financial agreement for him to reprise the role of George McFly in Back to the Future Part II (1989). The producers brought the character back to life by splicing together archived footage and new scenes (using an actor in prosthetic makeup). Glover, who hadn't given permission for his likeness to be used, sued the film's producer, Steven Spielberg, and won. The case prompted the Screen Actors Guild to devise new regulations about the use of actors' images. In 1990 Glover teamed up with fellow eccentric David Lynch to play the maniacal Cousin Dell in Wild at Heart (1990). He filled the next decade with similarly quirky, peripheral roles, including a turn as Andy Warhol in The Doors (1991) and a cameo as a train fireman in Jim Jarmusch's Dead Man (1995). His small but memorable appearances in films like What's Eating Gilbert Grape (1993), Even Cowgirls Get the Blues (1993) and The People vs. Larry Flynt (1996) often outshone the main action. When he's not stealing scenes from Hollywood hotshots, Glover pours his considerable energy into other creative endeavors. He wrote his first book, \"Billow Rock\", before age 18, and since then he's gone on to create a library of peculiar titles (several of which have been published through his family's Volcanic Eruptions press). Among his most famous volumes are \"Rat Catching\" and \"Oak-Mot\", both Victorian-era stories updated with macabre illustrations and cut-up text. In 1989 he released an album of spoken word readings and cover tunes (including a rendition of \"These Boots Are Made for Walkin'\") entitled \"The Big Problem [does not equal] the Solution. The Solution = Let it be.\" In 1995 Glover began shooting his directorial debut, What Is It? (2005), a surreal film populated entirely by actors with Down's Syndrome. He tours with the film and it's sequel It is fine. Everything is fine! and his show, \"Crispin Hellion Glover's Big Slide Show,\" which is a one hour dramatic narration of eight different profusely illustrated books. The artist in Glover has been said to be inspired by \"the aesthetic of discomfort,\" a theme which seems to have been carried over into an artistic public performance on David Letterman's NBC show in 1987, Glover emerged wearing a wig and platform shoes, then delivered a swift kick toward Letterman's head that prompted the producers to cut to a commercial. Late 2000 saw him hitting the multiplex with roles in Nurse Betty (2000) and Charlie's Angels (2000), and the titular Willard (2003). He re-teamed with Back to the Future director Robert Zemeckis as Grendel in Beowulf (2007) and has worked with Johnny Depp for the third time in Tim Burton's Alice in Wonderland (2010). Other Glover projects loom on the not-too-distant horizon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDQ1NzE2MF5BMl5BanBnXkFtZTcwODg1NjU4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000417","name":"Crispin Glover","idIMDB":"nm0000417"},"actorId":"nm0000417","character":"Train Fireman","urlCharacter":"http://www.imdb.com/character/ch0007126","main":true},{"actorName":"Lance Henriksen","urlProfile":"http://www.imdb.com/name/nm0000448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1940","placeOfBirth":" New York City, New York, USA","birthName":"Lance James Henriksen","height":"5' 10¼\" (1.79 m)","bio":"An intense, versatile actor as adept at playing clean-cut FBI agents as he is psychotic motorcycle-gang leaders, who can go from portraying soulless, murderous vampires to burned-out, world-weary homicide detectives, Lance Henriksen has starred in a variety of films that have allowed him to stretch his talents just about as far as an actor could possibly hope. He played \"Awful Knoffel\" in the TNT original movie Evel Knievel (2004), directed by John Badham and executive produced by Mel Gibson. Henriksen portrayed \"Awful Knoffel\" in this project based on the life of the famed daredevil, played by George Eads. Henriksen starred for three seasons (1996-1999) on Millennium (1996), Fox-TV's critically acclaimed series created by Chris Carter (The X-Files (1993)). His performance as Frank Black, a retired FBI agent who has the ability to get inside the minds of killers, landed him three consecutive Golden Globe nominations for \"Best Performance by a Lead Actor in a Drama Series\" and a People's Choice Award nomination for \"Favorite New TV Male Star\". Henriksen was born in New York City. His mother, Margueritte, was a waitress, dance instructor, and model. His father, James Marin Henriksen, who was from Tønsberg, Norway, was a boxer and merchant sailor. Henriksen studied at the Actors Studio and began his career off-Broadway in Eugene O'Neill's \"Three Plays of the Sea.\" One of his first film appearances was as an FBI agent in Sidney Lumet's Dog Day Afternoon (1975), followed by parts in Lumet's Network (1976) and Prince of the City (1981). He then appeared in Steven Spielberg's Close Encounters of the Third Kind (1977) with Richard Dreyfuss and François Truffaut, Damien: Omen II (1978) and in Philip Kaufman's The Right Stuff (1983), in which he played Mercury astronaut Capt. Wally Schirra. James Cameron cast Henriksen in his first directorial effort, Piranha Part Two: The Spawning (1981), then used him again in The Terminator (1984) and as the android Bishop in the sci-fi classic Aliens (1986). Sam Raimi cast Henriksen as an outrageously garbed gunfighter in his quirky western Mort ou vif (1995). Henriksen has also appeared in what has developed into a cult classic: Kathryn Bigelow's Near Dark (1987), in which he plays the head of a clan of murderous redneck vampires. He was nominated for a Golden Satellite Award for his portrayal of Abraham Lincoln in the TNT original film The Day Lincoln Was Shot (1998). In addition to his abilities as an actor, Henriksen is an accomplished painter and potter. His talent as a ceramist has enabled him to create some of the most unusual ceramic artworks available on the art market today. He resides in Southern California with his wife Jane and their five-year-old daughter Sage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000448","name":"Lance Henriksen","idIMDB":"nm0000448"},"actorId":"nm0000448","character":"Cole Wilson","urlCharacter":"http://www.imdb.com/character/ch0007128","main":true},{"actorName":"Michael Wincott","urlProfile":"http://www.imdb.com/name/nm0000699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MTI2NzM3MV5BMl5BanBnXkFtZTgwMjEwNzYxMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1958","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Michael Anthony Claudio Wincott","height":"5' 9\" (1.75 m)","bio":"Over more than thirty years, Michael Wincott has gained the reputation of a respected and uncompromising actor. Born in Scarborough, Ontario, he eventually moved to New York City where he graduated from Juilliard in 1986 and began a relationship with Joseph Papp's Public Theatre beginning with his creation of the role of Kent in Eric Bogosian's Talk Radio. (He reprised the role for Oliver Stone's Talk Radio (1988)). He last appeared onstage in New York opposite John Malkovich in Sam Shepard's States of Shock originating the role of Stubbs. He has worked with some of cinema's most gifted contributors including Julian Schnabel, Sean Penn, Gary Oldman, Jim Jarmusch, Robert De Niro, Gérard Depardieu, Benicio Del Toro and Javier Bardem. He wants to do a film with Isabelle Huppert in Paris. Then perhaps live there.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MTI2NzM3MV5BMl5BanBnXkFtZTgwMjEwNzYxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000699","name":"Michael Wincott","idIMDB":"nm0000699"},"actorId":"nm0000699","character":"Conway Twill","urlCharacter":"http://www.imdb.com/character/ch0007130","main":true},{"actorName":"Eugene Byrd","urlProfile":"http://www.imdb.com/name/nm0126021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjQyNjU5M15BMl5BanBnXkFtZTcwMjE0MDMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1975","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Eugene Byrd was born on August 28, 1975 in Philadelphia, Pennsylvania, USA. He is an actor and producer, known for 8 Mile (2002), Dead Man (1995) and Sleepers (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjQyNjU5M15BMl5BanBnXkFtZTcwMjE0MDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126021","name":"Eugene Byrd","idIMDB":"nm0126021"},"actorId":"nm0126021","character":"Johnny 'The Kid' Pickett","urlCharacter":"http://www.imdb.com/character/ch0007133","main":true},{"actorName":"John Hurt","urlProfile":"http://www.imdb.com/name/nm0000457","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTgyMTAyOV5BMl5BanBnXkFtZTcwMTE4MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1940","placeOfBirth":" Chesterfield, Derbyshire, England, UK","birthName":"John Vincent Hurt","height":"5' 9\" (1.75 m)","bio":"This transatlantic talent was born John Vincent Hurt on January 22, 1940 in Shirebrook, a coal mining village near the busy market town of Chesterfield, in Derbyshire, England. He is the son of Phyllis (Massey), an engineer and one-time actress, and Arnould Herbert Hurt, an Anglican clergyman and mathematician. The youngest of three children, he spent much of his childhood in solitude. Demonstrating little initiative, he was guided into art as a possible direction. The family moved to Grimsby when he turned twelve and, despite an active early passion in acting, his parents thought less of it and enrolled him at the Grimsby Art School and St. Martin's School of Art where he showed some flourish. When he couldn't manage to get another scholarship to art school, his focus invariably turned to acting. Accepted into the Royal Academy of Dramatic Art, John made his stage debut in 1962 and remained there in typically offbeat form such plays as \"Infanticide in the House of Fred Ginger\". An odd, somber, pasty-looking fellow with an aquiline nose (injured while playing sports) and a mass of Irish freckles, he was hardly leading man material. His earlier focus as a painter, however, triggered a keen skill in the art of observation and it certainly advanced his talent for getting into the skin of his characters. His movie debut occurred that same year with a supporting role in the ill-received British \"angry young man\" drama Young and Willing (1962). Appearing in various mediums, John increased his profile (and respect) appearing in such theatre plays as \"Inadmissible Evidence\" (1965), \"Little Malcolm and His Struggle Against the Eunuchs\" (1966), a role he later took to film as Little Malcolm and His Struggle Against the Eunuchs (1974), \"Macbeth\" (as Malcolm) (1967) and \"Man and Superman\" (1969), while finding prime parts in such films as A Man for All Seasons (1966), a role he was given after director Fred Zinnemann saw his stellar work in \"Little Malcolm.\" He continued on the stage as an unlikely Romeo in 1973, and went on to garner great applause in Pinter's \"The Caretaker\" and \"The Dumb Waiter\", as well as \"Travesties\" (1974). It was TV, however, that displayed the full magnitude and fearless range of his acting instrument. In the mid-70s he gained widespread acclaim for his embodiment of the tormented gay writer and raconteur Quentin Crisp in the landmark TV play The Naked Civil Servant (1975), adapted from Crisp's autobiography. Way, way ahead of its time, Hurt's bold and unabashed take on the flamboyant and controversial gent who dared to be different was rewarded with the Emmy and the British TV Awards. Far and away one of the most marvelous creations ever captured on the small screen, he was altogether unsettling, unappetizing and unforgettable. Audiences cringed but were mesmerized at the same time -- like a car wreck. He WAS Quentin Crisp. Doors immediately opened for John. He was handed the best parts film and TV had to offer. Once again he was strikingly disturbing as the cruel and crazed Roman emperor Caligula in the epic TV masterpiece I, Claudius (1976). The chameleon in him then displayed a polar side as the gentle, pathetically disfigured title role in The Elephant Man (1980), and when he morphed into the role of a tortured Turkish prison inmate who befriends Brad Davis in the intense drama Midnight Express (1978), he was barely recognizable. The last two films earned Hurt Oscar nominations. Mainstream box-office films were offered as well as art films. He made the most of his role as a crew member whose body becomes host to an unearthly predator in Alien (1979). Who can forget the film's most notorious scene as the creature explodes from Hurt's stomach and scurries away into the bowels of the spaceship? Along with fame, of course, came a few misguided ventures generally unworthy of his talent. Such brilliant work as his steeple chase jockey in Champions (1984) or kidnapper in The Hit (1984) was occasionally offset by such drivel as the comedy misfire Partners (1982) with 'Ryan O'Neal (I)' in which Hurt looked enervated and embarrassed. But those were very few and far between. As for the past couple of decades, the craggy-faced actor continues to draw extraordinary notices. Tops on the list includes his prurient governmental gadfly who triggers the Christine Keeler political sex scandal in the aptly-titled Scandal (1989); the cultivated gay writer aroused and obsessed with struggling \"pretty-boy\" actor Jason Priestley in Love and Death on Long Island (1997); and the Catholic priest embroiled in the Rwanda atrocities in Beyond the Gates (2005). His rich tones have also been tapped into frequently with a number of animated features and documentaries, often serving as narrator. Presently married to his fourth wife, genius is often accompanied by a darker, more self-destructive side and Hurt was no exception with alcohol being his choice of poison. He has since recovered. He has two children from his third wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTgyMTAyOV5BMl5BanBnXkFtZTcwMTE4MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000457","name":"John Hurt","idIMDB":"nm0000457"},"actorId":"nm0000457","character":"John Scholfield","urlCharacter":"http://www.imdb.com/character/ch0073635","main":true},{"actorName":"Robert Mitchum","urlProfile":"http://www.imdb.com/name/nm0000053","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI1NDIxOTQyMV5BMl5BanBnXkFtZTYwMDM4MjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1917","placeOfBirth":" Bridgeport, Connecticut, USA","birthName":"Robert Charles Durman Mitchum","height":"6' 1\" (1.85 m)","bio":"Robert Mitchum was an underrated American leading man of enormous ability, who sublimated his talents beneath an air of disinterest. He was born in Bridgeport, Connecticut, to Ann Harriet (Gunderson), a Norwegian immigrant, and James Thomas Mitchum, a shipyard/railroad worker. His father died in a train accident when he was two, and Robert and his siblings (including brother John Mitchum, later also an actor) were raised by his mother and stepfather (a British army major) in Connecticut, New York, and Delaware. An early contempt for authority led to discipline problems, and Mitchum spent good portions of his teen years adventuring on the open road. On one of these trips, at the age of 14, he was charged with vagrancy and sentenced to a Georgia chain gang, from which he escaped. Working a wide variety of jobs (including ghostwriter for astrologist Carroll Righter), Mitchum discovered acting in a Long Beach, California, amateur theater company. He worked at Lockheed Aircraft, where job stress caused him to suffer temporary blindness. About this time he began to obtain small roles in films, appearing in dozens within a very brief time. In 1945, he was cast as Lt. Walker in Story of G.I. Joe (1945) and received an Oscar nomination as Best Supporting Actor. His star ascended rapidly, and he became an icon of 1940s film noir, though equally adept at westerns and romantic dramas. His apparently lazy style and seen-it-all demeanor proved highly attractive to men and women, and by the 1950s, he was a true superstar despite a brief prison term for marijuana usage in 1949, which seemed to enhance rather than diminish his \"bad boy\" appeal. Though seemingly dismissive of \"art,\" he worked in tremendously artistically thoughtful projects such as Charles Laughton's The Night of the Hunter (1955) and even co-wrote and composed an oratorio produced at the Hollywood Bowl by Orson Welles. A master of accents and seemingly unconcerned about his star image, he played in both forgettable and unforgettable films with unswerving nonchalance, leading many to overlook the prodigious talent he can bring to a project that he finds compelling. He moved into television in the 1980s as his film opportunities diminished, winning new fans with The Winds of War (1983) and War and Remembrance (1988). His sons James Mitchum and Christopher Mitchum are actors, as is his grandson Bentley Mitchum. His last film was James Dean: Live Fast, Die Young (1997) with Casper Van Dien as James Dean.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI1NDIxOTQyMV5BMl5BanBnXkFtZTYwMDM4MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000053","name":"Robert Mitchum","nicknames":["Mitch","Old Rumple Eyes","Bob"],"idIMDB":"nm0000053"},"actorId":"nm0000053","character":"John Dickinson","urlCharacter":"http://www.imdb.com/character/ch0037769","main":true},{"actorName":"Iggy Pop","urlProfile":"http://www.imdb.com/name/nm0006563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDQzNzA4Ml5BMl5BanBnXkFtZTcwNTc0NzM5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1947","placeOfBirth":" Ann Arbor, Michigan, USA","birthName":"James Newell Osterberg Jr.","height":"5' 6\" (1.68 m)","bio":"Legendary Rock 'n' Roll wildman and substance abuser. Recorded a series of classic rock albums with The Stooges and later as a solo artist. Worked extensively with David Bowie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDQzNzA4Ml5BMl5BanBnXkFtZTcwNTc0NzM5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006563","name":"Iggy Pop","nicknames":["The Iguana","The Godfather of Punk","Jimmy"],"idIMDB":"nm0006563"},"actorId":"nm0006563","character":"Salvatore 'Sally' Jenko","urlCharacter":"http://www.imdb.com/character/ch0007132","main":true},{"actorName":"Gabriel Byrne","urlProfile":"http://www.imdb.com/name/nm0000321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzE1ODA1Ml5BMl5BanBnXkFtZTcwODY3MjU5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Dublin, Ireland","birthName":"Gabriel James Byrne","height":"5' 10\" (1.78 m)","bio":"Byrne was the first of six children, born in Dublin, Ireland. His father was a cooper and his mother a hospital worker. He was raised Catholic and educated by the Irish Christian Brothers. He spent five years of his childhood in a seminary training to be a Catholic priest. He later said, \"I spent five years in the seminary and I suppose it was assumed that you had a vocation. I have realized subsequently that I didn't have one at all. I don't believe in God. But I did believe at the time in this notion that you were being called.\" He attended University College Dublin, where he studied archeology and linguistics, and became proficient in Irish. He played football (soccer) in Dublin with the Stella Maris Football Club. Byrne worked in archeology after he left UCD but maintained his love of his language, writing Draíocht (Magic), the first drama in Irish on Ireland's national Irish television station, TG4, in 1996. He discovered his acting ability as a young adult. Before that he worked at several occupations which included being an archaeologist, a cook, a bullfighter, and a Spanish schoolteacher. He begin acting when he was 29. He began on stage at the Focus Theatre and the Abbey Theatre in Dublin, later he joined the Royal Court Theatre and the Royal National Theatre in London. Byrne came to prominence on the final season of the Irish television show The Riordans, later starring in the spin-off series, Bracken. He made his film début in 1981 as Lord Uther Pendragon in John Boorman's King Arthur epic, Excalibur. Byrne is featured as therapist Dr. Paul Weston in the critically acclaimed HBO series In Treatment (2008). In his return to theater in 2008, he appeared as King Arthur in Lerner and Loewe's Camelot with the New York Philharmonic which was featured in a PBS broadcast in the Live From Lincoln Center series in May of 2008. Byrne did not visit America until he was 37. In 1988, Byrne married actress Ellen Barkin with whom he has two children. The couple separated amicably in 1993 and divorced in 1999. Byrne resides in Brooklyn, New York. In November 2004, Byrne was appointed a UNICEF Ireland Ambassador. In 2007 Byrne was presented with the first of the newly created Volta awards at the 5th Jameson Dublin International Film Festival. This was for lifetime achievement in acting. He also received the Honorary Patronage of the University Philosophical Society, of Trinity College, Dublin on February 20, 2007. He was awarded an honorary degree in late 2007 by the National University of Ireland, Galway, in recognition of Byrne's \"outstanding contribution to Irish and international film\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzE1ODA1Ml5BMl5BanBnXkFtZTcwODY3MjU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000321","name":"Gabriel Byrne","idIMDB":"nm0000321"},"actorId":"nm0000321","character":"Charlie Dickinson","urlCharacter":"http://www.imdb.com/character/ch0073634","main":true},{"actorName":"Jared Harris","urlProfile":"http://www.imdb.com/name/nm0364813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ3MDYwM15BMl5BanBnXkFtZTcwNTE5MjQ1Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1961","placeOfBirth":" London, England, UK","birthName":"Jared Francis Harris","height":"5' 11¾\" (1.82 m)","bio":"Jared Francis Harris was born in London, England. He is the son of Irish actor Richard Harris and Welsh actress Elizabeth Harris (Elizabeth Rees), and brother of Damian Harris and Jamie Harris. Despite his lineage, Jared showed little interest in becoming an actor, until he was cast in a college production while attending North Carolina's Duke University (USA), where he studied drama and literature, in the early 1980s. After graduation, Jared returned to the UK where he attended Central School of Speech and Drama, along such future stars as Jason Isaacs and James Nesbitt. After graduation, Jared joined the Royal Shakespeare Company, performing in Mark Rylance's Hamlet, Romeo & Juliet, the Silent Woman and A Clockwork Orange. In 1989, he had his screen debut in The Rachel Papers (1989). In 1990, while on vacation in New York, Jared auditioned for the role of Hotspur in Henry IV part 1, which he played at the New York Shakespeare Festival. Still in New York, Jared appeared in the off-Broadway play Ecstasy, for which he won an Obie Award in 1992. In 1996, he won recognition by playing famous pop artist Andy Warhol in I Shot Andy Warhol (1996). After that success, Jared has gone on to many independent films, with a few titles being: Natural Born Killers (1994), Smoke (1995), Happiness (1998), Comment tuer le chien de son voisin (2000), Igby Goes Down (2002), B. Monkey (1998), Shadow Magic (2000) and VH1's Two of Us (2000) where he portrayed John Lennon. He has also starred in blockbusters movies, including: The Last of the Mohicans (1992), Mr. Deeds (2002), Resident Evil: Apocalypse (2004), The Curious Case of Benjamin Button (2008), Sherlock Holmes: A Game of Shadows (2011), Lincoln (2012). And has created memorable characters on such popular TV shows as: The Riches (2007), Fringe (2008), Mad Men (2007). Jared is married to Allegra Riggio, a well-known lighting designer and TV host.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ3MDYwM15BMl5BanBnXkFtZTcwNTE5MjQ1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364813","name":"Jared Harris","nicknames":["Hot Buns"],"idIMDB":"nm0364813"},"actorId":"nm0364813","character":"Benmont Tench","urlCharacter":"http://www.imdb.com/character/ch0007131","main":true},{"actorName":"Mili Avital","urlProfile":"http://www.imdb.com/name/nm0000815","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjUyMTMzM15BMl5BanBnXkFtZTgwOTY3NzkwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1972","placeOfBirth":" Jerusalem, Israel","height":"5' 4½\" (1.64 m)","bio":"Mili Avital began her career, at the age of 17, in Christopher Hampton's \"Dangerous Liaisons\", at the Cameri Theater of Tel Aviv. Among her Israeli films, she won the 1992 Israeli Academy Award for Best Supporting Actress for Me'ever Layam (1991) (aka \"Over the Ocean\"). Arriving in New York in 1994, she was immediately cast as the female lead in Roland Emmerich's Stargate - La porte des étoiles (1994), for which she received a Sci-Fi Universe award. Her film work includes: Dead Man (1995) (Jim Jarmusch), Kissing a Fool (1998) (Doug Ellin), Polish Wedding (1998), Animals with the Tollkeeper (1998), The Young Girl and the Monsoon (1999), La couleur du mensonge (2003) (Robert Benton), When Do We Eat? (2005), Colombian Love (2004) (aka \"Columbian Love\") (Israel), and Noodle (2007) (Israel / China), for which she received the 2007 Israeli Critics' Circle Award for Best Actress, the Israeli Academy Award nomination for Best Actress, and Israel's Person of the Year nomination. Television: \"Scheherazade\" in the Emmy-nominated ABC miniseries, Arabian Nights (2000), NBC miniseries, Uprising (2001) (Jon Avnet), USA Network's After the Storm (2001), Damages (2007) (FX), Hatufim (2009) (aka \"Prisoners of War\") (Keshet, Israel). Directed a short documentary, I Think Myself I Am All the Time Younger (2004), (Tribeca Film Festival 2004, Jerusalem Film Festival 2004). She resides in New York City with her husband, screenwriter Charles Randolph, and their son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjUyMTMzM15BMl5BanBnXkFtZTgwOTY3NzkwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000815","name":"Mili Avital","idIMDB":"nm0000815"},"actorId":"nm0000815","character":"Thel Russell","urlCharacter":"http://www.imdb.com/character/ch0078348","main":true},{"actorName":"Jimmie Ray Weeks","urlProfile":"http://www.imdb.com/name/nm0917323","urlPhoto":"","biography":{"dateOfBirth":"21 March 1942","placeOfBirth":" Seattle, Washington, USA","bio":"Jimmie Ray Weeks was born on March 21, 1942 in Seattle, Washington, USA. He is an actor, known for Requiem for a Dream (2000), The Abyss (1989) and Dead Man (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0917323","name":"Jimmie Ray Weeks","idIMDB":"nm0917323"},"actorId":"nm0917323","character":"Marvin, Older Marshal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Bringelson","urlProfile":"http://www.imdb.com/name/nm0109517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTNhYjdmMzktYTMyOC00NjM1LWI5NmItMzY3YmY0YzZhMzdkL2ltYWdlXkEyXkFqcGdeQXVyMjQ1MjE1ODI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1957","placeOfBirth":" Armour, South Dakota, USA","birthName":"Mark Alan Bringelson","height":"6' (1.83 m)","bio":"Mark Bringelson mostly directs, currently. He is a partner in the renegade indie production company, Moon Mile Run, which is based in Los Angeles. He works in many venues, including film, television, music video, theatre, opera, fashion, and media events. He is single, and resides in West Hollywood, California. He has an Art blog on tumblr, where he posts almost daily.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTNhYjdmMzktYTMyOC00NjM1LWI5NmItMzY3YmY0YzZhMzdkL2ltYWdlXkEyXkFqcGdeQXVyMjQ1MjE1ODI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0109517","name":"Mark Bringelson","idIMDB":"nm0109517"},"actorId":"nm0109517","character":"Lee, Younger Marshal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John North","urlProfile":"http://www.imdb.com/name/nm0636023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjMxMDM3OV5BMl5BanBnXkFtZTgwOTExNDU3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"John North is an actor and director, known for Dead Man (1995), Open Wide (2006) and Telling Secrets (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjMxMDM3OV5BMl5BanBnXkFtZTgwOTExNDU3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636023","name":"John North","idIMDB":"nm0636023"},"actorId":"nm0636023","character":"Mr. Olafsen","urlCharacter":"http://www.imdb.com/character/ch0078349","main":true}],"seasons":[],"idIMDB":"tt0112817","urlIMDB":"http://www.imdb.com/title/tt0112817","business":{"budget":{"money":"$9,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$104,649","country":"USA","day":"12","month":"05","year":"1996","remarks":"16 Screens"},{"money":"£49,975","country":"UK","day":"11","month":"07","year":"1996","remarks":"9 Screens"},{"money":"DEM 645,423","country":"Germany","day":"10","month":"01","year":"1996","remarks":"49 Screens"}],"gross":[{"money":"$1,025,488","country":"USA","day":"14","month":"07","year":"1996","remarks":""},{"money":"$970,030","country":"USA","day":"07","month":"07","year":"1996","remarks":""},{"money":"$913,229","country":"USA","day":"30","month":"06","year":"1996","remarks":""},{"money":"$827,370","country":"USA","day":"23","month":"06","year":"1996","remarks":""},{"money":"$760,129","country":"USA","day":"16","month":"06","year":"1996","remarks":""},{"money":"$671,754","country":"USA","day":"09","month":"06","year":"1996","remarks":""},{"money":"$566,726","country":"USA","day":"02","month":"06","year":"1996","remarks":""},{"money":"$451,203","country":"USA","day":"27","month":"05","year":"1996","remarks":""},{"money":"$259,452","country":"USA","day":"19","month":"05","year":"1996","remarks":""},{"money":"$104,649","country":"USA","day":"12","month":"05","year":"1996","remarks":""}],"weekendGross":[{"money":"$21,697","country":"USA","day":"14","month":"07","year":"1996","remarks":"18 Screens"},{"money":"$37,326","country":"USA","day":"07","month":"07","year":"1996","remarks":"20 Screens"},{"money":"$65,852","country":"USA","day":"30","month":"06","year":"1996","remarks":"27 Screens"},{"money":"$36,800","country":"USA","day":"23","month":"06","year":"1996","remarks":"31 Screens"},{"money":"$53,518","country":"USA","day":"16","month":"06","year":"1996","remarks":"37 Screens"},{"money":"$59,168","country":"USA","day":"09","month":"06","year":"1996","remarks":"28 Screens"},{"money":"$67,416","country":"USA","day":"02","month":"06","year":"1996","remarks":"31 Screens"},{"money":"$141,313","country":"USA","day":"27","month":"05","year":"1996","remarks":"35 Screens"},{"money":"$95,239","country":"USA","day":"19","month":"05","year":"1996","remarks":"24 Screens"},{"money":"$104,649","country":"USA","day":"12","month":"05","year":"1996","remarks":"16 Screens"}],"admissions":[{"money":"402,332","country":"France","day":"31","month":"12","year":"1996","remarks":""},{"money":"163,216","country":"France","day":"30","month":"01","year":"1996","remarks":""},{"money":"31,217","country":"Netherlands","day":"31","month":"12","year":"1997","remarks":""},{"money":"29,674","country":"Netherlands","day":"01","month":"01","year":"1997","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"10","year":"1994","remarks":null},null],"copyrightHolder":"© 1995 12-Gauge Productions, Inc."},"technical":{"runtime":["2 hr 1 min (121 min)","1 hr 55 min (115 min) (Australia)","2 hr (120 min) (Argentina)"],"soundMix":["Dolby","Dolby SR"],"color":["Black and White"],"aspectRatio":["1.85 : 1"],"camera":["Moviecam and Arriflex Cameras"],"laboratory":["John E. Allen Associates, USA (prints by)","DuArt Film Laboratories Inc., New York, USA"],"filmLength":["3,296 m (Sweden)","3,416 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","metascore":"62","filmingLocations":[{"location":"Hoover Dam, Arizona-Nevada Border, USA"}],"rated":"R","awards":[{"award":"Cannes Film Festival 1995","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Jim Jarmusch","id":"nm0000464","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Picture","names":[]},{"category":"Best Cinematography","names":[{"name":"Robby Müller","id":"nm0005810","role":null}]},{"category":"Best Original Score","names":[{"name":"Neil Young","id":"nm0949918","role":null}]}]}]},{"award":"European Film Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won Screen International Award","categories":[{"category":"","names":[{"name":"Jim Jarmusch","id":"nm0000464","role":null}]}]}]},{"award":"Film Independent Spirit Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Feature","names":[{"name":"Demetra J. MacBride","id":"nm0531384","role":null}]},{"category":"Best Cinematography","names":[{"name":"Robby Müller","id":"nm0005810","role":null}]},{"category":"Best Supporting Male","names":[{"name":"Gary Farmer","id":"nm0001200","role":null}]},{"category":"Best Screenplay","names":[{"name":"Jim Jarmusch","id":"nm0000464","role":null}]}]}]},{"award":"First Americans in the Arts Awards 1997","titlesAwards":[{"titleAwardOutcome":"Won FAITA Award","categories":[{"category":"Outstanding Performance by an Actor in a Film (Lead)","names":[{"name":"Gary Farmer","id":"nm0001200","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1997","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Cinematography","names":[{"name":"Robby Müller","id":"nm0005810","role":null},{"name":"Breaking the Waves","id":"tt0115751","role":null}]}]},{"titleAwardOutcome":"3rd place NSFC Award","categories":[{"category":"Best Film","names":[]},{"category":"Best Director","names":[{"name":"Jim Jarmusch","id":"nm0000464","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Cinematographer","names":[{"name":"Robby Müller","id":"nm0005810","role":null},{"name":"Breaking the Waves","id":"tt0115751","role":null}]}]}]}],"votes":"75,437","type":"Movie","companyCreditsSimple":[{"idCompany":"co0052813","name":"Pandora Filmproduktion"},{"idCompany":"co0002923","name":"JVC Entertainment Networks"},{"idCompany":"co0082027","name":"Newmarket Capital Group"}],"keywords":{"keywords":["19th century","cannibalism","accountant","letter","wilderness","outcast","factory","train","small town","native american","neo noir","starving","existentialism","arthouse","cult","fainting","wanted poster","illiteracy","tunnel","train whistle","throat cut","spit on","shot with an arrow","raccoon","pushed into mud","pocket watch","pinto pony","nose ring","misfire","lightning","film starts with a quote","faun","face paint","elk","double barreled shotgun","cow","cleveland ohio","caught having sex","birch forest","beans","animal skull","accidental shooting","philosopher","job application","hired killer","fellatio","capitalist","outdoor oral sex","nudity","female nudity","death","black humor","sex","flashback","false accusation","drunkenness","tavern","skull crushing","shot in the chest","revenge","racist comment","psychopath","loss of job","horse riding","gang","corpse","dead animal","african american man","reference to william blake","crushed head","visionary","tobacco","teddy bear","stuffed animal","racism","painting","pacific ocean","mysticism","incest","homage","gunslinger","grizzly bear","grace","gingham dress","genocide","gender bender","cross dressing","transvestism","trading post","totem pole","throat slitting","stabbed in the hand","skull","shotgun","shot in the neck","shot in the head","shootout","saloon","police officer killed","peyote","pacific northwest","oral sex","new job","murder","marshal","manufacturer","loss of son","jealousy","hotel","horse thief","hallucination","gunshot wound","fugitive","eyeglasses","england","drugs","city slicker","canoe","campfire","caged human","broken engagement","beach","autograph","1870s","poetry","dying man","bounty hunter","anti hero","mistaken identity","culture clash","cult film","death of friend","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:18:42"}}