{"data":{"movies":[{"title":"The Ref","originalTitle":"","year":"1994","releaseDate":"19940311","directors":[{"name":"Ted Demme","id":"nm0001130"}],"writers":[{"name":"Marie Weiss","id":"nm0919087"},{"name":"Richard LaGravenese","id":"nm0481418"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTgyMzk0NV5BMl5BanBnXkFtZTYwMjM5Mzg5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Crime","Drama"],"plot":"Denis Leary plays an unfortunate cat burglar, who is abandonded by his partner in the middle of a heist, and is forced to take an irritating Connecticut couple (Kevin Spacey, Judy Davis) hostage. He soon finds that he took more than he bargained for when the couple's blackmailing son and despicable in-laws step into the picture. Before long they're driving him nuts with their petty bickering and family problems. The only way for him to survive is to be their referee and resolve their differences, before he can be nabbed by the police.","simplePlot":"A cat burglar is forced to take a bickering, dysfunctional family hostage on Christmas Eve.","actors":[{"actorName":"Denis Leary","urlProfile":"http://www.imdb.com/name/nm0001459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzM4NTA5OV5BMl5BanBnXkFtZTcwMTAxNjA3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1957","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Denis Colin Leary","height":"6' 2\" (1.88 m)","bio":"Denis Leary was born and raised in Worcester, Massachusetts, the son of Nora (Sullivan) and John Leary, Irish immigrants who had grown up together. His mother was a maid and his father was an auto mechanic. After a childhood in the 1960s, Leary went to Emerson College in Boston, where he tried his hand at acting and writing. He was a charter member of Emerson's Comedy Workshop, and taught at the college for five years after graduating. By that point, he had written several pieces for magazines and had worked at stand-up comedy for a time. In 1990, he and his wife, Ann Lembeck, flew to London to perform in the BBC's Paramount City. That weekend, Ann's water broke. Their planned weekend trip became a stay of months, and Denis, with not a whole lot to do in London, wrote a one-man comedy act. He brought friends in from the States, and they wrote songs to perform on stage. Leary, with Chris Phillips and Adam Roth on guitar, performed \"No Cure For Cancer\" at the Edinburgh International Arts Festival in Scotland. Despite some protests about the title, the show won the Critic's Award and the BBC Festival Recommendation. The next year, the show was moved to America, and it was eventually taped and broadcast on Showtime (Denis Leary: No Cure for Cancer (1992)). The show spawned a book, CD, cassette, and a videotape. It also started Leary's movie career. Since then, he has starred in several films and has had two of his own TV series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzM4NTA5OV5BMl5BanBnXkFtZTcwMTAxNjA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001459","name":"Denis Leary","idIMDB":"nm0001459"},"actorId":"nm0001459","character":"Gus","urlCharacter":"http://www.imdb.com/character/ch0075883","main":true},{"actorName":"Judy Davis","urlProfile":"http://www.imdb.com/name/nm0001114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzA1ODU0NV5BMl5BanBnXkFtZTcwNTk5ODQxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1955","placeOfBirth":" Perth, Western Australia, Australia","height":"5' 5\" (1.65 m)","bio":"Judy Davis was born April 23, 1955 in Perth, Western Australia. She was educated at Loreto Convent and the Western Institute of Technology, and graduated from the National Institute of Dramatic Art (NIDA) in 1977. She came to prominence as Sybylla Melvyn in the film adaptation of Miles Franklin's novel, My Brilliant Career (1979). She came to international success with the role of Adela Quested, in A Passage to India (1984), for which she was nominated an Oscar. Judy Went on to appear in one of several Woody Allen films, Husbands and Wives (1992). She played Sally, one-half of a couple going through a divorce. Her performance earned Judy her second Oscar nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzA1ODU0NV5BMl5BanBnXkFtZTcwNTk5ODQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001114","name":"Judy Davis","idIMDB":"nm0001114"},"actorId":"nm0001114","character":"Caroline","urlCharacter":"http://www.imdb.com/character/ch0018831","main":true},{"actorName":"Kevin Spacey","urlProfile":"http://www.imdb.com/name/nm0000228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NhY2U2YjgtNTFhZS00NjkwLWI2YzAtYWViNmRhMmQ5YWZjXkEyXkFqcGdeQXVyMDkxMjMwMA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1959","placeOfBirth":" South Orange, New Jersey, USA","birthName":"Kevin Spacey Fowler","height":"5' 10\" (1.78 m)","bio":"Kevin Spacey Fowler better known by his stage name Kevin Spacey, is an American actor of screen and stage, film director, producer, screenwriter and singer. He began his career as a stage actor during the 1980s before obtaining supporting roles in film and television. He gained critical acclaim in the early 1990s that culminated in his first Academy Award for Best Supporting Actor for the neo-noir crime thriller The Usual Suspects (1995), and an Academy Award for Best Actor for midlife crisis-themed drama American Beauty (1999). His other starring roles have included the comedy-drama film Swimming with Sharks (1994), psychological thriller Seven (1995), the neo-noir crime film L.A. Confidential (1997), the drama Pay It Forward (2000), the science fiction-mystery film K-PAX (2001) In Broadway theatre, Spacey won a Tony Award for his role in Lost in Yonkers. He was the artistic director of the Old Vic theatre in London from 2004 until stepping down in mid-2015. Since 2013, Spacey has played Frank Underwood in the Netflix political drama series House of Cards. His work in House of Cards earned him Golden Globe Award and Emmy Award nominations for Best Actor. As enigmatic as he is talented, Kevin Spacey has always kept the details of his private life closely guarded. As he explained in a 1998 interview with the London Evening Standard, \"the less you know about me, the easier it is to convince you that I am that character on screen. It allows an audience to come into a movie theatre and believe I am that person\". There are, however, certain biographical facts to be had - for starters, Kevin Spacey Fowler was the youngest of three children born to Kathleen Ann (Knutson) and Thomas Geoffrey Fowler, in South Orange, New Jersey. His ancestry includes Swedish (from his maternal grandfather) and English. His mother was a personal secretary, his father a technical writer whose irregular job prospects led the family all over the country. The family eventually settled in southern California, where young Kevin developed into quite a little hellion - after he set his sister's tree house on fire, he was shipped off to the Northridge Military Academy, only to be thrown out a few months later for pinging a classmate on the head with a tire. Spacey then found his way to Chatsworth High School in the San Fernando Valley, where he managed to channel his dramatic tendencies into a successful amateur acting career. In his senior year, he played \"Captain von Trapp\" opposite classmate Mare Winningham's \"Maria\" in \"The Sound of Music\" (the pair later graduated as co-valedictorians). Spacey claims that his interest in acting - and his nearly encyclopedic accumulation of film knowledge - began at an early age, when he would sneak downstairs to watch the late late show on TV. Later, in high school, he and his friends cut class to catch revival films at the NuArt Theater. The adolescent Spacey worked up celebrity impersonations (James Stewart and Johnny Carson were two of his favorites) to try out on the amateur comedy club circuit. He briefly attended Los Angeles Valley College, then left (on the advice of another Chatsworth classmate, Val Kilmer) to join the drama program at Juilliard. After two years of training he was anxious to work, so he quit Juilliard sans diploma and signed up with the New York Shakespeare Festival. His first professional stage appearance was as a messenger in the 1981 production of \"Henry VI\". Festival head Joseph Papp ushered the young actor out into the \"real world\" of theater, and the next year Spacey made his Broadway debut in Henrik Ibsen's \"Ghosts\". He quickly proved himself as an energetic and versatile performer (at one point, he rotated through all the parts in David Rabe's \"Hurlyburly\"). In 1986, he had the chance to work with his idol and future mentor, Jack Lemmon, on a production of Eugene O'Neill's \"Long Day's Journey Into Night\". While his interest soon turned to film, Spacey would remain active in the theater community - in 1991, he won a Tony Award for his turn as \"Uncle Louie\" in Neil Simon's Broadway hit \"Lost in Yonkers\" and, in 1999, he returned to the boards for a revival of O'Neill's \"The Iceman Cometh\". Spacey's film career began modestly, with a small part as a subway thief in Heartburn (1986). Deemed more of a \"character actor\" than a \"leading man\", he stayed on the periphery in his next few films, but attracted attention for his turn as beady-eyed villain \"Mel Profitt\" on the TV series Wiseguy (1987). Profitt was the first in a long line of dark, manipulative characters that would eventually make Kevin Spacey a household name: he went on to play a sinister office manager in Glengarry Glen Ross (1992), a sadistic Hollywood exec in Swimming with Sharks (1994), and, most famously, creepy, smooth-talking eyewitness Verbal Kint in The Usual Suspects (1995). The \"Suspects\" role earned Spacey an Oscar for Best Supporting Actor and catapulted him into the limelight. That same year, he turned in another complex, eerie performance in David Fincher's thriller Se7en (1995) (Spacey refused billing on the film, fearing that it might compromise the ending if audiences were waiting for him to appear). By now, the scripts were pouring in. After appearing in Al Pacino's Looking for Richard (1996), Spacey made his own directorial debut with Albino Alligator (1996), a low-key but well received hostage drama. He then jumped back into acting, winning critical accolades for his turns as flashy detective Jack Vincennes in L.A. Confidential (1997) and genteel, closeted murder suspect Jim Williams in Midnight in the Garden of Good and Evil (1997). In October 1999, just four days after the dark suburban satire American Beauty (1999) opened in US theaters, Spacey received a star on the Hollywood Walk of Fame. Little did organizers know that his role in Beauty would turn out to be his biggest success yet - as Lester Burnham, a middle-aged corporate cog on the brink of psychological meltdown, he tapped into a funny, savage character that captured audiences' imaginations and earned him a Best Actor Oscar. No longer relegated to offbeat supporting parts, Spacey seems poised to redefine himself as a Hollywood headliner. He says he's finished exploring the dark side - but, given his attraction to complex characters, that mischievous twinkle will never be too far from his eyes. In February 2003 Spacey made a major move back to the theatre. He was appointed Artistic Director of the new company set up to save the famous Old Vic theatre, The Old Vic Theatre Company. Although he did not undertake to stop appearing in movies altogether, he undertook to remain in this leading post for ten years, and to act in as well as to direct plays during that time. His first production, of which he was the director, was the September 2004 British premiere of the play Cloaca by Maria Goos (made into a film, Cloaca (2003)). Spacey made his UK Shakespearean debut in the title role in Richard II in 2005. In 2006 he got movie director Robert Altman to direct for the stage the little-known Arthur Miller play Resurrection Blues, but that was a dismal failure. However Spacey remained optimistic, and insisted that a few mistakes are part of the learning process. He starred thereafter with great success in Eugene O'Neill's A Moon for the Misbegotten along with Colm Meaney and Eve Best, and in 2007 that show transferred to Broadway. In February 2008 Spacey put on a revival of the David Mamet 1988 play Speed-the-Plow in which he took one of the three roles, the others being taken by Jeff Goldblum and Laura Michelle Kelly. In 2013, Spacey took on the lead role in an original Netflix series, House of Cards (2013). Based upon a British show of the same name, House of Cards is an American political drama. The show's first season received a Primetime Emmy Award nomination to include outstanding lead actor in a drama series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NhY2U2YjgtNTFhZS00NjkwLWI2YzAtYWViNmRhMmQ5YWZjXkEyXkFqcGdeQXVyMDkxMjMwMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000228","name":"Kevin Spacey","idIMDB":"nm0000228"},"actorId":"nm0000228","character":"Lloyd","urlCharacter":"http://www.imdb.com/character/ch0018830","main":true},{"actorName":"Robert J. Steinmiller Jr.","urlProfile":"http://www.imdb.com/name/nm0826198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTU4Nzc1NF5BMl5BanBnXkFtZTcwODk2NjgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1978","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Robert J Steinmiller was born on July 29, 1978 in Pittsburgh, Pennsylvania, USA, and he has acted in all three venues of the acting profession: THEATRICAL, MOTION PICTURE, and TELEVISION. He began his acting career in 1989 in a Theatrical production of Les Miserables. He starred in several Motion Pictures in the early 1990's including Bingo (1991), Rudy (1993) and The Ref (1994). He appeared on Television in an episode of The Untouchables, and several McDonalds commercials. In 2001 Robert returned to the stage in a Theatrical production of \"Damn Yankees\" at the Madrid Theatre, LA, USA. ps: His sister, Jessica, also appeared in_Jack The Bear (1993)_ as Katie Festinger.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTU4Nzc1NF5BMl5BanBnXkFtZTcwODk2NjgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0826198","name":"Robert J. Steinmiller Jr.","idIMDB":"nm0826198"},"actorId":"nm0826198","character":"Jesse","urlCharacter":"http://www.imdb.com/character/ch0102583","main":true},{"actorName":"Glynis Johns","urlProfile":"http://www.imdb.com/name/nm0424318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTAzMjg4NV5BMl5BanBnXkFtZTYwNjg4ODc3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1923","placeOfBirth":" Pretoria, South Africa","birthName":"Glynis Margaret P. Johns","height":"5' 4\" (1.63 m)","bio":"Husky voiced Glynis is the daughter of actor Mervyn Johns. Best known for her light comedy roles and often playful flirtation, Glynis was born in South Africa while her parents were on tour there (her mother was a concert pianist) but was always proud of her Welsh roots and took delight in playing the female lead (opposite Richard Burton) in the classic Under Milk Wood (1972). Glynis is probably best known for her role as the suffragette mother in Mary Poppins (1964) although she is probably best loved for her fishy roles in Miranda (1948) and Mad About Men (1954). She had earlier showed she could take on the serious roles as well as in Frieda (1947). Most recently seen (at the time of writing) in Superstar (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTAzMjg4NV5BMl5BanBnXkFtZTYwNjg4ODc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424318","name":"Glynis Johns","nicknames":["The Girl with the Upside-Down Eyes"],"idIMDB":"nm0424318"},"actorId":"nm0424318","character":"Rose","urlCharacter":"http://www.imdb.com/character/ch0018833","main":true},{"actorName":"Raymond J. Barry","urlProfile":"http://www.imdb.com/name/nm0000855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNTc2MzAzNzdeQTJeQWpwZ15BbWU3MDkxNDQ4MDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1939","placeOfBirth":" Hempstead, Long Island, New York, USA","height":"6' 0½\" (1.84 m)","bio":"Raymond J. Barry was born in New York, and attended Brown University, where he was a star athlete in football, basketball, and track. While there, he earned his degree in Philosophy and as a senior, was cast in the stage production of \"Picnic,\" where he played a football player. He then entered the Yale Drama School and after completing, acted in the Broadway play \"The Leaf People.\" He has appeared in over 100 plays and has starred in such films as Dead Man Walking (1995), Sudden Death (1995), and The Chamber (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNTc2MzAzNzdeQTJeQWpwZ15BbWU3MDkxNDQ4MDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000855","name":"Raymond J. Barry","idIMDB":"nm0000855"},"actorId":"nm0000855","character":"Huff","urlCharacter":"http://www.imdb.com/character/ch0075884","main":true},{"actorName":"Richard Bright","urlProfile":"http://www.imdb.com/name/nm0109175","urlPhoto":"","biography":{"dateOfBirth":"28 June 1937","placeOfBirth":" Brooklyn, New York, USA","birthName":"Richard James Bright","height":"5' 7½\" (1.71 m)","bio":"Fair complexioned, cold-eyed actor Richard Bright has notched up an impressive array of character performances of often shifty, or deadly characters on the wrong side of the law. First came to attention as a burglar in the engrossing The Panic in Needle Park (1971), and then followed it the following year playing a slick con artist hustling naive Ali MacGraw for the bank robbery loot in The Getaway (1972), before Steve McQueen pummels Bright to get the money back. Additionally, in 1972, he made his first appearance as bodyguard / enforcer \"Al Neri\", protecting Al Pacino in The Godfather (1972), and returned in the same role in The Godfather: Part II (1974) and, 16 years later, he was back once again still protecting mob boss Al Pacino in The Godfather: Part III (1990). Bright's look's have endeared him to casting agents looking for criminals & cops, as he has also appeared in Sergio Leone's Il était une fois en Amérique (1984), Sam Raimi's crazy Crimewave (1985), the union tale Teamster Boss: The Jackie Presser Story (1992) and Witness to the Mob (1998). In addition, he has appeared regularly on TV in police/drama shows such as Hill Street Blues (1981), Houston Knights (1987), Third Watch (1999) and The Sopranos (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0109175","name":"Richard Bright","nicknames":["Richie"],"idIMDB":"nm0109175"},"actorId":"nm0109175","character":"Murray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Baranski","urlProfile":"http://www.imdb.com/name/nm0004724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTYwMDUyM15BMl5BanBnXkFtZTcwNTk1MzQxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1952","placeOfBirth":" Buffalo, New York, USA","birthName":"Christine Jane Baranski","height":"5' 8½\" (1.74 m)","bio":"Christine Baranski was born on May 2, 1952 in Buffalo, New York, USA as Christine Jane Baranski. She is an actress, known for The Good Wife (2009), How the Grinch Stole Christmas (2000) and Cybill (1995). She was previously married to Matthew Cowles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTYwMDUyM15BMl5BanBnXkFtZTcwNTk1MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004724","name":"Christine Baranski","idIMDB":"nm0004724"},"actorId":"nm0004724","character":"Connie","urlCharacter":"http://www.imdb.com/character/ch0018832","main":true},{"actorName":"Adam LeFevre","urlProfile":"http://www.imdb.com/name/nm0480775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTY5NzE5Ml5BMl5BanBnXkFtZTcwMTk3NjgwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1950","placeOfBirth":" Albany, New York, USA","bio":"Adam LeFevre was born on August 11, 1950 in Albany, New York, USA. He is an actor, known for The Lucky One (2012), Hitch (2005) and She's Out of My League (2010). He was previously married to Cora Ann Bennett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTY5NzE5Ml5BMl5BanBnXkFtZTcwMTk3NjgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0480775","name":"Adam LeFevre","idIMDB":"nm0480775"},"actorId":"nm0480775","character":"Gary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phillip Nicoll","urlProfile":"http://www.imdb.com/name/nm0630439","urlPhoto":"","biography":{"bio":"Phillip Nicoll is an actor, known for The Ref (1994), Shining Time Station: Second Chances (1995) and Avonlea (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0630439","name":"Phillip Nicoll","idIMDB":"nm0630439"},"actorId":"nm0630439","character":"John","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ellie Raab","urlProfile":"http://www.imdb.com/name/nm0704618","urlPhoto":"","biography":{"dateOfBirth":"2 June 1977","placeOfBirth":" Wisconsin, USA","birthName":"Helen Elizabeth Raab","height":"5' 2\" (1.57 m)","bio":"Ellie Raab began her movie career while attending St. Ann's School for the Gifted in Brooklyn, New York, where she honed her skills as a superb actress in St. Ann's theater. She continued acting professionally through high school, but opted to take a hiatus while attending Vassar College in Poughkeepsie, New York where she graduated with a Bachelors degree in Religion. In collaboration with Samuel Crow of F.O.C. Films, an up-and-coming independent film label, Ellie Raab has recently finished her directorial debut in the short film \"Two Pieces of Meat\", a modern adaptation of a Sioux legend.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0704618","name":"Ellie Raab","idIMDB":"nm0704618"},"actorId":"nm0704618","character":"Mary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Raymond","urlProfile":"http://www.imdb.com/name/nm0713209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDQ0OTgwMF5BMl5BanBnXkFtZTYwODMxOTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1938","placeOfBirth":" San Francisco, California, USA","birthName":"William Joseph Raymond","bio":"Bill Raymond was born on September 9, 1938 in San Francisco, California, USA as William Joseph Raymond. He is an actor, known for Twelve Monkeys (1995), Michael Clayton (2007) and The Crow (1994). He is married to Linda Ruth Hartinian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDQ0OTgwMF5BMl5BanBnXkFtZTYwODMxOTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0713209","name":"Bill Raymond","idIMDB":"nm0713209"},"actorId":"nm0713209","character":"George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Scurti","urlProfile":"http://www.imdb.com/name/nm0780336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ5ZWJiODctMmQ2Yy00YmQyLTk0YjctNGU2NDBjMzQ1MjRmXkEyXkFqcGdeQXVyMTIxOTQzNDA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"John is happy to be a part of the 2106 Sundance film festival with the movie AS YOU ARE, which just won the U.S. Dramatic special jury prize. He can be seen as Detective Reed on CBS's BLUE BLOODS as well as the new MARVEL show LUKE CAGE on NETFLIX. He is involved with several animal rescue organizations and urges everyone out there to please adopt a new friend. His favorite part of the past year was rescuing a 900 pound steer from slaughter. Johnnyboy , as he was named, can be seen on the cover of the Woodstock Farm Animal Sanctuary's 2016 calendar rubbing heads with his girlfriend Fawn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ5ZWJiODctMmQ2Yy00YmQyLTk0YjctNGU2NDBjMzQ1MjRmXkEyXkFqcGdeQXVyMTIxOTQzNDA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0780336","name":"John Scurti","idIMDB":"nm0780336"},"actorId":"nm0780336","character":"Steve","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Turner","urlProfile":"http://www.imdb.com/name/nm0877642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk1ODUxOTMzM15BMl5BanBnXkFtZTYwMjEzNTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1952","placeOfBirth":" Colorado Springs, Colorado, USA","bio":"Jim Turner is entering his 7th season co-starring in HBO's hit comedy series Arli$$ (1996) as lovable lout, \"Kirby Carlisle\". Playing an ex-football-star-turned-agent and an old buddy of sports agent \"Arliss Michaels\" (Robert Wuhl), Jim Turner, boyishly blond behind \"Clark Kent\" glasses, is at once ubiquitous and indefinable. Interestingly enough, the show was cancelled after the 3rd season but a public-viewer-demand campaign had it renewed. In 22 Feature Films and shorts, 28 TV Series and appearances, and 18 stage plays, one-man-shows and comedy tours, Turner has the odd distinction of creating the weirdest group of cult favorites imaginable, from pinheads to \"Pinocchio\". Working with talents like Joel Schumacher, Robert Wuhl, Jack Black, Paul Bartel and Tracey Ullman, if there's a likable loser or a crazy kook, Jim Turner has played it. He even voiced a foot in Philip Holahan's animated short film, \"Stubble Trouble\" (winner Honorable Mention, Sundance, 1999; winner Best Comedy, Hollywood Film Festival). In 1979, Turner got his start in television when he created the live incarnation of a cult comic strip character famous for his non-sequiturs, \"Zippy The Pinhead\". The underground series gained popularity as obscure Zippy ran for President. This campaign idea continued with another character Turner played - MTV's \"Randee from the Redwoods\". In hundreds of spots that aired over 1987 to 1990, Randee became the dark horse candidate for President, thanks to MTV's marketing department. Turner's Film credits run from big studio releases including The Lost Boys (1987), St. Elmo's Fire (1985), The Ref (1994) (starring Denis Leary), Coldblooded (1995) (starring Jason Priestley) and Fox's 12:01 (1993) (starring Jonathan Silverman and Helen Slater). He was in Mockumentaries Porklips Now (1980) (skewering Apocalypse Now (1979)), and Grunt! The Wrestling Movie (1985) (lampooning pro wrestling), before the genre was hip. He co-wrote and starred in festival favorite Shelf Life (1993) (directed by Paul Bartel, co-starring O'Lan Jones and Andy Stein), the bizarre story of three children who raise themselves in a bomb shelter, adapted from Turner's play. And the filmed version of his lively ensemble stage show Girly Magazine Party was re-titled 364 Girls a Year (1996), which he co-wrote and starred in as \"Tellis Wondersweet\", in a comic look at a Hugh M. Hefner-type's life at the manse. You'll also find Turner in films with a very independent bent, including The Pompatus of Love (1995) (with Kristin Scott Thomas and Michael McKean), My Samurai (1992), Destroyer (1988) (with Anthony Perkins), Programmed to Kill (1987), and Kid Colter (1984). Since then, Turner has created roles in Pilots before the camera (including live-action/ani blended 'Bang' by George Meyer of The Simpsons (1989); On The Ropes for The WB; and Fathead for Nickelodeon). In 1995, Turner was also a series regular on CBS's If Not for You (1995) as the offbeat \"Cal\" (starring Hank Azaria, Elizabeth McGovern and Peter Krause). He recurred on Nickelodeon's Sports Theater With Shaquille O'Neal (1997-98); on HBO's Not Necessarily The Election, anchored by Dennis Miller (1996); and on Nickelodeon's hit series, Rugrats (1993). Network guest appearances include Dharma & Greg (ABC), That 70s Show (Fox), Tracey Takes On... (HBO), Sliders (Sci-Fi channel), Lost On Earth (USA), Grace Under Fire (ABC), The Larry Sanders Show (HBO), Tom (ABC), and Roseanne (ABC). But he'd been acting in television, movies, theatre and touring the nation since 1975 in the five-member comedy troupe Duck's Breath Mystery Theater (where he co-wrote the shows and created the character of Randee in 1977). Live stage shows abounded when Turner went to San Francisco, where he was the lead singer/lyricist for the toy-instrument-playing Rock Band/Performance, Artists Child's Portion (1978-81). In 1982 he formed Boomer, a long-lived four-person novelty Band, again as lead singer and lyricist. Duck's Breath and Turner's solo turns gathered regular fans in New York, including writers at Rolling Stone Magazine, producers at MTV and directors from Hollywood. Landing in Los Angeles in 1991, Turner quickly launched his one-man comedy, \"Showbiz Nightmares\", and followed it with the first Girly Magazine Party staging in 1992 (shows continue to this day). His latest live show is pure comic debauchery: Two-Headed Dog. But Turner's trump card of showbiz nightmares is his fate as the lead of ABC's 1987 Once A Hero. The Pilot sold with him starring in the tailor-made role of naive comic book superhero, 'Captain Justice'. The network \"upfront\" was a smash hit, all the relatives in Iowa were thrilled - and then the network replaced him at the last minute. Interestingly, the show died after 5 episodes. If Turner tells you he was born in a trailer, he's not kidding. Colorado Springs, Colorado, 1952. Father George Turner was in the Air Force then, but soon went into radio sports casting and the family moved quite a bit: Quebec, Arizona and finally to Iowa in 1954 to be raised a polite, shy, sports-loving geek in several small towns across the state. Upon moving to Los Angeles in 1991 with bride-to-be Lynn Freer, a bold artist turned landscape designer, they married in 1992 and had a son - not necessarily in that order. The actor-writer enjoys that other hyphenated job too: father-husband. Like father, like son: both love to golf, play basketball and invent other worlds peopled by fringe characters and funny calamities.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk1ODUxOTMzM15BMl5BanBnXkFtZTYwMjEzNTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0877642","name":"Jim Turner","idIMDB":"nm0877642"},"actorId":"nm0877642","character":"Phil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Herbie Ade","urlProfile":"http://www.imdb.com/name/nm0011749","urlPhoto":"","biography":{"bio":"Herbie Ade is an actor, known for The Ref (1994), Beautiful Girls (1996) and The Secret Lives of Dentists (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0011749","name":"Herbie Ade","idIMDB":"nm0011749"},"actorId":"nm0011749","character":"Bartender","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0110955","urlIMDB":"http://www.imdb.com/title/tt0110955","business":{"budget":{"money":"$11,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,044,097","country":"USA","day":"13","month":"03","year":"1994","remarks":"701 Screens"}],"gross":[{"money":"$3,060,726","country":"USA","day":"13","month":"03","year":"1994","remarks":""}],"weekendGross":[{"money":"$3,044,097","country":"USA","day":"13","month":"03","year":"1994","remarks":"701 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"06","year":"1993","remarks":null},{"money":null,"country":null,"day":"02","month":"09","year":"1993","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby","Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Film House Laboratories, Los Angeles (CA), USA","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"Stoopy's Tavern, Toronto, Ontario, Canada"}],"rated":"R","awards":[{"award":"Casting Society of America, USA 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Comedy","names":[{"name":"Howard Feuer","id":"nm0275393","role":null}]}]}]},{"award":"Chlotrudis Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won Chlotrudis Award","categories":[{"category":"Best Actress","names":[{"name":"Judy Davis","id":"nm0001114","role":null},{"name":"The New Age","id":"tt0110649","role":null}]}]}]}],"votes":"20,277","type":"Movie","companyCreditsSimple":[{"idCompany":"co0049348","name":"Touchstone Pictures"},{"idCompany":"co0102770","name":"Don Simpson/Jerry Bruckheimer Films"}],"keywords":{"keywords":["dysfunctional family","christmas","burglar","bickering","hostage","police","partner","connecticut","curfew","passed out drunk","drunken santa","reference to lee harvey oswald","reference to nat king cole","marzipan","fire alarm","hiding place","tied together","milk and cookies","fruit cake","gift wrapped present","santa claus costume","marc chagall sketch","dog bite","liar","gun pointed at face","tied up with bungee cord","tied to a chair","getaway driver","hijacking a car","developing a photograph","darkroom","compromising photograph","envelope full of money","hundred dollar bill","hiding money","running a stop sign","guard dog","rottweiler","booby trap","robbery","safe cracking","salvation army bell ringer","desk bell","caroling","sprayed with water","gay slur","urination","family relationships","dinner","stockholm syndrome","limousine","nativity","tv news","traveling","trapped","tied up","thief","reward","restaurant","reconciliation","quitting smoking","psychiatrist","police chief","photograph","on the run","mother son relationship","military school","married couple","marriage","marriage counseling","mansion","manhunt","loan","ineptitude","impostor","husband wife relationship","holiday","hiding in a closet","gun","grandmother","gift","frustration","family gathering","escape","criminal","confrontation","christmas tree","christmas eve","career criminal","candle","burglar alarm","breaking and entering","boat","blackmail","bar","argument","alcoholic","santa claus","farce","black comedy"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:55:29"}}