{"data":{"movies":[{"title":"Dunston Checks In","originalTitle":"","year":"1996","releaseDate":"19960112","directors":[{"name":"Ken Kwapis","id":"nm0477129"}],"writers":[{"name":"John Hopkins","id":"nm0394201"},{"name":"John Hopkins","id":"nm0394201"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2RhOTA4YzAtNTg3NC00NmYxLWI1YjQtYzM4NTJlYzVhZGYwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","French"],"genres":["Comedy","Adventure","Family"],"plot":"Robert's a beleaguered concierge of the luxury hotel owned by Mrs. Dubrow. She tells Robert an undercover reviewer is coming and to look sharp. If he does well he might get a promotion and some time off to take his sons, Brian and Kyle, on vacation. But then the villainous jewel-thief Rutledge checks in with his specially trained orangutan, Dunston. And when Dunston gets loose and tries to escape a life of crime with the help of Brian and Kyle, things go just a little lunatic.","simplePlot":"A young boy befriends a larcenous orangutan in a luxury hotel.","actors":[{"actorName":"Jason Alexander","urlProfile":"http://www.imdb.com/name/nm0004517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzMyMDY1OV5BMl5BanBnXkFtZTcwMDU3NjYyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1959","placeOfBirth":" Newark, New Jersey, USA","birthName":"Jason Scott Greenspan","height":"5' 4¼\" (1.63 m)","bio":"Jason Greenspan adopted the stage name Jason Alexander while still in high school in New Jersey. He was soon appearing in Broadway plays and movies, then in the hit TV series, Seinfeld (1989), from 1990 to 1998. Alexander also directs and produces films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzMyMDY1OV5BMl5BanBnXkFtZTcwMDU3NjYyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004517","name":"Jason Alexander","nicknames":["Jay","Pretzel Boy"],"idIMDB":"nm0004517"},"actorId":"nm0004517","character":"Robert Grant","urlCharacter":"http://www.imdb.com/character/ch0056845","main":true},{"actorName":"Faye Dunaway","urlProfile":"http://www.imdb.com/name/nm0001159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTU5MDY0OV5BMl5BanBnXkFtZTYwNTc0MTM1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1941","placeOfBirth":" Bascom, Florida, USA","birthName":"Dorothy Faye Dunaway","height":"5' 7\" (1.7 m)","bio":"She is one of the great models who transitioned successfully into acting! \"Thomas Crown Affair\" being one of the greatest performances causing all to take notice! Playing intelligent women with ability to match her contemporary male powerful counterparts into in-depth presence of the changes appearing in time as images of histories \"Bonnie & Clyde\"; How Spirit and Mind transcend the age differences in \"Arizona Dreams\" as her \"performing a miracle\" for the great representation of France's historical continuance though \"The Messenger Jeanne D'arc ... \".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTU5MDY0OV5BMl5BanBnXkFtZTYwNTc0MTM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001159","name":"Faye Dunaway","nicknames":["Miss Faye"],"idIMDB":"nm0001159"},"actorId":"nm0001159","character":"Mrs. Dubrow","urlCharacter":"http://www.imdb.com/character/ch0102957","main":true},{"actorName":"Eric Lloyd","urlProfile":"http://www.imdb.com/name/nm0005156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjE5MTIwNV5BMl5BanBnXkFtZTYwNTEzMDY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1986","placeOfBirth":" Glendale, California, USA","birthName":"David Eric Lloyd Morelli","height":"5' 10\" (1.78 m)","bio":"Eric began his career at 18 months in a computer commercial. Between the ages of two and five, he was a regular on the TV series, The Wonder Years (1988). Eric made his feature film debut in Heart and Souls (1993), playing Robert Downey Jr.'s character as a child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjE5MTIwNV5BMl5BanBnXkFtZTYwNTEzMDY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005156","name":"Eric Lloyd","idIMDB":"nm0005156"},"actorId":"nm0005156","character":"Kyle Grant","urlCharacter":"http://www.imdb.com/character/ch0056839","main":true},{"actorName":"Rupert Everett","urlProfile":"http://www.imdb.com/name/nm0000391","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQzMDM2ODE3MV5BMl5BanBnXkFtZTYwMDkxODE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1959","placeOfBirth":" Burnham Deepdale, Norfolk, England, UK","birthName":"Rupert James Hector Everett","height":"6' 4\" (1.93 m)","bio":"Rupert James Hector Everett was born in Burnham Deepdale, Norfolk, to Sara (Maclean) and Anthony Michael Everett, a Major in the British Army, who later worked in business. He is of mostly English, Scottish, and Irish ancestry. Everett grew up in privileged circumstances, but the wry, sometimes arrogant, intellectual was a rebel from the very beginning. At the age of seven, he was placed into the care of Benedictine monks at Ampleforth College where he trained classically on the piano. He was expelled from the Central School of Speech and Drama in London for clashing with his teachers and instead apprenticed himself at the avant-garde Glasgow Citizen's Theatre in Scotland, performing in such productions as 'Don Juan' and 'Heartbreak House'. In 1984 Everett successfully filmed a lead role in Another Country (1984), which he had performed earlier on stage and shot to international attention, becoming one of England's hottest new star. But again the wickedly sharp and suave rebel doused his own fire by clashing with the press and even with his own fans. In 1989 Everett openly declared his own homosexuality -- an announcement that could have mortally wounded his film career. Instead, over time, it seems to have had the opposite effect. His career revitalized as Julia Roberts' gay confidante in My Best Friend's Wedding (1997), and he has continued to impress notably in the classics area with Shakespeare in Love (1998) (as Christopher Marlowe), An Ideal Husband (1999) and A Midsummer Night's Dream (1999) (as Oberon). Lately he has enhanced both films with his royal portrayals in To Kill a King (2003) and Stage Beauty (2004), and television with his effortlessly suave Sherlock Holmes in Sherlock Holmes and the Case of the Silk Stocking (2004). His predilection for smug and smarmy villains of late such as the cartoonish Dr. Claw in Inspector Gadget (1999) has extended into voice animation with his \"unprincely\" Prince Charming character in Shrek 2 (2004). In making his landmark decision to \"come out\", Rupert becomes a living testament disproving the theory that a truly talented and successful romantic leading man cannot survive the career-killing stigma of being openly gay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQzMDM2ODE3MV5BMl5BanBnXkFtZTYwMDkxODE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000391","name":"Rupert Everett","idIMDB":"nm0000391"},"actorId":"nm0000391","character":"Lord Rutledge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Sack","urlProfile":"http://www.imdb.com/name/nm0755228","urlPhoto":"","biography":{"dateOfBirth":"5 May 1981","placeOfBirth":"","bio":"Graham Sack was born on May 5, 1981. He is an actor and writer, known for Dunston Checks In (1996), A Pig's Tale (1994) and Miracle Child (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0755228","name":"Graham Sack","idIMDB":"nm0755228"},"actorId":"nm0755228","character":"Brian Grant","urlCharacter":"http://www.imdb.com/character/ch0056843","main":true},{"actorName":"Paul Reubens","urlProfile":"http://www.imdb.com/name/nm0000607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjYyNjk4Nl5BMl5BanBnXkFtZTcwNzA4NDYwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1952","placeOfBirth":" Peekskill, New York, USA","birthName":"Paul Rubenfeld","height":"5' 10\" (1.78 m)","bio":"Paul Reubens was born Paul Rubenfeld on August 27, 1952 in Peekskill, New York, to Judy (Rosen), a teacher, and Milton Rubenfeld, a car salesman who had flown for the air forces of the U.S., U.K., and Israel, becoming one of the latter country's pioneering pilots. Paul grew up in Sarasota, Florida, where his parents owned a lamp store. During winters, The Ringling Brothers and Barnum and Bailey Circus called Sarasota home, and young Paul counted such big-top families as the Wallendas and the Zacchinis among his neighbors. When he was 11-years-old, he joined the local Asolo Theater, and during the next six years, he appeared in a variety of plays. After graduating from Sarasota High School in 1970, he attended Boston University for one year before deciding to seek his fortune as Paul Reubens in Hollywood, where he enrolled as an acting major at the California Institute of the Arts and accepted a string of pay-the-rent jobs ranging from pizza chef to Fuller Brush salesman. In the mid 1970s, his acting career grew slowly and steadily with small roles in theater productions, gigs at local comedy clubs and four guest appearances on The Gong Show (1976). During this time of education/employment, he joined an improvisational comedy troupe called The Groundlings. The popular gang of yuksters, whose roster has included Conan O'Brien, Lisa Kudrow, the late Phil Hartman, Jon Lovitz, and Julia Sweeney, wrung laughs from audiences with skits starring scads of imaginative, self-created characters. Among Reubens's contributions to this comedic community were a philandering husband named Moses Feldman, an Indian chief named Jay Longtoe, and the now fallen Pee-Wee Herman, who debuted in 1978. Pee-Wee was a funny man-child of indeterminate age and sexuality who created a sarcastic enthusiasm for the popular culture of the '50s and '60s. The geeky character's wardrobe consisted of a gray suit, a white short-sleeved shirt accessorized with a red clip-on bow tie, and white patent-leather loafers. He wore his jet-black hair military short with a defiant tuft in front, and he accentuated his lily-white complexion with pink cheeks and red lipstick. Reubens drew inspiration for Pee-Wee's geeky behavior from a youth he had attended summer camp with, and derived his creation's boyish voice from a character he played as a child actor. Pee-Wee appeared for only 10 minutes of The Groundlings show, but he nonetheless built up a considerable following and turned out to be a star of the '80s and early '90s. The Pee Wee Herman Show (1981), ran for five sellout months at the Los Angeles's Roxy nightclub, and HBO taped the performance and aired it as a special. Now a genuine comedy-circuit star, he became a frequent guest of David Letterman and a favorite at Caroline's in New York. In 1984, he sold out Carnegie Hall. He later auditioned for the cast of Saturday Night Live (1975), but when that didn't turn out as planned, he started writing a feature-length screenplay for Pee-Wee to star in, and asked friend Tim Burton to direct. Released to wildly divergent reviews, Pee-wee's Big Adventure (1985), followed its star cross-country in a madcap search for his beloved, stolen bike. The $7 million picture ended up grossing $45 million. That following year, CBS which had been losing children's audiences to cable programming, was interested in finding something to shore up its Saturday Morning lineup. The network company signed him to act/produce and to direct its live-action children's program called Pee-wee's Playhouse (1986). They doled out an eye-popping budget of $325,000 per episode - the same price as a prime- time sitcom. Reubens received complete creative control, albeit with three minor exceptions. During its five-year-run on CBS, he never appeared in general as himself. He even granted printed interviews in full Pee-Wee regalia. The image of Pee-Wee was broken on July 26, 1991. On his summer vacation, Reubens was visiting his parents in Sarasota and sought escape from boredom by catching a showing of the X-rated film, Nurse Nancy. He fell victim to a police sting operation and was arrested for sex charges when detectives allegedly saw him playing with his private parts. He was released on $219 bail and nobody realized what had happened until somebody recognized him beneath his long hair and goatee. The media went berserk: 'Kids show star arrested for indecent exposure'. Because of his behavior, CBS dropped the Playhouse and related merchandise was released from its shelves. He agreed to pay a $50 fine plus $85 in court costs to Sarasota County, and he produced a 30 second public service message for the Partnership For Drug-Free America commercial. As part of the deal, the county sealed all legal papers relating to the actor's arrest and didn't leave Reubens with a criminal record. The scandal marked the virtual death of Pee-Wee Herman. Reubens appeared as his favorite character for the last time at that Autumn's MTV Music Video Awards. The enthusiastic reception was not surprising, as he had received 15 thousand supportive letters during his arrest. Regardless, he had recently made a promise not to play Pee-Wee anymore and used his arrest as an chance to portray other roles. A new feature length film by Netflix available beginning March 18, 2016 will allow Reubens to show Pee-Wee fans his character again in Pee-wee's Big Holiday (2016). Reubens has landed a series of offbeat character roles. One year after he was taken into custody, he appeared in Burton's Batman Returns (1992) as the Penguin's unloving father, and as a vampire henchman in Buffy the Vampire Slayer (1992). Subsequent jobs have included a voice over for Tim Burton's The Nightmare Before Christmas (1993), a healthy stint as Andrew J. Lansing III on Murphy Brown (1988), and roles in the feature films, Dunston Checks In (1996), Matilda (1996), Buddy (1997) and Mystery Men (1999). He also signed to emcee a new game show based on the popular 'You Don't Know Jack' CD-ROM version.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjYyNjk4Nl5BMl5BanBnXkFtZTcwNzA4NDYwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000607","name":"Paul Reubens","nicknames":["Pee-Wee Herman"],"idIMDB":"nm0000607"},"actorId":"nm0000607","character":"Buck LaFarge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glenn Shadix","urlProfile":"http://www.imdb.com/name/nm0787187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjUxMDgxMV5BMl5BanBnXkFtZTcwNDkzNjUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1952","placeOfBirth":" Bessemer, Alabama, USA","birthName":"William Glenn Scott","height":"5' 10\" (1.78 m)","bio":"The late William G. \"Glenn Shadix\" Scott was born April 1952 in Bessemer, Alabama. He attended Birmingham-Southern College for two years. He lived in New York City prior to moving to Hollywood in the late-1970s. He made his film debut appearance in the poorly received remake of _The Postman Always Rings Twice_ before he got his breakthrough film role in Tim Burton's _Beetle juice (1988)_. He played the part of Otho, the pretentious interior designer who dabbled in the paranormal. Tim Burton went on to cast Glenn as the voice of the Mayor of Halloween Town in The Nightmare Before Christmas (1993), and Senator Nado in Planet of the Apes (2001). Notable television credits include NBC's Seinfeld (1989), and HBO's La caravane de l'étrange (2003). On September 7, 2010, Glenn accidentally fell at his condominium in Birmingham, Alabama, and died of blunt trauma to his head. He had already mobility problems and was wheelchair-bound. he's survived by his mother, sister and brother-in-law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjUxMDgxMV5BMl5BanBnXkFtZTcwNDkzNjUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0787187","name":"Glenn Shadix","idIMDB":"nm0787187"},"actorId":"nm0787187","character":"Lionel Spalding","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nathan Davis","urlProfile":"http://www.imdb.com/name/nm0205213","urlPhoto":"","biography":{"dateOfBirth":"22 May 1917","placeOfBirth":" Chicago, Illinois, USA","bio":"Nathan Davis was born on May 22, 1917 in Chicago, Illinois, USA. He was an actor, known for Risky Business (1983), Holes (2003) and Chain Reaction (1996). He was married to Metta Davis. He died on October 15, 2008 in Chicago.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0205213","name":"Nathan Davis","idIMDB":"nm0205213"},"actorId":"nm0205213","character":"Victor Dubrow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Bassey","urlProfile":"http://www.imdb.com/name/nm0060257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzEyMzE1Ml5BMl5BanBnXkFtZTYwMDg1Njky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1942","placeOfBirth":" Chicago, Illinois, USA","birthName":"Joan Bassey","bio":"Emmy Award-nominated Jennifer Bassey became a contract player on ABC TV's All My Children (1970) in the summer of 1998, after having portrayed borderline nymphomaniac \"Marian Colby\", since the early eighties. Jennifer was born in Chicago. Her first job in entertainment was as a singing Playboy bunny in the very first Playboy Club. She left her bunny ears behind and was accepted into the Royal Academy of Dramatic Art in London, where she got the lowest entrance marks in the history of the academy. Three years later, she graduated from the RADA with honors, finishing just below classmate and future Academy Award-winner, Sir Anthony Hopkins. Jennifer went on to the Big Apple, where she appeared in several Broadway and off-Broadway productions. Some of which included Neil Simon's \"California Suite\"; \"Not Now Darling\", directed by George Abbott; \"In Praise of Love\" with Rex Harrison and \"The Homecoming\" (The Original Royal Shakespeare Production). Her most recent off-Broadway credits include Molière's \"Tartuffe\" and Wendy Wasserstein's \"Isn't It Romantic\", both staged at the Tribeca Playhouse. Prior off-Broadway appearances included playing \"Katherine\" in \"The Taming of the Shrew\" at the Roundabout Theatre; \"Lady Macbeth\" in \"Macbeth\" at the Stratford Theatre and \"Love Letters\", in which she co-starred with Ken Kercheval. In 1983, Miss Bassey won the role of \"Marian Colby\" on All My Children (1970), initially signing for a five-month stint. Due to the incredible popularity of the character, Marian is still going strong nearly 20 years later. Beyond her other dramatic successes, she has enjoyed a flourishing film career that includes such feature films as Waxwork (1988), Twogether (1992), which also featured both the performing and directing talents of Nick Cassavetes, and Dunston Checks In (1996), where in a scene-stealing, skin-revealing moment, she received an orgasmic massage from an orangutan! Jennifer has achieved prime-time success, most recently as a guest star on Law & Order (1990). Other notable appearances include L.A. Law (1986), Falcon Crest (1981), Murphy Brown (1988), Silk Stalkings (1991), Matlock (1986) and Coach (1989). In addition to her Emmy nomination for Best Supporting Actress, she also received two Soap Opera Digest Awards, the second of which was shared with her co-star, David Canary, for Favorite Couple. Ms. Bassey shares her life with her longtime companion, Luther Davis, the famous playwright and screenwriter who wrote the book for the shows \"Kismet\" and \"Grand Hotel\". He also wrote and produced \"Timbuktu\", starring Eartha Kitt. In her spare time, Jennifer enjoys outdoor activities and is an aspiring writer, whose latest effort is a new night-time series called \"Nightfall\", which is currently under consideration for production by HBO.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzEyMzE1Ml5BMl5BanBnXkFtZTYwMDg1Njky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0060257","name":"Jennifer Bassey","idIMDB":"nm0060257"},"actorId":"nm0060257","character":"Mrs. Dellacroce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Judith Scott","urlProfile":"http://www.imdb.com/name/nm0779399","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTEwNTU1M15BMl5BanBnXkFtZTcwNDExMzkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Judith Scott was born in Fort Bragg, North Carolina, USA. She is an actress, known for Fracture (2007), Guess Who (2005) and The Santa Clause (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTEwNTU1M15BMl5BanBnXkFtZTcwNDExMzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779399","name":"Judith Scott","idIMDB":"nm0779399"},"actorId":"nm0779399","character":"Nancy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Beatty","urlProfile":"http://www.imdb.com/name/nm0064193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzU1MTk2N15BMl5BanBnXkFtZTgwNTM5ODMxODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Bruce Beatty is an actor, known for Dope (2015), Négociateur (1998) and Straight Outta Compton (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzU1MTk2N15BMl5BanBnXkFtZTgwNTM5ODMxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064193","name":"Bruce Beatty","idIMDB":"nm0064193"},"actorId":"nm0064193","character":"Murray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Comden","urlProfile":"http://www.imdb.com/name/nm0173680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTIxOTg3M15BMl5BanBnXkFtZTYwMzk1ODA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1969","placeOfBirth":" Beverly Hills, California, USA","birthName":"Danny Hill Comden","bio":"Danny Comden was born on April 10, 1969 in Beverly Hills, California, USA as Danny Hill Comden. He is an actor and writer, known for Urban Legend (1998), Dunston Checks In (1996) and Pretty Persuasion (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTIxOTg3M15BMl5BanBnXkFtZTYwMzk1ODA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0173680","name":"Danny Comden","idIMDB":"nm0173680"},"actorId":"nm0173680","character":"Norm","urlCharacter":"http://www.imdb.com/character/ch0358684","main":true},{"actorName":"Steven Gilborn","urlProfile":"http://www.imdb.com/name/nm0318318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzMjM4MTg1Ml5BMl5BanBnXkFtZTcwMTI1NjEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1936","placeOfBirth":" New Rochelle, New York, USA","birthName":"Steven Neil Gilborn","height":"6' (1.83 m)","bio":"Steven Gilborn was born on July 15, 1936 in New Rochelle, New York, USA as Steven Neil Gilborn. He was an actor, known for Doctor Dolittle (1998), Alien: Resurrection (1997) and Evolution (2001). He was married to Karen Halverson. He died on January 2, 2009 in North Chatham, New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzMjM4MTg1Ml5BMl5BanBnXkFtZTcwMTI1NjEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0318318","name":"Steven Gilborn","idIMDB":"nm0318318"},"actorId":"nm0318318","character":"Artie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lois De Banzie","urlProfile":"http://www.imdb.com/name/nm0207221","urlPhoto":"","biography":{"dateOfBirth":"4 May 1930","placeOfBirth":" Glasgow, Scotland, UK","bio":"Lois De Banzie was born on May 4, 1930 in Glasgow, Scotland. She is an actress, known for Annie (1982), Naked Gun 33 1/3: The Final Insult (1994) and Sister Act (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0207221","name":"Lois De Banzie","idIMDB":"nm0207221"},"actorId":"nm0207221","character":"Mrs. Winthrop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natalie Core","urlProfile":"http://www.imdb.com/name/nm0179702","urlPhoto":"","biography":{"dateOfBirth":"21 February 1919","placeOfBirth":" Ford City, Pennsylvania, USA","birthName":"Natalie Harris Hamund Core","bio":"Natalie Core was born on February 21, 1919 in Ford City, Pennsylvania, USA as Natalie Harris Hamund Core. She was an actress, known for My Neighbor Totoro (1988), Dunston Checks In (1996) and The Ice Pirates (1984). She died on October 14, 2011 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0179702","name":"Natalie Core","idIMDB":"nm0179702"},"actorId":"nm0179702","character":"Mrs. Feldman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0116151","urlIMDB":"http://www.imdb.com/title/tt0116151","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"£802,390","country":"UK","day":"21","month":"04","year":"1996","remarks":""},{"money":"ESP","country":"129,942,319","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1997/\">1997</a>"},{"money":"14,325","country":"Portugal","day":"25","month":"07","year":"1996","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":["Dolby","Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["2,479 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.3","metascore":"54","filmingLocations":[{"location":"Bullocks Wilshire Building, Los Angeles, California, USA"}],"rated":"PG","awards":[{"award":"Razzie Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Faye Dunaway","id":"nm0001159","role":null},{"name":"The Chamber","id":"tt0115862","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Faye Dunaway","id":"nm0001159","role":null},{"name":"The Chamber","id":"tt0115862","role":null}]}]}]},{"award":"Young Artist Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature - Musical or Comedy","names":[]},{"category":"Best Performance in a Feature Film - Actor Age Ten or Under","names":[{"name":"Eric Lloyd","id":"nm0005156","role":null}]}]}]}],"votes":"10,160","type":"Movie","companyCreditsSimple":[{"idCompany":"co0029297","name":"Joe Wizan/Todd Black"},{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["hotel","orangutan","boy","fistfight","cake","boss","mean boss","child martial arts","karate chop","karate","martial arts","shoulder massage","back massage","nude massage","female rear nudity","femme fatale","long blonde hair","blonde","child actor","child protagonist","child hero","child fighting adult","widower","teenager fighting adult","pistol","dart gun","rifle","bully","bully comeuppance","comeuppance","underwear","falling on someone","sticking out one's tongue","teenage boy","father son relationship","slapstick comedy","robbery","hotel manager","mistaken identity","exterminator","single father","dog","loss of mother","con artist","animal in cast credits","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:53:28"}}