{"data":{"movies":[{"title":"Faraway, So Close!","originalTitle":"In weiter Ferne, so nah!","year":"1993","releaseDate":"19931221","directors":[{"name":"Wim Wenders","id":"nm0000694"}],"writers":[{"name":"Wim Wenders","id":"nm0000694"},{"name":"Ulrich Zieger","id":"nm0956065"}],"runtime":"140 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MzgwODYwOF5BMl5BanBnXkFtZTYwNzc4MDc5._V1.jpg","countries":["Germany"],"languages":["German","French","English","Italian","Russian"],"genres":["Drama","Fantasy","Romance"],"plot":"A group of angels in the German capital look longingly upon the life of humans.","simplePlot":"A group of angels in the German capital look longingly upon the life of humans.","actors":[{"actorName":"Otto Sander","urlProfile":"http://www.imdb.com/name/nm0761420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjUxNTQ3M15BMl5BanBnXkFtZTgwODM0MjMyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1941","placeOfBirth":" Hanover, Germany","bio":"Otto Sander was born on June 30, 1941 in Hanover, Germany. He was an actor and director, known for Wings of Desire (1987), Das Boot (1981) and Faraway, So Close! (1993). He was married to Monika Hansen. He died on September 12, 2013 in Berlin, Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjUxNTQ3M15BMl5BanBnXkFtZTgwODM0MjMyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761420","name":"Otto Sander","idIMDB":"nm0761420"},"actorId":"nm0761420","character":"Cassiel","urlCharacter":"http://www.imdb.com/character/ch0007714","main":true},{"actorName":"Peter Falk","urlProfile":"http://www.imdb.com/name/nm0000393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODUwNDE3MF5BMl5BanBnXkFtZTYwMjA1NTM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1927","placeOfBirth":" New York City, New York, USA","birthName":"Peter Michael Falk","height":"5' 6\" (1.68 m)","bio":"Peter Michael Falk was born on September 16, 1927, in New York City, New York. At the age of 3, his right eye was surgically removed due to cancer. He graduated from Ossining High School, where he was president of his class. His early career choices involved becoming a certified public accountant, and he worked as an efficiency expert for the Budget Bureau of the state of Connecticut before becoming an actor. On choosing to change careers, he studied the acting art with Eva Le Gallienne and Sanford Meisner. His most famous role is that of the detective Columbo; however, this was not his first foray into acting the role of a detective. During a high school play, he stood in for such a role when the original student actor fell sick. He has been married twice, and is the father of two children:Catherine, a private detective in real life, and Jackie. He was diagnosed with dementia in 2008, which was most likely brought on by Alzheimer's disease, from which he died on June 23, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODUwNDE3MF5BMl5BanBnXkFtZTYwMjA1NTM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000393","name":"Peter Falk","idIMDB":"nm0000393"},"actorId":"nm0000393","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Horst Buchholz","urlProfile":"http://www.imdb.com/name/nm0001976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg5MTkyODI4NV5BMl5BanBnXkFtZTcwODI1ODE1NA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1933","placeOfBirth":" Berlin, Germany","birthName":"Horst Werner Buchholz","height":"5' 9½\" (1.77 m)","bio":"On the cast list of The Magnificent Seven (1960), you will find several names that doubtless you know well: Charles Bronson, Steve McQueen, and Yul Brynner. But there is one name that you will have difficulty pronouncing, let alone identifying as an actor you have seen before. That man is Horst Buchholz, and he was one of the few German actors to have a considerable success in both Hollywood and in Europe. One would hardly guess that he was sought out to act in one of the most famous films of all time, only to have to turn it down. Horst Buchholz was born in Berlin, Germany, in the year 1933. His father was a German shoemaker, while his mother was born to Danish parents. Buccholz was put in a foster home in Czecheslovakia when World War II broke out in Europe, but he returned to Berlin the moment he had the chance. Realizing his talent in acting, Buchholz dropped out of school to perfect his acting skills. After moving from East Berlin to West Berlin, he became well-known for his work in theatre and on the radio. In 1952 he turned to film, and after a series of small roles, he found a larger one in the Julien Duvivier film Marianne of My Youth (1955). He won a Best Actor award at Cannes for his role in the romantic/drama film Sky Without Stars (1955) by Helmut Käutner. However, it was the lead role in the comedic Confessions of Felix Krull (1957) that made him an established German actor. He followed this breakthrough role with the romantic film Two Worlds (1958) and the thriller Wet Asphalt (1958), where the handsome young actor plays a former criminal who associates himself with a journalist. Now a familiar face in his country, Buchholz pursued making foreign films. His first non-German film was the British film Tiger Bay (1959). The film is about a girl who witnesses a seaman named Korchinsky (Buchholz) murder his girlfriend. The film won praise in both Germany and Britain, but it was Buchholz' next foreign film that secured his name in the history of classic films. This film was the epic western The Magnificent Seven (1960) directed by John Sturges. Buchholz played Chico, the inexperienced Mexican youth that wants to be a gunman and abandon his past. Buchholz starred alongside such legends as Charles Bronson and Yul Brynner. both of whom had strong European roots. The film was a hit, first in Europe, then was re-distributed in the States to a much higher profit. The film gained massive popularity, and even now is treasured as a classic. Buchholz could now find good and steady work nationally and internationally, which is something few actors could do at the time. He worked on the romantic film Fanny (1961), which is based on a trilogy of plays written by legendary writer Marcel Pagnol. Buchholz plays the role of Marius, a passionate but unsure youth who must choose between the girl he loves, and the life at sea he has always wanted. The film was a fine success, nominated for five Oscars, including Best Picture and Best Actor for Charles Boyer (who plays Buchholz' onscreen father). It was at this point in his film career where he was sought as the first choice to play the role of Sherif Ali in David Lean's legendary film Lawrence of Arabia (1962). However, Buchholz had to turn it down, as he had already signed up for another film, which turned out to be the Oscar-nominated comedy One, Two, Three (1961) (directed by Billy Wilder). The film was once again a fine success to add to Buchholz' career, but ultimately gained nowhere near as much of a status as David Lean's film. Buchholz also made the Italian film The Empty Canvas (1963) in which he plays an untalented artist who begins a love affair with a young model. Throughout his in the early 60s, Buchholz had made a name for himself, acting in one Oscar-nominated film after another and showing off his talent as an actor. However, the success he had reached was not to last. Buchholz continued with film, including the James Bond spoof That Man in Istanbul (1965) and the crime film Johnny Banco (1967). He starred in the B-movie failure that was Young Rebel (1967). Buchholz rebounded with the fiery film The Savior (1971) in which he plays a man who claims to be organizing resistance against the Nazis. He also played Johann Strauss in the Golden Globe-nominated musical The Great Waltz (1972). which was sadly another failure. The rest of the 1970s and the early 1980s were spent mostly on television and movies released for televison, whether it be foreign (Dead of Night (1977), Return to Fantasy Island (1978)) or German (Derrick). Buchholz found mild success again when he returned to the big screen with the WW II espionage film Code Name: Emerald (1985) in which he plays alongside such stars as Ed Harris and Max von Sydow. After this film, Buchholz returned to European movies, such as And the Violins Stopped Playing (1988) in which a group of gypsies flee Nazi persecutors. After taking a supporting role in the fantasy film Faraway, So Close! (1993), Buchholz acted in one of his most well known films: the Oscar-winning Italian film Life Is Beautiful (1997) which was directed by and starred Roberto Benigni. Buchholz played the role of a doctor who befriends Benigni's character and frequently duels with him in riddles. This choice of role proved to be an echo of Buchholz' taste in choosing his projects in earlier years; the film won best foreign film that year, and was also nominated for Best Picture. Thanks to his gift for languages, Buchholz was able to dub himself in the foreign releases of the film. Buchholz continued making films and television appearances until 2002, by which time he was sixty-eight years old. He died the next year, in Berlin, of pneumonia. Berlin had been the city of his heart, and was buried there in honour of that fact. Horst Buchholz had been a renowned German actor, and had gained credibility in the United States and other countries. He was a varied performer, acting all kinds of roles in his life, but was always a proud German to the last.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg5MTkyODI4NV5BMl5BanBnXkFtZTcwODI1ODE1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001976","name":"Horst Buchholz","nicknames":["Hotte","The James Dean of German Cinema"],"idIMDB":"nm0001976"},"actorId":"nm0001976","character":"Tony Baker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mikhail Gorbachev","urlProfile":"http://www.imdb.com/name/nm0329784","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjMzMjg1Ml5BMl5BanBnXkFtZTYwMTcwMjk1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1931","placeOfBirth":" Privolnoye, North Caucasus Krai, Russian SFSR, USSR [now Stavropol Krai, Russia]","birthName":"Mikhail Sergeyevich Gorbachyov","height":"5' 9\" (1.75 m)","bio":"Mikhail Gorbachev was the last leader of the Soviet Communist Party who initiated changes known as 'perestroika' and 'glasnost' which melted the rigid Soviet system and liberated 15 republics of the Soviet Union to become independent states, thus ending the existence of the USSR in December 1991. He was born Mikhail Sergeevich Gorbachev into a peasant family on March 2, 1931, in the village of Privolnoe, Stavropol province, Southern Russia. His father, named Sergei Gorbachev, was a tractor driver. His mother, named Maria Panteleyeva, was a peasant. His grandparents were deported and sentenced for nine years under the dictatorship of Joseph Stalin, for their success in becoming richer independent farmers known as kulaks. Young Gorbachev witnessed the destruction of traditional farming and degradation of villages, that caused massive exodus of people from their land and to gloomy industrial Soviet cities, where they were doomed to become brainwashed by propaganda and live in small flats under restricting political and economic conditions for the rest of their lives. During the Second World War Gorbachev survived the Nazi occupation of his land in Stavropol province in 1942-1943. After the war, Gorbachev chose to remain on his land, although it was now taken by the Communist Government, the ranks of which he would penetrate later. Gorbachev privately described his life and work on a Soviet collective farm as serfdom. In 1947 Gorbachev shot to fame at the age of 16, after helping his father, a combine harvester operator, to harvest a record crop on a collective farm. For this achievement he was awarded the Order of the Red Banner of Labour and was promoted to the Communist Party at the age of 21. From 1950 - 1955 he studied law on a State scholarship at Moscow State University. There he met his future wife, Raisa Maksimovna Gorbacheva (nee Titarenko), they married in September 1953, and their daughter, Irina, was born in January 1957. After a brief stint as a Government Lawyer in Stavropol, Gorbachev made a career as a ranking leader of Komsomol (Union of Young Communists), then as a Communist Party leader of Stavropol province, climbing to the ranks as Member of the Central Committee of the Communist Party of the Soviet Union. At that time Gorbachev made his first travels outside of the Soviet Union. While the Soviet leaders were manipulating their own people into submission through fear and control, the West Europeans enjoyed freedom and prosperity that attracted East Germans and other Soviet satellites. Gorbachev learned his first lesson on his tour in East Germany, witnessing their rapid recovery after the Second World War. At the same time, in 1956, Yuri Andropov and Georgi Zhukov led the attack on Hungarian Revolution, and killed thousands of Hungarians who opposed the Soviet-imposed regime. Then Soviet leadership made more aggressive international actions by spreading military support to pro-communist regimes across the world and also by building the Berlin Wall and enforcing Soviet military and political domination in Eastern Europe. These Soviet actions alienated Europeans. Open political discussions in the Soviet Union were not allowed under threat of prosecution, freedom of speech was never guaranteed, all media was owned and controlled by the Soviet government and independent activity was suppressed, and only some fragmented information was made available to ranking provincial communists, such as Gorbachev. In 1961 he attended the important 22nd Congress of the Communist Party in Moscow, where Nikita Khrushchev announced his Utopian plan to surpass the USA per capita income in 20 years. At the same 22nd Congress, upon Khrushchev's instruction, Gorbachev, among other top communists received a copy of Aleksandr Solzhenitsyn's anti-Stalin publication \"One day of Ivan Denisovich\" which criticized the brutality of Gulag prison-camps and the Soviet regime in general. That gave Gorbachev and some other young communists a hope that Khrushchev may change the brutal Soviet regime. However, in 1964, Nikita Khrushchev was arrested and dismissed by pro-Stalin group led by Leonid Brezhnev who eventually established a remake of Stalinism for the next 18 years, albeit in a more grotesque and senile version of Soviet regime. Then Brezhnev's regime crushed the Prague Spring of 1968, fought the Chinese Army over a border dispute in 1969, sent Soviet Tanks and Air Force to Egypt and Syria against Israel in the 1970s, as well as in North Vietnam against the French and Americans. At that time Gorbachev and his wife, Raisa Maksimovna, were allowed to travel to the Western Europe and see the difference between reality in European countries and its distorted depiction by the Soviet propaganda. In 1972 he headed the Soviet official delegation to Belgium, then, in 1974 was made Member of the Supreme Soviet in charge of the Commission on Youth Affairs. During the 1970s Gorbachev enjoyed a highly privileged life of a ranking communist, having many perks such as a villa in a suburb of Moscow, a special limo with a chauffeur and guards, and regular luxurious vacations in Italy and in the South of France, all at the expense of the Communist Party. However, this allowed him to see the striking difference between the quality of life in the Western Europe and gloomy survival of masses in the Soviet Union. Gorbachev witnessed that people were living hopeless lives having no choice. Workers of collective farms lived without identification documents up until the 1970s. Undocumented citizens at collective farms were disposable. Migrants were used as industrial slaves, for symbolic pay. Wages were set by the state and did not depend on productivity or quality. The economy was governed by the state 5-year plan. This mostly ignored the world and domestic market signals; and lacked the incentives for innovation and efficiency. Teachers were forced to indoctrinate children of all ages from kindergartens through schools and universities. Total control and manipulation was demonstrated twice a year at annual May Day parades and Great Revolution parades on November 7. Military parades were accompanied by marching masses of industrial workers and managers, doctors and scientists, as well as teachers and students from all schools and universities. Exemplary obedient people were rewarded with better food and perks. Taming millions to obedience by fear and hunger led to a massive degradation of human rights, poor spirituality, lack of initiative and creativity, and the decay of public health and vitality. The country of almost three hundred million people was stuck in stagnation, inefficiency, and apathy. Brighter students were taken into the military-industrial system, brainwashed and locked there for life with little choices. Opponents were locked in the \"Gulag\" prison-camps, mostly in Siberia. There, millions were working various hard labor jobs in grand-scale economic projects; like the Baikal-Amur railroad (BAM). Since the Communist Revolution of 1917, people had been continually stripped of their land and property. Under Khrushchev and Brezhnev the destruction of independent farming was finalized. By the 1960s and 1970s massive poverty and anxiety pushed millions to migrate to cities. Mass-construction of cheap panel buildings was lagging behind. Millions of families shared poor housing, hostels, and dorms in cities. Villages were deserted. Collective farms decayed. Agricultural output fell below the levels of the Tsar's age. Tens of thousands of churches and monasteries were destroyed across the Soviet Union, and many churches were replaced by offices and halls of the Communist party. Spiritual life was dominated by ugly propaganda. People were blinded by fear and pushed to wrong values. Meaningful human virtues were replaced with fake ideals of ruthless Soviet communism. Propaganda idolized members of the Soviet Politburo, their portraits were decorating every school and factory along with countless portraits and statues of the first Soviet leader V.I. Lenin. In November 1979 Gorbachev was promoted Candidate Member of the Politburo, then less than a year later, he was made Full Member of Politbureau, the highest rank in the Communist Party which gave him unlimited direct access to Brezhnev and Andropov. The latter also promoted Gorbachev to sub for him at several Politburo meetings, and gave him a huge power in decision-making. Gorbachev developed a personal friendship with another Politburo member, Eduard Shevardnadze, and the two were vacationing together at the prestigious Black sea resort of Pitsunda. At that time the invasion of Afghanistan, ordered by senile Brezhnev in 1979, seriously undermined international credibility of the Soviet Union. Andrei Sakharov wrote an open letter to Brezhnev calling for a stop to the war. 50 nations boycotted the 1980 Olympics in Moscow. Crackdown on intellectual freedom and human rights included the use of psychiatric terror, arrests, and the exile of dissidents. The head of the KGB Yuri Andropov declared Andrei Sakharov the \"enemy No. 1.\" Sakharov was forcefully exiled from Moscow to the militarized 'closed' city of Gorky. He was placed under tight surveillance and restricted from any contacts. His wife was also under tight surveillance. By his 70th birthday Brezhnev's health declined dramatically; but he made himself a Generalissimus Marshal of the Soviet Union, similar to that of Joseph Stalin. Brezhnev accepted over 200 decorations and awards, including awards from all pro-Soviet governments, except China. Brezhnev accepted countless expensive gifts and amassed a collection of vintage cars and other bribes. His personal vanity and behavior was replicated at all levels of the Communist Party and led to massive corruption. The old Brezhnev lost his acting abilities and couldn't even read the script. Massive disillusionment was reflected in cynical jokes about the Soviet life. The ugly reality in the Soviet Union was reflected in its senile leader. Gorbachev saw that outdated economic and political system in the Soviet Union was doomed, but propaganda was still brainwashing the minds of millions, because it was controlled by the privileged few top communists who lived in denial of the big reality. The youngest Politburo Member, Mikhail Gorbachev, was contemplating reforms. Leonid Brezhnev died on November 10, 1982, and was succeeded by Yuri Andropov who died just 16 months later. He was replaced by Konstantin Chernenko, who died in just 13 months. In 1983 Politbureau member Rashidov committed suicide, then, in 1984 the powerful Defence Minister Ustinov died. While the Soviet Union was in a dying mode, the real world was rapidly growing into computer age that reshaped global community. The rigid Soviet System was incompatible with the constantly innovating world. USSR failed to respond to rapidly changing reality and alienated forward-thinking people even in the pro-Soviet countries. During the early 1980s Soviet Politbureau was torn between two viciously fighting groups of Communists, one was made of the old hard-liners led by Andrei Gromyko, the apprentice of Joseph Stalin. The other, pro-democracy group, was made of the forward-thinking members of the Politbureau who chose Gorbachev as their leader along with Aleksandr Yakovlev who was the brain behind Gorbachev's moves. With Gorbachev's support Yakovlev managed to change all hard-liners in the Soviet media and propaganda system. In March 1985 Gorbachev was made the Secretary General of the Communist Party of the Soviet Union, becoming the first Soviet leader to have been born after the disastrous Russian Revolution of 1917. He announced reforms called 'perestroika' (aka.. restructuring) and 'glasnost' (aka.. opening up), and lifted the walls of propaganda and denial. However, Gorbachev's first reform on regulations related to manufacturing and trade of alcohol became an economic disaster, causing a serious economic damage to the Soviet Union's State budget with annual losses exceeding tens of billions of dollars. Although his reforms were supported by public, many communist hard-liners openly opposed Gorbachev. Eventually, by the late 1980s Gorbachev's push for economic liberalization resulted in emergence of co-operatives and other forms of independent businesses, making the movement to freedom irreversible. In December of 1986, Gorbachev personally contacted Andrei Sakharov in his exile. Gorbachev ordered that the KGB should release Sakharov and return him to Moscow. Back in Moscow Sakharov continued his work as a humanitarian. A few months before his death, he was elected as a representative of the Academy of Sciences to the Supreme Soviet in 1989. Sakharov showed to the World what an independent thinker can do by going to the extremes of science. He invented a bomb that could bring the most horrible extermination of life, and then took a stand to ban his own invention for the salvation of planet Earth. Gorbachev had important meetings with Ronald Reagan culminating in their summit in Reikjavik, Iceland, and leading to a more stable political and military situation in the world, that resulted in reunification of Germany and the fall of the Berlin Wall in November of 1989. At that time the Soviet hard-liners criticized Gorbachev's international moves, saying that he was not a leader, but rather a follower of Ronald Reagan's instruction: \"Mr. Gorbachev, tear down that wall\" when the state of world affairs did not allow Gorbachev to disobey without a risk of losing his face. He also followed recommendations by Margaret Thatcher on opening the \"Iron Curtain\" to allow the Russian people to see the world and learn about the diverse international reality and travel freely on their own. A first, Gorbachev skillfully used hidden buttons within the rigid structure of the Soviet power tainted by the long tradition of obedience, fear and intimidation, which was installed by dictator Joseph Stalin within the ranks of Communist bureaucracy. That fear of the man in Kremlin served Gorbachev's plans well, as he managed to overcome the resistance of hard liners in ending the ruling powers of the Communist Party. Soon Gorbachev began giving away many power buttons in Moscow, which allowed his rivals to gain strength and independently form opposition groups. Andrei Gromyko, the last living member of Joseph Stalin's old Politbureau, had criticized Gorbachev's methods as \"weak leadership\" and also said \"He (Gorbachev) is unfit for the Hat\" (where the Hat means Kremlin, or an allusion to the Tsar's crown of power). Such criticism was ignored by most of the younger members of the Communist Politbureau and Central Committee, because weak central leadership allowed provincial bosses to privatize state property at a fraction of its real value. Gorbachev replaced his hard-line critic Andrei Gromyko with Eduard Shevardnadze as the Minister of Foreign Affairs of the USSR, and both Gorbachev and Shevardnadze pushed for international détente and withdrawal of the Soviet troops from Afghanistan. In another effort to add weight to his gradually eroding power, in March of 1990 Gorbachev updated his official title by adding a newly created post as President of the Soviet Union, albeit he was not really a democratically elected president. He surrounded himself with the political council of 15 top politicians, but he was lacking the grass-roots connections with masses and mid-level bureaucracy across the country. At that time Gorbachev began to experience powerlessness in his efforts to change the gigantic Soviet system, he was known for expressing his powerlessness by using profanities and anger at his meetings with the ranks of Soviet Government and industrial leaders. Gorbachev was facing an impossible task of modernizing the brittle structure of the Soviet Communism, especially the massive and inefficient Soviet military-industrial complex where opposition to reforms was the most organized, and inefficiency was dissembled as a military secret, like a catch-22, thus making it unreformable. Gorbachev himself was still perceived as the Secretary General of the Soviet Communist Party, and that stigma became the weakest part of his image in the eyes of many open-minded and quickly learning people in the Soviet Union. His effort to gain political weight by adding a figure of Vice-President of the Soviet Union had failed and soon backfired. Gorbachev's fatal mistake was letting the Members of Politbureau to chose the Vice-President of the Soviet Union behind closed doors in Kremlin; the \"chosen\" one was a career communist Gennadi Yanayev who would very soon betray Gorbachev during the coup. Eventually Gorbachev became overshadowed by a much stronger figure of Boris Yeltsin, who gained more popular support by pushing further economic and political reforms, and also criticized Gorbachev's manner of restructuring of the Soviet system as slow, indecisive and inefficient. The rivalry between two former Communist comrades ended in the August 1991 coup, when still powerful KGB and Soviet Army leaders tried to take the power away from both Gorbachev and Yeltsin. Their coup failed just a couple days later, after the entire country watched Gennady Yanayev and his coup members on TV. \"Let me say that Mikhail Gorbachev is now on vacation. He is undergoing treatment, himself, in our country. He is very tired after all these years and he will need time to get better.\" said Gennadi Yanayev before the cameras, and his hands were visibly trembling from fear. Gorbachev's disappearance during the coup was also seen as his grave weakness. Boris Yeltsin disposed his Communist ID card in front of the cameras and publicly denounced Gorbachev. Then all ranks of communists deserted the Communist Party in a massive exodus, and that was the end of the Soviet Union. All regional leaders were anxious to rule as presidents of their own independent states, and Yeltsin was already elected the president of Russia, the biggest part of the Soviet Union. Yeltsin met with the leaders of Ukraine and Belarus and they made a treaty as independent states. By the end of December 1991 the Soviet Union became obsolete and Gorbachev retired after a formal signing of dissolution of the USSR. Mikhail Gorbachev is still regarded in the Western world for his input in ending the Cold War and helping the reunification of Germany. He was awarded the Nobel Peace Prize (1990) and received numerous international awards, decorations and privileges, such as the Honorary German Citizenship. However, in Russia Gorbachev's political standing failed to gain any substantial public support. He received less than 1% of popular vote in the 1996 presidential elections in Russia, when his former rival Boris Yeltsin was elected for his second presidential term. In 2001 Gorbachev founded the Social Democratic Party of Russia, but later, in 2003, he had resigned from the party leadership and stayed away from most of the current Russian political forces and media. In contrast to Gorbachev's popularity all over the world, he fell in obscurity in Russia, largely because in the new era of the wild Russian capitalism his outdated views and experience became obsolete. Instead he turned to business of giving lecture tours and speeches internationally and selling photo-ops with him for money that goes to humanitarian causes; he also sold his name and image to commercials such as the Pizza Hut and other businesses. He has been running the business of the Gorbachev Foundation, which handles his international appearances, while keeping a low profile in the current political life of Russia. In 2005 he was awarded the Point Alpha Prize for his role in re-unification of Germany. In 2006 Gorbachev underwent a carotid artery surgery in Munich, Germany. He currently resides in Moscow, Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjMzMjg1Ml5BMl5BanBnXkFtZTYwMTcwMjk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0329784","name":"Mikhail Gorbachev","idIMDB":"nm0329784"},"actorId":"nm0329784","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nastassja Kinski","urlProfile":"http://www.imdb.com/name/nm0000176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDgzNDU1MV5BMl5BanBnXkFtZTYwMDUzOTg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1961","placeOfBirth":" Berlin, Germany","birthName":"Nastassja Aglaia Nakszynski","height":"5' 6½\" (1.69 m)","bio":"Nastassja Kinski was born Nastassja Aglaia Nakszynski on January 24, 1961 in Berlin, Germany, the daughter of German actor Klaus Kinski. In 1976, she met director Roman Polanski, who urged her to study method acting with Lee Strasberg in the United States. Kinski starred in the Italian romantic drama Stay as You Are (1978) with Marcello Mastroianni, gaining her recognition in the United States after the film's release on December 21, 1979. She played the title character in Polanski's romantic drama Tess (1979), an adaptation of Thomas Hardy's novel \"Tess of the d'Urbervilles\" (1891). Kinski starred in Francis Ford Coppola's romantic musical One from the Heart (1981), her first film made in the United States. The film became a box office bomb and was a major loss for Coppola's production company Zoetrope Studios. She also starred in the erotic horror movie Cat People (1982) with Malcolm McDowell, a remake of the 1942 classic of the same name. She appeared in Wim Wenders' drama movie Paris, Texas (1984) with Harry Dean Stanton and Dean Stockwell. One of her most acclaimed films, the film won the Palme d'Or (Golden Palm) at the Cannes Film Festival. During the 1990s, Kinski appeared in a number of American films, including the action movie Terminal Velocity (1994) opposite Charlie Sheen, One Night Stand (1997), Your Friends & Neighbors (1998), John Landis' Susan's Plan (1998), and The Lost Son (1999). She has appeared in more than 60 films in Europe and the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDgzNDU1MV5BMl5BanBnXkFtZTYwMDUzOTg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000176","name":"Nastassja Kinski","idIMDB":"nm0000176"},"actorId":"nm0000176","character":"Raphaela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heinz Rühmann","urlProfile":"http://www.imdb.com/name/nm0004464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjY5NjU0M15BMl5BanBnXkFtZTgwODUzNzEwMzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1902","placeOfBirth":" Essen, Germany","birthName":"Heinrich Wilhelm Rühmann","bio":"Heinz Rühmann was born on March 7, 1902 in Essen, Germany as Heinrich Wilhelm Rühmann. He was an actor and producer, known for It Happened in Broad Daylight (1958), Ce diable de garçon (1944) and The Captain from Köpenick (1956). He was married to Hertha Droemer, Hertha Feiler and Maria Herbot. He died on October 3, 1994 in Aufkirchen, Bavaria, Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjY5NjU0M15BMl5BanBnXkFtZTgwODUzNzEwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004464","name":"Heinz Rühmann","idIMDB":"nm0004464"},"actorId":"nm0004464","character":"Konrad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruno Ganz","urlProfile":"http://www.imdb.com/name/nm0004486","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTM4NDI1OF5BMl5BanBnXkFtZTYwOTc1NjEz._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1941","placeOfBirth":" Zürich-Seebach, Switzerland","height":"5' 6\" (1.68 m)","bio":"Bruno Ganz debuted at the theatre in 1961 and gained there a good reputation as a solid, young actor. In 1970 he founded with Peter Stein the theatre company \"Schaubuehne\" of Berlin. His debut at the movies was early and unsuccessful during the decade of 1960. His talent as a reflexive actor with tendencies towards introspection was widely known after Summer Guests (1976).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTM4NDI1OF5BMl5BanBnXkFtZTYwOTc1NjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004486","name":"Bruno Ganz","nicknames":["Gano Brunz"],"idIMDB":"nm0004486"},"actorId":"nm0004486","character":"Damiel","urlCharacter":"http://www.imdb.com/character/ch0007715","main":true},{"actorName":"Solveig Dommartin","urlProfile":"http://www.imdb.com/name/nm0231652","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNDg1MDc2NV5BMl5BanBnXkFtZTcwOTcyMTE3OA@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1961","placeOfBirth":" Paris, France","bio":"Solveig Dommartin was born on May 16, 1961 in Paris, France. She was an actress and director, known for Wings of Desire (1987), Until the End of the World (1991) and Faraway, So Close! (1993). She died on January 11, 2007 in Paris.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNDg1MDc2NV5BMl5BanBnXkFtZTcwOTcyMTE3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0231652","name":"Solveig Dommartin","idIMDB":"nm0231652"},"actorId":"nm0231652","character":"Marion","urlCharacter":"http://www.imdb.com/character/ch0007717","main":true},{"actorName":"Rüdiger Vogler","urlProfile":"http://www.imdb.com/name/nm0901057","urlPhoto":"","biography":{"dateOfBirth":"14 May 1942","placeOfBirth":" Warthausen, Biberach, Württemberg [now Baden-Württemberg], Germany","height":"5' 11¼\" (1.81 m)","bio":"Rüdiger Vogler was born on May 14, 1942 in Warthausen, Biberach, Württemberg [now Baden-Württemberg], Germany. He is an actor, known for Alice in the Cities (1974), OSS 117: Lost in Rio (2009) and Kings of the Road (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0901057","name":"Rüdiger Vogler","idIMDB":"nm0901057"},"actorId":"nm0901057","character":"Phillip Winter","urlCharacter":"http://www.imdb.com/character/ch0028699","main":true},{"actorName":"Lou Reed","urlProfile":"http://www.imdb.com/name/nm0715563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA0MDgyNDExNV5BMl5BanBnXkFtZTcwMTE1ODQyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1942","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Lewis Allan Reed","height":"5' 10\" (1.78 m)","bio":"He formed the group The Velvet Underground with Welsh multi-instrumentalist John Cale, second guitarist Sterling Morrison, and drummer Maureen Tucker in New York in 1965. The group soon became a part of Andy Warhol's Factory scene, which housed a great number of the most freaked and experimental artists at the time. The German singer and actress Nico sang in the group for a short period-- but the original line-up began to split up. The group, at its best, made only four original albums: \"The Velvet Underground & Nico\" (1967), \"White Light/White Heat\" (1968), \"The Velvet Underground\" (1969), and \"Loaded\" (1970). They stand today as milestones in the history of rock. In 1970, Lou Reed began his solo career. His second album, \"Transformer\" (1972), was produced by David Bowie and Mick Ronson, long-time admirers of the Velvets. That year, he had his first--and still only--top 20 song, \"Walk on the Wild Side.\" Through the 1970s, he made a prolific number of albums with \"Berlin\" (1973), \"Rock 'n' Roll Animal\" (1974), and \"Street Hassle\" (1978) as the artistic highlights of this period. On St. Valentine's Day 1980, Lou Reed married Sylvia Morales, and that was another turning point in his career. The following album, \"The Blue Mask\" (1982), stands as one of his best and most composed. In 1989, he made \"New York\"--a love letter to his city with its good and bad, and with a heavy criticism of American thought. In the 1990s, he continued to be one of the most sharp-tongued rock 'n' roll poets of his time. In 1990, he once again collaborated with ex-Velvet-partner John Cale. Their album, \"Songs for Drella,\" was a very personal tribute to friend and artist Andy Warhol, who had recently died. In 1993, The Velvet Underground was re-formed with its original line-up, and toured in Europe in 1993. In 1997, Lou Reed, along with former Velvet band mates John Cale, Maureen Tucker, and the late Sterling Morrison were inducted into the Rock and Roll Hall of Fame in Cleveland, Ohio. Lou Reed stood as one of the most important songwriters of our time and has served as inspiration to a multitude of artists such as David Bowie, Nick Cave, Sonic Youth, Nine Inch Nails, U2, David Byrne and Patti Smith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA0MDgyNDExNV5BMl5BanBnXkFtZTcwMTE1ODQyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0715563","name":"Lou Reed","idIMDB":"nm0715563"},"actorId":"nm0715563","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willem Dafoe","urlProfile":"http://www.imdb.com/name/nm0000353","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjU2MTYyM15BMl5BanBnXkFtZTgwMjY5MDY4NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1955","placeOfBirth":" Appleton, Wisconsin, USA","birthName":"William J. Dafoe","height":"5' 9\" (1.75 m)","bio":"Willem Dafoe was born in Appleton, Wisconsin, to Muriel Isabel (Sprissler), a nurse, and Dr. William Alfred Dafoe, a surgeon. He is of German, French, English, Irish, and Scottish descent. In 1979, Dafoe was given a small role in Michael Cimino's Heaven's Gate (1980) from which he was fired. His first feature role came shortly after in Kathryn Bigelow's The Loveless (1981). From there, he went on to perform in over 80 films - in Hollywood (John Carter (2012), Spider-Man (2002), The English Patient (1996), Finding Nemo (2003), Once Upon a Time in Mexico (2003), Clear and Present Danger (1994), White Sands (1992), Mississippi Burning (1988), Streets of Fire (1984), American Dreamz (2006)) and in independent cinema in the U.S. (L'enlèvement (2004), Animal Factory (2000), The Boondock Saints (1999), American Psycho (2000)) and abroad (Theo Angelopoulos' La poussière du temps (2008), Yim Ho's Pavillon de femmes (2001), Yurek Bogayevicz's Edges of the Lord (2001), Wim Wenders' Faraway (2011), So Close (2009), Nobuhiro Suwa's segment of Paris, je t'aime (2006), Brian Gilbert's Tom & Viv (1994), Christian Carion's Farewell (2001), _Mr. Bean's Holiday and The Spierig Brothers' Daybreakers_, Daniel Nettheim's The Hunter (2011)). He has chosen projects for diversity of roles and opportunities to work with strong directors. He has worked in the films of Wes Anderson (The Life Aquatic with Steve Zissou (2004), Fantastic Mr. Fox (2009), The Grand Budapest Hotel (2014)), Martin Scorsese (Aviator (2004), The Last Temptation of Christ (1988)), Spike Lee (Inside Man (2006)), Julian Schnabel (Miral (2010), Basquiat (1996)), Paul Schrader (Auto Focus (2002), Affliction (1997), Light Sleeper (1992), The Walker (2007), Adam Resurrected (2008)), David Cronenberg (eXistenZ (1999)), Abel Ferrara (4:44 Last Day on Earth (2011), Go Go Tales (2007), New Rose Hotel (1998)), David Lynch (Wild at Heart (1990)), William Friedkin (To Live and Die in L.A. (1985)), Werner Herzog (My Son, My Son, What Have Ye Done (2009), Oliver Stone (Born on the Fourth of July (1989), Platoon (1986)), Giada Colagrande (A Woman (2010) and Before It Had a Name (2005)) and Lars von Trier (Antichrist (2009) and Manderlay (2005)). He was nominated twice for the Academy Award (Platoon (1986) and Shadow of the Vampire (2000)) and once for the Golden Globe. Among other nominations and awards, he received an LA Film Critics Award and an Independent Spirit Award. Upcoming films include Wes Anderson's The Grand Budapest Hotel (2014), Anton Corbjin's A Most Wanted Man (2014), Lars von Trier's Nymphomaniac - Volume 1 (2013), Scott Cooper's Out of the Furnace (2013), Josh Boone's The Fault In Our Stars (2014)_, David Leitch and Chad Stahelski's John Wick (2014)_, and Chris Brinker's Bad Country (2014). Dafoe is one of the founding members of The Wooster Group, the New York based experimental theatre collective. He created and performed in all of the group's work from 1977 thru 2005, both in the U.S. and internationally. Since then, he worked with Richard Foreman in Idiot Savant at The Public Theatre (NYC) and most recently the international productions of Robert Wilson's The Life & Death of Marina Abramovic abroad and Robert Wilson's The Old Woman with Mikhail Baryshnikov.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjU2MTYyM15BMl5BanBnXkFtZTgwMjY5MDY4NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000353","name":"Willem Dafoe","idIMDB":"nm0000353"},"actorId":"nm0000353","character":"Emit Flesti","urlCharacter":"http://www.imdb.com/character/ch0007713","main":true},{"actorName":"Monika Hansen","urlProfile":"http://www.imdb.com/name/nm0361013","urlPhoto":"","biography":{"dateOfBirth":"1943","placeOfBirth":"","height":"5' 6½\" (1.69 m)","bio":"Monika Hansen was born in 1943. She is an actress, known for Faraway, So Close! (1993), My Sweet Home (2001) and The Einstein of Sex (1999). She was previously married to Otto Sander and Rolf Becker.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0361013","name":"Monika Hansen","idIMDB":"nm0361013"},"actorId":"nm0361013","character":"Hanna / Gertrud Becker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Günter Meisner","urlProfile":"http://www.imdb.com/name/nm0577070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjFhYzJiNjgtYzM0ZC00ZDgzLWJiYzktMmJiMzZkMWQ5ZjkwXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1926","placeOfBirth":" Bremen, Germany","bio":"Günter Meisner was born on April 18, 1926 in Bremen, Germany. He was an actor and director, known for Willy Wonka & the Chocolate Factory (1971), Prison de cristal (1986) and The Boys from Brazil (1978). He was married to Gisela Albrecht Meisner. He died on December 5, 1994 in Berlin, Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjFhYzJiNjgtYzM0ZC00ZDgzLWJiYzktMmJiMzZkMWQ5ZjkwXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0577070","name":"Günter Meisner","idIMDB":"nm0577070"},"actorId":"nm0577070","character":"Fälscher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ronald Nitschke","urlProfile":"http://www.imdb.com/name/nm0633015","urlPhoto":"","biography":{"dateOfBirth":"10 August 1950","placeOfBirth":" Berlin, Germany","height":"5' 10¾\" (1.8 m)","bio":"Ronald Nitschke was born on August 10, 1950 in Berlin, Germany. He is an actor, known for Shining Through (1992), Faraway, So Close! (1993) and L'innocent (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0633015","name":"Ronald Nitschke","nicknames":["Rio Landsknecht","Tschako Lindner"],"idIMDB":"nm0633015"},"actorId":"nm0633015","character":"Patzke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hanns Zischler","urlProfile":"http://www.imdb.com/name/nm0957193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWZlY2MyNzUtNTJlNS00YjhkLTkwNmItZTc0ZDkyMGQ4NzcwXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1947","placeOfBirth":" Nuremberg, Bavaria, Germany","height":"5' 11¼\" (1.81 m)","bio":"Hanns Zischler was born on June 18, 1947 in Nuremberg, Bavaria, Germany. He is an actor and director, known for Munich (2005), Sils Maria (2014) and Ripley's Game (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWZlY2MyNzUtNTJlNS00YjhkLTkwNmItZTc0ZDkyMGQ4NzcwXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0957193","name":"Hanns Zischler","idIMDB":"nm0957193"},"actorId":"nm0957193","character":"Dr. Becker","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0107209","urlIMDB":"http://www.imdb.com/title/tt0107209","business":{"budget":{"money":"$10,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 24 min (144 min)","2 hr 20 min (140 min) (USA)"],"soundMix":["Dolby"],"color":["Black and White","Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Germany"}],"rated":"PG-13","awards":[{"award":"Golden Globes, USA 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Original Song - Motion Picture","names":[{"name":"Adam Clayton","id":"nm0165651","role":"music"},{"name":"The Edge","id":"nm0857253","role":"music"},{"name":"Larry Mullen Jr.","id":"nm0611979","role":"music"},{"name":"Bono","id":"nm0095104","role":"lyrics"}]}]}]},{"award":"Bavarian Film Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won Bavarian Film Award","categories":[{"category":"Best Direction (Regiepreis)","names":[{"name":"Wim Wenders","id":"nm0000694","role":null}]}]}]},{"award":"Camerimage 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Frog","categories":[{"category":"","names":[{"name":"Jürgen Jürges","id":"nm0005751","role":null}]}]}]},{"award":"Cannes Film Festival 1993","titlesAwards":[{"titleAwardOutcome":"Won Grand Prize of the Jury","categories":[{"category":"","names":[{"name":"Wim Wenders","id":"nm0000694","role":null}]}]},{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Wim Wenders","id":"nm0000694","role":null}]}]}]},{"award":"German Film Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won Film Award in Gold","categories":[{"category":"Best Cinematography (Beste Kamera/Bildgestaltung)","names":[{"name":"Jürgen Jürges","id":"nm0005751","role":null}]}]},{"titleAwardOutcome":"Nominated Film Award in Gold","categories":[{"category":"Outstanding Feature Film (Bester Spielfilm)","names":[]},{"category":"Best Performance by an Actor in a Leading Role (Beste darstellerische Leistung - Männliche Hauptrolle)","names":[{"name":"Otto Sander","id":"nm0761420","role":null}]},{"category":"Best Direction (Beste Regie)","names":[{"name":"Wim Wenders","id":"nm0000694","role":null}]}]}]},{"award":"Italian National Syndicate of Film Journalists 1994","titlesAwards":[{"titleAwardOutcome":"Nominated European Silver Ribbon","categories":[{"category":"","names":[{"name":"Wim Wenders","id":"nm0000694","role":null}]}]}]},{"award":"Yoga Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won Yoga Award","categories":[{"category":"Worst Foreign Director","names":[{"name":"Wim Wenders","id":"nm0000694","role":null}]}]}]}],"votes":"6,106","type":"Movie","companyCreditsSimple":[{"idCompany":"co0055424","name":"Road Movies Filmproduktion"},{"idCompany":"co0041119","name":"Tobis Filmkunst"}],"keywords":{"keywords":["angel","afterlife","overalls","photo booth","black market","artist","post cold war","german reunification","circus","sequel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:06:55"}}