{"data":{"movies":[{"title":"Frame-Up II: The Cover-Up","originalTitle":"","year":"1994","releaseDate":"19941227","directors":[{"name":"Paul Leder","id":"nm0496459"}],"writers":[{"name":"Paul Leder","id":"nm0496459"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2Y1ODk1ZGEtZTgyZC00ZjliLWEyMjMtMDBlZjJkYjZjNTM2XkEyXkFqcGdeQXVyMzY1MzAzMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action"],"plot":"The bank president in a small California town isn't quite the upstanding citizen he appears to be--he's a corrupt killer, who has just kidnapped the wife and daughter of the local sheriff.","simplePlot":"The bank president in a small California town isn't quite the upstanding citizen he appears to be--he's a corrupt killer, who has just kidnapped the wife and daughter of the local sheriff.","actors":[{"actorName":"Margaux Hemingway","urlProfile":"http://www.imdb.com/name/nm0000029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzk1MDE5NF5BMl5BanBnXkFtZTYwMDgzNTMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1954","placeOfBirth":" Portland, Oregon, USA","birthName":"Margot Louise Hemingway","height":"6' (1.83 m)","bio":"Born in Portland, Oregon, she grew up in on a farm in Ketchum, Idaho. But dad was Jack Hemingway, son of the Nobel prize winning author Ernest Hemingway and, with that heritage, fame was almost foreordained. By the time she was 21, after the lead in the rape melodrama Lipstick (1976), she had a budding movie career, a $1 million promotional contract with Faberge perfume, and her face on magazine covers around the world. But, within the decade, it was all lost. Her sister Mariel Hemingway, whose role in Lipstick (1976) had been suggested by Margaux, was a much greater success; she had started drinking heavily; two marriages had failed. In 1988, she checked herself into the Betty Ford Center for rehabilitation. Attempts to parley her recovery from alcohol into a revived career failed and, by the time she was 41, almost nothing was left. She lived alone in a studio apartment, no children, no lover, few friends. Neighbors informed police that she had not been seen for days and, on July 1, they entered through a 2nd floor window. Dental records had to be used to confirm her identity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzk1MDE5NF5BMl5BanBnXkFtZTYwMDgzNTMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000029","name":"Margaux Hemingway","idIMDB":"nm0000029"},"actorId":"nm0000029","character":"Jean Searage","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cole Hauser","urlProfile":"http://www.imdb.com/name/nm0369513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTEzNDk2OV5BMl5BanBnXkFtZTgwNDYyMzQwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1975","placeOfBirth":" Santa Barbara, California, USA","birthName":"Cole Kenneth Hauser","height":"6' 1\" (1.85 m)","bio":"Cole Hauser was born in Santa Barbara, California. He is the son of Cass Warner, who founded a film production company (Warner Sisters), and Wings Hauser, an actor. His grandfathers were screenwriters Dwight Hauser and Milton Sperling, and his maternal great-grandfather was film mogul Harry M. Warner, of Warner Bros. His father is of German, Irish, and Belgian (Walloon) descent, and his mother is from a Jewish family (from Austria, Russia, and Poland). He grew up in California, Oregon and Florida. Hauser has had a long and impressive career in acting. He made his big screen debut in \"School Ties\" where many other then up and coming actors had their starts. He next went on to star in Richard Linklater's Cult Classic \"Dazed and Confused.\" Other feature credits include \"Tigerland,\" for which Cole received an Independent Spirit Award nomination, \"White Oleander\" for which he received a Movieline breakthrough performance also, \"Hart's War,\" \"Tears of the Sun,\" \"Higher Learning,\" and \"Too Fast, Too Furious,\" to name a few. In 2014 Hauser will be seen in two anticipated projects. This spring he can be seen opposite Johnny Depp in the Warner Bros release of Transcendence (2014). Immediately following he will star in DirecTV's original drama \"Rogue\" opposite Thandie Newton. The show, in its second season has been a big draw for the network. Earlier this year he was seen in Antoine Fuqua's Olympus Has Fallen (2013), an action ensemble which included Aaron Eckhart, Gerald Butler and Morgan Freeman. Hauser lives outside of Los Angeles with his wife, photographer Cynthia Daniel, and three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTEzNDk2OV5BMl5BanBnXkFtZTgwNDYyMzQwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369513","name":"Cole Hauser","idIMDB":"nm0369513"},"actorId":"nm0369513","character":"Cal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wings Hauser","urlProfile":"http://www.imdb.com/name/nm0369567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTQ4Nzk4OV5BMl5BanBnXkFtZTcwMjM1MTE3NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1947","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Gerald Dwight Hauser","height":"6' 2\" (1.88 m)","bio":"Wings Hauser married his young music and filmmaking partner, actress/filmmaker Cali Lili Hauser on June 12, 2012. Having often been compared to Richard Widmark for some of his \"mean\" roles, he has played a variety of equally remarkable roles in films and on TV. After a high-school career centered in sports (his name \"Wings\" is taken from the wing-back position he played in football), he chose to lean toward the arts - acting and music (including an album of his original music for RCA) - instead of pursuing professional sports. Having descended from an artistic and talented family, this choice was a heartfelt one. Wings is the son of writer/producer/actor Dwight Hauser, who worked on (amongst many other projects) the classic \"Whistler\" radio series. Son of the beautiful Geraldine Hauser, (who was the daughter of author Tom Thienes - \"Whimseys\" and others). He raised a child as a single father, having arrived in Hollywood \"with thirty dollars and a box of pampers\" - and actually earned his career accomplishments with hard work and dedication. Father of actor Cole Hauser.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTQ4Nzk4OV5BMl5BanBnXkFtZTcwMjM1MTE3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369567","name":"Wings Hauser","idIMDB":"nm0369567"},"actorId":"nm0369567","character":"Sheriff Ralph Baker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Saxon","urlProfile":"http://www.imdb.com/name/nm0768334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1935","placeOfBirth":" Brooklyn, New York, USA","birthName":"Carmine Orrico","height":"5' 10½\" (1.79 m)","bio":"John Saxon has appeared in nearly 200 roles in the movies and on television in a more-than half-century-long career that has stretched over seven decades since he made his big screen debut in 1954 in uncredited small roles in It Should Happen to You (1954) and George Cukor's A Star Is Born (1954). Born Carmine Orrico on August 5, 1936 in Brooklyn, New York, the son of Italian immigrants Antonio Orrico and Anna (née Protettore), he studied acting with Stella Adler after graduating from New Utrecht High School. He was discovered by talent agent Henry Willson, the man most famous for creating and representing Rock Hudson (as well as a stable of \"beefcake\" male stars and starlets), who signed him up after he saw Saxon's picture on the cover of a magazine. Willson brought the 16-year-old to Southern California, changed his name to John Saxon, and launched his career. Saxon made his television debut on Richard Boone's series Medic (1954) in 1955 and got his first substantial (and credited) role in Running Wild (1955), playing a juvenile delinquent. In the Esther Williams vehicle The Unguarded Moment (1956) (one of her rare dramatic roles), the film's marketing campaign spotlighted him, trumpeting the movie as \"Co-starring the exciting new personality John Saxon.\". By 1958, he seemed to have established himself as a supporting player in A-List pictures, being featured in Blake Edwards's comedy This Happy Feeling (1958) headlined by Debbie Reynolds and Vincente Minnelli's The Reluctant Debutante (1958) with Rex Harrison and Sandra Dee. In the next five years, he worked steadily, including supporting roles in John Huston's The Unforgiven (1960), the James Stewart comedy Mr. Hobbs Takes a Vacation (1962) and Otto Preminger's The Cardinal (1963) while having first billing in the B-movies Cry Tough (1959) and War Hunt (1962). Fluent in Italian, he made his first pictures in Italy in the period, Agostino (1962) and Mario Bava's Evil Eye (1963). Despite his good work with major directors, he failed to succeed as a star. By 1965, he was appearing in the likes of Blood Beast from Outer Space (1965), albeit, top-billed. A more emblematic picture was Sidney J. Furie's The Appaloosa (1966), in which he appeared in Mexican bandito drag as the man who steals the horse of Marlon Brando, another Stella Adler student. The \"ethnic-looking\" Saxon would reprise the role, of sorts, in John Sturges Joe Kidd (1972) in support of superstar Clint Eastwood. In those less politically correct times, many an Italian-American with a dark complexion would be relied on to play Mexicans, Native Americans and other \"exotic\" types like Mongols. Saxon played everything from an Indian chief on Bonanza (1959) to Marco Polo on The Time Tunnel (1966). From 1969 to 1972 season, he was a star of the television series The Bold Ones: The New Doctors (1969), playing the brilliant surgeon Theodore Stuart. When the series ended, he took one of his most famous roles when Bruce Lee demurred over casting Rod Taylor as he was too tall. A black belt in karate, Saxon appeared as Roper in Opération dragon (1973). He has continued to play a wide variety of roles on television and in motion pictures ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768334","name":"John Saxon","idIMDB":"nm0768334"},"actorId":"nm0768334","character":"Charles Searage","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patti D'Arbanville","urlProfile":"http://www.imdb.com/name/nm0001091","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzk1NzgwN15BMl5BanBnXkFtZTcwOTk5NTM2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1951","placeOfBirth":" New York City, New York, USA","birthName":"Patricia d'Arbanville","height":"5' 4\" (1.63 m)","bio":"Patti was 17 before her mother allowed her to appear in an Andy Warhol project but, as a matter of fact, Warhol already discovered her at the age of 13. Her start in a lesbian love-scene in Flesh (1968), was followed by a string of movies with some degree of nudity included. Since then, she has steadily appeared in good supporting roles, only with a few time-outs, i.e. for bearing Don Johnson's son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzk1NzgwN15BMl5BanBnXkFtZTcwOTk5NTM2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001091","name":"Patti D'Arbanville","idIMDB":"nm0001091"},"actorId":"nm0001091","character":"Barbara Griffin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frances Fisher","urlProfile":"http://www.imdb.com/name/nm0004920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NjU0ODU0OV5BMl5BanBnXkFtZTgwMzIwOTQ2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1952","placeOfBirth":" Milford-on-the-sea, Hampshire, England, UK","height":"5' 4\" (1.63 m)","bio":"Frances Fisher began by apprenticing at the Barter Theatre in Abingdon, Virginia. She spent 14 years based in New York City, playing leads in over 30 productions of plays by such noted writers as John Arden, Noël Coward, Emily Mann, Joe Orton, Sam Shepard, William Shakespeare, Jean Claude Van Italie, Eudora Welty and Tennessee Williams. She won a Drama Logue Award - Best Ensemble for the American Premier of Caryl Churchill's \"Three More Sleepless Nights\", played in the American premier of Judith Thompson's \"The Crackwalker\" and originated roles in Elia Kazan's \"The Chain\" and Arthur Miller's last play \"Finishing the Picture\". Besides working with Kazan and Miller, some of Ms. Fisher's more interesting theater experiences were creating roles from two great works of literature: George Orwell's \"1984\" and Victor Hugo's \"The Hunchback of Notre Dame\". Ms. Fisher worked at the Mark Taper Forum in Los Angeles alongside Annette Bening and Alfred Molina in Anton Chekhov's \"The Cherry Orchard\". Fisher starred in \"Sexy Laundry\" with Paul Ben-Victor at the Hayworth Theatre in Los Angeles. She studied with Stella Adler and became a lifetime member of the Actors Studio by actually \"walking up the stairs\" and auditioning for legendary acting teacher Lee Strasberg. Ms. Fisher recently completed The Host (2013), Love on the Run (2016), Red Wing (2013) and will work with Catherine Hardwicke in her new film Plush (2013) in August 2012. Ms. Fisher was honored for a Lifetime Achievement Award 2011 in her old hometown of the Pacific Palisades, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NjU0ODU0OV5BMl5BanBnXkFtZTgwMzIwOTQ2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004920","name":"Frances Fisher","idIMDB":"nm0004920"},"actorId":"nm0004920","character":"Jo Baker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randee Heller","urlProfile":"http://www.imdb.com/name/nm0375374","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcwNTIzOTYxN15BMl5BanBnXkFtZTcwMTQ1MTA5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1947","placeOfBirth":" Brooklyn, New York, USA","height":"5' 8\" (1.73 m)","bio":"Randee Heller was born on June 10, 1947 in Brooklyn, New York, USA. She is an actress, known for The Karate Kid (1984), The Karate Kid Part III (1989) and Sa mère ou moi! (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcwNTIzOTYxN15BMl5BanBnXkFtZTcwMTQ1MTA5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0375374","name":"Randee Heller","idIMDB":"nm0375374"},"actorId":"nm0375374","character":"Ruth Epstein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Kwong","urlProfile":"http://www.imdb.com/name/nm0477286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNzE3Mzg4MV5BMl5BanBnXkFtZTYwNzQ1Njcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1952","placeOfBirth":" Los Angeles, California, USA","bio":"Peter Kwong is a veteran of film, television and stage, best known for his roles as Rain in Big Trouble in Little China and as Tommy Tong in Eddie Murphy's Golden Child. He just finished filming Cooties, starring Elijah Wood, and has appeared in more than 100 film and television roles. Other favorite films include roles in The Presidio, Angel Town, Never Too Young To Die, Gleaming The Cube, Steel Justice, Theodore Rex with Whoopie Goldberg, Row Your Boat with Jon Bon Jovi and Bai Ling, and Pearl S. Buck's historic epic The Living Reed as the King of Korea. On television you may have seen him in \"Sullivan & Son,\" \"Malcolm and Eddie,\" \"Sisters,\" \"The Wayan Brothers,\" \"Daddy Dearest,\" \"Renegade,\" \" Top Cops,\" \"Full House,\" \"Doctor, Doctor\". On stage, Mr. Kwong portrayed the lead role as Dr. Haing S. Ngor in The Survivor: A Cambodian Odyssey by Jon Lipsky at the Actors Theatre of Louisville/Humana Festival, and stretched his musical theater skills in Mame with the late Juliet Prowse. In addition to his thriving acting career, Kwong recently served on the Board of Governors of the Academy of Television Arts & Sciences for two terms and served on The Board of Directors of SAG-AFTRA, chairman of the Committee for Racial Equality of Actors Equity Association, and the Vice-Chairs of the Ethnic Equal Opportunities and the Young Performers Committees of the Screen Actors Guild. He is a member of the Academy of Motion Picture Arts and Sciences & Television Academy. He has also served with the Los Angeles Asian Pacific Heritage Week. He has emceed events for Visual Communications, The Lotus Festival, Asian Business League, and the Los Angeles Miss Chinatown Pageant four times and had the privilege to go to Namibia, Africa to judge the Miss Universe Pageant. Kwong's talents have won him an honorary membership in the Los Angeles Mime Guild. He is featured dancing on numerous music videos, including Ed Sheeran's Sing. He studied Northern Shao lin Kung-fu which has allowed him to do many of his own stunts and eventually branch off to more meditative disciplines such as Tai Chi Chuan and Chi Kung Meditation. He teaches Tai Chi Chuan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNzE3Mzg4MV5BMl5BanBnXkFtZTYwNzQ1Njcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0477286","name":"Peter Kwong","idIMDB":"nm0477286"},"actorId":"nm0477286","character":"David Wong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lauren Woodland","urlProfile":"http://www.imdb.com/name/nm0940333","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODQ4Njg4Nl5BMl5BanBnXkFtZTYwMjQwMTEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1977","placeOfBirth":" Carson City, Nevada, USA","height":"5' 4\" (1.63 m)","bio":"Lauren Woodland was born on October 28, 1977 in Carson City, Nevada, USA. She is an actress, known for The Young and the Restless (1973), Port Charles (1997) and Alien Nation (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODQ4Njg4Nl5BMl5BanBnXkFtZTYwMjQwMTEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940333","name":"Lauren Woodland","idIMDB":"nm0940333"},"actorId":"nm0940333","character":"Sue Baker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Arenberg","urlProfile":"http://www.imdb.com/name/nm0034305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDg2Mjg2NF5BMl5BanBnXkFtZTYwMzkwMDY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1962","placeOfBirth":" Palo Alto, California, USA","height":"5' 4\" (1.63 m)","bio":"Lee Arenberg has the remarkable ability to morph himself into frightening aliens, twisted psychotherapists, lascivious entertainment executives and everything in between. Most frequently referred to as a character actor, Arenberg maintains a flourishing acting career--almost 20 years spanning television, stage and film. Arenberg has appeared in more than 30 movies, including Cradle Will Rock (1999), RoboCop 3 (1993), Waterworld (1995), Bob Roberts (1992), The Apocalypse (1997), Cross My Heart (1987) and the fantasy adventure feature Dungeons & Dragons (2000). Bitten by the acting bug at age eight when he portrayed David in his Hebrew school play, \"Killing Goliath\", Arenberg notes that the parable \"could be the title of any actor's chances in this game.\" A native Angeleno, Lee attended Santa Monica high school with \"brat packers\" Sean Penn, Robert Downey Jr. and Emilio Estevez, and co-wrote a play with Estevez which was directed by Penn. Lee's first professional job was in 1986 at the Mark Taper Forum in \"Ghetto\", a play directed by Gordon Davidson. Within weeks he was cast in three films, including the role of Norton in the feature Tapeheads (1988)opposite Tim Robbins and John Cusack. Guest appearances on television began in 1987 with the hit sitcom Perfect Strangers (1986), and have continued with memorable roles such as the parking space-stealing New Yorker on Seinfeld (1989) and as the murderous rock promoter opposite Katey Sagal and Sam Kinison in Tales from the Crypt (1989), as well as roles on Arli$$ (1996), Friends (1994), Star Trek: The Next Generation (1987), Star Trek: Deep Space Nine (1993) and Star Trek: Voyager (1995). Arenberg can also be seen in the role of the notoriously huge studio head, Bobby G., on the controversial syndicated comedy Action (1999) opposite series star Jay Mohr. Arenberg names his family and friends as his inspirations, and states that having grown up on Los Angeles' Westside, he was able to see actors as the parents of friends and classmates, not as just as movie stars. \"It also gave me an honest assessment of the industry and what I was getting myself into,\" he laughs. He credits \"fear of failure\" as his main motivation, and admires the talents and creativity of such legendary actors Paul Muni, Lon Chaney and Boris Karloff. Lee also credits much of his development as an actor to his participation in the Actors' Gang, one of Los Angeles' oldest theater companies. The Actors' Gang was founded by Lee in 1981 with Tim Robbins and other friends from UCLA. After 20 years as an actor in the group, Lee recently made his writing and directing debut with Foursome, a play about golf, sex and witchcraft. In his leisure time, Arenberg enjoys golf, cooking, blues harmonica, video games and pitching for his softball team Bubblin' Crude, which is made up of other actors, many of whom are friends from high school. He is involved with St. Jude's Children's Hospital and other children's health causes, and animal rights organizations, participating regularly in fund raising efforts on behalf of those charitable causes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDg2Mjg2NF5BMl5BanBnXkFtZTYwMzkwMDY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0034305","name":"Lee Arenberg","idIMDB":"nm0034305"},"actorId":"nm0034305","character":"Huey - Henchman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Dryer","urlProfile":"http://www.imdb.com/name/nm0238739","urlPhoto":"","biography":{"dateOfBirth":"9 October 1951","placeOfBirth":" USA","birthName":"Robert Carpenter","bio":"Robert Dryer was born on October 9, 1951 in the USA as Robert Carpenter. He is an actor, known for Savage Streets (1984), The Borrower (1991) and Behind Enemy Lines (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0238739","name":"Robert Dryer","nicknames":["Carp"],"idIMDB":"nm0238739"},"actorId":"nm0238739","character":"Tall Henchman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan Jones","urlProfile":"http://www.imdb.com/name/nm0428896","urlPhoto":"","biography":{"dateOfBirth":"15 June 1928","placeOfBirth":" Wooster, Ohio, USA","birthName":"Morgan Adair Jones","bio":"Morgan Jones was born on June 15, 1928 in Wooster, Ohio, USA as Morgan Adair Jones. He was an actor, known for Forbidden Planet (1956), The Blue Angels (1960) and Not of This Earth (1957). He was married to Carole Tetzlaff and Joan Granville. He died on January 13, 2012 in Tarzana, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0428896","name":"Morgan Jones","idIMDB":"nm0428896"},"actorId":"nm0428896","character":"Dr. Cantwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff MacKay","urlProfile":"http://www.imdb.com/name/nm0533171","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUyNzYwMF5BMl5BanBnXkFtZTcwMDUzNDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1948","placeOfBirth":" Dallas, Texas, USA","birthName":"Jeffery Neill MacKay","bio":"Jeff MacKay was born on October 20, 1948 in Dallas, Texas, USA as Jeffery Neill MacKay. He was an actor, known for All the President's Men (1976), Tales of the Gold Monkey (1982) and Black Sheep Squadron (1976). He died on August 22, 2008 in Tulsa, Oklahoma, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUyNzYwMF5BMl5BanBnXkFtZTcwMDUzNDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533171","name":"Jeff MacKay","nicknames":["Mac"],"idIMDB":"nm0533171"},"actorId":"nm0533171","character":"Deputy Bob Sprague","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Mullavey","urlProfile":"http://www.imdb.com/name/nm0611976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDM5MDkxMl5BMl5BanBnXkFtZTYwNTA4MjM4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1939","placeOfBirth":" Buffalo, New York, USA","bio":"Greg Mullavey was born on September 10, 1939 in Buffalo, New York, USA. He is an actor, known for Mary Hartman, Mary Hartman (1976), Bob & Carol & Ted & Alice (1969) and The Census Taker (1984). He was previously married to Meredith MacRae.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDM5MDkxMl5BMl5BanBnXkFtZTYwNTA4MjM4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611976","name":"Greg Mullavey","idIMDB":"nm0611976"},"actorId":"nm0611976","character":"Richard Stewart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Rhodes","urlProfile":"http://www.imdb.com/name/nm0722451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzA0MjgwNF5BMl5BanBnXkFtZTgwMTA3MzQ2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1947","placeOfBirth":" Rosiclare, Illinois, USA","bio":"From Rosiclare, Illinois, Jennifer headed for the Drama Department at Southern Illinois University where, after touring a semester playing \"Cherie\" in \"Bus Stop\", she was hooked. She went to New York where she studied acting at the Herbert Berghof Studio, performed Off-Broadway, toured with the Stanley Wolff Players in the Catskills and did two seasons of Summer Stock. After moving to Los Angeles, she appeared in over 80 television shows and films, She is best known for playing the Grande Dame Witch, Penny 'Grams' Halliwell, in \"Charmed\". Guest Starring roles include \"Lou Grant\", \"L.A. Law\", \"Murphy Brown\", \"Fame\", \"Designing Women\", \"Friends\", \"Ally McBeal\" and \"Grey's Anatomy\". In the cult film, \"Heathers\", she played Winona Ryder's off-the-wall mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzA0MjgwNF5BMl5BanBnXkFtZTgwMTA3MzQ2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0722451","name":"Jennifer Rhodes","idIMDB":"nm0722451"},"actorId":"nm0722451","character":"Brook's Landlady","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0106954","urlIMDB":"http://www.imdb.com/title/tt0106954","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min) (Germany)","1 hr 32 min (92 min) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"3.9","filmingLocations":[],"rated":"R","awards":[],"votes":"37","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["male rear nudity","second part","policeman","police officer","police","sequel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:11:06"}}