{"data":{"movies":[{"title":"Dance with the Devil","originalTitle":"Perdita Durango","year":"1997","releaseDate":"19971031","directors":[{"name":"Álex de la Iglesia","id":"nm0407067"}],"writers":[{"name":"Barry Gifford","id":"nm0317510"},{"name":"Barry Gifford","id":"nm0317510"}],"runtime":"126 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2UwOWQ3MmQtNmMyNS00MTM3LWEzM2QtMzQ4YjgxNDU2ODllXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1.jpg","countries":["Mexico","USA","Spain"],"languages":["English","Spanish"],"genres":["Action","Crime","Horror","Romance"],"plot":"Rough girl Perdita and her demonic lover Romeo Dolorosa need humans to sacrifice following Romeo's religion before he can go on a mission ordered by mob boss Santos. They kidnap teen sweethearts Duane and Estelle and travel with them to Las-Vegas.","simplePlot":"A psychotic criminal couple kidnaps a random teenage couple. The woman rapes the male captive, and lets him watch his lover being raped by the man. They then plan to sacrifice the couple.","actors":[{"actorName":"Rosie Perez","urlProfile":"http://www.imdb.com/name/nm0001609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE2ODY5MjU0NV5BMl5BanBnXkFtZTcwMjE3MzQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1964","placeOfBirth":" Bushwick, Brooklyn, New York City, New York, USA","birthName":"Rosa Maria Perez","height":"5' 1½\" (1.56 m)","bio":"Rosie Perez was born in Bushwick, Brooklyn, New York City to Lydia Perez and Ismael Serrano, a merchant marine. She is of Puerto Rican descent. Rosie attended Grover Cleveland High School located in Ridgewood, Queens, New York, and later enrolled at Los Angeles City College in Los Angeles, California. Rosie Perez was in her second year of college, and just about to move back to New York from Los Angeles. Her friends had given her a going away party. When Spike Lee proposed that she work in his film Do the Right Thing (1989), she accepted. It would be first major acting role. She went on play the supporting role of Carla Rodrigo in Peter Weir's Fearless (1993), for which was nominated an Academy Award for Best Supporting Actress (she lost to Anna Paquin for La leçon de piano (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE2ODY5MjU0NV5BMl5BanBnXkFtZTcwMjE3MzQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001609","name":"Rosie Perez","idIMDB":"nm0001609"},"actorId":"nm0001609","character":"Perdita Durango","urlCharacter":"http://www.imdb.com/character/ch0011993","main":true},{"actorName":"Javier Bardem","urlProfile":"http://www.imdb.com/name/nm0000849","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTc4NTYzMF5BMl5BanBnXkFtZTcwNDIwOTY1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1969","placeOfBirth":" Las Palmas de Gran Canaria, Gran Canaria, Canary Islands, Spain","birthName":"Javier Ángel Encinas Bardem","height":"5' 11¼\" (1.81 m)","bio":"Javier Bardem is the youngest member of a family of actors that has been making films since the early days of Spanish cinema. He was born in Las Palmas de Gran Canaria, Spain, to actress Pilar Bardem (María del Pilar Bardem Muñoz) and businessman José Carlos Encinas Doussinague. His maternal grandparents were actors Rafael Bardem and Matilde Muñoz Sampedro, and his uncle is screenwriter Juan Antonio Bardem. He got his start in the family business, at age six, when he appeared in his first feature, \"El picaro\" (1974) (A.K.A. The Scoundrel). During his teenage years, he acted in several TV series, played rugby for the Spanish National Team, and toured the country with an independent theatrical group. Javier's early film role as a sexy stud in the black comedy, Jamón, Jamón (1992) (aka Ham Ham) propelled him to instant popularity and threatened to typecast him as nothing more than a brawny sex symbol. Determined to avert a beefcake image, he refused similar subsequent roles and has gone on to win acclaim for his ability to appear almost unrecognizable from film to film. With over 25 movies and numerous awards under his belt, it is Javier's stirring, passionate performance as the persecuted Cuban writer, Reynaldo Arenas, in Avant la nuit (2000) that will long be remembered as his breakthrough role. He received five Best Actor awards and a Best Actor Oscar nomination for his portrayal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTc4NTYzMF5BMl5BanBnXkFtZTcwNDIwOTY1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000849","name":"Javier Bardem","idIMDB":"nm0000849"},"actorId":"nm0000849","character":"Romeo","urlCharacter":"http://www.imdb.com/character/ch0086418","main":true},{"actorName":"Harley Cross","urlProfile":"http://www.imdb.com/name/nm0189172","urlPhoto":"","biography":{"dateOfBirth":"31 March 1978","placeOfBirth":" New York City, New York, USA","bio":"Harley Cross was born in New York in 1978. He first became interested in acting at age four when he was chosen by an audience to participate in a children's play. He attended school at Massillion in Paris, France and speaks fluent French. Cross made his film debut as Diane Keaton's son in Mrs. Soffel (1984). He went on to portray Tom Berenger's son in Someone to Watch Over Me (1987) and Jane Fonda's son in Stanley & Iris (1990). Cross was excellent as Martin Sheen's son in the disturbing horror film The Believers (1987) and was likewise outstanding as a crafty little boy who's abducted by ruthless hired killers Roy Scheider and Adam Baldwin in the terrific road movie thriller Cohen and Tate (1988). Cross gave his most impressive and accomplished performance to date as a deeply troubled and psychotic 12-year-old juvenile delinquent sociopath in the potent and unnerving indie drama The Boy Who Cried Bitch (1991). Cross recently had a small part as a young man in a gay bar in the acclaimed _Kinsey_. In addition to his motion picture credits, Cross has also acted in several TV commercials and was one of the stars of the short-lived sitcom Sister Kate (1989). He's also appeared as a guest star on Law & Order (1990), Touched by an Angel (1994) and other shows. An avid sports enthusiast who enjoys scuba diving, horseback riding and ice-skating, Harley Cross is the co-founder of the breath mint company Hint Mint.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0189172","name":"Harley Cross","idIMDB":"nm0189172"},"actorId":"nm0189172","character":"Duane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aimee Graham","urlProfile":"http://www.imdb.com/name/nm0333888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDUwNjEwOV5BMl5BanBnXkFtZTYwNDY0OTky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1971","placeOfBirth":" Milwaukee, Wisconsin, USA","height":"5' 7\" (1.7 m)","bio":"Aimee Graham was born on September 20, 1971 in Milwaukee, Wisconsin, USA. She is an actress and director, known for Jackie Brown (1997), From Dusk Till Dawn (1996) and Shriek If You Know What I Did Last Friday the Thirteenth (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDUwNjEwOV5BMl5BanBnXkFtZTYwNDY0OTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0333888","name":"Aimee Graham","idIMDB":"nm0333888"},"actorId":"nm0333888","character":"Estelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Gandolfini","urlProfile":"http://www.imdb.com/name/nm0001254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDY4NDMzN15BMl5BanBnXkFtZTcwNDkzNDE5NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1961","placeOfBirth":" Westwood, New Jersey, USA","birthName":"James Joseph Gandolfini Jr.","height":"6' 0½\" (1.84 m)","bio":"James Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin. James' breakthrough role was his portrayal of Virgil the hitman in Tony Scott's True Romance (1993), but the role that brought him worldwide fame and accolades was as complex Mafia boss Tony Soprano in HBO's smash hit series The Sopranos (1999). He died unexpectedly of a heart attack in 2013 while vacationing in Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDY4NDMzN15BMl5BanBnXkFtZTcwNDkzNDE5NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001254","name":"James Gandolfini","nicknames":["Jim","Jimmy"],"idIMDB":"nm0001254"},"actorId":"nm0001254","character":"Dumas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Screamin' Jay Hawkins","urlProfile":"http://www.imdb.com/name/nm0370221","urlPhoto":"","biography":{"dateOfBirth":"18 July 1929","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Jalacy J. Hawkins","height":"6' (1.83 m)","bio":"Screamin' Jay Hawkins was best known for his song \"I Put a Spell On You, \" which he recorded on the Okeh label in 1956 and which helped win him cult status in the United States, Europe and Japan. He had originally planned the tune as a ballad, but after a night of heavy drinking he tried again--screaming, yelling and groaning--and never looked back. The snorting, some say \"cannibalistic\" delivery got \"I Put A Spell On You\" banned from radio stations across the country. Hawkins went on to use the same demented style again and again. An outrageous performer, he used bizarre stage props, often emerging out of coffins during shows. He would wield rubber snakes and fake tarantulas and wear a boar's tooth around his neck or a bone clipped to his nose. Jay Hawkins got his first break in 1951 as a pianist-valet to veteran jazz guitarist Tiny Grimes. His recording debut was 1952's \"Why Did You Waste My Time, \" backed by Grimes and his Rockin' Highlanders. In the 1960s, Ha!","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0370221","name":"Screamin' Jay Hawkins","idIMDB":"nm0370221"},"actorId":"nm0370221","character":"Adolfo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Demián Bichir","urlProfile":"http://www.imdb.com/name/nm0065007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNDMwMzI3OV5BMl5BanBnXkFtZTgwNTk2NzMyMTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1963","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Demián Bichir Nájera","height":"5' 10\" (1.78 m)","bio":"Demián Bichir Najera was born in Mexico City, Mexico, to Maricruz Nájera (María de la Cruz Nájera Botello), an actress, and Alejandro Bichir (Alejandro Bichir Batres), a theatre director. His parents met in the theatre. He has two brothers who are also actors, Bruno Bichir and Odiseo Bichir. Demián began acting, at age 3 at the Palace of Fine Arts in his native Mexico City. He became a member of the National Theater Company of Mexico at age 13 and acted in several plays directed by renowned international masters such as José Tamayo, Clifford Williams and José Quintero. He starred in the Spanish versions of Ah! Wilderness, Equus, Broadway Bound, The Ghost Sonata and Malcolm VS the eunuchs. He made his Amrican stage debut in By the waters of Babylon at the Geffen Play House in Los Angeles. At age 22, he moved to New York. He decided he wanted a break from acting, so that he could experience life and learn English. He got a job as a busboy at Rosa Mexicano, where he would make guacamole at customer's tables. He then moved to Los Angeles for four years, attempting to land acting roles. But, unsuccessful, he was tempted back to Mexico with the offer of role in Hasta Morir, for which he won an Ariel (the Mexican equivalent of an Oscar). His career took off in Mexico. In 1991, his movie Sexo, pudor y lágrimas broke Mexican box-office records becoming the #1 movie in the history of Mexican cinema. He decided to try his luck again in America. His American debut occurred in the television movie In the Time of the Butterflies (2001), starring Salma Hayek. Later, he went on to play Fidel Castro in Che - 1ère partie - L'Argentin (2008) and Che - 2ème partie - Guerilla (2008). In 2012, he was nominated for an Oscar for Best Performance by an Actor in a Leading Role in A Better Life (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNDMwMzI3OV5BMl5BanBnXkFtZTgwNTk2NzMyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065007","name":"Demián Bichir","idIMDB":"nm0065007"},"actorId":"nm0065007","character":"Catalina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos Bardem","urlProfile":"http://www.imdb.com/name/nm0054214","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDE5NzE4M15BMl5BanBnXkFtZTgwMTAxOTYwNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1963","placeOfBirth":" Madrid, Spain","birthName":"Carlos Encinas Bardem","bio":"Carlos Bardem was born on March 7, 1963 in Madrid, Spain as Carlos Encinas Bardem. He is an actor and writer, known for Cellule 211 (2009), Assassin's Creed (2016) and Días de gracia (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDE5NzE4M15BMl5BanBnXkFtZTgwMTAxOTYwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0054214","name":"Carlos Bardem","idIMDB":"nm0054214"},"actorId":"nm0054214","character":"Reggie","urlCharacter":"http://www.imdb.com/character/ch0048361","main":true},{"actorName":"Santiago Segura","urlProfile":"http://www.imdb.com/name/nm0782213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTA0NTE1M15BMl5BanBnXkFtZTcwODQ2NTAxNA@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1965","placeOfBirth":" Madrid, Spain","birthName":"Santiago Segura Silva","height":"5' 7¾\" (1.72 m)","bio":"Born in Madrid, Santiago Segura started his career by making his first short movie at the age of fourteen. After studying Arts in Madrid, he finally decided to become a filmmaker. His first short film Relatos de la medianoche (1989) was made with a budget of only 7.000 pts. (about 60 dollars). After that, he appeared as a contestant in several Spanish TV quiz shows, such as Locos por la tele (1990) and No te rías, que es peor (1990). With the money he made of those appareances, he directed Evilio. (1992) and shortly after, Perturbado (1993), winning a Goya for the best short film in 1994. His last short film is the sequel Evilio vuelve (El purificador) (1994). He's a very good friend of the Spanish director Álex de la Iglesia and he has appeared in all of his films. In 1998, he directed his firt feature film, the smashing hit Torrente, le bras gauche de la loi (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTA0NTE1M15BMl5BanBnXkFtZTcwODQ2NTAxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0782213","name":"Santiago Segura","idIMDB":"nm0782213"},"actorId":"nm0782213","character":"Shorty Dee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Porter","urlProfile":"http://www.imdb.com/name/nm0692133","urlPhoto":"","biography":{"bio":"Harry Porter is an actor, known for Péché originel (2001), Dance with the Devil (1997) and From Prada to Nada (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0692133","name":"Harry Porter","idIMDB":"nm0692133"},"actorId":"nm0692133","character":"Ford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos Arau","urlProfile":"http://www.imdb.com/name/nm0033183","urlPhoto":"","biography":{"bio":"Carlos Arau is an actor, known for Dance with the Devil (1997), Un mundo maravilloso (2006) and Mujeres insumisas (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0033183","name":"Carlos Arau","idIMDB":"nm0033183"},"actorId":"nm0033183","character":"Phillips","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Stroud","urlProfile":"http://www.imdb.com/name/nm0835144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjUzMjI4OF5BMl5BanBnXkFtZTcwOTMzMDMyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1943","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Donald Lee Stroud","height":"6' 2\" (1.88 m)","bio":"He's the son of Vaudeville great, Clarence Stroud, of the Stroud Twins and singer Ann McCormack, who toured the world with Frank Sinatra. Don grew up on the beach in Honolulu, Hawaii, where his stepfather, Paul Livermore, and his mother, Ann, owned and operated the popular \"Embers Steak House\" and nightclub where Ann performed nightly. Don thrived on the beach in Waikiki under the watchful eyes of such mentors as Blackout, Mud, Buckshot, Rabbit and Steamboat. He learned much from these famous beach boys and in 1960, at the age of 17, he placed fourth in the \"Duke Kahanamoku World Surfing Championship\" at Makaha, Hawaii. Don was surfing at Waikiki when he was discovered. Actor Troy Donahue was filming Hawaiian Eye (1959) and needed a stunt double for his surfing scenes. Don, at 18, 6' 2\" and 175 pounds, stepped up and was hired on the spot. He loved the gig so much, he decided to go to Hollywood to give it a try. Upon arriving in L.A., he landed a variety of jobs, including parking cars, bouncer and then manager of the world famous \"Whiskey A Go-Go\" nightclub on the Sunset Strip, where such greats as Janis Joplin, Jimi Hendrix and Jim Morrison of the \"Doors\" appeared. It was at the \"Whiskey\" that actor Sidney Poitier turned Don on to his acting career. Don went on to become one of Hollywood's great heavies and character actors. He has starred in over 100 movies and 175 television shows to date. He has also starred in four television series, notably Mickey Spillane's The New Mike Hammer (1984) with Stacy Keach and The New Gidget (1986) where he was a natural to play the \"Kahuna\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjUzMjI4OF5BMl5BanBnXkFtZTcwOTMzMDMyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835144","name":"Don Stroud","idIMDB":"nm0835144"},"actorId":"nm0835144","character":"Santos","urlCharacter":"http://www.imdb.com/character/ch0048359","main":true},{"actorName":"Alex Cox","urlProfile":"http://www.imdb.com/name/nm0007182","urlPhoto":"","biography":{"dateOfBirth":"15 December 1954","placeOfBirth":" Liverpool, England, UK","bio":"Alex Cox was born on December 15, 1954 in Liverpool, England. He is an actor and director, known for Repo Man (1984), Sid and Nancy (1986) and Fear and Loathing in Las Vegas (1998). He is married to Tod Davies.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0007182","name":"Alex Cox","idIMDB":"nm0007182"},"actorId":"nm0007182","character":"Doyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miguel Galván","urlProfile":"http://www.imdb.com/name/nm0303496","urlPhoto":"","biography":{"dateOfBirth":"13 October 1957","placeOfBirth":" Juan Aldama, Zacatecas, Mexico","bio":"Miguel Galván was born on October 13, 1957 in Juan Aldama, Zacatecas, Mexico. He is known for his work on Distilling Love (2007), Dance with the Devil (1997) and Sexo, pudor y lágrimas (1999). He died on April 14, 2008 in Mexico City, Mexico.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0303496","name":"Miguel Galván","idIMDB":"nm0303496"},"actorId":"nm0303496","character":"Doug","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Regina Orozco","urlProfile":"http://www.imdb.com/name/nm0650495","urlPhoto":"","biography":{"dateOfBirth":"1964","placeOfBirth":" Mexico City, Distrito Federal, Mexico","bio":"Regina Orozco was born in 1964 in Mexico City, Distrito Federal, Mexico. She is an actress, known for Deep Crimson (1996), Chilango Chronicles (2009) and Get the Gringo (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0650495","name":"Regina Orozco","nicknames":["La Megabizcocho"],"idIMDB":"nm0650495"},"actorId":"nm0650495","character":"Lilly","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0119879","urlIMDB":"http://www.imdb.com/title/tt0119879","business":{"budget":{"money":"€4,200,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$3,350,000 (Spain)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 6 min (126 min)","2 hr 5 min (125 min) (Australia)","1 hr 35 min (95 min) (South Korea)","1 hr 58 min (118 min) (Hong Kong)","1 hr 55 min (115 min) (R-rated) (USA)","2 hr 1 min (121 min) (unrated) (USA)","2 hr 5 min (125 min) (DVD) (Germany)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras"],"laboratory":["Madrid Film S.A., Madrid, Spain"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.3","filmingLocations":[{"location":"Las Vegas, Nevada, USA"}],"rated":"R","awards":[{"award":"Brussels International Festival of Fantasy Film (BIFFF) 1998","titlesAwards":[{"titleAwardOutcome":"Won Special Mention","categories":[{"category":"","names":[{"name":"Álex de la Iglesia","id":"nm0407067","role":null}]}]}]},{"award":"Fantafestival 1998","titlesAwards":[{"titleAwardOutcome":"Won Best Actress","categories":[{"category":"","names":[{"name":"Rosie Perez","id":"nm0001609","role":null}]}]},{"titleAwardOutcome":"Won Best Film","categories":[{"category":"","names":[{"name":"Álex de la Iglesia","id":"nm0407067","role":null}]}]}]},{"award":"Film Critics Circle of Australia Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated FCCA Award","categories":[{"category":"Best Foreign Film","names":[]}]}]},{"award":"Fotogramas de Plata 1998","titlesAwards":[{"titleAwardOutcome":"Won Fotogramas de Plata","categories":[{"category":"Best Movie Actor (Mejor Actor de Cine)","names":[{"name":"Javier Bardem","id":"nm0000849","role":null},{"name":"Carne trémula","id":"tt0118819","role":null}]}]}]},{"award":"Goya Awards 1998","titlesAwards":[{"titleAwardOutcome":"Won Goya","categories":[{"category":"Best Makeup and Hairstyles (Mejor Maquillaje y Peluquería)","names":[{"name":"José Quetglás","id":"nm0703370","role":null},{"name":"Mercedes Guillot","id":"nm0347167","role":null}]},{"category":"Best Production Manager (Mejor Dirección de Producción)","names":[{"name":"José Luis Escolar","id":"nm0260402","role":null}]}]},{"titleAwardOutcome":"Nominated Goya","categories":[{"category":"Best Original Score (Mejor Música Original)","names":[{"name":"Simon Boswell","id":"nm0005972","role":null}]},{"category":"Best Costume Design (Mejor Diseño de Vestuario)","names":[{"name":"María Estela Fernández","id":"nm0273659","role":null},{"name":"Glenn Ralston","id":"nm0707805","role":null}]}]}]},{"award":"Gramado Film Festival 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Kikito","categories":[{"category":"Best Film (Melhor Filme)","names":[{"name":"Álex de la Iglesia","id":"nm0407067","role":null}]}]}]},{"award":"Spanish Actors Union 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Award of the Spanish Actors Union","categories":[{"category":"Film: Lead Performance (Protagonista Cine)","names":[{"name":"Javier Bardem","id":"nm0000849","role":null}]}]}]}],"votes":"6,709","type":"Movie","companyCreditsSimple":[{"idCompany":"co0071913","name":"Canal+ España"},{"idCompany":"co0011735","name":"Instituto Mexicano de Cinematografía (IMCINE)"},{"idCompany":"co0009576","name":"Lolafilms"}],"keywords":{"keywords":["forced to watch rape","defloration by rape","crime spree","santeria","religious fanatic","sacrifice","rape","paganism","orgasm","loss of virginity","virgin","blood","u.s. mexico border","urination","flashback","nipples visible through clothing","sex with fat woman","non statutory female on male rape","held at gunpoint","forced to strip","cunnilingus","buxom","breast suckling","braless","female nudity","on the road","witch doctor","femme fatale","shootout","hit and run","fetus","dark comedy","cruelty","crucifixion","las vegas nevada","defloration","mexican border","nudity","suicide","black comedy","mafia","kidnapping","bank robbery","helicopter","truck","cannibalism","violence","independent film","based on novel","character name in title","surrealism"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:21:01"}}