{"data":{"movies":[{"title":"Hellraiser III: Hell on Earth","originalTitle":"","year":"1992","releaseDate":"19920911","directors":[{"name":"Anthony Hickox","id":"nm0382776"}],"writers":[{"name":"Clive Barker","id":"nm0000850"},{"name":"Peter Atkins","id":"nm0040643"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRiMGFjMmMtYTUzOS00N2U4LWJjZDQtNjFjNjg4MTg4YTU0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Horror"],"plot":"Pinhead is stuck in a block after the Big Confrontation in \"Hellbound,\" The block containing Pinhead and the puzzle cube is bought by a young playboy as sculpture. Pinhead busies himself escaping by getting the playboy to lure victims to his presence so he can use their blood. Once free, he seeks to destroy the puzzle cube so he need never return to Hell, but a female reporter is investigating the grisly murders and stands in his way.","simplePlot":"An investigative reporter must send the newly unbound Pinhead and his legions back to Hell.","actors":[{"actorName":"Kevin Bernhardt","urlProfile":"http://www.imdb.com/name/nm0076791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODg5MTQwNl5BMl5BanBnXkFtZTgwMzA5MzY4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1961","placeOfBirth":" Daytona Beach, Florida, USA","bio":"20+ screenplays produced with actors Stallone, Snipes, Bacon, Sutherland, Swayze & Rock. Assignments with directors Shekhar Kapur (Elizabeth), Andrew Davis (Fugitive), William Friedkin (Exorcist), Brad Anderson (The Call), John Hillcoat (Lawless), Renny Harlin (Driven), Mimi Leder (Deep Impact), Sylvester Stallone (Rocky), Frederic Forestier (Asterix at the Olympic Games) & Abel Ferrara (Bad Lieutenant). Universal and Lions Gate released Bernhardt's adaptation of the bestselling spiritual book - Peaceful Warrior starring Nick Nolte. It was a departure from his usual suspense/action background. Elephant White, his latest screenplay in that genre - was released in 2013, with Academy Award nominees Djimon Hounsou and Kevin Bacon. While building a career as a writer, Bernhardt supported himself as an actor, with contract roles on General Hospital (1986-1988), then Dynasty (1989-1990), followed by numerous bad guy leads in films such as Clive Barker's Hellraiser. He was recently drawn back into acting again, with lead roles in two films in 2014 - Heartland and Promise. He has a Masters Degree in Economics. He still can't figure out why either.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODg5MTQwNl5BMl5BanBnXkFtZTgwMzA5MzY4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0076791","name":"Kevin Bernhardt","idIMDB":"nm0076791"},"actorId":"nm0076791","character":"J.P. Monroe / Pistonhead Cenobite","urlCharacter":"http://www.imdb.com/character/ch0008737","main":true},{"actorName":"Lawrence Mortorff","urlProfile":"http://www.imdb.com/name/nm0608118","urlPhoto":"","biography":{"bio":"Lawrence Mortorff is a producer, known for Hellraiser III: Hell on Earth (1992), Le livre de la jungle (1994) and Andre (1994). He was previously married to Lindsay Wagner.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0608118","name":"Lawrence Mortorff","idIMDB":"nm0608118"},"actorId":"nm0608118","character":"Bum","urlCharacter":"http://www.imdb.com/character/ch0204417","main":true},{"actorName":"Terry Farrell","urlProfile":"http://www.imdb.com/name/nm0000395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODY4NTgwMl5BMl5BanBnXkFtZTYwNjE5ODUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1963","placeOfBirth":" Cedar Rapids, Iowa, USA","birthName":"Theresa Lee Farrell","height":"5' 11¾\" (1.82 m)","bio":"Terry Farrell was born on November 19, 1963 in Cedar Rapids, Iowa. At age 15, she became a foreign exchange student to Mexico, and, from that experience, she decided she would like to live a more adventurous life in the big city. She sent several photos to a modeling agency and then, at age 17, dropped out of high school and became a model in New York. She is most famously known for her role as Jadzia Dax in the television series Star Trek: Deep Space Nine (1993), but she did have some acting experience before that. In 1992, she had the starring role in the horror movie Hellraiser III: Hell on Earth (1992). She appeared in several television and straight-to-video movies, and also dated actors Michael Dorn and Mickey Rourke while on Star Trek: Deep Space Nine (1993). Afterward, Paramount decided to move her to the sitcom Becker (1998), where she played the character Reggie Kostas, but, after four seasons, she was replaced by Nancy Travis. Since then, she has not been in many mainstream events. In September 2002, she married Brian Baker, better known as the cell-phone company Sprint's spokesperson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODY4NTgwMl5BMl5BanBnXkFtZTYwNjE5ODUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000395","name":"Terry Farrell","nicknames":["Farrell"],"idIMDB":"nm0000395"},"actorId":"nm0000395","character":"Joanne 'Joey' Summerskill","urlCharacter":"http://www.imdb.com/character/ch0008731","main":true},{"actorName":"Ken Carpenter","urlProfile":"http://www.imdb.com/name/nm0139393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA5NDQ4Nl5BMl5BanBnXkFtZTgwOTUxODc0NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Kenneth Edward Carpenter","height":"6' 2\" (1.88 m)","bio":"Ken Carpenter was raised in Saratoga Wyoming. His Father passed away shortly after he was born. He and his two brothers spent their early years on their Grandfathers guest ranch on the banks of the Platte River. His school teacher Mother taught her three boys in the local school. After graduation from High School, Ken attended Baylor University briefly. After one semester, he returned to Wyoming and took a job as a hunting guide. He entered the United States Air Force that fall and was stationed in the Philippine Islands for 18 months, then to the Pentagon at the Joint Chiefs of Staff. Upon completion of his tour of duty, he returned to Wyoming and began pursuing a liberal arts education majoring in Political Science and History at the University of Wyoming. He graduated with a BA. His summers were spent in Jackson Hole Wyoming working as a River Guide on the Snake River. Warner Brothers Studios were filming in the valley and offered him a job as a double for one of the stars of the movie. Upon completion of the filming he returned to Los Angeles with the company and began a career in the film industry. Thus began his forty plus year stint working on various movies and television shows, securing an occasional starring or co-starring role or featured performer. In 2008 he began work on his current book series about global terrorism. Thus far, he has written 5 books with others in the planning stages.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA5NDQ4Nl5BMl5BanBnXkFtZTgwOTUxODc0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0139393","name":"Ken Carpenter","idIMDB":"nm0139393"},"actorId":"nm0139393","character":"Daniel 'Doc' Fisher / Camerahead Cenobite","urlCharacter":"http://www.imdb.com/character/ch0204418","main":true},{"actorName":"Sharon Hill","urlProfile":"http://www.imdb.com/name/nm0147589","urlPhoto":"","biography":{"dateOfBirth":"21 September 1956","placeOfBirth":" Oklahoma, USA","bio":"Sharon Ceccatti (Hill) began her career in show business singing and dancing on stage in the Pittsburgh area, performing mostly in operettas. When she wasn't working, she made a living as a hospital nurse for a downtown Pittsburgh hospital. She is best known for playing the \"lead zombie nurse\" in the horror movie, Zombie - Le crépuscule des morts-vivants (1978). She has become a horror zombie legend all across Europe especially and her face as the zombie nurse is featured as such on posters and many books. She usually appeared as uncredited extras in movies some of which include, Hellraiser III, Knightriders (1981), Maria's Lovers, Death Penalty, Silent Witness, Kid Brother, and many more. Sharon has had a long career for over 20 years as a movie and location casting director in casting principles, day players and extras. She has cast such films as, Dominick and Eugene, starring Jamie Lee Curtis and Ray Liotta; Lady Beware, starring Diane Lane and Michael Woods; Gung Ho, starring Michael Keaton; Mrs. Soffell, starring Diane Keaton and Mel Gibson; and All The Right Moves (1983) starring Tom Cruise, Leah Thompson and Craig T. Nelson. She has worked with directors such as Ron Howard, George A. Romero, Michael Chapman, Andrei Konchalovsky, and many more. From there she became Assistant Director of Operations for eight years at a 26,000 seat amphitheatre where she had an office backstage where she could keep a handle on all theatre activities. During the season she had approximately 450 people working for her during the shows. Some of the acts that came thru were Billy Joel, Phil Collins, Janet Jackson, Van Halen, Jimmy Buffett, AC DC, Rod Stewart, Ozzy Osbourne, Brooks & Dunn, Steve Miller, Neil Young, Reba McIntyre, and many more. Moving on and joining the \"David Copperfield Tour\" the world's greatest magician as his personal assistant and appeared on stage with him traveling all over the world to Hungary, Czech Republic, Chile, Argentina, Venezuela, Spain, Mexico, Canada, Switzerland and 11 cities in Germany, putting on 500 shows a year, as well as playing at Caesar Palace in Las Vegas, Atlantic City and Lake Tahoe. Since then, Sharon has been scouting locations for movies. The most interesting scouting was for a month in Spain and some days in Morocco looking primarily for bullrings. Occasionally being sent movie scripts, breaking down parts to see who is best suited to appear in the movie.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0147589","name":"Sharon Hill","idIMDB":"nm0147589"},"actorId":"nm0147589","character":"Blond Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Marshall","urlProfile":"http://www.imdb.com/name/nm0005191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBkNzVkZGItMjA3NC00NDU4LTliZGMtY2NlYmUxNGU4YzFlL2ltYWdlXkEyXkFqcGdeQXVyMDgxNzEwMA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1964","placeOfBirth":" Rockville, Maryland, USA","birthName":"Paula Marie Marshall","height":"5' 7½\" (1.71 m)","bio":"Paula Marshall was born on June 12, 1964 in Rockville, Maryland, USA as Paula Marie Marshall. She is known for her work on Cheaper by the Dozen (2003), Gary Unmarried (2008) and Hellraiser III: Hell on Earth (1992). She has been married to Danny Nucci since October 12, 2003. They have one child. She was previously married to Tom Ardavany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBkNzVkZGItMjA3NC00NDU4LTliZGMtY2NlYmUxNGU4YzFlL2ltYWdlXkEyXkFqcGdeQXVyMDgxNzEwMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005191","name":"Paula Marshall","idIMDB":"nm0005191"},"actorId":"nm0005191","character":"Terri / Skinless Sandy / Dreamer Cenobite","urlCharacter":"http://www.imdb.com/character/ch0204420","main":true},{"actorName":"Robert C. Treveiler","urlProfile":"http://www.imdb.com/name/nm0872354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzY5OTQ3NV5BMl5BanBnXkFtZTgwNDQ5NzYwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Robert C. Treveiler is an actor and director, known for Prisoners (2013), The Mist (2007) and The Accountant (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzY5OTQ3NV5BMl5BanBnXkFtZTgwNDQ5NzYwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0872354","name":"Robert C. Treveiler","idIMDB":"nm0872354"},"actorId":"nm0872354","character":"Paramedic 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Frederick","urlProfile":"http://www.imdb.com/name/nm0292748","urlPhoto":"","biography":{"bio":"New York City born, Pittsburgh raised Actor/Producer/Director is a former World-Class Athlete having won a Bronze Medal for the United States in the 1985 World Games, London and named All-World All-Star in 1987. Starting in Pittsburgh Theater, then films and television followed. Currently living in New York City as Writer/Producer/Director for TV and Stage.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0292748","name":"Christopher Frederick","idIMDB":"nm0292748"},"actorId":"nm0292748","character":"Paramedic 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lawrence Kuppin","urlProfile":"http://www.imdb.com/name/nm0475511","urlPhoto":"","biography":{"bio":"A film entrepreneur and investor, Larry Kuppin has made quite a significant impression as a reliable and prolific film producer and has been involved with numerous major motion pictures in the United States and around the world. After being involved with television productions for several years, Kuppin along with Harry Sloane and Larry A. Thompson purchased Roger Corman's independent production company New World Pictures in 1983. Thompson eventually left the company a year later, and Kuppin and Sloane as both executives of the \"New\" New World Pictures, they were able to branch the company into three new divisions. New World International handled the motion pictures done outside the United States. New World Television handled TV shows and made for TV motion pictures; and New World Video handled the video distribution of all of New World Pictures products. New World also purchased the Marvel Comics division in 1985. New World Pictures made a major impression with producing and distributing motion pictures around the world. Some of the films included the \"Hellraiser\" series and the critically acclaimed black comedy \"Heathers\". From 1983-1990, New World Pictures produced nearly 150 films. Unfortunatly, by 1989 New World Pictures went into a downward fall with financial problems. After the company sold it's Marvel Comics division, New World Pictures eventually shut down by 1990 and Kuppin sold it to the News Communications Co. Kuppin is still involved as a financial investor for independent motion pictures.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0475511","name":"Lawrence Kuppin","idIMDB":"nm0475511"},"actorId":"nm0475511","character":"Derelict","urlCharacter":"http://www.imdb.com/character/ch0008748","main":true},{"actorName":"Sharon Percival","urlProfile":"http://www.imdb.com/name/nm0672892","urlPhoto":"","biography":{"bio":"Sharon Percival is an actress, known for Hellraiser III: Hell on Earth (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0672892","name":"Sharon Percival","idIMDB":"nm0672892"},"actorId":"nm0672892","character":"Brittany Virtue","urlCharacter":"http://www.imdb.com/character/ch0204422","main":true},{"actorName":"Philip Hyland","urlProfile":"http://www.imdb.com/name/nm0405099","urlPhoto":"","biography":{"height":"5' 7\" (1.7 m)","bio":"Philip Joseph Hyland began as a stage actor at Barksdale Theatre in Hanover, Virginia, making his first appearance in 1986 in the role of Eugene in Neil Simon's \"Brighton Beach Memoirs\". Hyland also toured in a musical production of \"Hansel & Gretel\" with Theatre IV, a division of the Virginia Repertory Theatre. For several seasons Hyland has portrayed Jesus Christ in the Maundy Thursday drama, \"Remember Me\", at Christ Lutheran Church in Valencia, California. In addition to acting Hyland co-founded the New York City based Pop-Rock group, Girlfriend, and released the debut album, \"The New Me\", on Celsius Records. Hyland is married, has two children and resides in Los Angeles, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0405099","name":"Philip Hyland","idIMDB":"nm0405099"},"actorId":"nm0405099","character":"Brad","urlCharacter":"http://www.imdb.com/character/ch0204423","main":true},{"actorName":"David Young","urlProfile":"http://www.imdb.com/name/nm0949449","urlPhoto":"","biography":{"bio":"David Young is an actor, known for Hellraiser III: Hell on Earth (1992), Nightbreed (1990) and Thirty Two Short Films About Glenn Gould (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0949449","name":"David Young","idIMDB":"nm0949449"},"actorId":"nm0949449","character":"Bill the Bouncer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brent Bolthouse","urlProfile":"http://www.imdb.com/name/nm0093364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTcyMzMwM15BMl5BanBnXkFtZTcwOTAzNjA1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1969","placeOfBirth":" Sierra Madre, California, USA","height":"5' 11½\" (1.82 m)","bio":"Brent Bolthouse was born on December 18, 1969 in Sierra Madre, California, USA. He is an actor, known for Hellraiser III: Hell on Earth (1992), Warlock: The Armageddon (1993) and Full Eclipse (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTcyMzMwM15BMl5BanBnXkFtZTcwOTAzNjA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0093364","name":"Brent Bolthouse","idIMDB":"nm0093364"},"actorId":"nm0093364","character":"CD the DJ","urlCharacter":"http://www.imdb.com/character/ch0204425","main":true},{"actorName":"Peter Atkins","urlProfile":"http://www.imdb.com/name/nm0040643","urlPhoto":"","biography":{"dateOfBirth":"2 November 1955","placeOfBirth":" Liverpool, England, UK","bio":"Peter Atkins was born in Liverpool, England on 2 November 1955. He was a founder member of The Dog Company, a 1970s avant-garde theatre group, along with Clive Barker and Doug Bradley - with whom he would later work on the Hellraiser movies. As well as his movie and TV work, he is the author of the novels Morningstar (1992) and Big Thunder (1997) and the collection Wishmaster and Others (1999). He is married to Dana Middleton and lives in Los Angeles, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0040643","name":"Peter Atkins","idIMDB":"nm0040643"},"actorId":"nm0040643","character":"Rick the Barman / Barbie Cenobite","urlCharacter":"http://www.imdb.com/character/ch0178632","main":true},{"actorName":"Paul Coleman","urlProfile":"http://www.imdb.com/name/nm0171180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVkZTE1NzItMzliZS00ZTkyLThmMjctMTUwNDAxYWQxYjA2XkEyXkFqcGdeQXVyMjYwMzE4NTI@._V1_UY44_CR20,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1962","placeOfBirth":" Chicago, Illinois, USA","height":"6' 2\" (1.88 m)","bio":"Paul Coleman was born on September 27, 1962 in Chicago, Illinois, USA. He is known for his work on Ricochet (1991), The Taking of Flight 847: The Uli Derickson Story (1988) and A Message from Holly (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVkZTE1NzItMzliZS00ZTkyLThmMjctMTUwNDAxYWQxYjA2XkEyXkFqcGdeQXVyMjYwMzE4NTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171180","name":"Paul Coleman","nicknames":["Paul BoogieMan Coleman"],"idIMDB":"nm0171180"},"actorId":"nm0171180","character":"Soldier 1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0104409","urlIMDB":"http://www.imdb.com/title/tt0104409","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1991/\">1991</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min) (Canada)","1 hr 31 min (91 min) (cut) (USA)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.4","filmingLocations":[{"location":"High Point, North Carolina, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Make-Up","names":[{"name":"Bob Keen","id":"nm0444571","role":null}]}]}]},{"award":"Avoriaz Fantastic Film Festival 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Prize","categories":[{"category":"","names":[{"name":"Anthony Hickox","id":"nm0382776","role":null}]}]}]},{"award":"Brussels International Festival of Fantasy Film (BIFFF) 1993","titlesAwards":[{"titleAwardOutcome":"Won Pegasus Audience Award","categories":[{"category":"","names":[{"name":"Anthony Hickox","id":"nm0382776","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 1992","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Actor","names":[{"name":"Doug Bradley","id":"nm0103208","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Paula Marshall","id":"nm0005191","role":null}]}]}]},{"award":"Fantasporto 1993","titlesAwards":[{"titleAwardOutcome":"Nominated International Fantasy Film Award","categories":[{"category":"Best Film","names":[{"name":"Anthony Hickox","id":"nm0382776","role":null}]}]}]}],"votes":"21,333","type":"Movie","companyCreditsSimple":[{"idCompany":"co0064240","name":"Fifth Avenue Entertainment"},{"idCompany":"co0052114","name":"Trans Atlantic Entertainment"}],"keywords":{"keywords":["pinhead","reporter","chain","church","flashback","apartment","soldier","vietnam war","statue","demon","nightclub","character repeating someone else's dialogue","alter ego","cult film","hell","blood","puzzle box","tv reporter","cellphone","murder of a policewoman","extreme violence","breast fondling","sex scene","female frontal nudity","blood splatter","slow motion","lifting female in air","manhattan new york city","hole in the head","father daughter relationship","office building","wet cement","trick","manipulation","field","construction site","burnt hand","stabbed in the hand","altar","crucifix","priest","stabbed in the face","police officer killed","shotgun","chase","fire breathing","exploding car","stabbed in the forehead","self mutilation","exploding building","car set on fire","explosion","fire hydrant","car crash","dismemberment","candle","severed head","hanged man","rain","hook through hand","stabbed in the chest","massacre","slaughter","double impalement","eye gouging","finger cut off","severed finger","falling from height","pool table","evil","transformation","captain","portal","radio","stabbed in the head","punched in the face","zippo lighter","trench","shot in the back","rifle","ex boyfriend ex girlfriend relationship","tv station","vcr","pistol","skin torn off","skinned alive","tied to a bed","premarital sex","nightclub owner","rose","bartender","drawing","painting","rat","bitten hand","matchbook","shot in the stomach","nightgown","corpse","shot to death","shot in the chest","battle","bus","gash in the face","dripping blood","hospital","tv cameraman","news report","art gallery","cigarette smoking","new york city","blasphemy","world trade center manhattan new york city","videotape","casual sex","anti christianity","occult","lifting someone into the air","hung by one's wrists","bound and gagged","violence","good versus evil","heavy metal band","stabbed in the mouth","skinning","impalement","exploding head","decapitation","brooklyn bridge","gore","heart in hand","ghost","sequel","brass knuckles","desire","helicopter","war aftermath","dream","spiral staircase","bare chested male","male rear nudity","slasher flick","third part","desert eagle"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:28:40"}}