{"data":{"movies":[{"title":"Head Over Heels","originalTitle":"","year":"2001","releaseDate":"20010202","directors":[{"name":"Mark Waters","id":"nm0914134"}],"writers":[{"name":"John J. Strauss","id":"nm0833828"},{"name":"Ed Decter","id":"nm0214036"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1Nzg4NTc3Ml5BMl5BanBnXkFtZTcwNzA1NDcxMQ@@._V1.jpg","countries":["USA"],"languages":["English","Russian"],"genres":["Comedy","Mystery","Romance"],"plot":"Amanda Pierce is from Iowa and works as a restorer of Renaissance paintings for the New York Metropolitan Museum. She has just finished another frustrating relationship, when she found her boy-friend with a model on her bed. She decides to move and share a flat with four stupid but nice super-models. She meets Jim Winston, who lives in front of her window. She falls in love with him. One day, she sees Jim killing a woman - Megan O'Brien - through her window and Amanda and her four roommates decide to investigate what really happened.","simplePlot":"A young woman is attracted to a man despite her thinking she's seen him kill someone.","actors":[{"actorName":"Monica Potter","urlProfile":"http://www.imdb.com/name/nm0005321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzg3Mzg5M15BMl5BanBnXkFtZTcwMjkyMDI5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1971","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Monica Gregg Brokaw","height":"5' 7\" (1.7 m)","bio":"From Cleveland to Hollywood, actress, producer, entrepreneur, funny woman, tear-jerker, designer, decorator, builder, creator, fixer, cook, cleaner, host, wife, Browns fan, homemaker, (very) amateur bowler and -her favorite title- mom, Monica Potter has achieved success in several different ways....save having a concise bio intro. Monica Potter was born and raised in Cleveland, Ohio, the daughter of Nora Marie (Sexton), a homemaker and part-time cleaning lady, and Paul Ely Brokaw, Jr., who -among many other widely-used innovations- invented the first flame-resistant car wax. Her maternal grandparents were Irish. A passionate creator by genes and trade, Potter, along with her 12-person \"Monica Potter Home\" team, is producing a line of natural, locally-crafted home and beauty products sold on mrspotter.com as well as the company's first standalone store, which opened in Garrettsville Ohio, a suburb of Cleveland , this February. Building the company had been a dream for Potter. Through it, she aims to supplement the beauty and comfort of customers' homes at an affordable price, while creating sustainable job opportunities in the area. Appropriately enough, \"Monica Potter Home\" is headquartered in Potter's own childhood house in Cleveland; a structure Potter recently bought and renovated as part of an initiative to improve the neighborhood's condition. When not running a company and knocking down walls, Potter is at work producing a sitcom, with Ellen DeGeneres and Warner Bros. Television, in which she will star as a mom, living under the same roof as her three ex-husbands. The script is in development and a pilot will be shot this spring. She is also producing a docu-series, tracking the renovation of her childhood home, with her favorite cast of characters...her family. To the dismay of its extraordinarily vocal fans, Potter recently wrapped production on five seasons of NBC's acclaimed drama series, Parenthood (2010). For her portrayal of \"Kristina Braverman\" and her struggles to raise three children (including one with Autism), an emotional battle with breast cancer and run for mayor, Potter has garnered a 2014 Golden Globes nomination, a 2013 Critics Choice Award for Best Supporting Actress in a Drama, a TCA Award nomination for Individual Achievement in Drama & continued Emmy buzz. Potter's previous television credits include roles in Boston Legal (2004), for which Potter and her cast mates were nominated for a 2005 Screen Actors Guild award for Outstanding Performance by an Ensemble in a Comedy Series, TNT's Trust Me (2009), USA's Reversible Errors (2004) and the beginning of it all, The Young and the Restless (1973). Potter burst onto the film scene with her co-starring role, opposite Nicolas Cage in Michael Bay's Con Air (1997). She then starred, with Robin Williams, in the acclaimed dramedy, Patch Adams (1998)\" and appeared opposite Morgan Freeman in the thriller, Along Came a Spider (2001). Other film credits include the comedies, Head Over Heels (2001) and I'm with Lucy (2002), the mega-hit horror classic Saw (2004), Without Limits (1998), Lower Learning (2008) and The Last House on the Left (2009). Potter resides in both Cleveland and Los Angeles with her family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzg3Mzg5M15BMl5BanBnXkFtZTcwMjkyMDI5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005321","name":"Monica Potter","nicknames":["Mocky","Mon"],"idIMDB":"nm0005321"},"actorId":"nm0005321","character":"Amanda","urlCharacter":"http://www.imdb.com/character/ch0023038","main":true},{"actorName":"Freddie Prinze Jr.","urlProfile":"http://www.imdb.com/name/nm0005327","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MjI2NzI3OV5BMl5BanBnXkFtZTcwNzYzMTIxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1976","placeOfBirth":" Los Angeles, California, USA","birthName":"Freddie James Prinze","height":"6' (1.83 m)","bio":"Freddie Prinze, Jr. was born on March 8, 1976, in Los Angeles, California, to Kathy Prinze (née Kathy Elaine Barber) and comedian/actor Freddie Prinze. His father was of German and Puerto Rican descent, and his mother is of British Isles and German ancestry. Freddie lived in Albuquerque, New Mexico, in his early life. He attended three different schools during his childhood: Eldorado, Sandia, and La Cueva. After graduating in 1994, Freddie moved to L.A. to focus on an acting career. He immediately garnered featured roles on several episodic series, one of which was an episode of Family Matters: The Gun (1995), in which Freddie had a four-line part playing a punk kid who brought a gun to school. \"That was my big break, and I thought it was huge,\" says Freddie. He then went on to appear in a few after-school specials, including ABC Afterschool Specials: Too Soon for Jeff (1996) and Detention: The Siege at Johnson High (1997) co-starring Ricky Schroder and Henry Winkler. Freddie is married to actress Sarah Michelle Gellar, with whom he has two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MjI2NzI3OV5BMl5BanBnXkFtZTcwNzYzMTIxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005327","name":"Freddie Prinze Jr.","nicknames":["Pie"],"idIMDB":"nm0005327"},"actorId":"nm0005327","character":"Jim Winston","urlCharacter":"http://www.imdb.com/character/ch0023037","main":true},{"actorName":"Shalom Harlow","urlProfile":"http://www.imdb.com/name/nm0363371","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc0NjE4NTE4MF5BMl5BanBnXkFtZTYwOTA1Njkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1973","placeOfBirth":" Oshawa, Ontario, Canada","height":"5' 11¼\" (1.81 m)","bio":"Shalom Harlow was born on December 5, 1973 in Oshawa, Ontario, Canada. She is an actress, known for Vanilla Sky (2001), How to Lose a Guy in 10 Days (2003) and In & Out (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc0NjE4NTE4MF5BMl5BanBnXkFtZTYwOTA1Njkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0363371","name":"Shalom Harlow","idIMDB":"nm0363371"},"actorId":"nm0363371","character":"Jade","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ivana Milicevic","urlProfile":"http://www.imdb.com/name/nm0587431","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwNjY5MzYwNl5BMl5BanBnXkFtZTcwNDc0MDk4OA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1974","placeOfBirth":" Sarajevo, Bosnia and Herzegovina","height":"5' 9\" (1.75 m)","bio":"Ivana Milicevic was born on April 26, 1974, in Sarajevo, Bosnia (part of Yugoslavia at that time), into an ethnic Croatian family. She is the daughter of Tonka and Damir Milicevic, and has a younger brother, Tomo Milicevic. The family emigrated to the United States, and young Ivana Milicevic was raised in Michigan. She attended Athens High school in Troy, Michigan, and worked as a model during her school years. She became a naturalized citizen of the United States. In 1992, Milicevic graduated from high school and moved to Los Angeles in pursuit of an acting career. She was a struggling stand-up comedienne, trying to win over crowds with her stories of the modeling business. In 1996, she made her film debut under the name Ivana Marina with a one-line role as a Former Girlfriend of Tom Cruise in Jerry Maguire (1996). In 1997, she followed up with a guest role on NBC's Seinfeld (1989) and made guest appearances on several other television shows, including Royal Pains (2009) and playing the love interest of John Casey on Chuck (2007). She played bit parts in Vanilla Sky (2001) and Love Actually (2003), among her many other cameo appearances. Milicevic capitalized on her experience as a comedienne in a supporting role as Russian model Roxana Milla Slasnikova in the romantic comedy Head Over Heels (2001). She appeared as a lookalike of Uma Thurman opposite Ben Affleck, trying to fool him into thinking she is Uma, in Paycheck (2003). In a departure from her one-dimensional roles, Milicevic showed her dramatic talent in a supporting role as Milla Yugorsky in a dark and gritty drama Running Scared (2006). In 2006, she started a recurring role on the CBS TV series Love Monkey (2006). In 2006, Milicevic made a big step forward in her career appearing as Valenka, one of three Bond girls in Casino Royale (2006), for which she did most of her scenes on locations in Prague and in London. She resides in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwNjY5MzYwNl5BMl5BanBnXkFtZTcwNDc0MDk4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587431","name":"Ivana Milicevic","idIMDB":"nm0587431"},"actorId":"nm0587431","character":"Roxana","urlCharacter":"http://www.imdb.com/character/ch0023039","main":true},{"actorName":"Sarah Murdoch","urlProfile":"http://www.imdb.com/name/nm0641366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mjc1NjY2OF5BMl5BanBnXkFtZTgwMzEzNDg1MTI@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1972","placeOfBirth":" London, England, UK","birthName":"Sarah O'Hare","height":"5' 10\" (1.78 m)","bio":"Sarah grew up on the northern beaches of Sydney before going on to become one of Australia's most successful international models based in New York for over 14 years. Key successes included major contracts with L'Oreal, Revlon, Estee Lauder and Ralph Lauren, major campaigns with Christian Dior and Yves Saint Laurent as well as joining the prestigious Revlon family as a global face. In the US Sarah made regular television appearances including Friends, The Late Show with David Letterman, Late Night with Conan O'Brien, MTV, VH1 and E Entertainment and was a lead role in Universal Films' \"Head Over Heels\". Since returning to Australia Sarah has become well recognised as a television presenter as well as hosting The Today Show over four months and co-hosting The Project. In 2008, through her production company Room 329 Productions, Sarah signed a multi-year deal with FOXTEL as host and Executive Producer of Australia's Next Top Model. Over three seasons it was the most successful and highest rating non-sports program for Foxtel. In 2010 the series won the ASTRA Award for Most Outstanding Light Entertainment program and in 2011 for Most Outstanding Reality Program. In 2011 Sarah won the ASTRA for Favourite Female Personality. In addition to the success of that program, Room 329 Productions produced an original series of four 1-hour documentary specials for FOXTEL titled Sarah Murdoch presents: Pride of Australia to highlight our unsung Australian heroes. She has also been awarded the Cosmopolitan Magazine Award for Television Personality and the Madison Magazine award for Style Icon. As a brand ambassador Sarah worked for over 11 years with Bonds, where she successfully developed and advertised a profitable women's line. In 2011 Sarah became Brand Ambassador for Vaalia Yoghurt, a brand that is about health and well-being and is in partnership with the Murdoch Childrens Research Institute. Sarah is passionate about contributing to the community. In 1997 Sarah began working with National Breast Cancer Foundation of Australia (NBCF) and became Patron in 2001. Since her involvement fundraising has increased from approximately $1million per year to $17.5 million in 2012 raising a total of $137 million. Sarah addressed the National Press Club about the activities of the foundation in 2006 and again in 2008. The quality of her advocacy for breast cancer research was the inspiration for NBCF to create the Inaugural Advocacy for Breast Cancer Research Award, which she was awarded after 10 years of service as Patron in 2011. Sarah is also Chair of the NBCF's Women's Advisory Network which aims to fast-track research via Register4; a national online register with over 30,000 members. Since 2000, Sarah has been Ambassador for the Murdoch Childrens Research Institute, the largest child health research institute in Australia, and a member of its Development Board with a focus on raising awareness and research funds for the institute. In 2003 Sarah was awarded the Celebrity Advocacy Award by Research Australia and the InStyle Magazine Award for Charity/ Community. In 2004, Sarah was appointed International Ambassador for The Australian Ballet and is currently Deputy Chairman having been a board director since 2006. In 2006, Sarah co-authored Birth Skills with Juju Sundin educating women about birth. Sarah was appointed to the Federal Government's National Body Image Advisory Group in 2009 to address the growing problem of lack of self-esteem in Australia's youth. In April 2013, Sarah joined the board of the Australian Research Alliance for Children and Youth (ARACY), a non-profit organisation which focuses on bringing together researchers, policy makers and practitioners, to turn the best evidence into action to benefit all young Australians. Currently, Sarah is also a member of an advisory board with Global Access Partners working in Early Childhood Education. Sarah is a member of the Australian Institute of Company Directors. Today, Sarah lives in Sydney, Australia with husband Lachlan and their children Kalan, Aidan and Aerin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mjc1NjY2OF5BMl5BanBnXkFtZTgwMzEzNDg1MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641366","name":"Sarah Murdoch","idIMDB":"nm0641366"},"actorId":"nm0641366","character":"Candi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tomiko Fraser","urlProfile":"http://www.imdb.com/name/nm0292251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDg5NDkxNF5BMl5BanBnXkFtZTYwMDI2OTM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1968","placeOfBirth":" Bronx, New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"Fraser was born and raised in Bronx, New York. Fraser attended Cardinal Spellman High School in New York City. Fraser aspired to be a school teacher because of her love of learning. Her parents divorced when she was a child. She is 1 of seven children - she has 3 maternal siblings and 4 paternal siblings. Her brother Terrell Fraser is a DJ. Her sister Shneequa died of brain/ central nervouse system Lupus. On July 3, 2006 she married television stage manager/spoken word artist Christopher Hines. After years of fertility struggles, the couple used donor eggs and in vitro to conceive. Their twin sons Kaden James Hines and Bryce Harrison Hines were born 7 January 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDg5NDkxNF5BMl5BanBnXkFtZTYwMDI2OTM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292251","name":"Tomiko Fraser","idIMDB":"nm0292251"},"actorId":"nm0292251","character":"Holly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"China Chow","urlProfile":"http://www.imdb.com/name/nm0004824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMDkzMzEyNV5BMl5BanBnXkFtZTcwOTQxODEyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1974","placeOfBirth":" London, England, UK","height":"5' 2\" (1.57 m)","bio":"China Chow, born in London, is known to divide her time between New York City and Los Angeles. She is the child of late model/designer Tina Chow (who died of AIDS in 1992) and restaurateur Michael Chow (whose Mr. Chow restaurants are the talk of the town in London, Manhattan and Beverly Hills), and has a younger brother, Maximillian Chow. The first college graduate in her family, China graduated from Scripps College, majoring in psychology. She spent several years as a model, following in her mother's footsteps: she posed for Shiseido cosmetics in Japan, was seen on billboards for Tommy Hilfiger and Calvin Klein, was named one of Harper's Bazaar's \"It Girls\" in 1996, and was named in the December 1996 edition of Vogue magazine's \"The Next Best-Dressed List\". Her acting debut was in 1998's The Big Hit (1998), co-starring 'Mark Wahlberg', whom she is rumored to be dating.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMDkzMzEyNV5BMl5BanBnXkFtZTcwOTQxODEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004824","name":"China Chow","idIMDB":"nm0004824"},"actorId":"nm0004824","character":"Lisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Brazeau","urlProfile":"http://www.imdb.com/name/nm0106319","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MjUwNzk2ODBeQTJeQWpwZ15BbWU3MDUwODMwMDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1953","placeOfBirth":" Winnipeg, Manitoba, Canada","bio":"Jay Brazeau was born on December 22, 1953 in Winnipeg, Manitoba, Canada. He is an actor and writer, known for Best in Show (2000), Insomnia (2002) and Double Jeopardy (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MjUwNzk2ODBeQTJeQWpwZ15BbWU3MDUwODMwMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0106319","name":"Jay Brazeau","idIMDB":"nm0106319"},"actorId":"nm0106319","character":"Halloran / Strukov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley DeSantis","urlProfile":"http://www.imdb.com/name/nm0220886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDgzMTg3Nl5BMl5BanBnXkFtZTYwNjE3NjAz._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1953","placeOfBirth":" Roslyn, New York, USA","bio":"Stanley DeSantis was born on July 6, 1953 in Roslyn, New York, USA. He was an actor, known for Aviator (2004), Boogie Nights (1997) and I Am Sam (2001). He died on August 9, 2005 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDgzMTg3Nl5BMl5BanBnXkFtZTYwNjE3NjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0220886","name":"Stanley DeSantis","idIMDB":"nm0220886"},"actorId":"nm0220886","character":"Alfredo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erin-Marie Dykeman","urlProfile":"http://www.imdb.com/name/nm0245832","urlPhoto":"","biography":{"bio":"Erin-Marie Dykeman is an actress, known for Head Over Heels (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0245832","name":"Erin-Marie Dykeman","idIMDB":"nm0245832"},"actorId":"nm0245832","character":"10 Year-Old Amanda","urlCharacter":"http://www.imdb.com/character/ch0023038","main":true},{"actorName":"James Kirk","urlProfile":"http://www.imdb.com/name/nm0456484","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU5MTUxNTEyMl5BMl5BanBnXkFtZTgwMDk5NzY5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1986","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"James Nichol Kirk","height":"5' 11\" (1.8 m)","bio":"James Kirk was born on May 2, 1986 in Vancouver, British Columbia, Canada as James Nichol Kirk. He is known for his work on Final Destination 2 (2003), X-Men 2 (2003) and She's the Man (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU5MTUxNTEyMl5BMl5BanBnXkFtZTgwMDk5NzY5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0456484","name":"James Kirk","idIMDB":"nm0456484"},"actorId":"nm0456484","character":"Tommy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elysa Hogg","urlProfile":"http://www.imdb.com/name/nm0389705","urlPhoto":"","biography":{"dateOfBirth":"1988","placeOfBirth":" Langley, Vancouver, British Columbia, Canada","bio":"Elysa Hogg was born in 1988 in Langley, Vancouver, British Columbia, Canada. She is an actress, known for Head Over Heels (2001), Once in a Blue Moon (1995) and Le train de l'enfer (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0389705","name":"Elysa Hogg","idIMDB":"nm0389705"},"actorId":"nm0389705","character":"Tommy's Girlfriend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristina Lewis","urlProfile":"http://www.imdb.com/name/nm0507439","urlPhoto":"","biography":{"bio":"Kristina Lewis is an actress, known for Head Over Heels (2001), Homeward Bound II: Lost in San Francisco (1996) and The Marshal (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0507439","name":"Kristina Lewis","idIMDB":"nm0507439"},"actorId":"nm0507439","character":"17 Year-Old Amanda","urlCharacter":"http://www.imdb.com/character/ch0023038","main":true},{"actorName":"Ben Silverman","urlProfile":"http://www.imdb.com/name/nm0798886","urlPhoto":"","biography":{"bio":"Ben Silverman is an actor, known for Head Over Heels (2001) and Taina (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0798886","name":"Ben Silverman","idIMDB":"nm0798886"},"actorId":"nm0798886","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam MacMillan","urlProfile":"http://www.imdb.com/name/nm0534023","urlPhoto":"","biography":{"bio":"Sam MacMillan is an actor and editor, known for Head Over Heels (2001), Sometimes a Voice (2003) and We'll Meet Again (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0534023","name":"Sam MacMillan","idIMDB":"nm0534023"},"actorId":"nm0534023","character":"Charlie's Date","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0192111","urlIMDB":"http://www.imdb.com/title/tt0192111","business":{"budget":{"money":"$14,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,804,595","country":"USA","day":"04","month":"02","year":"2001","remarks":"2,338 Screens"}],"gross":[{"money":"$10,397,365","country":"USA","day":"04","month":"03","year":"2001","remarks":""},{"money":"$10,259,845","country":"USA","day":"25","month":"02","year":"2001","remarks":""},{"money":"$9,892,550","country":"USA","day":"18","month":"02","year":"2001","remarks":""},{"money":"$8,281,675","country":"USA","day":"11","month":"02","year":"2001","remarks":""},{"money":"$4,804,595","country":"USA","day":"04","month":"02","year":"2001","remarks":""},{"money":"€17,242","country":"Spain","day":"31","month":"08","year":"2002","remarks":""}],"weekendGross":[{"money":"$88,930","country":"USA","day":"04","month":"03","year":"2001","remarks":"139 Screens"},{"money":"$238,220","country":"USA","day":"25","month":"02","year":"2001","remarks":"277 Screens"},{"money":"$855,730","country":"USA","day":"18","month":"02","year":"2001","remarks":"956 Screens"},{"money":"$2,611,120","country":"USA","day":"11","month":"02","year":"2001","remarks":"2,363 Screens"},{"money":"$4,804,595","country":"USA","day":"04","month":"02","year":"2001","remarks":"2,338 Screens"}],"admissions":[{"money":"4,002","country":"Spain","day":"31","month":"08","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Copyright © 2001 Universal Studios All Rights Reserved. (on print)"},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":["2,418 m (Spain)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.4","metascore":"27","filmingLocations":[{"location":"Bryant Park, Manhattan, New York City, New York, USA"}],"rated":"PG-13","awards":[],"votes":"12,064","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0033486","name":"Robert Simonds Productions"}],"keywords":{"keywords":["private investigation","suspected murder","reference to stevie nicks","reference to don king","held at gunpoint","murder witness","apartment building","boyfriend girlfriend relationship","manhattan new york city","false identity","boxer shorts","bare chested male","undercover agent","russian mafia","art museum","art restoration"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:29:00"}}