{"data":{"movies":[{"title":"Babylon 5: The Gathering","originalTitle":"","year":"1993","releaseDate":"19930222","directors":[{"name":"Richard Compton","id":"nm0174068"}],"writers":[{"name":"J. Michael Straczynski","id":"nm0833089"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTUzMDA5OV5BMl5BanBnXkFtZTYwNTA3NDc5._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"This TV movie is the pilot for the \"Babylon 5\" TV series. Set on a space station in the late 23rd Century, Babylon 5 is a centre of diplomacy and trade, in neutral space located between many rival space empires. The project's success, already shaky, is put further in doubt when incoming Commander Jeffrey Sinclair is the key suspect in the attempted assassination of Kosh, a mysterious alien ambassador.","simplePlot":"The opening of a crucial space station is put in jeopardy when the commanding officer is accused of the attempted murder of a diplomat.","actors":[{"actorName":"Michael O'Hare","urlProfile":"http://www.imdb.com/name/nm0641365","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzgxNjEzN15BMl5BanBnXkFtZTgwMzE5ODQ1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1952","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robert Michael O'Hare","height":"6' 1\" (1.85 m)","bio":"Michael O'Hare was born on May 6, 1952 in Chicago, Illinois, USA as Robert Michael O'Hare. He was an actor, known for Babylon 5 (1994), One Life to Live (1968) and Babylon 5: The Gathering (1993). He was married to Ruth Ivy Ballam. He died on September 28, 2012 in the USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzgxNjEzN15BMl5BanBnXkFtZTgwMzE5ODQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641365","name":"Michael O'Hare","nicknames":["Mike"],"idIMDB":"nm0641365"},"actorId":"nm0641365","character":"Cmdr. Jeffrey Sinclair","urlCharacter":"http://www.imdb.com/character/ch0012584","main":true},{"actorName":"Tamlyn Tomita","urlProfile":"http://www.imdb.com/name/nm0000674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjQzMTgzOV5BMl5BanBnXkFtZTcwMzk3ODY5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1966","placeOfBirth":" Okinawa, Japan","birthName":"Tamlyn Naomi Tomita","height":"5' 4\" (1.63 m)","bio":"Tamlyn Tomita was born on January 27, 1966 in Okinawa, Japan as Tamlyn Naomi Tomita. She is an actress, known for The Day After Tomorrow (2004), Babylon 5: The Gathering (1993) and Four Rooms (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjQzMTgzOV5BMl5BanBnXkFtZTcwMzk3ODY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000674","name":"Tamlyn Tomita","idIMDB":"nm0000674"},"actorId":"nm0000674","character":"Lt. Cmdr. Laurel Takashima","urlCharacter":"http://www.imdb.com/character/ch0122973","main":true},{"actorName":"Jerry Doyle","urlProfile":"http://www.imdb.com/name/nm0236381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNDcyNzA0NV5BMl5BanBnXkFtZTYwMTMyMjAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1956","placeOfBirth":" Brooklyn, New York, USA","height":"6' 3\" (1.91 m)","bio":"Jerry Doyle was born on July 16, 1956 in Brooklyn, New York, USA. He was an actor, known for Babylon 5 (1994), Babylon 5: The River of Souls (1998) and Babylon 5: The Gathering (1993). He was married to Andrea Thompson. He died on July 27, 2016 in Las Vegas, Nevada, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNDcyNzA0NV5BMl5BanBnXkFtZTYwMTMyMjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236381","name":"Jerry Doyle","idIMDB":"nm0236381"},"actorId":"nm0236381","character":"Michael Garibaldi","urlCharacter":"http://www.imdb.com/character/ch0012582","main":true},{"actorName":"Mira Furlan","urlProfile":"http://www.imdb.com/name/nm0001245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDk1MTg1NF5BMl5BanBnXkFtZTYwODMxMjEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1955","placeOfBirth":" Zagreb, Croatia, Yugoslavia","height":"5' 6\" (1.68 m)","bio":"A leading actress of theatre, film and TV in the former Yugoslavia, Mira Furlan emigrated to the U.S. with her husband, Goran Gajic, in November 1991, due to the intolerable political circumstances in her homeland. Ms. Furlan starred in the Warner Brothers TV-series Babylon 5 (1994) as \"Ambassador Delenn\" (Sci-Fi Universe Award for Best Supporting Actress in a Genre TV-series 1996 and 1997). Her other American credits include the TV-movie My Antonia (1995) directed by Joseph Sargent, the title roles in \"Sophocles Antigone\" at the Hudson Guild Theatre in Los Angeles (Dramalogue Theatre Award for Outstanding Performance in 1995) and Lorca's \"Yerma\" at The Indiana Repertory Theatre. She also appeared in Brecht's \"Baal\" at The Second Stage in Los Angeles and Shaw's \"Don Juan In Hell\" in which she co-starred with Edward Asner and Rene Auberjonois. Ms. Furlan is a member of The Actor's Studio. Ms. Furlan's film credits include leading roles in over 25 films. She co-starred in Emir Kusturica's Cannes award-winning and Oscar-nominated film When Father Was Away On Business (2000). Films include: Three For Happiness, (Grand Prix, Valencia Film Festival), Beauty Of Vice, In The Jaws Of Life, The Loves Of Blanka Kolak, Dear Video etc. In addition, Ms Furlan has appeared regularly on Yugoslav Television, playing leading roles in numerous series and TV-films. She has received all the highest awards in her former country, both for her stage and film work, including two Golden Arenas (Yugoslav Oscars) for Best Actress. In the former Yugoslavia, Mira was a member of the Croatian National Theatre and a frequent guest star at major theatres in the whole country. Favorite roles include: \"Natalya\" in \"A Month In The Country\", \"Mrs. Elliot\" in \"Alpha-Beta\", \"Celimene\" in \"The Misanthrope\", \"Judith\" in \"The Devil's Disciple\", \"Annabella\" in \"Tis Pity She's A Whore\", the title role in Euripides' \"Helen\", \"Lea\" in \"Dybbuk\", \"Isabelle\" in Corneille's \"L'Illusion Comique\", \"Yvette\" in \"Mother Courage\", \"Natasha\" in \"Three Sisters\" and \"Ophelia\" in 'Jiri Menzel''s production of \"Hamlet\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDk1MTg1NF5BMl5BanBnXkFtZTYwODMxMjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001245","name":"Mira Furlan","idIMDB":"nm0001245"},"actorId":"nm0001245","character":"Delenn","urlCharacter":"http://www.imdb.com/character/ch0012571","main":true},{"actorName":"Blaire Baron","urlProfile":"http://www.imdb.com/name/nm0056198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM4OTk3MjI0Nl5BMl5BanBnXkFtZTgwMDY2NDQ0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Blair Scott Bohlig","bio":"Blaire Baron is an actor, playwright and stage director. Her acting career spans two decades with both indie and blockbuster films and over 40 television appearances. She is also Artistic Director of the prestigious L.A. Drama Club, the country's Youngest Shakespeare Ensemble, which trains children from all socio-economic backgrounds in Shakespeare. Via her prod. company, MicMack Prod (with writer/actor Robin Mcdonald) she recently co-wrote and co-produced The Candidate ('16) which is premiering at LA In'tl Shorts Fest in September '16. Blaire won Outstanding Achievement in Playwrighting for The Milk Meetings (Ophelia Theatre Co, NYC). Before its New York Premiere, the Milk Meetings was a hit on Holllywood's Theatre Row, debuting in Spring of 2014. Blaire's play Outspoken: Shakespeare in Shackles has been called back for an encore run after standing room only houses this fall on Hollywood's Theatre Row; Her short play, The Below, debuted at the 2015 Hollywood Fringe Festival and became a finalist at the 2015 New York New Works Festival in August. She has won numerous screen-writing awards (Atlanta, New Hampshire, Rhode Island, Beverly Hills, Nicholl (semifinals) Blaire is widely known for her work as Founder/Artistic Director of the Los Angeles Drama Club (the youngest Shakespeare Troupe in the U.S.) for which she has received awards and honors - most recently from PBS as their Commuinty Champion. Blaire created and produced the Documentary, Women In Boxes, about Magic Assistants. The only film in which Teller of Penn&Teller Speaks on Camera. www.thecandidatethemovie.com www.losangelesdramaclub.com @BlaireBaron @LADramaClub @MickMacProd","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM4OTk3MjI0Nl5BMl5BanBnXkFtZTgwMDY2NDQ0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0056198","name":"Blaire Baron","idIMDB":"nm0056198"},"actorId":"nm0056198","character":"Carolyn Sykes","urlCharacter":"http://www.imdb.com/character/ch0122974","main":true},{"actorName":"John Fleck","urlProfile":"http://www.imdb.com/name/nm0281387","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTk2Njg1NV5BMl5BanBnXkFtZTcwODYxNTM1Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 1951","placeOfBirth":"","bio":"John Fleck was born on May 7, 1951. He is an actor, known for Waterworld (1995), Chute libre (1993) and Babylon 5: The Gathering (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTk2Njg1NV5BMl5BanBnXkFtZTcwODYxNTM1Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0281387","name":"John Fleck","idIMDB":"nm0281387"},"actorId":"nm0281387","character":"Del Varner","urlCharacter":"http://www.imdb.com/character/ch0122975","main":true},{"actorName":"Paul Hampton","urlProfile":"http://www.imdb.com/name/nm0359035","urlPhoto":"","biography":{"dateOfBirth":"20 August 1937","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Paul Schwartz","height":"5' 11\" (1.8 m)","bio":"An actor, singer, composer, lyricist, and writer, Paul Hampton is listed as one of the one hundred major architects of American rock and roll, in the British rock journal, \"Footsoldiers and Kings\". He attended Dartmouth College, where by his sophomore year he was simultaneously signed by Columbia Records and Columbia Pictures to write music with Hal David and Burt Bacharach. He has written songs which have been recorded by Johnny Cash, Gene Pitney, Elvis Presley, Ricky Nelson, Merle Haggard, Tom Jones, Eddy Arnold, Bette Midler and Sammy Davis Jr.. He has also written lyrics, composed music, and collaborated on the book for a musical, \"Love is a Crime\". It's a culmination of years of songwriting, based on a concept and an idea he has had for a long time, of wanting to put \"Love\" on trial, theatrically and musically.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0359035","name":"Paul Hampton","idIMDB":"nm0359035"},"actorId":"nm0359035","character":"The Senator","urlCharacter":"http://www.imdb.com/character/ch0112754","main":true},{"actorName":"Peter Jurasik","urlProfile":"http://www.imdb.com/name/nm0432867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDkwNDU0Ml5BMl5BanBnXkFtZTcwNDk2MDcyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1950","placeOfBirth":" Queens, New York, USA","height":"5' 10½\" (1.79 m)","bio":"Peter Jurasik began his professional career as a stage actor working in off Broadway productions in New York and later in tours and regional theaters up and down the east coast. In 1975, he moved to Los Angeles beginning a twenty five year run as a character actor continuing to act on stage, but additionally working in feature films, in nightclubs doing comedy and especially on television with hundreds of TV appearances in both comedies and dramas. Audiences seem to remember him best for his work on 'Hill Street Blues' as Sid and later in 'Babylon 5' as Londo. He has received awards for his work on both of these shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDkwNDU0Ml5BMl5BanBnXkFtZTcwNDk2MDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0432867","name":"Peter Jurasik","idIMDB":"nm0432867"},"actorId":"nm0432867","character":"Londo Mollari","urlCharacter":"http://www.imdb.com/character/ch0012577","main":true},{"actorName":"Andreas Katsulas","urlProfile":"http://www.imdb.com/name/nm0441537","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1946","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Andrew Constantine Katsulas","height":"6' (1.83 m)","bio":"Born in St. Louis, Missouri, Andreas from a working-class Greek-American family. Attracted from early childhood to being on stage when at 4 his mother took him to see a community theater performance, he took theatre as an extra-curricular activity in high school. He then majored in it at St. Louis University, where he worked his way through school doing things like waiting on tables. Next, after earning a drama fellowship, Katsulas received a Master's Degree in Theater Arts from one of the nation's top schools for the genre, Indiana University in Bloomington, Indiana. With never a doubt or hesitation, Andreas jumped right into the professional theater world, performing in plays in his native St. Louis with the Loretto-Hilton Repertory Theater. This was followed by work with the Theatre Company of Boston. After that, Katsulas moved to New York to some challenging off-off-Broadway theater at La Mama. This was followed by a fifteen-year heart and soul involvement with Peter Brook's International Theatre Company in Paris, performing around the world with a challenging combination of improvisational theater in every imaginable circumstance and space, and \"prepared\" theater pieces in traditional, as well as unconventional, theatrical spaces. Katsulas trod the boards from Lincoln Center in New York and The Kennedy Center in Washington, D.C., to the \"mean streets\" of Brooklyn and marketplaces in remote African Villages. There were performances from elite Theater Festivals in Iran, Avignon and Belgrade: in prisons & mental institutions; at rock quarries in Australia; on barrios in Venezuela; in sewage plants in Switzerland; winding through the streets of Venice, Italy; in the fields with farm workers in California, near the lakes of Minnesota with Native Americans, in sometimes extreme conditions like snow, rain, and intensive heat. During a hiatus from the stage, a part in Michael Cimino's The Sicilian (1987) brought Andreas to Los Angeles, after which he was immediately cast as Joey Venza in Ridley Scott's Someone to Watch Over Me (1987), then as Arthur, the chauffeur, in Blake Edwards's Sunset (1988). In early 2005, Andreas was diagnosed with inoperable lung cancer; he passed away a year later, in Los Angeles. He had lived there since 1986, and had hoped to return to working in the theater before his far-too-early death, just over three months shy of his 60th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441537","name":"Andreas Katsulas","idIMDB":"nm0441537"},"actorId":"nm0441537","character":"G'Kar","urlCharacter":"http://www.imdb.com/character/ch0012572","main":true},{"actorName":"Johnny Sekka","urlProfile":"http://www.imdb.com/name/nm0782885","urlPhoto":"","biography":{"dateOfBirth":"21 July 1934","placeOfBirth":" Dakar, Senegal","birthName":"Lamine Sekka","bio":"Johnny Sekka was born on July 21, 1934 in Dakar, Senegal as Lamine Sekka. He was an actor, known for The Message (1976), Babylon 5: The Gathering (1993) and Khartoum (1966). He was married to Cecilia Enger. He died on September 14, 2006 in Agua Dulce, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0782885","name":"Johnny Sekka","idIMDB":"nm0782885"},"actorId":"nm0782885","character":"Dr. Benjamin Kyle","urlCharacter":"http://www.imdb.com/character/ch0122976","main":true},{"actorName":"Patricia Tallman","urlProfile":"http://www.imdb.com/name/nm0848191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE5NzU0Nl5BMl5BanBnXkFtZTcwODY4MDEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1957","placeOfBirth":" Pontiac, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"When she portrayed \"Lyta Alexander\" in the Hugo Award-winning sci-fi series Babylon 5 (1994), Patricia Tallman was the most powerful telepath in the universe. Seems fitting, considering that the actress knew she was going to be in show business at the early age of two. It was then that she first appeared with her father, Jerry, on his Midwest radio show, soloing on \"Bicycle Built for Two\". By age 15, Pat was performing in summer stock at the Red Barn Theatre in Saugatuck, Michigan, doing ten shows in 11 weeks. She soon spent all of her high school vacations in professional summer stock, and eventually chose Carnegie Mellon University to earn a BFA in its prestigious theater arts program. While other theater majors waited tables, Pat worked her way through college, performing in eighteen musicals at the Pittsburgh Civic Light Opera. Recognizing Pat's formidable talents, CMU presented her with an award for Outstanding Achievement in Acting. Immediately after college, Pat moved to New York City, where she landed a role in the long-running off-Broadway hit \"Big, Bad Burlesque\". She went on to score other parts on the New York stage, including her favorite, \"Rosalind\" in the Riverside Shakespeare Company's production of \"As You Like It\". Television roles began shortly thereafter, when Pat was cast in a recurring role on the CBS soap opera, Guiding Light (1952). This led to roles on virtually every New York-based daytime serial. Film roles were not far behind. George A. Romero contacted her to play a role in his feature Knightriders (1981), starring Ed Harris. This led to a long working relationship with him. Pat relocated to Los Angeles , where she again worked with Romero on Creepshow 2 (1987). The film she is perhaps best known for followed: George Romero and Tom Savini's remake of the 1968 cult classic, Night of the Living Dead (1990). The move to L.A. was a smart one, Pat discovered, as she was soon cast as undercover cop \"Christy Russell\" on NBC's Generations (1993), and as an evil, sexy swashbuckler in the Ring of the Musketeers (1992). Other films include Sweet Justice (1992), Benefit of the Doubt (1993), Austin Powers: International Man of Mystery (1997) and Austin Powers: The Spy Who Shagged Me (1999). Television shows include Star Trek: The Next Generation (1987), Star Runner (1990) (A USA Network pilot), Dark Skies (1996), Babylon 5 (1994) and \"The Universe and Harry Morgann\" (an independent pilot). Pat's other projects include starring in the science-fiction thriller Never Die Twice (2001) and playing one of the leads, Lt. Richmond, in two audio plays, \"Lives of the Cat\" and \"Anne Manx\". In addition, her voice can be heard in the cartoon \"Babylon 5\" parodies Babylon Park: Frightspace (1999) and Grudge Match (2000). Equally important to Patricia are her roles of mother to son her Julian, as well as her fund-raising activities for the children of Penny Lane. Through her tireless efforts within the science fiction community, Pat and her fans have contributed more than $250,000 to Penny Lane over the past several years, the bulk of which transformed the CARE Computer Lab dream into reality. Since 1996, Pat, her friends, family and fans have made a holiday happen for the Penny Lane kids, through the Be A Santa program. Dedicated Patricia Tallman fans make a hobby of trying to spot her in her many stunt performances. An extremely athletic and former fearless member of the Stunt Woman's Association of Motion Pictures, Pat has tumbled, slid and taken punches for the likes of Laura Dern (in Jurassic Park (1993)), Gates McFadden (in \"Star Trek: Generations\"), Geena Davis (in The Long Kiss Goodnight (1996)) and Laura Prepon (in Karla (2006)). Pat's roots as a stage actress have never left her, and she continues to tread the footlights in Los Angeles whenever film and TV work allow her the time. Her latest projects include Dead Air (2009), a psychological horror film directed by Corbin Bernsen, for which her performance is getting great reviews. Pat has a book out \"Pleasure Thresholds, Patricia Tallman's Babylon 5 Memoirs\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE5NzU0Nl5BMl5BanBnXkFtZTcwODY4MDEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848191","name":"Patricia Tallman","idIMDB":"nm0848191"},"actorId":"nm0848191","character":"Lyta Alexander","urlCharacter":"http://www.imdb.com/character/ch0012576","main":true},{"actorName":"Steven R. Barnett","urlProfile":"http://www.imdb.com/name/nm0055990","urlPhoto":"","biography":{"bio":"Steven R. Barnett is known for his work on Babylon 5: The Gathering (1993), Color of Night (1994) and Virtuosity (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0055990","name":"Steven R. Barnett","idIMDB":"nm0055990"},"actorId":"nm0055990","character":"Eric Hazeltine","urlCharacter":"http://www.imdb.com/character/ch0122977","main":true},{"actorName":"Billy Hayes","urlProfile":"http://www.imdb.com/name/nm0370907","urlPhoto":"","biography":{"dateOfBirth":"3 April 1947","placeOfBirth":" New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"Billy Hayes was born on April 3, 1947 in New York City, New York, USA. He is an actor and writer, known for Midnight Express (1978), Babylon 5: The Gathering (1993) and Assassination (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0370907","name":"Billy Hayes","idIMDB":"nm0370907"},"actorId":"nm0370907","character":"Traveler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Linda Hoffman","urlProfile":"http://www.imdb.com/name/nm0389005","urlPhoto":"","biography":{"bio":"Linda Hoffman was born in Michigan, USA. She is an actress, known for Face/Off (1997), The Dentist (1996) and Babylon 5: The Gathering (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0389005","name":"Linda Hoffman","idIMDB":"nm0389005"},"actorId":"nm0389005","character":"Dome Tech #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Jason Jackson","urlProfile":"http://www.imdb.com/name/nm0413989","urlPhoto":"","biography":{"bio":"Robert Jason Jackson is known for his work on Babylon 5: The Gathering (1993), New Jersey Drive (1995) and Grand Theft Auto: Vice City (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0413989","name":"Robert Jason Jackson","idIMDB":"nm0413989"},"actorId":"nm0413989","character":"Dome Tech #3","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0106336","urlIMDB":"http://www.imdb.com/title/tt0106336","business":{"budget":{"money":"$3,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"(c) 1993 PTN Consortium All Rights Reserved"},"technical":{"runtime":["1 hr 29 min (89 min)","1 hr 34 min (94 min) (special edition)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Pacific Film Laboratories, USA"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.6","filmingLocations":[],"rated":"UNRATED","awards":[{"award":"Primetime Emmy Awards 1993","titlesAwards":[{"titleAwardOutcome":"Won Primetime Emmy","categories":[{"category":"Outstanding Individual Achievement in Special Visual Effects","names":[{"name":"Ron Thornton","id":"nm0861591","role":"visual effects designer"},{"name":"Shannon Casey","id":"nm0143534","role":"visual effects coordinator"},{"name":"Paul Beigle-Bryant","id":"nm0067179","role":"computer imaging supervisor"}]}]}]},{"award":"Hugo Awards 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Richard Compton","id":"nm0174068","role":"director"},{"name":"J. Michael Straczynski","id":"nm0833089","role":"written by"}]}]}]}],"votes":"7,180","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0039264","name":"Babylonian Productions"},{"idCompany":"co0043453","name":"Rattlesnake Productions"},{"idCompany":"co0053690","name":"Synthetic Worlds"}],"keywords":{"keywords":["space station","23rd century","alien","gas mask","based on cult tv series","space opera","telepathy","tv series pilot","outer space","assassination attempt","alien technology","future","spacecraft","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:01:01"}}