{"data":{"movies":[{"title":"Universal soldier 2 - Frères d'armes","originalTitle":"Universal Soldier II: Brothers in Arms","year":"1998","releaseDate":"19980927","directors":[{"name":"Jeff Woolnough","id":"nm0941276"}],"writers":[{"name":"Peter M. Lenkov","id":"nm0006997"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTgxMTM5MV5BMl5BanBnXkFtZTcwNTYyNzcxMQ@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Action","Sci-Fi"],"plot":"After the terrible events of the original Universal Soldier testings, the budget has been slashed by the government. Under the orders of a CIA director, a gang of mercenaries take control of the new line of Universal Soldiers and try to use them into helping to smuggle diamonds to the highest foreign buyer. When Luc Deveroux, survivor from the first incident, continues to cause problems he newly found younger brother is taken prisoner along with his news reporter friend Veronica Reynolds.","simplePlot":"The Universal Soldiers are used to smuggle diamonds for a CIA Director, but Luc Deveroux continues to cause him problems.","actors":[{"actorName":"Matt Battaglia","urlProfile":"http://www.imdb.com/name/nm0061307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTgyNTA0MV5BMl5BanBnXkFtZTcwNTExMDE5Mw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1965","placeOfBirth":" Tallahassee, Florida, USA","birthName":"Matteo Martin Battaglia","height":"6' 2\" (1.88 m)","bio":"Emmy winning Producer & Actor Matt Battaglia was Born in Tallahassee, Florida as the youngest of four children. Spent most of his life growing up in suburbs of Atlanta, Georgia. He won 2 Emmy's in 2011 for Executive Producing \"Last Shot with Judge Gunn\" and Co-Produced the Golden Globe nominated film \"Brothers\" (2009) which starred Oscar winner Natalie Portman, Oscar Nominated Jake Gyllenhaaland & was directed by 6 time Oscar nominee Jim Sheridan. As an actor, he has been credited in over 100 film and television shows. Attended the University of Louisville, was an All-American middle linebacker whom led the nation in tackles his junior & senior years, totaling 153 & 166 tackles, averaging a collegiate high of 15 tackles per game, 2 years back to back. He played in the NFL with the Philadelphia Eagles. Created The Mint Jubilee, a celebrity driven charity event at the Kentucky Derby which has raised millions of dollars for cancer patients. He created this event in memory of his mother whom he lost to cancer and it was televised worldwide in over 200 million homes and 60 countries..","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTgyNTA0MV5BMl5BanBnXkFtZTcwNTExMDE5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0061307","name":"Matt Battaglia","idIMDB":"nm0061307"},"actorId":"nm0061307","character":"Luc Devreaux / GR44","urlCharacter":"http://www.imdb.com/character/ch0012802","main":true},{"actorName":"Andrew Jackson","urlProfile":"http://www.imdb.com/name/nm0413263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1ODE0NTYyN15BMl5BanBnXkFtZTgwMDgwMjkyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1963","placeOfBirth":" Newmarket, Ontario, Canada","height":"6' 2\" (1.88 m)","bio":"Andrew Jackson was born in Newmarket, Ontario Canada to an armed forces padre and high school music teacher. As a child, Andrew enjoyed having access to the family music room complete with 20 instruments. He quickly developed an ear for music and sound. The highly talented actor has worked extensively in television, film, classical theatre, commercial voice and animation. Andrew Jackson's strong presence, character range and facility for accents and sounds has enabled him to explore a diverse range of characters and genres.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1ODE0NTYyN15BMl5BanBnXkFtZTgwMDgwMjkyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0413263","name":"Andrew Jackson","nicknames":["AJ"],"idIMDB":"nm0413263"},"actorId":"nm0413263","character":"Sgt. Andrew Scott / GR13","urlCharacter":"http://www.imdb.com/character/ch0012805","main":true},{"actorName":"Eric Bryson","urlProfile":"http://www.imdb.com/name/nm0117455","urlPhoto":"","biography":{"height":"6' 3\" (1.91 m)","bio":"Eric Bryson is known for his work on X-Men (2000), Eragon (2006) and The Day After Tomorrow (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0117455","name":"Eric Bryson","idIMDB":"nm0117455"},"actorId":"nm0117455","character":"Peterson / GR80","urlCharacter":"http://www.imdb.com/character/ch0012812","main":true},{"actorName":"Kevin Rushton","urlProfile":"http://www.imdb.com/name/nm0750764","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MjU5OTA3OV5BMl5BanBnXkFtZTYwMjQ5Njk3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Kevin Rushton is known for his work on The Incredible Hulk (2008), Dawn of the Dead (2004) and X-Men: L'affrontement final (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MjU5OTA3OV5BMl5BanBnXkFtZTYwMjQ5Njk3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0750764","name":"Kevin Rushton","idIMDB":"nm0750764"},"actorId":"nm0750764","character":"Martinez / GR81","urlCharacter":"http://www.imdb.com/character/ch0435919","main":true},{"actorName":"Desmond Campbell","urlProfile":"http://www.imdb.com/name/nm0132384","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMjAwMjk4MV5BMl5BanBnXkFtZTcwNjI0NTgyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Desmond Campbell is known for his work on The Bone Collector (1999), The Incredible Hulk (2008) and X-Men: Apocalypse (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMjAwMjk4MV5BMl5BanBnXkFtZTcwNjI0NTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0132384","name":"Desmond Campbell","idIMDB":"nm0132384"},"actorId":"nm0132384","character":"Cooper / GR82","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Copeman","urlProfile":"http://www.imdb.com/name/nm0178680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxODIwMzM3MF5BMl5BanBnXkFtZTgwOTYxMTI2MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michael Copeman is known for his work on The Fly (1986), The Assassination of Jesse James by the Coward Robert Ford (2007) and Focus (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxODIwMzM3MF5BMl5BanBnXkFtZTgwOTYxMTI2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0178680","name":"Michael Copeman","idIMDB":"nm0178680"},"actorId":"nm0178680","character":"Lt. Col. Jack Cameron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Busey","urlProfile":"http://www.imdb.com/name/nm0000997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjM5NjE5NF5BMl5BanBnXkFtZTYwNTk3MjUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1944","placeOfBirth":" Goose Creek, Texas, USA","birthName":"William Gary Busey","height":"6' (1.83 m)","bio":"A blond-haired, fair-complexioned actor with a toothy grin and capable of an unsettling glint in his eyes, Gary Busey was born in Goose Creek, Texas, and was raised in Oklahoma. He is the son of Sadie Virginia (Arnett), a homemaker, and Delmar Lloyd Busey, a construction design manager. He has English, as well as Irish, Scottish, and German, ancestry. He graduated from Nathan Hale High School in Tulsa, Oklahoma in 1962 and for a while was a professional musician. A talented drummer, he played in several bands, including those of country-and-western legends Leon Russell, Kris Kristofferson and Willie Nelson. Busey's first film appearance was as a biker in the low-budget Angels Hard as They Come (1971) and, over the next few years, he landed several film roles generally as a country hick/redneck or surly, rebellious types. His real breakthrough came in the dynamic film The Buddy Holly Story (1978), with Busey taking the lead role as Buddy Holly, in addition to playing guitar and singing all the vocals! His stellar performance scored him a Best Actor nomination and the attention of Hollywood taking overcasting agents. Next up, he joined fellow young actors William Katt and Jan-Michael Vincent as surfing buddies growing up together in the cult surf film Big Wednesday (1978), directed by John Milius. However, a string of appearances in somewhat mediocre films took him out of the spotlight for several years, until he played the brutal assassin Mr. Joshua trying to kill Los Angeles cops Mel Gibson and Danny Glover in the runaway mega-hit Lethal Weapon (1987). Further strong roles followed, including alongside Danny Glover once again in Predator 2 (1990). He was back on the beaches, this time tracking bank robbers with FBI agent Keanu Reeves, in Point Break - Extrême limite (1991) and nearly stole the show as a psychotic Navy officer in league with terrorists led by Tommy Lee Jones taking over the USS Missouri in the highly popular Piège en haute mer (1992). The entertaining Busey has continued to remain busy in front of the cameras and has certainly developed a minor cult following among many film fans. Plus, he's also the proud father of accomplished young actor Jake Busey, whose looks make him almost a dead ringer for his famous father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjM5NjE5NF5BMl5BanBnXkFtZTYwNTk3MjUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000997","name":"Gary Busey","nicknames":["Barry Goosey"],"idIMDB":"nm0000997"},"actorId":"nm0000997","character":"Otto Mazur","urlCharacter":"http://www.imdb.com/character/ch0012806","main":true},{"actorName":"Burt Reynolds","urlProfile":"http://www.imdb.com/name/nm0000608","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzc1ODA1OF5BMl5BanBnXkFtZTcwMTc4MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1936","placeOfBirth":" Lansing, Michigan, USA","birthName":"Burton Leon Reynolds Jr.","height":"5' 11\" (1.8 m)","bio":"Enduring, strong-featured, and genial star of US cinema, Burt Reynolds started off in TV westerns in the 1960s and then carved his name into 1970/1980s popular culture as a male sex symbol (posing nearly naked for \"Cosmopolitan\" magazine) and on-screen as both a rugged action figure and then as a wisecracking, Southern-type \"good olé' boy.\" Burton Leon Reynolds was born in Lansing, Michigan. He is the son of Fern H. (Miller) and Burton Milo Reynolds, who was in the army and later served as chief of police. His family moved to Florida, where he excelled as an athlete and played with Florida State University. He became an All Star Southern Conference halfback (and was earmarked by the Baltimore Colts) before a knee injury and a car accident ended his football career. Midway through college he dropped out and headed to New York with aspirations of becoming an actor. There he worked in restaurants and clubs while pulling the odd TV spot or theatre role. He was spotted in a New York City production of \"Mister Roberts,\" signed to a TV contract, and eventually had recurring roles in such shows as Gunsmoke (1955), Riverboat (1959) and his own series, Hawk (1966). Reynolds continued to appear in undemanding western roles, often playing an Indian halfbreed, in films such as Navajo Joe (1966), 100 Rifles (1969) and Sam Whiskey (1969). However, it was his tough-guy performance as macho Lewis Medlock in the John Boorman backwoods nightmare Deliverance (1972) that really stamped him as a bona-fide star. Reynolds' popularity continued to soar with his appearance as a no-nonsense private investigator in Shamus (1973) and in the Woody Allen comedy Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972). Building further on his image as a Southern boy who outsmarts the local lawmen, Reynolds packed fans into theaters to see him in White Lightning (1973), The Longest Yard (1974), W.W. and the Dixie Dancekings (1975) and Gator (1976). At this time, ex-stuntman and longtime Reynolds buddy Hal Needham came to him with a \"road film\" script. It turned out to be the incredibly popular Smokey and the Bandit (1977) with Sally Field and Jerry Reed, which took in over $100 million at the box office. That film's success was followed by Smokey and the Bandit II (1980) and Smokey and the Bandit Part 3 (1983). Reynolds also appeared alongside Kris Kristofferson in the hit football film Semi-Tough (1977), with friend Dom DeLuise in the black comedy The End (1978) (which Reynolds directed), in the stunt-laden buddy film Hooper (1978) and then in the self-indulgent, star-packed road race flick The Cannonball Run (1981). The early 1980s started off well with a strong performance in the violent cop film Sharky's Machine (1981), which he also directed, and he starred with Dolly Parton in The Best Little Whorehouse in Texas (1982) and with fellow macho superstar Clint Eastwood in the coolly received City Heat (1984). However, other projects such as Stroker Ace (1983), Stick (1985) and Paternity (1981) failed to catch fire with fans and Reynolds quickly found himself falling out of popularity with movie audiences. In the late 1980s he appeared in only a handful of films, mostly below average, before his old friend television came to the rescue and he shone again in two very popular TV shows, B.L. Stryker (1989) and Evening Shade (1990), for which he won an Emmy. He was back on screen, but still the roles weren't grabbing the public's attention, until his terrific performance as a drunken politician in the otherwise woeful Striptease (1996) and then another tremendous showing as a manipulative porn director in Boogie Nights (1997), which scored him a Best Supporting Actor nomination. Like the phoenix from the ashes, Reynolds had resurrected his popularity and, in the process, had gathered a new generation of young fans, many of whom had been unfamiliar with his 1970s film roles. He put in entertaining work in Pups (1999), Mystery, Alaska (1999), Driven (2001) and L'enfant et le loup (2002). Definitely one of Hollywood's most resilient stars, Reynolds has continually surprised all with his ability to weather both personal and career hurdles and his 40-plus years in front of the cameras is testament to his staying ability, his acting talent and his appeal to film audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzc1ODA1OF5BMl5BanBnXkFtZTcwMTc4MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000608","name":"Burt Reynolds","nicknames":["Buddy"],"idIMDB":"nm0000608"},"actorId":"nm0000608","character":"Mentor","urlCharacter":"http://www.imdb.com/character/ch0216912","main":true},{"actorName":"Richard McMillan","urlProfile":"http://www.imdb.com/name/nm0534021","urlPhoto":"","biography":{"dateOfBirth":"20 March 1951","placeOfBirth":" Beaverton, Ontario, Canada","bio":"Richard McMillan was born on March 20, 1951 in Beaverton, Ontario, Canada. He was an actor, known for The Fountain (2006), The Day After Tomorrow (2004) and Cube Zero (2004). He was married to Anne Louise Bannon. He died on February 19, 2017 in Toronto, Ontario.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0534021","name":"Richard McMillan","idIMDB":"nm0534021"},"actorId":"nm0534021","character":"Dr. Walker","urlCharacter":"http://www.imdb.com/character/ch0012810","main":true},{"actorName":"Chandra West","urlProfile":"http://www.imdb.com/name/nm0921979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1OGMxMzktODViNC00MjZjLWJhN2MtZTFmYmMzMzE2NTZlL2ltYWdlXkEyXkFqcGdeQXVyMTQ3NTE5MDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1970","placeOfBirth":" Edmonton, Alberta, Canada","birthName":"Chandra K. West","height":"5' 6\" (1.68 m)","bio":"Chandra West was born in Alberta, Canada, the youngest of nine children. Growing up in Oakville, Ontario, outside of Toronto, she developed an early interest in the arts. This led to 10 years of intensive ballet training. When she was 16, she enrolled in a summer theater program at Oxford University in England, which started her down the path to pursuing a career in acting. She went on to study in the Theater Performance Program at Concordia University in Montreal, Quebec. Notable roles include the Canadian miniseries, Revenge of the Land (1999), directed by John N. Smith; the feature film, The Salton Sea (2002), opposite Val Kilmer; the NBC television series, Mister Sterling (2003), with Josh Brolin; the feature, White Noise (2005), starring alongside Michael Keaton; a major recurring role on NYPD Blue (1993), as Mark-Paul Gosselaar's bi-polar doctor girlfriend; the HBO series, \"John From Cincinnati\" (2007)_, from creator David Milch; the Canadian television movie, Le poids des souvenirs (2008), for which she received a Gemini nomination for Best Actress in a Leading Role; and the ABC supernatural series, The Gates (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1OGMxMzktODViNC00MjZjLWJhN2MtZTFmYmMzMzE2NTZlL2ltYWdlXkEyXkFqcGdeQXVyMTQ3NTE5MDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0921979","name":"Chandra West","idIMDB":"nm0921979"},"actorId":"nm0921979","character":"Veronica","urlCharacter":"http://www.imdb.com/character/ch0012803","main":true},{"actorName":"Aron Tager","urlProfile":"http://www.imdb.com/name/nm0846488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTU5MjIwN15BMl5BanBnXkFtZTgwMTY1Njc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1934","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"Born in Brooklyn, New York in the 1930s, Aron Tager moved to Canada where he appeared in various Canadian theatre productions. Then got into a 25 year hiatus of art, sculpting and poetry. It wasn't until 1991, when he and his wife Ann Page who was also involved in poetry, appeared on-screen with small bit parts in various films. Tager first appeared in film in Requiem pour un beau sans-coeur (1992), and in several episodes of Are You Afraid of the Dark? (1990) which lasted until 1994, when Tager went on to co-star in Canadian features such as Deux doigts de meurtre (1993), Gary Busey's Canvas (1992), Warrior (1994), Eye Of The Wolf (1995), and a spooky TV sequel Trilogy Of Terror II (1996)(TV) as Steve the security Guard. Tager recently appeared as a janitor in the major motion picture Serendipity (2001), and co-starred in the upcoming mobster flick Protection (2001) as Lujak.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTU5MjIwN15BMl5BanBnXkFtZTgwMTY1Njc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0846488","name":"Aron Tager","idIMDB":"nm0846488"},"actorId":"nm0846488","character":"John Devreaux","urlCharacter":"http://www.imdb.com/character/ch0012809","main":true},{"actorName":"Barbara Gordon","urlProfile":"http://www.imdb.com/name/nm0329876","urlPhoto":"","biography":{"bio":"Barbara Gordon is known for her work on Faux-semblants (1988), Cube²: Hypercube (2002) and Men with Brooms (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0329876","name":"Barbara Gordon","idIMDB":"nm0329876"},"actorId":"nm0329876","character":"Danielle Devreaux","urlCharacter":"http://www.imdb.com/character/ch0278473","main":true},{"actorName":"Carla Collins","urlProfile":"http://www.imdb.com/name/nm0172198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzOTU4MjE0MF5BMl5BanBnXkFtZTcwNTc0MjcwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1965","placeOfBirth":" Sault Ste. Marie, Ontario, Canada","height":"5' 11\" (1.8 m)","bio":"Carla Collins is an award-winning comedian, actress, television host and writer. A gifted stand-up, she has been hailed by the press as \"Canada's Tina Fey\" and the \"Queen of Comedy\". Carla performs across North America and is currently a regular at the Laugh Factory in Los Angeles and on tour with the renowned \"Hot Tamales\". Carla's hysterical television series \"CARLAWOOD\" is a hit with viewers and critics alike. She just finished filming Season Two of the highly acclaimed docu-soap/comedy airing May 2010 in Canada, and recently released her first book \"Angels, Vampires and Douche Bags\" to broad praise from critics and fans alike. Carla is currently working on the movie The Hack, a comedy/horror film in which she stars as a comedian who kills other performers for their material. Having hosted a variety of television series and shows including \"Entertainment Now\", \"ET Canada\", \"The Gemini Awards\", \"Behind the Scenes at Just for Laughs\", \"Live from the Red Carpet\", \"Chez Carla\" and \"The Canadian Music Awards\", Carla is a well-known and respected across North America. Her one-hour comedy special \"The Wonderbra Years\" is one of the highest-rated of CTV's Comedy Now series as well as the recipient of the Gold Award at the Houston Comedy Festival. Carla currently lives in Malibu with her actor husband and rescue wonder dogs Miles and Dr. Zira. Carla practices yoga, Kabbalah and consults with a psychic colon therapist.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzOTU4MjE0MF5BMl5BanBnXkFtZTcwNTc0MjcwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0172198","name":"Carla Collins","idIMDB":"nm0172198"},"actorId":"nm0172198","character":"Anchorwoman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Kee","urlProfile":"http://www.imdb.com/name/nm0444339","urlPhoto":"","biography":{"bio":"James Kee is known for his work on Opération Casse-noisette (2014), Material World (1990) and Blackfly (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0444339","name":"James Kee","idIMDB":"nm0444339"},"actorId":"nm0444339","character":"Jasper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank McAnulty","urlProfile":"http://www.imdb.com/name/nm0564080","urlPhoto":"","biography":{"dateOfBirth":"25 September 1955","placeOfBirth":" Sarnia, Ontario, Canada","birthName":"Francis McGhee McAnulty","bio":"Frank McAnulty was born on September 25, 1955 in Sarnia, Ontario, Canada as Francis McGhee McAnulty. He was an actor, known for Frequency (2000), Kit Kittredge: An American Girl (2008) and A Christmas Visitor (2002). He was married to Laura McGhee. He died on April 3, 2016 in Toronto, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0564080","name":"Frank McAnulty","idIMDB":"nm0564080"},"actorId":"nm0564080","character":"Purser","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0186654","urlIMDB":"http://www.imdb.com/title/tt0186654","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"10","year":"1997","remarks":null},null],"copyrightHolder":"©1998 Unisol Productions Inc."},"technical":{"runtime":["1 hr 32 min (92 min) (USA)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":["The Lab, Toronto, Canada"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.0","filmingLocations":[{"location":"Regensburg, Bavaria, Germany"}],"rated":"R","awards":[],"votes":"1,473","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0038123","name":"Catalyst Entertainment Production"},{"idCompany":"co0052236","name":"Durrant Fox Productions Inc."},{"idCompany":"co0080004","name":"Rigel Independent Entertainment"}],"keywords":{"keywords":["m 16","gun battle","ak 47","kickboxing","roundhouse kick","karate kick","karate chop","karate","kung fu","martial arts","hand to hand combat","combat","returning character with different actor","cult film","mixed martial arts","semiautomatic pistol","pistol","gunfight","shootout","showdown","fistfight","brawl","violence","warrior","one against many","one man army","tough guy","action hero","hero","made for cable tv","undead","u.s. army","top secret","sequel","second part","military","military life","experiment","army","army life","vietnam","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:49:52"}}