{"data":{"movies":[{"title":"Picking Up the Pieces","originalTitle":"","year":"2000","releaseDate":"20000830","directors":[{"name":"Alfonso Arau","id":"nm0000778"}],"writers":[{"name":"Bill Wilson","id":"nm0006797"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjY1ODI1N15BMl5BanBnXkFtZTcwNTI4ODQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Fantasy"],"plot":"Woody Allen plays Tex, a kosher butcher. Sharon Stone plays his unfaithful wife Candy. Tex catches Candy in the act and in a fit of rage he kills her. To conceal his crime he cuts up her body and buries it in the desert in New Mexico. However, when her hand surfaces, a blind woman trips over it and it restores her sight. The hand is then considered to be the \"hand of the Virgin.\" Despite the church's fallen priest objecting, the ambitious mayor of the town creates an international three-ring circus of miracle-seekers, TV crews, and born-again local prostitutes all interested in the hand. All of this goes on while Tex is desperately trying to recover the hand before the sheriff finds it and uses it as evidence against him.","simplePlot":"A small New Mexican village discovers a severed hand that is considered a miracle of God, when it actually belongs to a murdered spouse with a husband in search of it.","actors":[{"actorName":"Woody Allen","urlProfile":"http://www.imdb.com/name/nm0000095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjU3MTI2MF5BMl5BanBnXkFtZTcwMDgxNTE4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1935","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Allan Stewart Konigsberg","height":"5' 5\" (1.65 m)","bio":"Woody Allen was born Allan Stewart Konigsberg on December 1, 1935 in Brooklyn, New York, to Nettie (Cherrie), a bookkeeper, and Martin Konigsberg, a waiter and jewellery engraver. His father was of Russian Jewish descent, and his maternal grandparents were Austrian Jewish immigrants. As a young boy, he became intrigued with magic tricks and playing the clarinet, two hobbies that he continues today. Allen broke into show business at 15 years when he started writing jokes for a local paper, receiving $200 a week. He later moved on to write jokes for talk shows but felt that his jokes were being wasted. His agents, Charles Joffe and Jack Rollins, convinced him to start doing stand-up and telling his own jokes. Reluctantly he agreed and, although he initially performed with such fear of the audience that he would cover his ears when they applauded his jokes, he eventually became very successful at stand-up. After performing on stage for a few years, he was approached to write a script for Warren Beatty to star in: Quoi de neuf, Pussycat? (1965) and would also have a moderate role as a character in the film. During production, Woody gave himself more and better lines and left Beatty with less compelling dialogue. Beatty inevitably quit the project and was replaced by Peter Sellers, who demanded all the best lines and more screen-time. It was from this experience that Woody realized that he could not work on a film without complete control over its production. Woody's theoretical directorial debut was in What's Up, Tiger Lily? (1966); a Japanese spy flick that he dubbed over with his own comedic dialogue about spies searching for the secret recipe for egg salad. His real directorial debut came the next year in the mockumentary Take the Money and Run (1969). He has written, directed and, more often than not, starred in about a film a year ever since, while simultaneously writing more than a dozen plays and several books of comedy. While best known for his romantic comedies Annie Hall (1977) and Manhattan (1979), Woody has made many transitions in his films throughout the years, transitioning from his \"early, funny ones\" of Bananas (1971), Love and Death (1975) and Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972); to his more storied and romantic comedies of Annie Hall (1977), Manhattan (1979) and Hannah and Her Sisters (1986); to the Bergmanesque films of Stardust Memories (1980) and Interiors (1978); and then on to the more recent, but varied works of Crimes and Misdemeanors (1989), Husbands and Wives (1992), Mighty Aphrodite (1995), _Celebrity_ and Deconstructing Harry (1997); and finally to his films of the last decade, which vary from the light comedy of Scoop (2006), to the self-destructive darkness of Match Point (2005) and, most recently, to the cinematically beautiful tale of Vicky Cristina Barcelona (2008). Although his stories and style have changed over the years, he is regarded as one of the best filmmakers of our time because of his views on art and his mastery of filmmaking.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjU3MTI2MF5BMl5BanBnXkFtZTcwMDgxNTE4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000095","name":"Woody Allen","idIMDB":"nm0000095"},"actorId":"nm0000095","character":"Tex Cowley","urlCharacter":"http://www.imdb.com/character/ch0147279","main":true},{"actorName":"Sharon Stone","urlProfile":"http://www.imdb.com/name/nm0000232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1958","placeOfBirth":" Meadville, Pennsylvania, USA","birthName":"Sharon Yvonne Stone","height":"5' 8½\" (1.74 m)","bio":"Sharon Yvonne Stone was born and raised in Meadville, a small town in Pennsylvania, to Dorothy Marie (Lawson), an accountant and homemaker, and Joseph William Stone II, a factory worker. Her father was strict. She was the second of four children, and has English, German, Scottish, and Irish ancestry. At the age of 15, she studied in Saegertown High School, Pennsylvania and, at that same age, entered Edinboro State University of Pennsylvania, and graduated with a degree in creative writing and fine arts. She was a very smart girl, became a bookworm, and once was told that a suitable job for her (and her brains) was to become a lawyer. However, her first love was still the black-and-white movies, especially those featuring Fred Astaire and Ginger Rogers. So, the 17-year-old Sharon got herself into the Miss Crawford County and won the beauty contest. From working part-time as a McDonald's counter girl, she worked her way up to become a successful Ford model, both in TV commercials and print ads. In 1980, she made her film debut as an extra in Woody Allen's Stardust Memories (1980). Her first speaking part was in Wes Craven's horror movie, Deadly Blessing (1981). She struggled through many parts in B-movies, such as King Solomon's Mines (1985) and Action Jackson (1988). She was also married in 1984 to Michael Greenburg, the producer of MacGyver (1985), but they divorced two years later. She finally got her big break with a memorable supporting role in the popular Arnold Schwarzenegger movie Total Recall (1990), and also posed nude for Playboy, a daring move for a 32-year-old actress. But it worked; she was cast in the breakthrough role as a sociopath novelist, \"Catherine Tramell\", in Basic Instinct (1992). Her interrogation scene has become a classic in film history and her performance captivated everyone, from MTV viewers, who honored her with Most Desirable Female and Best Female Performance Awards, to a Golden Globe nomination for Best Actress. After she got famous, she didn't want to be typecast, so she played a victim in Sliver (1993), and, in Intersection (1994), she was the aloof, estranged wife of Richard Gere. Then she appeared in more aggressive roles, such as The Specialist (1994) with Sylvester Stallone and Mort ou vif (1995) with Gene Hackman. But it wasn't until she played a beautiful but drug-crazy trophy wife of Robert De Niro in Casino (1995) that she got far more than just fame and fortune--she also received the acknowledgment of the movie industry for her acting ability. She received her first Golden Globe and an Oscar nomination. She did a couple of films released the next year, teaming up with Isabelle Adjani in Diabolique (1996), and as a woman waiting for her death penalty in Last Dance (1996). In 1998, she married a newspaper editor,Phil Bronstein but they divorced later in 2004. She received her third Golden Globe nomination for The Mighty (1998), a film that her company, \"Chaos\", also co-executive produced. The next year, she played the title role in Gloria (1999) and entered her first comedic role in The Muse (1999), which gave her another Golden Globe nomination. Sharon Stone, a diva who thoroughly enjoys her hard-won stardom, is now a mother of three children: Roan, Laird and Quinn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000232","name":"Sharon Stone","idIMDB":"nm0000232"},"actorId":"nm0000232","character":"Candy Cowley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Grazia Cucinotta","urlProfile":"http://www.imdb.com/name/nm0002029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE4NzY1MTIxNl5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1968","placeOfBirth":" Messina, Sicily, Italy","height":"5' 9¾\" (1.77 m)","bio":"Maria Grazia Cucinotta (born 27 July 1968) is an Italian actress who has featured in many films and television series since 1990. She has also worked as a producer, screenwriter and model. Cucinotta was born in Messina, Province of Messina, Sicily, Italy. She is well known in Italy as a movie and television actress, but internationally she is best known for her roles in Il Postino and as the Bond girl, credited as the Cigar Girl, in the James Bond film The World Is Not Enough.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE4NzY1MTIxNl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002029","name":"Maria Grazia Cucinotta","idIMDB":"nm0002029"},"actorId":"nm0002029","character":"Desi","urlCharacter":"http://www.imdb.com/character/ch0431422","main":true},{"actorName":"Cheech Marin","urlProfile":"http://www.imdb.com/name/nm0001507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODU1ODEzOF5BMl5BanBnXkFtZTYwMzkwODY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"Richard Anthony Marin","height":"5' 6\" (1.68 m)","bio":"Cheech Marin was born on July 13, 1946 in Los Angeles, California, USA as Richard Anthony Marin. He is an actor, known for The Lion King (1994), Nash Bridges (1996) and Cars (2006). He has been married to Natasha Rubin since August 8, 2009. He was previously married to Patti Heid and Rikki Marin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODU1ODEzOF5BMl5BanBnXkFtZTYwMzkwODY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001507","name":"Cheech Marin","idIMDB":"nm0001507"},"actorId":"nm0001507","character":"Mayor Machado","urlCharacter":"http://www.imdb.com/character/ch0431423","main":true},{"actorName":"David Schwimmer","urlProfile":"http://www.imdb.com/name/nm0001710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2Mjg5ODIzNF5BMl5BanBnXkFtZTgwNjIwMjI0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1966","placeOfBirth":" Astoria, New York, USA","birthName":"David Larry Schwimmer","height":"6' 1\" (1.85 m)","bio":"Born in New York and raised in Los Angeles, Schwimmer was encouraged by a high school instructor to attend a summer program in acting at Northwestern University. Inspired by that experience, he returned to Northwestern where he received a bachelor's degree in speech/theater. In 1988, along with seven other Northwestern graduates, he co-founded Chicago's Lookingglass Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2Mjg5ODIzNF5BMl5BanBnXkFtZTgwNjIwMjI0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001710","name":"David Schwimmer","nicknames":["Schwimmer"],"idIMDB":"nm0001710"},"actorId":"nm0001710","character":"Father Leo Jerome","urlCharacter":"http://www.imdb.com/character/ch0431424","main":true},{"actorName":"Kiefer Sutherland","urlProfile":"http://www.imdb.com/name/nm0000662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MjI5ODI3Nl5BMl5BanBnXkFtZTcwNTQzOTM0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1966","placeOfBirth":" Paddington, London, England, UK","birthName":"Kiefer William Frederick Dempsey George Rufus Sutherland","height":"5' 8½\" (1.74 m)","bio":"Kiefer Sutherland was born in London, England, UK, to Canadian actors Shirley Douglas and Donald Sutherland, who moved to California shortly after his birth. His maternal grandfather, Tommy Douglas, was a Scottish-born Canadian politician who was a Premier of Saskatchewan for over 17 years and led the national NDP party for almost 10. Kiefer got his first film role in the comedy drama Max Dugan Returns (1983). Sutherland's first major role was in the Canadian drama Un printemps sous la neige (1984), which earned Sutherland and director Daniel Petrie, Genie award nominations for best actor and best director, respectively. Following his success in The Bay Boy, Sutherland eventually moved to Los Angeles and landed television appearances in \"The Mission\", an episode of Amazing Stories (1985) and in the telefilm Trapped in Silence (1986) with Marsha Mason. In 1992, Sutherland starred opposite Ray Liotta and Forest Whitaker in Article 99 (1992) and in the military drama A Few Good Men (1992) also starring Jack Nicholson and Tom Cruise. Later, in 1994, he starred with Jeff Bridges and Nancy Travis in the American version of The Vanishing (1993) for 20th Century Fox. In 1997, he co-starred with William Hurt and Rufus Sewell in Dark City (1998), directed by Alex Proyas, which was a special presentation at the Cannes Film Festival. Sutherland also added his second directorial credit and starred in Truth or Consequences, N.M. (1997) alongside Kevin Pollak, Mykelti Williamson, Rod Steiger and Martin Sheen. He stars in the Fox drama series 24 (2001) as Jack Bauer for which he has earned a Golden Globe for Best Actor in a Drama Series. Most recently, he has been seen in the movie Phone Booth (2002) as a man who calls up someone at a phone booth and threatens to kill them if they hang up.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MjI5ODI3Nl5BMl5BanBnXkFtZTcwNTQzOTM0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000662","name":"Kiefer Sutherland","idIMDB":"nm0000662"},"actorId":"nm0000662","character":"Officer Bobo","urlCharacter":"http://www.imdb.com/character/ch0101447","main":true},{"actorName":"Alfonso Arau","urlProfile":"http://www.imdb.com/name/nm0000778","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzM4MDAyOV5BMl5BanBnXkFtZTgwNDc5MTkzMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1932","placeOfBirth":" Mexico City, Distrito Federal, Mexico","bio":"Alfonso Arau has had a long and fruitful career both in front of and behind the camera and is one of the most prominent filmmakers of the Latino community in Hollywood. He was a drama disciple of Seki Sano--a Japanese teacher, classmate of Lee Strasberg with Konstantin Stanislavski in Russia--and traveled the world from 1964 to 1968 with his one-man show, \"Pantomime Happy Madness\", after studying with Etienne Decroux and Jacques Lecoq in Paris. A renowned writer-producer-director-actor in theater and films for more than 20 years, in 1969 he directed his first feature film, El águila descalza (1971), in which he also starred. He has directed many films in Mexico, among them Inspector Calzonzin (1974) and Mojado Power (1981). He has received six Arieles--the Mexican equivalent of the Oscar--and numerous international film awards. Arau has acted in a number of Mexican and Hollywood films, including The Wild Bunch (1969), El topo (1970), Mojado Power (1981), Used Cars (1980), Romancing the Stone (1984), ¡Three Amigos! (1986) and Committed (2000). In addition to Les épices de la passion (1992), his directing credits include A Walk in the Clouds (1995) with Keanu Reeves and Picking Up the Pieces (2000) with Woody Allen. For television he has done The Magnificent Ambersons (2002), based on the script of Orson Welles' film version (The Magnificent Ambersons (1942)) and the novel by Booth Tarkington.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzM4MDAyOV5BMl5BanBnXkFtZTgwNDc5MTkzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000778","name":"Alfonso Arau","idIMDB":"nm0000778"},"actorId":"nm0000778","character":"Dr. Amado","urlCharacter":"http://www.imdb.com/character/ch0431425","main":true},{"actorName":"Danny De La Paz","urlProfile":"http://www.imdb.com/name/nm0209336","urlPhoto":"","biography":{"dateOfBirth":"3 April 1957","placeOfBirth":" Whittier, California, USA","birthName":"Daniel R. De La Paz","bio":"Danny De La Paz was born on April 3, 1957 in Whittier, California, USA as Daniel R. De La Paz. He is an actor and producer, known for Miracle Mile (1988), Border Cop (1980) and Picking Up the Pieces (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0209336","name":"Danny De La Paz","idIMDB":"nm0209336"},"actorId":"nm0209336","character":"Lalo Taxi Driver","urlCharacter":"http://www.imdb.com/character/ch0431426","main":true},{"actorName":"Andy Dick","urlProfile":"http://www.imdb.com/name/nm0004873","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NTYyNjk3MV5BMl5BanBnXkFtZTYwMTk3MTAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1965","placeOfBirth":" Charleston, South Carolina, USA","birthName":"Andrew R. Dick","height":"5' 10\" (1.78 m)","bio":"Andy Dick was born on December 21, 1965 in Charleston, South Carolina, USA as Andrew R. Dick. He is an actor and producer, known for NewsRadio (1995), The Lion King 2: Simba's Pride (1998) and Road Trip (2000). He was previously married to Ivone Kowalczyk.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NTYyNjk3MV5BMl5BanBnXkFtZTYwMTk3MTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004873","name":"Andy Dick","idIMDB":"nm0004873"},"actorId":"nm0004873","character":"Father Buñuel","urlCharacter":"http://www.imdb.com/character/ch0431427","main":true},{"actorName":"Fran Drescher","urlProfile":"http://www.imdb.com/name/nm0000376","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODcxODAyM15BMl5BanBnXkFtZTcwNDcxMDUwMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1957","placeOfBirth":" Flushing, Queens, New York City, New York, USA","birthName":"Francine Joy Drescher","height":"5' 4½\" (1.64 m)","bio":"Francine Joy Drescher was born on September 30th, 1957 in Flushing, Queens, New York to Mort Drescher and Sylvia Drescher. Fran, as she is called, attended Hillcrest High school in New York with another now-famous name, Ray Romano. She was a studious girl and was quite popular. In fact, at age fifteen, she'd met the man she thought she'd spend the rest of her life with. That man was Peter Marc Jacobson. Her first break was in the unforgettable movie, Saturday Night Fever (1977) with John Travolta. She continued to play small roles in movies, until she came up with the idea for The Nanny (1993). She was visiting a friend in England and came up with the plot line. The Nanny (1993) became an instant success, and so did Fran. Since then, she has been in films such as The Beautician and the Beast (1997) (which she also produced) and Picking Up the Pieces (2000) co-starring Woody Allen. Fran has since divorced her husband Jacobson. She is a cancer survivor and an inspiration to women everywhere.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODcxODAyM15BMl5BanBnXkFtZTcwNDcxMDUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000376","name":"Fran Drescher","nicknames":["Frannie"],"idIMDB":"nm0000376"},"actorId":"nm0000376","character":"Sister Frida","urlCharacter":"http://www.imdb.com/character/ch0431428","main":true},{"actorName":"Joseph Gordon-Levitt","urlProfile":"http://www.imdb.com/name/nm0330687","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTg0NTkzNF5BMl5BanBnXkFtZTcwNTQ4MTcwOQ@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1981","placeOfBirth":" Los Angeles, California, USA","birthName":"Joseph Leonard Gordon-Levitt","height":"5' 9¼\" (1.76 m)","bio":"Joseph Leonard Gordon-Levitt was born February 17, 1981 in Los Angeles, California, to Jane Gordon and Dennis Levitt. Joseph was raised in a Jewish family with his late older brother, Dan Gordon-Levitt, who passed away in October 2010. His parents worked for the Pacifica Radio station KPFK-FM and his maternal grandfather, Michael Gordon, had been a well-known movie director. After working for several years as a child actor, Joseph became better known for starring on the hit television series 3rd Rock from the Sun (1996), for which he earned two Hollywood Reporter Young Star Awards. In addition, the show earned three Screen Actors Guild Award nominations for Outstanding Peformance by an Ensemble in a Comedy Series. Prior to his success on television, Joseph had already worked steadily in feature films, debuting in the Robert Redford film A River Runs Through It (1992). He won a Young Artist Award for the latter film. During the 1990s, he also co-starred in the films Angels in the Outfield (1994), The Juror (1996), Halloween H20: 20 Years Later (1998), and 10 Things I Hate About You (1999). Following his work on 3rd Rock from the Sun (1996), Joseph took time off from acting to attend Columbia University. In the early 2000s, he broke from the mold of his television and film comedy supporting roles by appearing in a string of intense dramatic roles, mostly in smaller, independent films such as Manic (2001), with Don Cheadle; Mysterious Skin (2004), for writer/director Gregg Araki; Rian Johnson's award-winning debut film, Brick (2005); Lee Daniels' Shadowboxer (2005); the crime drama The Lookout (2007), which marked Scott Frank's directorial debut; John Madden's Killshot (2008), with Diane Lane and Mickey Rourke; and the controversial drama Stop-Loss (2008), in which he starred with Ryan Phillippe, under the direction of Kimberly Peirce. By 2009, Joseph was officially established as one of the leading men of indie cinema with his Golden Globe-nominated role in the comedy-drama 500 Days of Summer (2009), for which he also received an Independent Spirit Award nod. He also adapted the Elmore Leonard short story Sparks into a 24-minute short film that he directed (Sundance Film Festival 2009). In 2010, he headlined the indie drama Hesher (2010) and also established himself as a mainstream star in Christopher Nolan's Inception (2010). Balancing both independent and Hollywood film, Joseph scored another Golden Globe nod for the cancer drama 50/50 (2011), directed by Jonathan Levine and also starring Seth Rogen, Anna Kendrick, and Bryce Dallas Howard. He worked again with director Nolan on The Dark Knight Rises (2012) (for which he received a People's Choice Award nomination for Favorite Movie Actor), and snagged leading roles in both Premium Rush (2012), directed by David Koepp, and Looper (2012), for which he reunited with his Brick director, Rian Johnson, and starred opposite Bruce Willis and Emily Blunt. Also in 2012, he played Abraham Lincoln's son Robert in Steven Spielberg's Oscar-nominated Lincoln (2012), with Daniel Day-Lewis and Sally Field. In 2013, Joseph Gordon-Levitt starred in his critically-acclaimed feature film directorial debut, Don Jon, from a script he wrote, opposite Scarlett Johansson and Julianne Moore. He was nominated for an Independent Spirit Award for \"Best First Screenplay\" for the film. Gordon-Levitt provided the voice of Jiro Horikoshi in the 2014 English-language version of Hayao Miyazaki's Academy Award-nominated animated feature The Wind Rises, and appeared in Robert Rodriguez and Frank Miller's Sin City: A Dame to Kill For (2014), in which he played Johnny, a character Miller created for the film. Gordon-Levitt founded and directs hitRECord, an open collaborative production. hitRECord creates and develops art and media collectively using their website where anyone with an internet connection can upload their records, download and remix others' records, and work on projects together. When the results of these RECords are produced and make money, hitRECord splits the profits 50/50 with everybody who contributed to the final production. hitRECord has published books, put out records, gone on tour and has screened their work at major festivals including Sundance and TIFF. \"RegularJOE\" (as he's known on the site) is leading the community of over 300, 000 artists in its biggest collaboration yet, a new take on a variety show called \"HitRecord on TV!\" The half hour series, which Gordon-Levitt hosts, premiered in January on Participant Media's new cable network, Pivot and has been renewed for a second season.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTg0NTkzNF5BMl5BanBnXkFtZTcwNTQ4MTcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0330687","name":"Joseph Gordon-Levitt","nicknames":["Joe","Joey","JGL","Regular Joe"],"idIMDB":"nm0330687"},"actorId":"nm0330687","character":"Flaco","urlCharacter":"http://www.imdb.com/character/ch0411525","main":true},{"actorName":"Elliott Gould","urlProfile":"http://www.imdb.com/name/nm0001285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzU0MTA0OV5BMl5BanBnXkFtZTcwODQ2NDM2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1938","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Elliott Goldstein","height":"6' 3\" (1.91 m)","bio":"Elliott Gould is an American actor known for his roles in MASH (1970), his Oscar-nominated performance in Bob & Carol & Ted & Alice (1969), and more recently, his portrayal of old-time con artist Reuben Tishkoff in Ocean's Eleven (2001), Ocean's Twelve (2004) and Ocean's Thirteen (2007). Gould was born Elliott Goldstein on August 29, 1938 in Brooklyn, NY, to Lucille (Raver), who sold artificial flowers, and Bernard Goldstein, a textiles buyer in the garment industry. His family were Jewish immigrants (from Romania, Belarus, and Russia). Gould's portrayal of Trapper John in Robert Altman's_MASH (1970)_ marked the beginning of perhaps the most prolific period of his career, highlighted by such roles as Philip Marlowe in Altman's The Long Goodbye (1973) and Robert Caulfield in Capricorn One (1977). On television Gould has the distinction of having hosted Saturday Night Live (1975) six times and helmed E/R (1984), a situation comedy set in Chicago about a divorced physician working in an emergency room, which aired for one season. He also co-starred in the series Nothing Is Easy (1986) about a couple raising an adopted Chinese boy. Gould appeared regularly on television and in film throughout the 1980s and the 1990s, including cameos in The Muppet Movie (1979) and The Muppets Take Manhattan (1984). His most prominent recent television role was a recurring part on Friends (1994), on which he played Monica and Ross Geller's father Jack. More recently he voiced the character of Mr. Stoppable on the Disney Channel animated series Kim Possible (2002). In film Gould received critical acclaim for his portrayal of an older mobster in Warren Beatty's Bugsy (1991), and make a noteworthy appearance in American History X (1998). His next major TV role will be in Showtime's drama Ray Donovan (2013) starring Liev Schreiber. Gould has been married three times, twice to Jennifer Bogart, and once to Barbra Streisand. He has three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzU0MTA0OV5BMl5BanBnXkFtZTcwODQ2NDM2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001285","name":"Elliott Gould","idIMDB":"nm0001285"},"actorId":"nm0001285","character":"Father LaCage","urlCharacter":"http://www.imdb.com/character/ch0431429","main":true},{"actorName":"Eddie Griffin","urlProfile":"http://www.imdb.com/name/nm0341176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTQwNjkxNl5BMl5BanBnXkFtZTgwMzAxODkzMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1968","placeOfBirth":" Kansas City, Missouri, USA","height":"5' 7\" (1.7 m)","bio":"Eddie Griffin was born on July 15, 1968 in Kansas City, Missouri, USA. He is known for his work on Malcolm & Eddie (1996), Undercover Brother (2002) and Deuce Bigalow: Male Gigolo (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTQwNjkxNl5BMl5BanBnXkFtZTgwMzAxODkzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341176","name":"Eddie Griffin","idIMDB":"nm0341176"},"actorId":"nm0341176","character":"Sediento","urlCharacter":"http://www.imdb.com/character/ch0431430","main":true},{"actorName":"Mía Maestro","urlProfile":"http://www.imdb.com/name/nm0535502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MDMxNTg1NV5BMl5BanBnXkFtZTgwNTE1NjIxMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1978","placeOfBirth":" Buenos Aires, Federal District, Argentina","height":"5' 4\" (1.63 m)","bio":"Beautiful and talented actress Mia Maestro was born in Buenos Aires, Argentina. She moved to Berlin when she was 18 years old to train as a classical music vocalist. Along the way, she also trained in dance and acting. She returned to her homeland Argentina two years later, made her film debut with the film Tango. This was followed by four other films: The Venice Project (1999), Timecode (2000), Picking Up the Pieces (2000) and El astillero (2000). Maestro made her television debut in 2000, when she starred in the television movie For Love or Country: The Arturo Sandoval Story (2000). She starred in two major films during the time: she played Cristina Kahlo in the film Frida, and the acclaimed film The Motorcycle Diaries (2004), based on the biography of Che Guevara when he was still young. She also appeared in the film Poseidon. In 2004, Maestro was cast in the spy drama Alias. She originally met with the show's producer, J.J. Abrams, intending to get a role on another one of his projects, Lost. Introduced late into the third season, she plays Nadia Santos, the daughter resulting from the affair between Arvin Sloane (Ron Rifkin) and Irina Derevko (Lena Olin); thus, she is the half-sister of Sydney Bristow (Jennifer Garner). She later works as an Argentinean intelligence agent as well as a special agent for the CIA, which marked her character being turned into a regular one starting from the fourth season. She won an Imagen Award-given out to honor Latino members of the entertainment industry-for Best Supporting Actress in 2004. After her stint on Alias, Maestro starred in the films The Box and Visioners. Maestro played \"Nora Martinez\" in the first two seasons of the FX series The Strain (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MDMxNTg1NV5BMl5BanBnXkFtZTgwNTE1NjIxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0535502","name":"Mía Maestro","idIMDB":"nm0535502"},"actorId":"nm0535502","character":"Carla","urlCharacter":"http://www.imdb.com/character/ch0431431","main":true},{"actorName":"Lupe Ontiveros","urlProfile":"http://www.imdb.com/name/nm0648913","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NDcxNzI1MF5BMl5BanBnXkFtZTcwOTgxNzQ2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1942","placeOfBirth":" El Paso, Texas, USA","birthName":"Guadalupe Moreno","height":"4' 11\" (1.5 m)","bio":"Lupe Ontiveros was born on September 17, 1942 in El Paso, Texas, USA as Guadalupe Moreno. She is known for her work on As Good as It Gets (1997), The Goonies (1985) and Real Women Have Curves (2002). She was married to Elias Ontiveros. She died on July 26, 2012 in Whittier, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NDcxNzI1MF5BMl5BanBnXkFtZTcwOTgxNzQ2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0648913","name":"Lupe Ontiveros","idIMDB":"nm0648913"},"actorId":"nm0648913","character":"Constancia","urlCharacter":"http://www.imdb.com/character/ch0431432","main":true}],"seasons":[],"idIMDB":"tt0192455","urlIMDB":"http://www.imdb.com/title/tt0192455","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"€390,043","country":"Spain","day":"10","month":"08","year":"2002","remarks":""},{"money":"ESP 63,517,620","country":"Spain","day":"25","month":"06","year":"2001","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2000/\">2000</a>"},{"money":"96,799","country":"Spain","day":"10","month":"08","year":"2002","remarks":""},{"money":"93,054","country":"Spain","day":"25","month":"06","year":"2001","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1999/\">1999</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.00 : 1 (intended ratio)","2.35 : 1 (theatrical ratio)"],"camera":["Technovision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,686 m (Spain)"],"negativeFormat":["35 mm (Eastman Kodak)"],"cinematographicProcess":["Univisium (3-perf)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"4.7","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"R","awards":[{"award":"ALMA Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Outstanding Made-for-Television Movie or Mini-Series","names":[]},{"category":"Outstanding Latino Cast in a Made-for-Television Movie or Mini-Series","names":[]}]}]}],"votes":"3,132","type":"Movie","companyCreditsSimple":[{"idCompany":"co0031021","name":"Comala Films Productions"},{"idCompany":"co0094849","name":"Kushner-Locke Company, The"},{"idCompany":"co0046617","name":"Ostensible Productions"}],"keywords":{"keywords":["hand","miracle","new mexico","severed hand","police","mayor","police officer","priest","butcher","man with glasses","cnn reporter","marriage","body part","el nino","nudity","blindness","media manipulation","small town","finger","trailer trash","lynch mob","texas","showgirl","murder","black comedy","dog","reporter","adultery","catholic","nun","dismemberment","prostitution","chainsaw","pilgrimage","religion","media","penis","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:42:21"}}