{"data":{"movies":[{"title":"The Siege","originalTitle":"","year":"1998","releaseDate":"19981106","directors":[{"name":"Edward Zwick","id":"nm0001880"}],"writers":[{"name":"Lawrence Wright","id":"nm0942590"},{"name":"Lawrence Wright","id":"nm0942590"}],"runtime":"116 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFiOTFkNTYtMmUyNy00OTVjLTlhMjItN2QyZGMzNzY1NTZiXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English","Arabic","Spanish"],"genres":["Action","Thriller"],"plot":"After the abduction by the US military of an Islamic religious leader, New York City becomes the target of escalating terrorist attacks. Anthony Hubbard, the head of the FBI's Counter-Terrorism Task Force in New York, teams up with CIA operative Elise Kraft to hunt down the terrorist cells responsible for the attacks. As the bombings continue, the US government responds by declaring martial law, sending US troops, led by Gen. Devereaux, into the streets of New York City.","simplePlot":"The secret U.S. abduction of a suspected terrorist, leads to a wave of terrorist attacks in New York City, that lead to the declaration of martial-law.","actors":[{"actorName":"Denzel Washington","urlProfile":"http://www.imdb.com/name/nm0000243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1954","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Denzel Hayes Washington Jr.","height":"6' 1\" (1.85 m)","bio":"Denzel Washington is an American actor and filmmaker. He has received three Golden Globe awards, a Tony Award, and two Academy Awards: Best Supporting Actor for the historical war drama film Glory (1989) and Best Actor for his role as a corrupt cop in the crime thriller Training Day (2001). Denzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University, intent on a career in journalism. However, he caught the acting bug while appearing in student drama productions and, upon graduation, he moved to San Francisco and enrolled at the American Conservatory Theater. He left A.C.T. after only one year to seek work as an actor. His first paid acting role was in a summer stock theater stage production in St. Mary's City, Maryland. The play was \"Wings of the Morning\", which is about the founding of the colony of Maryland (now the state of Maryland) and the early days of the Maryland colonial assembly (a legislative body). He played the part of a real historical character, Mathias Da Sousa, although much of the dialogue was created. Afterwards he began to pursue screen roles in earnest. With his acting versatility and powerful sexual presence, he had no difficulty finding work in numerous television productions. He made his first big screen appearance in Carbon Copy (1981) with George Segal. Through the 1980s, he worked in both movies and television and was chosen for the plum role of Dr. Philip Chandler in NBC's hit medical series St. Elsewhere (1982), a role that he would play for six years. In 1989, his film career began to take precedence when he won the Oscar for Best Supporting Actor for his portrayal of Tripp, the runaway slave in Edward Zwick's powerful historical masterpiece Glory (1989). Washington has received much critical acclaim for his film work since the 1990s, including his portrayals of real-life figures such as South African anti-apartheid activist Steve Biko in Cry Freedom (1987), Muslim minister and human rights activist Malcolm X in Malcolm X (1992), boxer Rubin \"Hurricane\" Carter in The Hurricane (1999), football coach Herman Boone in Remember the Titans (2000), poet and educator Melvin B. Tolson in The Great Debaters (2007), and drug kingpin Frank Lucas in American Gangster (2007). Malcolm X and The Hurricane garnered him Oscar nominations for Best Actor, before he finally won that statuette in 2002 for his lead role in Training Day (2001). Through the 1990s, Denzel also co-starred in such big budget productions as The Pelican Brief (1993), Philadelphia (1993), Crimson Tide (1995), The Preacher's Wife (1996), and Courage Under Fire (1996), a role for which he was paid $10 million. He continued to define his onscreen persona as the tough, no-nonsense hero through the 2000s in films like Out of Time (2003), Man on Fire (2004), Inside Man (2006), and The Taking of Pelham 123 (2009). Cerebral and meticulous in his film work, he made his debut as a director with Antwone Fisher (2002); he also directed The Great Debaters (2007) and Fences (2016). In 2010, Washington headlined The Book of Eli (2010), a post-Apocalyptic drama. Later that year, he starred as a veteran railroad engineer in the action film Unstoppable (2010), about an unmanned, half-mile-long runaway freight train carrying dangerous cargo. The film was his fifth and final collaboration with director Tony Scott, following Crimson Tide (1995), Man on Fire (2004), Déjà Vu (2006) and The Taking of Pelham 1 2 3. He has also been a featured actor in the films produced by Jerry Bruckheimer and has been a frequent collaborator of director Spike Lee. In 2012, Washington starred in Flight (2012), for which he was nominated for an Academy Award for Best Actor. He co-starred with Ryan Reynolds in Sécurité rapprochée (2012), and prepared for his role by subjecting himself to a torture session that included waterboarding. In 2013, Washington starred in 2 Guns (2013), alongside Mark Walberg. In 2014, he starred in The Equalizer (2014), an action thriller film directed by Antoine Fuqua and written by Richard Wenk, based on the television series of same name starring Edward Woodward. During this time period, he also took on the role of producer for some of his films, including The Book of Eli and Safe House. In 2016, he was selected as the recipient for the Cecil B. DeMille Lifetime Achievement Award at the 73rd Golden Globe Awards. He lives in Los Angeles, California with his wife, Pauletta Washington, and their four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000243","name":"Denzel Washington","nicknames":["D"],"idIMDB":"nm0000243"},"actorId":"nm0000243","character":"Anthony Hubbard","urlCharacter":"http://www.imdb.com/character/ch0013168","main":true},{"actorName":"Annette Bening","urlProfile":"http://www.imdb.com/name/nm0000906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODQ1ODM5Ml5BMl5BanBnXkFtZTcwOTU2NDk3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1958","placeOfBirth":" Topeka, Kansas, USA","birthName":"Annette Francine Bening","height":"5' 8\" (1.73 m)","bio":"Annette Carol Bening was born on May 29, 1958 in Topeka, Kansas, the youngest of four children of Shirley (Ashley), a soloist and church singer, and Arnett Grant Bening, an insurance salesman. She is of German and British Isles ancestry. Her family moved to California when she was young, and she grew up there. She graduated from San Francisco State University and began her acting career with the American Conservatory Theatre in San Francisco, eventually moving to New York where she acted on the stage (including a Tony-award nomination in 1987 for her work in the Broadway play \"Coastal Disturbances\") and got her first film roles, in a few TV movies. As is so often the case, her first big-screen role was in a forgettable movie, The Great Outdoors (1988), in which she had little screen time. However, her next work on-screen was in Milos Forman's Valmont (1989), a film adaptation of Choderlos de Laclos' \"Les Liaisons Dangereuses\". Unfortunately, de Laclos' story had also just served as the source of a more Hollywoodized and successful movie version, Dangerous Liaisons (1988), which had been released the previous year, and Foreman's treatment went little noticed. Bening's career turned an important corner the following year when she co-starred with Anjelica Huston and John Cusack in Stephen Frears's powerful, entertaining screen adaptation of Jim Thompson's novel The Grifters (1990), and her artful turn as a con artist gained her the first of several Academy award nominations. On the strength of this performance Warren Beatty cast Bening as Virginia Hill, Bugsy Siegel's fiery actress moll, in his Bugsy (1991), the story of Siegel's founding of Las Vegas. Although the movie itself did not fare well, it resulted in a relationship with Beatty which led to Bening's pregnancy and then her marriage to Beatty in 1992 - it was the second marriage for Bening, who had been separated from her first husband since 1986 but did not finalize her divorce until 1991. The couple then collaborated on the extravagant flop Love Affair (1994), though the next year her career rebounded with her turn as Queen Elizabeth in the highly-regarded 1995 production of Richard III (1995). Notable performances have since included an obsessive, pushy real estate agent in American Beauty (1999), and as the eponymous character in István Szabó's screen adaptation of the W. Somerset Maugham novel Adorable Julia (2004) - both were duly noted by the Academy, with Oscar nominations. Bening has great poise and screen presence and, at her best, can turn in a very strong performance. Although her resume often features long stretches of mediocre productions before the next good part turns up, when it does, it proves worth the wait. Bening has four children with Beatty.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODQ1ODM5Ml5BMl5BanBnXkFtZTcwOTU2NDk3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000906","name":"Annette Bening","idIMDB":"nm0000906"},"actorId":"nm0000906","character":"Elise Kraft / Sharon Bridger","urlCharacter":"http://www.imdb.com/character/ch0013170","main":true},{"actorName":"Bruce Willis","urlProfile":"http://www.imdb.com/name/nm0000246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Idar-Oberstein, West Germany","birthName":"Walter Bruce Willis","height":"6' (1.83 m)","bio":"Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts. Walter Bruce Willis was born on March 19, 1955, in Idar-Oberstein, West Germany, to a German mother, Marlene K. (from Kassel), and an American father, David Andrew Willis (from Carneys Point, New Jersey), who were then living on a United States military base. His family moved to the U.S. shortly after he was born, and he was raised in Penns Grove, New Jersey, where his mother worked at a bank and his father was a welder and factory worker. Willis picked up an interest for the dramatic arts in high school, and was allegedly \"discovered\" whilst working in a café in New York City and then appeared in a couple of off-Broadway productions. While bartending one night, he was seen by a casting director who liked his personality and needed a bartender for a small movie role. After countless auditions, Willis contributed minor film appearances, usually uncredited, before landing the role of private eye \"David Addison\" alongside sultry Cybill Shepherd in the hit romantic comedy television series Moonlighting (1985). The series firmly established Bruce Willis as a hot new talent, and his sarcastic and wisecracking P.I. was in effect a dry run for the role of hard-boiled NYC detective \"John McClane\" in the monster hit Die Hard (1988). This superbly paced action film balanced laconic humor and wholesale destruction as Willis' character single handedly battles a gang of ruthless international thieves in a Los Angeles skyscraper. Willis reprized the role of tough guy cop \"John McClane\" in the eagerly anticipated sequel Die Hard 2 (1990) set at snowbound Washington's Dulles International Airport as a group of renegade Special Forces soldiers seek to repatriate a corrupt South American general. Excellent box office returns demanded a further sequel Die Hard with a Vengeance (1995) this time also starring Samuel L. Jackson as a cynical Harlem shopowner unwittingly thrust into assisting McClane during a terrorist bombing campaign on a sweltering day in NYC. Willis found time out from all the action mayhem to provide the voice of \"Mikey\" the baby in the very popular family comedies Look Who's Talking (1989), and its sequel Look Who's Talking Too (1990) also starring John Travolta and Kirstie Alley. Over the next decade, Willis starred in some very successful films, some very offbeat films and some unfortunate box office flops. The Bonfire of the Vanities (1990) and Hudson Hawk (1991) were both large scale financial disasters that were savaged by the critics, and both are arguably best left off the CVs of all the actors involved, however Willis was still popular with movie audiences and selling plenty of theatre tickets with the hyperviolent The Last Boy Scout (1991), the darkly humored Death Becomes Her (1992) and the mediocre police thriller Striking Distance (1993). During the 1990s, Willis also appeared in several independent and low budget productions that won him new fans and praise from the critics for his intriguing performances working with some very diverse film directors. He appeared in the oddly appealing North (1994), as a cagey prizefighter in the Quentin Tarantino directed mega-hit Pulp Fiction (1994), the Terry Gilliam directed apocalyptic thriller Twelve Monkeys (1995), the Luc Besson directed sci-fi opus The Fifth Element (1997) and the M. Night Shyamalan directed spine-tingling epic The Sixth Sense (1999). Willis next starred in the gangster comedy The Whole Nine Yards (2000), worked again with \"hot\" director M. Night Shyamalan in the less gripping Unbreakable (2000), and in two military dramas, Hart's War (2002) and Tears of the Sun (2003) that both failed to really fire with movie audiences or critics alike. However, Willis bounced back into the spotlight in the critically applauded Frank Miller graphic novel turned movie Sin City (2005), the voice of \"RJ\" the scheming raccoon in the animated hit Over the Hedge (2006) and \"Die Hard\" fans rejoiced to see \"John McClane\" return to the big screen in the high tech Live Free or Die Hard (2007) aka \"Die Hard 4.0\". Willis was married to actress Demi Moore for approximately thirteen years and they share custody to their three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000246","name":"Bruce Willis","nicknames":["Bruno"],"idIMDB":"nm0000246"},"actorId":"nm0000246","character":"General William Devereaux","urlCharacter":"http://www.imdb.com/character/ch0013167","main":true},{"actorName":"Tony Shalhoub","urlProfile":"http://www.imdb.com/name/nm0001724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTg3MjcxNl5BMl5BanBnXkFtZTcwMTU4MzA1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1953","placeOfBirth":" Green Bay, Wisconsin, USA","birthName":"Anthony Marcus Shalhoub","height":"5' 10\" (1.78 m)","bio":"Anthony Marcus Shalhoub was born and raised in Green Bay, Wisconsin. His father, Joe Shalhoub, who owned a grocery chain, emigrated from Lebanon to the United States as an orphan at the age of ten, later marrying Shalhoub's mother, Helen (Seroogy), who herself was born in Wisconsin, to Lebanese parents. When Tony was six, he was introduced to the theater, in a school production of \"The King and I\". He graduated from Green Bay East High, and then graduated with a bachelor's degree in drama from the University of Southern Maine before progressing to the Yale School of Drama, which he left with a Masters in 1980. After a time in the American Repertory Theatre, he moved to Broadway where he met his future wife, Brooke Adams, whom he married in 1992. She had an adopted daughter, Josie, who was three years old at the time that Tony and Brooke married. Tony adopted Brooke's own adopted child, Josie Lynn (b. 1989) when she was eight. In 1994, the couple adopted another daughter, Sophie. Tony's first audition after arriving in Los Angeles was for Italian cabdriver Antonio Scarpacci in the long-running sitcom Wings (1990), which also starred Tim Daly and Steven Weber. Next, Tony had roles in Men in Black (1997), Men in Black II (2002), and Thir13en Ghosts (2001). His biggest break came, however, playing the obsessive-compulsive detective Adrian Monk in Monk (2002). The series made him a star and earned him four straight Emmy Award nominations between 2003 and 2006, for Outstanding Lead Actor in a Comedy Series. Tony won the trophy in 2003, 2005 and 2006, proving how popular he has become after the success of Monk (2002), which continues to be very popular into its fifth year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTg3MjcxNl5BMl5BanBnXkFtZTcwMTU4MzA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001724","name":"Tony Shalhoub","idIMDB":"nm0001724"},"actorId":"nm0001724","character":"Frank Haddad","urlCharacter":"http://www.imdb.com/character/ch0013169","main":true},{"actorName":"Sami Bouajila","urlProfile":"http://www.imdb.com/name/nm0098793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODU5MzA5NV5BMl5BanBnXkFtZTYwNTM0NjEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1966","placeOfBirth":" Échirolles, Isère, France","height":"5' 9¼\" (1.76 m)","bio":"Sami Bouajila was born on May 12, 1966 in Échirolles, Isère, France. He is an actor, known for The Siege (1998), The Adventures of Felix (2000) and Days of Glory (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODU5MzA5NV5BMl5BanBnXkFtZTYwNTM0NjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0098793","name":"Sami Bouajila","idIMDB":"nm0098793"},"actorId":"nm0098793","character":"Samir Nazhde","urlCharacter":"http://www.imdb.com/character/ch0390149","main":true},{"actorName":"Ahmed Ben Larby","urlProfile":"http://www.imdb.com/name/nm0488020","urlPhoto":"","biography":{"bio":"Ahmed Ben Larby is an actor, known for The Siege (1998), Blue in the Face (1995) and Little Senegal (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0488020","name":"Ahmed Ben Larby","idIMDB":"nm0488020"},"actorId":"nm0488020","character":"Sheik Achmed Bin Talal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mosleh Mohamed","urlProfile":"http://www.imdb.com/name/nm0595839","urlPhoto":"","biography":{"bio":"Mosleh Mohamed is an actor, known for The Siege (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0595839","name":"Mosleh Mohamed","idIMDB":"nm0595839"},"actorId":"nm0595839","character":"Muezzin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lianna Pai","urlProfile":"http://www.imdb.com/name/nm0656657","urlPhoto":"","biography":{"dateOfBirth":"26 December 1966","placeOfBirth":" Brooklyn, New York, USA","bio":"Lianna Pai was born on December 26, 1966 in Brooklyn, New York, USA. She is an actress, known for Requiem for a Dream (2000), The Siege (1998) and Grand Theft Auto 3 (2001). She is married to Geoffrey Quelle. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0656657","name":"Lianna Pai","idIMDB":"nm0656657"},"actorId":"nm0656657","character":"Tina Osu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Valley","urlProfile":"http://www.imdb.com/name/nm0885090","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg4OTcxMTQ4OV5BMl5BanBnXkFtZTgwOTUzNzY5NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1964","placeOfBirth":" Ogdensburg, New York, USA","birthName":"Mark Thomas Valley","height":"5' 10\" (1.78 m)","bio":"Mark Valley was born on December 24, 1964 in Ogdensburg, New York, USA as Mark Thomas Valley. He is an actor and director, known for Boston Legal (2004), The Siege (1998) and Batman: The Dark Knight Returns, Part 2 (2013). He was previously married to Anna Torv.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg4OTcxMTQ4OV5BMl5BanBnXkFtZTgwOTUzNzY5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0885090","name":"Mark Valley","idIMDB":"nm0885090"},"actorId":"nm0885090","character":"Mike Johanssen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Gwaltney","urlProfile":"http://www.imdb.com/name/nm0350304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2MDI3ODE3M15BMl5BanBnXkFtZTgwMjA3ODk4MzE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1960","placeOfBirth":" Roanoke, Virginia, USA","birthName":"Jack Merritt Gwaltney III","bio":"Jack Gwaltney was born on September 15, 1960 in Roanoke, Virginia, USA as Jack Merritt Gwaltney III. He is an actor and producer, known for The Siege (1998), Casualties of War (1989) and Safe (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2MDI3ODE3M15BMl5BanBnXkFtZTgwMjA3ODk4MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0350304","name":"Jack Gwaltney","idIMDB":"nm0350304"},"actorId":"nm0350304","character":"Fred Darius","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Proval","urlProfile":"http://www.imdb.com/name/nm0698998","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNjc4NDg2MF5BMl5BanBnXkFtZTcwNTA1NzE3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1942","placeOfBirth":" Brooklyn, New York, USA","birthName":"David Aaron Proval","height":"5' 6½\" (1.69 m)","bio":"David Proval launched his acting career with a starring role in Mean Streets (1973), directed by Martin Scorsese, and has been working nonstop ever since. Notable features in which he has appeared include Le fantôme du Bengale (1996), The Brady Bunch Movie (1995) Four Rooms (1995) and The Shawshank Redemption (1994). He is currently set to appear in the independent film White Boy (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNjc4NDg2MF5BMl5BanBnXkFtZTcwNTA1NzE3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0698998","name":"David Proval","idIMDB":"nm0698998"},"actorId":"nm0698998","character":"Danny Sussman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lance Reddick","urlProfile":"http://www.imdb.com/name/nm0714698","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDkyMjk5OV5BMl5BanBnXkFtZTcwNDUxMzc0Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1962","placeOfBirth":" Baltimore, Maryland, USA","height":"6' 2\" (1.88 m)","bio":"Lance Reddick was born in 1962 in Baltimore, Maryland, USA. He is an actor and producer, known for Fringe (2008), The Wire (2002) and John Wick (2014). He has been married to Stephanie Day since June 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDkyMjk5OV5BMl5BanBnXkFtZTcwNDUxMzc0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714698","name":"Lance Reddick","idIMDB":"nm0714698"},"actorId":"nm0714698","character":"FBI Agent Floyd Rose","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeremy Knaster","urlProfile":"http://www.imdb.com/name/nm0002811","urlPhoto":"","biography":{"bio":"Jeremy Knaster is known for his work on The Shawshank Redemption (1994), The Wolf of Wall Street (2013) and A Beautiful Mind (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0002811","name":"Jeremy Knaster","idIMDB":"nm0002811"},"actorId":"nm0002811","character":"INS Official","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Hill","urlProfile":"http://www.imdb.com/name/nm0384771","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTUxNDk4Nl5BMl5BanBnXkFtZTgwOTgzNzM2MDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1961","placeOfBirth":" Newark, New Jersey, USA","bio":"William Hill was born and raised in the North Ward of Newark, New Jersey. After doing Theatre in the NJ area, he trained as an actor with Sanford Meisner at the Neighborhood Playhouse School Of The Theatre in New York City. In addition to film and television projects he has appeared on Broadway and in Theatre's across the country.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTUxNDk4Nl5BMl5BanBnXkFtZTgwOTgzNzM2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384771","name":"William Hill","idIMDB":"nm0384771"},"actorId":"nm0384771","character":"INS Uniform","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aasif Mandvi","urlProfile":"http://www.imdb.com/name/nm0541902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjI1MDY0OV5BMl5BanBnXkFtZTcwNzg0MjU3Nw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1966","placeOfBirth":" Bombay, India","birthName":"Aasif Mandviwala","height":"5' 8\" (1.73 m)","bio":"Aasif Mandvi was born on March 5, 1966 in Bombay, India as Aasif Mandviwala. He is an actor and producer, known for Spider-Man 2 (2004), The Dictator (2012) and The Internship (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjI1MDY0OV5BMl5BanBnXkFtZTcwNzg0MjU3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0541902","name":"Aasif Mandvi","idIMDB":"nm0541902"},"actorId":"nm0541902","character":"Khalil Saleh","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0133952","urlIMDB":"http://www.imdb.com/title/tt0133952","business":{"budget":{"money":"$70,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,931,285","country":"USA","day":"08","month":"11","year":"1998","remarks":"2,541 Screens"},{"money":"£845,954","country":"UK","day":"10","month":"01","year":"1999","remarks":"326 Screens"}],"gross":[{"money":"$40,932,372","country":"USA","day":"14","month":"02","year":"1999","remarks":""},{"money":"$40,914,967","country":"USA","day":"07","month":"02","year":"1999","remarks":""},{"money":"$40,880,941","country":"USA","day":"31","month":"01","year":"1999","remarks":""},{"money":"$40,819,253","country":"USA","day":"24","month":"01","year":"1999","remarks":""},{"money":"$40,724,804","country":"USA","day":"17","month":"01","year":"1999","remarks":""},{"money":"$40,510,759","country":"USA","day":"10","month":"01","year":"1999","remarks":""},{"money":"$40,163,804","country":"USA","day":"03","month":"01","year":"1999","remarks":""},{"money":"$39,716,979","country":"USA","day":"27","month":"12","year":"1998","remarks":""},{"money":"$39,299,835","country":"USA","day":"20","month":"12","year":"1998","remarks":""},{"money":"$38,749,792","country":"USA","day":"13","month":"12","year":"1998","remarks":""},{"money":"$37,829,456","country":"USA","day":"06","month":"12","year":"1998","remarks":""},{"money":"$36,203,435","country":"USA","day":"29","month":"11","year":"1998","remarks":""},{"money":"$32,059,634","country":"USA","day":"22","month":"11","year":"1998","remarks":""},{"money":"$26,370,984","country":"USA","day":"15","month":"11","year":"1998","remarks":""},{"money":"$13,931,285","country":"USA","day":"08","month":"11","year":"1998","remarks":""},{"money":"£3,143,307","country":"UK","day":"07","month":"02","year":"1999","remarks":""},{"money":"£2,983,156","country":"UK","day":"31","month":"01","year":"1999","remarks":""},{"money":"£2,577,962","country":"UK","day":"24","month":"01","year":"1999","remarks":""},{"money":"£1,861,468","country":"UK","day":"17","month":"01","year":"1999","remarks":""},{"money":"£845,954","country":"UK","day":"10","month":"01","year":"1999","remarks":""},{"money":"SGD 511,909","country":"Singapore","day":"17","month":"02","year":"1999","remarks":""}],"weekendGross":[{"money":"$3,577,517","country":"USA","day":"22","month":"11","year":"1998","remarks":"2,438 Screens"},{"money":"$8,101,705","country":"USA","day":"15","month":"11","year":"1998","remarks":"2,582 Screens"},{"money":"$13,931,285","country":"USA","day":"08","month":"11","year":"1998","remarks":"2,541 Screens"},{"money":"£69,278","country":"UK","day":"07","month":"02","year":"1999","remarks":"108 Screens"},{"money":"£206,272","country":"UK","day":"31","month":"01","year":"1999","remarks":"202 Screens"},{"money":"£426,178","country":"UK","day":"24","month":"01","year":"1999","remarks":"298 Screens"},{"money":"£654,587","country":"UK","day":"17","month":"01","year":"1999","remarks":"328 Screens"},{"money":"£845,954","country":"UK","day":"10","month":"01","year":"1999","remarks":"326 Screens"}],"admissions":[{"money":"1,632,793","country":"Germany","day":"28","month":"02","year":"1999","remarks":""},{"money":"1,237,097","country":"Germany","day":"07","month":"02","year":"1999","remarks":""},{"money":"931,317","country":"Germany","day":"31","month":"01","year":"1999","remarks":""},{"money":"493,015","country":"Germany","day":"24","month":"01","year":"1999","remarks":"opening week"},{"money":"131,531","country":"Netherlands","day":"31","month":"12","year":"1999","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"28","month":"01","year":"1998","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 56 min (116 min)"],"soundMix":["Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 535B"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic) (Kodak)"]},"rating":"6.3","metascore":"53","filmingLocations":[{"location":"6th Street Viaduct, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Blockbuster Entertainment Awards 1999","titlesAwards":[{"titleAwardOutcome":"Won Blockbuster Entertainment Award","categories":[{"category":"Favorite Supporting Actor - Suspense","names":[{"name":"Bruce Willis","id":"nm0000246","role":null}]}]},{"titleAwardOutcome":"Nominated Blockbuster Entertainment Award","categories":[{"category":"Favorite Actor - Suspense","names":[{"name":"Denzel Washington","id":"nm0000243","role":null}]},{"category":"Favorite Actress - Suspense","names":[{"name":"Annette Bening","id":"nm0000906","role":null}]}]}]},{"award":"Political Film Society, USA 1999","titlesAwards":[{"titleAwardOutcome":"Nominated PFS Award","categories":[{"category":"Democracy","names":[]},{"category":"Human Rights","names":[]}]}]},{"award":"Razzie Awards 1999","titlesAwards":[{"titleAwardOutcome":"Won Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Bruce Willis","id":"nm0000246","role":null},{"name":"Armageddon","id":"tt0120591","role":null},{"name":"Mercury Rising","id":"tt0120749","role":null}]}]}]}],"votes":"59,876","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0071668","name":"Lynda Obst Productions"},{"idCompany":"co0014925","name":"Bedford Falls Company, The"}],"keywords":{"keywords":["martial law","terrorist","new york city","abduction","military","fbi","bombing","cia","blood splatter","desert assassination","negotiator","racial prejudice","predjudice","pubic hair","male pubic hair","anti arab","politics","political thriller","male rear nudity","male nudity","laws of war","human rights violation","human rights","geneva convention","rule of law","rights of the accused","fear","due process","dilemma","civil liberties","die hard scenario","mexican standoff","blood","gunfight","shootout","machine gun","suspense","pistol","disaster in new york","world trade center manhattan new york city","manhattan new york city","controversy","chrysler building manhattan new york city","brooklyn new york city","broadway manhattan new york city","extraordinary rendition","violence","van","undercover agent","u.s. president","u.s. army","traffic jam","theatre","terrorist plot","tank","stereotype","sheik","sharpshooter","pursuit","prisoner","president","police","policeman","interrogation","interracial relationship","father son relationship","fanatic","false alarm","drinking","detention center","desert","de briefing","dancing","bus","bomb threat","bill clinton","arrest","arab","arab american","african american","suicide bomber","nosebleed","backfire","muslim american","murder","mosque","explosion","brooklyn bridge","racism","civil rights","army","exploding bus","terrorism","lasersight","siege","general","torture","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:22:28"}}