{"data":{"movies":[{"title":"Serendipity","originalTitle":"","year":"2001","releaseDate":"20011005","directors":[{"name":"Peter Chelsom","id":"nm0155093"}],"writers":[{"name":"Marc Klein","id":"nm0458884"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjEzOTQ3Nl5BMl5BanBnXkFtZTYwMjI1NzU5._V1.jpg","countries":["USA"],"languages":["English","French"],"genres":["Comedy","Romance"],"plot":"Jonathan Trager and Sara Thomas met while shopping for gloves in New York. Though buying for their respective lovers, the magic was right and a night of Christmas shopping turned into romance. Jon wanted to explore things further but Sara wasn't sure their love was meant to be. They decided to test fate by splitting up and seeing if destiny brought them back together... Many years later, having lost each other that night, both are engaged to be married. Still, neither can shake the need to give fate one last chance to reunite them. Jon enlists the help of his best man to track down the girl he can't forget starting at the store where they met. Sara asks her new age musician fiance for a break before the wedding and, with her best friend in tow, flies from California to New York hoping destiny will bring her soulmate back. Near-misses and classic Shakespearean confusion bring the two close to meeting a number of times but fate will have the final word on whether it was meant to be.","simplePlot":"A couple search for each other years after the night they first met, fell in love, and separated, convinced that one day they'd end up together.","actors":[{"actorName":"John Cusack","urlProfile":"http://www.imdb.com/name/nm0000131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTAwMjYzNV5BMl5BanBnXkFtZTcwNjIxNTU1OA@@._V1._CR286,2,351,422_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1966","placeOfBirth":" Evanston, Illinois, USA","birthName":"John Paul Cusack","height":"6' 2½\" (1.89 m)","bio":"John Cusack is, like most of his characters, an unconventional hero. Wary of fame and repelled by formulaic Hollywood fare, he has built a successful career playing underdogs and odd men out--all the while avoiding the media spotlight. John was born in Evanston, Illinois, to an Irish-American family. With the exception of mom Nancy (née Carolan), a former math teacher, the Cusack clan is all show business: father Dick Cusack was an actor and filmmaker, and John's siblings Joan Cusack, Ann Cusack, Bill Cusack and Susie Cusack are all thespians by trade. Like his brother and sisters, John became a member of Chicago's Piven Theatre Workshop while he was still in elementary school. By age 12, he already had several stage productions, commercial voice overs and industrial films under his belt. He made his feature film debut at 17, acting alongside Rob Lowe and Andrew McCarthy in the romantic comedy Class (1983). His next role, as a member of Anthony Michael Hall's geek brigade in Sixteen Candles (1984), put him on track to becoming a teen-flick fixture. Cusack remained on the periphery of the Brat Pack, sidestepping the meteoric rise and fall of most of his contemporaries, but he stayed busy with leads in films like The Sure Thing (1985) and Better Off Dead... (1985). Young Cusack is probably best remembered for what could be considered his last adolescent role: the stereo-blaring romantic Lloyd Dobler in Say Anything... (1989). A year later, he hit theaters as a grown-up, playing a bush-league con man caught between his manipulative mother and headstrong girlfriend in The Grifters (1990). The next few years were relatively quiet for the actor, but he filled in the gaps with off-screen projects. He directed and produced several shows for the Chicago-based theater group The New Criminals, which he founded in 1988 (modeling it after Tim Robbins' Actors' Gang in Los Angeles) to promote political and avant-garde stage work. Four years later, Cusack's high school friends Steve Pink and D.V. DeVincentis joined him in starting a sister company for film, New Crime Productions. New Crime's first feature was the sharply written comedy Grosse Pointe Blank (1997), which touched off a career renaissance for Cusack. In addition to co-scripting, he starred as a world-weary hit man who goes home for his ten-year high school reunion and tries to rekindle a romance with the girl he stood up on prom night (Minnie Driver). In an instance of life imitating art, Cusack actually did go home for his ten-year reunion (to honor a bet about the film's financing) and ended up in a real-life romance with Driver. Cusack's next appearance was as a federal agent (or, as he described it, \"the first post-Heston, non-biblical action star in sandals\") in Con Air (1997), a movie he chose because he felt it was time to make smart business decisions. He followed that with Clint Eastwood's Midnight in the Garden of Good and Evil (1997), in which he played a Yankee reporter entangled in a Savannah murder case. Cusack has always favored offbeat material, so it was no surprise when he turned up in the fiercely original Being John Malkovich (1999). Long-haired, bearded and bespectacled, he was almost unrecognizable in the role of a frustrated puppeteer who stumbles across a portal into the brain of actor John Malkovich. The convincing performance won him a Best Actor nomination at the Independent Spirit Awards. In 2000, Cusack was back to his clean-shaven self in High Fidelity (2000), another New Crime production. He worked with Steve Pink and D.V. DeVincentis to adapt Nick Hornby's popular novel (relocating the story to their native Chicago), then starred as the sarcastic record store owner who revisits his \"Top 5\" breakups to find out why he's so unlucky in love. The real Cusack has been romantically linked with several celebs, including Driver, Alison Eastwood, Claire Forlani and Neve Campbell. He's also something of a family man, acting frequently opposite sister Joan Cusack and pulling other Cusacks into his films on a regular basis. He seems pleased with the spate of projects on his horizon, but admits that he still hasn't reached his ultimate goal: to be involved in a \"great piece of art\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTAwMjYzNV5BMl5BanBnXkFtZTcwNjIxNTU1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000131","name":"John Cusack","nicknames":["Johnny"],"idIMDB":"nm0000131"},"actorId":"nm0000131","character":"Jonathan Trager","urlCharacter":"http://www.imdb.com/character/ch0012168","main":true},{"actorName":"Kate Beckinsale","urlProfile":"http://www.imdb.com/name/nm0000295","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1973","placeOfBirth":" Finsbury Park, London, England, UK","birthName":"Kathrin Romany Beckinsale","height":"5' 7\" (1.7 m)","bio":"Kate Beckinsale was born on 26 July 1973 in England, and has resided in London for most of her life. Her mother is Judy Loe, who has appeared in a number of British dramas and sitcoms and continues to work as an actress, predominantly in British television productions. Her father was Richard Beckinsale, born in Nottingham, England. He starred in a number of popular British television comedies during the 1970s, most notably the series Rising Damp (1974), Porridge (1974) and The Lovers (1970). He passed away tragically early in 1979 at the age of 31. Kate attended the private school Godolphin and Latymer School in London for her grade and primary school education. In her teens she twice won the British bookseller W.H. Smith Young Writers' competition - once for three short stories and once for three poems. After a tumultuous adolescence (a bout of anorexia - cured - and a smoking habit which continues to this day), she gradually took up the profession of acting. Her major acting debut came in a TV film about World War II called One Against the Wind (1991), filmed in Luxembourg during the summer of 1991. It first aired on American television that December. Kate began attending Oxford University's New College in the fall of 1991, majoring in French and Russian literature. She had already decided that she wanted to act, but to broaden her horizons she chose university over drama school. While in her first year at Oxford, Kate received her big break in Kenneth Branagh's film adaptation of William Shakespeare's Much Ado About Nothing (1993). Kate worked in three other films while attending Oxford, beginning with a part in the medieval historical drama Royal Deceit (1994), cast as Ethel. The film was shot during the spring of 1993 on location in Denmark, and she filmed her supporting part during New College's Easter break. Later in the summer of that year she played the lead in the contemporary mystery drama Uncovered (1994). Before she went back to school, her third year at university was spent at Oxford's study-abroad program in Paris, France, immersing herself in the French language, Parisian culture and French cigarettes. A year away from the academic community and living on her own in the French capital caused her to re-evaluate the direction of her life. She faced a choice: continue with school or concentrate on her flourishing acting career. After much thought, she chose the acting career. In the spring of 1994 Kate left Oxford, after finishing three years of study. Kate appeared in the BBC/Thames Television satire Cold Comfort Farm (1995), filmed in London and East Sussex during late summer 1994 and which opened to spectacular reviews in the United States, grossing over $5 million during its American run. It was re-released to U.K. theaters in the spring of 1997. Acting on the stage consumed the first part of 1995; she toured in England with the Thelma Holts Theatre Company production of Anton Chekhov's \"The Seagull\". After turning down several mediocre scripts \"and going nearly berserk with boredom\", she waited seven months before another interesting role was offered to her. Her big movie of 1995 was the romance/horror movie Haunted (1995), starring opposite Aidan Quinn and John Gielgud, and filmed in West Sussex. In this film she wanted to play \"an object of desire\", unlike her past performances where her characters were much less the siren and more the worldly innocent. Kate's first film project of 1996 was the British ITV production of Jane Austen's novel Emma (1996). Her last film of 1996 was the comedy Shooting Fish (1997), filmed at Shepperton Studios in London during early fall. She played the part of Georgie, an altruistic con artist. She had a daughter, Lily, in 1999 with actor Michael Sheen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000295","name":"Kate Beckinsale","idIMDB":"nm0000295"},"actorId":"nm0000295","character":"Sara Thomas","urlCharacter":"http://www.imdb.com/character/ch0012169","main":true},{"actorName":"Jeremy Piven","urlProfile":"http://www.imdb.com/name/nm0005315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMDQ0NjU5N15BMl5BanBnXkFtZTcwNjA1NzMxNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Jeremy Samuel Piven","height":"5' 9\" (1.75 m)","bio":"Born in Manhattan and raised in Evanston, Illinois, he is an alumnus of the Piven Theatre Workshop founded by his parents (Byrne Piven and Joyce Hiller Piven) and a one time Chicago stage actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMDQ0NjU5N15BMl5BanBnXkFtZTcwNjA1NzMxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005315","name":"Jeremy Piven","nicknames":["Jez Piv","The Piv"],"idIMDB":"nm0005315"},"actorId":"nm0005315","character":"Dean Kansky","urlCharacter":"http://www.imdb.com/character/ch0012167","main":true},{"actorName":"Bridget Moynahan","urlProfile":"http://www.imdb.com/name/nm0005256","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Nzc3ODE3OF5BMl5BanBnXkFtZTcwNDQxOTU3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1971","placeOfBirth":" Binghamton, New York, USA","birthName":"Kathryn Bridget Moynahan","height":"5' 9½\" (1.77 m)","bio":"Bridget Moynahan was born on April 28, 1971 in Binghamton, New York, USA as Kathryn Bridget Moynahan. She is an actress, known for Blue Bloods (2010), I, Robot (2004) and Lord of War (2005). She has been married to Andrew Frankel since October 17, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Nzc3ODE3OF5BMl5BanBnXkFtZTcwNDQxOTU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005256","name":"Bridget Moynahan","idIMDB":"nm0005256"},"actorId":"nm0005256","character":"Halley Buchanan","urlCharacter":"http://www.imdb.com/character/ch0012170","main":true},{"actorName":"Eugene Levy","urlProfile":"http://www.imdb.com/name/nm0506405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTQ5NjA3Ml5BMl5BanBnXkFtZTYwMDgwMjQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1946","placeOfBirth":" Hamilton, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Eugene Levy is an award-winning actor, writer, and producer. He has appeared in more than 60 motion pictures to date, eight of which having topped the $100M mark. The box office success of films such as Bringing Down The House, Cheaper By the Dozen 2, and Father Of The Bride Part II have established him as one of Hollywood's most popular comedic actors. But it was the role of Noah Levenstein in the American Pie franchise that cemented his reputation as America's favorite Dad. Levy's most recent big-screen role was that of Dory's Dad in the Disney/Pixar smash Finding Dory, in which he stars alongside Ellen DeGeneres and Diane Keaton. The film has surpassed the $1B mark worldwide, and is on track to become one of the highest-grossing animated films of all time. Partnering with Christopher Guest, Levy earned critical acclaim for co-writing and co-starring in Best In Show, Waiting For Guffman, For Your Consideration, and A Mighty Wind. Levy has been nominated for and won countless awards for his films including a New York Film Critics Circle Award and a Grammy Award® for A Mighty Wind and a Golden Globe® nomination for Best In Show. Other films include Splash, Armed and Dangerous, Multiplicity, Club Paradise, and Serendipity. In 2013, Levy formed Not A Real Company Productions (with his son Daniel Levy and principals Andrew Barnsley and Fred Levy) to produce Schitt's Creek, a television series for CBC/ITV he co-created, co-executive produces, and co-stars in with Daniel Levy. The single-cam, character-driven comedy also stars Catherine O'Hara, Annie Murphy, and Chris Elliott. In 2016, Levy won Lead Actor in a Comedy at the Canadian Screen Awards and, as Executive Producer, the CSA for Best Comedy, an award he shared with Daniel Levy, among others. Schitt's Creek swept the Canadian Screen Awards, winning nine of a possible 10 categories. Levy also received the prestigious Legacy Award (along with co-star and long-time collaborator, Catherine O'Hara) from the Academy of Canadian Cinema & Television. Levy won two Emmys® for his writing on SCTV in addition to many other awards and nominations for his television work. Levy is a Member of the Order of Canada and a recipient of The Governor General's Performing Arts Award - the foremost honour presented for excellence in the performing arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTQ5NjA3Ml5BMl5BanBnXkFtZTYwMDgwMjQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0506405","name":"Eugene Levy","nicknames":["Butch","Gene"],"idIMDB":"nm0506405"},"actorId":"nm0506405","character":"Bloomingdale's Salesman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lilli Lavine","urlProfile":"http://www.imdb.com/name/nm0492107","urlPhoto":"","biography":{"bio":"Lilli Lavine is known for her work on Serendipity (2001), Coffee and Cigarettes (2003) and Dwelling (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0492107","name":"Lilli Lavine","idIMDB":"nm0492107"},"actorId":"nm0492107","character":"Bloomingdale's Stock Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Guarino Jr.","urlProfile":"http://www.imdb.com/name/nm0345380","urlPhoto":"","biography":{"bio":"Michael Guarino Jr. is an actor, known for Serendipity (2001) and Analyze This (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0345380","name":"Michael Guarino Jr.","idIMDB":"nm0345380"},"actorId":"nm0345380","character":"Customer At Bloomingdale's","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abdul Alshawish","urlProfile":"http://www.imdb.com/name/nm1152476","urlPhoto":"","biography":{"bio":"Abdul Alshawish is an actor, known for Serendipity (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1152476","name":"Abdul Alshawish","idIMDB":"nm1152476"},"actorId":"nm1152476","character":"Customer At Bloomingdale's","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Bruce","urlProfile":"http://www.imdb.com/name/nm1056824","urlPhoto":"","biography":{"bio":"Stephen Bruce is an actor, known for Serendipity (2001), The First Stone (1993) and Superstar: The Life and Times of Andy Warhol (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1056824","name":"Stephen Bruce","idIMDB":"nm1056824"},"actorId":"nm1056824","character":"Host At Serendipity","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Sparrow","urlProfile":"http://www.imdb.com/name/nm0817102","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwODM0NTYwNV5BMl5BanBnXkFtZTcwOTk1MTAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1962","placeOfBirth":" Sollihull, England, UK","height":"6' 3\" (1.91 m)","bio":"David Charles Arthur Sparrow was born in Solihull, Warwickshire, UK, on March 4, 1962, but the family moved to Toronto, Canada, just six weeks later. He played football and wrestled in high school and was the President of his student council. He holds a Bachelors degree in English and Writing from Stong College at York University. In 1985, he married the love of his life and now has two grown daughters. In 1989, while teaching at Humber College, David crashed an audition and wound up in the Second City's National Touring Company out of Toronto. He was hooked. Appearing in over eighty film and television roles including Serendipity (2001),Star Trek: Voyager (1995), The Hurricane, Monk (2002), and Shall We Dance (2004) has given David the opportunity to visit places like New York, Chicago, Los Angeles and Vancouver and to work with household names including Julie Andrews, Dick Van Dyke,Richard Gere, John Cusack, and Tony Shalhoub. He has been able to watch closely the directing styles of masters like Peter Chelsom, Norman Jewison, Bruce McDonald, and the late Sidney Lumet and has learned much from the excellent crew professionals that he has had the pleasure to work with. On stage, David has performed in productions from coast to coast with icons of the Canadian theatre including Walter Learning, and Ted Follows. And, in 2001 he wrote, performed in and co-directed the sold-out, comedy hit The Honey Murders at The Sacred Fools Theatre in Los Angeles,California. (LA Weekly said David channeled Ralph Kramden to the stage.) As a writer Sparrow has completed short films, a feature, TV pilots, hours of sketch comedy, a children's book, a play, short stories and dozens of radio and TV ads. In 2007 he and writer Yuval Daniel co-wrote and co-produced at feature film starring Sparrow in the uncharacteristically serious role of a serial killer. The film, Teddy Bear, aired on Super Channel and was received well by festivals. His directing resume includes work for the stage, for corporate/industrial video projects, for voiceovers and for his own short films. He is a member of the Screen Actor's Guild (SAG), the Canadian Actor's Equity Association (CAEA) and the Alliance of Canadian Cinema, Television and Radio Artists (ACTRA) where he serves as the Vice-President of Member Services. The union ACTRA represents the interests of 21,000 film and television performers across Canada. In 2008 Sparrow was the candidate for the New Democratic Party in the September 22, 2008 federal by-election, which was incorporated into the 2008 General Election on October 14 in the riding of Don Valley West.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwODM0NTYwNV5BMl5BanBnXkFtZTcwOTk1MTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0817102","name":"David Sparrow","idIMDB":"nm0817102"},"actorId":"nm0817102","character":"Josh's Dad","urlCharacter":"http://www.imdb.com/character/ch0458608","main":true},{"actorName":"Ann Talman","urlProfile":"http://www.imdb.com/name/nm0848244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzUwNjk3MV5BMl5BanBnXkFtZTgwNjE4OTcyMDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1957","placeOfBirth":" Welch, West Virginia, USA","bio":"Ann Talman was born on September 13, 1957 in Welch, West Virginia, USA. She is an actress and writer, known for Limitless (2011), Serendipity (2001) and Wall Street (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzUwNjk3MV5BMl5BanBnXkFtZTgwNjE4OTcyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848244","name":"Ann Talman","idIMDB":"nm0848244"},"actorId":"nm0848244","character":"Bloomingdale's Saleswoman #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Crystal Bock","urlProfile":"http://www.imdb.com/name/nm0090640","urlPhoto":"","biography":{"bio":"Crystal Bock is an actress, known for All My Children (1970), Serendipity (2001) and Burn After Reading (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0090640","name":"Crystal Bock","idIMDB":"nm0090640"},"actorId":"nm0090640","character":"Bloomingdale's Saleswoman #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Gerbrandt","urlProfile":"http://www.imdb.com/name/nm1055484","urlPhoto":"","biography":{"dateOfBirth":"24 October 1992","placeOfBirth":" Kingston, Ontario, Canada","height":"5' 8\" (1.73 m)","bio":"Gary Gerbrandt was born on October 24, 1992 in Kingston, Ontario, Canada. He is an actor, known for Serendipity (2001), Knights of the South Bronx (2005) and Things to Do (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1055484","name":"Gary Gerbrandt","idIMDB":"nm1055484"},"actorId":"nm1055484","character":"Josh","urlCharacter":"http://www.imdb.com/character/ch0460276","main":true},{"actorName":"Kate Blumberg","urlProfile":"http://www.imdb.com/name/nm1002960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTYxMDc0OV5BMl5BanBnXkFtZTcwOTY5NzQwMg@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Kate Blumberg is an actress, known for Choke (2008), The Big Short (2015) and Serendipity (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTYxMDc0OV5BMl5BanBnXkFtZTcwOTY5NzQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1002960","name":"Kate Blumberg","idIMDB":"nm1002960"},"actorId":"nm1002960","character":"Courtney","urlCharacter":"http://www.imdb.com/character/ch0460277","main":true},{"actorName":"Ron Payne","urlProfile":"http://www.imdb.com/name/nm0668421","urlPhoto":"","biography":{"bio":"Ron Payne was born in Canada. He is known for his work on Serendipity (2001), Uncle Buck (1989) and Land of the Dead - Le territoire des morts (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0668421","name":"Ron Payne","idIMDB":"nm0668421"},"actorId":"nm0668421","character":"Louis Trager","urlCharacter":"http://www.imdb.com/character/ch0460278","main":true}],"seasons":[],"idIMDB":"tt0240890","urlIMDB":"http://www.imdb.com/title/tt0240890","business":{"budget":{"money":"$28,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,309,241","country":"USA","day":"07","month":"10","year":"2001","remarks":"2,601 Screens"},{"money":"£635,042","country":"UK","day":"30","month":"12","year":"2001","remarks":"237 Screens"}],"gross":[{"money":"$50,255,310","country":"USA","day":"30","month":"12","year":"2001","remarks":""},{"money":"$49,968,653","country":"USA","day":"23","month":"12","year":"2001","remarks":""},{"money":"$49,425,960","country":"USA","day":"16","month":"12","year":"2001","remarks":""},{"money":"$49,143,278","country":"USA","day":"09","month":"12","year":"2001","remarks":""},{"money":"$48,730,193","country":"USA","day":"02","month":"12","year":"2001","remarks":""},{"money":"$48,051,398","country":"USA","day":"25","month":"11","year":"2001","remarks":""},{"money":"$47,201,116","country":"USA","day":"18","month":"11","year":"2001","remarks":""},{"money":"$45,823,120","country":"USA","day":"11","month":"11","year":"2001","remarks":""},{"money":"$43,465,749","country":"USA","day":"04","month":"11","year":"2001","remarks":""},{"money":"$40,035,191","country":"USA","day":"28","month":"10","year":"2001","remarks":""},{"money":"$34,426,889","country":"USA","day":"21","month":"10","year":"2001","remarks":""},{"money":"$26,396,130","country":"USA","day":"14","month":"10","year":"2001","remarks":""},{"money":"$13,309,241","country":"USA","day":"07","month":"10","year":"2001","remarks":""},{"money":"£1,986,773","country":"UK","day":"20","month":"01","year":"2002","remarks":""},{"money":"£1,805,094","country":"UK","day":"13","month":"01","year":"2002","remarks":""},{"money":"£1,409,069","country":"UK","day":"06","month":"01","year":"2002","remarks":""},{"money":"£635,042","country":"UK","day":"30","month":"12","year":"2001","remarks":""},{"money":"$352,355","country":"Russia","day":"04","month":"08","year":"2002","remarks":""},{"money":"€1,510,701","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"weekendGross":[{"money":"$199,086","country":"USA","day":"30","month":"12","year":"2001","remarks":"268 Screens"},{"money":"$463,846","country":"USA","day":"23","month":"12","year":"2001","remarks":"331 Screens"},{"money":"$181,429","country":"USA","day":"16","month":"12","year":"2001","remarks":"342 Screens"},{"money":"$236,136","country":"USA","day":"09","month":"12","year":"2001","remarks":"593 Screens"},{"money":"$559,639","country":"USA","day":"02","month":"12","year":"2001","remarks":"1,008 Screens"},{"money":"$479,686","country":"USA","day":"25","month":"11","year":"2001","remarks":"506 Screens"},{"money":"$875,313","country":"USA","day":"18","month":"11","year":"2001","remarks":"964 Screens"},{"money":"$1,616,843","country":"USA","day":"11","month":"11","year":"2001","remarks":"1,342 Screens"},{"money":"$2,393,304","country":"USA","day":"04","month":"11","year":"2001","remarks":"1,640 Screens"},{"money":"$3,811,923","country":"USA","day":"28","month":"10","year":"2001","remarks":"2,203 Screens"},{"money":"$5,446,446","country":"USA","day":"21","month":"10","year":"2001","remarks":"2,610 Screens"},{"money":"$8,766,356","country":"USA","day":"14","month":"10","year":"2001","remarks":"2,603 Screens"},{"money":"$13,309,241","country":"USA","day":"07","month":"10","year":"2001","remarks":"2,601 Screens"},{"money":"£77,084","country":"UK","day":"20","month":"01","year":"2002","remarks":"77 Screens"},{"money":"£189,876","country":"UK","day":"13","month":"01","year":"2002","remarks":"179 Screens"},{"money":"£429,683","country":"UK","day":"06","month":"01","year":"2002","remarks":"264 Screens"},{"money":"£635,042","country":"UK","day":"30","month":"12","year":"2001","remarks":"237 Screens"}],"admissions":[{"money":"387,989","country":"Germany","day":"16","month":"12","year":"2001","remarks":""},{"money":"277,326","country":"Germany","day":"09","month":"12","year":"2001","remarks":""},{"money":"149,479","country":"Germany","day":"02","month":"12","year":"2001","remarks":"opening week"},{"money":"136,615","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""},{"money":"9,982","country":"Netherlands","day":"31","month":"12","year":"2001","remarks":""},{"money":"331,776","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"productionDates":{"money":null,"country":null,"day":"24","month":"07","year":"2000","remarks":null},"filmingDates":[null,null],"copyrightHolder":"Copyright © 2001 Miramax Film Corp. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 30 min (90 min)","1 hr 22 min (82 min) (TV) (Turkey)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.78 : 1 (Blu-ray release)","1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe"],"filmLength":["2,562 m (Spain)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Super 35","Spherical"],"printedFilmFormat":["Blu-ray","35 mm"]},"rating":"6.9","metascore":"52","filmingLocations":[{"location":"Showline Studios, Toronto, Ontario, Canada"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Actress","names":[{"name":"Kate Beckinsale","id":"nm0000295","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Jeremy Piven","id":"nm0005315","role":null}]}]}]},{"award":"Young Artist Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature Film - Comedy","names":[]}]}]}],"votes":"89,469","type":"Movie","companyCreditsSimple":[{"idCompany":"co0022594","name":"Miramax"},{"idCompany":"co0018522","name":"Tapestry Films"},{"idCompany":"co0044742","name":"Simon Fields Productions"}],"keywords":{"keywords":["fate","destiny","serendipity","coincidence","christmas","randomness","missed connection","chick flick","bookstore","gloves","wedding","transamerica pyramid","taxi","snow","ice rink","ice skating","555 phone number","reference to jung","reference to agatha christie","reference to paul newman","paper cup","one word title","san francisco california","train","subway","skating rink","driving range","department store","new york city","first date","canceled wedding","friendship","music video","glove"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:19:44"}}