{"data":{"movies":[{"title":"The Vampire Raiders","originalTitle":"","year":"1988","releaseDate":"198803","directors":[{"name":"Godfrey Ho","id":"nm0387301"}],"writers":[{"name":"Godfrey Ho","id":"nm0387301"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY0MWZhNWQtMGVmZS00Y2M2LTllOGItODZhYjhlZjYzN2ZlXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Action","Horror"],"simplePlot":"","actors":[{"actorName":"Martin Dukes","urlProfile":"http://www.imdb.com/name/nm1331628","urlPhoto":"","biography":{"bio":"Martin Dukes is an actor, known for The Vampire Raiders (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1331628","name":"Martin Dukes","idIMDB":"nm1331628"},"actorId":"nm1331628","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Jackson","urlProfile":"http://www.imdb.com/name/nm0414137","urlPhoto":"","biography":{"bio":"Walter Jackson is an actor, known for Used Cars (1980), The Vampire Raiders (1988) and The Long Chase (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0414137","name":"Walter Jackson","idIMDB":"nm0414137"},"actorId":"nm0414137","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Peterson","urlProfile":"http://www.imdb.com/name/nm0677066","urlPhoto":"","biography":{"bio":"Chris Peterson is an actor, known for Ninja Project Daredevils (1985), The Vampire Raiders (1988) and The Devastator (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0677066","name":"Chris Peterson","idIMDB":"nm0677066"},"actorId":"nm0677066","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Agnes Chan","urlProfile":"http://www.imdb.com/name/nm0150781","urlPhoto":"","biography":{"dateOfBirth":"20 August 1955","placeOfBirth":" Hong Kong","birthName":"Chan Mei Ling","height":"5' 0¼\" (1.53 m)","bio":"Agnes Chan was born on August 20, 1955 in Hong Kong. She was the fifth to be born of seven children in her family. She received her Christian name \"Agnes\" when she was two years old. When she was six years old she enrolled in Maryknoll Sisters School which was a Catholic missionary school in Hong Kong. When she was in eighth grade at Maryknoll, she met sister Rosalie, a nun from United States, and an adviser of her school's folk song club. Agnes was impressed with her singing, and having interest in western pop music herself, asked sister Rosalie if she could join the club. After giving an audition, sister Rosalie accepted Agnes into the club. In 1970, when she was in ninth grade, she sang a song \"A place in the sun\" at the folk song concert and got an ovation from the audience. Word spread around about her singing and she was invited to concerts and parties in other schools in Hong Kong. Her older sister Irene was an actress in Hong Kong's movie scene. A director of TV station spotted Agnes' talent and featured her in his TV program as sister of Irene. She received an explosive reaction from the TV viewing audience, who requested her to appear again. Around the same time, a record company was planning to release a record featuring twelve amateur folk singers. They've booked eleven but was looking for the twelfth singer. The man who played the guitar on this record happened to be teaching guitar at her folk song club and he recommended that she'd be the twelfth singer on this record. Agnes recorded \"Circle Game\" on this record. A year later in 1971, the song was released as a single and became a smash hit. The record became number one song in all four TV and FM station in Hong Honk which has never happened before. She was nick named \"Hong Kong Queen\" and starred in movies, and appeared in her own weekly TV shows. The same year she received an award for the Best Asian Singer Prize as well as chosen to be one of \"Hong Kong's Ten Top Stars.\". Around this time her sister Irene had become a singer and an actor working in Japan. She sent a letter to Agnes asking her to look after Mr. Hirao, her music teacher when he visited Hong Kong. This \"Mr. Hirao\" happened to be Masaaki Hirao who became famous as a singer in the '50s and was an equally famous song writer. Agnes asked Hirao to appear in her show and Hirao accepted. Agnes gave Hirao her debut album \"Will the Circle Game be Unbroken\" as a gift before he left. Hirao was besotted by her charm and talent and mentioned about her to people in the music industry upon returning to Japan. In the early '70s, talents from other countries were making inroads in Japanese pop music scene. Taiwanese singer Fi Fi Ouyang became a singing star and precedence was set that singers from other Asian countries can make it in Japan. In June of 1972, Watanabe Production a talent agency in Japan invited Agnes to come to Japan with her parents, to make a decision about her debut in Japan. Agnes, after consideration accepted Watanabe's offer and decided to make a debut in Japan. Her father wasn't so happy to see his daughter leave Hong Kong and work in Japan. Nor were her fans in Hong Kong, but a decision was made that that she would make a debut on November 25 1972, and visit Japan to record her first album. Her father's condition was that she continue as a student, so she enrolled in Chofu American high school in Japan. Her debut single \"Hinageshi no Hana\" and LP by the same title became a hit in Japan and her career took off. The same year she received the award for the Best Asian Singer Prize and was chosen as \"Hong Kong's Ten Top Stars.\" for the second consecutive year. Agnes released three singles in 1973 and received the prestigious Japan Kayo Taisho new face award that year. Her popularity continued until in 1976, when her father asked her to retire from show business and focus on academics. At the time, degrees from Japanese Universities was not acknowledged in Hong Kong, and the plan was for her to go to Canada to get her Bachelor's degree in psychology. Canada was chosen also because her elder brother was living there. Around that time all her contracts were coming up for renewal. She decided not to renew the contracts and announced that she would be retiring from show business at a press conference in Hong Kong. The news of this press conference reached Japan, and sent shock waves to the people who were working with her. They tried to convince her to change her mind but her mind was set. A compromise agreement was made that she would record two albums a year in Los Angeles while she is in Canada. At University of Toronto she started her work on degree in psychology. The standards were high and she had a hard time at first but she graduated with honors after two years with master degree in psychology. In August of 1978 she returned to Japan to reestablish her career as a singer. She also released a single in 1979 in Hong Kong. Charity has always been at the heart of activities and she donated all the proceeds from her concerts when she was a pop idol in the early '70s. Her career as an adult was also oriented in this direction, and she appeared at numerous charity concerts after reestablishing her career as a singer. In 1981 she also appeared in TV mini series \"Marco Polo\" opposite Leonard Nimoy. In December 1985, she married Mr. Tsutomu Kaneko who had been her manager. She had her reception both in Hong Kong and in Japan. In November of 1986 she had her first son. She named him \"Kazuhei\" which means \"Harmony and Peace\" in both Japanese and Chinese. On March 1987 she became independent from Watanabe Production and started her own company \"Thomas and Agnes\". In 1988 a trouble erupted when she brought her son to work to Japanese TV station where work ethics are stricter than in the west. She was criticized for being self indulgent for bringing her child to work. A string of magazine articles followed regarding the issue where she was ostracized for her behavior. Argument ensued between the media and Agnes in what is now known as \"Agnes ronsou\" or Agnes debate which became the talk of the time. In September of 1989 she enrolled as a Ph D student at Stanford University's psychology department. In December of 1991 she graduated from the same department. During this time, her second son \"Shohei\" was born in 1989. All this time while studying at Stanford, she was writing magazine articles, books, recording CDs, and was hosting TV specials. In 1994 she was awarded her Ph D from Stanford University. In 1998 she became Unicef's Ambassador for Japan. She continues her work as author, singer and TV personality today along with her charity works and her work as Unicef Ambassador.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0150781","name":"Agnes Chan","nicknames":["Mei Mei"],"idIMDB":"nm0150781"},"actorId":"nm0150781","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kam Chiang","urlProfile":"http://www.imdb.com/name/nm0422626","urlPhoto":"","biography":{"bio":"Kam Chiang is known for his work on Histoire de fantômes chinois (1987), Magnificent Butcher (1979) and Snake in the Eagle's Shadow (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0422626","name":"Kam Chiang","idIMDB":"nm0422626"},"actorId":"nm0422626","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deborah Grant","urlProfile":"http://www.imdb.com/name/nm0335350","urlPhoto":"","biography":{"bio":"Deborah Grant is an actress and writer, known for Mad Mission V: The Terracotta Hit (1989), Sheng zhan feng yun (1990) and Curry & Pepper (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335350","name":"Deborah Grant","idIMDB":"nm0335350"},"actorId":"nm0335350","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carmella N. Hall","urlProfile":"http://www.imdb.com/name/nm0355387","urlPhoto":"","biography":{"dateOfBirth":"4 December 1943","placeOfBirth":" Carmel, California, USA","birthName":"Nola Hall","bio":"Carmella N. Hall was born on December 4, 1943 in Carmel, California, USA as Nola Hall. She is an actress, known for The Vampire Raiders (1988) and The Choppers (1961).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0355387","name":"Carmella N. Hall","idIMDB":"nm0355387"},"actorId":"nm0355387","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pak-Kwong Ho","urlProfile":"http://www.imdb.com/name/nm0387360","urlPhoto":"","biography":{"bio":"Pak-Kwong Ho is known for his work on Mimic (1997), Ginger Snaps (2000) and The Corruptor (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0387360","name":"Pak-Kwong Ho","idIMDB":"nm0387360"},"actorId":"nm0387360","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Roth","urlProfile":"http://www.imdb.com/name/nm0744919","urlPhoto":"","biography":{"dateOfBirth":"June1947","placeOfBirth":" New York, USA","bio":"Louis Roth was born in June 1947 in New York, USA. He was an actor and writer, known for Kickboxer (1989), The Legend of Drunken Master (1994) and A Better Tomorrow II (1987). He died in 1994 in Hong Kong.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0744919","name":"Louis Roth","idIMDB":"nm0744919"},"actorId":"nm0744919","character":"Black Ninja Leader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siu-Ming To","urlProfile":"http://www.imdb.com/name/nm0864786","urlPhoto":"","biography":{"bio":"Siu-Ming To is an actor and assistant director, known for Spooky Encounters (1980), Mad Mission (1982) and La fureur du revenant (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0864786","name":"Siu-Ming To","idIMDB":"nm0864786"},"actorId":"nm0864786","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0202052","urlIMDB":"http://www.imdb.com/title/tt0202052","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min) (Spain)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.2","filmingLocations":[],"awards":[],"votes":"49","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["opening action scene","nunchucks","stick fight","bo staff","long blonde hair","blonde","fight on boat","kung fu classic","chop socky","fight on a beach","mask","car crash","car","boat","hand to hand combat","martial arts","sword throwing","coffin","woman in bikini","beach","bikini","ninja magic","ninja master","ninja warrior","ninjitsu","rescue","good versus evil","villain","ambush","two against one","sword duel","female martial artist","female protagonist","zombie","sword","sword fight","katana sword","duel","action heroine","heroine","chinese vampire","pig","keung si","vampire","ninja"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:31:11"}}