{"data":{"movies":[{"title":"D'Artagnan","originalTitle":"The Musketeer","year":"2001","releaseDate":"20010907","directors":[{"name":"Peter Hyams","id":"nm0001382"}],"writers":[{"name":"Alexandre Dumas","id":"nm0241416"},{"name":"Gene Quintano","id":"nm0704164"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxOTUxMDk1MF5BMl5BanBnXkFtZTcwODA2MDQyMQ@@._V1.jpg","countries":["Germany","Luxembourg","UK","USA"],"languages":["English"],"genres":["Action","Adventure","Romance"],"plot":"In 17th century Paris, a dashing swordsman named D'Artagnan finds himself at odds with the powerful forces taking over France. He sets out to avenge the murder of his parents and finds his country cleaved by chaos and civil unrest. His heart softens only for Francesca, a fiery peasant girl who claims D'Artagnan's heart on sight.","simplePlot":"Alexander Dumas' novel is updated with an eastern influence as D'Artagnan attempts to join the king's elite guards, the Royal Musketeers, and find the man who killed his parents.","actors":[{"actorName":"Catherine Deneuve","urlProfile":"http://www.imdb.com/name/nm0000366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQ2MjYwMl5BMl5BanBnXkFtZTcwMjQ0MDM2Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1943","placeOfBirth":" Paris, France","birthName":"Catherine Fabienne Dorléac","height":"5' 6\" (1.68 m)","bio":"Catherine Deneuve was born October 22, 1943 in Paris, France. Her parents were actors. She made her movie debut in 1957, when she was thirteen and continued with small parts in minor films, until Roger Vadim gave her a meatier role in Le vice et la vertu (1963). But her breakthrough came with the excellent musical The Umbrellas of Cherbourg (1964), in which she gave an unforgettable performance as a romantic middle-class girl who falls in love with a young soldier but gets imprisoned in a loveless marriage with another man; the director was the gifted Jacques Demy, who also cast Deneuve in the less successful The Young Girls of Rochefort (1967). She then played a schizophrenic killer in Roman Polanski's Repulsion (1965) and a married woman who works as a part-time prostitute every afternoon in Luis Buñuel's masterpiece Belle de Jour (1967). She also worked with Buñuel in Tristana (1970) and gave a great performance for François Truffaut in Mississippi Mermaid (1969), a kind of apotheosis of her \"frigid femme fatale\" persona. In the seventies she didn't find parts of that caliber, but her magnificent work in Truffaut's Le dernier métro (1980) as a stage actress in Nazi-occupied Paris revived her career. She was also very good in the recent epic drama Indochine (1992), for which she earned her first Academy Award nomination (Best Actress). Although the elegant and always radiant Deneuve has never appeared on stage, she is universally hailed as one of the \"grandes dames\" of French cinema, joining a list that includes such illustrious talents as Simone Signoret, Jeanne Moreau, Isabelle Huppert, Isabelle Adjani and the younger Juliette Binoche.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQ2MjYwMl5BMl5BanBnXkFtZTcwMjQ0MDM2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000366","name":"Catherine Deneuve","idIMDB":"nm0000366"},"actorId":"nm0000366","character":"The Queen","urlCharacter":"http://www.imdb.com/character/ch0006260","main":true},{"actorName":"Mena Suvari","urlProfile":"http://www.imdb.com/name/nm0002546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzEyMDM5MV5BMl5BanBnXkFtZTgwNTY0MjkxMDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1979","placeOfBirth":" Newport, Rhode Island, USA","birthName":"Mena Alexandra Suvari","height":"5' 4\" (1.63 m)","bio":"Mena Alexandra Süvari was born in Newport, Rhode Island to Candice (Thompson), a nurse, and Ando Süvari, a psychiatrist. Her father was Estonian and her mother is of Greek, English, and German descent. Mena was raised in a Rhode Island home that was built in 1870 and had early aspirations of becoming an archaeologist before moving to Charleston, SC where she then attended a nationwide modeling competition that landed her a contract with Wilhelmina Models. She later moved out to Los Angeles under their children's theatrical division WeeWillys, which began her acting career. Her film debut was made working with director Gregg Araki in the cult-classic Nowhere (1997) which was soon followed up by the blockbuster American Pie (1999), for which she did her own singing, and the five-time Oscar-awarded American Beauty (1999) directed by Sam Mendes, in which she was nominated for a BAFTA Award as Best Supporting Actress. People Weekly magazine titled an article about her, \"All-American Girl\" (1999), and she was declared as the most \"patriotic\" artist of 2000 by Entertainment Weekly magazine. In 2001, as part of the blockbuster franchise, she added American Pie 2 (2001) to that list, and then more than a decade later with American Reunion (2012). She reunited with Jason Biggs in Amy Heckerling's romantic comedy Loser (2000) and then continued to showcase her range in ability to costar with John Leguizamo in Jonas Åkerlund's cult-classic Spun (2002) and then alongside Jennifer Aniston in Rob Reiner's Rumor Has It (2005) and Tony Scott's Domino (2005). Mena was named #69 on the Maxim magazine \"Hot 100 of 2005\" list, was ranked #73 on the Maxim magazine \"Hot 100 of 2007\" list, and #52 on the Maxim magazine \"Hot 100 of 2008\" list. Mena rounded out her creative pursuits by playing the iconic Black Dahlia in Ryan Murphy's television series American Horror Story (2011) and continued working in the medium by following up with an arc in the hit series Chicago Fire (2013), as well as leading the Amazon pilot Hysteria (2014) and WeTv's mini-series South of Hell (2015), executive produced by both Eli Roth and Jason Blum for Blumhouse Productions. Mena is set to star opposite Alicia Silverstone for John Wells and TV Land's American Woman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzEyMDM5MV5BMl5BanBnXkFtZTgwNTY0MjkxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002546","name":"Mena Suvari","idIMDB":"nm0002546"},"actorId":"nm0002546","character":"Francesca Bonacieux","urlCharacter":"http://www.imdb.com/character/ch0140392","main":true},{"actorName":"Stephen Rea","urlProfile":"http://www.imdb.com/name/nm0001653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NDU5NDQzMV5BMl5BanBnXkFtZTYwMDE1NDgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1946","placeOfBirth":" Belfast, Northern Ireland, UK","birthName":"Graham Rea","height":"5' 10½\" (1.79 m)","bio":"Stephen Rea was born in Belfast, Northern Ireland. He attended Belfast High School and the Queen's University, where he studied English. He later trained at the Abbey Theatre School in Dublin. In 1970s, he acted in the Focus Company in Dublin with the talented Gabriel Byrne and Colm Meaney. After several stage, television and film appearances, he came to international success with his performance in The Crying Game (1992). He was nominated an Oscar for Best Actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NDU5NDQzMV5BMl5BanBnXkFtZTYwMDE1NDgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001653","name":"Stephen Rea","idIMDB":"nm0001653"},"actorId":"nm0001653","character":"Cardinal Richelieu","urlCharacter":"http://www.imdb.com/character/ch0006264","main":true},{"actorName":"Tim Roth","urlProfile":"http://www.imdb.com/name/nm0000619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTA3MDQyOV5BMl5BanBnXkFtZTcwODM4NDE3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1961","placeOfBirth":" London, England, UK","birthName":"Timothy Simon Smith","height":"5' 7\" (1.7 m)","bio":"Often mistaken for an American because of his skill at imitating accents, actor Tim Roth was born Simon Timothy Roth on May 14, 1961 in Lambeth, London, England. His mother, Ann, was a teacher and landscape painter. His father, Ernie, was a journalist who had changed the family name from \"Smith\" to \"Roth\"; Ernie was born in Brooklyn, New York, to an immigrant family of Irish ancestry. Tim grew up in Dulwich, a middle-class area in the south of London. He demonstrated his talent for picking up accents at an early age when he attended school in Brixton, where he faced persecution from classmates for his comfortable background and quickly perfected a cockney accent to blend in. He attended Camberwell Art College and studied sculpture before he dropped out and pursued acting. The blonde actor's first big break was the British TV movie Made in Britain (1982). Roth made a huge splash in that film as a young skinhead named Trevor. He next worked with director Mike Leigh on Meantime (1984), which he has counted among his favorite projects. He debuted on the big screen when he filled in for Joe Strummer in the Stephen Frears neo-noir The Hit (1984). Roth gained more attention for his turn as Vincent Van Gogh in Vincent et Théo (1990) and his work opposite Gary Oldman in Rosencrantz & Guildenstern Are Dead (1990). He moved to Los Angeles in search of work and caught the eye of young director Quentin Tarantino. Tarantino had envisioned Roth as a possible Mr. Blonde or Mr. Pink in his heist flick Reservoir Dogs (1992), but Roth campaigned for the role of Mr. Orange instead, and ultimately won the part. It proved to be a huge breakthrough for Roth, as audiences found it difficult to forget his performance as a member of a group of jewelry store robbers who is slowly bleeding to death. Tarantino cast Roth again in the landmark film Pulp Fiction (1994). Roth and actress Amanda Plummer played a pair of robbers who hold up a restaurant. 1995 saw the third of Roth's collaborations with Tarantino, a surprisingly slapstick performance in the anthology film Four Rooms (1995). That same year Roth picked up an Academy Award nomination for his campy turn as a villain in the period piece Rob Roy (1995). Continuing to take on disparate roles, Roth did his own singing (with an American accent to boot) in the lightweight Woody Allen musical Everyone Says I Love You (1996). He starred opposite Tupac Shakur in Shakur's last film, the twisted comedy Gridlock'd (1997). The pair received positive critical notices for their comic chemistry. Standing in contrast to the criminals and baddies that crowd his CV, Roth's work as the innocent, seafaring pianist in the Giuseppe Tornatore film La légende du pianiste sur l'océan (1998) became something of a fan favorite. Grittier fare followed when Roth made his directorial debut with The War Zone (1999), a frank, critically acclaimed drama about a family torn apart by incest. He made his next high-profile appearance as an actor as General Thade, an evil simian in the Tim Burton remake of Planet of the Apes (2001). Roth was, of course, all but unrecognizable in his primate make-up. Roth has continued to enjoy a mix of art house and mainstream work, including everything from the lead role in Francis Ford Coppola's esoteric Youth Without Youth (2007) to becoming \"The Abomination\" in the special effects-heavy blockbuster The Incredible Hulk (2008). Roth took his first major American television role when he signed on to the Fox-TV series Lie to Me (2009)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTA3MDQyOV5BMl5BanBnXkFtZTcwODM4NDE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000619","name":"Tim Roth","idIMDB":"nm0000619"},"actorId":"nm0000619","character":"Febre the Man in Black","urlCharacter":"http://www.imdb.com/character/ch0337060","main":true},{"actorName":"Justin Chambers","urlProfile":"http://www.imdb.com/name/nm0150362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODA1MDc1M15BMl5BanBnXkFtZTcwNjk5ODk5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1970","placeOfBirth":" Springfield, Ohio, USA","birthName":"Justin W. Chambers","height":"5' 10¾\" (1.8 m)","bio":"Justin Chambers, a former male fashion model who was discovered by a modeling scout in a Paris Metro station and went on a campaign to represent Calvin Klein's fragrance, is now starring as \"Dr. Alex Karev\" on ABC's Grey's Anatomy (2005). Justin Willman Chambers was born on July 11, 1970 in Springfield, Ohio, USA. His is one of five children of Pamela Sue (Willman) and John William Eugene Chambers II, and has English, Irish, and German ancestry. He has a twin brother named Jason, one older brother and two older sisters. While on vacation in Paris, he was spotted by an agent and soon went on modeling for Calvin Klein, Giorgio Armani, and others throughout Europe, Japan and the United States. In the 1990s, he settled in New York, where he studied at H.B. Studios for 4 years. That schooling yielded him appearances in several off-Broadway stage productions and a few television roles. Chambers' first break came in 1995, a four-month gig on a long-running NBC's daytime soap Another World (1964), then he appeared opposite Lolita Davidovich in Harvest of Fire (1996) and in CBS's Rose Hill (1997) opposite Jennifer Garner. After that, he catapulted to the \"IT\" list of the late 1990s and was described as \"part-James Dean, part-'Marlon Brando'\" by Harper's Bazaar in 1998. He made his big screen debut in the featured role of a rich WASP who befriended a Jewish kid in Liberty Heights (1999), a Barry Levinson drama. He then starred as \"D'Artagnan\" in D'Artagnan (2001) alongside Catherine Deneuve and Mena Suvari, then co-starred with Matthew McConaughey and Jennifer Lopez in Un mariage trop parfait (2001). His career slowed down for a few years, yielding little meaningful exposure in films and on TV, with the exception of a supporting role alongside Uma Thurman and Gena Rowlands in HBO's Hysterical Blindness (2002). In 2005, Chambers made a comeback starring as \"Dr. Alex Karev\" opposite Katherine Heigl on ABC's Grey's Anatomy (2005). He also starred as obsessed police detective, \"Sgt. Matt Parish\", in the thriller The Zodiac (2005). Justin Chambers has been enjoying a happy family life. He is a father of five children with his wife, Keisha Chambers, a model agency booker, whom he met while he was modeling with Calvin Klein. The two have been married since 1993. A longtime New Yorker, he used to travel back and forth from New York to L.A. while his family was still in New York. His wife and children have recently moved to L.A. with Justin from their New York home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODA1MDc1M15BMl5BanBnXkFtZTcwNjk5ODk5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0150362","name":"Justin Chambers","idIMDB":"nm0150362"},"actorId":"nm0150362","character":"D'Artagnan","urlCharacter":"http://www.imdb.com/character/ch0006263","main":true},{"actorName":"Bill Treacher","urlProfile":"http://www.imdb.com/name/nm0871547","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzM1NzgxMV5BMl5BanBnXkFtZTcwMzM1NjUzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1930","placeOfBirth":" London, England, UK","height":"5' 7\" (1.7 m)","bio":"Bill Treacher was born on June 4, 1930 in London, England. He is an actor, known for EastEnders (1985), D'Artagnan (2001) and George and the Dragon (2004). He has been married to Katherine Kessey since December 1, 1971. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzM1NzgxMV5BMl5BanBnXkFtZTcwMzM1NjUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0871547","name":"Bill Treacher","idIMDB":"nm0871547"},"actorId":"nm0871547","character":"Bonacieux","urlCharacter":"http://www.imdb.com/character/ch0118595","main":true},{"actorName":"Daniel Mesguich","urlProfile":"http://www.imdb.com/name/nm0581832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NDExMzk0NV5BMl5BanBnXkFtZTYwOTEyMDU3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1952","placeOfBirth":" Algiers, Alger, France [now Algeria]","bio":"Daniel Mesguich was born on July 15, 1952 in Algiers, Alger, France. He is known for his work on Love on the Run (1979), D'Artagnan (2001) and La belle captive (1983).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NDExMzk0NV5BMl5BanBnXkFtZTYwOTEyMDU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0581832","name":"Daniel Mesguich","idIMDB":"nm0581832"},"actorId":"nm0581832","character":"King Louis XIII","urlCharacter":"http://www.imdb.com/character/ch0267153","main":true},{"actorName":"David Schofield","urlProfile":"http://www.imdb.com/name/nm0774516","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODY2Mjc5NF5BMl5BanBnXkFtZTcwOTE1MTYxNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1951","placeOfBirth":" Manchester, Lancashire, England, UK","height":"5' 10\" (1.78 m)","bio":"David Schofield was born in 1951, in Manchester, England. He was one of ten children in a working-class family. His first acting experience was at Manchester boy's school at the age of 12. In 1967, he was accepted as student assistant stage manager at a local repertory theatre. He started on the lowest step of the ladder and worked in every department as a prop-maker, sound-man, writer, stage sweeper, waiter and tea-maker, putting in 14-hour days, six days a week. After two seasons, at the age of 19, he became a student of the London academy of Music and Dramatic art, which he left early to pursue his path as a working actor. He made a successful career in television, earning numerous credits in popular TV series such as Footballers' Wives (2002) and Holby City (1999), among many other TV productions. On the big screen, David Schofield is best known as \"Falco\" in Gladiator (2000), as \"McQueen\" in From Hell (2001), and as \"Mr. Mercer\" in Pirates of the Caribbean: The Curse of the Black Pearl (2003) and the sequel, Pirates of the Caribbean: Dead Man's Chest (2006). Schofield is also billed as \"Mercer\" in the third installment of the \"Pirates\" franchise, Pirates of the Caribbean: At World's End (2007). Schofield's distinguished stage career has seen the actor performing for the Royal Shakespeare Company and a long association with the Royal National Theatre. He also acted in musicals and straight plays on the West End stage in London. During his 30-year acting career, he maintains the same agent. David Schofield has been enjoying a happy life with his wife, Lally Percy and their children, Fred Schofield and Blanche Schofield. He is currently residing in England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODY2Mjc5NF5BMl5BanBnXkFtZTcwOTE1MTYxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0774516","name":"David Schofield","idIMDB":"nm0774516"},"actorId":"nm0774516","character":"Rochefort, Richelieu Henchman","urlCharacter":"http://www.imdb.com/character/ch0006265","main":true},{"actorName":"Nick Moran","urlProfile":"http://www.imdb.com/name/nm0602941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgyODM2NDM2N15BMl5BanBnXkFtZTcwODExODU4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1969","placeOfBirth":" East End, London, England, UK","birthName":"Nick James Moran","height":"5' 10\" (1.78 m)","bio":"Nick Moran was born on December 23, 1969 in East End, London, England as Nick James Moran. He is an actor and producer, known for Lock, Stock and Two Smoking Barrels (1998), Harry Potter and the Deathly Hallows: Part 2 (2011) and Harry Potter and the Deathly Hallows: Part 1 (2010). He was previously married to Sienna Guillory.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgyODM2NDM2N15BMl5BanBnXkFtZTcwODExODU4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0602941","name":"Nick Moran","idIMDB":"nm0602941"},"actorId":"nm0602941","character":"Aramis","urlCharacter":"http://www.imdb.com/character/ch0006259","main":true},{"actorName":"Steve Speirs","urlProfile":"http://www.imdb.com/name/nm0818648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDc4NjEyMV5BMl5BanBnXkFtZTgwMjU1NjA3MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1965","placeOfBirth":" Troedyrhiw, near Merthyr Tydfil, Wales, UK","birthName":"Steven Roberts","bio":"Steve Speirs was born on February 22, 1965 in Troedyrhiw, near Merthyr Tydfil, Wales as Steven Roberts. He is an actor and writer, known for Star Wars: Episode I - The Phantom Menace (1999), Pirates of the Caribbean: Dead Man's Chest (2006) and Eragon (2006). He has been married to Joanna since 2012. They have two children. He was previously married to Julia, with whom he had two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDc4NjEyMV5BMl5BanBnXkFtZTgwMjU1NjA3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818648","name":"Steve Speirs","idIMDB":"nm0818648"},"actorId":"nm0818648","character":"Porthos","urlCharacter":"http://www.imdb.com/character/ch0006266","main":true},{"actorName":"Jan-Gregor Kremp","urlProfile":"http://www.imdb.com/name/nm0470818","urlPhoto":"","biography":{"dateOfBirth":"30 September 1962","placeOfBirth":" Monheim, Germany","height":"5' 11¼\" (1.81 m)","bio":"Jan-Gregor Kremp was born on September 30, 1962 in Monheim, Germany. He is an actor, known for The Old Fox (1977), 23 (1998) and La ligne de coeur (2004). He is married to Johanna Gastdorf. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0470818","name":"Jan-Gregor Kremp","idIMDB":"nm0470818"},"actorId":"nm0470818","character":"Athos","urlCharacter":"http://www.imdb.com/character/ch0006261","main":true},{"actorName":"Jeremy Clyde","urlProfile":"http://www.imdb.com/name/nm0167403","urlPhoto":"","biography":{"dateOfBirth":"22 March 1941","placeOfBirth":" Dorney, Buckinghamshire, England, UK","birthName":"Michael Thomas Jeremy Clyde","height":"6' (1.83 m)","bio":"Jeremy Clyde was born on March 22, 1941 in Dorney, Buckinghamshire, England as Michael Thomas Jeremy Clyde. He is an actor, known for The Iron Lady (2011), Kaspar Hauser (1993) and William Tell (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0167403","name":"Jeremy Clyde","idIMDB":"nm0167403"},"actorId":"nm0167403","character":"Lord Buckingham","urlCharacter":"http://www.imdb.com/character/ch0006269","main":true},{"actorName":"Michael Byrne","urlProfile":"http://www.imdb.com/name/nm0126250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTQzMTA2MF5BMl5BanBnXkFtZTcwNjQ0NjQwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1943","placeOfBirth":" London, England, UK","height":"5' 9½\" (1.77 m)","bio":"Michael Byrne was born on November 7, 1943 in London, England. He is an actor, known for Indiana Jones and the Last Crusade (1989), Braveheart (1995) and Gangs of New York (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTQzMTA2MF5BMl5BanBnXkFtZTcwNjQ0NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126250","name":"Michael Byrne","idIMDB":"nm0126250"},"actorId":"nm0126250","character":"Treville, Head of the Musketeers","urlCharacter":"http://www.imdb.com/character/ch0006270","main":true},{"actorName":"Jean-Pierre Castaldi","urlProfile":"http://www.imdb.com/name/nm0144413","urlPhoto":"","biography":{"dateOfBirth":"1 October 1944","placeOfBirth":" Grenoble, Isère, France","height":"5' 10¾\" (1.8 m)","bio":"Jean-Pierre Castaldi was born on October 1, 1944 in Grenoble, Isère, France. He is an actor, known for Moonraker (1979), French Connection II (1975) and Asterix and Obelix vs. Caesar (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0144413","name":"Jean-Pierre Castaldi","idIMDB":"nm0144413"},"actorId":"nm0144413","character":"Planchet","urlCharacter":"http://www.imdb.com/character/ch0006268","main":true},{"actorName":"Tsilla Chelton","urlProfile":"http://www.imdb.com/name/nm0155098","urlPhoto":"","biography":{"dateOfBirth":"21 June 1919","placeOfBirth":" Jerusalem, Palestine [now Israel]","birthName":"Tsilla Schilton","bio":"Tsilla Chelton was born on June 21, 1919 in Jerusalem, Palestine as Tsilla Schilton. She was an actress, known for Tatie Danielle (1990), La boîte de Pandore (2008) and Shanks (1974). She was married to Jacques Noël. She died on July 15, 2012 in Brussels, Belgium.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0155098","name":"Tsilla Chelton","idIMDB":"nm0155098"},"actorId":"nm0155098","character":"Madame Lacross","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0246544","urlIMDB":"http://www.imdb.com/title/tt0246544","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,312,740","country":"USA","day":"09","month":"09","year":"2001","remarks":"2,438 Screens"},{"money":"£131,338","country":"UK","day":"23","month":"06","year":"2002","remarks":"310 Screens"}],"gross":[{"money":"$27,053,815","country":"USA","day":"21","month":"10","year":"2001","remarks":""},{"money":"$26,922,775","country":"USA","day":"14","month":"10","year":"2001","remarks":""},{"money":"$26,560,170","country":"USA","day":"07","month":"10","year":"2001","remarks":""},{"money":"$25,534,375","country":"USA","day":"30","month":"09","year":"2001","remarks":""},{"money":"$22,671,145","country":"USA","day":"23","month":"09","year":"2001","remarks":""},{"money":"$17,771,970","country":"USA","day":"16","month":"09","year":"2001","remarks":""},{"money":"$10,312,740","country":"USA","day":"09","month":"09","year":"2001","remarks":""},{"money":"£131,338","country":"UK","day":"23","month":"06","year":"2002","remarks":""},{"money":"$275,834","country":"Russia","day":"04","month":"08","year":"2002","remarks":""},{"money":"€1,923,106","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"weekendGross":[{"money":"$70,955","country":"USA","day":"21","month":"10","year":"2001","remarks":"165 Screens"},{"money":"$183,815","country":"USA","day":"14","month":"10","year":"2001","remarks":"364 Screens"},{"money":"$551,905","country":"USA","day":"07","month":"10","year":"2001","remarks":"1,022 Screens"},{"money":"$1,737,540","country":"USA","day":"30","month":"09","year":"2001","remarks":"2,364 Screens"},{"money":"$3,549,955","country":"USA","day":"23","month":"09","year":"2001","remarks":"2,500 Screens"},{"money":"$5,471,960","country":"USA","day":"16","month":"09","year":"2001","remarks":"2,476 Screens"},{"money":"$10,312,740","country":"USA","day":"09","month":"09","year":"2001","remarks":"2,438 Screens"},{"money":"£131,338","country":"UK","day":"23","month":"06","year":"2002","remarks":"310 Screens"}],"admissions":[{"money":"187,309","country":"Brazil","day":"14","month":"04","year":"2002","remarks":""},{"money":"108,655","country":"Brazil","day":"07","month":"04","year":"2002","remarks":"155 screens"},{"money":"433,563","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 44 min (104 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":["2,964 m (Spain)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"4.7","metascore":"27","filmingLocations":[{"location":"Midi-Pyrénées, France"}],"rated":"PG-13","awards":[{"award":"GoldSpirit Awards 2001","titlesAwards":[{"titleAwardOutcome":"2nd place GoldSpirit Awards","categories":[{"category":"Best Action Soundtrack","names":[{"name":"David Arnold","id":"nm0003417","role":null}]}]}]}],"votes":"13,073","type":"Movie","companyCreditsSimple":[{"idCompany":"co0086487","name":"MDP Worldwide"},{"idCompany":"co0002667","name":"Crystal Sky Worldwide"},{"idCompany":"co0079365","name":"Signature Entertainment"}],"keywords":{"keywords":["murder","guard","swordsman","musketeer","king","17th century","cardinal the priest","sleeve gun","scroll","fighting in the air","medal ceremony","impalement","spiral staircase","beating","climbing through a window","falling down stairs","damsel in distress","tower","grappling hook","climbing up a wall","falling from height","army","assassination attempt","skinny dipping","library","sword","torch","map","bodyguard","soldier","mercenary","attack","bare chested male","woods","forest","face slap","spit in the face","person on fire","child in peril","drunkenness","innuendo","rain","rifle","pistol","film starts with text","conspiracy","letter","improvised weapon","flaming sword","lord","safe house","deception","betrayal","treason","traitor","palace","wisecrack humor","kitchen","looting","disguise","hotel","sewer","rat","falling through roof","banquet","bathtub","female nudity","eavesdropping","father daughter relationship","wire fu","good versus evil","psychopath","sadism","sadist","eye patch","priest","interrogation","torture","fire","church","prisoner","threatened with a knife","escape","held at gunpoint","hostage","kidnapping","prison","prison guard","dungeon","servant","queen","character repeating someone else's dialogue","tavern","death","stabbed in the chest","shot in the chest","horse drawn carriage","horse","mentor","burial","orphan","death of family","gunpowder","fight","showdown","tough guy","remake","ambush","sex","passionate kiss","mixed martial arts","knife throwing","violence","fencing","rapier","revenge plot","gunfight","shootout","mexican standoff","musket","fight to the death","bar brawl","bar fight","fistfight","brawl","horse chase","powder keg","murder of parents","knife","dagger","kingdom","prison escape","spear","disarming someone","kung fu","combat","hand to hand combat","stylized violence","castle","rescue mission","siege","cannon","explosion","battlefield","battle","sword duel","three musketeers","adventure hero","action hero","hero","foreign language adaptation","director also cinematographer","gascony","swashbuckler","revenge","rescue","paris france","mission","henchman","wuxia fiction","warrior","martial arts","honor","throat slitting","sword fight","death of friend","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:18:26"}}