{"data":{"movies":[{"title":"Just One Night","originalTitle":"","year":"2000","releaseDate":"20000926","directors":[{"name":"Alan Jacobs","id":"nm0414312"}],"writers":[{"name":"Alan Jacobs","id":"nm0414312"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzIzNDk3MV5BMl5BanBnXkFtZTcwNzgzMzUxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Professor Isaac Balter, en route to his wedding, stops over in San Francisco for one night and falls in love with another beautiful woman, Aurora. In his twenty-four hour wild ride, he encounters Aurora's snobbish European husband, a student/call girl, and a kind-hearted hustler.","simplePlot":"Professor Isaac Balter, en route to his wedding, stops over in San Francisco for one night and falls in love with another beautiful woman, Aurora. In his twenty-four hour wild ride, he ... ","actors":[{"actorName":"Timothy Hutton","urlProfile":"http://www.imdb.com/name/nm0000459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjYxODUwNV5BMl5BanBnXkFtZTcwNTg5Nzg4Mg@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1960","placeOfBirth":" Malibu, California, USA","birthName":"Timothy Tarquin Hutton","height":"6' (1.83 m)","bio":"Timothy Hutton was born in Malibu, California, to Maryline (Poole), a teacher, and actor Jim Hutton (Dana James Hutton). He set Hollywood ablaze when he burst onto the acting scene in the early 1980s. After only a small number of significant roles in TV movies, he bagged the part of Conrad in the Robert Redford-directed Ordinary People (1980). His convincing - and touching - performance as the troubled and self-accusing teenager trying to deal with the death of his older brother, won him an Academy Award. He is, to date, the youngest actor to receive an Oscar for Best Supporting Actor (1980). With over 70 film, TV, and stage appearances (including an impressive 15 features films between 2006-08), Tim Hutton is (of 2008) headlining the hit TV series Leverage (2008) as insurance investigator Nate Ford. He also starred in the acclaimed Roman Polanski film The Ghost Writer (2010). Tim made his Broadway debut in 1989 in the A.R. Gurney play 'Love Letters'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjYxODUwNV5BMl5BanBnXkFtZTcwNTg5Nzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000459","name":"Timothy Hutton","nicknames":["Tim"],"idIMDB":"nm0000459"},"actorId":"nm0000459","character":"Isaac Alder","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Grazia Cucinotta","urlProfile":"http://www.imdb.com/name/nm0002029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE4NzY1MTIxNl5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1968","placeOfBirth":" Messina, Sicily, Italy","height":"5' 9¾\" (1.77 m)","bio":"Maria Grazia Cucinotta (born 27 July 1968) is an Italian actress who has featured in many films and television series since 1990. She has also worked as a producer, screenwriter and model. Cucinotta was born in Messina, Province of Messina, Sicily, Italy. She is well known in Italy as a movie and television actress, but internationally she is best known for her roles in Il Postino and as the Bond girl, credited as the Cigar Girl, in the James Bond film The World Is Not Enough.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE4NzY1MTIxNl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002029","name":"Maria Grazia Cucinotta","idIMDB":"nm0002029"},"actorId":"nm0002029","character":"Aurora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Udo Kier","urlProfile":"http://www.imdb.com/name/nm0001424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1944","placeOfBirth":" Cologne, North Rhine-Westphalia, Germany","birthName":"Udo Kierspe","height":"5' 11\" (1.8 m)","bio":"Udo Kier was born October 14, 1944 in Cologne, Germany, during World War II. His entrance was just as dramatic as some of his roles. On the evening of his birth Udo's mother requested extra time with her new baby. The nurses had gathered all of the other babies and returned them to the nursery when the hospital was bombed. He and his mother were rescued from underneath the rubble. Udo didn't know much about his father. When Udo was 18 he moved to Britain in order to learn the English language. While there he took a few acting courses. He was eventually offered a role by director Michael Sarne as a gigolo in the film Road to Saint Tropez (1966). While the role was small, it was the beginning of his career in films. His first \"hit\" film was Mark of the Devil (1970) (Mark of the Devil). The film was rated \"V\" for violence and ticket buyers were offered vomit bags before the film started. It was banned in 31 countries but spawned two sequels (both without Kier). The film is notorious for its exploitation of sex and violence (the uncut version was remastered and re-released on video in 1997). Kier met director Paul Morrissey on an airplane trip. Morrissey offered him the lead role in the 3-D Flesh for Frankenstein (1973). It was this film, along with its sister film Blood for Dracula (1974), that made Udo a cult figure. Both Morrissey films are also known as Andy Warhol's Frankenstein and Dracula; however, Andy Warhol was not involved in the production or creation of the films. Both were rated X when released. One of Kier's most vivid memories from \"Flesh for Frankenstein\" was the infamous \"internal organ\" scene. Real animal organs were used that were left unrefrigerated on the set for several hours. Udo had to pull the organs out of a prop dummy with his bare hands and hold them up to his face. He has said he will never forget that smell. When this film was finished the cast and crew began immediately filming \"Blood for Dracula\". Udo remembers both of these films fondly and regards \"Dracula\" over \"Frankenstein\" as his favorite of the two (in 1996 both films were released by Criterion on DVD totally uncut). In the 1970s some of Kier's work included The Salzburg Connection (1972), The Story of O (1975) (The Story of O), Spermula (1976) and Trauma (1976) (House on Straw Hill). Much of his work has been dubbed with someone else's voice. In Suspiria (1977) there were some technical difficulties with the sound while his scene was shot. In the 1980s some of his work included Lulu (1980), The Strange Case of Dr. Jekyll and Miss Osbourne (1981) (The Blood of Dr Jekyll), The Island of the Bloody Plantation (1983) (Escape from Blood Plantation) and Seduction: The Cruel Woman (1985) (Seduction: The Cruel Woman). In the 1980s Kier did very little work outside of Europe. In the 1990s he had a lot more visibility in America and his breakthrough role was as Hans in My Own Private Idaho (1991) (the soundtrack includes the song that Udo performs in the film). Even Cowgirls Get the Blues (1993) reunited Kier with his friend Keanu Reeves yet again. Udo was cast as Pamela Anderson's sidekick in Barb Wire (1996) and played Ron Camp in Ace Ventura: Pet Detective (1994) opposite Jim Carrey. In the 1990s some of the films he was in included L'hôpital et ses fantômes (1994), For Love or Money (1993), Breaking the Waves (1996), The Adventures of Pinocchio (1996), Blade (1998) and Armageddon (1998). Over his 30-year career Udo has worked with several brilliant directors: Paul Morrissey, Charles Matton, Dario Argento, Gus Van Sant and Walerian Borowczyk. he continues to work often with Lars von Trier and is the godfather of Van Trier's child as well as a good friend. Von Trier is currently working on a film entitled Dimension which is a project that spans 30 years. Every year the cast and crew (including Udo) meet to shoot footage. The film will show the actors age 30 years without make-up or special effects. Approximately seen years of footage has already been shot. The premiere will take place in 2024! Kier's acting career ranges from art house films (Europa (1991)) to gore fests (Blackest Heart (1990) (German Chainsaw Massacre)) to television commercials. He says he loves horror films and wants to do more of them. He enjoys playing villains, as he feels it is more interesting because evil has no limits. Currently Udo lives in California and spends much of his time working in Europe, where he receives larger roles and more recognition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001424","name":"Udo Kier","idIMDB":"nm0001424"},"actorId":"nm0001424","character":"Walter Lert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natalie Shaw","urlProfile":"http://www.imdb.com/name/nm0789894","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDczOTI0NV5BMl5BanBnXkFtZTcwMTk2MjIzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Natalie Anderson Shaw","height":"5' 7\" (1.7 m)","bio":"Natalie is an actress from a family of actors. Her mother Susan Damante and her sister Vinessa Shaw are both actresses, with Vinessa Shaw starring in the Showtime series Ray Donovan. Natalie Shaw played the character Tally in Just One Night with Timothy Hutton, Rachel Kaplan on House, in the episode \"Babies and Bathwater,\" and Shane Fusco on the television series Under Suspicion, for which she earned a nomination for Best Performance by a Young Actress in a Drama Series for the Young Artist Awards. She has recently been in award-winning films including From the Woods (2014), directed by Nicholas Wendl, a contestant at the Cannes Film Festival in 2014, Touch (2014), directed by Dawn Fields, and Sex and Violence (2014). She graduated from Sarah Lawrence College and was born and raised in Topanga Cyn, Ca.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDczOTI0NV5BMl5BanBnXkFtZTcwMTk2MjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0789894","name":"Natalie Shaw","idIMDB":"nm0789894"},"actorId":"nm0789894","character":"Tali","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael O'Keefe","urlProfile":"http://www.imdb.com/name/nm0001574","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDczMDc0N15BMl5BanBnXkFtZTYwNTg4Mzc3._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1955","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Raymond Peter O'Keefe Jr.","height":"6' 1\" (1.85 m)","bio":"Michael O'Keefe was born on April 24, 1955 in Mount Vernon, New York, USA as Raymond Peter O'Keefe Jr. He is an actor and director, known for Michael Clayton (2007), Caddyshack (1980) and Frozen River (2008). He has been married to Emily Donahoe since September 18, 2011. They have one child. He was previously married to Bonnie Raitt.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDczMDc0N15BMl5BanBnXkFtZTYwNTg4Mzc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001574","name":"Michael O'Keefe","idIMDB":"nm0001574"},"actorId":"nm0001574","character":"Wayne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Easton","urlProfile":"http://www.imdb.com/name/nm0247691","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTQxMjI3OF5BMl5BanBnXkFtZTcwOTMzMDkxNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1930","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"Robert Easton Burke","height":"6' 4½\" (1.94 m)","bio":"Robert Easton was born on November 23, 1930 in Milwaukee, Wisconsin, USA as Robert Easton Burke. He is known for his work on Working Girl (1988), Stingray (1964) and Star Trek VI: The Undiscovered Country (1991). He was married to June Bettine Grimstead. He died on December 16, 2011 in Toluca Lake, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTQxMjI3OF5BMl5BanBnXkFtZTcwOTMzMDkxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247691","name":"Robert Easton","nicknames":["Bob","The Henry Higgins of Hollywood"],"idIMDB":"nm0247691"},"actorId":"nm0247691","character":"Drunk Cab Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Novello","urlProfile":"http://www.imdb.com/name/nm0637038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzI3NDE4M15BMl5BanBnXkFtZTYwMjA4NTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1943","placeOfBirth":" Lorain, Ohio, USA","bio":"Don Novello was born on January 1, 1943 in Lorain, Ohio, USA. He is an actor and writer, known for Saturday Night Live (1975), The Godfather: Part III (1990) and Casper (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzI3NDE4M15BMl5BanBnXkFtZTYwMjA4NTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0637038","name":"Don Novello","idIMDB":"nm0637038"},"actorId":"nm0637038","character":"Italian Drifter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Seymour Cassel","urlProfile":"http://www.imdb.com/name/nm0001025","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzE3MjMyNl5BMl5BanBnXkFtZTYwMzgyMzkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1935","placeOfBirth":" Detroit, Michigan, USA","birthName":"Seymour Joseph Cassel","height":"5' 7¾\" (1.72 m)","bio":"Seymour Cassel, the veteran character actor who was nominated for a Best Supporting Actor Oscar for his role as the hippie swinger Chet in John Cassavetes' Faces (1968), studied acting at the American Theatre Wing and at the Actors Studio. He made his movie debut in Cassavetes' first film, Shadows (1959), on which he also served as associate producer. Cassel's early career was tied to Cassavetes, who himself had a flourishing career as an actor on television and in major Hollywood productions in addition to becoming, arguably, the first great independent movie director after the collapse of the studio system in the late 1950s/early 1960s. As for Cassel, after his uncredited role in \"Shadows,\" he co-starred with Cassavetes in The Webster Boy (1962) and Too Late Blues (1961) before winding up in support of his friend in Don Siegel's The Killers (1964), a movie shot for TV that had to be released theatrically due to its heightened violence (it was also Ronald Reagan's last movie). Cassel primarily made his living on TV in the 1960s, frequently typecast as beatniks and hippies. He had a supporting role in the Cassavetes-directed episode \"A Pair of Boots\" (1962) for The Lloyd Bridges Show (1962) as well as appearing on such popular programs as 12 O'Clock High (1964), Combat! (1962) and The F.B.I. (1965) before scoring with his aging hippie in \"Faces\" at the end of that tumultuous decade. Along with \"Shadows,\" \"Faces\" remains his favorite Cassavettes film. In addition to acting, Cassel was also a crew member on the film, as the technical staff numbered all of seven. He helped shoot the film as a second cameraman, as well as adjusting the lighting. As the film was financed by Cassavettes himself, there were no union regulations to deal with, nor a studio schedule to keep. Several of Cassavettes' films were shot in continuity, so the actors could develop a character in sequence--similar to stage acting--rather than the traditional method of film making, which is shot out of sequence. Cassel has stated that this technique enhanced the success of his works by eliminating the \"fourth wall\" between the audience and the actors. He believes that acting tells the film's story, not the images and that what is important is how the audience relates to the characters on screen. As their careers matured, Cassel also co-starred with Cassavetes in two TV movies, Nightside (1973) and Nightside (1973) and appeared in supporting roles in three more Cassavetes-directed films: The Killing of a Chinese Bookie (1976), Opening Night (1977) and Love Streams (1984). In addition to appearing in studio films, Cassel has remained prominent in the American independent film community since the death of his friend and collaborator. He contributed a cameo appearance in the directorial debut of Steve Buscemi (with whom he appeared as a co-star in the black comedy In the Soup (1992)), Trees Lounge (1996), and has appeared in three films by Wes Anderson: Rushmore (1998), The Royal Tenenbaums (2001) and The Life Aquatic with Steve Zissou (2004). Cassel is prized by independent directors for two things: his positive nature, and his (perhaps) facetious declaration that he'd be in any independent film for the price of a plane ticket if he liked the script.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzE3MjMyNl5BMl5BanBnXkFtZTYwMzgyMzkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001025","name":"Seymour Cassel","idIMDB":"nm0001025"},"actorId":"nm0001025","character":"Arthur Imperial","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roland T. Abasolo","urlProfile":"http://www.imdb.com/name/nm0007730","urlPhoto":"","biography":{"bio":"Roland T. Abasolo is an actor, known for True Crime (1999), Getting Even with Dad (1994) and Dream with the Fishes (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0007730","name":"Roland T. Abasolo","idIMDB":"nm0007730"},"actorId":"nm0007730","character":"Lederhosen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teal Arnes","urlProfile":"http://www.imdb.com/name/nm1124009","urlPhoto":"","biography":{"bio":"Teal Arnes is an actress, known for Just One Night (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1124009","name":"Teal Arnes","idIMDB":"nm1124009"},"actorId":"nm1124009","character":"Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Bellan","urlProfile":"http://www.imdb.com/name/nm0068725","urlPhoto":"","biography":{"bio":"Joe Bellan is an actor, known for Mrs. Doubtfire (1993), Bicentennial Man (1999) and Blue Jasmine (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0068725","name":"Joe Bellan","idIMDB":"nm0068725"},"actorId":"nm0068725","character":"Harry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Brady","urlProfile":"http://www.imdb.com/name/nm0103638","urlPhoto":"","biography":{"bio":"James Brady is an actor, known for Nine Months (1995), The Right Stuff (1983) and Howard the Duck (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0103638","name":"James Brady","idIMDB":"nm0103638"},"actorId":"nm0103638","character":"Locksmith Cab Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willie Brown","urlProfile":"http://www.imdb.com/name/nm0114922","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MjIwNjY3MF5BMl5BanBnXkFtZTcwMTkxOTUzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1934","placeOfBirth":" Mineola, Texas, USA","birthName":"Willie Lewis Brown Jr.","bio":"Willie Brown was born on March 20, 1934 in Mineola, Texas, USA as Willie Lewis Brown Jr. He is an actor, known for The Princess Diaries (2001), George of the Jungle (1997) and The Godfather: Part III (1990). He has been married to Blanche Vitero since September 1, 1957. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MjIwNjY3MF5BMl5BanBnXkFtZTcwMTkxOTUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114922","name":"Willie Brown","idIMDB":"nm0114922"},"actorId":"nm0114922","character":"Judge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Camp","urlProfile":"http://www.imdb.com/name/nm1352452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MzU2OTMyNl5BMl5BanBnXkFtZTcwOTY3NjUxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1953","placeOfBirth":" Salt Lake City, Utah, USA","birthName":"Richard I. Camp","height":"5' 10½\" (1.79 m)","bio":"Rick has been performing all his life. He acted out a story he was just suppose to read in the third grade. The family moved from Utah to California when Rick was nine years old. He started playing drums at 13 years of age and was in all the bands in school and college. He was playing percussion for the play \"Brigadoon\" and looked on stage and thought I should be up there. His first play was \"Charley's Aunt\"; followed by \"A Man for all Seasons\" as\"Cromwell\"; at Pinole Valley High School which is a Fine Arts High School. He was also a student athlete having school records for the HIgh Hurdles in Track. He has played drums and sang since high school in many different band playing Nightclubs and Concert Venues. In 1985 Rick started acting again with \"Arsenic and Old Lace\", then the lead in \"Picnic\" and the Father \"Cal\" in the stage version of \"Ordinary People\". He studied drama, acting, speech and film making at Solano College. He won many speech awards and talent contests including a Gold Medal for Prose Interpretation for the state of California. He started professional work on the series \"Falcon Crest\" and went to get an Agent and to do Stand Up Comedy: appearing at the Punchline and the Improv. He's appeared in Television, Film, Commercials and Theater with lead and supporting roles and on Radio as a DJ personality. One notable film is, \"Julie and Jack\" which also features Tippi Hedren: Rick has a co-starring role as \"Bob Hammer\" in the film. He has a screenplay that is in development in Los Angeles and has several others that he's working on. Rick is also a poet and is working on an anthology of poems. He appeared in the play, \"Eavesdropper\", playing multiple roles (June to October of 2007) both in San Francisco and Los Angeles on Hollywoods Theater Row: which was developed out of a screenplay workshop. He has a Supporting role in a movie shot in Nov, of 2007 with Actor/Director Louis Mandylor (My Big Fat Greek Wedding) also starring Costas Mandylor and James Mashall as well as Gwendolyn Edwards. The movie is called \"In the Eyes of a Killer\". This has won 7 awards so far: including Two Best Drama Awards, Three Best Actor Awards (Louis Mandylor) and Sound Design at the, Hoboken; Sacramento and Action on Film (Pasadena) International Film Festivals. The Feature Film \"In the Eyes of a Killer\"is set to be released in first part of 2010. He has also been cast in the Movie version of \"Eavesdropper\": set to start filming in the first part of 2010. He is in the Cult Hit Horror Film Birdemic and has just finished reprising his role as Dr Jones in the Sequel Birdemic Resuurection.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MzU2OTMyNl5BMl5BanBnXkFtZTcwOTY3NjUxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1352452","name":"Rick Camp","nicknames":["Ranger Rick"],"idIMDB":"nm1352452"},"actorId":"nm1352452","character":"Lecture Audience Member","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wallace Choy","urlProfile":"http://www.imdb.com/name/nm0159586","urlPhoto":"","biography":{"bio":"Wallace Choy is an actor, known for The Dead Pool (1988), Kung Phooey! (2003) and You Not Chinese (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0159586","name":"Wallace Choy","idIMDB":"nm0159586"},"actorId":"nm0159586","character":"Waiter","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0201901","urlIMDB":"http://www.imdb.com/title/tt0201901","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)","1 hr 42 min (102 min) (Australia)","1 hr 28 min (88 min) (Germany)","1 hr 35 min (95 min) (Argentina)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.8","filmingLocations":[{"location":"California Academy of Sciences, Concourse Drive, Golden Gate Park, San Francisco, California, USA"}],"rated":"PG-13","awards":[{"award":"DVD Exclusive Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Video Premiere Award","categories":[{"category":"Best Actor","names":[{"name":"Timothy Hutton","id":"nm0000459","role":null}]}]}]}],"votes":"250","type":"Movie","companyCreditsSimple":[{"idCompany":"co0047318","name":"Archer Entertainment Group"},{"idCompany":"co0059302","name":"Panoptic Pictures"}],"keywords":{"keywords":["independent film","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:01:53"}}