{"data":{"movies":[{"title":"A Girl Thing","originalTitle":"","year":"2001","releaseDate":"20010120","directors":[{"name":"Lee Rose","id":"nm0003022"}],"writers":[{"name":"Lee Rose","id":"nm0003022"}],"runtime":"237 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDgzOTQwM15BMl5BanBnXkFtZTcwOTE1NTAyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"A Girl Thing is a mini-series that revolves around a New York city street, a coffee house and a shrinks office. Dr. Beth Noonan is the therapist to one star per hour. Hour one deals with a woman not capable of having a relationship. Hour Two is about sisters who hate each other, trying to get along one last time. Hour Three is about adultery.","simplePlot":"A Girl Thing is a mini-series that revolves around a New York city street, a coffee house and a shrinks office. Dr. Beth Noonan is the therapist to one star per hour. Hour one deals with a ... ","actors":[{"actorName":"Kate Capshaw","urlProfile":"http://www.imdb.com/name/nm0001009","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk2NTc5OTk5MV5BMl5BanBnXkFtZTcwMjc1NjgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1953","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Kathleen Sue Nail","height":"5' 7\" (1.7 m)","bio":"Kate Capshaw was born Kathleen Sue Nail in Fort Worth, Texas, to Beverley Sue (Simon), a beautician and travel agent, and Edwin Leon Nail, an airline employee. Capshaw worked as a teacher with an MA in Learning Disabilities. Her desire to be an actress led her to New York where she landed a role on the soap The Edge of Night (1956). She met her future husband, Steven Spielberg while beating out 120 actresses for the female lead in Indiana Jones and the Temple of Doom (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk2NTc5OTk5MV5BMl5BanBnXkFtZTcwMjc1NjgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001009","name":"Kate Capshaw","idIMDB":"nm0001009"},"actorId":"nm0001009","character":"Casey Montgomery","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stockard Channing","urlProfile":"http://www.imdb.com/name/nm0000330","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTc0NDQ4NV5BMl5BanBnXkFtZTYwODYyMjA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1944","placeOfBirth":" New York City, New York, USA","birthName":"Susan Williams Antonia Stockard","height":"5' 3\" (1.6 m)","bio":"One of Broadway and Hollywood's cleverer talents who tends to shine a smart, cynical light on her surroundings, Stockard Channing was born Susan Williams Antonia Stockard on February 13, 1944, in New York City, to a Catholic family, with English and Irish ancestry. The daughter of Lester Napier Stockard, a well-to-do shipping executive, and Mary Alice (née English) Stockard, her father died when she was 16 and left her a sizable estate. She grew up in Brooklyn and attended the prolific Chapin School in NYC, then later attended the Madeira School, a Virginia boarding school for girls. She studied at Radcliffe College where she majored in both literature and history before graduating summa cum laude in 1965. In 1964, at the age of 20, she married the first of four husbands, Walter Channing Jr., a businessman whose last name she kept as part of her own stage moniker after their divorce four years later. Stockard made her stage debut in a production of \"The Investigation\" at the experimental Theatre Company of Boston in 1966. She went on to play a number of offbeat roles with the company. She eventually migrated to New York where she took her first Broadway bow as a chorus member and understudy in the musical version of \"Two Gentlemen of Verona\" in 1971. Two years later she would take over the prime role of Julia in the L.A. national company. Other theater roles during this time included \"Adaptation/Next\" (1970) \"Arsenic and Old Lace\" (1970), \"Play Strindberg\" (1971) and \"No Hard Feelings\" (1973). Somewhat plaintive yet unique-looking, the dark-haired actress began first appearing in pictures with small parts in the dark comedy The Hospital (1971) and the edgy Barbra Streisand fantasy-drama Up the Sandbox (1972). Taking on the top female lead as an heiress and potential victim of shysters Jack Nicholson and Warren Beatty in Mike Nichols' comedy The Fortune (1975), the film, despite its male star power, would not become the star-making hit for Channing as initially hoped and Channing. Her next two films (The Big Bus (1976) and Sweet Revenge (1976)) faded away even quicker. Earlier, however, she hit a home with the TV-movie The Girl Most Likely to... (1973), a clever black comedy written by Joan Rivers wherein Stockard played a former ugly duckling-turned-beauty (à la plastic surgery) who knocks off the men who formerly mistreated her. This was Channing at her smart and cynical best, traits that would carry her far in Hollywood. At the age of 33(!), she was handed the feisty role of high school teen Betty Rizzo in the box-office film version of the hit musical Grease (1978) starring Olivia Newton-John and John Travolta. While long in the tooth for such a role (as were others), Stockard's sly performance earned her the People's Choice Awards for Favorite Motion Picture Supporting Actress. This popular film clinched her place as a top-ranking contender. As a result, she was handed two sitcom vehicles within a year on CBS: Stockard Channing in Just Friends (1979), as a newly-separated wife starting life anew in another city (L.A.), and The Stockard Channing Show (1980), which again cast her as a divorced lady trying to find herself again in L.A. Neither made her a TV star. Both failed to catch on and lasted but a few months. Stalled at a critical juncture in her career, Stockard decided to return to her first love -- the theater. With \"Vanities\", \"Absurd Person Singular\" and \"As You Like It\" (as Rosalind) already on her resume, she earned fine notices on Broadway with the musical \"They're Playing Our Song\" replacing Lucie Arnaz in 1980, then garnered rave reviews in the part of the mother of a developmentally disabled child in the New Haven production of Peter Nichols' \"A Day in the Death of Joe Egg\" in 1982. She repeated her role on Broadway a few years later (the title now shortened to \"Joe Egg\") and copped the 1985 Tony Award for Best Actress in a Play. Subsequent Tony nominations came her way for her offbeat work in \"The House of Blue Leaves\" (1986); \"Six Degrees of Separation\" (1991) (for which she also won an Off-Broadway Obie), \"Four Baboons Adoring the Sun\" (1992); and for her Eleanor of Aquitaine in \"The Lion in Winter\" in 1999. Award-worthy projects came her way on TV as well. Nominated for an Emmy for the CBS miniseries Echoes in the Darkness (1987), she also won a CableACE Award for her work in Tidy Endings (1988). In film, she received Oscar and Golden Globe nominations when her stage triumph, Six Degrees of Separation (1993), was turned into a film and also received the London Film Critics Circle Award for Best Actress in the film _Business of Strangers, The (2001). In 1999, Stockard became a recurring member of the cast of The West Wing (1999) as First Lady Abigail Bartlet. Audiences were so drawn to her shrewd, classy character that producers wisely started featuring her regularly into the third season. In 2002 she won both Emmy and SAG awards for this role, as well as a second Emmy that same year for her supporting turn as Judy Sheppard in The Matthew Shepard Story (2002), a docudrama about the gay-bashing murder of young Matthew Shepard. Stockard thought she finally found sitcom success with the series Out of Practice (2005) and was even Emmy-nominated for her role as a sharp-tongued but caring doctor. As luck would have it, she again couldn't find a core audience and the show lasted but a mere season. Stockard continues to excel in sly, worldly roles that combine a dark wit with an even darker cynical edge. True to form, she recently completed a picture aptly titled Multiple Sarcasms (2010). Divorced four times, including one to writer/producer David Debin, she has no children. She has been in a long-term relationship with cinematographer Daniel Gillham since 1988. A sister, Lesly Stockard Smith, became mayor of Palm Beach in 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTc0NDQ4NV5BMl5BanBnXkFtZTYwODYyMjA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000330","name":"Stockard Channing","idIMDB":"nm0000330"},"actorId":"nm0000330","character":"Dr. Beth Noonan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rebecca De Mornay","urlProfile":"http://www.imdb.com/name/nm0000360","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjk0MzE1OV5BMl5BanBnXkFtZTYwODU3ODgz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1959","placeOfBirth":" Santa Rosa, California, USA","birthName":"Rebecca Jane Pearch","height":"5' 5½\" (1.66 m)","bio":"Rebecca De Mornay was born 1959 as Rebecca Jane Pearch in Santa Rosa, California. She is the daughter of Julie (Eagar) and Wally George (born George Walter Pearch), a television and radio commentator. Her paternal grandmother was child actress Eugenia Clinchard. Her parents divorced when she was young, and her mother married Richard De Mornay, who adopted her (Rebecca subsequently took his surname). Rebecca's paternal grandfather was English, and she also has German, French, and other English, ancestry. After Richard De Mornay's untimely death, Rebecca's mother moved her and her half-brother Peter from northern California to Europe, where she was raised primarily in England and Austria. Rebecca graduated \"summa cum laude\" from a German-speaking high school in the Austrian alps, and still speaks fluent German and French. She began her acting training in Los Angeles at Lee Strasberg's Institute, became an apprentice at Francis Ford Coppola's Zoetrope Film Studio, and soon thereafter made her film debut in One from the Heart (1981). Her breakthrough came in the box office hit Risky Business (1983), in which she gave a seductive and critically acclaimed performance as a streetwise prostitute opposite a young Tom Cruise. She went on to international stardom with her portrayal of a chillingly twisted nanny in the hugely popular The Hand That Rocks the Cradle (1992). Other acclaimed film work includes Runaway Train (1985) (with Jon Voight), The Trip to Bountiful (1985) (with Geraldine Page), Backdraft (1991) (with Kurt Russell). Network television work includes the tour-de-force role of Arlie in the stellar Getting Out (1994) (based on Marsha Norman's play), the tragic title character in Dominick Dunne's An Inconvenient Woman (1991) (with Jason Robards), the remake of The Shining (1997) (produced by Stephen King), a multi-episode story arc about a cancer survivor on ER (1994) and Hallmark Hall of Fame's Night Ride Home (1999) (with Ellen Burstyn). On stage, she starred as Billie Dawn in \"Born Yesterday\" (1988) at the Pasadena Playhouse, as Charlotte Corday in \"Marat/Sade\" (1990) at the Williamstown Festival, and as Anna in \"Closer\" (2000) at the Mark Taper Forum. Rebecca's directing debut was with a segment of Showtime's Au-delà du réel - l'aventure continue (1995) starring John Savage and Frank Whaley. Rebecca currently resides in Los Angeles with sportscaster Patrick O'Neal, and their daughters, Sophia De Mornay-O'Neal and Veronica De Mornay-O'Neal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjk0MzE1OV5BMl5BanBnXkFtZTYwODU3ODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000360","name":"Rebecca De Mornay","idIMDB":"nm0000360"},"actorId":"nm0000360","character":"Kim McCormack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mia Farrow","urlProfile":"http://www.imdb.com/name/nm0001201","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ3NjgxMzQ5M15BMl5BanBnXkFtZTcwMDEzNTkzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1945","placeOfBirth":" Los Angeles, California, USA","birthName":"Maria de Lourdes Villiers-Farrow","height":"5' 4¼\" (1.63 m)","bio":"Mia Farrow was born in Los Angeles, California, to director John Farrow and actress and Tarzan-girl Maureen O'Sullivan. Her father was Australian-born (of English descent) and her mother was Irish-born (of Irish, Scottish, and English ancestry). Farrow debuted at the movies in 1959 in very small roles. She was noticed for the first time in the film Rosemary's Baby (1968) by Roman Polanski. She showed her talent also on TV and at the theatre, but her final breakthrough was when she met Woody Allen and became his Muse after the film A Midsummer Night's Sex Comedy (1982). After that, Woody Allen wrote many other roles for her.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ3NjgxMzQ5M15BMl5BanBnXkFtZTcwMDEzNTkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001201","name":"Mia Farrow","idIMDB":"nm0001201"},"actorId":"nm0001201","character":"Betty McCarthy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Franz","urlProfile":"http://www.imdb.com/name/nm0291830","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTI3Nzg2Ml5BMl5BanBnXkFtZTYwMDI5Mjgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1941","placeOfBirth":" Akron, Ohio, USA","birthName":"Elizabeth Frankovich","bio":"Elizabeth Franz was born on June 18, 1941 in Akron, Ohio, USA as Elizabeth Frankovich. She is an actress, known for Another World (1964), Christmas with the Kranks (2004) and Sabrina (1995). She was previously married to Edward Binns.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTI3Nzg2Ml5BMl5BanBnXkFtZTYwMDI5Mjgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291830","name":"Elizabeth Franz","idIMDB":"nm0291830"},"actorId":"nm0291830","character":"Josephine McCormack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Irma P. Hall","urlProfile":"http://www.imdb.com/name/nm0355659","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjExMjcwMF5BMl5BanBnXkFtZTgwMjA5MzQzMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1935","placeOfBirth":" Beaumont, Texas, USA","birthName":"Irma Dolores Player Hall","height":"5' 0½\" (1.54 m)","bio":"Irma P. Hall was born on June 3, 1935 in Beaumont, Texas, USA as Irma Dolores Player Hall. She is an actress, known for Collateral (2004), The Ladykillers (2004) and Patch Adams (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjExMjcwMF5BMl5BanBnXkFtZTgwMjA5MzQzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0355659","name":"Irma P. Hall","idIMDB":"nm0355659"},"actorId":"nm0355659","character":"Alice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Linda Hamilton","urlProfile":"http://www.imdb.com/name/nm0000157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NTk0Mzg0MF5BMl5BanBnXkFtZTYwMzU5NjM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1956","placeOfBirth":" Salisbury, Maryland, USA","birthName":"Linda Carroll Hamilton","height":"5' 6\" (1.68 m)","bio":"Born in Salisbury, Maryland, USA, following high school Linda studied for two years at Washington College in Chestertown, Maryland, before moving on to acting studies in New York. In New York she attended acting workshops given by Lee Strasberg. Her first parts were small parts in TV series, with her biggest break coming with her role in The Terminator (1984). Most known to public at large from her part in the TV series Beauty and the Beast (1987) (before Terminator 2: Judgment Day (1991), at least).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NTk0Mzg0MF5BMl5BanBnXkFtZTYwMzU5NjM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000157","name":"Linda Hamilton","idIMDB":"nm0000157"},"actorId":"nm0000157","character":"Rachel Logan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glenne Headly","urlProfile":"http://www.imdb.com/name/nm0000444","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjc2NzIwMl5BMl5BanBnXkFtZTcwMDM4MjAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1955","placeOfBirth":" New London, Connecticut, USA","height":"5' 8\" (1.73 m)","bio":"For the past fourteen years, she has said that family has been the most important thing to her and she has set most of her time aside to be a \"present\" mother to her son. Movies, plays and television are chosen, for the most part, when they occur in town or on a school break. She has taken the current year to homeschool her son for his seventh grade. But it wasn't always this way. She was raised in New York City and wanted to be an actress from the time she was a child, graduating with acting honors from the High School of Performing Arts. She chose to opt out of studying acting in college and attended a small college in Europe, majoring in art history and literature, knowing that acting would take up a great deal of her life and that her college years would be her only real time to learn about something else. Upon graduation, she returned to New York City but a chance trip to Chicago inspired her to move there and become a part of its budding theatre community. It was in a production of \"Curse of The Starving Class\", directed by Robert Falls and co-starring John Malkovich, that she was first seen by the Steppenwolf Theatre Company and, subsequently, asked to join their troupe. She did and learned what it really was to be an actress on her feet, performing in all kinds of roles in both comedy and drama. During this time, she won four Joseph Jefferson awards for best supporting actress. With a return move to New York, she received a Theatre World Award for \"best newcomer\" for her role in \"the Philanthropist\" at the Manhattan Theatre Club and appeared in \"Extremities\" with Susan Sarandon. This was followed by her appearance in the very successful Steppenwolf production in New York of \"Balm in Gilead\". She then starred on Broadway opposite Kevin Kline and Raul Julia in \"Arms & the Man\", directed by John Malkovich, her husband at the time. She was cast in several smaller films including Nadine (1987), Making Mr. Right (1987) and Paperhouse (1988) as well as Lonesome Dove (1989) for television for which she received her first of two Emmy nominations for best supporting actress. But her breakout film performance was in Dirty Rotten Scoundrels (1988), in which she played the cunning \"victim\", who gets the best of con artists Michael Caine and Steve Martin. This led to her being cast in the blockbuster comic strip parody, Dick Tracy (1990), in which she portrayed the girlfriend, \"Tess Trueheart\", to Warren Beatty's lead. She went on to appear in the films Mr. Holland's Opus (1995) opposite Richard Dreyfuss, Mortal Thoughts (1991) opposite Demi Moore, 2 Days in the Valley (1996), What's the Worst That Could Happen? (2001), Breakfast of Champions (1999), Around the Bend (2004) and Journal intime d'une future star (2004). On television, she had a recurring part on ER (1994) and Monk (2002) and was in the short-lived sit-com Encore! Encore! (1998) with Nathan Lane and Joan Plowright. She was in the live theatrical presentation of \"On Golden Pond\" as the troubled daughter of Christopher Plummer and Julie Andrews and also appeared in the telefilms Women vs. Men (2002), My Own Country (1998) and Pronto (1997), among others. She received her second Emmy nomination for best supporting actress for Bastard Out of Carolina (1996), directed by Anjelica Huston. Her most recent appearances were in the films The Amateurs (2005) (aka \"The Amateurs\"), The Namesake (2006), Comeback Season (2006), Kit Kittredge: An American Girl (2008) and The Joneses (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjc2NzIwMl5BMl5BanBnXkFtZTcwMDM4MjAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000444","name":"Glenne Headly","idIMDB":"nm0000444"},"actorId":"nm0000444","character":"Helen McCormack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allison Janney","urlProfile":"http://www.imdb.com/name/nm0005049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjc2NzgxM15BMl5BanBnXkFtZTgwODQyMjM1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1959","placeOfBirth":" Dayton, Ohio, USA","birthName":"Allison Brooks Janney","height":"6' (1.83 m)","bio":"Allison Janney is an award-winning actress who has earned a solid reputation in stage productions and in many supporting roles on screen, and who more recently has become prominent by portraying one of the major characters in the popular TV series The West Wing (1999). Entertainment Weekly magazine describes Janney's screen presence as \"uncommonly beautiful and infinitely expressive\". As an actor, the magazine deems her to be \"one to watch\". Janney was born in Boston, Massachusetts, to Macy Brooks (Putnam), a former actress, and Jervis Spencer Janney, Jr., a real estate developer and jazz musician. While studying at Kenyon College, Janney answered a casting call for an on-campus play that was to be directed by Kenyon's most famous alumnus, the legendary actor Paul Newman. During her audition/interview, Janney played upon Newman's known passion for race car driving - she explained how she cut thirty minutes off of the 130 mile journey from her home town to the college. She got chosen for the play's cast. After earning her degree in drama, Janney took Joanne Woodward's suggestion to do further study at New York's Neighborhood Playhouse. She also studied at the Royal Academy of Dramatic Arts in London. Early in her career Janney got comedic roles in the soap operas As the World Turns (1956) and Guiding Light (1952). Later, she gave memorable movie performances in supporting roles in Belles à mourir (1999), 10 Things I Hate About You (1999), American Beauty (1999) and Nurse Betty (2000), and in the made-for-TV movie ...First Do No Harm (1997), among others. Among her stage work, Janney has played in a revival of Arthur Miller's \"A View From the Bridge\" on Broadway opposite Anthony LaPaglia, which earned her a Tony Award nomination, and a Drama League Award for outstanding artist for the 1997-98 season. She played in Noel Coward's \"Present Laughter\" opposite Frank Langella, which earned her the Outer Critics Circle Award and an Actors' Equity award. Janney also appeared in the New York Shakespeare Festival's production of \"The Taming of the Shrew\". In 1999 Janney became part of the original cast of the acclaimed TV series The West Wing (1999) where she played the President's press secretary who eventually gets promoted to the White House Chief of Staff. Her impressive work during the seven seasons of that renowned series earned her four Emmys and two SAG Awards. With her reputation becoming more broadly established during her work on \"The West Wing\" Janney won more substantive roles in feature films, in the acclaimed The Hours (2002) where she was Meryl Streep's lesbian lover, and in How to Deal (2003) where she played Mandy Moore's mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjc2NzgxM15BMl5BanBnXkFtZTgwODQyMjM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005049","name":"Allison Janney","idIMDB":"nm0005049"},"actorId":"nm0005049","character":"Kathy McCormack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tina Lifford","urlProfile":"http://www.imdb.com/name/nm0509824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Mzg1MzAxM15BMl5BanBnXkFtZTcwODczODU5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tina Lifford emerged as an actress in 1994 as series lead in the critically acclaimed FOX comedy-drama South Central. In a career of more than twenty-five years, notable credits include Grand Canyon (1991), Mandela and De Klerk (1997), Blood Work (2002), Hostage (2005), Parenthood (2011-2015) and Scandal (2015). Her humanitarian work focuses on the importance of inner fitness.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Mzg1MzAxM15BMl5BanBnXkFtZTcwODczODU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0509824","name":"Tina Lifford","idIMDB":"nm0509824"},"actorId":"nm0509824","character":"Sharon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elle Macpherson","urlProfile":"http://www.imdb.com/name/nm0000512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODY5ODYyMV5BMl5BanBnXkFtZTYwMTc3NDgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1964","placeOfBirth":" Cronulla, Sydney, New South Wales, Australia","birthName":"Eleanor Nancy Gow","height":"6' (1.83 m)","bio":"Elle Macpherson was born on March 29, 1964 in Cronulla, Sydney, New South Wales, Australia as Eleanor Nancy Gow. She is an actress and producer, known for Britain and Ireland's Next Top Model (2005), Miss Universe 2001 (2001) and 42nd Annual TV Week Logie Awards (2000). She has been married to Jeffrey Soffer since July 2013. She was previously married to Gilles Bensimon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODY5ODYyMV5BMl5BanBnXkFtZTYwMTc3NDgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000512","name":"Elle Macpherson","nicknames":["The Body"],"idIMDB":"nm0000512"},"actorId":"nm0000512","character":"Lauren Travis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Camryn Manheim","urlProfile":"http://www.imdb.com/name/nm0005179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTE1NTgyNl5BMl5BanBnXkFtZTcwNjI5MjU5Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1961","placeOfBirth":" Caldwell, New Jersey, USA","birthName":"Debra Frances Manheim","height":"5' 10\" (1.78 m)","bio":"Camryn grew up in Peoria, Illinois. Her mother, Sylvia, was a schoolteacher and her father, Jerry, was a math professor. She developed an interest in acting after working at a Renaissance Fair at age 16. She earned a Master's Degree in Fine Arts from New York University in 1987. She studied acting at the Atlantic Theater Company Acting School in Chelsea, which was founded by David Mamet and William H. Macy and teaches the technique \"Practical Aesthetics,\" which Ms. Manheim uses. She is currently a member of the company at the Atlantic Theater, and she sometimes performs in shows during their season.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTE1NTgyNl5BMl5BanBnXkFtZTcwNjI5MjU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005179","name":"Camryn Manheim","idIMDB":"nm0005179"},"actorId":"nm0005179","character":"Suzanne Nabor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margo Martindale","urlProfile":"http://www.imdb.com/name/nm0553269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDg3OTE2NF5BMl5BanBnXkFtZTgwMTI5MDg0MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1951","placeOfBirth":" Jacksonville, Texas, USA","height":"5' 5½\" (1.66 m)","bio":"Margo Martindale was born July 18, 1951 in Jacksonville, Texas, to Margaret (Pruitt) and William Everett Martindale, a lumber company owner and dog handler. She is the youngest of three children, and the only daughter. Margo attended Lon Marris College, and later transferred to University of Michigan at Ann Arbor, and did a summer study at Harvard University. She made her film debut appearance in Days of Thunder (1990), she played the minor role of Donna. Notable roles include: Sister Colleen, Susan Sarandon's fellow nun in Dead Man Walking (1995). She played a brief but memorable role as the selfish mother to Hilary Swank's character in Million Dollar Baby (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDg3OTE2NF5BMl5BanBnXkFtZTgwMTI5MDg0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0553269","name":"Margo Martindale","idIMDB":"nm0553269"},"actorId":"nm0553269","character":"May","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"S. Epatha Merkerson","urlProfile":"http://www.imdb.com/name/nm0580924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTE0NjU4MF5BMl5BanBnXkFtZTcwNzI4MTM1NQ@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1952","placeOfBirth":" Saginaw, Michigan, USA","birthName":"Sharon Epatha Merkerson","height":"5' 6\" (1.68 m)","bio":"A native of Michigan, S. Epatha Merkerson earned a Bachelor of Fine Arts Degree from Wayne State University. In 1978, she moved to New York City to apply her craft on stage. Although best known since 1993 as the smart and shrewd Lieutenant Anita Van Buren on the long-running TV crime drama Law & Order (1990), she has a long list of Broadway and off-Broadway credits and honors that include Drama Desk Award and Tony Award nominations for Best Actress for her performance in the August Wilson play The Piano Lesson (1995), a 1992 Obie Award for her performance in \"I'm Not Stupid,\" and a 1998 Helen Hayes Award for her starring role in the Studio Theater production in Washington, DC, of the John Henry Redwood play \"The Old Settler.\" Her first appearance on television was a guest-starring role on an episode of The Cosby Show (1984). Her earliest regular role in television, however, was that of Reba the Mail Woman on Pee-wee's Playhouse (1986). Merkerson remains a theatrical force on the stage and on the screen and has the distinction of having been nominated for an Image Award in the Outstanding-Lead-Actress-in-a-Drama category for Law & Order (1990) for three consecutive years by the NAACP.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTE0NjU4MF5BMl5BanBnXkFtZTcwNzI4MTM1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0580924","name":"S. Epatha Merkerson","idIMDB":"nm0580924"},"actorId":"nm0580924","character":"Lani","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Rowan","urlProfile":"http://www.imdb.com/name/nm0746414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNjAzMDc2MV5BMl5BanBnXkFtZTgwMDc0NDA2MzE@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1965","placeOfBirth":" Ottawa, Ontario, Canada","height":"5' 7\" (1.7 m)","bio":"Kelly Rowan is best known for playing \"Kirsten Cohen\" on The O.C. (2003) for which she won a Prism award for best actress. She recently starred in and executive-produced The Good Times Are Killing Me (2009) with Rupert Graves. Her recent indie film credits include Jack and Jill vs. the World (2008) and Mount Pleasant (2006) (for which she was nominated for best supporting actress at the Vancouver Film Festival). She starred opposite Samuel L. Jackson in the Warner Bros./Mel Gibson- produced thriller One Eight Seven (1997). Other film credits include Assassins (1995) with Sylvester Stallone and Antonio Banderas and Hook (1991) for 'Steven Spielberg (I)'. Kelly seems to move effortlessly between the big and small screen. She starred in and executive-produced 8 jours pour mon fils (2006) and Au nom de ma fille (2007) (both nominated for Gemini awards for Best Television Movie in 2007). She also appeared in the first season of Boomtown (2002) for NBC, in addition to starring in The Truth About Jane (2000) with Stockard Channing, the mini-series A Girl Thing (2001) for Showtime, and the award-winning Anya's Bell (1999) for CBS. Kelly won critical acclaim and the Gemini Award for Best Actress in a Movie/Mini Series for her performance in the CBS movie Cauchemar en haute mer (1993) opposite Bruce Greenwood. Kelly also won a CTV International Achievement Award in 2005. When not on screen, Kelly is an active executive producer with her producing partner, Graham Ludlow. In 2007, they won a CFTPA indie award for outstanding independent producers for Au nom de ma fille (2007). They have also produced Soeurs de coeur (2007) for Lifetime and the CTV network.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNjAzMDc2MV5BMl5BanBnXkFtZTgwMDc0NDA2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0746414","name":"Kelly Rowan","idIMDB":"nm0746414"},"actorId":"nm0746414","character":"Claire","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0249603","urlIMDB":"http://www.imdb.com/title/tt0249603","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["3 hr 57 min (237 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":["Rainmaker Digital Pictures Group Ltd., Vancouver, Canada"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.4","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"UNRATED","awards":[],"votes":"657","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0032922","name":"Hallmark"},{"idCompany":"co0024733","name":"Lee Rose Productions"},{"idCompany":"co0052980","name":"Showtime Networks"}],"keywords":{"keywords":["therapist","f rated","sexy woman","sexy","female female kiss","first lesbian experience","kissing breasts","sex in bed","bare breasts","kiss","lesbian sex","lesbianism","female nudity","pregnancy","funeral","infidelity","lesbian","sexual awakening","sibling rivalry","blind date","lesbian kiss"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:29:13"}}