{"data":{"movies":[{"title":"Who Is Cletis Tout?","originalTitle":"","year":"2001","releaseDate":"20011221","directors":[{"name":"Chris Ver Wiel","id":"nm0893508"}],"writers":[{"name":"Chris Ver Wiel","id":"nm0893508"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMjYwNTA5OV5BMl5BanBnXkFtZTcwODk4OTMyMQ@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Comedy","Crime"],"plot":"Cletis Tout is a comedy about mistaken identities, a hit man who sees everything in terms of the movies and a twenty year old diamond heist.","simplePlot":"Cletis Tout is a comedy about mistaken identities, a hit man who sees everything in terms of the movies and a twenty year old diamond heist.","actors":[{"actorName":"Christian Slater","urlProfile":"http://www.imdb.com/name/nm0000225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODA1ODY2Nl5BMl5BanBnXkFtZTgwNjcwNDczNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1969","placeOfBirth":" New York City, New York, USA","birthName":"Christian Michael Leonard Slater","height":"5' 8½\" (1.74 m)","bio":"Christian Michael Leonard Slater was born on August 18, 1969 in New York City, to Michael Hawkins, a well-known soap actor, and Mary Jo Slater (née Lawton), a casting agent. Christian started in show business early, appearing on the soap opera The Edge of Night (1956) in 1976 at the age of 7. He went on to star in many Broadway shows in the early-1980s. He rose to fame in Hollywood after landing the role of Binx Davey in The Legend of Billie Jean (1985). He moved to Los Angeles in 1987 to pursue a further acting career after dropping out of high school. After having a starring role in the cult classic Heathers (1988), he became somewhat known as the Hollywood bad-boy, having many run-ins with the law. He is also well-known for having dated stars such as Winona Ryder, Christina Applegate, Samantha Mathis and was at one time engaged to actress/model Nina Huang. In 2000, he married Ryan Haddon, the daughter of 1970s model Dayle Haddon. The couple have two children, Jaden Christopher (b. 1999) and Eliana Sophia (b. 2001). As of early 2005, they separated and later divorced, but remain dedicated to bring up their children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODA1ODY2Nl5BMl5BanBnXkFtZTgwNjcwNDczNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000225","name":"Christian Slater","nicknames":["Slates"],"idIMDB":"nm0000225"},"actorId":"nm0000225","character":"Trevor Allen Finch","urlCharacter":"http://www.imdb.com/character/ch0059736","main":true},{"actorName":"Tim Allen","urlProfile":"http://www.imdb.com/name/nm0000741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODY0NTAwOF5BMl5BanBnXkFtZTcwOTI3NjQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1953","placeOfBirth":" Denver, Colorado, USA","birthName":"Timothy Allen Dick","height":"5' 10½\" (1.79 m)","bio":"Timothy Allen Dick was born on June 13, 1953, in Denver, Colorado, USA, to Martha Katherine (Fox) and Gerald M. Dick. His father, a real-estate salesman, was killed in a collision with a drunk driver while driving his family home from a University of Colorado football game, when Tim was eleven years old. His mother, a community-service worker, remarried her high-school sweetheart, an Episcopalian deacon, two years after Tim's father's death. Tim has a total of eight siblings. His ancestry includes English, German, Irish, and Scottish. When Tim was young, his family moved to Birmingham, Michigan. In high school, his favorite subject was shop, of course, and after high school, he attended Western Michigan University and graduated with a degree in Television Production in 1975. In 1978, he was arrested on drug charges and spent two years in jail. Upon his release, he had a new outlook on life and on a dare from a friend, started his comedy career at the Comedy Castle in Detroit. Later, he went on to do several cable specials, including, Comedy's Dirtiest Dozen (1988) and Tim Allen: Men Are Pigs (1990). In 1991, he became the star of his own hit television series on ABC called Home Improvement (1991). While continuing to film his television series throughout most of the 1990s, he starred in a string of blockbuster movies including The Santa Clause (1994), Toy Story (1995), Toy Story 2 (1999) and Galaxy Quest (1999). In August 1996, he developed and unveiled his own signature line of power tools, manufactured by Ryobi. On top of all that, he has his own racing team, Tim Allen/Saleen RRRRacing. In May 1999, he ended his series Home Improvement (1991) after eight seasons and in 2001, he filmed such movies as Big Trouble (2002) and Joe Somebody (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODY0NTAwOF5BMl5BanBnXkFtZTcwOTI3NjQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000741","name":"Tim Allen","nicknames":["The Tool Man"],"idIMDB":"nm0000741"},"actorId":"nm0000741","character":"Critical Jim","urlCharacter":"http://www.imdb.com/character/ch0059737","main":true},{"actorName":"Portia de Rossi","urlProfile":"http://www.imdb.com/name/nm0005577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mjk1MjIxOV5BMl5BanBnXkFtZTcwODQyNjY5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1973","placeOfBirth":" Geelong, Victoria, Australia","birthName":"Amanda Lee Rogers","height":"5' 8\" (1.73 m)","bio":"Portia de Rossi was born and raised in Geelong, Australia. Originally born Amanda Rogers, at 15 she changed her name to Portia, saying that it was the most daring thing she had ever done up until that point. After graduating from high school, she attended the University of Melbourne, and studied law. Although she studied diligently, in 1993, Portia found herself giving special notice to a casting director who saw her in a commercial, and she soon auditioned for Sirènes (1993), a low budget comedy starring Hugh Grant. She was cast in the role of Giddy, one of the three gorgeous models in the movie. It wasn't until 1997, however, that Portia at last began to attract real attention. She turned an unforgettable role as Murphy in Scream 2 (1997), and in 1998 she joined the cast of Ally McBeal (1997) as the \"Ice Queen\", Nelle Porter. She has also worked on such projects as Stigmata (1999), Girl (1998), and The Invisibles (1999), and she has appeared on several magazine covers, including Shape. After more than a decade of hard work, Portia is finally beginning to win real recognition, not only for her long golden tresses, but also for her wonderful talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mjk1MjIxOV5BMl5BanBnXkFtZTcwODQyNjY5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005577","name":"Portia de Rossi","idIMDB":"nm0005577"},"actorId":"nm0005577","character":"Tess Tobias","urlCharacter":"http://www.imdb.com/character/ch0059738","main":true},{"actorName":"Richard Dreyfuss","urlProfile":"http://www.imdb.com/name/nm0000377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjIzMjM2NV5BMl5BanBnXkFtZTcwNDAxMDY0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1947","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Richard Stephen Dreyfus","height":"5' 5\" (1.65 m)","bio":"Richard Dreyfuss is an American leading man, who has played his fair share of irritating pests and brash, ambitious hustlers. He was born Richard Stephen Dreyfus in Brooklyn, New York, to Geraldine (Robbins), an activist, and Norman Dreyfus, a restaurateur and attorney. His paternal grandparents were Austro-Hungarian Jewish immigrants, and his mother's family was Russian Jewish. Richard Dreyfuss worked his way up through bit parts (The Graduate (1967), for one) and TV before gaining attention with his portrayal of Baby Face Nelson in John Milius' Dillinger (1973). He gained prominence as a college-bound young man in American Graffiti (1973) and as a nervy Jewish kid with high hopes in L'apprentissage de Duddy Kravitz (1974). By the latter part of the 1970s Dreyfuss was established as a major star, playing leads (and alter-egos) for Steven Spielberg in two of the top-grossing films of the that decade: Jaws (1975) and Close Encounters of the Third Kind (1977). He won a Best Actor Oscar in his first romantic lead as an out-of-work actor in The Goodbye Girl (1977). Dreyfuss also produced and starred in the entertaining private eye movie The Big Fix (1978). After a brief lull in the early 1980s, a well-publicized drug problem and a string of box-office disappointments (The Competition (1980), Whose Life Is It Anyway? (1981), The Buddy System (1984)), a clean and sober Dreyfuss re-established himself in the mid-'80s as one of Hollywood's more engaging leads. He co-starred with Bette Midler and Nick Nolte in Paul Mazursky's popular Down and Out in Beverly Hills (1986). That same year he provided the narration and appeared in the opening and closing \"bookends\" of Rob Reiner's nostalgic Stand by Me (1986). He quickly followed that with Nuts (1987) opposite Barbra Streisand, Barry Levinson's Tin Men (1987) in a memorable teaming with Danny DeVito and Stakeout (1987) with Emilio Estevez. Dreyfuss continued working steadily through the end of the 1980s and into the 1990s, most notably in Mazursky's farce Moon Over Parador (1988), Spielberg's Always (1989), Postcards from the Edge (1990) and Rosencrantz & Guildenstern Are Dead (1990). He appeared as a member of an ensemble that included Holly Hunter, Gena Rowlands and Danny Aiello in the romantic comedy Once Around (1991) and as a pop psychiatrist, the author of several successful self-help books, who is driven to the edge by nutcase Bill Murray in the popular comedy What About Bob? (1991). Dreyfuss has also remained active in the theater (\"Death and Maiden\", 1992) and on TV. He returned to features in the adaptation of Neil Simon's play Lost in Yonkers (1993) and followed with a supporting turn as the querulous political opponent in The American President (1995). Dreyfuss received some of the best notices of his career as a determined, inspiring music teacher coping with a deaf son and the demands of his career in Mr. Holland's Opus (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjIzMjM2NV5BMl5BanBnXkFtZTcwNDAxMDY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000377","name":"Richard Dreyfuss","idIMDB":"nm0000377"},"actorId":"nm0000377","character":"Micah Tobias","urlCharacter":"http://www.imdb.com/character/ch0059739","main":true},{"actorName":"Billy Connolly","urlProfile":"http://www.imdb.com/name/nm0175262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzM2MTA4Ml5BMl5BanBnXkFtZTYwMzIxNTM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1942","placeOfBirth":" Anderston, Glasgow, Scotland, UK","birthName":"William Connolly","height":"6' (1.83 m)","bio":"Billy Connolly was born and raised in Glasgow, Scotland. He left school to work in the shipyards becoming a welder and joined the Territorial Army (in the parachute regiment) at around the same time. He developed an interest in folk music, eventually becoming an accomplished banjo player and a member of the band Humblebums with Gerry Rafferty (later of Baker Street fame). The jokes he told between songs eventually took over his act and he became a full-time comedian. Already a big star in Scotland, he became a household name in the UK after appearing on Parkinson (1971) in the early seventies. Billy has released many recordings and videos of his concert performances over the years. He has expanded his repertoire to include acting, appearing in a number of television dramas and films, most recently in the USA. In the 90s he made two documentary series for the BBC, about Scotland and Australia respectively, and in 1997 he starred in the award winning film Mrs Brown (1997). He is one of the UK's top comedian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzM2MTA4Ml5BMl5BanBnXkFtZTYwMzIxNTM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175262","name":"Billy Connolly","nicknames":["The Big Yin"],"idIMDB":"nm0175262"},"actorId":"nm0175262","character":"Dr. Mike Savian","urlCharacter":"http://www.imdb.com/character/ch0059740","main":true},{"actorName":"Peter MacNeill","urlProfile":"http://www.imdb.com/name/nm0534132","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDI3ODg5M15BMl5BanBnXkFtZTcwNTQ1MzM3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 1¼\" (1.86 m)","bio":"Peter MacNeill was born in New Brunswick, Canada. He is known for his work on A History of Violence (2005), Crash (1996) and Frequency (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDI3ODg5M15BMl5BanBnXkFtZTcwNTQ1MzM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534132","name":"Peter MacNeill","idIMDB":"nm0534132"},"actorId":"nm0534132","character":"Detective Tripp","urlCharacter":"http://www.imdb.com/character/ch0059741","main":true},{"actorName":"Bill MacDonald","urlProfile":"http://www.imdb.com/name/nm0531628","urlPhoto":"","biography":{"bio":"Bill MacDonald is an actor, known for A History of Violence (2005), The Long Kiss Goodnight (1996) and The Corruptor (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0531628","name":"Bill MacDonald","idIMDB":"nm0531628"},"actorId":"nm0531628","character":"Detective Delaney","urlCharacter":"http://www.imdb.com/character/ch0059742","main":true},{"actorName":"Richard Chevolleau","urlProfile":"http://www.imdb.com/name/nm0156739","urlPhoto":"","biography":{"dateOfBirth":"October1966","placeOfBirth":" Kingston, Jamaica","bio":"Richard Chevolleau was born in October 1966 in Kingston, Jamaica. He is an actor and director, known for Invasion planète Terre (1997), Four Brothers (2005) and Talk to Me (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0156739","name":"Richard Chevolleau","idIMDB":"nm0156739"},"actorId":"nm0156739","character":"Detective Horst","urlCharacter":"http://www.imdb.com/character/ch0059743","main":true},{"actorName":"Elias Zarou","urlProfile":"http://www.imdb.com/name/nm0953558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk2MzI0NDA3OF5BMl5BanBnXkFtZTgwMDc3MDg3NzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Elias Zarou is an actor, known for X-Men (2000), Traitor (2008) and Who Is Cletis Tout? (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk2MzI0NDA3OF5BMl5BanBnXkFtZTgwMDc3MDg3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0953558","name":"Elias Zarou","idIMDB":"nm0953558"},"actorId":"nm0953558","character":"Detective Rafferty","urlCharacter":"http://www.imdb.com/character/ch0059744","main":true},{"actorName":"RuPaul","urlProfile":"http://www.imdb.com/name/nm0750412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5ODQwNzY5OF5BMl5BanBnXkFtZTgwODc4ODUxODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1960","placeOfBirth":" San Diego, California, USA","birthName":"RuPaul Andre Charles","height":"6' 4\" (1.93 m)","bio":"Born Rupaul Andre Charles on November 17 1960, he grew up in San Diego, learning fashion tips from his mother and three sisters. After some time living in Atlanta doing odd jobs such as a used-car salesman, RuPaul moved to New York by the early '90s. He had begun performing in local Manhattan clubs and became a popular attraction through his various flamboyant acts on stage. After battling drug addiction and living in poverty Rupaul was given a record contract by the famous duo Randy Barbato and Fenton Bailey, with the hip-hop label Tommy Boy Records. His debut album, \"Supermodel of the World\", was released in 1993, but it failed on the Billboard Charts until the following year, when the success of the single \"Supermodel (You Better Work)\" a tribute to the divas of the fashion world placed in the top 30 on the Pop Charts. The music video for \"Supermodel\" was nominated for Best Dance Video at the 1994 MTV video music awards. In 1992 he met Mathu his make-up artist and Zaldy his costume designer, the two studied every inch of his body and went on to create some of Rupaul's most famous costumes and build what he calls the \"Glamazon Look\". The success of \"Supermodel\" had Rupaul performing at a Gay rights rally in Washington D.C., on the same spot Martin Luther King delivered his \"I Have a Dream\" speech. In 1994 Rupaul recorded a duet with Elton John, \"Don't Go Breaking My Heart,\" which charted on the American charts but proved more successful in Europe, where the two co-hosted England's Brit Awards and RuPaul taped a popular Christmas special. In 1995 Rupaul launched his autobiography entitled \"Lettin It All Hang Out\" which has since been out of print and has sold 450,739 copies on Amazon.com alone. He also appeared in two films, The Brady Bunch Movie (1995), and Spike Lee's Crooklyn (1995). The media exposure gained Rupaul his own show for VH1. The RuPaul Show which mixed a talk show and a variety show, featured Rupaul performing all kinds of stunts from doing comedic sketches, program specials such as The Rupaul Porn Star Show and the Disco salute and sometimes ends with Rupaul collaborating in a duet with guest stars. The show sadly ended in 1998 after three seasons when ratings began to falter. That same year he became a spokesperson for M.A.C. Cosmetics, billing him as \"The First Face of M.A.C.\" Over the course of six years, he launched store openings in ten countries and helped raise over $22 million for the M.A.C AIDS fund. A Christmas album titled \"Ho, Ho, Ho,\" was released in 1997. After moving to Rhino Records for his third album Foxy Lady, RuPaul made some noise in the clubs once again with the supermodel sister single \"Snapshot\" and the moving self-inspired \"A Little Bit Of Love\". At the same time Rupaul was also doing films appearing in movies such as the all-star drag queen comedy To Wong Foo, Thanks For Everything, Julie Newmar (1995), the made for TV movies A Mothers Prayer (1995) with Linda Hamilton and An Unexpected Life with Stockard Channing (1998), the lifetime TV drama The Truth About Jane (2000), But I'm a Cheerleader (1999), and the Inde film Who Is Cletis Tout? (2001) with Richard Dreyfuss, Tim Allen, and Christian Slater. In 1999 Rupaul received the Vito Russo Entertainer of The year at The Gay & Lesbian Alliance Against Defamation (GLAAD) media awards for challenging the limits and breaking boundaries in becoming an openly gay individual who has achieved excellence in the field of Entertainment and furthering his visibility and understanding of the community through his work. In 2002 Rupaul was honored by The Most Beautiful Transsexuals In The World Association, commending him for his outreach support on the Gay and Lesbian community with their Lifetime Achievement Award honoring his over 10 year conquest and establishing fashion and glamor in the entertainment industry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5ODQwNzY5OF5BMl5BanBnXkFtZTgwODc4ODUxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0750412","name":"RuPaul","idIMDB":"nm0750412"},"actorId":"nm0750412","character":"Ginger Markum","urlCharacter":"http://www.imdb.com/character/ch0059745","main":true},{"actorName":"Joseph Scoren","urlProfile":"http://www.imdb.com/name/nm0778717","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzMwNzAzMl5BMl5BanBnXkFtZTcwNTgxNTMzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1964","placeOfBirth":" Toronto, Canada","bio":"Joseph Scoren was born on June 6, 1964 in Toronto, Canada. He was an actor, known for Chicago (2002), Le festin nu (1991) and Cypher (2002). He was married to Kim Wall. He died on August 9, 2005 in Toronto, Ontario, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzMwNzAzMl5BMl5BanBnXkFtZTcwNTgxNTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0778717","name":"Joseph Scoren","idIMDB":"nm0778717"},"actorId":"nm0778717","character":"Rowdy Virago","urlCharacter":"http://www.imdb.com/character/ch0059746","main":true},{"actorName":"Eugene Lipinski","urlProfile":"http://www.imdb.com/name/nm0513468","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDY0NDA4N15BMl5BanBnXkFtZTcwMjU1OTMwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1956","placeOfBirth":" Wansford Camp, England, UK","height":"6' 1\" (1.85 m)","bio":"Eugene Lipinski was born on November 5, 1956 in Wansford Camp, England. He is an actor and writer, known for Indiana Jones and the Last Crusade (1989), The Recruit (2003) and Sophie's Choice (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDY0NDA4N15BMl5BanBnXkFtZTcwMjU1OTMwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0513468","name":"Eugene Lipinski","idIMDB":"nm0513468"},"actorId":"nm0513468","character":"Falco","urlCharacter":"http://www.imdb.com/character/ch0059747","main":true},{"actorName":"Shawn Doyle","urlProfile":"http://www.imdb.com/name/nm0236495","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTE2NzM0Ml5BMl5BanBnXkFtZTgwMjQ5MzM2NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1968","placeOfBirth":" Wabush, Newfoundland and Labrador, Canada","height":"6' (1.83 m)","bio":"Born and raised in Newfoundland, Canada, Shawn Doyle has become a familiar face to audiences worldwide, turning out critically acclaimed performances on both the big and small screen. With his move to Los Angeles in 2005, Shawn quickly amassed an impressive list of credits with recurring roles on Desperate Housewives (2004) and 24 (2001), and guest-star roles on Lie to Me (2009), _\"Terriers\"(2010)_, Dark Blue (2009), Lost (2004), Numb3rs (2005) and Blind Justice (2005). In 2010 he said goodbye to his regular role as Joey in the hit series Big Love (2006) to portray the brilliant, charismatic and egocentric Balagan in Endgame (2011). Prior to moving south, Shawn starred in the critically-acclaimed Canadian series Bury the Lead (2002) and received the 2002 ACTRA Award and a 2004 Gemini (Canadian Emmy) Nomination, both for Outstanding Male Performance In A Leading Role, and a 2005 Gemini Nomination for Outstanding Performance In A Guest-starring Role. He starred opposite 'Mary-Louise Parker' in the CBC/BBC movie Voleuses de vie (2007), which garnered him a Gemini Award for Outstanding Male Performance In A Dramatic Program Or Miniseries. Other Canadian television credits include the CBC miniseries Guns (2008), Deep in the City (1999) (Gemini Nom.), Scar Tissue (2002), A Killing Spring (2002) (Gemini Nom), Criminal Instincts (2000), Peacekeepers (1997) and the miniseries Dieppe (1993). He will soon be starring as the Father of Canadian Confederation John A. Macdonald in the movie \"The Rivals\". Shawn's film credits include Grown Up Movie Star (2009), White Out (2008), Sabah (2005), Don't Say a Word (2001), Frequency (2000), The Majestic (2001), Knockaround Guys (2001) and Mount Pleasant (2006). On stage, Shawn has performed in a long list of plays, both contemporary and classical. His most recent outing in 'Carol Churchill's \"A Number\" earned him the 2006 Dora (Canadian Tony) Award for Outstanding Male Performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTE2NzM0Ml5BMl5BanBnXkFtZTgwMjQ5MzM2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236495","name":"Shawn Doyle","idIMDB":"nm0236495"},"actorId":"nm0236495","character":"Crow Gollotti","urlCharacter":"http://www.imdb.com/character/ch0059748","main":true},{"actorName":"Louis Di Bianco","urlProfile":"http://www.imdb.com/name/nm0223666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NTgzNjAxOV5BMl5BanBnXkFtZTgwMTM0ODIxNzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Louis Di Bianco is an actor, known for Moonstruck (1987), The Boondock Saints II: All Saints Day (2009) and Car 54, Where Are You? (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NTgzNjAxOV5BMl5BanBnXkFtZTgwMTM0ODIxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0223666","name":"Louis Di Bianco","idIMDB":"nm0223666"},"actorId":"nm0223666","character":"Nimble","urlCharacter":"http://www.imdb.com/character/ch0059749","main":true},{"actorName":"Tony Nappo","urlProfile":"http://www.imdb.com/name/nm0621176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzU3OTg1OV5BMl5BanBnXkFtZTcwNzIxNTI0OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Tony was born and raised in Scarborough, Ontario. He graduated from the American Academy of Dramatic Arts in New York in 1991. He has appeared in numerous Hollywood films as well many independent films and over a hundred episodes of television. He Is also a regular fixture on Canadian stages. Tony has been nominated for a Canadian Screen Award, A Broadway World Award, an Actra Award, and a Dora Mavor Moore Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzU3OTg1OV5BMl5BanBnXkFtZTcwNzIxNTI0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0621176","name":"Tony Nappo","idIMDB":"nm0621176"},"actorId":"nm0621176","character":"Fife","urlCharacter":"http://www.imdb.com/character/ch0059750","main":true}],"seasons":[],"idIMDB":"tt0246500","urlIMDB":"http://www.imdb.com/title/tt0246500","business":{"budget":{"money":"$9,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$64,867","country":"USA","day":"28","month":"07","year":"2002","remarks":"18 Screens"}],"gross":[{"money":"$252,227","country":"USA","day":"13","month":"10","year":"2002","remarks":""},{"money":"$249,946","country":"USA","day":"06","month":"10","year":"2002","remarks":""},{"money":"$246,914","country":"USA","day":"29","month":"09","year":"2002","remarks":""},{"money":"$246,634","country":"USA","day":"22","month":"09","year":"2002","remarks":""},{"money":"$245,240","country":"USA","day":"15","month":"09","year":"2002","remarks":""},{"money":"$241,173","country":"USA","day":"08","month":"09","year":"2002","remarks":""},{"money":"$237,793","country":"USA","day":"01","month":"09","year":"2002","remarks":""},{"money":"$230,116","country":"USA","day":"25","month":"08","year":"2002","remarks":""},{"money":"$212,339","country":"USA","day":"18","month":"08","year":"2002","remarks":""},{"money":"$178,152","country":"USA","day":"11","month":"08","year":"2002","remarks":""},{"money":"$133,237","country":"USA","day":"04","month":"08","year":"2002","remarks":""},{"money":"$64,867","country":"USA","day":"28","month":"07","year":"2002","remarks":""},{"money":"€182,514","country":"Spain","day":"31","month":"08","year":"2002","remarks":""}],"weekendGross":[{"money":"$1,034","country":"USA","day":"13","month":"10","year":"2002","remarks":"4 Screens"},{"money":"$2,882","country":"USA","day":"06","month":"10","year":"2002","remarks":"5 Screens"},{"money":"$213","country":"USA","day":"29","month":"09","year":"2002","remarks":"1 Screen"},{"money":"$176","country":"USA","day":"22","month":"09","year":"2002","remarks":"2 Screens"},{"money":"$2,998","country":"USA","day":"15","month":"09","year":"2002","remarks":"11 Screens"},{"money":"$2,804","country":"USA","day":"08","month":"09","year":"2002","remarks":"9 Screens"},{"money":"$3,368","country":"USA","day":"01","month":"09","year":"2002","remarks":"6 Screens"},{"money":"$8,760","country":"USA","day":"25","month":"08","year":"2002","remarks":"17 Screens"},{"money":"$19,381","country":"USA","day":"18","month":"08","year":"2002","remarks":"26 Screens"},{"money":"$25,881","country":"USA","day":"11","month":"08","year":"2002","remarks":"36 Screens"},{"money":"$40,875","country":"USA","day":"04","month":"08","year":"2002","remarks":"33 Screens"},{"money":"$64,867","country":"USA","day":"28","month":"07","year":"2002","remarks":"18 Screens"}],"admissions":[{"money":"39,545","country":"Spain","day":"31","month":"08","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe, Toronto, Canada"],"filmLength":["2,561 m (Spain)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"6.4","metascore":"36","filmingLocations":[{"location":"Todmorden Mills, Toronto, Ontario, Canada"}],"rated":"R","awards":[{"award":"Canadian Comedy Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Canadian Comedy Award","categories":[{"category":"Film - Pretty Funny Male Performance","names":[{"name":"Louis Di Bianco","id":"nm0223666","role":null}]}]}]},{"award":"Directors Guild of Canada 2002","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Team Award","categories":[{"category":"Outstanding Achievement in a Feature Film","names":[{"name":"Andrew Shea","id":"nm0790249","role":"1st Assistant Director"},{"name":"Christopher Binney","id":"nm0083057","role":"2nd Assistant Director"},{"name":"Cassandra Cronenberg","id":"nm0188724","role":"3rd Assistant Director"},{"name":"Julie O'Neill","id":"nm1037204","role":"Trainee Assistant Director"},{"name":"Dennis Chapman","id":"nm0152347","role":"Production Manager"},{"name":"Debbie Wilkinson","id":"nm0929362","role":"Production Coordinator"},{"name":"Heather McIntosh","id":"nm0570657","role":"Production Accountant"},{"name":"Vay Trong","id":"nm0873525","role":"Post Production Accountant"},{"name":"Sarah McIntosh","id":"nm1121117","role":"Payroll"},{"name":"Sara Holmes","id":"nm0392040","role":"Assistant Accountant"},{"name":"Monica Ionson","id":"nm1332072","role":"Assistant Accountant"},{"name":"Phay Wills","id":"nm1337629","role":"Assistant Accountant"},{"name":"Peter Boboras","id":"nm0090417","role":"Location Manager"},{"name":"Dennis Sincic","id":"nm0801551","role":"Assistant Location Manager"},{"name":"James Campbell","id":"nm0132533","role":"Location Production Assistant"},{"name":"Peter Emmink","id":"nm0256549","role":"Art Director"},{"name":"Brent McGillivray","id":"nm0569304","role":"1st Assistant Art Director"},{"name":"Garrett Kerr","id":"nm0449695","role":"Supervising Sound Editor"},{"name":"Elma Bello","id":"nm0069128","role":"Dialogue Editor"},{"name":"Fred Brennan","id":"nm0107287","role":"Dialogue Editor"},{"name":"Richard Cadger","id":"nm0128197","role":"Dialogue Editor"},{"name":"Ronayne Higginson","id":"nm0383530","role":"Dialogue Editor"},{"name":"Sean Kelly","id":"nm0446857","role":"Dialogue Editor"},{"name":"Martin Gwynn Jones","id":"nm0428778","role":"Assistant Dialogue Editor"},{"name":"Kevin Banks","id":"nm0052193","role":"Foley Editor"},{"name":"Roderick Deogrades","id":"nm0219965","role":"SFX Editor"},{"name":"Richard Harkness","id":"nm0363185","role":"SFX Editor"},{"name":"David McCallum","id":"nm0564725","role":"SFX Editor"},{"name":"Jane Tattersall","id":"nm0002938","role":"SFX Editor"},{"name":"Mark Shnuriwsky","id":"nm0794646","role":"SFX Editor"},{"name":"Brent Pickett","id":"nm0681878","role":"Assistant SFX Editor"},{"name":"Kathy Choi","id":"nm0158845","role":"Assistant SFX Editor"},{"name":"Matt Ahrens","id":"nm0014331","role":"Assistant SFX Editor"},{"name":"Robert Warchol","id":"nm0911331","role":"SFX Editor"}]}]}]}],"votes":"3,563","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040305","name":"Fireworks Entertainment"},{"idCompany":"co0052971","name":"Itasca Pictures"},{"idCompany":"co0024267","name":"Nichol Moon Films"}],"keywords":{"keywords":["diamond","heist","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:48:56"}}