{"data":{"movies":[{"title":"The Trip","originalTitle":"","year":"2002","releaseDate":"20020505","directors":[{"name":"Miles Swain","id":"nm0841504"}],"writers":[{"name":"Miles Swain","id":"nm0841504"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Mjc3MjU4N15BMl5BanBnXkFtZTcwMDcyNDQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"When 19-year-old gay-rights activist Tommy and 24-year-old Alan first meet in 1973, they find themselves on the opposite sides of the political coin. Despite their many differences, they form a loving long-term relationship. In 1977, during Anita Bryant's crusade, an anti-gay book Alan wrote years before gets published without his consent. The book destroys Tommy's credibility as a well-known activist, resulting in Tommy and Alan's break-up. Seven years later, Alan is given a second chance, a reunion with Tommy and the opportunity to set things right.","simplePlot":"When 19-year-old gay-rights activist Tommy and 24-year-old Alan first meet in 1973, they find themselves on the opposite sides of the political coin. Despite their many differences, they ... ","actors":[{"actorName":"Larry Sullivan","urlProfile":"http://www.imdb.com/name/nm0837942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjYwOTU2OV5BMl5BanBnXkFtZTgwNTIzMjAyNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1970","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Lawrence Edward Sullivan Jr.","height":"6' (1.83 m)","bio":"Larry Sullivan was born on September 10, 1970 in New Haven, Connecticut, USA as Lawrence Edward Sullivan Jr. He is an actor, known for Rush Hour (1998), Straight Outta Compton (2015) and Fracture (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjYwOTU2OV5BMl5BanBnXkFtZTgwNTIzMjAyNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0837942","name":"Larry Sullivan","idIMDB":"nm0837942"},"actorId":"nm0837942","character":"Alan Oakley","urlCharacter":"http://www.imdb.com/character/ch0441985","main":true},{"actorName":"Steve Braun","urlProfile":"http://www.imdb.com/name/nm0105853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDc5Njc1Nl5BMl5BanBnXkFtZTcwOTQ0MDMzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1976","placeOfBirth":" Winnipeg, Manitoba, Canada","height":"5' 9\" (1.75 m)","bio":"Steve Braun was born on August 14, 1976 in Winnipeg, Manitoba, Canada. He is an actor, known for Harold & Kumar Go to White Castle (2004), Wrong Turn 2: Dead End (2007) and The Trip (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDc5Njc1Nl5BMl5BanBnXkFtZTcwOTQ0MDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0105853","name":"Steve Braun","idIMDB":"nm0105853"},"actorId":"nm0105853","character":"Tommy Ballenger","urlCharacter":"http://www.imdb.com/character/ch0441986","main":true},{"actorName":"Ray Baker","urlProfile":"http://www.imdb.com/name/nm0048844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4ODkwMTI4N15BMl5BanBnXkFtZTgwOTU2MTI5ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1948","placeOfBirth":" Omaha, Nebraska, USA","height":"6' 2\" (1.88 m)","bio":"Ray Baker was born in Omaha, grew up in Colorado, and graduated from the University of Denver. In 1970 he moved to the East Coast, and began his acting career doing improvisational theater in Boston and New York. During 19 years in New York City, he appeared on Broadway in such productions as \"Crimes of the Heart\", \"Is There Life After High School?\", \"Torch Song Trilogy\", among others. He also appeared in many in off-Broadway shows, among them \"The Proposition\" and \"Character Lines\". He moved to Los Angeles in 1989, where he now lives, and works as an actor in movies and TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4ODkwMTI4N15BMl5BanBnXkFtZTgwOTU2MTI5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048844","name":"Ray Baker","idIMDB":"nm0048844"},"actorId":"nm0048844","character":"Peter Baxter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Handy","urlProfile":"http://www.imdb.com/name/nm0359695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg4MzYyODg5MF5BMl5BanBnXkFtZTcwNDQzMTUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"James Handy was born in New York City, New York, USA. He is an actor, known for Jumanji (1995), Unbreakable (2000) and The Rocketeer (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg4MzYyODg5MF5BMl5BanBnXkFtZTcwNDQzMTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0359695","name":"James Handy","idIMDB":"nm0359695"},"actorId":"nm0359695","character":"Hal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Faith Salie","urlProfile":"http://www.imdb.com/name/nm0758276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMzM0MDA2MF5BMl5BanBnXkFtZTYwMDk4ODcy._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1971","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Faith Coley Salie","height":"5' 5\" (1.65 m)","bio":"Faith Salie was the host and executive producer of the National Public Radio show \"Fair Game from PRI with Faith Salie\". During its 300 episode run, she conducted over 1000 interviews with the likes of President Jimmy Carter, Lorne Michaels, Sir Anthony Hopkins, Slash, Elizabeth Edwards, Norah Jones, Oliver Sacks, Tom Brokaw and a family of champion elk callers. On television, Faith hosts the Sundance Channel's coverage of the Sundance Film Festival, conducting interviews with filmmakers and actors such as Chris Rock, Uma Thurman, Billy Bob Thornton, The Doors, Kristen Wiig, Mo'Nique and Paul Giamatti. Faith was also one of the stars of the critically-acclaimed improvisational sitcom, Significant Others (2004) on Bravo. She has appeared in numerous sitcoms and dramas -- from a memorable turn in gold lamé on Sex and the City (1998) to reaching the arcane iconic status of \"tradable life form\" for Star Trek: Deep Space Nine (1993) fans. Faith is a monthly contributor to \"O\", the Oprah Magazine, as an ethics expert and has appeared on The Oprah Winfrey Show (1986), taking on Randy Cohen, The New York Times ethicist. As a commentator on politics and current events, Faith has appeared on CBS News Sunday Morning (1979), The O'Reilly Factor (1996) and CNN, and has contributed to the National Public Radio shows \"Tell Me More\" and \"The Takeaway\". For the latter, she covered both the 2008 Democratic and Republican conventions. She serves as one of the moderators for the World Science Festival, leading panels with scientists such as Richard Leakey, Vilayanur Ramachandran and Raymond Kurzweil. To justify her subscriptions to Star and US Weekly, Faith offers pop-culture punditry on a variety of VH-1 shows and is a regular on the late-night Fox News show Red Eye w/Tom Shillue (2007). Faith has regularly performed as a stand-up comedian at the Hollywood Improv. She is also a television writer and has created/executive produced pilots for Fox, VH-1, and the Oxygen Network. Faith is a Rhodes scholar who graduated magna cum laude and Phi Beta Kappa from Harvard University. She completed an M. Phil. in Literature at Oxford University. Faith was born in Boston, Massachusetts and grew up in Atlanta, Georgia, which means she uses \"wicked\" as an adverb and also says \"y'all\". Faith's hobbies include baking white trash treats and giving them away before she can eat them.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMzM0MDA2MF5BMl5BanBnXkFtZTYwMDk4ODcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0758276","name":"Faith Salie","nicknames":["Fwa"],"idIMDB":"nm0758276"},"actorId":"nm0758276","character":"Ignored Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Bailey","urlProfile":"http://www.imdb.com/name/nm0047229","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk3OTAzNDY2N15BMl5BanBnXkFtZTgwOTA3ODU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1953","placeOfBirth":" Grosse Point, Michigan, USA","bio":"Dennis Bailey was born on April 12, 1953 in Grosse Point, Michigan, USA. He is an actor, known for General Hospital (1963), The Trip (2002) and L'incoronazione di Poppea (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk3OTAzNDY2N15BMl5BanBnXkFtZTgwOTA3ODU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0047229","name":"Dennis Bailey","idIMDB":"nm0047229"},"actorId":"nm0047229","character":"Larry Jenkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexis Arquette","urlProfile":"http://www.imdb.com/name/nm0000793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNDQ4NDgxNF5BMl5BanBnXkFtZTcwMzQ3MDA2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1969","placeOfBirth":" Los Angeles, California, USA","birthName":"Robert Arquette","height":"5' 7¾\" (1.72 m)","bio":"Alexis Arquette was born on July 28, 1969 in Los Angeles, California, USA as Robert Arquette. She is known for her work on Pulp Fiction (1994), The Wedding Singer (1998) and La fiancée de Chucky (1998). She died on September 11, 2016 in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNDQ4NDgxNF5BMl5BanBnXkFtZTcwMzQ3MDA2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000793","name":"Alexis Arquette","nicknames":["Eva Destruction","Lex"],"idIMDB":"nm0000793"},"actorId":"nm0000793","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sirena Irwin","urlProfile":"http://www.imdb.com/name/nm0410451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MTU3MDA2N15BMl5BanBnXkFtZTgwMzI3ODM5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sirena grew up around the U.S. and abroad as her mother, Margaret Irwin-Brandon, is a harpsichordist and conductor of a Baroque Orchestra. and her father, John Irwin, is a physicist (with a significant stint as a dropped out hippie)- landing ultimately at Stanford University. The two were divorced early in Sirena's life and she spent time between the two. After time spent at Northfield Mt. Hermon boarding school where she fell in love with theater, she attended San Francisco State University and graduated with degrees in Theater and International Relations. After a successful stint in a popular San Francisco sketch comedy group, she landed in Los Angeles where her knack for voices and accents were quickly put to use in the world of animation voice over. She has appeared \"on-camera\" in roles on various TV shows and in the popular gay film \"The Trip.\" She originated the role of Lucy in \"I Love Lucy® Live On Stage\" for which she received Chicago's Broadway World Award for \"Best Actress in a Touring Production\" and many other awards. The Los Angeles Times called her performance \"pitch perfect,\" and Huffington Post called her Lucy a \"force of nature.\" She was with the show for four years which included sold-out runs in Los Angeles and Chicago and the subsequent successful 2013-2014 National Tour. Of the over 550 shows, she never missed a performance. Other stage work includes San Francisco Shakespeare Festival, John Patrick Shanley's Where's My Money (West Coast Premiere), Peter Hedges' Imagining Brad, and other Hollywood theatre productions like the infamous Bob's Holiday Office Party. She was also the front woman for San Francisco's famed Seemen, a pyro-technics robotics group that was an off-shoot of SRL (Survival Research Laboratories). Sirena has written, directed and produced multiple short films that have been broadcast and distributed internationally. Her first short, \"Whacked\" enjoyed the festival circuit and was then picked up for distribution by Hypnotic Films where they were able to place it on HBO Latin America, CBC, and others. It was also included in a DVD compilation of shorts, \"Look In My Shorts.\" Her short film, Argentoesque, made as an homage to Dario Argento, was awarded at the Made In Italy Film Festival in Castel Di Sangro. Her short \"Il Controllore\" (The Ticket Taker\") showed at the \"Salon de Refusee\" at the Milano Film Festival. Because of her extensive interest in tools and building, she hosted the History Channel's \"Toolbox\" and co-created and wrote the pilot for a show for HGTV, \"Do-It-Herself,\" hosted by 2 handywomen. She has also created and produced numerous spec pilots including \"Butter Face,\" starring Fortune Feimster, which can be found on Funny or Die and Vimeo. In 2015, Sirena directed a play ,\"The Exit Interview,\" written by William Missouri Downs, for Los Angeles' Buzzworks Theater Co. From that success she has been named Artistic Director of Buzzworks, a post she will assume in January of 2017.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MTU3MDA2N15BMl5BanBnXkFtZTgwMzI3ODM5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0410451","name":"Sirena Irwin","idIMDB":"nm0410451"},"actorId":"nm0410451","character":"Beverly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zoe 'Joshua Tree' Logan","urlProfile":"http://www.imdb.com/name/nm0991797","urlPhoto":"","biography":{"bio":"Zoe 'Joshua Tree' Logan is an actor and director, known for The Trip (2002), Awakening Joshua (2002) and Circuit (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0991797","name":"Zoe 'Joshua Tree' Logan","idIMDB":"nm0991797"},"actorId":"nm0991797","character":"1973 Jogger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jill St. John","urlProfile":"http://www.imdb.com/name/nm0001762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAwMDEzODQzOV5BMl5BanBnXkFtZTcwODc4NTMzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1940","placeOfBirth":" Los Angeles, California, USA","birthName":"Jill Arlyn Oppenheim","height":"5' 6\" (1.68 m)","bio":"An incredible piece of 1960s eye candy, Jill St. John absolutely smoldered on the big screen, a trendy, cosmopolitan presence in lightweight comedy, spirited adventure and spy intrigue who appeared alongside some of Hollywood's most handsome male specimens. Although she was seldom called upon to do much more than frolic in the sun and/or playfully taunt and tempt her leading man as needed, this tangerine-topped stunner managed to do her job very, very well. A remarkably bright woman in real life, she was smart enough to play the Hollywood game to her advantage and did so for nearly two decades before looking elsewhere for fun and contentment. Jill St. John was born Jill Arlyn Oppenheim on August 19, 1940, in Los Angeles, California, to Betty (Goldberg) and Edward Lou Oppenheim, a restaurant owner. Her father was of German Jewish descent, and her maternal grandparents were Jewish immigrants from Ukraine and Romania. Jill was on stage and radio from age five, prodded by a typical stage mother. Making her TV debut in a production of \"A Christmas Carol,\" Jill began blossoming and attracting the right kind of attention in her late teens. She signed with Universal Pictures at age 16 and made her movie debut in Summer Love (1957) starring then-hot John Saxon. Moving ahead, she filled the bill as an exuberant, slightly dingy teen and as well as shapely love interest in such innocuous but fun films as The Remarkable Mr. Pennypacker (1959) and Holiday for Lovers (1959), Who's Been Sleeping in My Bed? (1963), Un chef de rayon explosif (1963) and Honeymoon Hotel (1964). Whether the extremely photogenic Jill had talent (and she did!) or not never seemed to be a fundamental issue with casting agents. By the late 1960s she had matured into a classy, ravishing redhead equipped with a knockout figure and sly, suggestive one-liners that had her male co-stars (and audiences) panting for more. She skillfully traded sexy quips with Anthony Franciosa in the engaging TV pilot to the hit series The Name of the Game (1968) and scored a major coup as tantalizing \"Bond girl\" Tiffany Case in Diamonds Are Forever (1971) opposite Sean Connery's popular \"007\" character. She also co-starred with Bob Hope in the dismal Eight on the Lam (1967), but the connection allowed her to be included in a number of the comedian's NBC specials over the years. A part of Frank Sinatra's \"in\" crowd, she co-starred with him in both Come Blow Your Horn (1963) and Tony Rome (1967). On camera, Jill's glossy, jet-setting femme fatales had a delightful tongue-in-cheek quality to them. Off-camera, she lived the life of a jet-setter too and was known for her various romantic excursions with such eligibles as Sinatra and even Henry Kissinger. Of her four marriages (she never had children), which included millionaire Neil Dublin, the late sports car racer Lance Reventlow, son of Woolworth heiress Barbara Hutton, and popular easy-listening crooner Jack Jones, she found her soul mate in her fourth husband, actor Robert Wagner, whom she married in 1990 following an eight-year courtship. Jill worked with Wagner decades before in the soapy drama Banning (1967) as well as the TV movie How I Spent My Summer Vacation (1967). Abandoning acting out of boredom, she has returned only on rare occasions. She played against type as a crazed warden in the prison drama The Concrete Jungle (1982) and has had some fun cameos alongside Wagner both on film (The Player (1992)) and even TV (Seinfeld (1989)). In the late 1990s they started touring together in A.R. Gurney's popular two-person stage reading of \"Love Letters.\" Jill's lifelong passion for cooking (her parents were restaurateurs) has turned profitable over the years. She has written several cookbooks and actually appeared as a TV chef and \"in-house\" cooking expert on morning TV (Good Morning America (1975)). She also served as a food columnist for the \"USA Weekend\" newspaper. She was glimpsed more recently in the films The Calling (2002) and The Trip (2002) and she and Wagner had small roles as Santa and Mrs. Claus in the TV movie Northpole (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAwMDEzODQzOV5BMl5BanBnXkFtZTcwODc4NTMzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001762","name":"Jill St. John","nicknames":["Magic"],"idIMDB":"nm0001762"},"actorId":"nm0001762","character":"Mary Oakley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Art Hindle","urlProfile":"http://www.imdb.com/name/nm0385543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDkxMzA1NV5BMl5BanBnXkFtZTcwNDg3Mjg0NA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1948","placeOfBirth":" Halifax, Nova Scotia, Canada","height":"5' 10\" (1.78 m)","bio":"Born in Halifax to a Royal Canadian Navy father, Art's mother soon had him back in their home town of Toronto, Ontario. He grew up in the \"Beaches\" of Toronto a big fan of Elvis Presley and rock n' roll. Although shy as a child, he grew to be a rebellious and independent teenager. This lead him to much traveling, mostly by hitch-hiking, picking up odd jobs, meeting all sorts of people from red-necks to freedom marchers to surfers and everyone in between. By the time he was 21, he was a father, a stockbroker and an amateur photographer. A much admired uncle of Art's was Michael Caine, a talented and successful actor. This had piqued Art's interest in acting during his teens. Although fairly successful himself, as a broker, he basically felt unfulfilled and eventually, after being inspired and touched by a Toronto Workshop Productions play, he made the commitment to leave the stock market for theatre. Although he worked, basically, as an unglorified gofer for a few months with TWP, eventually he got an acting agent, mostly with a false resume, and started auditioning mostly for commercials. It was at this time that Art credits a discovery that changed his future. Someone, he can't remember who, directed him to the Eli Rill Workshop. Eli had moved to Toronto from New York, where he taught at the Actor's Studio. Kind, gentle and articulate, Eli lucidly communicated techniques and explorations of the Method. Art thrived in this environment and soon started applying his knowledge to getting acting jobs. His first big role was in a biker movie, The Proud Rider (1971), spawned by the popularity of Easy Rider (1969). Art actually worked with a real motorcycle gang, the Satan's Choice. It was during the making of this rather bad movie that Art almost changed his professional name to Jeremy Kane. The producers thought that Art should have a more \"show biz\" name and took his photo to a girls school and asked the students to suggest first names and last names. They then took these names to Art and asked him to pick one of each. He liked the name Jeremy and chose Caine in honor of his uncle. The first person he called was his uncle Michael. Michael told him in no uncertain terms to stick to his own name. Art did so, but the other name is still connected to the film. The other anecdote was when the producers asked Art if he could ride a \"bike,\" he took them \"literally\" and said he could, but that when it came to motorcycles his brother Lang Hindle was much better, being a champion road racer. Cast for the part late on a Thursday, Art had to learn to ride a motorcycle by Monday morning. The next big step was being cast as Billy Duke, the best hockey player in the world, drafted by the Maple Leafs to lead them back to the playoffs in the film Winter Comes Early (1971), Canada's first million-dollar movie. This film led to offers from Hollywood, which he resisted until work dried up and Art, who had 4 children by this time, finally moved to Los Angeles. Art credits much of his success in California to luck. He felt he was lucky having Patricia McQueeney as his manager and a dynamic pair of agents in Arnold Rifkin and Nichole David. Over the years Art has come to be known as a \"working actor\" involved as a leading actor in some \"classic\" films and numerous pilots and series. His work in ENG, one Canada's most successful series, won him a Acting Gemini and his Pete Braga in Bienvenue à Paradise Falls (2001) has been described as a \"classic performance\" although Art credits brilliant writing for all the plaudits. Also, in the early 1990s, Art added the credit Director to his impressive resume. He and his beautiful wife, Brooke now split time between California, Florida and Canada spending time with their much beloved children, all 8 of them, and their 6 grandchildren. Lucky? Indeed!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDkxMzA1NV5BMl5BanBnXkFtZTcwNDg3Mjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385543","name":"Art Hindle","idIMDB":"nm0385543"},"actorId":"nm0385543","character":"Ted Oakley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christina Hempstead","urlProfile":"http://www.imdb.com/name/nm0606436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDM0OTU3Ml5BMl5BanBnXkFtZTcwNDc2MDkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Christina Morris","bio":"Christina Hempstead was born as Christina Morris. She is an actress, known for The Trip (2002), The Kiss (2004) and Illicit Dreams 2 (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDM0OTU3Ml5BMl5BanBnXkFtZTcwNDc2MDkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0606436","name":"Christina Hempstead","idIMDB":"nm0606436"},"actorId":"nm0606436","character":"TV Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julie Brown","urlProfile":"http://www.imdb.com/name/nm0113935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjcwMjUxNV5BMl5BanBnXkFtZTYwNDU5Mjg3._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1954","placeOfBirth":" Van Nuys, California, USA","birthName":"Julie Ann Brown","height":"5' 3\" (1.6 m)","bio":"Julie Brown was born on August 31, 1954 in Van Nuys, California, USA as Julie Ann Brown. She is an actress and producer, known for Earth Girls Are Easy (1988), Camp Rock (2008) and Clueless (1995). She was previously married to Ken Rathjen and Terrence E. McNally.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjcwMjUxNV5BMl5BanBnXkFtZTYwNDU5Mjg3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0113935","name":"Julie Brown","nicknames":["Goddess","\"West Coast\" Julie Brown"],"idIMDB":"nm0113935"},"actorId":"nm0113935","character":"OutLoud Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Mixner","urlProfile":"http://www.imdb.com/name/nm0990554","urlPhoto":"","biography":{"bio":"David Mixner is a writer, known for The Trip (2002), Dunes of Overveen (2018) and Illegal Love (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0990554","name":"David Mixner","idIMDB":"nm0990554"},"actorId":"nm0990554","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alfred Dennis","urlProfile":"http://www.imdb.com/name/nm0219410","urlPhoto":"","biography":{"dateOfBirth":"26 December 1922","placeOfBirth":" USA","bio":"Alfred Dennis was born on December 26, 1922 in the USA. He is an actor, known for Catch Me If You Can (2002), Bruce Almighty (2003) and Get Shorty (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0219410","name":"Alfred Dennis","idIMDB":"nm0219410"},"actorId":"nm0219410","character":"George Baxter","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0250067","urlIMDB":"http://www.imdb.com/title/tt0250067","business":{"budget":null,"openingWeekend":[{"money":"$13,774","country":"USA","day":"11","month":"05","year":"2003","remarks":"1 Screen"}],"gross":[{"money":"$110,677","country":"USA","day":"08","month":"06","year":"2003","remarks":""},{"money":"$72,861","country":"USA","day":"01","month":"06","year":"2003","remarks":""},{"money":"$52,257","country":"USA","day":"26","month":"05","year":"2003","remarks":""},{"money":"$29,536","country":"USA","day":"18","month":"05","year":"2003","remarks":""},{"money":"$13,774","country":"USA","day":"11","month":"05","year":"2003","remarks":""},{"money":"$300,000","country":"USA","day":"01","month":"05","year":"2003","remarks":""}],"weekendGross":[{"money":"$30,852","country":"USA","day":"08","month":"06","year":"2003","remarks":"7 Screens"},{"money":"$16,539","country":"USA","day":"01","month":"06","year":"2003","remarks":"4 Screens"},{"money":"$18,339","country":"USA","day":"26","month":"05","year":"2003","remarks":"3 Screens"},{"money":"$8,729","country":"USA","day":"18","month":"05","year":"2003","remarks":"1 Screen"},{"money":"$13,774","country":"USA","day":"11","month":"05","year":"2003","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","metascore":"47","filmingLocations":[{"location":"Antelope Valley, California, USA"}],"rated":"R","awards":[{"award":"Dallas OUT TAKES 2002","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"","names":[{"name":"Miles Swain","id":"nm0841504","role":null}]}]},{"titleAwardOutcome":"Won Best Actor","categories":[{"category":"","names":[{"name":"Larry Sullivan","id":"nm0837942","role":null}]}]}]},{"award":"Rehoboth Beach Independent Film Festival 2002","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Best Debut Film","names":[{"name":"Miles Swain","id":"nm0841504","role":null}]}]}]},{"award":"Torino International Gay & Lesbian Film Festival 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Best Feature Film","categories":[{"category":"","names":[{"name":"Miles Swain","id":"nm0841504","role":null}]}]}]}],"votes":"3,366","type":"Movie","companyCreditsSimple":[{"idCompany":"co0009299","name":"Falcon Lair Films"},{"idCompany":"co0431144","name":"Queens Pictures"}],"keywords":{"keywords":["book","break up","reference to spiro agnew","dancing on the roof of a car","repression","apology","boyfriend boyfriend relationship","death of loved one","crying","terminal illness","death","hugging","driving","car","petition","reference to richard nixon","marijuana","illness","reference to anita bryant","year 1977","telephone call","homophobia","lawyer","contract","sleeping on a couch","gay slur","jogging","young republican","griffith park los angeles","los angeles california","california","boyfriend girlfriend relationship","writer","author","homosexuality","repressed homosexual","sexual repression","year 1984","kiss","typewriter","dancing","newspaper","year 1973","1970s","gay republican","gay kiss","gay relationship","gay","reference to the young republicans","reference to judy garland","road movie","gay 70s","road trip","1980s","robbery","first gay sexual experience","drugs","mexico","republican","coming out","closeted homosexual","cannabis"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:22:42"}}