{"data":{"movies":[{"title":"The Deep End","originalTitle":"","year":"2001","releaseDate":"20010831","directors":[{"name":"Scott McGehee","id":"nm0569166"},{"name":"David Siegel","id":"nm0796915"}],"writers":[{"name":"Elisabeth Sanxay Holding","id":"nm0390357"},{"name":"Scott McGehee","id":"nm0569166"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjBiZDJjMDItMGMyYy00MTU5LTkxNzUtZWY5ZGNmYWYxOGQ3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Mystery","Romance","Thriller"],"plot":"With her husband perpetually away at work, a mother raises her children virtually alone. Her teenage son is testing the waters of the adult world, and early one morning she wakes to find the dead body of his gay lover on the beach of their rural lakeside home. What would you do? What is rational and what do you do to protect your child? How far do you go and when do you stop?","simplePlot":"A woman spirals out of control while trying to keep her son from being found culpable in a murder investigation.","actors":[{"actorName":"Tilda Swinton","urlProfile":"http://www.imdb.com/name/nm0842770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzMzMTkwNV5BMl5BanBnXkFtZTcwMzU4MDg1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1960","placeOfBirth":" London, England, UK","birthName":"Katherine Matilda Swinton","height":"5' 10½\" (1.79 m)","bio":"The iconoclastic gifts of the visually striking and fiercely talented actress Tilda Swinton have been appreciated by a more international audience of late. She was born Katherine Mathilda Swinton on November 5, 1960, in London, England. Her mother, Judith Balfour, Lady Swinton (née Killen), was Australian, and her father, Major-General Sir John Swinton, an army officer, was English-born. Her ancestry is Scottish, Northern Irish, and English, including a long tapestry of prominent Scottish ancestors. Born into a patrician military family, she was educated at an English and a Scottish boarding school. Tilda subsequently studied Social and Political Science at Cambridge University and graduated in 1983 with a degree in English Literature. During her time as a student, she performed countless stage productions and proceeded to work for a season in the Royal Shakespeare Company. A decided rebel when it came to the arts, she left the company after a year as her approach shifted dramatically: With a taste for the unique and bizarre, she found some genuinely interesting gender-bending roles come her way, such as the composer Mozart in Pushkin's \"Mozart and Salieri\", and as a working class woman impersonating her dead husband during World War II, in Karges' Screenplay: Man to Man: Another Night of Rubbish on the Telly (1992). In 1985 the pale-skinned, carrot-topped actress began a professional association with gay experimental director Derek Jarman. She continued to live and work with Jarman for the next nine years, developing seven critically acclaimed films. Their alliance would produce stark turns, such as turner-prize nominated Caravaggio (1986), The Last of England (1987), The Garden (1990), Edward II (1991), and Wittgenstein (1993). Jarman succumbed to complications from AIDS in 1994. His untimely demise left a devastating void in Tilda's life for quite some time. Her most notable performance of that period however comes from a non-Jarman film: For the title role in Orlando (1992), her nobleman character lives for 400 years while changing sex from man to woman. The film, which Swinton spent years helping writer/director Sally Potter develop and finance, continues to this day to have a worldwide devoted fan following. Over the years she has preferred art to celebrity, opening herself to experimental projects with new and untried directors and mediums, delving into the worlds of installation art and cutting-edge fashion. Consistently off-centered roles in Female Perversions (1996), Love Is the Devil: Study for a Portrait of Francis Bacon (1998), Teknolust (2002), Young Adam (2003), Broken Flowers (2005) and Béla Tarr's L'homme de Londres (2007) have only added to her mystique. Hollywood too has picked up on this notoriety and, since the birth of her twins in 1997, she has successfully moved between the deep-left-field art-house and quality Hollywood blockbusters. The thriller The Deep End (2001), earned her a number of critic's awards and her first Golden Globe nomination. Such mainstream U.S. pictures as The Beach (2000) with Leonardo DiCaprio, fantasy epic Constantine (2005) with Keanu Reeves, her Oscar-decorated performance in Michael Clayton (2007) alongside George Clooney and of course her iconic White Witch in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005) have cemented her place as one of cinema's most outstanding women. She then starred in the crime drama Julia (2008); in David Fincher's The Curious Case of Benjamin Button (2008); learned Italian and Russian for Luca Guadagnino's Amore (2009); starred in the psychological thriller We Need to Talk About Kevin (2011); in Wes Anderson's Moonrise Kingdom (2012); in Joon-ho Bong's Snowpiercer - le transperceneige (2013) and in Terry Gilliam's The Zero Theorem (2013). Swinton later starred in the dark romantic fantasy drama, Only Lovers Left Alive (2013) directed by Jim Jarmusch and had a small role in Wes Anderson's The Grand Budapest Hotel (2014). In 2015, Swinton starred in Judd Apatow's comedy Crazy Amy (2015), and played a Rock star in Luca Guadagnino's A Bigger Splash (2015), starring opposite Matthias Schoenaerts and Ralph Fiennes. In 2016, she starred in Joel & Ethan Coen's Hail, Caesar! (2016). Swinton has been confirmed in Luca Guadagnino's Suspiria (2017), a remake of Dario Argento's 1977 film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzMzMTkwNV5BMl5BanBnXkFtZTcwMzU4MDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0842770","name":"Tilda Swinton","nicknames":["Swilda"],"idIMDB":"nm0842770"},"actorId":"nm0842770","character":"Margaret Hall","urlCharacter":"http://www.imdb.com/character/ch0021096","main":true},{"actorName":"Goran Visnjic","urlProfile":"http://www.imdb.com/name/nm0899681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk1ODI0Nzc0NF5BMl5BanBnXkFtZTcwMzQzNDczNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1972","placeOfBirth":" Sibenik, Croatia, Yugoslavia","height":"6' 4\" (1.93 m)","bio":"Goran Visnjic is a Croatian American actor and producer, born in Sibenik, Croatia, Yugoslavia. He is married to Eva Visnjic (formerly Ivana Vrdoljak) with whom has three children. From an early age Visnjic started appearing in various theater plays. At the age of 16, he had his screen debut in the film Braca po materi (1988) In 1990, when the dissolution of Yugoslavia began, Visnjic was serving a one-year military obligation in the Yugoslavian Army (JNA). He left the JNA and returned to Sibenik, where he joined the Croatian Army in the defense of his hometown. After leaving the army, he moved to Zagreb and enrolled at the Academy of Dramatic Art. In his second year of studies at the academy, Visnjic was chosen for the title role in Shakespeare's Hamlet, which made him the youngest actor to play that role. Prior to ER (1994), Visnjic played several minor roles in the films like The Peacemaker (1997), Welcome to Sarajevo (1997) and Practical Magic (1998). In 1998, he appeared in Madonna's music video for the song \"The Power of Goodbye\", which opened him the doors of Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk1ODI0Nzc0NF5BMl5BanBnXkFtZTcwMzQzNDczNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0899681","name":"Goran Visnjic","nicknames":["Sime"],"idIMDB":"nm0899681"},"actorId":"nm0899681","character":"Alek 'Al' Spera","urlCharacter":"http://www.imdb.com/character/ch0021097","main":true},{"actorName":"Jonathan Tucker","urlProfile":"http://www.imdb.com/name/nm0006958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTk0MDc5Ml5BMl5BanBnXkFtZTcwMDcwMzA2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1982","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Jonathan Moss Tucker","height":"5' 10\" (1.78 m)","bio":"Jonathan is a film and television actor born in Boston, Massachusetts, May 31, 1982. While still in third grade, he was a part of a ballet production of \"The Nutcracker.\" After High School he earned admittance to Columbia University in New York City, but instead elected to pursue his acting career. His first credited appearances were in The Night Before Christmas (1994) (original title \"Botte di Natale\" and a.k.a. \"The Troublemakers\"), as Moses Junior and Two If by Sea (1996), as Todd.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTk0MDc5Ml5BMl5BanBnXkFtZTcwMDcwMzA2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006958","name":"Jonathan Tucker","nicknames":["Tuck","Moss"],"idIMDB":"nm0006958"},"actorId":"nm0006958","character":"Beau Hall","urlCharacter":"http://www.imdb.com/character/ch0159884","main":true},{"actorName":"Peter Donat","urlProfile":"http://www.imdb.com/name/nm0232194","urlPhoto":"","biography":{"dateOfBirth":"20 January 1928","placeOfBirth":" Kentville, Nova Scotia, Canada","birthName":"Pierre Collingwood Donat","bio":"The Cando-American actor Peter Donat had a 50-year-long career in TV, motion pictures and theater. So respected was Donat, that Francis Ford Coppola considered casting him in the role of Tom Hagen in The Godfather (1972) that went to Robert Duvall. The nephew of Oscar-winning actor Robert Donat, Peter was born Pierre Collingwood Donat on January 20, 1928 in Kentville, Nova Scotia. His father, landscape gardener Philip Donat, was Anglo-Canadian while his Marie (née Bardet) was French-Canadian. In 1950, the 22-year-old Donat moved to the United States to study drama at Yale. (He is a naturalized U.S. citizen.) Donat frequently returned to Canada for acting work, appearing in the lead in a 1961 production of Donald Jack's play \"The Canvas Barricade\" at the Stratford Festival. He was also in the Canadian TV serial Moment of Truth (1964), which was broadcast on a commercial TV in the States. Peter Donat was married for 16 years to Emmy-winner Michael Learned. The couple, who divorced in 1972, had three children. when they divorced. They have three children - Caleb, Christopher and Lucas.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0232194","name":"Peter Donat","idIMDB":"nm0232194"},"actorId":"nm0232194","character":"Jack Hall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Lucas","urlProfile":"http://www.imdb.com/name/nm0524197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkzOTAzMV5BMl5BanBnXkFtZTcwMTE3Mjc4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1971","placeOfBirth":" Fayetteville, Arkansas, USA","birthName":"Joshua Lucas Easy Dent Maurer","height":"5' 11½\" (1.82 m)","bio":"Josh Lucas was born in Little Rock, Arkansas, to Michele (LeFevre), a nurse midwife, and Don Maurer, an ER doctor. Lucas' film career began by accident in 1979 when a small Canadian film production shot on the tiny coastal South Carolina Island, Sullivan's Island, where Lucas and his family lived. Unbeknownst to the filmmakers, 8 year old Lucas was hiding in the sand dunes watching filming during the climatic scene where teenage lovers engage in a lovesick fight. It was during this experience that Lucas decided to pursue a career in film which he has now done for nearly 3 decades. Born to young radical politically active parents in Arkansas in 1971, Lucas spent his early childhood nomadically moving around the southern U.S. The family finally settled in Gig Harbor, Washington, where Lucas attended high school. The school had an award winning drama/debate program and Lucas won the State Championship in Dramatic Interpretation and competed at the 1989 National Championship. Brief stints in professional theater in Seattle followed before Lucas moved to Los Angeles. After receiving breaks playing a young George Armstrong Custer in the Steven Spielberg produced Class of '61 (1993) and Frank Marshall's film Alive (1993), Lucas' career toiled in minor TV appearances. Frustrated, he decided to start over and relocated to New York City. In NYC, Lucas studied acting for years under Suzanne Shepherd and worked in smaller theater productions like Shakespeare in the Parking Lot before receiving another break in 1997 when he was cast as Judas in Terrence McNally's controversial off-Broadway production Corpus Christi. The play led to his being cast in the films You Can Count on Me (2000) and American Psycho (2000). These films were followed by interesting performances in the Oscar-winning A Beautiful Mind (2001) and the box office hit Sweet Home Alabama (2002). Lucas has since worked with many of the film community's greatest talents. He starred alongside Jon Voight in Jerry Bruckheimer's Glory Road (2006), for which Lucas added 40 pounds to transform himself into legendary basketball coach Don Haskins. Lucas also starred with Kurt Russell and Richard Dreyfuss in Wolfgang Petersen's Poseidon (2006). He starred with Morgan Freeman and Robert Redford in Lasse Hallström's An Unfinished Life (2005). He also starred opposite Jamie Bell in David Gordon Green's Undertow (2004), which was also produced by Terrence Malick. Additionally, Lucas worked alongside Christopher Walken in Around the Bend (2004). He performed with Jennifer Connelly and Eric Bana in Ang Lee's Hulk (2003). Other credits include Wonderland (2003), The Deep End (2001), American Psycho (2000), Session 9 (2001) and You Can Count on Me (2000). Lucas' theater credits include the off-Broadway run of \"Spalding Gray: Stories Left to Tell\"; Tennessee Williams' \"The Glass Menagerie\", which appeared on Broadway in 2005; Terrence McNally's \"Corpus Christi\" at the Manhattan Theater Club; Christopher Shinn's \"What Didn't Happen\"; and \"The Picture of Dorian Gray\". Lucas has always been fascinated by documentaries and performed voice work with film legend Ken Burns on the documentary The War (2007), and also provided voice-over work for Operation Homecoming: Writing the Wartime Experience (2007), Trumbo (2007) and Resolved (2007). Lucas' first venture into production was Stolen (2009), in which he played the single father of a mentally challenged boy. The film was the first project to be produced through Lucas' production company, \"Two Bridges\". In the past few years, Lucas' films include The Lincoln Lawyer (2011), Daydream Nation (2010), Peacock (2010), as Charles Lindbergh in Clint Eastwood's film J. Edgar (2011), and the massive Australian box office and critical success Red Dog (2011), for which Lucas won Australia's best actor award (The I.F. Award). He also played Beat generation legend Neal Cassady in Big Sur (2013). He can be seen in Kevin Connolly's Dear Eleanor (2016), the upcoming Sundance festival film Little Accidents and the NY indie film The Mend.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkzOTAzMV5BMl5BanBnXkFtZTcwMTE3Mjc4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0524197","name":"Josh Lucas","idIMDB":"nm0524197"},"actorId":"nm0524197","character":"Darby Reese","urlCharacter":"http://www.imdb.com/character/ch0166651","main":true},{"actorName":"Raymond J. Barry","urlProfile":"http://www.imdb.com/name/nm0000855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNTc2MzAzNzdeQTJeQWpwZ15BbWU3MDkxNDQ4MDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1939","placeOfBirth":" Hempstead, Long Island, New York, USA","height":"6' 0½\" (1.84 m)","bio":"Raymond J. Barry was born in New York, and attended Brown University, where he was a star athlete in football, basketball, and track. While there, he earned his degree in Philosophy and as a senior, was cast in the stage production of \"Picnic,\" where he played a football player. He then entered the Yale Drama School and after completing, acted in the Broadway play \"The Leaf People.\" He has appeared in over 100 plays and has starred in such films as Dead Man Walking (1995), Sudden Death (1995), and The Chamber (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNTc2MzAzNzdeQTJeQWpwZ15BbWU3MDkxNDQ4MDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000855","name":"Raymond J. Barry","idIMDB":"nm0000855"},"actorId":"nm0000855","character":"Carlie Nagel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tamara Hope","urlProfile":"http://www.imdb.com/name/nm0394045","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzcxNDQxMl5BMl5BanBnXkFtZTcwMzgwODgyMQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1984","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 4\" (1.63 m)","bio":"Tamara Hope was born on November 2, 1984 in Toronto, Ontario, Canada. She is an actress, known for Crimson Peak (2015), Shall We Dance (2004) and The Deep End (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzcxNDQxMl5BMl5BanBnXkFtZTcwMzgwODgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0394045","name":"Tamara Hope","idIMDB":"nm0394045"},"actorId":"nm0394045","character":"Paige Hall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jordon Dorrance","urlProfile":"http://www.imdb.com/name/nm0234047","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTE3ODk0OV5BMl5BanBnXkFtZTcwMzk4NTAzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1991","placeOfBirth":" California, USA","bio":"Jordon Dorrance was born on August 28, 1991 in California, USA. He is an actor, known for The Deep End (2001) and Down the P.C.H. (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTE3ODk0OV5BMl5BanBnXkFtZTcwMzk4NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234047","name":"Jordon Dorrance","idIMDB":"nm0234047"},"actorId":"nm0234047","character":"Dylan Hall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heather Mathieson","urlProfile":"http://www.imdb.com/name/nm0558819","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzIxMzEzNV5BMl5BanBnXkFtZTcwNzI3MTQ3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Heather Mathieson is an actress, known for Bandits (2001), The Five-Year Engagement (2012) and The Deep End (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzIxMzEzNV5BMl5BanBnXkFtZTcwNzI3MTQ3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0558819","name":"Heather Mathieson","idIMDB":"nm0558819"},"actorId":"nm0558819","character":"Sue Lloyd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Holmes Osborne","urlProfile":"http://www.imdb.com/name/nm0651660","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzA5Nzg0Ml5BMl5BanBnXkFtZTcwNzEzODI2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1947","placeOfBirth":" Kansas City, Missouri, USA","bio":"Holmes Osborne was born on November 7, 1947 in Kansas City, Missouri, USA. He is an actor, known for That Thing You Do! (1996), Affliction (1997) and Donnie Darko (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzA5Nzg0Ml5BMl5BanBnXkFtZTcwNzEzODI2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651660","name":"Holmes Osborne","idIMDB":"nm0651660"},"actorId":"nm0651660","character":"Loan Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Gross","urlProfile":"http://www.imdb.com/name/nm0343478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQwNjQ3NjQ5NF5BMl5BanBnXkFtZTcwNDQ5Mzg4Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Richard was born in Pittsburgh, PA . His mother was a Welsh immigrant and his adoptive father was a native of Pittsburgh. Richard moved to Los Angeles with his family in the 60's and he graduated from Lennox High School. Richard went on to earn his BA in Theatre Arts from Cal State Dominguez Hills. He moved his family to Grass Valley, CA in 1979 and was active with the Foothill Theatre Company, a regional theatre in Nevada City. Richard came back to Los Angeles in 1991 to resume his TV/Film career. He still maintains his Northern California residence with his wife, Judy and their daughter Alexis. Richard and Judy have two other sons, Matthew and Justin.Richard is an 8 handicap golfer and club champion in 2011. He played softball and golf in the world senior games and won a Gold medal.He did over 70 skits on The Tonight with Jay Leno.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQwNjQ3NjQ5NF5BMl5BanBnXkFtZTcwNDQ5Mzg4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0343478","name":"Richard Gross","idIMDB":"nm0343478"},"actorId":"nm0343478","character":"Deputy Sheriff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kip Martin","urlProfile":"http://www.imdb.com/name/nm0552638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTMwNjc3N15BMl5BanBnXkFtZTcwNDQwMDMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Kip Martin is originally from Northern Virginia in the suburbs of Washington, D.C. He has appeared as a guest star on several TV shows, as well as prominent independent films such as The Deep End (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTMwNjc3N15BMl5BanBnXkFtZTcwNDQwMDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0552638","name":"Kip Martin","idIMDB":"nm0552638"},"actorId":"nm0552638","character":"BYD","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frankie Loyal Delgado","urlProfile":"http://www.imdb.com/name/nm1035291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmZjMjk1Y2EtZDVkMS00ZmFjLTk3ZTEtZmU2NDg0ZmJhMDc4XkEyXkFqcGdeQXVyMzMxMDc5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1969","placeOfBirth":" San Francisco, California, USA","height":"6' 1\" (1.85 m)","bio":"Frankie Loyal Delgado was born on December 23, 1969 in San Francisco, California, USA. He is an actor, known for The Deep End (2001), Quinceañera (2006) and Paloma (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmZjMjk1Y2EtZDVkMS00ZmFjLTk3ZTEtZmU2NDg0ZmJhMDc4XkEyXkFqcGdeQXVyMzMxMDc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1035291","name":"Frankie Loyal Delgado","nicknames":["Frankie Loyal"],"idIMDB":"nm1035291"},"actorId":"nm1035291","character":"Barrish Brother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kip Ellwood","urlProfile":"http://www.imdb.com/name/nm1029261","urlPhoto":"","biography":{"birthName":"Rudyard Kipling Ellwood","bio":"Kip Ellwood was born as Rudyard Kipling Ellwood. He is known for his work on The Deep End (2001), Criminal Minds (1998) and Searching for Wooden Watermelons (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1029261","name":"Kip Ellwood","idIMDB":"nm1029261"},"actorId":"nm1029261","character":"Male Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margot Krindel","urlProfile":"http://www.imdb.com/name/nm0471346","urlPhoto":"","biography":{"bio":"Margot Krindel is an actress, known for The Deep End (2001) and The Runaway (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0471346","name":"Margot Krindel","idIMDB":"nm0471346"},"actorId":"nm0471346","character":"Amber Lloyd","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0250323","urlIMDB":"http://www.imdb.com/title/tt0250323","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$141,852","country":"USA","day":"12","month":"08","year":"2001","remarks":"6 Screens"},{"money":"£68,988","country":"UK","day":"16","month":"12","year":"2001","remarks":"51 Screens"}],"gross":[{"money":"$8,821,782","country":"USA","day":"23","month":"12","year":"2001","remarks":""},{"money":"$8,818,593","country":"USA","day":"16","month":"12","year":"2001","remarks":""},{"money":"$8,814,048","country":"USA","day":"09","month":"12","year":"2001","remarks":""},{"money":"$8,809,941","country":"USA","day":"02","month":"12","year":"2001","remarks":""},{"money":"$8,806,628","country":"USA","day":"25","month":"11","year":"2001","remarks":""},{"money":"$8,800,737","country":"USA","day":"18","month":"11","year":"2001","remarks":""},{"money":"$8,788,631","country":"USA","day":"11","month":"11","year":"2001","remarks":""},{"money":"$8,771,127","country":"USA","day":"04","month":"11","year":"2001","remarks":""},{"money":"$8,748,272","country":"USA","day":"28","month":"10","year":"2001","remarks":""},{"money":"$8,715,335","country":"USA","day":"21","month":"10","year":"2001","remarks":""},{"money":"$8,655,639","country":"USA","day":"14","month":"10","year":"2001","remarks":""},{"money":"$8,531,063","country":"USA","day":"07","month":"10","year":"2001","remarks":""},{"money":"$8,301,918","country":"USA","day":"30","month":"09","year":"2001","remarks":""},{"money":"$7,745,879","country":"USA","day":"23","month":"09","year":"2001","remarks":""},{"money":"$6,850,799","country":"USA","day":"16","month":"09","year":"2001","remarks":""},{"money":"$5,894,952","country":"USA","day":"09","month":"09","year":"2001","remarks":""},{"money":"$4,673,315","country":"USA","day":"02","month":"09","year":"2001","remarks":""},{"money":"$2,485,532","country":"USA","day":"26","month":"08","year":"2001","remarks":""},{"money":"$984,958","country":"USA","day":"19","month":"08","year":"2001","remarks":""},{"money":"$198,293","country":"USA","day":"12","month":"08","year":"2001","remarks":""},{"money":"£177,380","country":"UK","day":"30","month":"12","year":"2001","remarks":""},{"money":"£137,444","country":"UK","day":"23","month":"12","year":"2001","remarks":""},{"money":"£68,988","country":"UK","day":"16","month":"12","year":"2001","remarks":""},{"money":"€29,460","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"weekendGross":[{"money":"$1,839","country":"USA","day":"23","month":"12","year":"2001","remarks":"3 Screens"},{"money":"$2,811","country":"USA","day":"16","month":"12","year":"2001","remarks":"2 Screens"},{"money":"$2,553","country":"USA","day":"09","month":"12","year":"2001","remarks":"3 Screens"},{"money":"$2,106","country":"USA","day":"02","month":"12","year":"2001","remarks":"4 Screens"},{"money":"$3,248","country":"USA","day":"25","month":"11","year":"2001","remarks":"6 Screens"},{"money":"$7,112","country":"USA","day":"18","month":"11","year":"2001","remarks":"11 Screens"},{"money":"$10,011","country":"USA","day":"11","month":"11","year":"2001","remarks":"16 Screens"},{"money":"$15,471","country":"USA","day":"04","month":"11","year":"2001","remarks":"26 Screens"},{"money":"$17,230","country":"USA","day":"28","month":"10","year":"2001","remarks":"36 Screens"},{"money":"$34,978","country":"USA","day":"21","month":"10","year":"2001","remarks":"54 Screens"},{"money":"$71,458","country":"USA","day":"14","month":"10","year":"2001","remarks":"84 Screens"},{"money":"$133,581","country":"USA","day":"07","month":"10","year":"2001","remarks":"168 Screens"},{"money":"$321,115","country":"USA","day":"30","month":"09","year":"2001","remarks":"341 Screens"},{"money":"$659,788","country":"USA","day":"23","month":"09","year":"2001","remarks":"408 Screens"},{"money":"$749,774","country":"USA","day":"16","month":"09","year":"2001","remarks":"412 Screens"},{"money":"$966,088","country":"USA","day":"09","month":"09","year":"2001","remarks":"401 Screens"},{"money":"$1,758,366","country":"USA","day":"02","month":"09","year":"2001","remarks":"326 Screens"},{"money":"$1,150,619","country":"USA","day":"26","month":"08","year":"2001","remarks":"208 Screens"},{"money":"$641,051","country":"USA","day":"19","month":"08","year":"2001","remarks":"58 Screens"},{"money":"$141,852","country":"USA","day":"12","month":"08","year":"2001","remarks":"6 Screens"},{"money":"£28,373","country":"UK","day":"30","month":"12","year":"2001","remarks":"23 Screens"},{"money":"£30,254","country":"UK","day":"23","month":"12","year":"2001","remarks":"40 Screens"},{"money":"£68,988","country":"UK","day":"16","month":"12","year":"2001","remarks":"51 Screens"}],"admissions":[{"money":"7,380","country":"Brazil","day":"19","month":"05","year":"2002","remarks":"26 screens"},{"money":"9,201","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""},{"money":"4,468","country":"Netherlands","day":"31","month":"12","year":"2001","remarks":""},{"money":"3,576","country":"Norway","day":"28","month":"02","year":"2002","remarks":""},{"money":"7,390","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"05","year":"2000","remarks":null},{"money":null,"country":null,"day":"25","month":"06","year":"2000","remarks":null}],"copyrightHolder":"i5 Films LLC"},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Gold II, Panavision C- and E-Series Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":["2,820 m (Spain)"],"negativeFormat":["35 mm (Kodak Vision 320T 5277, Vision 500T 5279)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.7","metascore":"78","filmingLocations":[{"location":"Tahoma, California, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Motion Picture - Drama","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"Boston Society of Film Critics Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won BSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"Casting Society of America, USA 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Independent","names":[{"name":"Mindy Marin","id":"nm0547484","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"Chlotrudis Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Chlotrudis Award","categories":[{"category":"Best Actress","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"Dallas-Fort Worth Film Critics Association Awards 2002","titlesAwards":[{"titleAwardOutcome":"2nd place DFWFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"Deauville Film Festival 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Special Prize","categories":[{"category":"","names":[{"name":"Scott McGehee","id":"nm0569166","role":null}]}]}]},{"award":"Film Independent Spirit Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Female Lead","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]},{"category":"Best Cinematography","names":[{"name":"Giles Nuttgens","id":"nm0638365","role":null}]}]}]},{"award":"Ghent International Film Festival 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Prix","categories":[{"category":"","names":[{"name":"Scott McGehee","id":"nm0569166","role":null},{"name":"David Siegel","id":"nm0796915","role":null}]}]}]},{"award":"Las Vegas Film Critics Society Awards 2002","titlesAwards":[{"titleAwardOutcome":"Won Sierra Award","categories":[{"category":"Best Actress","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"National Board of Review, USA 2001","titlesAwards":[{"titleAwardOutcome":"Won Special Recognition","categories":[{"category":"","names":[]}]}]},{"award":"New York Film Critics Circle Awards 2001","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"Online Film Critics Society Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated OFCS Award","categories":[{"category":"Best Actress","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"Phoenix Film Critics Society Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Actress in a Leading Role","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]},{"award":"Satellite Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Performance by an Actress in a Motion Picture, Drama","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]},{"category":"Best Performance by an Actor in a Supporting Role, Drama","names":[{"name":"Goran Visnjic","id":"nm0899681","role":null}]},{"category":"Best Motion Picture, Drama","names":[]},{"category":"Best Director","names":[{"name":"Scott McGehee","id":"nm0569166","role":null},{"name":"David Siegel","id":"nm0796915","role":null}]}]}]},{"award":"Stockholm Film Festival 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Bronze Horse","categories":[{"category":"","names":[{"name":"Scott McGehee","id":"nm0569166","role":null},{"name":"David Siegel","id":"nm0796915","role":null}]}]}]},{"award":"Sundance Film Festival 2001","titlesAwards":[{"titleAwardOutcome":"Won Cinematography Award","categories":[{"category":"Dramatic","names":[{"name":"Giles Nuttgens","id":"nm0638365","role":null}]}]},{"titleAwardOutcome":"Nominated Grand Jury Prize","categories":[{"category":"Dramatic","names":[{"name":"Scott McGehee","id":"nm0569166","role":null},{"name":"David Siegel","id":"nm0796915","role":null}]}]}]},{"award":"Toronto Film Critics Association Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated TFCA Award","categories":[{"category":"Best Performance, Female","names":[{"name":"Tilda Swinton","id":"nm0842770","role":null}]}]}]}],"votes":"9,950","type":"Movie","companyCreditsSimple":[{"idCompany":"co0068212","name":"i5 Films"}],"keywords":{"keywords":["investigation","gay","dead body","murder investigation","water","murder","crying woman","male hits a female","male hits female","man hits woman","man hits a woman","man slaps woman","man slaps a woman","father in law","lap dissolve","vhs","neo noir","newspaper headline","see through bra","wound","wheelchair","wesleyan university","wedding ring","water cooler","underwater scene","u.s.s. constitution","trumpet player","telephone","telephone call","teenage boy","tears","tattoo","swimming pool","suspense","stabbing","slot machine","ring","recording studio","ransom","policeman","police car","phone booth","panties","nudity","mother love","mother daughter relationship","money","los angeles california","husband wife relationship","harrah's casino tahoe","handrail","handkerchief","grandfather grandson relationship","grandfather granddaughter relationship","friend","friendship","flashlight","flashback","fishing","female mechanic","father son relationship","father in law daughter in law relationship","family relationships","falling off a dock","face slap","drunkenness","drink","drinking","dock","dancer","crying","crossword puzzle","computer","cigarette smoking","car wash","cane","brother sister relationship","broken handrail","bribe","bra","bottled water","boat","bicycle","auto mechanic","arm wound","aquarium","absent husband","absent father","bare chested male","wet t shirt","swimming in underwear","nipples visible through clothing","gay son","death","melodrama","tahoe city california","swan lake ballet","reno nevada","police","pawnshop","homosexual","fight","false accusation","debt","anal sex","ambulance","boathouse","heart attack","underage drinking","car accident","cpr","evidence tampering","drunk driving","casino","trumpet","lake","motorboat","mother son relationship","ballet","blackmail","anchor","remorse","gay teenager","lake tahoe","remake","videotape","violence","cover up","independent film","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:27:29"}}