{"data":{"movies":[{"title":"Skipped Parts","originalTitle":"","year":"2000","releaseDate":"20011206","directors":[{"name":"Tamra Davis","id":"nm0205542"}],"writers":[{"name":"Tim Sandlin","id":"nm0762013"},{"name":"Tim Sandlin","id":"nm0762013"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NjUyMzY0Nl5BMl5BanBnXkFtZTcwNjQ5OTUxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"It's 1963. Poor little rich girl Lydia and her 14-year-old love-child Sam are banished from North Carolina while her powerful father runs for governor. They end up in Wyoming where she parties and Sam finds he's one of only two Grosvant High School students who read. Maurey is the other, a pre-pubescent girl wanting to discover what sex is about. She and Sam set out to learn with help from Lydia, who tells them it stops when Maurey has her first period. Trouble is, pregnancy comes first. In this small town, what can Maurey do, and will Sam have any say? Meantime, Hank Elkrunner, a Blackfoot, falls for the feckless Lydia, while her dictatorial dad keeps tabs on them all from afar.","simplePlot":"An ungrounded young mother and her thoughtful teenage son are banished to a remote provincial town by a domineering father.","actors":[{"actorName":"Drew Barrymore","urlProfile":"http://www.imdb.com/name/nm0000106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTMzODIxM15BMl5BanBnXkFtZTcwODM2NTY5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1975","placeOfBirth":" Culver City, California, USA","birthName":"Drew Blyth Barrymore","height":"5' 4\" (1.63 m)","bio":"Since melting audiences' hearts - at the age of six - in Steven Spielberg's beloved sci-fi blockbuster, E.T. the Extra-Terrestrial (1982), Drew Barrymore has emerged as one of the most endearing and talented actresses of her generation. Drew Blyth Barrymore was born in Culver City, California, to actors John Drew Barrymore and Jaid Barrymore (née Ildiko Jaid Mako). Her father came from a long showbusiness legacy, as the son of actors John Barrymore and Dolores Costello, while her mother was the daughter of Hungarian refugees. Despite a troubled and much-publicized adolescence, and a string of \"bad girl\" parts in lurid crime dramas such as Poison Ivy (1992), Barrymore's star was officially on the rise during the mid-1990s, with notable appearances in Boys on the Side (1995), Woody Allen's Everyone Says I Love You (1996), and the game-changing horror hit Scream (1996). An eclectic mix of high-profile and low-key film projects followed - such as The Wedding Singer (1998), Ever After: A Cinderella Story (1998), Never Been Kissed (1999), Charlie's Angels (2000), Donnie Darko (2001), Riding in Cars with Boys (2001) and Confessions of a Dangerous Mind (2002) - proving to once-cynical audiences that Barrymore was not only a capable leading lady, but also a gifted and versatile actor. Next came headlining parts in Duplex (2003), 50 First Dates (2004), Fever Pitch (2005), Music and Lyrics (2007), Lucky You (2007), He's Just Not That Into You (2009), and the much-lauded Grey Gardens (2009), for which she earned Golden Globe and Screen Actors Guild awards for her portrayal of Edith Bouvier Beale. In 2009, Barrymore - whose production company, Flower Films, has spawned several lucrative features - made her long-awaited directional debut with the comedy-drama Whip It (2009), emerging as \"a sensitive director who knows how and when to let an emotional moment linger on the screen\" (TIME). Alongside a recurring guest spot - as the voice of Jillian - on the cult animated series Family Guy (1999), recent acting roles have included Everybody's Fine (2009), Going the Distance (2010), Big Miracle (2012), Blended (2014), and Miss You Already (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTMzODIxM15BMl5BanBnXkFtZTcwODM2NTY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000106","name":"Drew Barrymore","nicknames":["D"],"idIMDB":"nm0000106"},"actorId":"nm0000106","character":"Fantasy Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Jason Leigh","urlProfile":"http://www.imdb.com/name/nm0000492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzU2NTg0Nl5BMl5BanBnXkFtZTcwMjcyNjY0MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1962","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Jennifer Lee Morrow","height":"5' 3\" (1.6 m)","bio":"Jennifer Jason Leigh was born Jennifer Lee Morrow in Los Angeles, California, the daughter of writer Barbara Turner and actor Vic Morrow. Her father was of Russian Jewish descent and her mother was of Austrian Jewish ancestry. She is the sister of Carrie Ann Morrow and half-sister of actress Mina Badie. Jennifer's parents divorced when she was two. Jennifer worked in her first film at the age of nine, in a nonspeaking role for the film Death of a Stranger (The Spy Who Never Was (1976)). At 14 she attended summer acting workshops given by Lee Strasberg and landed a role in the Disney TV movie Walt Disney's Wonderful World of Color: The Young Runaways (1978), and received her Screen Actors Guild membership in an episode of the TV series Baretta (1975) when she was 16. Jennifer performed in several TV movies and dropped out of Pacific Palisades High School six weeks short of graduation for her major role in the film Eyes of a Stranger (1981). Her first major success came as the female lead in Fast Times at Ridgemont High (1982). Jennifer was married to writer/director Noah Baumbach from 2005 to 2013, and the two have a son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzU2NTg0Nl5BMl5BanBnXkFtZTcwMjcyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000492","name":"Jennifer Jason Leigh","nicknames":["JJL"],"idIMDB":"nm0000492"},"actorId":"nm0000492","character":"Lydia Callahan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mischa Barton","urlProfile":"http://www.imdb.com/name/nm0059215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIyNzYyMTA1MF5BMl5BanBnXkFtZTcwMDE4NjgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1986","placeOfBirth":" London, England, UK","birthName":"Mischa Anne Marsden Barton","height":"5' 9\" (1.75 m)","bio":"Born in London and raised in New York. From humble beginnings in New York Theater in 1994 where she trained with such esteemed director/writers as James Lapine (\"Twelve Dreams\" at Lincoln Center with Donna Murphy), Tony Kushner (\"Slavs!\" at New York Theater Workshop with Marisa Tomei), and Naomi Wallace (\"One Flea Spare\" at the Public Theatre with Dianne Wiest), she went on to work side by side with modern-day screen icons including Julia Roberts and Hugh Grant on Notting Hill (1999), Bruce Willis and Toni Collette on The Sixth Sense (1999) and Sam Rockwell in her Sundance critically-lauded feature film debut Lawn Dogs (1997) produced by Duncan Kenworthy in 1998. Yet, despite this early success in theater and film, what really catapulted Mischa to the next level and made her a household name is her small screen performance as the irrepressible and irresistible \"Marisa\" on the popular Fox television show, The O.C. (2003) (2003 to 2007). The show fast became a global cult phenomenon and has earned many awards including a Television Critics Association Award nomination for \"Outstanding New Program of the Year\". Established as one of the most sought after young actresses of her generation Mischa was named \"It Girl\" by Entertainment Weekly, she was also Hollywood Life's \"Breakthrough Actress of the Year\", she won several American Teen Choice Awards for the show, and also Cosmopolitan's \"Fun Fearless Female Award\" for \"Knockout Ingenue\" and Glamour's \"Women of the Year\". She has been ranked as one of People magazine's \"50 Most Beautiful People\" for 5 consecutive years. She was awarded the VIPer Award in 2008 for \"Style Icon 2007\" by Mr. Karl Lagerfeld. In 2008, she played opposite Shirley MacLaine & Christopher Plummer in Sir Richard Attenborough's Closing the Ring (2007), with Hayden Christensen in the Dino De Laurentiis film Medieval pie - Territoires vierges (2007), and starred opposite Bruce Willis in Assassination of a High School President (2008) for the Yari Production Company. In 2007, she filmed Walled In (2009) for the French production company \"Canal Plus\", and she starred in and produced the film Homecoming (2009). In 2012 Mischa went back to her Theatrical roots and starred in a production of \"Steel Magnolias\" at the Gaiety Theatre in Dublin. Mischa has the following Films slated for release this year, 2013. \"Bhopal: A Prayer for Rain\" opposite Martin Sheen, \"A Resurrection\" starring the late Michael Clarke Duncan and Devon Sawa \"Apartment 1303 3D\" with Rebecca De Mornay, \"I Will Follow You Into the Dark\" opposite Ryan Eggold and \"Beauty and the Least: The Misadventures of Ben Banks\". She has just completed \"Mining for Ruby\" Directed by Zoe Quist, \"Beyond Justice\" with Danny Trejo and Vinnie Jones and will star opposite Billy Zane in \"Elephant's Graveyard\" and with Christopher Plummer and Timothy Hutton in \"Butterfly Love\" 2014. Mischa has also made a major impression in the fashion and beauty world. She has already graced the covers of countless international magazines and has become the face of numerous advertising campaigns. She has developed her own Brand, her successful Handbag line having launched in 2008, together with Accessories, Clothing and Beauty products and her Flagship Boutique opened in Fashionable Shoreditch London in 2012. This commercial and theatrical success has given the young woman an opportunity to take an extremely influential role in the global community. She became the spokesperson for \"Climate Star\", an organization that fights global warming through social and legislative activism. She serves as an \"Entertainment Industry Foundation\" ambassador teaming up with QVC to spread awareness and raise funds for women's cancer research through the \"Fashion Footwear Association\" of New York \"Shoes on Sale Initiative\" and is also involved in the \"SAFE\" campaign for skin cancer awareness. She is an ambassador for \"Save the Children\" and the \"One Water\" campaign which brings water to remote locations in Africa, and is on the board of the \"Lupus Research Committee\" in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIyNzYyMTA1MF5BMl5BanBnXkFtZTcwMDE4NjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0059215","name":"Mischa Barton","idIMDB":"nm0059215"},"actorId":"nm0059215","character":"Maurey Pierce","urlCharacter":"http://www.imdb.com/character/ch0159890","main":true},{"actorName":"Bug Hall","urlProfile":"http://www.imdb.com/name/nm0355379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzA1OTM2N15BMl5BanBnXkFtZTcwMjEyNzcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1985","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Brandon Hall","height":"6' 2\" (1.88 m)","bio":"Bug Hall was born on February 4, 1985 in Fort Worth, Texas, USA as Brandon Hall. He is an actor, known for American Pie Presents: The Book of Love (2009), Hercules (1997) and Honey, We Shrunk Ourselves (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzA1OTM2N15BMl5BanBnXkFtZTcwMjEyNzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0355379","name":"Bug Hall","idIMDB":"nm0355379"},"actorId":"nm0355379","character":"Sam Callahan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peggy Lipton","urlProfile":"http://www.imdb.com/name/nm0005152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYwMTk3NF5BMl5BanBnXkFtZTYwNjU4MzMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1946","placeOfBirth":" New York City, New York, USA","birthName":"Margaret Ann Lipton","height":"5' 6\" (1.68 m)","bio":"Peggy Lipton was born on August 30, 1946 in New York City, New York, USA as Margaret Ann Lipton. She is an actress, known for Mod Squad (1968), The Postman (1997) and A Dog's Purpose (2017). She was previously married to Quincy Jones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYwMTk3NF5BMl5BanBnXkFtZTYwNjU4MzMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005152","name":"Peggy Lipton","idIMDB":"nm0005152"},"actorId":"nm0005152","character":"Laurabel Pierce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angela Featherstone","urlProfile":"http://www.imdb.com/name/nm0004911","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5OTQ0MDQxM15BMl5BanBnXkFtZTcwODk1MDc0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1965","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Angela Eileen Featherstone","height":"5' 5\" (1.65 m)","bio":"Angela Featherstone (born 3 April 1965) is a Canadian actress. She is best known for playing Chloe in Friends, and the fiancee (Linda) who left Adam Sandler's character (Robbie) at the altar in The Wedding Singer. Most recently she played the role of Jame on Girls/HBO. She has created sitcoms for Sony, DreamWorks and NBC television, and written nonfiction for Time, Jane, Flare, The Huffington Post, and 2015 Pushcart Prize nom., 'God Said No' in Gargoyle Magazine. She curated 'Fuck Pretty,' a gallery show featuring important & emerging female photographers at the Robert Berman Gallery and recorded 'Coattail Glide' with Raymond Pettibon and band The Niche Makers. Angela is an adjunct lecturer at the UCLA 2015 Professional Producing Program. Angela will speak at the ICAN Nexus 2015 Training Conference 'Violence in the Home and its Effects on Children.' She will discuss 'PTSD and Alternative Trauma Treatment.' She lives in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5OTQ0MDQxM15BMl5BanBnXkFtZTcwODk1MDc0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004911","name":"Angela Featherstone","idIMDB":"nm0004911"},"actorId":"nm0004911","character":"Delores","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Renfro","urlProfile":"http://www.imdb.com/name/nm0000605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDE3NDA1MDVeQTJeQWpwZ15BbWU3MDE1NTg5MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1982","placeOfBirth":" Knoxville, Tennessee, USA","birthName":"Brad Barron Renfro","height":"5' 8\" (1.73 m)","bio":"Brad Renfro was born on July 25, 1982 in Knoxville, Tennessee, to Angela Denise McCrory and Mark Renfro, a factory worker. He was discovered at age 10 by director Joel Schumacher and was cast in the motion picture The Client (1994), which starred Susan Sarandon and Tommy Lee Jones. Although this would be his zenith, he went on to appear in other films, including The Cure (1995), Tom and Huck (1995), Sleepers (1996), and Apt Pupil (1998). Renfro won The Hollywood Reporter's Young Star Award in 1995 and was nominated as one of People magazine's \"Top 30 Under 30,\" though addiction problems in his teens and early 20s led to several police arrests and hampered his career. He died of a drug overdose in January 2008, aged 25.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDE3NDA1MDVeQTJeQWpwZ15BbWU3MDE1NTg5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000605","name":"Brad Renfro","nicknames":["Pagey","Renfreak","Fro"],"idIMDB":"nm0000605"},"actorId":"nm0000605","character":"Dothan Talbot","urlCharacter":"http://www.imdb.com/character/ch0031244","main":true},{"actorName":"R. Lee Ermey","urlProfile":"http://www.imdb.com/name/nm0000388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4Mzg5MjgzODleQTJeQWpwZ15BbWU3MDY4MDA5MDM@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1944","placeOfBirth":" Emporia, Kansas, USA","birthName":"Ronald Lee Ermey","height":"6' (1.83 m)","bio":"A talented character actor known for his military roles, Ronald Lee Ermey was in the United States Marine Corps for 11 years. He rose to the rank of Staff Sergeant, and later was bestowed the honorary rank of Gunnery Sergeant by the Marine Corps, after he served 14 months in Vietnam and later did two tours in Okinawa, Japan. After injuries forced him to retire from the Corps, he moved to the Phillipines, enrolling in the University of Manila, where he studied Criminology and Drama. He appeared in several Filipino films before being cast as a helicopter pilot in Francis Ford Coppola's Apocalypse Now (1979). Due to his Vietnam experiences, Coppola also utilized him as a technical adviser. He got a featured role in Sidney J. Furie's Les boys de la compagnie C (1978), playing a drill instructor. Ermey worked with Furie again in Purple Hearts (1984). However, his most famous (or infamous) role came as Gunnery Sergeant Hartman in Stanley Kubrick's Full Metal Jacket (1987), for which he was nominated for a Golden Globe. He did win the best supporting actor award from The Boston Society of Film Critics. Since then, he has appeared in numerous character roles in such films as Leaving Las Vegas (1995), Se7en (1995) and Dead Man Walking (1995). However, Ermey prefers comedy to drama, and has a comedic role in Saving Silverman (2001). Ronald Lee Ermey continues to be one of the best character actors in the business, and you can bet that when his name appears in a movie's credits, he is going to be top notch in his role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4Mzg5MjgzODleQTJeQWpwZ15BbWU3MDY4MDA5MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000388","name":"R. Lee Ermey","nicknames":["The Gunny"],"idIMDB":"nm0000388"},"actorId":"nm0000388","character":"Caspar Callahan","urlCharacter":"http://www.imdb.com/character/ch0091811","main":true},{"actorName":"Michael Greyeyes","urlProfile":"http://www.imdb.com/name/nm0340729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NzA3ODMxOF5BMl5BanBnXkFtZTYwNDkzMzky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1967","placeOfBirth":" Qu'Appelle Valley, Saskatchewan, Canada","height":"6' 2\" (1.88 m)","bio":"Michael Greyeyes is Plains Cree from the Muskeg Lake First Nation in Saskatchewan, Canada. He is an actor, choreographer and director, who first began his career with the National Ballet of Canada. Recent works include Passchendaele (feature film), The Threshing Floor (a dance work he co-choreographed with Santee Smith), Triptych (a short film broadcast nationally on Bravo!), and The Journey (Pimooteewin), a new opera work he directed with music by Melissa Hui and libretto by Tomson Highway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NzA3ODMxOF5BMl5BanBnXkFtZTYwNDkzMzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340729","name":"Michael Greyeyes","idIMDB":"nm0340729"},"actorId":"nm0340729","character":"Hank Elkrunner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerald Lenton-Young","urlProfile":"http://www.imdb.com/name/nm0502278","urlPhoto":"","biography":{"bio":"Gerald Lenton-Young is known for his work on Surveillance (2008), Skipped Parts (2000) and Try to Remember (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0502278","name":"Gerald Lenton-Young","idIMDB":"nm0502278"},"actorId":"nm0502278","character":"Coach Howard Stebbins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrea Menard","urlProfile":"http://www.imdb.com/name/nm1057159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MTMwMjU4NF5BMl5BanBnXkFtZTgwNjQ0NDYzMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Andrea Menard was born in Flin Flon, Manitoba, Canada. She is an actress and writer, known for Blackstone (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MTMwMjU4NF5BMl5BanBnXkFtZTgwNjQ0NDYzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1057159","name":"Andrea Menard","idIMDB":"nm1057159"},"actorId":"nm1057159","character":"Dot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathryn Henry","urlProfile":"http://www.imdb.com/name/nm1057131","urlPhoto":"","biography":{"bio":"Kathryn Henry is known for her work on Skipped Parts (2000) and To Let (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1057131","name":"Kathryn Henry","idIMDB":"nm1057131"},"actorId":"nm1057131","character":"LaDell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Henry","urlProfile":"http://www.imdb.com/name/nm1056546","urlPhoto":"","biography":{"bio":"Elizabeth Henry is an actress, known for Skipped Parts (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1056546","name":"Elizabeth Henry","idIMDB":"nm1056546"},"actorId":"nm1056546","character":"La Nell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Maslany","urlProfile":"http://www.imdb.com/name/nm1055824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjU3NTc0NV5BMl5BanBnXkFtZTgwMTQyNTk3ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Daniel Maslany is an actor, known for Four in the Morning (2016), Les enquêtes de Murdoch (2008) and Goliath (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjU3NTc0NV5BMl5BanBnXkFtZTgwMTQyNTk3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1055824","name":"Daniel Maslany","idIMDB":"nm1055824"},"actorId":"nm1055824","character":"Petey Pierce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aaron Fahlman","urlProfile":"http://www.imdb.com/name/nm1055409","urlPhoto":"","biography":{"bio":"Aaron Fahlman is an actor, known for Skipped Parts (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1055409","name":"Aaron Fahlman","idIMDB":"nm1055409"},"actorId":"nm1055409","character":"Buddy Pierce","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0209322","urlIMDB":"http://www.imdb.com/title/tt0209322","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"2000 Trimark Pictures, Inc."},"technical":{"runtime":["1 hr 40 min (100 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.4","filmingLocations":[{"location":"Indian Head, Saskatchewan, Canada"}],"rated":"R","awards":[{"award":"DVD Exclusive Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Video Premiere Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Drew Barrymore","id":"nm0000106","role":null}]}]}]}],"votes":"2,893","type":"Movie","companyCreditsSimple":[{"idCompany":"co0001304","name":"Skipped Parts Productions"}],"keywords":{"keywords":["governor","high school","student","pregnancy","wyoming","small town","sex","tween girl","military uniform","gay slur","first kiss","chewing gum","abortion clinic","teenage father","teen parents","nervous breakdown","shunned","ostracism","title directed by female","grovont wyoming","reference to shakespeare's romeo and juliet","reference to william shakespeare","military academy","marshmallow","writer","reference to nazarene","strip show","prostitute","wrath of god","jack in the box","cuban","assassination","jew","missouri","hair dryer","record player","millionaire","plantation","exile","girls' bathroom","saloon","drink thrown into someone's face","pajamas","restaurant","cafe","equality","prejudice","african american slur","bigotry","texan","greensboro north carolina","cheerleader","coach","reference to mark twain","reference to huckleberry finn","taxi","blood","mud","mounted moose head","gum","trust fund","deer","bear","forest","woods","junior high school","christmas","snow","mountain","swimsuit","twist the dance","baseball card","hospital","nurse","toilet","illegitimate grandson","illegitimate child","illegitimacy","newsreel footage","teacher","volleyball","baseball","horse riding","horse","friendship","friend","waitress","baby","foreplay","orgasm","pickup truck","dream","tv news","watching tv","reference to rocky the flying squirrel","reference to tarzan","hallucination","virgin","dancing","dancer","shared bath","bath","nudity","racial slur","tears","crying","menstruation","urination","erection","premature ejaculation","ejaculation","american indian","drunkenness","drinking","drink","mormon church","reference to god","going steady","boyfriend girlfriend relationship","imagined death","dream girl","death","family relationships","father son relationship","loss of virginity","virginity","year 1963","reference to john f. kennedy","father daughter relationship","mother daughter relationship","teenage girl","blackfoot tribe","underwear","teenage boy","twin","irreverence","voice over narration","sexual fantasy","removing each other's clothes","panties hit the floor","girl in bra and panties","white panties","teenage mother","teenage girl in underwear","bra removing","teen angst","single parent","sexual awakening","mother son relationship","first love","coming of age","wet dream","trailer home","teenage pregnancy","single mother","school bus","rodeo","native american","movie theatre","kennedy assassination","grandfather grandson relationship","diner","convertible","classroom","pool table","bicycle","abortion","1960s","interracial relationship","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:37:34"}}