{"data":{"movies":[{"title":"Timecode","originalTitle":"","year":"2000","releaseDate":"20000428","directors":[{"name":"Mike Figgis","id":"nm0001214"}],"writers":[{"name":"Mike Figgis","id":"nm0001214"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxOTAyOTIxM15BMl5BanBnXkFtZTcwMDYxMzQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"The primary story with this movie is that it is shown in four simultaneously filmed ninety-three minute single shot takes (in other words, shown in four quadrants), with the actual plot secondary. The four cameras follow the players involved, with two or more of the four cameras sometimes filming the exact same scene from different angles and thus different perspectives. The audio on each of the four quadrants is turned up and down based on which quadrant(s) the viewer should pay most attention to at any given time. The actual plot, which takes place in Hollywood, involves the pre-production by Red Mullet Productions for the movie \"Bitch from Louisiana\". The production team is in an executive meeting to discuss several aspects of the movie, including problems with one of their own, Alex Green, who has been missing in action from much of the production and this meeting. Alex's problems stem from his substance abuse and philandering, his wife Emma who is contemplating leaving him, of ...","simplePlot":"Four frames of simultaneous action that alternately follow a smitten lesbian lover as she obsesses over her partner's dalliances and the tense goings-on of a Hollywood film production company.","actors":[{"actorName":"Xander Berkeley","urlProfile":"http://www.imdb.com/name/nm0075359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1955","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Alexander Harper Berkeley","height":"6' (1.83 m)","bio":"Xander's father was a painter and his mother a school teacher who sewed, providing him with costumes (his preference over toys). School plays and Community Theater were next. An experimental theater troupe in the area (which was an offshoot from Joseph Chaikin's Open Theater in New York) took Xander under their wing when he was 16. He credits this group for shaping him as both a person and an actor, committed to taking risks and remaining open to the unknown. Xander went to Hampshire College, the progressive brainchild of Smith, Mt. Holyoke, Amherst, and the University of Massachusetts. He would continue in the theater at Hampshire, studying and doing plays at each of the other schools, all of which were there in the area. A move to New York after college brought him access to private teachers from the Royal Academy of the Arts, the Moscow Arts Theater and HB Studios. Later in Los Angeles, Xander would spend time with Lee Strasberg at The Actor's Studio during the last years of his life. Xander worked in Regional and Repertory Theaters in addition to off-Broadway while living in New York but, despite a classically trained theater background, he was increasingly drawn to the subtleties of film acting. A play, written by the great southern novelist Reynolds Price, called \"Early Dark\" had such a cinematic feel to it, that an agent saw the film acting potential in Xander and encouraged him to make the move out west. Soon Mommie Dearest (1981) provided Xander with his film debut in the role of \"Christopher Crawford\", and simultaneously gave his career a slightly cultish twist. Alex Cox with Sid and Nancy (1986), James Cameron with Terminator 2: Judgment Day (1991), Bernard Rose with Candyman (1992), Todd Haynes with Safe (1995), Mike Figgis with Leaving Las Vegas (1995), Andrew Niccol with Gattaca (1997) all helped to further associate Xander as an actor in his own rather unusual category. Xander's choices were often determined by the opportunity to learn from directors he admired, certainly all those listed above fell into that category. Clint Eastwood with The Rookie (1990), Ron Howard with Apollo 13 (1995), Rob Reiner with A Few Good Men (1992), Michael Mann with Heat (1995), Wolfgang Petersen with Air Force One (1997), Steven Spielberg with Amistad (1997) are obvious examples of others Xander actively sought to work with and learn from. From obscure independent movies where Xander could play lead roles to the big budget studio movies where he might often play smaller character-driven parts, an education was taking place. Just as working with older directors like Mihalis Kakogiannis on La cerisaie (1999) and Robert M. Young on Human Error (2004) (aka \"Human Error\") brought insights to ways of working that are being lost in pop cultures tendency to slide toward slickness. Not to mention bringing him to places like Bulgaria and China along the way. Perhaps because a life in the foreign services, or espionage was seen as a road not taken, living on location in foreign countries, working as an actor, has somewhat fulfilled the impulse. As early as 1987, a film took Xander to Nicaragua while the Contra War was taking place. It was during this three month shoot on the film Walker (1987) (starring Ed Harris) that Xander got an offer to do a film with his friend, director Jon Hess, in Chile for the following three months. Taking him straight from the revolutionary left-wing Sandanistas to Pinochet's fascist, right-wing regime. In 2001, an offer came in to play a part on a TV pilot called 24 (2001). It was another shady agent-type, and reluctant to repeat his performance from Air Force One (1997) as the turncoat secret serviceman, Xander almost passed on the job. Fortunately for him, he said yes. He met his future wife, Sarah Clarke during the first day of filming. His character, \"George Mason\", was just a guest star in the pilot, but the producers liked what Xander brought to it and continued to write more episodes for him. By the second season, it had become perhaps the most interesting, leveled character Xander had ever gotten to play. Sarah and Xander were married in 2002 and had their daughters, Olwyn in 2006 and Rowan in 2010. Other favorite roles of late have been \"Arlen Pavich\", the middle management dweeb, in Niki Caro's North Country (2005), and the Irish hooligan/railway foreman in David Von Ancken's Seraphim Falls (2006) and, more recently, \"The King of Sodom\" in Harold Ramis' Year One (2009), \"Sonny\" in David Pomes' Cook County (2009), the recovering meth head coming out of prison to discover the life he had left (and destroyed), and crazy \"Uncle Doug\" in David Wike's Out There (2006) (aka \"Out There\").","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0075359","name":"Xander Berkeley","idIMDB":"nm0075359"},"actorId":"nm0075359","character":"Evan Wantz","urlCharacter":"http://www.imdb.com/character/ch0215863","main":true},{"actorName":"Golden Brooks","urlProfile":"http://www.imdb.com/name/nm0112001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2Njg2Nzg5MV5BMl5BanBnXkFtZTcwNjIwNjI5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1970","placeOfBirth":" Fresno, California, USA","birthName":"Golden Ameda Brooks","height":"5' 6\" (1.68 m)","bio":"Golden Brooks was born on December 1, 1970 in Fresno, California, USA as Golden Ameda Brooks. She is an actress and writer, known for Girlfriends (2000), Timecode (2000) and Linc's (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2Njg2Nzg5MV5BMl5BanBnXkFtZTcwNjIwNjI5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0112001","name":"Golden Brooks","idIMDB":"nm0112001"},"actorId":"nm0112001","character":"Onyx Richardson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Saffron Burrows","urlProfile":"http://www.imdb.com/name/nm0004787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTkxMTgyM15BMl5BanBnXkFtZTcwODQ2Mzg0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1972","placeOfBirth":" London, England, UK","birthName":"Saffron Domini Burrows","height":"6' (1.83 m)","bio":"Saffron Burrows was born on October 22, 1972 in London, England as Saffron Domini Burrows. She is an actress, known for The Bank Job (2008), Deep Blue Sea (1999) and Troy (2004). She has been married to Alison Balian since August 2011. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTkxMTgyM15BMl5BanBnXkFtZTcwODQ2Mzg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004787","name":"Saffron Burrows","idIMDB":"nm0004787"},"actorId":"nm0004787","character":"Emma","urlCharacter":"http://www.imdb.com/character/ch0093917","main":true},{"actorName":"Viveka Davis","urlProfile":"http://www.imdb.com/name/nm0205630","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDIwODAyNV5BMl5BanBnXkFtZTcwOTIwMzMzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1969","placeOfBirth":" Santa Monica, California, USA","bio":"Viveka Davis was born on August 19, 1969 in Santa Monica, California, USA. She is an actress and production designer, known for Cast Away (2000), Message in a Bottle (1999) and Timecode (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDIwODAyNV5BMl5BanBnXkFtZTcwOTIwMzMzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205630","name":"Viveka Davis","idIMDB":"nm0205630"},"actorId":"nm0205630","character":"Victoria Cohen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Edson","urlProfile":"http://www.imdb.com/name/nm0002057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzYwNjEyNl5BMl5BanBnXkFtZTcwOTk2NDE1Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1954","placeOfBirth":" New Rochelle, New York, USA","height":"5' 11½\" (1.82 m)","bio":"The great character actor Richard Edson's first feature film role came in Jim Jarmusch's 1983 cult hit, Stranger Than Paradise (1984), where he played \"Eddie\", one of the main characters. Edson then had small, but memorable, roles in other big hits such as Desperately Seeking Susan (1985), John Hughes' Ferris Bueller's Day Off (1986), Oliver Stone's great Vietnam-movie Platoon (1986), Barry Levinson's Good Morning, Vietnam (1987) and, in 1989, Edson starred in Spike Lee's Do the Right Thing (1989). In 1993, he played \"Spike\", one of the evil King Koopa's henchmen, in Super Mario Bros. (1993) and, in 1995, he had a part in the engaging sci-fi thriller, Strange Days (1995). More recently, he has appeared in the remake of Starsky & Hutch (2004), the dubious horror-flick, Frankenfish (2004) and is currently starring with Tom Arnold in The Kid & I (2005). In addition to his film success, Edson has had a fascinating career in music, being the original drummer in the New York post-punk band, Sonic Youth, and spending three years as drummer for the rhythmic dance band, Konk. It was his involvement in Konk and the New York art scene that caught Jim Jarmusch's eye and led to his being cast in Stranger Than Paradise (1984). Edson currently lives in Los Angeles where, in addition to acting, he is very active in music, writing and photography.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzYwNjEyNl5BMl5BanBnXkFtZTcwOTk2NDE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002057","name":"Richard Edson","idIMDB":"nm0002057"},"actorId":"nm0002057","character":"Lester Moore","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aimee Graham","urlProfile":"http://www.imdb.com/name/nm0333888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDUwNjEwOV5BMl5BanBnXkFtZTYwNDY0OTky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1971","placeOfBirth":" Milwaukee, Wisconsin, USA","height":"5' 7\" (1.7 m)","bio":"Aimee Graham was born on September 20, 1971 in Milwaukee, Wisconsin, USA. She is an actress and director, known for Jackie Brown (1997), From Dusk Till Dawn (1996) and Shriek If You Know What I Did Last Friday the Thirteenth (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDUwNjEwOV5BMl5BanBnXkFtZTYwNDY0OTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0333888","name":"Aimee Graham","idIMDB":"nm0333888"},"actorId":"nm0333888","character":"Sikh Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Salma Hayek","urlProfile":"http://www.imdb.com/name/nm0000161","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMTk2NzM2Ml5BMl5BanBnXkFtZTcwNDQ4MjYzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1966","placeOfBirth":" Coatzacoalcos, Veracruz, Mexico","birthName":"Salma Valgarma Hayek-Jimenez","height":"5' 2\" (1.57 m)","bio":"One of Hollywood's most dazzling leading actresses, Salma Hayek was born on September 2, 1966, in the oil boomtown of Coatzacoalcos, Mexico. Hayek has freely admitted that she and her brother, Sami, were spoiled rotten by her well-to-do businessman father, Sami Hayek Dominguez, and her opera-singing mother, Diana Jiménez Medina. Her father is of Lebanese descent and her mother is of Mexican/Spanish ancestry. After having seen Willy Wonka & the Chocolate Factory (1971) in a local movie theatre, Salma decided she wanted to become an actress. At 12, she was sent to the Academy of the Sacred Heart in New Orleans, Louisiana, where she pulled pranks on the nuns by setting their clocks back three hours. She was soon expelled. Only after attending Mexico City's Universidad Iberoamericana did she feel ready to pursue acting seriously. She soon landed the title role in Teresa (1989), a hugely successful soap opera which earned her the star status in her native Mexico. However, anxious to make films and to explore her talent and passion, Hayek left both Teresa (1989) and Mexico in 1991. Heartbroken fans spread rumors that she was having a secret affair with Mexico's president and left to escape his wife's wrath. At long last, Salma made her way to Los Angeles. The 24 year old actress approached Hollywood with naïve enthusiasm, and quickly learned that Latin actresses were, if at all, typecast as the mistress maid or local prostitute. By late 1992, Hayek had landed only bit parts. She appeared on Street Justice (1991), The Sinbad Show (1993), Nurses (1991), and as a sexy maid on the HBO series Dream On (1990). She also had one line in the Allison Anders film Mi vida loca (1993). Feeling under-appreciated by Anglo filmmakers, Hayek vented her frustrations on comedian Paul Rodriguez's late-night Spanish-language talk show in 1992. Robert Rodriguez and his producer wife Elizabeth Avellan happened to be watching and were immediately smitten with the intelligent, opinionated young woman. He soon gave her her big break--to star opposite Antonio Banderas in the now cult classic Desperado (1995), which put her on Hollywood's map. The moviegoers proved to be as dazzled with Hayek as he had been. After her break, she was cast again by Rodriguez to star in his From Dusk Till Dawn (1996). Although her vampy role opposite George Clooney and Quentin Tarantino was a small one, it was a good credit to her box office name. Hayek's first star billing came later that year with Fools Rush In (1997) opposite Friends (1994) actor Matthew Perry. The film was a modest hit, and Hayek continued to rise her star in both commercial and artistic films such as: Breaking Up (1997) with an unknown Russell Crowe; 54 (1998) about the rise and fall of the legendary New York club; Dogma (1999), playing the muse in a somewhat odd comedy co-starring Matt Damon and Chris Rock; In the Time of the Butterflies (2001), the small artistic film which won Hayek an ALMA award as best actress; and the 1999 summer blockbuster Wild Wild West (1999). Her production company \"Ventanarosa\" produced the 1999 Mexican feature film Pas de lettre pour le colonel (1999), which was shown at the Cannes Film Festival and selected as Mexico's official Oscar entry for best foreign film. The new millennium started out quietly around Salma as she was preparing to produce and star in her dream role, that of Frida Kahlo, the legendary Mexican painter whom Salma had been admiring her entire life and whose story she wanted to bring to the big screen ever since her arrival in Hollywood. It finally happened in 2002. Frida (2002), co-produced by Hayek, was a beautifully made film overflowing with passion and enthusiasm, with terrific performances from Salma and Alfred Molina as Kahlo's cheating husband \"Diego Rivera\". On the side was an entourage of stars including Antonio Banderas, Ashley Judd, Geoffrey Rush, Edward Norton and Valeria Golino. The picture was a hit and was nominated for six Oscars, including best actress for Hayek, who became the first Latin actress to be nominated in the category, and won the awards for make-up and its brilliant original score by Elliot Goldenthal. Hayek established herself as the serious actress that she is and, in the same year, expanded her horizons, directing The Maldonado Miracle (2003), which was shown at the Sundance Film festival. In 2003, she starred in the final of Rodriguez's \"Desperado\" trilogy Once Upon a Time in Mexico (2003), again opposite Banderas, and has just finished After the Sunset (2004) opposite Pierce Brosnan and Ask the Dust (2006) opposite Colin Farrell. Both are scheduled for release in early 2005. In the works are Robert Altman's \"Paint\" and Bandidas (2006) in which she will star with her friend Penélope Cruz.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMTk2NzM2Ml5BMl5BanBnXkFtZTcwNDQ4MjYzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000161","name":"Salma Hayek","idIMDB":"nm0000161"},"actorId":"nm0000161","character":"Rose","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glenne Headly","urlProfile":"http://www.imdb.com/name/nm0000444","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjc2NzIwMl5BMl5BanBnXkFtZTcwMDM4MjAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1955","placeOfBirth":" New London, Connecticut, USA","height":"5' 8\" (1.73 m)","bio":"For the past fourteen years, she has said that family has been the most important thing to her and she has set most of her time aside to be a \"present\" mother to her son. Movies, plays and television are chosen, for the most part, when they occur in town or on a school break. She has taken the current year to homeschool her son for his seventh grade. But it wasn't always this way. She was raised in New York City and wanted to be an actress from the time she was a child, graduating with acting honors from the High School of Performing Arts. She chose to opt out of studying acting in college and attended a small college in Europe, majoring in art history and literature, knowing that acting would take up a great deal of her life and that her college years would be her only real time to learn about something else. Upon graduation, she returned to New York City but a chance trip to Chicago inspired her to move there and become a part of its budding theatre community. It was in a production of \"Curse of The Starving Class\", directed by Robert Falls and co-starring John Malkovich, that she was first seen by the Steppenwolf Theatre Company and, subsequently, asked to join their troupe. She did and learned what it really was to be an actress on her feet, performing in all kinds of roles in both comedy and drama. During this time, she won four Joseph Jefferson awards for best supporting actress. With a return move to New York, she received a Theatre World Award for \"best newcomer\" for her role in \"the Philanthropist\" at the Manhattan Theatre Club and appeared in \"Extremities\" with Susan Sarandon. This was followed by her appearance in the very successful Steppenwolf production in New York of \"Balm in Gilead\". She then starred on Broadway opposite Kevin Kline and Raul Julia in \"Arms & the Man\", directed by John Malkovich, her husband at the time. She was cast in several smaller films including Nadine (1987), Making Mr. Right (1987) and Paperhouse (1988) as well as Lonesome Dove (1989) for television for which she received her first of two Emmy nominations for best supporting actress. But her breakout film performance was in Dirty Rotten Scoundrels (1988), in which she played the cunning \"victim\", who gets the best of con artists Michael Caine and Steve Martin. This led to her being cast in the blockbuster comic strip parody, Dick Tracy (1990), in which she portrayed the girlfriend, \"Tess Trueheart\", to Warren Beatty's lead. She went on to appear in the films Mr. Holland's Opus (1995) opposite Richard Dreyfuss, Mortal Thoughts (1991) opposite Demi Moore, 2 Days in the Valley (1996), What's the Worst That Could Happen? (2001), Breakfast of Champions (1999), Around the Bend (2004) and Journal intime d'une future star (2004). On television, she had a recurring part on ER (1994) and Monk (2002) and was in the short-lived sit-com Encore! Encore! (1998) with Nathan Lane and Joan Plowright. She was in the live theatrical presentation of \"On Golden Pond\" as the troubled daughter of Christopher Plummer and Julie Andrews and also appeared in the telefilms Women vs. Men (2002), My Own Country (1998) and Pronto (1997), among others. She received her second Emmy nomination for best supporting actress for Bastard Out of Carolina (1996), directed by Anjelica Huston. Her most recent appearances were in the films The Amateurs (2005) (aka \"The Amateurs\"), The Namesake (2006), Comeback Season (2006), Kit Kittredge: An American Girl (2008) and The Joneses (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjc2NzIwMl5BMl5BanBnXkFtZTcwMDM4MjAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000444","name":"Glenne Headly","idIMDB":"nm0000444"},"actorId":"nm0000444","character":"Therapist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Heckler","urlProfile":"http://www.imdb.com/name/nm0373055","urlPhoto":"","biography":{"bio":"Andrew Heckler is an actor and director, known for Burden (2017), Armageddon (1998) and Ally McBeal (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0373055","name":"Andrew Heckler","idIMDB":"nm0373055"},"actorId":"nm0373055","character":"Auditioning Actor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Holly Hunter","urlProfile":"http://www.imdb.com/name/nm0000456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzg1ODA1NF5BMl5BanBnXkFtZTcwNTI4NzQ4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1958","placeOfBirth":" Conyers, Georgia, USA","birthName":"Holly P. Hunter","height":"5' 2\" (1.57 m)","bio":"Holly Hunter was born in Conyers, Georgia, to Opal Marguerite (Catledge), a homemaker, and Charles Edwin Hunter, a part-time sporting goods company representative and farmer with a 250 acre farm. She is the youngest of seven children. Her parents encouraged her talent at an early age, and her first acting part was as Helen Keller in a fifth-grade play. In 1976 she went to Pittsburgh to pursue a degree in drama from Carnegie Mellon University. After graduating in 1980, she went to New York City, where she met playwright Beth Henley in a stalled elevator. Hunter went on to get roles in a number of Henley's southern gothic plays, including Crimes of the Heart and The Miss Firecracker Contest. In 1982 the actress went to Los Angeles. She landed her first starring role in the movies in the Coen brothers' Raising Arizona (1987), a part that is said to have been written with her in mind. She gained stardom in 1987 when she played the driven TV news producer Jane Craig in James L. Brooks' Broadcast News (1987). In 1993 she earned an Academy Award and worldwide acclaim with her performance as a mute bride to a New Zealand planter in La leçon de piano (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzg1ODA1NF5BMl5BanBnXkFtZTcwNTI4NzQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000456","name":"Holly Hunter","idIMDB":"nm0000456"},"actorId":"nm0000456","character":"Renee Fishbine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Huston","urlProfile":"http://www.imdb.com/name/nm0396812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MTk4NDA0NjZeQTJeQWpwZ15BbWU3MDQ5NzIzNTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1962","placeOfBirth":" Rome, Lazio, Italy","height":"6' 2\" (1.88 m)","bio":"Danny Huston is an American actor and director who has worked with Academy award-nominated actors from the very start of his career. No surprise for a man who was born into a legendary Hollywood family whose most noted members included his half-sister, his father, his grandfather, his nephew, and of course, himself. Born in Rome, Huston's parents were Zoe Sallis and John Huston. Sallis was an established author in her own right. John Huston was, by that point, famous for his many high caliber films, and notorious for his personal life, which included five marriages, two children, another adopted child, and many affairs, one of which resulted in Danny's conception. Like his half-sister, Anjelica Huston, Danny Huston chose to follow his father into the world of film. His birthright served as a blessing, so that his first film appearance as an actor was in The 'Human' Factor (1975), a revenge film directed by and starring men who already had Oscar nominations under their belts. Following that small appearance, Huston turned to directing for the next few years. It wasn't until the late 1980s that Huston directed his first made-for-television film, Mister Corbett's Ghost (1987). Based on a novella by Leon Garfied, the film starred such screen legends as Paul Scofield and Burgess Meredith. It is also notable for being the final acting project of Huston's father John, who spent his final years assisting his children in their own budding film careers. Shortly before his death, John helped produce his son's first feature length film, Mr. North (1988). The film was directed by Huston, and included his half-sister Anjelica in the cast, as well as Virginia Madsen, whom Huston would marry for a few years. Huston followed this up with the sexual drama Becoming Colette (1991), starring Klaus Maria Brandauer, and the horror film The Maddening (1995), starring Burt Reynolds. Neither film made a huge impact, and it was around this time, twenty years after his last acting role, that Huston returned to appearing in front of the camera. Starting modestly as a barman in the highly acclaimed Leaving Las Vegas (1995), Huston followed up with a supporting role in Anna Karenina (1997), alongside such would-be thespians as Sean Bean, Sophie Marceau, and Alfred Molina. The film was unfortunately a flop, as were Huston's next few film roles. In 2000, however, the tide finally turned, and Huston was able to break out as an established character actor. Re-uniting with his Anna Karenina director, Bernard Rose, Huston starred in the small-budget film Ivansxtc (2000), which was an adaptation of a book by Leo Tolstoy. While not a financial triumph, the film received very positive reactions from critics. The same fate awaited the film Hotel (2001), which included Huston in a diverse cast which included Lucy Liu, Rhys Ifans, Salma Hayek, and John Malkovich. It was also around this time that Huston met and married his second wife, Katie Jane Evans, though this marriage would end in great tragedy several years later. For now, though, Huston's career as an actor was just getting started. It was 21 Grams (2003) which secured Huston his first bona fide financial and critical success. Starring such names as Sean Penn and Benicio Del Toro, the film follows a non-linear storyline dealing with the lives of several people who are affected by an automobile accident. Huston followed up this success by appearing in John Sayle's Silver City (2004), the controversial feature film Birth (2004), and Martin Scorsese's wildly successful film about Howard Hughes known as Aviator (2004). Nominated for many awards, the film was also a success financially. But nothing Huston had done up to this point would equal to what he did next. John Hillcoat's Australian western The Proposition (2005) is a very dark film set mostly in a small community in the Australian Outback during the 19th century. A criminal is dispatched by the local law enforcement to hunt down his older brother, Arthur Burns, and kill him. As played by Huston, Burns is a psychopath who cares nothing for the various rapes and murders that he has committed. He does, however, find some chasm of his heart to enjoy music, poetry, and the glorious beauty of the Australian sunsets. This layered performance as the film's villain arguably ranks as Huston's greatest performance to date. That same year, Huston played in the highly acclaimed film The Constant Gardener (2005), which tackled corruption, love, and humanitarian efforts by the West in Africa. Huston moved from Oscar-winning film to Oscar-winning film the following year with the films Marie Antoinette (2006) and Children of Men (2006). In the former, Huston portrays the Holy Roman Emperor, Joseph II, as a cautious and thoughtful monarch who warns Marie Antoinette of her excessive lifestyle. He proves to be prophetic when the French mobs storm the Bastille and launch a revolution. In the latter film, set in a dystopian world of global human infertility, Huston portrays Nigel, a government official who uses his position to preserve famous artwork. Both films were highly successful, and further cemented Huston as a noted actor. Huston proceeded to play Orson Welles in the thriller Fade to Black (2006), and also acted in the financially successful war film The Kingdom (2007) and the poorly received The Number 23 (2007). From this point onward, Huston would appear in many films, portraying characters of various importance. Among the more noted examples would be the superhero film X-Men Origins: Wolverine (2009), where Huston played the villainous role of William Stryker, the man who imprisons Wolverine and is responsible for his experimentation with adamantium. Huston also portrayed the Greek god Poseidon in Clash of the Titans (2010), as well as its sequel two years later. Whether the crime film Edge of Darkness (2010), the historical epic Robin Hood (2010), the biographical Hitchcock (2012), or the comedy 2 Jacks (2012) (which was another adaptation of Leo Tolstoy's work, again directed by Bernard Rose and also starred Huston's nephew Jack Huston ), Huston has constantly showed his range of accents, characters, and genres. More recently, Huston has continued to appear in films, including the upcoming Tim Burton -directed biopic Big Eyes (2014) and \"Frankenstein\", which will once again reunite him with Bernard Rose. Huston has also moved into the world of television with such series as \"Magic City\" (which earned him a Golden Globe nomination), \"American Horror Story\", and \"Masters of Sex\". As busy and talented as he always has been through nearly four decades of work in the film industry, Danny Huston continues to work as one of Hollywood's veteran character actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MTk4NDA0NjZeQTJeQWpwZ15BbWU3MDQ5NzIzNTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0396812","name":"Danny Huston","idIMDB":"nm0396812"},"actorId":"nm0396812","character":"Randy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daphna Kastner","urlProfile":"http://www.imdb.com/name/nm0440988","urlPhoto":"","biography":{"dateOfBirth":"17 April 1961","placeOfBirth":" Montréal, Québec, Canada","bio":"Daphna Kastner was born on April 17, 1961 in Montréal, Québec, Canada. She is an actress and writer, known for Julia Has Two Lovers (1990), Spanish Fly (1998) and French Exit (1995). She has been married to Harvey Keitel since October 7, 2001. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0440988","name":"Daphna Kastner","idIMDB":"nm0440988"},"actorId":"nm0440988","character":"Auditioning Actor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Kearney","urlProfile":"http://www.imdb.com/name/nm0443967","urlPhoto":"","biography":{"bio":"Patrick Kearney is an actor, known for Timecode (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0443967","name":"Patrick Kearney","idIMDB":"nm0443967"},"actorId":"nm0443967","character":"Drug House Owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Low","urlProfile":"http://www.imdb.com/name/nm0522811","urlPhoto":"","biography":{"bio":"Elizabeth Low is an actress and producer, known for Timecode (2000), Naked Souls (1996) and Fear Runs Silent (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0522811","name":"Elizabeth Low","idIMDB":"nm0522811"},"actorId":"nm0522811","character":"Penny - Evan's Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle MacLachlan","urlProfile":"http://www.imdb.com/name/nm0001492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Mzk3OTg3MF5BMl5BanBnXkFtZTYwMTk0MDkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1959","placeOfBirth":" Yakima, Washington, USA","birthName":"Kyle Merritt McLachlan","height":"5' 11¼\" (1.81 m)","bio":"The \"boy next door, if that boy spent lots of time alone in the basement\", is how Rich Cohen described Kyle MacLachlan in a 1994 article for \"Rolling Stone\" magazine. That distinctly askew wholesomeness made MacLachlan a natural to become famous as the alter ego of twisted director David Lynch. MacLachlan was born and raised in Yakima, Washington, to Catherine Louise (Stone), a public relations director, and Kent Alan McLachlan, a lawyer and stockbroker. He has Scottish, English, Cornish, and German ancestry. MacLachlan graduated from the University of Washington in 1982. The darkly handsome actor made his feature film debut when he starred in the big-budget David Lynch adaptation of Frank Herbert's Dune (1984), but only enjoyed real success after appearing in a second Lynch project, the moody and perverse classic, Blue Velvet (1986). The following year saw MacLachlan appearing as an otherworldly FBI agent in the cult classic sci-fi film, The Hidden (1987). This turned out to be a sign of things to come, as MacLachlan soon took on another oddball G-man, \"Special Agent Dale Cooper\", on Lynch's cryptic ABC-TV series, Twin Peaks (1990), perhaps, along with Blue Velvet (1986), his most famous role. MacLachlan's remarkable work as Agent Cooper earned him a Golden Globe award and a pair of Emmy nominations, as well as steady work in television and films, including a part as Ray Manzarek in the Oliver Stone film, The Doors (1991), and villain \"Cliff Vandercave\" in the live action version of The Flintstones (1994). His career took a hit after he appeared in the infamous flop, Showgirls (1995). However, MacLachlan returned to prominence in the early 2000s with a re-occurring role on HBO's Sex and the City (1998), as well as a starring role in the TV movie, The Spring (2000), and a turn as \"Claudius\" in director Michael Almereyda's version of Hamlet (2000). MacLachlan later took advantage of his resemblance to Cary Grant, when he played the classic actor's spirit in Un soupçon de rose (2004). MacLachlan has remained a popular actor with independent filmmakers, and he has also been a familiar face on television, appearing on the ABC-TV shows, In Justice (2006) and Desperate Housewives (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Mzk3OTg3MF5BMl5BanBnXkFtZTYwMTk0MDkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001492","name":"Kyle MacLachlan","idIMDB":"nm0001492"},"actorId":"nm0001492","character":"Bunny Drysdale","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0220100","urlIMDB":"http://www.imdb.com/title/tt0220100","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$93,148","country":"USA","day":"30","month":"04","year":"2000","remarks":"7 Screens"}],"gross":[{"money":"$945,041","country":"USA","day":"11","month":"06","year":"2000","remarks":""},{"money":"$838,468","country":"USA","day":"04","month":"06","year":"2000","remarks":""},{"money":"$705,096","country":"USA","day":"28","month":"05","year":"2000","remarks":""},{"money":"$510,958","country":"USA","day":"21","month":"05","year":"2000","remarks":""},{"money":"$351,929","country":"USA","day":"14","month":"05","year":"2000","remarks":""},{"money":"$190,635","country":"USA","day":"07","month":"05","year":"2000","remarks":""},{"money":"$93,148","country":"USA","day":"30","month":"04","year":"2000","remarks":""}],"weekendGross":[{"money":"$52,705","country":"USA","day":"11","month":"06","year":"2000","remarks":"91 Screens"},{"money":"$83,460","country":"USA","day":"04","month":"06","year":"2000","remarks":"130 Screens"},{"money":"$150,803","country":"USA","day":"28","month":"05","year":"2000","remarks":"130 Screens"},{"money":"$85,634","country":"USA","day":"21","month":"05","year":"2000","remarks":"42 Screens"},{"money":"$126,005","country":"USA","day":"14","month":"05","year":"2000","remarks":"42 Screens"},{"money":"$55,852","country":"USA","day":"07","month":"05","year":"2000","remarks":"7 Screens"},{"money":"$93,148","country":"USA","day":"30","month":"04","year":"2000","remarks":"7 Screens"}],"admissions":[{"money":"16,605","country":"France","day":"19","month":"06","year":"2001","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"11","year":"1999","remarks":null},{"money":null,"country":null,"day":"19","month":"11","year":"1999","remarks":null}],"copyrightHolder":"©2000 Screen Gems all rights reserved (on print)"},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Sony DSR-130"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["Video"],"cinematographicProcess":["DVCAM"],"printedFilmFormat":["35 mm (spherical)"]},"rating":"6.2","metascore":"65","filmingLocations":[{"location":"8800 W. Sunset Blvd., West Hollywood, California, USA"}],"rated":"R","awards":[{"award":"Chlotrudis Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Chlotrudis Award","categories":[{"category":"Best Cast","names":[]}]}]},{"award":"DVD Exclusive Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Video Premiere Award","categories":[{"category":"Best DVD Audio Commentary","names":[{"name":"Mike Figgis","id":"nm0001214","role":null}]}]}]}],"votes":"5,978","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010568","name":"Screen Gems"},{"idCompany":"co0134173","name":"Red Mullet Productions"}],"keywords":{"keywords":["ensemble cast","interlinked stories","multiple storyline","split screen","audition","lesbian","masseuse","drugs","jealousy","real time","f rated","surrealism","avant garde","one word title","lesbianism","single take","long take","shot in the side","experimental film","digital film","limousine","music score composed by director","earthquake","eavesdropping","los angeles california","multi screen","homosexual","lesbian kiss","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:05:37"}}