{"data":{"movies":[{"title":"Riding in Cars with Boys","originalTitle":"","year":"2001","releaseDate":"20011019","directors":[{"name":"Penny Marshall","id":"nm0001508"}],"writers":[{"name":"Beverly D'Onofrio","id":"nm0195838"},{"name":"Morgan Ward","id":"nm0911750"}],"runtime":"132 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGM5MzU5NTgtMmJjZC00Y2E2LThhZGQtMGE5YzUxZTgwZDdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Comedy","Drama"],"plot":"Seriocomic story based on the memoir by Beverly Donofrio, the movie follows a young woman who finds her life radically altered by an event from her teen years. Born in 1950, Beverly grew up bright and ambitious in a working-class neighborhood in Connecticut; her father was a tough but good-hearted cop who listened to his daughter's problems, and her mother was a nervous woman eager to imagine the worst. From an early age, Beverly displays a keen intelligence and an interest in literature, and dreams of going to college in New York and becoming a writer. However, she also develops an early interest in boys, and at 15 finds herself madly in love with a boy from her high school. However, an attempt to get his attention leads to an embarassing incident at a party, and Ray, a sweet but thick-headed 18-year-old, steps forward to defend her. Beverly and Ray end up making out, and after one thing leads to another, Beverly discovers she's pregnant. Telling Ray is only marginally less difficult...","simplePlot":"A single mother, with dreams of becoming a writer, has a son at the age of 15 in 1965, and goes through a failed marriage with the drug-addicted father.","actors":[{"actorName":"Drew Barrymore","urlProfile":"http://www.imdb.com/name/nm0000106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTMzODIxM15BMl5BanBnXkFtZTcwODM2NTY5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1975","placeOfBirth":" Culver City, California, USA","birthName":"Drew Blyth Barrymore","height":"5' 4\" (1.63 m)","bio":"Since melting audiences' hearts - at the age of six - in Steven Spielberg's beloved sci-fi blockbuster, E.T. the Extra-Terrestrial (1982), Drew Barrymore has emerged as one of the most endearing and talented actresses of her generation. Drew Blyth Barrymore was born in Culver City, California, to actors John Drew Barrymore and Jaid Barrymore (née Ildiko Jaid Mako). Her father came from a long showbusiness legacy, as the son of actors John Barrymore and Dolores Costello, while her mother was the daughter of Hungarian refugees. Despite a troubled and much-publicized adolescence, and a string of \"bad girl\" parts in lurid crime dramas such as Poison Ivy (1992), Barrymore's star was officially on the rise during the mid-1990s, with notable appearances in Boys on the Side (1995), Woody Allen's Everyone Says I Love You (1996), and the game-changing horror hit Scream (1996). An eclectic mix of high-profile and low-key film projects followed - such as The Wedding Singer (1998), Ever After: A Cinderella Story (1998), Never Been Kissed (1999), Charlie's Angels (2000), Donnie Darko (2001), Riding in Cars with Boys (2001) and Confessions of a Dangerous Mind (2002) - proving to once-cynical audiences that Barrymore was not only a capable leading lady, but also a gifted and versatile actor. Next came headlining parts in Duplex (2003), 50 First Dates (2004), Fever Pitch (2005), Music and Lyrics (2007), Lucky You (2007), He's Just Not That Into You (2009), and the much-lauded Grey Gardens (2009), for which she earned Golden Globe and Screen Actors Guild awards for her portrayal of Edith Bouvier Beale. In 2009, Barrymore - whose production company, Flower Films, has spawned several lucrative features - made her long-awaited directional debut with the comedy-drama Whip It (2009), emerging as \"a sensitive director who knows how and when to let an emotional moment linger on the screen\" (TIME). Alongside a recurring guest spot - as the voice of Jillian - on the cult animated series Family Guy (1999), recent acting roles have included Everybody's Fine (2009), Going the Distance (2010), Big Miracle (2012), Blended (2014), and Miss You Already (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTMzODIxM15BMl5BanBnXkFtZTcwODM2NTY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000106","name":"Drew Barrymore","nicknames":["D"],"idIMDB":"nm0000106"},"actorId":"nm0000106","character":"Beverly Donofrio","urlCharacter":"http://www.imdb.com/character/ch0045583","main":true},{"actorName":"Steve Zahn","urlProfile":"http://www.imdb.com/name/nm0001872","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NzI1NzgwOV5BMl5BanBnXkFtZTcwNDA4MDY3Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1967","placeOfBirth":" Marshall, Minnesota, USA","birthName":"Steven James Zahn","height":"5' 7¼\" (1.71 m)","bio":"Steve Zahn was born in Marshall, Minnesota, to Zelda, who worked at a YMCA, and Carleton Edward Zahn, a Lutheran pastor. His father is of German and Swedish descent and his mother is of German ancestry. Zahn's career kicked off in his native Minnesota when he crashed the audition of a local stage production of \"Biloxi Blues\" and won the lead role. Next trained at American Repertory Theatre in Cambridge, MA; then moved to New York City where he won a role touring for 13 months in national company of Tommy Tune-directed version of \"Bye Bye Birdie\". Back in New York, he played opposite Ethan Hawke in \"Sophistry\" at Playwright's Horizon, where Ben Stiller noticed him and cast him and Hawke in Reality Bites (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NzI1NzgwOV5BMl5BanBnXkFtZTcwNDA4MDY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001872","name":"Steve Zahn","idIMDB":"nm0001872"},"actorId":"nm0001872","character":"Ray Hasek","urlCharacter":"http://www.imdb.com/character/ch0215181","main":true},{"actorName":"Adam Garcia","urlProfile":"http://www.imdb.com/name/nm0305081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzdmMTZmZTktY2U1OC00ZDkyLWJiMzgtZmY4MjU4ZDE1ZTM4XkEyXkFqcGdeQXVyMjA2NzY5MzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1973","placeOfBirth":" Wahroonga, New South Wales, Australia","birthName":"Adam Gabriel Garcia","height":"5' 10\" (1.78 m)","bio":"Adam Garcia is an Australian actor and tap dancer of partial Colombian descent (his father is from Colombia). Garcia left university to take the role of Slide in the production of the musical Hot Shoe Shuffle, which toured Australia before transferring to London, England. Garcia stayed on in London to act in West End musicals. Garcia played Doody in the West End's version of Grease in London. He also played a Travolta character, Tony Manero, in the stage version of Saturday Night Fever, which ran from 1998 to 1999 in London. Garcia was nominated for an Olivier Award for his performance. Garcia reached #15 in the UK singles chart in 1998, with his cover version of the Bee Gees song \"Night Fever\", taken from Saturday Night Fever. In 2000, Garcia performed a solo Tap dance in the Sydney Olympic Opening Ceremony Garcia has been nominated for multiple awards during his stage acting career. His transition into a film actor began in 1997, when he played Jones in Wilde, a movie about the life of writer Oscar Wilde. Garcia then went on to act in such movies as Coyote Ugly, Bootmen & Riding In Cars With Boys and, in 2004, the role of rock star Stu Wolf in Confessions of a Teenage Drama Queen He appeared as government official Alex Klein in the 2005 Christmas special of the long-running British science fiction television series Doctor Who. According to the audio commentary for the episode, Garcia accepted the relatively minor role as he is a science fiction fan. . Garcia worked with Idina Menzel and Kristin Chenoweth to help create the role of Fiyero in the 2002 workshop edition of an in-production musical called Wicked. After Wicked's success, the show soon spawned a London production, in which Garcia got to play the role of Fiyero. The show opened 27 September 2006, after previews began 7 September. He played his final performance 14 July 2007. In the latter part of 2008, Garcia appeared in two ITV dramas, Britannia High in which he plays the dance teacher, and Mr Eleven, a two-part comedy/drama alongside Michelle Ryan and Sean Maguire. In January 2010 Garcia appeared alongside Ashley Banjo and Kimberly Wyatt as a judge on the reality show Got To Dance. He also was a judge on Australias' Dancing With The Stars for 2 seasons He made a guest appearance alongside Franki \"Searing\" Sears in Episode 19 (The Choice) on 6 of House. In 2010 Garcia starred in the London West End production of Tap Dogs in the Novello Theatre from 15 June to 5 September. In 2012 Garcia received another Olivier nomination for his performance of Bill Calhoun/Lucentio in Trevor Nunn's revival of Kiss Me Kate at the Old Vic. In 2016, Garcia created Father Damien Karras for Birmingham Repertory Theatre's production of The Exorcist.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzdmMTZmZTktY2U1OC00ZDkyLWJiMzgtZmY4MjU4ZDE1ZTM4XkEyXkFqcGdeQXVyMjA2NzY5MzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0305081","name":"Adam Garcia","idIMDB":"nm0305081"},"actorId":"nm0305081","character":"Jason","urlCharacter":"http://www.imdb.com/character/ch0171523","main":true},{"actorName":"Brittany Murphy","urlProfile":"http://www.imdb.com/name/nm0005261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjM0MzMwNl5BMl5BanBnXkFtZTYwMTU4NDg1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1977","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Brittany Anne Bertolotti","height":"5' 3\" (1.6 m)","bio":"Brittany Murphy was born Brittany Anne Bertolotti on November 10, 1977 in Atlanta, Georgia, to Sharon Kathleen Murphy and Angelo Joseph Bertolotti. Her father's ancestry is Italian, and her mother is of Irish and Slovak descent. Her father moved the family back to Edison, New Jersey as a native New Yorker and to be closer to other siblings from previous marriages. While dining out one night in the presence of Hollywood royalty, Brittany at the age of 5 approached an adjoining table when Academy Award nominee Burt Reynolds and George Segal were seated. Brittany introduced herself to the Hollywood legends and confidently told them that someday she too would be a star. She comes from a long line of international musicians and performers with three half-brothers and a sister. Angelo Bertolotti was torn from their tight-knit family as a made-man with the Italian Mafia. The Senior Bertolotti, who coined the nickname of \"Britt\" for his daughter, was also an entrepreneur and diplomat for organized crime families and one of the first to be subjected to a RICO prosecution. Brittany's interests and well-being were always her father's first goal and objective. To distance his talented daughter from his infamous past, Angelo allowed Sharon to use her maiden for Brittany's, so that her shining star would not be overshadowed by a father's past, with the couple divorcing thereafter. Brittany began receiving accolades and applause in regional theater at the early age of 9. At the age of 13, Brittany landed several national commercials. She appeared on television and caught the attention of a personal manager and an agent. Soon, Brittany's mother Sharon turned full-time to being a \"Stage Mom\" where Angelo provided financial support throughout and their relationship is memorialized with a long and close history in pictures. The hopeful daughter and mother moved to Burbank, CA, where Brittany landed her first television role on Blossom (1990). Hearts and doors opened up for a starring role on Drexell's Class (1991), a short lived TV series. Brittany's big screen movie debut started with Clueless (1995), where she was co-starring with Alicia Silverstone. Britt soared, demonstrating her musical and artistic talents with dramatic and comedic roles landing a nomination for best leading female performance in the Young Artist Awards for her role in the television film David and Lisa (1998). Brittany garnered tremendous attention for her role in Girl, Interrupted (1999) with Academy Award winner Angelina Jolie. Brittany's band, \"Blessed Soul\" was growing with her as lead singer and Britt lent her vocal talents to the TV hit, cartoon sensation, King of the Hill (1997) as the voice of Luanne. Brittany is alleged to have been a witness in the case of the former Department of Homeland Security employee Julia Davis. According to Davis, Brittany and her fiancée Simon Monjack were then targeted for retaliation that included land and aerial surveillance and a threatened prosecution. Monjack was arrested and detained by the Bureau of Immigration and Customs Enforcement (ICE). Brittany and Simon confided in Alex Ben Block of the Hollywood Reporter, telling him in an interview that they were under surveillance by helicopters and their telephones have been wiretapped. This information was published by THR posthumously, in an article entitled \"The Last Difficult Days of Brittany Murphy.\" On December 20, 2009, Brittany Murphy died an untimely death. The LAPD and Los Angeles County Coroner closed the case within one hour, attributing her death to pneumonia and anemia. Five months after Brittany's unexpected demise, her husband Simon Monjack was found dead in the house he shared with Brittany. The chief/spokesperson at the Los Angeles County Dept of Coroner, Craig Harvey, stated that Simon also died from the same exact causes as his wife, namely pneumonia and anemia. Neither Brittany, nor Simon, were given a thorough and complete forensic autopsy for poisons. Brittany's father, Angelo \"AJ\" Bertolotti, is pursuing the investigation of the true reasons behind Brittany's and Simon's sudden demise, as he believes that the two were murdered. Abnormally high levels of heavy metals and poisons were discovered in Brittany's hair, tested by two other independent forensic labs with famed Pathologist, attorney Cyril Wecht concluded from the appearances, Brittany could have been murdered and should be exhumed. Her father Angelo is preparing court actions to ensure Brittany obtains justice.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjM0MzMwNl5BMl5BanBnXkFtZTYwMTU4NDg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005261","name":"Brittany Murphy","nicknames":["Britt"],"idIMDB":"nm0005261"},"actorId":"nm0005261","character":"Fay Forrester","urlCharacter":"http://www.imdb.com/character/ch0116700","main":true},{"actorName":"James Woods","urlProfile":"http://www.imdb.com/name/nm0000249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5ODIxNTcxNV5BMl5BanBnXkFtZTgwMjQ2ODYzMDI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1947","placeOfBirth":" Vernal, Utah, USA","birthName":"James Howard Woods","height":"5' 11\" (1.8 m)","bio":"James Woods is a leanly built, strangely handsome actor-producer-director with intense eyes and a sometimes untrustworthy grin, who has been impressing audiences for over three decades with his compelling performances. James Howard Woods was born on April 18th, 1947 in Vernal, Utah, the son of Martha A. (Smith) and Gail Peyton Woods, a United States Army intelligence officer who died during Woods' childhood. James is of Irish, English, and German descent. He grew up in Warwick, Rhode Island, with his mother and stepfather. He graduated from Pilgrim High School in 1965, near the top of his class. He earned a scholarship to the Massachusetts Institute of Technology; dropping out during his sophomore year in 1967, he then headed off to New York with his fraternity brother Martin Donovan to pursue aspirations to appear on the stage. After appearing in a handful of New York City theater productions, Woods scored his first film role in All the Way Home (1971) and followed that up with meager supporting roles in The Way We Were (1973) and The Choirboys (1977). However, it was Woods' cold-blooded performance as the cop killer in The Onion Field (1979), based on a Joseph Wambaugh novel, that seized the attention of movie-goers to his on-screen power. Woods quickly followed up with another role in another Joseph Wambaugh film adaptation, The Black Marble (1980), as a sleazy and unstable cable-T.V.-station owner in David Cronenberg's mind-bending and prophetic Vidéodrome (1983), as gangster Max Bercovicz in Sergio Leones mammoth epic Il était une fois en Amérique (1984), and scored a best actor Academy Award nomination as abrasive journalist Richard Boyle in Oliver Stone's gritty and unsettling Salvador (1986). There seemed to be no stopping the rise of this star as he continued to amaze movie-goers with his remarkable versatility and his ability to create such intense, memorable characters. The decade of the 1990s started off strongly with high praise for his role as Roy Cohn in the television production of Citizen Cohn (1992). Woods was equally impressive as sneaky hustler Lester Diamond who cons Sharon Stone in Casino (1995), made a tremendous H.R. Haldeman in Nixon (1995), portrayed serial killer Carl Panzram in Killer: A Journal of Murder (1995), and then as accused civil rights assassin Byron De La Beckwith in Ghosts of Mississippi (1996). Not to be typecast solely as hostile hoodlums, Woods has further expanded his range to encompass providing voice-overs for animated productions including Hercules (1997), Hooves of Fire (1999), and Stuart Little 2 (2002). Woods also recently appeared in the critically praised The Virgin Suicides (1999), in the coming-of-age movie Riding in Cars with Boys (2001), as a corrupt medico in Any Given Sunday (1999), and in the comedy-horror spoof Scary Movie 2 (2001). A remarkable performer with an incredibly diverse range of acting talent, Woods remains one of Hollywood's outstanding leading men.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5ODIxNTcxNV5BMl5BanBnXkFtZTgwMjQ2ODYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000249","name":"James Woods","nicknames":["Jimmy"],"idIMDB":"nm0000249"},"actorId":"nm0000249","character":"Mr. Leonard Donofrio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lorraine Bracco","urlProfile":"http://www.imdb.com/name/nm0000966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU0NTc3OTExOF5BMl5BanBnXkFtZTcwMjM0MjcxNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1954","placeOfBirth":" Bay Ridge, Brooklyn, New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"Lorraine was voted the \"ugliest girl in the 6th grade\" at her Long Island grade school. She moved to France in 1974 where she became a fashion superstar for Jean-Paul Gaultier. Her sister is Elizabeth Bracco. Has two daughters, Stella Keitel by ex-boyfriend Harvey Keitel and Margaux Guerard by ex-husband Daniel Guerard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU0NTc3OTExOF5BMl5BanBnXkFtZTcwMjM0MjcxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000966","name":"Lorraine Bracco","idIMDB":"nm0000966"},"actorId":"nm0000966","character":"Mrs. Teresa Donofrio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rosie Perez","urlProfile":"http://www.imdb.com/name/nm0001609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE2ODY5MjU0NV5BMl5BanBnXkFtZTcwMjE3MzQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1964","placeOfBirth":" Bushwick, Brooklyn, New York City, New York, USA","birthName":"Rosa Maria Perez","height":"5' 1½\" (1.56 m)","bio":"Rosie Perez was born in Bushwick, Brooklyn, New York City to Lydia Perez and Ismael Serrano, a merchant marine. She is of Puerto Rican descent. Rosie attended Grover Cleveland High School located in Ridgewood, Queens, New York, and later enrolled at Los Angeles City College in Los Angeles, California. Rosie Perez was in her second year of college, and just about to move back to New York from Los Angeles. Her friends had given her a going away party. When Spike Lee proposed that she work in his film Do the Right Thing (1989), she accepted. It would be first major acting role. She went on play the supporting role of Carla Rodrigo in Peter Weir's Fearless (1993), for which was nominated an Academy Award for Best Supporting Actress (she lost to Anna Paquin for La leçon de piano (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE2ODY5MjU0NV5BMl5BanBnXkFtZTcwMjE3MzQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001609","name":"Rosie Perez","idIMDB":"nm0001609"},"actorId":"nm0001609","character":"Shirley Perro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sara Gilbert","urlProfile":"http://www.imdb.com/name/nm0004960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTAyNjgwOF5BMl5BanBnXkFtZTcwNzI5NTQ0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1975","placeOfBirth":" Santa Monica, California, USA","birthName":"Sara Rebecca Abeles","height":"5' 2\" (1.57 m)","bio":"Sara Gilbert was born on January 29, 1975, as Sara Rebecca Abeles at St. John's Hospital and Health Center in Santa Monica, California, to Harold and Barbara Abeles. Barbara was previously married to the late Paul Gilbert. At the age of six, when Sara saw her sister Melissa Gilbert get a star on the Hollywood Walk of Fame, she told her mother that she wanted to be an actress, too. A string of commercials and, in 1984, an appearance in the CBS TV movie Calamity Jane (1984), led her to adopt the Gilbert family name. After failing to get the new The Facts of Life (1979) show, she eventually found success with Roseanne (1988). Sara spent a total of nine years on that show and was given time to be able to study at Yale University, graduating with honors in 1997. Aside from Roseanne (1988), she has provided the voice of \"Laura Powers\" on The Simpsons (1989), and starred in several movies including Sudie and Simpson (1990), Poison Ivy (1992) and Light It Up (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTAyNjgwOF5BMl5BanBnXkFtZTcwNzI5NTQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004960","name":"Sara Gilbert","idIMDB":"nm0004960"},"actorId":"nm0004960","character":"Tina Barr","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Facinelli","urlProfile":"http://www.imdb.com/name/nm0004906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0ZDkwODctM2QxMi00ODJlLWI2ODMtYjc3MjFlZWFjYjY0L2ltYWdlXkEyXkFqcGdeQXVyNzEwNjQwMTY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1973","placeOfBirth":" Queens, New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Peter Facinelli was born in Queens, New York, the youngest child of Bruna (Reich) and Pierino Facinelli, a waiter. His parents are Italian immigrants, originally from Trentino, Northern Italy. He has three sisters. Peter was educated at St. Francis Preparatory School in Fresh Meadows, New York, and went on to attend St. John's University, but left after a year to follow his interest in acting at the Atlantic Theater Company Acting School, also in New York. There Facinelli was taught by such distinguished actors as Academy Award nominees William H. Macy and Felicity Huffman. He made his screen debut in 1995, appearing in Rebecca Miller's Angela (1995) and has worked consistently ever since. Notable projects include The Price of Love (1995), An Unfinished Affair (1996) (where he met his future wife, Jennie Garth), Touch Me (1997) and The Scorpion King (2002). Facinelli has also had re-occurring roles in such TV shows such as Fastlane (2002), Six Feet Under (2001), Damages (2007) and Nurse Jackie (2009). In 2008, he won the role of Dr. Carlisle Cullen in the wildly popular Twilight (2008) and its sequels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0ZDkwODctM2QxMi00ODJlLWI2ODMtYjc3MjFlZWFjYjY0L2ltYWdlXkEyXkFqcGdeQXVyNzEwNjQwMTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004906","name":"Peter Facinelli","idIMDB":"nm0004906"},"actorId":"nm0004906","character":"Tommy Butcher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mika Boorem","urlProfile":"http://www.imdb.com/name/nm0095561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYyOTA4MGMtYzljYi00OGZiLWJjNTgtMWE1YmQ3YmVhMTdjL2ltYWdlXkEyXkFqcGdeQXVyMjAwMDUxMDc@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1987","placeOfBirth":" Tucson, Arizona, USA","birthName":"Mika Sue Boorem","height":"5' 5\" (1.65 m)","bio":"Mika Boorem is a actress, director, writer, and producer based in Los Angeles. Boorem began directing and producing plays in 2010. Boorem is best known for her acting career that began in 1994. Her feature film credits include Smile, Sleepover, Blue Crush, The Patriot, Along Came a Spider, Hearts in Atlantis, The Ward, Virgin Alexander, Good Day For It, Dirty Dancing: Havana Nights, Jack Frost, A Dark Desire, Carolina, Riding in Cars with Boys, Things You Can Tell Just by Looking at Her, Mighty Joe Young, Trucker and others. She has appeared on Dawson's Creek, House, Touched by an Angel, Ghost Whisperer. She starred in ABC Family's The Initiation of Sarah and the Lifetime Movie drama, Augusta, Gone, for which she won a Prism Award. Her work in Smile was honored at the Stony Brook Film Festival where she received the Rising Star Award. Mika was also nominated for a Teen Choice Award and four Young Artist Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYyOTA4MGMtYzljYi00OGZiLWJjNTgtMWE1YmQ3YmVhMTdjL2ltYWdlXkEyXkFqcGdeQXVyMjAwMDUxMDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095561","name":"Mika Boorem","idIMDB":"nm0095561"},"actorId":"nm0095561","character":"Beverly Donofrio - Age 11","urlCharacter":"http://www.imdb.com/character/ch0045583","main":true},{"actorName":"Celine Marget","urlProfile":"http://www.imdb.com/name/nm0546650","urlPhoto":"","biography":{"dateOfBirth":"27 November 1990","placeOfBirth":" New York City, New York, USA","bio":"Celine Marget was born on November 27, 1990 in New York City, New York, USA. She is an actress, known for Riding in Cars with Boys (2001), Personal Sergeant (2004) and Out of the Box (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0546650","name":"Celine Marget","idIMDB":"nm0546650"},"actorId":"nm0546650","character":"Janet Donofrio - Age 8","urlCharacter":"http://www.imdb.com/character/ch0171664","main":true},{"actorName":"Vincent Pastore","urlProfile":"http://www.imdb.com/name/nm0665114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDMxNDA3NV5BMl5BanBnXkFtZTYwNDE3OTU1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1946","placeOfBirth":" Bronx, New York, USA","height":"5' 10\" (1.78 m)","bio":"Vincent Pastore was born on July 14, 1946 in Bronx, New York, USA. He is an actor and producer, known for One Life to Live (1968), Revolver (2005) and Goodfellas (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDMxNDA3NV5BMl5BanBnXkFtZTYwNDE3OTU1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665114","name":"Vincent Pastore","nicknames":["Vinny"],"idIMDB":"nm0665114"},"actorId":"nm0665114","character":"Uncle Lou","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maryann Urbano","urlProfile":"http://www.imdb.com/name/nm0881690","urlPhoto":"","biography":{"bio":"Maryann Urbano is an actress, known for All My Children (1970), American Gangster (2007) and Julie & Julia (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0881690","name":"Maryann Urbano","idIMDB":"nm0881690"},"actorId":"nm0881690","character":"Aunt Ann","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alissa Dean","urlProfile":"http://www.imdb.com/name/nm0992977","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2OTgwMzkxNl5BMl5BanBnXkFtZTgwNTgwNTg2MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Alissa Dean is an NYU graduate with a Bachelor of Music and Performing Arts. As a child, she caught the acting bug early and went on to work in commercials, voiceover and regional theatre. Alissa says she truly found her voice as an actor through her studies with acting luminary Fred Karemen in NYC. When she began getting flown to L.A. to test for TV shows, Alissa felt it was time to make the leap to the west coast. Since moving to Los Angeles, she has been fortunate enough to work with some of her favorite directors and actors through the years and enjoys balancing her acting with her other passion, screenwriting. As a writer, Alissa is an Academy Nicholl Fellowship in Screenwriting semi-finalist for her first screenplay, the indie comedy \"Cricket\", which placed in the top 1 % of all entries. Alissa's play \"Survivors\" will have its Los Angeles premiere in January 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2OTgwMzkxNl5BMl5BanBnXkFtZTgwNTgwNTg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0992977","name":"Alissa Dean","idIMDB":"nm0992977"},"actorId":"nm0992977","character":"Townie Girl #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Leshnower","urlProfile":"http://www.imdb.com/name/nm0997360","urlPhoto":"","biography":{"dateOfBirth":"6 April 1979","placeOfBirth":"","bio":"Jessica Leshnower was born on April 6, 1979. She is an actress, known for Riding in Cars with Boys (2001), Finding Forrester (2000) and Uncle Bob (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0997360","name":"Jessica Leshnower","idIMDB":"nm0997360"},"actorId":"nm0997360","character":"Townie Girl #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0200027","urlIMDB":"http://www.imdb.com/title/tt0200027","business":{"budget":{"money":"$48,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,404,652","country":"USA","day":"21","month":"10","year":"2001","remarks":"2,770 Screens"},{"money":"£237,279","country":"UK","day":"09","month":"12","year":"2001","remarks":"256 Screens"}],"gross":[{"money":"$29,781,453","country":"USA","day":"09","month":"12","year":"2001","remarks":""},{"money":"$29,726,651","country":"USA","day":"02","month":"12","year":"2001","remarks":""},{"money":"$29,601,298","country":"USA","day":"25","month":"11","year":"2001","remarks":""},{"money":"$29,175,810","country":"USA","day":"18","month":"11","year":"2001","remarks":""},{"money":"$27,771,372","country":"USA","day":"11","month":"11","year":"2001","remarks":""},{"money":"$24,562,107","country":"USA","day":"04","month":"11","year":"2001","remarks":""},{"money":"$19,102,783","country":"USA","day":"28","month":"10","year":"2001","remarks":""},{"money":"$10,404,652","country":"USA","day":"21","month":"10","year":"2001","remarks":""},{"money":"£671,549","country":"UK","day":"23","month":"12","year":"2001","remarks":""},{"money":"£546,762","country":"UK","day":"16","month":"12","year":"2001","remarks":""},{"money":"£237,279","country":"UK","day":"09","month":"12","year":"2001","remarks":""},{"money":"$5,577,772 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"€320,493","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"weekendGross":[{"money":"$41,606","country":"USA","day":"09","month":"12","year":"2001","remarks":"114 Screens"},{"money":"$89,213","country":"USA","day":"02","month":"12","year":"2001","remarks":"196 Screens"},{"money":"$208,786","country":"USA","day":"25","month":"11","year":"2001","remarks":"267 Screens"},{"money":"$715,256","country":"USA","day":"18","month":"11","year":"2001","remarks":"962 Screens"},{"money":"$2,105,466","country":"USA","day":"11","month":"11","year":"2001","remarks":"2,182 Screens"},{"money":"$4,056,350","country":"USA","day":"04","month":"11","year":"2001","remarks":"2,554 Screens"},{"money":"$6,011,394","country":"USA","day":"28","month":"10","year":"2001","remarks":"2,770 Screens"},{"money":"$10,404,652","country":"USA","day":"21","month":"10","year":"2001","remarks":"2,770 Screens"},{"money":"£45,396","country":"UK","day":"23","month":"12","year":"2001","remarks":"110 Screens"},{"money":"£189,450","country":"UK","day":"16","month":"12","year":"2001","remarks":"246 Screens"},{"money":"£237,279","country":"UK","day":"09","month":"12","year":"2001","remarks":"256 Screens"}],"admissions":[{"money":"74,375","country":"Spain","day":"10","month":"08","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"28","month":"08","year":"2000","remarks":null},{"money":null,"country":null,"day":"01","month":"02","year":"2001","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["2 hr 12 min (132 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Moviecam Compact"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Technicolor, New York (NY), USA"],"filmLength":["3,678 m (Spain)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"6.5","metascore":"43","filmingLocations":[{"location":"New Jersey, USA"}],"rated":"PG-13","awards":[{"award":"Cabourg Romantic Film Festival 2002","titlesAwards":[{"titleAwardOutcome":"Won Golden Swann","categories":[{"category":"","names":[{"name":"Penny Marshall","id":"nm0001508","role":null}]}]}]},{"award":"Prism Awards 2002","titlesAwards":[{"titleAwardOutcome":"Won Prism Commendation","categories":[{"category":"Theatrical Feature Film","names":[]}]}]},{"award":"Teen Choice Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Film - Choice Actress, Drama/Action Adventure","names":[{"name":"Drew Barrymore","id":"nm0000106","role":null}]}]}]},{"award":"Young Artist Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Young Actress Age Ten or Under","names":[{"name":"Skye McCole Bartusiak","id":"nm0566084","role":null}]}]}]}],"votes":"23,264","type":"Movie","companyCreditsSimple":[{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0035761","name":"Gracie Films"},{"idCompany":"co0063736","name":"Parkway Productions"}],"keywords":{"keywords":["woman","writer","boy","college","working class","heroin","party","single mother","new york","female director","f rated","tween girl","police car","car","female protagonist","woman holding a baby","five word title","marijuana","title directed by female","giving birth","childbirth","birth","baby born","pregnant schoolgirl","pregnant teen","pregnant teenager","expectant father","expectant mother","pregnant wife","pregnant bride","wallingford connecticut","voice over narration","urination","unemployment","trailer home","teenage boy","tears","sister sister relationship","self destructiveness","remarriage","prologue","policeman","nonlinear timeline","marital problem","loser","italian american","husband wife relationship","girl","friendship","flashback","flash forward","father daughter relationship","family relationships","crying","child raising a child","baby","autism","absent father","1980s","teenage marriage","child drowning","parenthood","teenage girl","autistic savant","single parent","education","dysfunctional marriage","drug addiction","based on autobiography","diaper change","defecation","prodigal child","unrequited love","1970s","swimming pool","bankruptcy","sex in a car","book","caught having sex","police officer","falling down stairs","bidet","sex","friend","heroin addict","teenage pregnancy","pregnancy","coming of age","christmas","1960s","poet","wedding","mother son relationship","forbidden love","destiny","scholarship","foggy window","manic depression","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:09:00"}}