{"data":{"movies":[{"title":"Comic Book Villains","originalTitle":"","year":"2002","releaseDate":"20020903","directors":[{"name":"James Robinson","id":"nm0732702"}],"writers":[{"name":"James Robinson","id":"nm0732702"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzQxMzg3Nl5BMl5BanBnXkFtZTcwODEyMzQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Told from the point of view from Archie, a comic book collector, this is the story of a rivalry between two comic book shop owners. One does it for the love of comics, while the other shop, run by a husband-and-wife team are in it strictly for the money. The situation brews to a head when a sneak collector, Conan discovers a large collection of perfectly-preserved classic comics, leading the two shops to vie to acquire them, along with a \"villain\" who hopes to steal them first.","simplePlot":"Told from the point of view from Archie, a comic book collector, this is the story of a rivalry between two comic book shop owners. One does it for the love of comics, while the other shop,... ","actors":[{"actorName":"Donal Logue","urlProfile":"http://www.imdb.com/name/nm0006610","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzI1NjQxNl5BMl5BanBnXkFtZTcwMzE2MzI0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1966","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Donal Francis Logue","height":"5' 11\" (1.8 m)","bio":"Donal Logue's versatility and talent makes him one of the most well respected and beloved actors today. Born in Ottawa, Canada, Logue moved all over the United States, from the Boston area as an infant to various towns on the Mexican border. He returned to Boston to attend Harvard University, where he majored in Intellectual History and discovered his love for the performing arts. While in college, he appeared in over thirty plays, worked for two summers in the American Repertory Theatre's Harvard/Radcliffe Summer Stock Company, and spent a short time doing theatre in England. After graduating, Logue joined the Cornerstone Theatre Company which developed community theatre in rural parts of the United States. From then on Logue dedicated himself to pursuing his passion for acting. In his 20 plus years in the industry, Logue has starred in films such as, The Tao of Steve, the story of a larger-than-life, philosophizing lothario, which debuted at the Sundance Film Festival, and won him a Special Jury Prize for Outstanding Performance. His other film credits include Sneakers, Gettysburg, Blade, Runaway Bride, Reindeer Games, The Million Dollar Hotel, Comic Book Villains with Michael Rapaport, Confidence, Just Like Heaven, and The Groomsmen with Ed Burns. Recently, Donal co-starred in Max Payne with Mark Wahlberg, as well as Charlie St. Cloud with Zac Ephron. He also appeared in Zodiac, directed by David Fincher, based on the Robert Graysmith books about the notorious Zodiac serial killer. Following the US release of Zodiac, he co-starred in Mark Steven Johnson's Ghost Rider with Nicolas Cage and Eva Mendes. Logue made his directorial debut with the independent film Tennis, Anyone?, which appeared at the US Comedy Arts Festival. He wrote, starred, and directed the film about two Hollywood has-beens who try and find meaning in their lives through a series of celebrity tennis tournaments. In television, Logue joined the cast of the NBC series \"LIFE\" about a former police officer who returns to the force after having been wrongly imprisoned for years. In 2007, he headlined the critically lauded ABC comedy \"The Knights of Prosperity\" in which a group of blue collar guys band together to plan a heist of Mick Jagger's New York City apartment. Prior to \"The Knights of Prosperity\" Logue starred in the Carsey-Warner produced show, \"Grounded for Life\" which aired for five seasons. He was also featured in a recurring role on \"ER\" as Sherry Stringfield's love interest. In 2010, Logue finished a critically acclaimed season on \"Terriers,\" a television series created by Ted Griffin and Shawn Ryan for FX. He begins production on the Marc Cherry pilot \"Hallelujah\" for ABC in March of 2011. Logue lives in Los Angeles and has two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzI1NjQxNl5BMl5BanBnXkFtZTcwMzE2MzI0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006610","name":"Donal Logue","idIMDB":"nm0006610"},"actorId":"nm0006610","character":"Raymond McGillicudy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cary Elwes","urlProfile":"http://www.imdb.com/name/nm0000144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUxNzY3NTAxNF5BMl5BanBnXkFtZTgwNjU4MDU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1962","placeOfBirth":" London, England, UK","birthName":"Ivan Simon Cary Elwes","height":"6' (1.83 m)","bio":"Cary Elwes was born in Westminster, London, England, the third son of interior designer/shipping heiress Tessa Georgina Kennedy and the late portrait painter Bede Evelyn Dominick Elwes. He is the brother of producer/agent Cassian Elwes and artist Damian Elwes. He was raised in London and attended Harrow. After graduating from Harrow, he moved to the US and studied drama at Sarah Lawrence College. He left school after two years to begin his film career. Cary is well respected by colleagues and fans alike and considered by many to be one of the finest young actors working today. He is interested in history and says, \"It's deliberate that a lot of my films have been period pieces\". He is politically active for causes he believes in, such as protecting the environment and helping Native American people. Elwes is married to Lisa Marie Kurbikoff, a stills photographer. He comes from a long-established recusant English family on his father's side. Several prominent Catholic clerics are among his relatives, including Fr. Luke Cary-Elwes, Dom Columba Cary-Elwes, and Dom Cuthbert Cary-Elwes. His paternal great-grandfather was Chamberlain to the Pope. Cary (the surname \"Cary-Elwes\" was shortened to \"Elwes\" in some branches of the family) was an altar boy at London's Brompton Oratory, although he did not attend a Catholic high school. From his maternal grandmother, Daska Marija Ivanovic-Banac, who was born in Osijek in the Austra-Hungarian Empire (now in Croatia), he has Croatian Jewish and Serbian ancestry. Cary's other lineage is English, Irish, and Scottish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUxNzY3NTAxNF5BMl5BanBnXkFtZTgwNjU4MDU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000144","name":"Cary Elwes","idIMDB":"nm0000144"},"actorId":"nm0000144","character":"Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Rapaport","urlProfile":"http://www.imdb.com/name/nm0001650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTQ0NTI1M15BMl5BanBnXkFtZTcwMjEwNTA3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1970","placeOfBirth":" New York City, New York, USA","birthName":"Michael David Rapaport","height":"6' 2½\" (1.89 m)","bio":"A true New Yorker through and through, Michael Rapaport was born in Manhattan, to June Brody, a radio personality, and David Rapaport, a radio program manager. He is of Polish Jewish and Russian Jewish descent. Rapaport moved to Los Angeles to try stand-up comedy following high school graduation (which came after a series of expulsions), but he never lost, forgot nor deserted his New York roots. It's embedded in his work and is a major part of his low-keyed charm and ongoing appeal. His early idols were also New Yorkers (Robert De Niro, Christopher Walken, etc.). He toiled only briefly in L.A. Within a short amount of time Michael moved from the live comedy stage to working in front of a camera. The two developed an immediate rapport. A guest spot on the TV series China Beach (1988) led to a starring role in the quirky interracial indie Zebrahead (1992), which clinched it for him. This, in turn, led to a string of standout parts in films, such as Christian Slater's pal in True Romance (1993), an edgy collegiate-turned-skinhead in Higher Learning (1995) and a sympathetic none-too-bright boxer in Woody Allen's Mighty Aphrodite (1995), all enabling him to build up a higher profile. In later years he managed to show his ease at offbeat comedy, demonstrating a kid-like, goofy charm as Lisa Kudrow's cop boyfriend for a few episodes on Friends (1994) and as teacher Danny Hanson on Boston Public (2000). Lately he has formed his own production company, Release Entertainment, in search of that one big breakout role that could nab top stardom for him. Rapaport married writer Nicole Beatty in 2000, and they have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTQ0NTI1M15BMl5BanBnXkFtZTcwMjEwNTA3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001650","name":"Michael Rapaport","idIMDB":"nm0001650"},"actorId":"nm0001650","character":"Norman Link","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natasha Lyonne","urlProfile":"http://www.imdb.com/name/nm0005169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMzc2MTE2MzheQTJeQWpwZ15BbWU4MDUwNTY0ODYx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1979","placeOfBirth":" New York City, New York, USA","height":"5' 3½\" (1.61 m)","bio":"Natasha Lyonne is an American stage, film, and television actress. As a young child, she was signed by the Ford Modeling Agency and, at the age of six, was cast as a role in Pee-Wee's Playhouse. Natasha remained busy with appearances in almost 30 films over the next 10 years, including some starring roles in independent films. Lyonne is perhaps best-known for her roles in the \"American Pie\" films as the wise-cracking \"Jessica\". After a hiatus in 2008, due to well-documented health and legal struggles, Lyonne returned to work, As a young child, she was signed by the Ford Modeling Agency and, at the age of six, she was cast as \"Opal\" on Pee-wee's Playhouse (1986), which was quickly followed by film appearances in Heartburn (1986), written by Nora Ephron, directed by Mike Nichols; A Man Called Sarge (1990); and Dennis the Menace (1993), with Walter Matthau and Christopher Lloyd. At the age of 16, Woody Allen cast her as his and Goldie Hawn's daughter in Everyone Says I Love You (1996), alongside Julia Roberts, Edward Norton, Natalie Portman, which led to appearances in almost 30 films over the next 10 years, including starring roles in the independent films Slums of Beverly Hills (1998) and But I'm a Cheerleader (1999). Lyonne's other films included Detroit Rock City (1999); Scary Movie 2 (2001); The Grey Zone (2001), directed by Tim Blake Nelson; James Mangold's Kate & Leopold (2001); Party Monster (2003); Die, Mommie, Die! (2003) and Blade: Trinity (2004), as well as TV appearances on shows including NBC's Will & Grace (1998). Lyonne is perhaps best-known for her roles in the \"American Pie\" films as the wise-cracking \"Jessica\". After a short hiatus in 2008, due to well-documented health and legal struggles, Lyonne returned to work, making her New York stage debut in the award-winning New Group production of Mike Leigh's \"Two Thousand Years\" and in the films The Immaculate Conception of Little Dizzle (2009) and Goyband (2008). Since then, Lyonne has steadily worked in the New York theatre scene, in film and on television. Films include All About Evil (2010) with Thomas Dekker; Abel Ferrara's 4:44 Last Day on Earth (2011) with Willem Dafoe; and upcoming projects Girl Most Likely (2012) (aka \"Imogene\") with Kristen Wiig, Darren Criss, Matt Dillon and Annette Bening; The Rambler (2013) with Dermot Mulroney; Clutter (2013) with Carol Kane and Kathy Najimy; He's Way More Famous Than You (2013), written by Halley Feiffer and directed by Michael Urie, with Ben Stiller and Jesse Eisenberg. TV appearances include the hit series, New Girl (2011) and Law & Order: Special Victims Unit (1999). On stage, she was in the original cast of Nora Ephron and Delia Ephron's award-winning \"Love, Loss, and What I Wore\" with Samantha Bee, Tyne Daly, Katie Finneran and Rosie O'Donnell and in the original cast in Los Angeles at Geffen Playhouse with Tracee Ellis Ross, Carol Kane and Rita Wilson. She received rave reviews in Kim Rosenstock's \"Tigers Be Still\", directed by Sam Gold, with Reed Birney, Halley Feiffer, John Magaro at the Roundabout Theatre Company and returned this past season to the New Group stage with Ethan Hawke, Gordon Clapp and Daphne Rubin-Vega in Tommy Nohilly's \"Blood From a Stone\". Most recently, she participated in New Group's benefit performance of \"Women Behind Bars\", with Charles Busch, Josh Hamilton, Cynthia Nixon, Rhea Perlman and Rosie O'Donnell. Natasha was born Natasha Bianca Lyonne Braunstein in New York City, New York, to Ivette (Buchinger) and Aaron Braunstein, who is a talk radio host, boxing promoter, and race car driver. She is from a Jewish family. Her maternal grandparents, originally from Hungary, were Holocaust survivors who moved to Paris, France, where Natasha's mother was born.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMzc2MTE2MzheQTJeQWpwZ15BbWU4MDUwNTY0ODYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005169","name":"Natasha Lyonne","idIMDB":"nm0005169"},"actorId":"nm0005169","character":"Judy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"DJ Qualls","urlProfile":"http://www.imdb.com/name/nm0702809","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNjgzMzg3NjZeQTJeQWpwZ15BbWU3MDE0OTM5NDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1978","placeOfBirth":" Nashville, Tennessee, USA","birthName":"Donald Joseph Qualls","height":"6' 1\" (1.85 m)","bio":"DJ Qualls grew up in the small city of Manchester in Tennessee, USA, one of five children. After studying in the UK at King's College, University of London, he returned to Tennessee where he began acting in a local theatre. During that time, he was discovered by photographers David La Chappelle and Steve Klein, which led to modeling work for Prada, as well as other advertising campaigns. In addition to his professional accomplishments, Qualls is proud to be a cancer survivor and an advocate for cancer research and awareness. Qualls made his feature film debut in Road Trip (2000). Qualls is also seen in the comedy thriller Cherry Falls (2000), in which he co-stars with Jay Mohr, Brittany Murphy, and Gabriel Mann in a story of the killings of virgins in a small town high school. His earlier credits include the miniseries Mama Flora's Family (1998), based on the book by Alex Haley, and \"Against The Wall\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNjgzMzg3NjZeQTJeQWpwZ15BbWU3MDE0OTM5NDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0702809","name":"DJ Qualls","nicknames":["Deej"],"idIMDB":"nm0702809"},"actorId":"nm0702809","character":"Archie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eileen Brennan","urlProfile":"http://www.imdb.com/name/nm0107281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxODQ5MDAxM15BMl5BanBnXkFtZTcwNzkzMDYwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1932","placeOfBirth":" Los Angeles, California, USA","birthName":"Verla Eileen Regina Brennen","height":"5' 6\" (1.68 m)","bio":"A supremely gifted, versatile player who could reach dramatic depths, as exemplified in her weary-eyed, good-hearted waitress in The Last Picture Show (1971), or comedy heights, as in her sadistic drill captain in Private Benjamin (1980), Eileen Brennan managed to transition from lovely Broadway singing ingénue to respected film and television character actress within a decade's time. Her Hollywood career was hustling and bustling at the time of her near-fatal car accident in 1982. With courage and spirit, she recovered from her extensive facial and leg injuries, and returned to performing... slower but wiser. On top of all this, the indomitable Eileen survived a bout of alcoholism and became recognized as a breast cancer survivor, having had a mastectomy in 1990. On camera, she still tosses out those trademark barbs to the delight of all her fans, as demonstrated by her more-recent recurring roles as the prying Mrs. Bink on 7th Heaven (1996) and as Zandra, the disparaging acting coach, on Will & Grace (1998). She was born with the highly unlikely marquee name of Verla Eileen Regina Brennan in Los Angeles, California, the child of Irish-Catholic parents Regina (\"Jeanne\") Manahan (or Menehan), a minor silent film player, and John Gerald Brennan, a doctor. Following grade school education, she attended Georgetown University in Washington, D.C. and appeared in plays with the Mask and Bauble Society during that time. She then went on to study at the American Academy of Dramatic Arts in New York. Her lovely soprano coupled with a flair for comedy was the winning combination that earned her the break of her budding career as the not-so-dainty title role in the off-Broadway, tongue-in-cheek operetta \"Little Mary Sunshine\". For this 1959 endeavor, Eileen not only won an Obie Award, but was among an esteemed group of eight other thespians who won the Theatre World Award that year for \"Promising New Personality\", including Warren Beatty, Jane Fonda, Carol Burnett and a very young Patty Duke. Unwilling to be pigeonholed as a singing comedienne, Eileen took on one of the most arduous and demanding legit roles a young actress could ask for when she portrayed Annie Sullivan role in a major touring production of \"The Miracle Worker\" in 1961. After proving her dramatic mettle, she returned willingly to the musical theatre fold and made a very beguiling Anna in a production of \"The King and I\" (1963). She took her first Broadway bow in another comic operetta, \"The Student Gypsy\" (1963). In the musical, which was an unofficial sequel to her \"Mary Sunshine\" hit, she played a similarly-styled Merry May Glockenspiel, but the show lasted only a couple of weeks. Infinitely more successful was her deft playing of Irene Malloy alongside Carol Channing's Dolly Levi Gallagher in the original Broadway production of \"Hello, Dolly!\" (1964). Eileen stayed with the role for about two years. By this time, Hollywood beckoned and Eileen never looked back... or returned to sing on Broadway. After a support role in the film comedy Divorce American Style (1967) starring Debbie Reynolds and Dick Van Dyke, Eileen's talents were selected to be showcased on the irreverent variety show Rowan & Martin's Laugh-In (1967). But what seemed to be an ideal forum to show off her abilities didn't. Overshadowed by the wackier talents of Goldie Hawn, Ruth Buzzi and Jo Anne Worley, who became television comedy stars from this, Eileen seemed out of sync with the knockabout slapstick element. She left the cast before the show barely got off the ground. \"Laugh-In\" (1968-1973) went on to become a huge cult hit. In retrospect, this disappointment proved to be a boon to Eileen's dramatic film career. Set in a dusty, barren town, she played up her hard looks and earned terrific reviews for her downbeat role of Genevieve, the careworn waitress, in Peter Bogdanovich's The Last Picture Show (1971). As part of a superb ensemble cast, her hard-knocks vulnerability and earthy sensuality added authenticity to the dreary Texas surroundings. Following this, she scored great marks for her brothel madam/confidante in George Roy Hill's ragtime-era Oscar winner The Sting (1973). Bogdanovich himself became a fan and used Eileen again and again in his subsequent films -- the ambitious but lackluster Daisy Miller (1974) and At Long Last Love (1975). At least, the latter movie allowed her to show off her singing voice. Her comedic instincts were on full display too in the all-star mystery spoofs Murder by Death (1976) and The Cheap Detective (1978) where she fared quite well playing take-it-on-the-chin dames. Eileen hit the apex of her comic fame playing the spiky and spiteful drill captain who mercilessly taunts and torments tenderfoot Goldie Hawn in the huge box-office hit Private Benjamin (1980). She deservedly earned a \"best supporting actress\" Oscar nomination for her scene-stealing contribution and was given the chance to reprise the role on the television series that followed. Starring Lorna Patterson in the Hawn role, Private Benjamin (1981) was less successful in its adaptation to the smaller screen but Eileen was better than great and earned both Emmy and Golden Globe Awards in the process. During the show's run in 1982, Brennan had dinner one evening with good friend Goldie Hawn at a Los Angeles restaurant. They had already parted ways when Brennan was hit and critically injured by a car while crossing a street. Replaced in the television series (by \"Alice\" co-star Polly Holliday), her recovery and rehabilitation lasted three years, which included an addiction to painkillers. She returned to the screen in another amusing all-star comedy whodunit, Clue (1985), in which she played one of the popular game board suspects, Mrs. Peacock. While looking weaker and less mobile, she showed she had lost none of the disarming causticity that made her a character star. Forging ahead, Eileen went on to recreate her tough luck waitress character in Texasville (1990), the sequel to The Last Picture Show (1971), and also appeared with Bette Midler in the overly mawkish Stella (1990). However, for the most part, she lent herself to playing eccentric crab apples in such lightweight fare as Rented Lips (1988), Sticky Fingers (1988), Changing Habits (1997), Pants on Fire (1998), Jeepers creepers - Le chant du diable (2001), Miss Congeniality 2: Armed and Fabulous (2005) and Naked Run (2011). She has also provided crotchety animated voices for series cartoons. Eileen Brennan died at age 80 on July 28, 2013 at her Burbank, California home after a battle with bladder cancer. She is survived by her two sons, Patrick (formerly a basketball player, now an actor) and Sam (a singer), from her first and only marriage in the late 1960s to mid-1970s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxODQ5MDAxM15BMl5BanBnXkFtZTcwNzkzMDYwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107281","name":"Eileen Brennan","idIMDB":"nm0107281"},"actorId":"nm0107281","character":"Mrs. Cresswell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monet Mazur","urlProfile":"http://www.imdb.com/name/nm0005195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjM3ODAzOF5BMl5BanBnXkFtZTcwMDEzNjA2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1976","placeOfBirth":" Los Angeles, California, USA","birthName":"Monet Happy Mazur","height":"5' 9\" (1.75 m)","bio":"Monet Mazur has been in the entertainment industry and acting professionally since 1993. Mazur grew up in Malibu and New York, the daughter of Ruby Mazur, a record industry artist, and Valerie Chasin, who was a fashion model in the late 60s and 70s. After small roles in TV and film, Mazur finally earned a spate of \"actress on the verge of stardom\" articles when she was cast in a meatier role as one of Johnny Depp's stoner cohorts in Blow (2001) where she first captured audiences attention. Mazur continued to register on the movie radar with a dramatic turn as Jennifer Lopez's abused sister-in-law in Angel Eyes (2001), and a starring role as a seductive con artist in the independent crime drama The Learning Curve (1999). Returning to lighter work, Monet starred alongside Josh Hartnett in the romantic comedy 40 Days and 40 Nights (2002). In 2002 Mazur landed her first well known starring role in the Warner Brother action film Torque (2004) with Ice Cube. She also worked along side Jane Fonda and Jennifer Lopez in the hit Sa mère ou moi! (2005) and achieved much notoriety for portraying Rolling Stone icon Anita Pallenberg in the British biopic Stoned (2005) about the life of Brian Jones. Among dozens of other films Mazur has sang and performed on many soundtracks and done guest vocals on numerous albums including Tricky, the upcoming Sneakerpunk record, and the Dust Brothers. She has performed with The Pussycat Dolls as well as fronted her own band Nancy Raygun that became Hollywood darlings in the music scene in early 2000. In 2008 the Sony studio movie produced by Adam Sandler's production company released the highly anticipated comedy The House Bunny (2008), where Monet played the villainous playboy bunny Cassandra. Monet presently lives Los Angeles with her husband screen writer and director Alex De Rakoff and their son Marlon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjM3ODAzOF5BMl5BanBnXkFtZTcwMDEzNjA2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005195","name":"Monet Mazur","idIMDB":"nm0005195"},"actorId":"nm0005195","character":"Kiki","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Masterson","urlProfile":"http://www.imdb.com/name/nm0005194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTU0MDA3OV5BMl5BanBnXkFtZTcwMTYwMzMzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1976","placeOfBirth":" Long Island, New York, USA","birthName":"Daniel Peter Masterson","height":"5' 10\" (1.78 m)","bio":"Danny Masterson was born on March 13, 1976 in Long Island, New York, USA as Daniel Peter Masterson. He is an actor and producer, known for That '70s Show (1998), Yes Man (2008) and Face/Off (1997). He has been married to Bijou Phillips since October 18, 2011. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTU0MDA3OV5BMl5BanBnXkFtZTcwMTYwMzMzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005194","name":"Danny Masterson","nicknames":["DJ Donkey Punch","DJ Mom Jeans"],"idIMDB":"nm0005194"},"actorId":"nm0005194","character":"Conan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Duval","urlProfile":"http://www.imdb.com/name/nm0001166","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTgxNDQ5N15BMl5BanBnXkFtZTcwMzUwOTcyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1972","placeOfBirth":" Detroit, Michigan, USA","birthName":"James Edward Duval","height":"5' 9\" (1.75 m)","bio":"Born in Detroit, Michigan in 1972. He moved to Los Angeles, California in 1974 where his sister Terry Duval (his only sibling) was born. He attended Gladstone High School in Covina, California from 1986 to 1989 as well attending Mira Costa High School in Manhattan Beach, and Fair Valley in Covina. Although he was trained as a classical pianist as a child he eventually moved to the guitar. He used to play for \"Antoneus Maximus & The Nuthouze Band\" who had been playing gigs at local venues in Los Angeles. 2004 saw them working on their 1st album which included guest appearances by such luminaries as 'Apl.de.Ap', 'DjMotiv8' and 'Dante Santiago' from \"Black Eyed Peas\" as well as 'Kid' (Chris) from \"Kid'N'Play\". He practices/teaches Hatha Yoga in between films and now plays Guitar/Piano and sings in the band \"Gene Wilder\" with friends and fellow actors \"Brian McGuire\" and Brett Roberts\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTgxNDQ5N15BMl5BanBnXkFtZTcwMzUwOTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001166","name":"James Duval","nicknames":["Jimmy"],"idIMDB":"nm0001166"},"actorId":"nm0001166","character":"Baz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marshall Bell","urlProfile":"http://www.imdb.com/name/nm0068382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODI4NzU1NV5BMl5BanBnXkFtZTgwMzE2ODIwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1942","placeOfBirth":" Tulsa, Oklahoma, USA","birthName":"Archibald Marshall Bell","height":"6' 1¼\" (1.86 m)","bio":"A tall, imposing character actor with a penetrating stare, Marshall Bell has provided excellent support in a variety of roles and genres. He was born in Tulsa, Oklahoma, on September 28, 1942, and had been working as a consultant, teaching senior executives how to improve their speaking skills, prior to starting an acting career relatively late in life. His connection was his wife, the veteran costume designer Milena Canonero, herself a winner of three Academy Awards and nominee for five more. He made his motion picture debut in the drama \"Birdy\", which was seen by enough people to effectively jump-start his career. One of his next few roles was one of his most infamous: the creepy Coach Schneider of \"A Nightmare on Elm Street Part 2: Freddy's Revenge\". But the role that really got him noticed was as resistance leader George / Kuato in \"Total Recall\" (the role re-united him with Arnold Schwarzenegger, as he'd played a hit man in the comedy \"Twins\"). Other substantial film roles include a frightening homeless man terrorizing Bill Paxton in the movie \"The Vagrant\", Gordies' emotionally distant father in \"Stand By Me\", and General Owen in the movie \"Starship Troopers\", re-uniting him with \"Total Recall\" director Paul Verhoeven. He's done many TV series, including 'G vs. E', 'Wiseguy', 'The X-Files', 'Tales from the Crypt', 'Hill Street Blues', 'House', and 'Deadwood'. He's also appeared in commercials and done voice-over work. A solid, reliable actor with an authoritative presence, Bell is a natural for playing \"tough guy\" roles, although movies like \"Airheads\" show him to be able to play comedy equally well. He continues to add many credits to his resume, including the critically acclaimed \"Capote\", the prisoner of war drama \"Rescue Dawn\", and the family film \"Nancy Drew\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODI4NzU1NV5BMl5BanBnXkFtZTgwMzE2ODIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068382","name":"Marshall Bell","idIMDB":"nm0068382"},"actorId":"nm0068382","character":"Gun Store Order","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Weber","urlProfile":"http://www.imdb.com/name/nm0916521","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjUyMTYyMF5BMl5BanBnXkFtZTcwNDUwNDg2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1971","placeOfBirth":" El Paso, Texas, USA","height":"5' 11\" (1.8 m)","bio":"Chris Weber was born on March 13, 1971 in El Paso, Texas, USA. He is an actor and assistant director, known for Watchmen (2009), Wishmaster 2: Evil Never Dies (1999) and American Badass: Bernie's Back! (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjUyMTYyMF5BMl5BanBnXkFtZTcwNDUwNDg2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0916521","name":"Chris Weber","idIMDB":"nm0916521"},"actorId":"nm0916521","character":"Tony","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denny Kirkwood","urlProfile":"http://www.imdb.com/name/nm0456799","urlPhoto":"","biography":{"dateOfBirth":"20 March 1975","placeOfBirth":" Olympia, Washington, USA","bio":"Denny Kirkwood was born on March 20, 1975 in Olympia, Washington, USA. He is an actor and producer, known for Never Been Kissed (1999), Groove (2000) and Fine. (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0456799","name":"Denny Kirkwood","idIMDB":"nm0456799"},"actorId":"nm0456799","character":"Dino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Irene Montalà","urlProfile":"http://www.imdb.com/name/nm0598890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTUxNDUwN15BMl5BanBnXkFtZTcwODE2NjUzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1976","placeOfBirth":" Barcelona, Barcelona, Catalonia, Spain","bio":"Irene Montalà was born on July 18, 1976 in Barcelona, Barcelona, Catalonia, Spain. She is an actress, known for Poble Nou (1994), Mar de fons (2006) and The Boat (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTUxNDUwN15BMl5BanBnXkFtZTcwODE2NjUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0598890","name":"Irene Montalà","idIMDB":"nm0598890"},"actorId":"nm0598890","character":"Woman in Barcelona","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donal Lardner Ward","urlProfile":"http://www.imdb.com/name/nm0911505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjIyMzE1Ml5BMl5BanBnXkFtZTcwMjEzNjAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1964","placeOfBirth":" Brooklyn, New York, USA","bio":"Great-grandson of writer/humorist Ring Lardner, grand-nephew of Academy Award winning screenwriter and Hollywood Ten member Ring Lardner Jr. Father was co-founder of New York's Elaine's restaurant. Broke through in 1994 with the $100,000 feature My Life's in Turnaround (1993). Has dated Samantha Mathis, Michelle Williams and Elisa Donovan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjIyMzE1Ml5BMl5BanBnXkFtZTcwMjEzNjAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911505","name":"Donal Lardner Ward","idIMDB":"nm0911505"},"actorId":"nm0911505","character":"Normal Customer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ric Borelli","urlProfile":"http://www.imdb.com/name/nm0096335","urlPhoto":"","biography":{"bio":"Ric Borelli was a member of the world-renowned Second City National Touring Company with whom he performed around the USA for two years. He also performed in Chicago with The Mary Archie Theatre Co. in the Brecht classic \"Resistible Rise of Arturo Ui.\" Since then he has been seen in several national ad campaigns including Chevrolet and DirectTV. He was an ensemble member of the \"Andy Dick Show\" on MTV. Ric helped Mike Myers in writing a portion of \"Austin Powers in Goldmember\" in which he played a cop, after Mike Meyers saw Ric's one-man-show \"Best Dope In Town\" in New York City. More recently Ric starred in the U.S. premiere of \"The Arab Israeli Cookbook\" at The Met theatre in LA. Ric's training in improvisation and comedy includes The Second City Training Center and Improv Olympic where the legendary Del Close mentored him. He also received training at the Victory Gardens Theater and Piven Theatre.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0096335","name":"Ric Borelli","idIMDB":"nm0096335"},"actorId":"nm0096335","character":"Slob","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0287969","urlIMDB":"http://www.imdb.com/title/tt0287969","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.6","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"R","awards":[],"votes":"2,072","type":"Video","companyCreditsSimple":[{"idCompany":"co0009722","name":"Capital Arts Entertainment"}],"keywords":{"keywords":["comics","comic book","rivalry","comic book shop","comic book collector","arson","burglary","revolver","pistol","pawn shop","feud","emotional manipulation","black comedy","greed","orphan","stripper","voice over narration","tied feet","tied up while barefoot","barcelona spain","travel","three word title","theft","strip club","small town","six shooter","shot to death","shot in the arm","sex","rival","rival business","reference to wonder woman","reference to superman","reference to spiderman","reference to batman","police","police officer","one piece","old woman","old woman murdered","old lady","nail","nail gun","murder","mexican standoff","knife","killer instinct","killed by gunshot","killed by cop","husband wife relationship","gun","gunfire","friend","friendship","death","comic book collection","cigarette smoking","car","car accident","burning building","broken arm","fire","death of son"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:10:24"}}