{"data":{"movies":[{"title":"The Butterfly Effect","originalTitle":"","year":"2004","releaseDate":"20040123","directors":[{"name":"Eric Bress","id":"nm0107774"},{"name":"J. Mackye Gruber","id":"nm0344259"}],"writers":[{"name":"J. Mackye Gruber","id":"nm0344259"},{"name":"Eric Bress","id":"nm0107774"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODkxNzg2N15BMl5BanBnXkFtZTYwMzQ2MTg2._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Sci-Fi","Thriller"],"plot":"Evan Treborn grows up in a small town with his single, working mother and his friends. He suffers from memory blackouts where he suddenly finds himself somewhere else, confused. Evan's friends and mother hardly believe him, thinking he makes it up just to get out of trouble. As Evan grows up he has fewer of these blackouts until he seems to have recovered. Since the age of seven he has written a diary of his blackout moments so he can remember what happens. One day at college he starts to read one of his old diaries, and suddenly a flashback hits him like a brick!","simplePlot":"Evan Treborn suffers blackouts during significant events of his life. As he grows up, he finds a way to remember these lost memories and a supernatural way to alter his life by reading his journal.","actors":[{"actorName":"Ashton Kutcher","urlProfile":"http://www.imdb.com/name/nm0005110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Mjc2MzMzMl5BMl5BanBnXkFtZTcwOTA5OTIxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1978","placeOfBirth":" Cedar Rapids, Iowa, USA","birthName":"Christopher Ashton Kutcher","height":"6' 2½\" (1.89 m)","bio":"Christopher Ashton Kutcher was born on February 7, 1978 in Cedar Rapids, Iowa, to Diane (Finnegan), who was employed at Procter & Gamble, and Larry Kutcher, a factory worker. He has a fraternal twin brother, Michael, and a sister, Tausha. He is of Czech (father) and Irish, German, and Czech (mother) descent. He grew up in rural Homestead, Iowa, graduating from Clear Creek-Amana High School in Tiffin, Iowa. In 1997, Kutcher was a biochemical engineering student at the University of Iowa and was discovered by a local talent scout. In 2010, Kutcher was named one of Time Magazine's Top 100 Most Influential People. He created the Demi and Ashton Foundation, to eliminate child sex slavery worldwide. Kutcher is mostly known for playing Michael Kelso in That '70s Show (1998) and is co-founder of Katalyst, a studio for social media.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Mjc2MzMzMl5BMl5BanBnXkFtZTcwOTA5OTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005110","name":"Ashton Kutcher","nicknames":["Ash","Kutch"],"idIMDB":"nm0005110"},"actorId":"nm0005110","character":"Evan","urlCharacter":"http://www.imdb.com/character/ch0005127","main":true},{"actorName":"Melora Walters","urlProfile":"http://www.imdb.com/name/nm0001828","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzcyMDc3NF5BMl5BanBnXkFtZTcwNTYxMTA0NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1960","placeOfBirth":" Dhahran, Saudi Arabia","height":"5' 1\" (1.55 m)","bio":"Melora Walters was born on October 21, 1960 in Dhahran, Saudi Arabia. She is known for her work on The Butterfly Effect (2004), Magnolia (1999) and Dead Poets Society (1989). She has been married to Alex Vendler since June 21, 2008. She was previously married to Dylan Walsh and Christopher Scotellaro.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzcyMDc3NF5BMl5BanBnXkFtZTcwNTYxMTA0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001828","name":"Melora Walters","idIMDB":"nm0001828"},"actorId":"nm0001828","character":"Andrea","urlCharacter":"http://www.imdb.com/character/ch0127336","main":true},{"actorName":"Amy Smart","urlProfile":"http://www.imdb.com/name/nm0005442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2Njc4NDA2N15BMl5BanBnXkFtZTcwOTQ1NDUwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1976","placeOfBirth":" Topanga Canyon, California, USA","birthName":"Amy Lysle Smart","height":"5' 6\" (1.68 m)","bio":"Amy Smart was born in Topanga Canyon, California, to Judy, who worked at a museum, and John Boden Smart, a salesman. She has German, English, and Irish ancestry. Smart was a relatively new arrival when she first gained notice for her supporting roles in the 1999 hit teen films Varsity Blues (1999) and Outside Providence (1999). With her blonde, carefree California girl good looks, the Los Angeles native got her start in TV-movies and made her feature debut in Stephen Kay's The Last Time I Committed Suicide (1997) screened at 1997's Sundance Film Festival alongside Keanu Reeves. She was briefly seen in Paul Verhoeven's big-budget sci-fi actioner Starship Troopers (1997) with actor Casper Van Dien and had an impressive turn in the vastly different, quirkily independent How to Make the Cruelest Month (1998). In the latter, she played Dot, the graceful golden girl who seduces the one-time boyfriend of her sister, the troubled protagonist Bell (Clea DuVall). The by-the-numbers horror film Campfire Tales (1997) followed in 1997, along with the topically chilling but clumsily executed internet stalker thriller, Dee Snider's Strangeland (1998), written, produced and starring the titular Twisted Sister frontman as a deranged torturer who meets his victims in web chatrooms. Amy reached her widest audience with a co-starring role opposite James Van Der Beek in Brian Robbins' surprise box office hit \"Varsity Blues (1999)\". The actress played Jules Harbor, a girl who longs for life beyond her small town's high school football-obsessed culture but who, as sister of the injured star quarterback (Paul Walker) and girlfriend of his idealistic replacement (Van Der Beek), is tied to it. Her next role was that of Shawn Hatosy's upper-class love interest in Michael Corrente's poignant 1970s era comedy \"Outside Providence (1999)\". Based on Peter Farrelly's novel, the film followed a working-class teenaged boy (Hatosy) sent by his abrasive but loving father (Alec Baldwin) to a tony prep school after running into trouble at home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2Njc4NDA2N15BMl5BanBnXkFtZTcwOTQ1NDUwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005442","name":"Amy Smart","idIMDB":"nm0005442"},"actorId":"nm0005442","character":"Kayleigh","urlCharacter":"http://www.imdb.com/character/ch0005126","main":true},{"actorName":"Elden Henson","urlProfile":"http://www.imdb.com/name/nm0711805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzczMjE2Ml5BMl5BanBnXkFtZTcwNzg3MzUzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1977","placeOfBirth":" Rockville, Maryland, USA","birthName":"Elden Ryan Ratliff","height":"5' 9\" (1.75 m)","bio":"Elden Henson (formerly billed as Elden Ratliff and Elden Ryan Ratliff) got his start in the business at age two, as a baby model. By the time he was six, he was appearing in numerous commercials; by age ten, he was on his way to becoming a successful child actor. By the time he started high school, John Burroughs High School in Burbank, California, he got his big break, starring in the three The Mighty Ducks (1992) movies as enforcer Fulton Reed. From there, he went on to get rave reviews as Max Kane, the seemingly slow-witted giant in Miramax's The Mighty (1998). Elden has since starred in Idle Hands (1999), She's All That (1999), and Showtime's A Gift of Love: The Daniel Huffman Story (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzczMjE2Ml5BMl5BanBnXkFtZTcwNzg3MzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711805","name":"Elden Henson","idIMDB":"nm0711805"},"actorId":"nm0711805","character":"Lenny","urlCharacter":"http://www.imdb.com/character/ch0127337","main":true},{"actorName":"William Lee Scott","urlProfile":"http://www.imdb.com/name/nm0005406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTQ1MTk0MV5BMl5BanBnXkFtZTYwNDkyNTE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1973","placeOfBirth":" Hudson, New York, USA","height":"5' 7\" (1.7 m)","bio":"William Lee Scott was born on July 6, 1973 in Hudson, New York, USA. He is an actor, known for Pearl Harbor (2001), The Butterfly Effect (2004) and Gone in Sixty Seconds (2000). He has been married to Charlene Bloom since 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTQ1MTk0MV5BMl5BanBnXkFtZTYwNDkyNTE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005406","name":"William Lee Scott","idIMDB":"nm0005406"},"actorId":"nm0005406","character":"Tommy","urlCharacter":"http://www.imdb.com/character/ch0089771","main":true},{"actorName":"John Patrick Amedori","urlProfile":"http://www.imdb.com/name/nm0024511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjk2ZTQ3YmQtZTY2ZC00ODAyLWEwYWItZDQ4ODgwZWFiMTgxXkEyXkFqcGdeQXVyMjgyNzkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1987","placeOfBirth":" Baltimore, Maryland, USA","height":"5' 11½\" (1.82 m)","bio":"John Patrick's first gift was for music and his first ambition was to become a lead guitarist in his own band. He credits the band Nirvana for his musical inspiration, but it was his cameo in \"Almost Famous\" that set him on the road to acting. He also graduated high school at 15. John has a younger brother and a cute dog named Poe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjk2ZTQ3YmQtZTY2ZC00ODAyLWEwYWItZDQ4ODgwZWFiMTgxXkEyXkFqcGdeQXVyMjgyNzkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0024511","name":"John Patrick Amedori","nicknames":["JP","JPA"],"idIMDB":"nm0024511"},"actorId":"nm0024511","character":"Evan at 13","urlCharacter":"http://www.imdb.com/character/ch0005127","main":true},{"actorName":"Irina Gorovaia","urlProfile":"http://www.imdb.com/name/nm1096941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MTY0NTY0N15BMl5BanBnXkFtZTgwNDA5OTQyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1989","placeOfBirth":" Brooklyn, New York, USA","birthName":"Irina Gorovaia","height":"5' 8\" (1.73 m)","bio":"Irene Gorovaia was born in Russia on June 13, 1989. During her childhood she moved to The States. In junior high school, Gorovaia started her acting career. Along with acting, Irene is a dancer. She made her acting debut in The Royal Tenenbaums (2001). She went to many auditions, and was picked out of many people to play the part. Since then, she has been in 2 other movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MTY0NTY0N15BMl5BanBnXkFtZTgwNDA5OTQyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1096941","name":"Irina Gorovaia","idIMDB":"nm1096941"},"actorId":"nm1096941","character":"Kayleigh at 13","urlCharacter":"http://www.imdb.com/character/ch0005126","main":true},{"actorName":"Kevin G. Schmidt","urlProfile":"http://www.imdb.com/name/nm0773056","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NDM2ODU5Ml5BMl5BanBnXkFtZTgwOTIyNzMwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1988","placeOfBirth":" Andover, Kansas, USA","birthName":"Kevin Gerard Schmidt","height":"5' 9\" (1.75 m)","bio":"Kevin G. Schmidt is formerly best known as the chubby clarinet-playing son in the blockbuster Cheaper by the Dozen films or as \"Noah Newman\" on the #1 daytime drama The Young and the Restless. Kevin also co-starred with Selena Gomez & Demi Lovato in the Disney original movie, Princess Protection Program. As well as the first live-action Cartoon Network's scripted television series, Unnatural History. On top off all the acting, he managed to co-create, star, produce and direct his cult web-series, Poor Paul. Originally from Andover, Kansas, Kevin did not set out to work in entertainment. But with two brothers who were finding initial success as actors in Los Angeles, Kevin was eventually persuaded to go out on an audition or two. He was ten when he began booking a string of guest-starring roles in prime time. Kevin's resume includes many notable television hits from dramas such as NCIS, BONES, Without a Trace, CSI:NY - to quirky comedies like HBO's Curb Your Enthusiasm and USA's Monk. Kevin also found success on the big screen. In addition to the Cheaper by the Dozen films, Kevin co-starred with Ashton Kutcher in The Butterfly Effect. In Catch That Kid, Kevin added Kristin Stewart to his list of talented co-stars. Transitioning to leading man, Kevin starred in the indie thriller Resurrection Mary as well as the family hit Alvin and the Chipmunks: The Squeakquel. Having undergone his own personal metamorphosis at age 17 from chubby kid to young leading man, Kevin shared what he has learned about fitness and health on his directorial debut, The Alyson Stoner Project. Teaming up with good friend and dance prodigy, Alyson Stoner, the pair produced an instructional musical/fitness hybrid that uses the latest dance moves to get the body moving. ASP not only teaches kids the importance of fitness, nutrition and making good lifestyle choices, but also does so in a fun, relatable way. Kevin is now in production on - \"The Great Migration\" - an animated film he wrote and is producing. The film stars his younger brother, Kendall, Logan Henderson, Ashley Tisdale, Vanessa Hudgens, and Ashley Benson. \"The Great Migration\" is the first of a multiple film slate in various stages of production. Outside of the entertainment business, Kevin continues to expand his entrepreneurial pursuits. Kevin is founder and CEO of a commercial aquaponics corporation, Creative Organic Ventures, which is focused on advancing sustainable food production and research. Kevin hopes to be a vessel to ending childhood hunger and obesity worldwide. He's an avid workout enthusiast, creative writer, and passionate cook. 06/17/15","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NDM2ODU5Ml5BMl5BanBnXkFtZTgwOTIyNzMwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0773056","name":"Kevin G. Schmidt","idIMDB":"nm0773056"},"actorId":"nm0773056","character":"Lenny at 13","urlCharacter":"http://www.imdb.com/character/ch0005135","main":true},{"actorName":"Jesse James","urlProfile":"http://www.imdb.com/name/nm0416596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MjQ3NDM5OTJeQTJeQWpwZ15BbWU3MDI1NzgxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1989","placeOfBirth":" Palm Springs, California, USA","height":"5' 10\" (1.78 m)","bio":"Jesse James was born in Southern California to Shane and Jaime. He started acting when his father was getting head-shots of himself taken. Shane asked the photographer, who was also a manager, to take photos of Jesse. The photographer/manager agreed and was amazed by the vibrant personality of the boy, so he signed Jesse. Shortly. Shortly after, the 5-year old, skinny, blonde Jesse received the role of \"Spencer\", in As Good as It Gets (1997), despite the role calling for an \"overweight red-headed 12 year old\". For this role, he won the Hollywood Reporter Young Star Award, for Best Performance by a Child Actor in a Comedy in 1998. Achieving underground critical acclaim for his portrayal of \"Tommy Miller\", a disturbed teenager with violent tendencies in The Butterfly Effect (2004), Jesse has continued strongly with his career, recently venturing into the independent film community.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MjQ3NDM5OTJeQTJeQWpwZ15BbWU3MDI1NzgxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0416596","name":"Jesse James","nicknames":["Jess"],"idIMDB":"nm0416596"},"actorId":"nm0416596","character":"Tommy at 13","urlCharacter":"http://www.imdb.com/character/ch0089771","main":true},{"actorName":"Logan Lerman","urlProfile":"http://www.imdb.com/name/nm0503567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzI3MjEzN15BMl5BanBnXkFtZTcwMzI5NzAwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1992","placeOfBirth":" Beverly Hills, Los Angeles, California, USA","birthName":"Logan Wade Lerman","height":"5' 9\" (1.75 m)","bio":"Logan was born in Beverly Hills, to a Jewish family. His parents are Lisa (Goldman), who works as his manager, and Larry Lerman, an orthotist and businessman. He has two siblings, Lindsey and Lucas, both older. His relatives operate the orthotics and prosthetics company Lerman & Son, which was founded by his great-grandfather, Jacob Lerman. When he was two and a half years old, Logan told his mother that he wanted to be an actor. At the age of four, Logan had an agent and was booked for two commercials. His first appearance on the big screen was as William, the youngest son of Mel Gibson's character in The Patriot (2000). Also in 2000, he appeared with the same actor (Gibson), this time as the younger version of his character Nick Marshall, in What Women Want (2000). After a small role in 2001's Riding in Cars with Boys (2001), he starred in John Grisham's A Painted House (2003). Logan played the younger version of Ashton Kutcher's character, Evan, in The Butterfly Effect (2004). After making his small screen debut in a guest-starring role in 10-8: Officers on Duty (2003), he stared as Bobby (Robert) McCallister in the WB Network's series Jack & Bobby (2004), where he portrayed a teenager who will be a future president of the United States. After the show's cancellation in 2005, Logan returned to film, starring in the family adventure Hoot (2006). The next year, he played the son of Walter Sparrow (Jim Carrey) in the dark thriller The Number 23 (2007), and co-starred with Russell Crowe and Christian Bale in the well-reviewed Western remake 3:10 to Yuma (2007). His next two roles were playing a foul-mouthed private school student in the comedy Meet Bill (2007) and a younger version of actor George Hamilton in the period drama My One and Only (2009). Both were independent films that received limited releases. Also in 2009, Logan appeared with Gerard Butler in the R-rated action thriller Gamer (2009), as a teenager who controls Butler's character in a real-life video game. In 2010, Logan played the title character in the fantasy adventure Percy Jackson & the Olympians: The Lightning Thief (2010), giving him notice among a wider audience. Subsequently, he starred as D'Artagnan in a remake of Les Trois Mousquetaires (2011), headlined The Perks of Being a Wallflower (2012), a film adaptation of the 1999 book of the same name, had a supporting role in the independent film Stuck in Love (2012), and returned to star in Percy Jackson: Sea of Monsters (2013). His first 2014 role was in the epic Biblical film Noah (2014), playing one of the title character's sons, Ham; the film grossed over $100 million at the North American box office. Logan next starred with Brad Pitt, Shia LaBeouf, Jon Bernthal, and Michael Peña in the World War II-set action drama Fury (2014); in the film, he played one of several American soldiers engaged in tank combat against the German forces, during the last weeks of the Nazi regime. In 2016, Logan starred in the 1950s-set drama Indignation (2016), playing Marcus Messner, a Jewish student from New Jersey who attends a midwestern college. Written and directed by James Schamus, the film is an adaptation of Philip Roth's 2008 novel. When Logan is not working, he likes to play soccer and baseball. He is an LA Lakers fan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzI3MjEzN15BMl5BanBnXkFtZTcwMzI5NzAwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0503567","name":"Logan Lerman","nicknames":["Loggie"],"idIMDB":"nm0503567"},"actorId":"nm0503567","character":"Evan at 7","urlCharacter":"http://www.imdb.com/character/ch0005127","main":true},{"actorName":"Sarah Widdows","urlProfile":"http://www.imdb.com/name/nm1214285","urlPhoto":"","biography":{"bio":"Sarah Widdows is an actress, known for The Butterfly Effect (2004) and The L Word (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1214285","name":"Sarah Widdows","idIMDB":"nm1214285"},"actorId":"nm1214285","character":"Kayleigh at 7","urlCharacter":"http://www.imdb.com/character/ch0005126","main":true},{"actorName":"Jake Kaese","urlProfile":"http://www.imdb.com/name/nm1200474","urlPhoto":"","biography":{"bio":"Jake Kaese is an actor, known for The Butterfly Effect (2004), Bloodsuckers (2005) and Out of Order (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1200474","name":"Jake Kaese","idIMDB":"nm1200474"},"actorId":"nm1200474","character":"Lenny at 7","urlCharacter":"http://www.imdb.com/character/ch0005135","main":true},{"actorName":"Cameron Bright","urlProfile":"http://www.imdb.com/name/nm1080974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE4NDA3N15BMl5BanBnXkFtZTcwNDE5ODk5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1993","placeOfBirth":" Victoria, British Columbia, Canada","birthName":"Cameron Douglas Crigger","height":"5' 10\" (1.78 m)","bio":"Cameron was born in Victoria, B.C., on Jan 26, 1993. He resides in Vancouver, BC. At the age of 6, he was filming his first commercial. In 2002, at only 9 years of age, he worked in his first lead role in the movie Godsend, expérience interdite (2004), alongside Academy award-winner Robert De Niro. One month after completing Godsend, expérience interdite (2004), Cameron was filming his next lead in Birth (2004), playing the reincarnated husband of Academy award-winner Nicole Kidman. The role of \"Sean\" in Birth (2004) would land Cameron his first nomination for a major award. Since landing his first lead at the age of 9, he has carried 13 lead roles in major movies, and appeared in numerous TV series as a guest star. He has been a guest presenter at the Breakthrough of the Year, BC Leo and Gemini awards, as well as being nominated for 8 major awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE4NDA3N15BMl5BanBnXkFtZTcwNDE5ODk5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1080974","name":"Cameron Bright","idIMDB":"nm1080974"},"actorId":"nm1080974","character":"Tommy at 7","urlCharacter":"http://www.imdb.com/character/ch0089771","main":true},{"actorName":"Eric Stoltz","urlProfile":"http://www.imdb.com/name/nm0000655","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Njc5MjQyOF5BMl5BanBnXkFtZTYwNzQzNzgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1961","placeOfBirth":" Whittier, California, USA","birthName":"Eric Cameron Stoltz","height":"5' 11\" (1.8 m)","bio":"Eric Cameron Stoltz is a theater-trained actor and producer who has starred in both independent and studio films. He was born on September 30, 1961 in Whittier, California, to Evelyn Vawter, a violinist and schoolteacher, and Jack Stoltz, an elementary school teacher. He has German, English, and Scottish ancestry. Eric was raised in both American Samoa and Santa Barbara, California, where by the age of fourteen, he was earning money by playing piano for the local musical theater productions, including \"Mame\" starring Anthony Edwards, whom he co-starred with as two of Jeff Spicoli's stoner friends in Fast Times at Ridgemont High (1982). The two became friends, and then college roommates when both attended the University of Southern California. Dropping out in his junior year, Eric joined a repertory company that did 10 plays at the Edinburgh Festival in Scotland. Moving to New York in 1981, he studied with Stella Adler and Peggy Feury, and soon appeared in his first film, Fast Times at Ridgemont High (1982). In the 1980s, he garnered attention (and a Golden Globe Nomination) starring as Rocky Dennis in Mask (1985), and in John Hughes' Some Kind of Wonderful (1987). In 1988, he made his Broadway debut in Great Performances: Our Town (1989), for which he was nominated for a Tony Award. In the 1990s, he went back and forth from stage to film, building up an eclectic resume that included studio films (Pulp Fiction (1994), independent films (Sundance Festival Winner The Waterdance (1992), and films that he himself produced (Mr. Jealousy (1997). He also continued to appear on the New York stage both on Broadway (Three Sisters, Two Shakespearean Actors) and off-Broadway (The Importance of Being Ernest, The Glass Menagerie). He continued to work in television as well, doing a recurring role as Helen Hunt's ex on Mad About You (1992), a year on Chicago Hope (1994), and in the television and cable movies Inside (1996) (directed by Arthur Penn), A Killer in the Family (1983) (with Robert Mitchum) and The Passion of Ayn Rand (1999) (with Helen Mirren). Eric Stoltz lives in New Mexico, and has been romantically linked to Ally Sheedy, Jennifer Jason Leigh, Lili Taylor, and Bridget Fonda,. Since 2002 he has concentrated mainly on directing, having done a television movie, several short films, several independent films, and television shows such as Grey's Anatomy (2005), Boston Legal (2004), Nashville (2012), and Glee (2009). In 2014 he became the producing director of the hit CBS show, Madam Secretary (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Njc5MjQyOF5BMl5BanBnXkFtZTYwNzQzNzgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000655","name":"Eric Stoltz","idIMDB":"nm0000655"},"actorId":"nm0000655","character":"Mr. Miller","urlCharacter":"http://www.imdb.com/character/ch0005129","main":true},{"actorName":"Callum Keith Rennie","urlProfile":"http://www.imdb.com/name/nm0719678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1960","placeOfBirth":" Sunderland, Tyne-and-Wear, England, UK","height":"5' 11\" (1.8 m)","bio":"Callum Keith Rennie was born in England, raised in Alberta, Canada and came late to acting - he discovered theatre in Edmonton at the age of 25. Starting out in university radio and working his way to the renowned Shaw Festival, Callum moved to Vancouver and quickly caught the eye of producers and directors. Currently he lives in Vancouver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719678","name":"Callum Keith Rennie","idIMDB":"nm0719678"},"actorId":"nm0719678","character":"Jason","urlCharacter":"http://www.imdb.com/character/ch0127338","main":true}],"seasons":[],"idIMDB":"tt0289879","urlIMDB":"http://www.imdb.com/title/tt0289879","business":{"budget":{"money":"$13,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$17,065,227","country":"USA","day":"25","month":"01","year":"2004","remarks":"2,605 Screens"},{"money":"£735,287","country":"UK","day":"18","month":"04","year":"2004","remarks":"276 Screens"},{"money":"€336,208","country":"Italy","day":"29","month":"02","year":"2004","remarks":"168 Screens"}],"gross":[{"money":"$57,650,876","country":"USA","day":"11","month":"04","year":"2004","remarks":""},{"money":"$57,528,908","country":"USA","day":"04","month":"04","year":"2004","remarks":""},{"money":"$57,384,658","country":"USA","day":"28","month":"03","year":"2004","remarks":""},{"money":"$57,218,701","country":"USA","day":"21","month":"03","year":"2004","remarks":""},{"money":"$56,909,473","country":"USA","day":"14","month":"03","year":"2004","remarks":""},{"money":"$57,938,693","country":"USA","day":"11","month":"03","year":"2004","remarks":""},{"money":"$56,422,091","country":"USA","day":"07","month":"03","year":"2004","remarks":""},{"money":"$55,377,579","country":"USA","day":"29","month":"02","year":"2004","remarks":""},{"money":"$53,208,211","country":"USA","day":"22","month":"02","year":"2004","remarks":""},{"money":"$49,179,651","country":"USA","day":"16","month":"02","year":"2004","remarks":""},{"money":"$41,312,767","country":"USA","day":"08","month":"02","year":"2004","remarks":""},{"money":"$31,735,064","country":"USA","day":"01","month":"02","year":"2004","remarks":""},{"money":"$17,065,227","country":"USA","day":"25","month":"01","year":"2004","remarks":""},{"money":"£2,036,472","country":"UK","day":"09","month":"05","year":"2004","remarks":""},{"money":"£1,788,768","country":"UK","day":"02","month":"05","year":"2004","remarks":""},{"money":"£1,345,830","country":"UK","day":"25","month":"04","year":"2004","remarks":""},{"money":"£735,287","country":"UK","day":"18","month":"04","year":"2004","remarks":""},{"money":"$38,122,165 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"€655,404","country":"Italy","day":"14","month":"03","year":"2004","remarks":""},{"money":"€583,742","country":"Italy","day":"07","month":"03","year":"2004","remarks":""},{"money":"€336,852","country":"Italy","day":"29","month":"02","year":"2004","remarks":""},{"money":"€237,925","country":"Netherlands","day":"22","month":"08","year":"2004","remarks":""}],"weekendGross":[{"money":"$73,394","country":"USA","day":"11","month":"04","year":"2004","remarks":"138 Screens"},{"money":"$98,889","country":"USA","day":"04","month":"04","year":"2004","remarks":"157 Screens"},{"money":"$100,431","country":"USA","day":"28","month":"03","year":"2004","remarks":"154 Screens"},{"money":"$160,224","country":"USA","day":"21","month":"03","year":"2004","remarks":"226 Screens"},{"money":"$267,437","country":"USA","day":"14","month":"03","year":"2004","remarks":"312 Screens"},{"money":"$520,828","country":"USA","day":"07","month":"03","year":"2004","remarks":"554 Screens"},{"money":"$1,254,484","country":"USA","day":"29","month":"02","year":"2004","remarks":"1,035 Screens"},{"money":"$2,975,882","country":"USA","day":"22","month":"02","year":"2004","remarks":"1,901 Screens"},{"money":"$5,959,335","country":"USA","day":"16","month":"02","year":"2004","remarks":"2,288 Screens"},{"money":"$6,512,743","country":"USA","day":"08","month":"02","year":"2004","remarks":"2,519 Screens"},{"money":"$9,556,280","country":"USA","day":"01","month":"02","year":"2004","remarks":"2,605 Screens"},{"money":"$17,065,227","country":"USA","day":"25","month":"01","year":"2004","remarks":"2,605 Screens"},{"money":"£84,404","country":"UK","day":"09","month":"05","year":"2004","remarks":"129 Screens"},{"money":"£245,141","country":"UK","day":"02","month":"05","year":"2004","remarks":"230 Screens"},{"money":"£315,302","country":"UK","day":"25","month":"04","year":"2004","remarks":"277 Screens"},{"money":"£735,287","country":"UK","day":"18","month":"04","year":"2004","remarks":"276 Screens"},{"money":"€112,243","country":"Italy","day":"07","month":"03","year":"2004","remarks":"65 Screens"},{"money":"€45,085","country":"Netherlands","day":"22","month":"08","year":"2004","remarks":"26 Screens"}],"admissions":[{"money":"238,772","country":"France","day":"16","month":"03","year":"2004","remarks":""},{"money":"141,416","country":"Germany","day":"29","month":"09","year":"2004","remarks":""},{"money":"272,725","country":"Germany","day":"05","month":"09","year":"2004","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Dogwood Pictures Inc. © MMIII All Rights Reserved. (on print)"},"technical":{"runtime":["1 hr 53 min (113 min)","2 hr (120 min) (director's cut)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Alpha Cine Service, Vancouver, Canada","Command Post/Toybox West, Vancouver, Canada","DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm (Eastman EXR 100T 5248, Kodak Vision 320T 5277, Vision 500T 5279, Vision Expression 500T 5284)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3513DI)"]},"rating":"7,7","metascore":"30","filmingLocations":[{"location":"Ceperley House, Burnaby, British Columbia, Canada"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]}]}]},{"award":"Brussels International Festival of Fantasy Film (BIFFF) 2004","titlesAwards":[{"titleAwardOutcome":"Won Pegasus Audience Award","categories":[{"category":"","names":[{"name":"Eric Bress","id":"nm0107774","role":null},{"name":"J. Mackye Gruber","id":"nm0344259","role":null}]}]}]},{"award":"Golden Schmoes Awards 2004","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Most Underrated Movie of the Year","names":[]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Trippiest Movie of the Year","names":[]},{"category":"Best Sci-Fi Movie of the Year","names":[]},{"category":"Biggest Surprise of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Fleece","categories":[{"category":"","names":[]}]}]},{"award":"Science Fiction and Fantasy Writers of America 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Nebula Award","categories":[{"category":"Best Script","names":[{"name":"J. Mackye Gruber","id":"nm0344259","role":null},{"name":"Eric Bress","id":"nm0107774","role":null}]}]}]},{"award":"Teen Choice Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie - Thriller","names":[]}]}]}],"votes":"375 294","type":"Movie","companyCreditsSimple":[{"idCompany":"co0044439","name":"BenderSpink"},{"idCompany":"co0063593","name":"FilmEngine"},{"idCompany":"co0102320","name":"Katalyst Films"}],"keywords":{"keywords":["time travel","surprise ending","butterfly effect","child pornography","blackout","reference to god","love","memory","reading","college","flashback","journal","murder of a child","child murders a child","mk ultra","trauma based mind control","time traveler","sex in bed","scantily clad female","fatalism","self sacrifice","female in shower","changing past event","building model airplane","billiards","father in prison","flash forward","grave side ceremony","morpho butterfly","film starts with text","kneeling","therapy","bare chested male","towel","hazing","shower","abuse","childhood friend","stress","psychological trauma","toes","numbness","shard","castration","underwear","cilantro","slum","alternate universe","underwater scene","artificial hand","cat scan","essay","tears","crying","worm","exam","test","sedation","graveyard","dungeon","basement","moving","firecracker","fraternity house","beer","baby","suv","forest","woods","mailbox","inheritance","repression","restaurant","cafe","waitress","hate","professor","university","knocked out","medicine","doll","s&m","self defense","911","cross","religion","basketball","hotel","telephone call","marriage proposal","reference to jesus christ","convict","curse","brain hemorrhage","human brain","brain","psychiatrist","lighter fluid","fire","rain","vandalism","watching a movie","father daughter relationship","illness","hospital","video camera","teenage girl","stabbing","lung cancer","bar","cynicism","crotch grab","reference to maid marian","reference to robin hood","bicycle","beating","home movie","student","teacher","nightmare","dream","gun","fight","inhaler","asthma","kiss","memory loss","brother sister relationship","haunted by the past","girl","boy","hypnotic regression","paranormal phenomena","trauma","sociopath","psychotic child","psychopath","surrealism","paranoia","boyfriend girlfriend relationship","cult film","aryan brotherhood","television","teenage boy","revenge","drawing","mother son relationship","lost love","father son relationship","fate","escape","destiny","compassion","child in peril","captive","bravery","unrequited love","nonlinear timeline","prison rape","dog","accidental killing","altering history","alternate reality","racial slur","jealousy","bully","child molester","chaos theory","school","playing pool","funeral","cigarette smoking","psychology","pornography","disturbed childhood","child hero","child abuse","cancer","repressed memory","severed arm","psychotherapy","mental institution","fraternity","explosion","dynamite","drug addict","death","dead dog","convulsion","blood","beaten to death","suicide attempt","attempted murder","self mutilation","insanity","childhood","violence","prison","death of father","vomiting","mace the repellent","mini skirt","blue panties","panties","lingerie","breasts","cleavage","talking during a movie","hit on the head","coffin","punk","u haul truck","cigarette burn","burning","junkyard","roommate","model airplane","choking","sadist","fellatio","pay phone","killing a dog","death of a dog","dog burned to death","ambulance","nurse","butterfly","pedophilia","knife","sex scene","pepper spray","goth girl","female nudity","prosthetic limb","mail bomb","gay slur","rape","murder","wheelchair","hypnosis","cemetery","baseball bat","pedophile","movie theater","impalement","female frontal nudity","killing an animal","nosebleed","dog burned alive","suicide","strangulation","stabbed in the hand","stabbed in the chest","stabbed in the back","sorority","dog set on fire","scar","prostitute","notebook"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:48:57"}}