{"data":{"movies":[{"title":"Glenn Gould: Off the Record","originalTitle":"","year":"1959","directors":[{"name":"Wolf Koenig","id":"nm0462860"},{"name":"Roman Kroitor","id":"nm0471993"}],"writers":[{"name":"Stanley Jackson","id":"nm0414055"}],"runtime":"30 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4NDM5Njk5Nl5BMl5BanBnXkFtZTcwNDAwOTAzMQ@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Documentary","Short","Biography"],"plot":"At his cottage near lake Simcoe, Ontario, Gould revels in his freedom from public performances, playing piano for the audience of one - his collie. ~~ From the VHS jacket.","simplePlot":"At his cottage near lake Simcoe, Ontario, Gould revels in his freedom from public performances, playing piano for the audience of one - his collie. ~~ From the VHS jacket.","actors":[{"actorName":"Glenn Gould","urlProfile":"http://www.imdb.com/name/nm0332384","urlPhoto":"","biography":{"dateOfBirth":"25 September 1932","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Glenn Herbert Gold","bio":"Glenn Herbert Gould was born Glen Gold on September 25, 1932, in Toronto, Ontario, Canada. His mother was a great-grand niece of Edvard Grieg. Young Gould was playing with piano from the age of 3, and started regular lessons with his mother from the age of 4. At the age of 10 Gould was admitted to the Royal Conservatory of Music in Toronto, where his piano teacher was Alberto Guerrero. In 1946 Gould, then only 13 years old, successfully performed Beethoven's Piano Concerto No. 4 with the Toronto Symphony Orchestra. He made his first recording with the CBC in 1950, and gradually came to liking the studio environment better that a live performance to an audience. Glenn Gould was touring with concert performances until the age of 31. He was the first performer from North America to play in the Soviet Union since the Second World War. His 1957 tour became possible because Nikita Khrushchev initiated the \"Thaw\" amidst the Cold War. Gould's concerts featured Johann Sebastian Bach and Ludwig van Beethoven. He was also allowed to perform the music of Arnold Schönberg, and Alban Berg which was previously under the ban by Soviet censorship. Gould reciprocated by popularizing the music of Dmitri Shostakovich in the West. In April 1964, Gould gave his last public performance in Los Angeles, California. For the rest of his life Gould devoted his career to recording, writing, and broadcasting. His Grammy awarded 1981 studio recording of 'Goldberg Variations', as well, as his other recordings of music by Johann Sebastian Bach, are widely considered as definitive. Gould was posthumously awarded another Grammy for his recording of Piano sonatas Nos. 12 and 13 by Ludwig van Beethoven. His unusual and inspirational interpretations of classical repertoire were criticized by some and acclaimed by many. He died of a stroke on October 4, 1982, and was laid to rest in Mount Pleasant Cemetery in Toronto, Ontario, Canada. Gould was especially known for his eccentric, but strong and convincing performances. Although he could be sometimes heard saying a word or quietly singing along with his playing, Gould was doing that instinctively to achieve the final result, which was outstanding. Gould played only his own piano. His Steinway piano was technically adjusted to his touch. This adjustments enabled Gould to play piano with superior control of the sound, which allowed him to make recordings of very fine quality. He also said about his piano: \"it is the best vehicle to express my ideas.\"","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0332384","name":"Glenn Gould","idIMDB":"nm0332384"},"actorId":"nm0332384","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franz Kraemer","urlProfile":"http://www.imdb.com/name/nm0469140","urlPhoto":"","biography":{"dateOfBirth":"1 June 1914","placeOfBirth":" Vienna, Austria","bio":"Franz Kraemer was born on June 1, 1914 in Vienna, Austria. He was a producer and director, known for Once More, Seiji Ozawa (1970), Louis Riel (1969) and Festival (1960). He died on August 27, 1999 in Toronto, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0469140","name":"Franz Kraemer","idIMDB":"nm0469140"},"actorId":"nm0469140","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0223363","urlIMDB":"http://www.imdb.com/title/tt0223363","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["30 min"],"soundMix":null,"color":["Black and White"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.7","filmingLocations":[],"awards":[],"votes":"47","type":"Movie","companyCreditsSimple":[{"idCompany":"co0035593","name":"National Film Board of Canada (NFB)"}],"keywords":{"keywords":["character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:14:46"}}