{"data":{"movies":[{"title":"American Prophet: The Story of Joseph Smith","originalTitle":"","year":"1999","releaseDate":"19991126","directors":[{"name":"Lee B. Groberg","id":"nm0342778"}],"writers":[{"name":"Heidi Swinton","id":"nm0842762"}],"runtime":"120 min","countries":["USA"],"languages":["English"],"genres":["Documentary","Biography"],"simplePlot":"","actors":[{"actorName":"Eric Artell","urlProfile":"http://www.imdb.com/name/nm1364903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODI5MTQ2MV5BMl5BanBnXkFtZTcwODE5MDYzMQ@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Raised in New Jersey, Eric began performing in theater productions in grade school and church. His first professional job came in Salt Lake City with a role in the independent feature \"Net Worth\" in a scene with Daniel Baldwin. He's since guest starred on a variety of TV shows and starred in numerous national commercials. Eric's latest job as the new host of PBS' show DragonFly TV has taken him across the country discovering science secrets. Eric also has great love for improv. He is co-founder of the C&E Improv Factory, a Los Angeles based improv troupe, which he directed and with which he performed. Though C&E is on hiatus, he still performs improv with another group: Santa Clarita Improv. Eric has also taught improv to beginners and intermediates. He currently resides in West Los Angeles and enjoys in his free time playing sports (basketball, golf, tennis, softball, soccer, ping pong, you name it) and reading.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODI5MTQ2MV5BMl5BanBnXkFtZTcwODE5MDYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1364903","name":"Eric Artell","idIMDB":"nm1364903"},"actorId":"nm1364903","character":"Alexander Doniphan","urlCharacter":"http://www.imdb.com/character/ch0278572","main":true},{"actorName":"Joseph Batzel","urlProfile":"http://www.imdb.com/name/nm1207903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTcxNTE0Ml5BMl5BanBnXkFtZTgwNTAyMzcyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1948","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"5' 11\" (1.8 m)","bio":"Born in Pittsburgh Pennsylvania and traveled throughout the U.S. and Morocco as a youth. His father was an Air Force Sergeant so he was constantly moving. He is part Italian and part German. He attended Choctawhatchee High School in Florida. He made his debut as a professional actor in a P.B.S movie called Passionate Pilgrim where he played Ben Jonson. He made his first breakthrough in a small role in Species. He has now worked in Film, TV, voice-over and stage. He is also a freelance professional theater director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTcxNTE0Ml5BMl5BanBnXkFtZTgwNTAyMzcyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1207903","name":"Joseph Batzel","idIMDB":"nm1207903"},"actorId":"nm1207903","character":"Heber C. Kimball","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimberly Elaine Crowe","urlProfile":"http://www.imdb.com/name/nm1342132","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcxNTI2NjkxOV5BMl5BanBnXkFtZTcwMjg2OTUyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Kimberly Elaine Crowe is known for her work on Peter Pan (2003), Numb3rs (2005) and Related (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcxNTI2NjkxOV5BMl5BanBnXkFtZTcwMjg2OTUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1342132","name":"Kimberly Elaine Crowe","idIMDB":"nm1342132"},"actorId":"nm1342132","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Dalton","urlProfile":"http://www.imdb.com/name/nm0198348","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTY4NDYyOF5BMl5BanBnXkFtZTcwOTM0MzkwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1950","placeOfBirth":" Knoxville, Tennessee, USA","height":"6' (1.83 m)","bio":"Sam Dalton is an accomplished television and motion picture actor, writer, director and producer. He began his acting career at the young age of five when he appeared as an extra in a scene from \"The Black Hills Passion Play\" in Lake Wales, Florida. After graduating from Lenoir City High School in Lenoir City, Tennessee, Sam attended the University of Tennessee (Knoxville) where he majored in Communications with an emphasis on Journalism and Broadcast Management. During his college years, Sam also pursued his interest in acting and appeared in numerous UT stage productions including \"The Servant of Two Masters\", \"The Lion in Winter\", \"The Royal Hunt of the Sun\", and \"Look Homeward Angel\". During his years at UT, Sam spent his summers in repertory performing as part of the resident cast of the Hunter Hills Theater, an outdoor amphitheater located in Gatlinburg, Tennessee. There he performed the roles of General Bullmoose in \"Li'l Abner\", Preacher Hagler in \"Dark of the Moon\", Will Parker in \"Oklahoma\" and Henry Albertson in \"The Fantastiks\". During his senior year at the University of Tennessee, Sam began working as a part-time weekend news announcer for WIVK AM radio in Knoxville. Six months later, he was asked to join WNOX AM radio as a \"Drive Time\" news anchor and weekend disc jockey. Sam later spent five years in a variety of positions at WBIR TV (Knoxville) including on-air news reporter and host of the afternoon \"Early Show\". His stint at WBIR TV was briefly interrupted when Sam was called to active duty training for the US Army Reserve. During the next six years, Sam continued his duties as a civilian broadcaster while also serving as a Public Information Specialist for the USAR. Sam continued to pursue his career as a broadcaster for the next eleven years serving in various capacities at television stations throughout the United States including KMPH TV-Fresno, CA, KMGH TV-Denver, CO, and KTVX TV-Salt Lake City, UT. During his years as a broadcaster, Sam also continued to act in numerous stage plays and on-air commercials. Sam became a member of Screen Actors Guild - American Federation of Television and Radio Artists in 1983 upon appearing in a nationally broadcast television commercial for Ford trucks. That same year he won the role of Mr. Gurntz (the gym coach) in the original Paramount motion picture \"Footloose\" starring Kevin Bacon, Lori Singer, Sarah Jessica Parker, John Lithgow, Chris Penn and Diane Wiest. Sam moved from Salt Lake City to Hollywood in the fall of 1983 to pursue his acting career full time. Within weeks of his arrival there, he was cast in a recurring role on the NBC daytime series \"Santa Barbara\". Other roles in network television prime-time programs and movies of the week quickly followed including \"Call to Glory\" (ABC), \"Rags to Riches\" (NBC), \"In Self Defense\" (TV Movie), \"Mr. Belvedere\" (ABC), \"Mancuso FBI\" (NBC), \"Touched by an Angel\" (CBS) and \"Perfect Murder, Perfect Town: Jon Benet and the City of Boulder (TV movie). Sam's recent roles have included appearances in the Disney Channel television movies \"Double Teamed\" and \"Right on Track\", the motion pictures \"Falls the Shadow\", \"Online\" and \"A Matter of Time\" and short films including \"In Aggression\", \"Diminuendo\" (Nashville Film Festival selection), \"Dakota's Decision\", \"The Bullet That Follows\" and \"Cat's in the Cradle\". His recent stage credits include the role of Ebenezer Scrooge in Charles Dickens \"A Christmas Carol\" and Sidney Lipton in Neil Simon's \"God's Favorite\". In 2008, Sam moved from Hollywood to Nashville where he continues to perform while dividing his time between California and Tennessee. Sam also is a distinguished educator. For the past four years he has served as an instructor at Watkins College of Art, Design & Film in Nashville where he teaches a rotating series of required and special topics courses including \"Fundamentals of Production\", \"Advanced Directing\", \"Production II\", \"The Business of the Biz\" and \"The World of Documentaries\". Sam is a recipient of a Rocky Mountain Regional Emmy, a Parents' Choice award and two national Telly awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTY4NDYyOF5BMl5BanBnXkFtZTcwOTM0MzkwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0198348","name":"Sam Dalton","idIMDB":"nm0198348"},"actorId":"nm0198348","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Megan Follows","urlProfile":"http://www.imdb.com/name/nm0001227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NTYyNzE4NF5BMl5BanBnXkFtZTcwODc0NzQyOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1968","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Megan Elizabeth Laura Diana Follows","height":"5' 4\" (1.63 m)","bio":"Megan (pronounced Mee-gan) has two children, a daughter, Lyla, and a son, Russel. Megan comes from a showbiz family: father Ted Follows, mother Dawn Greenhalgh, and sister Samantha Follows are all actors; her other sister, Edwina Follows, is a producer and writer; and her brother Laurence Follows is a producer. Has done many commercials, the first of which was at the age of 9. Has appeared in many theatrical productions, including \"Romeo and Juliet\", \"The Effects of Gamma Rays on Man-in-the-Moon Marigolds\", and \"Seven Lears: The Pursuit of the Good.\" Won two Gemini awards for her performances in Le bonheur au bout du chemin (1985) and Anne of Avonlea (1987). Megan met her husband, Christopher Porter, while filming Deep Sleep (1990), where he was a gaffer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NTYyNzE4NF5BMl5BanBnXkFtZTcwODc0NzQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001227","name":"Megan Follows","nicknames":["Meg"],"idIMDB":"nm0001227"},"actorId":"nm0001227","character":"Emma Smith","urlCharacter":"http://www.imdb.com/character/ch0274073","main":true},{"actorName":"Frank Gerrish","urlProfile":"http://www.imdb.com/name/nm0314754","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMDI1NzU3Nl5BMl5BanBnXkFtZTgwNTY4MzU0OTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1963","placeOfBirth":" Cranston, Rhode Island, USA","bio":"Frank has appeared in over 90 feature films, documentaries, television series and made-for-TV movies; in over 350 commercials, voice-overs, industrials and print; and in over 90 stage productions. Frank was a resident member of Utah's Pioneer Theatre Company (LORT) for 12 seasons and performed with Pennsylvania Centre Stage, Utah Shakespeare Festival, Sundance Summer Theatre, Salt Lake Acting Company,and as a vocal soloist for the Utah Symphony's Children's Concert series. Frank holds a Master of Fine Arts Degree in Theatre and Film from Penn State University and a Bachelor of Fine Arts in Theatre from the University of Rhode Island.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMDI1NzU3Nl5BMl5BanBnXkFtZTgwNTY4MzU0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0314754","name":"Frank Gerrish","idIMDB":"nm0314754"},"actorId":"nm0314754","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Eric Hart","urlProfile":"http://www.imdb.com/name/nm0366164","urlPhoto":"","biography":{"birthName":"Robert E. Hartenberger","bio":"Bob Eric Hart was born as Robert E. Hartenberger. He is an actor, known for Full Metal Jacket (1987), Meet the Deedles (1998) and Nobody's Baby (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0366164","name":"Bob Eric Hart","idIMDB":"nm0366164"},"actorId":"nm0366164","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Mootos","urlProfile":"http://www.imdb.com/name/nm1128356","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTg5MzU4Ml5BMl5BanBnXkFtZTcwMTYzOTk0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Bill Mootos is an actor and writer, known for R.I.P.D. (2013), Easy Listening (2002) and Incident at Cu Chi (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTg5MzU4Ml5BMl5BanBnXkFtZTcwMTYzOTk0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1128356","name":"Bill Mootos","idIMDB":"nm1128356"},"actorId":"nm1128356","character":"Hyram Smith","urlCharacter":"http://www.imdb.com/character/ch0130930","main":true},{"actorName":"Zane Parker","urlProfile":"http://www.imdb.com/name/nm0662710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM5NDczNzM4NF5BMl5BanBnXkFtZTgwMjI5NjEzMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Zane Parker is an actor, known for Clay Pigeons (1998), Windrunner (1994) and Address Unknown (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM5NDczNzM4NF5BMl5BanBnXkFtZTgwMjI5NjEzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662710","name":"Zane Parker","idIMDB":"nm0662710"},"actorId":"nm0662710","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Peck","urlProfile":"http://www.imdb.com/name/nm0000060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODc0NTE2NF5BMl5BanBnXkFtZTYwNjYyMjQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1916","placeOfBirth":" La Jolla [now in San Diego], California, USA","birthName":"Eldred Gregory Peck","height":"6' 3\" (1.91 m)","bio":"Eldred Gregory Peck was born in La Jolla, California, to Bernice Mary (Ayres) and Gregory Pearl Peck, a chemist and druggist in San Diego. He had Irish (from his paternal grandmother), English, and some German, ancestry. His parents divorced when he was five years old. An only child, he was sent to live with his grandmother. He never felt he had a stable childhood. His fondest memories are of his grandmother taking him to the movies every week and of his dog, which followed him everywhere. He studied pre-med at UC-Berkeley and, while there, got bitten by the acting bug and decided to change the focus of his studies. He enrolled in the Neighborhood Playhouse in New York and debuted on Broadway after graduation. His debut was in Emlyn Williams' play \"The Morning Star\" (1942). By 1943 he was in Hollywood, where he debuted in the RKO film Days of Glory (1944). Stardom came with his next film, The Keys of the Kingdom (1944), for which he was nominated for an Academy Award. Peck's screen presence displayed the qualities for which he became well known. He was tall, rugged and heroic, with a basic decency that transcended his roles. He appeared in Alfred Hitchcock's Spellbound (1945) as an amnesia victim accused of murder. In The Yearling (1946), he was again nominated for an Academy Award and won the Golden Globe. He was especially effective in westerns and appeared in such varied fare as David O. Selznick's critically blasted Duel in the Sun (1946), the somewhat better received Yellow Sky (1948) and the acclaimed The Gunfighter (1950). He was nominated again for the Academy Award for his roles in Gentleman's Agreement (1947), which dealt with anti-Semitism, and Twelve O'Clock High (1949), a story of high-level stress in an Air Force bomber unit in World War II. With a string of hits to his credit, Peck made the decision to only work in films that interested him. He continued to appear as the heroic, larger-than-life figures in such films as Captain Horatio Hornblower R.N. (1951) and Moby Dick (1956). He worked with Audrey Hepburn in her debut film, Roman Holiday (1953). Peck finally won the Oscar, after four nominations, for his performance as lawyer Atticus Finch in To Kill a Mockingbird (1962). In the early 1960s he appeared in two darker films than he usually made, Cape Fear (1962) and Captain Newman, M.D. (1963), which dealt with the way people live. He also gave a powerful performance as Capt. Keith Mallory in The Guns of Navarone (1961), one of the biggest box-office hits of that year. In the early 1970s he produced two films, The Trial of the Catonsville Nine (1972) and The Dove (1974), when his film career stalled. He made a comeback playing, somewhat woodenly, Robert Thorn in the horror film The Omen (1976). After that, he returned to the bigger-than-life roles he was best known for, such as MacArthur (1977) and the monstrous Nazi Dr. Josef Mengele in the huge hit The Boys from Brazil (1978). In the 1980s he moved into television with the mini-series The Blue and the Gray (1982) and The Scarlet and the Black (1983). In 1991 he appeared in the remake of his 1962 film, playing a different part, in Martin Scorsese's Cape Fear (1991). He was also cast as the progressive-thinking owner of a wire and cable business in Other People's Money (1991). In 1967 Peck received the Academy's Jean Hersholt Humanitarian Award. He was also been awarded the US Presidential Medal of Freedom. Always politically progressive, Peck was active in such causes as anti-war protests, workers' rights and civil rights. He died in June 2003, aged 87.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODc0NTE2NF5BMl5BanBnXkFtZTYwNjYyMjQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000060","name":"Gregory Peck","nicknames":["Father Peck","Greg"],"idIMDB":"nm0000060"},"actorId":"nm0000060","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Peckham","urlProfile":"http://www.imdb.com/name/nm1944694","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Mark Peckham yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1944694","name":"Mark Peckham","idIMDB":"nm1944694"},"actorId":"nm1944694","character":"Joseph Smith","urlCharacter":"http://www.imdb.com/character/ch0030534","main":true}],"seasons":[],"idIMDB":"tt0233200","urlIMDB":"http://www.imdb.com/title/tt0233200","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr (120 min)"],"soundMix":null,"color":["Black and White","Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.9","filmingLocations":[],"awards":[],"votes":"70","type":"Movie","companyCreditsSimple":[{"idCompany":"co0063934","name":"Groberg Communications"}],"keywords":{"keywords":["utah","religion","mormon","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:52:17"}}