{"data":{"movies":[{"title":"Thy Neighbor's Wife","originalTitle":"","year":"2001","releaseDate":"20010918","directors":[{"name":"Jim Wynorski","id":"nm0691061"}],"writers":[{"name":"Sean O'Bannon","id":"nm0639330"},{"name":"Jim Wynorski","id":"nm0691061"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2Nzg4MTEyMV5BMl5BanBnXkFtZTcwMDc5MDMyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"plot":"When Ann's husband Chris takes his own life after losing his Beverly Hills job, she vows revenge on the man who fired her husband and on the woman who got the vice presidency Chris wanted. Ann deals with the firm's owner in a flash in a very quick and noisy 'accident', but she takes her time with the new V.P., Nicole Garrett, a diabetic with a rocky marriage to Scott, a lawyer who drinks too much and with two kids: Darla, a rebellious senior in high school who wants more freedom; and David, a son who'll soon be visiting from college. The Garrett's household also includes Karina, an Au pair. After murdering Karina and hiding the body, Ann charms her way into the Garrett household, as 'Anna Johnson' where she sets about widening the riff between Nicole and Scott, while encouraging the self-destructive Darla to go all the way with a prospective boyfriend, and seducing both Scott and the naive David. 'Anna' also slowly begins to poison Nicole by switching her insulin with a slow acting ...","simplePlot":"A scorned woman plots revenge for her husband's suicide by integrating herself as a housekeeper for a dysfunctional Beverly Hills family to first alienate, and then emotionally and physically destroy them.","actors":[{"actorName":"Kari Wuhrer","urlProfile":"http://www.imdb.com/name/nm0001863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDYwMDI3N15BMl5BanBnXkFtZTcwMTc5OTgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1967","placeOfBirth":" Brookfield, Connecticut, USA","birthName":"Kari Samantha Wührer","height":"5' 5\" (1.65 m)","bio":"Kari Samantha Wuhrer was born on April 28, 1967 in Brookfield, Connecticut, the daughter of Karin, a payroll officer and Andrew, a former police officer and car salesman. Kari has three siblings. She studied acting at age 13 at the Wooster School, and headed to New York City to do rounds of auditions. She was signed to the Ford's Model Talent Division and appeared in several commercials, most notably Clairol, as well as performing in theater productions. After a role in the drama film Fire with Fire (1986), Kari landed a job on MTV as a VJ and was a co-host of the game show Remote Control (1987). Wuhrer snuck out of her family home as a teenager to sing in nightclubs; she was the youngest member of the band Freudian Slip. She studied drama at New York University, Marymount Manhattan College, Columbia University, and at the Royal Academy of Dramatic Arts in London, England with famed teacher Uta Hagen. Her biggest career break came when she was cast to play Maggie Beckett on the sci-fi television series Sliders (1995) from 1997 to 2000. She was signed to a record deal by American Recordings impresario Rick Rubin, which eventually appeared on the small Del-Fi label; her debut album \"Shiny\" produced the successful single \"There's a Drug\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDYwMDI3N15BMl5BanBnXkFtZTcwMTc5OTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001863","name":"Kari Wuhrer","nicknames":["Dawaywe","Crash"],"idIMDB":"nm0001863"},"actorId":"nm0001863","character":"Ann Stewart / Anna Johnson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Trachta","urlProfile":"http://www.imdb.com/name/nm0870466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjcxMjMwNl5BMl5BanBnXkFtZTcwNTU5MjYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1960","placeOfBirth":" Richmond [now Staten Island], New York City, New York, USA","bio":"Jeff Trachta was born on October 6, 1960 in Richmond [now Staten Island], New York City, New York, USA. He is an actor, known for Amour, gloire et beauté (1987), Loving (1983) and Interlocked: Thrilled to Death (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjcxMjMwNl5BMl5BanBnXkFtZTcwNTU5MjYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0870466","name":"Jeff Trachta","idIMDB":"nm0870466"},"actorId":"nm0870466","character":"Scott Garrett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Crampton","urlProfile":"http://www.imdb.com/name/nm0186225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY2NzMzNDY1NV5BMl5BanBnXkFtZTgwMzY5MTAyMDI@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1958","placeOfBirth":" Levittown, Long Island, New York, USA","height":"5' 4\" (1.63 m)","bio":"Gorgeous, talented and charismatic blonde actress Barbara Crampton was born on December 27, 1958 in Levittown, Long Island, New York and raised in Vermont. Because her father was a carnie, Barbara spent her childhood summers traveling the country with the carnival. Crampton first began acting in school plays in 7th grade and studied acting in high school. She earned a BA in Theater Arts from Castleton State College. Following graduation, Crampton portrayed \"Cordelia\" in an American Theater of Actors production of \"King Lear\" in New York. Barbara then moved to Los Angeles and made her TV debut with a recurring role on the popular daytime soap opera Days of Our Lives (1965). She had a brief, but memorable role as Craig Wasson's unfaithful girlfriend, \"Carol\", in Brian De Palma's Body Double (1984) and was funny as the bubble-headed \"Chrissie\" in the crudely amusing comedy, Fraternity Vacation (1985). Barbara achieved her greatest enduring cult popularity as sweet college coed \"Megan Halsey\" in Stuart Gordon's terrific Re-Animator (1985). She gave an excellent performance as the ambitious, but prim and repressed \"Dr. Katherine McMichaels\" in the equally fine From Beyond (1986). Crampton was quite engaging as the perky \"Suzie Lynn\" in the fun Chopping Mall (1986) and typically solid as the unhappy \"Susan Reilly\" in Castle Freak (1995). Barbara had recurring roles on the daytime television soap operas Guiding Light (1952), The Young and the Restless (1973) (Crampton won a Soap Opera Digest Award for her acting on this show) and Amour, gloire et beauté (1987). Among the TV shows Crampton has done guest spots on are The Nanny (1993), Pacific Blue (1996), Party of Five (1994), Hotel (1983) and Santa Barbara (1984). Her hobbies include skiing, yoga, horseback riding, running, working out with weights and shopping for antiques at flea markets. Barbara Crampton lives right outside of San Francisco with her husband, Robert Bleckman, and their two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY2NzMzNDY1NV5BMl5BanBnXkFtZTgwMzY5MTAyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186225","name":"Barbara Crampton","idIMDB":"nm0186225"},"actorId":"nm0186225","character":"Nicole Garrett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melissa Stone","urlProfile":"http://www.imdb.com/name/nm0832046","urlPhoto":"","biography":{"bio":"Began her acting aspirations at the age of 12 with musical theatre. From there she enjoyed playing the violin as well as winning various tennis competitions. She is an avid reader and is currently working on her first novel.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0832046","name":"Melissa Stone","idIMDB":"nm0832046"},"actorId":"nm0832046","character":"Darla Garrett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Seth Adam Jones","urlProfile":"http://www.imdb.com/name/nm1159337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNzczNTQ5MV5BMl5BanBnXkFtZTYwNjA4MjEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1973","placeOfBirth":" Nashua, New Hampshire, USA","height":"6' 2\" (1.88 m)","bio":"Seth Adam Jones was born in Nashua, New Hampshire on a cold snowy day in December. Growing up Seth served the community, working for charities like The United Way and the Boy's and Girl's Clubs. He graduated High School in 1991, and went on to coach Pop Warner Football, Track & Field, and his former high school Wrestling team, while attending NHT, with the intent on a Design Degree. After Acheiving success at the East Coast's Largest Sheet Metal Fabricator Premier Industries, as an OSHA/EPA Regulatory Manager, his studies were focused on Engineering Design and Plant Management, to eventually run the company he was Dedicated to. When Premier looked to Sell the business to Advance Power Works, He switched gears and moved to Los Angeles. Doing Stand-up Comedy in 1996, got him his first agent Cavaleri & Assoc., and achieved instant success in commercials. Study of Film Making and Editing led him to found Ydragoh Entertainment in 1998, and has produced a couple of short films and pilots for television with little to no outside investments. With success in popular shows like Even Stevens & General Hospital, he was starting to show promise. In Late 2005, Seth was seriously injured in a motorcycle accident, which brought his acting career to a halt, and though the times following were tough, a new focus on life, love, & faith, had led him to his beautiful wife Aleksandra. They were married in September 2007. As head of the Editing Dept. at MyReel Productions, he rehabbed his shattered knee and focused on Production. In early 2008 MyReel moved on to South Carolina. Seth again retrained his focus and with the help of former Ydragoh partner Mike Nevarez he will look forward to Pre-Production on a new film based on the character \"The Little Old Lady From Pasadena\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNzczNTQ5MV5BMl5BanBnXkFtZTYwNjA4MjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1159337","name":"Seth Adam Jones","idIMDB":"nm1159337"},"actorId":"nm1159337","character":"David Garrett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Henry Richardson","urlProfile":"http://www.imdb.com/name/nm0724604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzkwODM1Nl5BMl5BanBnXkFtZTgwNTIyNTEzMTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"John Henry Richardson stars in the popular web-series, CASTLEVANIA--HYMN OF BLOOD (2012), as Reinhardt Belmont, the last knight of the Brotherhood of Light. Upcoming, he stars in the new TV series, BAKER & DUNN (2014) as a bad New Orleans cop. On the big screen, he's co-starring in PANIC 5 BRAVO (2014), action thriller from Warner Bros./Lionsgate/Videocine, as a tough EMT Leader caught in a Mexican drug war. With over 300 films, TV shows, commercials and theatrical productions to his credit, on any given evening you can find him on HBO, Showtime, Sundance, FX or the Sci-Fi Channel. John Henry has won Best Acting Awards from the L.A. Weekly Theatre Critics, DramaLogue, Los Angeles Showcase and the Glendale Centre Theatre. He co-wrote and co-starred in the first interactive feature film, VOYEUR, which won 7 Cybermania Academy Awards, including Best Screenplay for JHR and Lena Pousette. He has been honored with awards from the Hollywood International Film Festival, Los Angeles IFF, Worldfest, Houston, Phoenix and Sonoma Film Fests for his critically-acclaimed DILLINGER IN PARADISE. John Henry has also been a leading acting coach in Los Angeles for over 30 years. He created the first video workshop for actors, The Actors Gymnasium in 1976. He was Senior Instructor of the Acting For Film Department of the New York Film Academy at Universal Studios, wherein he created the syllabi, lesson plan and curriculum for the Master of Fine Arts, Bachelor of Fine Arts and Associate of Fine Arts Programs. He has produced and directed over 200 Thesis Films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzkwODM1Nl5BMl5BanBnXkFtZTgwNTIyNTEzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724604","name":"John Henry Richardson","idIMDB":"nm0724604"},"actorId":"nm0724604","character":"Mr. Slider","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Poindexter","urlProfile":"http://www.imdb.com/name/nm0223315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NjkyMDg4NF5BMl5BanBnXkFtZTgwOTIxMTU4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1959","placeOfBirth":" Dallas, Texas, USA","birthName":"Lawrence Thomas Poindexter","bio":"The son of Tony Award winning lighting and set designer H.R. Poindexter, began acting in college, first appearing in summer stock in his native Texas, prior to moving with his family to Los Angeles (after spending a number of years in New York). First jobs in Los Angeles were with Franklin R. Levy and Catalina Production Group (which included a young producer named Leslie Moonves), as both an actor and production co-coordinator. Has been nominated for Los Angeles Ovation and LA Weekly awards for theatre work as well as having produced numerous theatre pieces in Los Angeles. He played with his band \"The High LOnesome\" for a number of years throughout the Southwest before landing a recording deal with local indie label, Spark Records. He has also composed for short films and placed numerous songs in features and is the co-author of a new rhythm and blues musical \"The Devil You Know\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NjkyMDg4NF5BMl5BanBnXkFtZTgwOTIxMTU4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0223315","name":"Larry Poindexter","idIMDB":"nm0223315"},"actorId":"nm0223315","character":"Chris Stewart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Weller","urlProfile":"http://www.imdb.com/name/nm1074411","urlPhoto":"","biography":{"bio":"John Weller is an actor, known for Thy Neighbor's Wife (2001) and Boston Public (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1074411","name":"John Weller","idIMDB":"nm1074411"},"actorId":"nm1074411","character":"Travis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peggy Trentini","urlProfile":"http://www.imdb.com/name/nm0872193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDg3MjEzNV5BMl5BanBnXkFtZTYwNDYxMjAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1960","placeOfBirth":" Wilmington, California, USA","birthName":"Marguerite Louise Trentine","height":"5' 8\" (1.73 m)","bio":"Tall (5'8\"), buxom, and luscious blonde bombshell Peggy Trentini was born on June 22, 1960 in Wilmington, California and adopted by Reynold and Yolanda Trentine. Peggy started modeling right out of high school after being scouted by an agent; among the companies she did full-time modeling gigs for are Clairol, Target, Olga Lingerie, Ujena Swimwear, JC Penney, Sears, Catalina Swimwear, and Fredericks of Hollywood. Trentini made her film debut in 1982 with a small part in the comedy romp \"Young Doctors in Love.\" Peggy played a member of the Swedish Bikini Team in a series of memorable TV commercials for Old Milwaukee Beer. In addition, she has made guest appearances on episodes of such TV shows as \"Married with Children,\" \"Erotic Confessions,\" \"Beverly Hills Bordello,\" and \"Nightcap.\" Trentini was featured in a pictorial for the January, 1992 issue of \"Playboy.\" Moreover, Peggy was a Carson Art Player on \"The Tonight Show\" for three years. After retiring from acting in 2001, Trentini went on to obtain a BA and Real Estate License from college (she majored in business and minored in English literature). More recently Peggy wrote the autobiography \"Once Upon a Star: Kiss and Tell Celebrity Stories.\" She lives in Orange County, California and owns her own real estate company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDg3MjEzNV5BMl5BanBnXkFtZTYwNDYxMjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0872193","name":"Peggy Trentini","idIMDB":"nm0872193"},"actorId":"nm0872193","character":"Karina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melissa Brasselle","urlProfile":"http://www.imdb.com/name/nm0105465","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjE0OTQ1Ml5BMl5BanBnXkFtZTcwNTI2NTM2Nw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"birthName":"Melissa Maria Brasselle","height":"5' 7\" (1.7 m)","bio":"Melissa Brasselle was born as Melissa Maria Brasselle. She is known for her work on The Assault (1996), The Curse of the Komodo (2004) and Raptor (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjE0OTQ1Ml5BMl5BanBnXkFtZTcwNTI2NTM2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0105465","name":"Melissa Brasselle","nicknames":["Rocky"],"idIMDB":"nm0105465"},"actorId":"nm0105465","character":"Angela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Cavanaugh","urlProfile":"http://www.imdb.com/name/nm0146938","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE2MzY1NDAzMV5BMl5BanBnXkFtZTcwNTg4MDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1942","placeOfBirth":" New York City, New York, USA","bio":"Excellent, prolific and versatile character actor Michael Cavanaugh was born on November 21st, 1942 in New York. The eldest of nine children, Cavanaugh joined the Navy following his high school graduation and was stationed in Hawaii for three years. After his tour of duty was over, Cavanaugh developed an interest in acting. He began his acting career in children's theater; he made his stage debut in the titular role in a production of \"Winnie the Pooh\". Michael's other stage credits include \"One Flew Over the Cuckoo's Nest\", \"Merchant of Venice\" and \"Are You Now or Have You Ever Been?\". An accomplished vocalist, Cavanaugh has sung tenor in such musicals as \"Oh Calcutta!\", \"Carousel\" and \"110 in the Shade\". Michael has racked up an extensive list of film and TV show credits alike since the mid-70s; he often portrays police officers, government agents, stern military types, lawyers, judges and slick businessmen. Cavanaugh has appeared in three Clint Eastwood pictures: The Enforcer (1976), The Gauntlet (1977) and Any Which Way You Can (1980). He was especially memorable as the head nasty bad guy in the exciting Chuck Norris action vehicle Forced Vengeance (1982). Cavanaugh was terrific as obsessive and xenophobic chief federal security agent \"George Fox\" on the fine and thoughtful science fiction TV series Starman (1986). He also had a recurring part on the short-lived early 90s revival of the popular horror soap opera Dark Shadows (1991). Among the many TV shows Cavanaugh has done guest spots on are Monk (2002), Shark (2006), Bones (2005), The Young and the Restless (1973), The West Wing (1999), The Practice (1997), NYPD Blue (1993), Dr. Quinn, Medicine Woman (1993), Matlock (1986), Star Trek: The Next Generation (1987), ER (1994), The X-Files (1993), L.A. Law (1986), Our House (1986), Amazing Stories (1985), MacGyver (1985), Supercopter (1984), Dallas (1978), The A-Team (1983), Cagney & Lacey (1981), Hunter (1984), T.J. Hooker (1982), Vega$ (1978), CHiPs (1977) and Kojak (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE2MzY1NDAzMV5BMl5BanBnXkFtZTcwNTg4MDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146938","name":"Michael Cavanaugh","idIMDB":"nm0146938"},"actorId":"nm0146938","character":"Ian McMillan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betheny Zolt","urlProfile":"http://www.imdb.com/name/nm0957754","urlPhoto":"","biography":{"dateOfBirth":"23 May 1975","placeOfBirth":" Los Angeles County, California, USA","birthName":"Betheny Renée Zolt","height":"5' 3\" (1.6 m)","bio":"Betheny Zolt was born on May 23, 1975 in Los Angeles County, California, USA as Betheny Renée Zolt. She is known for her work on Camp Blood (2000), Grand Theft Auto V (2013) and Getting Rachel Back (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0957754","name":"Betheny Zolt","idIMDB":"nm0957754"},"actorId":"nm0957754","character":"Janelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nina Dafni","urlProfile":"http://www.imdb.com/name/nm1072754","urlPhoto":"","biography":{"bio":"Nina Dafni is an actress, known for Thy Neighbor's Wife (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1072754","name":"Nina Dafni","idIMDB":"nm1072754"},"actorId":"nm1072754","character":"Mrs. Slider","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Langlois Monroe","urlProfile":"http://www.imdb.com/name/nm0598468","urlPhoto":"","biography":{"bio":"Bill Langlois Monroe is an actor and writer, known for Cheerleader Massacre (2003), Militia (2000) and Lost Treasure (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0598468","name":"Bill Langlois Monroe","idIMDB":"nm0598468"},"actorId":"nm0598468","character":"Detective","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0234890","urlIMDB":"http://www.imdb.com/title/tt0234890","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)","1 hr 29 min (89 min) (DVD) (Germany)"],"soundMix":["DTS-Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"3.8","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"560","type":"Video","companyCreditsSimple":[{"idCompany":"co0024680","name":"Phoenician Entertainment"}],"keywords":{"keywords":["revenge","poison","suicide","housekeeper","promiscuous woman","infidelity","extramarital affair","breasts","scantily clad female","double homicide","dead body in a swimming pool","corpse in freezer","funeral","explosion","suicide attempt","lingerie","thong panties","purple panties","black panties","panties","tan line","fellatio","oral sex","false identity","dysfunctional marriage","upskirt","sexual desire","promiscuous daughter","leg spreading","lust","french kiss","female rear nudity","female frontal nudity","female removes her clothes","mini skirt","mini dress","nipples visible through clothing","silhouette","breast suckling","cleavage","shower","kitchen","bathtub","b movie","sex","widow","unhappy marriage","thong","teenage girl","tea kettle","swimming pool","stock footage","slow motion scene","sleeping on the job","set up","murder in shower","mother daughter relationship","loss of job","loss of husband","jacuzzi","husband wife relationship","home invasion","heavy rain","gas explosion","fried bacon","freezer","female nudity","female killer","female bonding","exploding house","exploding car","erotica","caught having sex","body double","board meeting","bikini","adultery","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:28:14"}}