{"data":{"movies":[{"title":"Thunderpants","originalTitle":"","year":"2002","releaseDate":"20020524","directors":[{"name":"Peter Hewitt","id":"nm0382072"}],"writers":[{"name":"Peter Hewitt","id":"nm0382072"},{"name":"Phil Hughes","id":"nm0400864"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjQ0ODgzOV5BMl5BanBnXkFtZTcwMjUyMzkxMQ@@._V1.jpg","countries":["UK","Germany"],"languages":["English"],"genres":["Comedy","Family","Sci-Fi"],"plot":"Patrick Smash (11) was born with two stomachs, and hence the uncontrollable 'talent' to produce ungodly farts. This soon drives his own dad away and makes his social life hell. His only friend is classmate Alan A. Allen, a prodigy genius, who has no sense of smell. Even Alan's invention Thunderpants, which renders Patrick's farts harmless, can't make his space travel dream realistic. However after the invention of an adaptation which turns it into flying fuel, Alan is recruited by the US space center. Patrick becomes word class tenor Sir John Osgood's secret high C farter. Their reunion is even more incredible.","simplePlot":"An 11-year-old boy's amazing ability to break wind leads him first to fame and then to death row, before it helps him to fulfill his ambition of becoming an astronaut.","actors":[{"actorName":"Simon Callow","urlProfile":"http://www.imdb.com/name/nm0001003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTc3MDkwNl5BMl5BanBnXkFtZTcwMTQ4MTg5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1949","placeOfBirth":" London, England, UK","birthName":"Simon Phillip Hugh Callow","height":"5' 7\" (1.7 m)","bio":"Simon Callow was born on June 13, 1949 in London, England as Simon Phillip Hugh Callow. He is an actor and writer, known for Amadeus (1984), Ace Ventura: When Nature Calls (1995) and Four Weddings and a Funeral (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTc3MDkwNl5BMl5BanBnXkFtZTcwMTQ4MTg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001003","name":"Simon Callow","idIMDB":"nm0001003"},"actorId":"nm0001003","character":"Sir John Osgood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Fry","urlProfile":"http://www.imdb.com/name/nm0000410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1957","placeOfBirth":" Hampstead, London, England, UK","birthName":"Stephen John Fry","height":"6' 4½\" (1.94 m)","bio":"Writer, actor, comedian, doer of good works, excellent good friend to the famous and not, Fry lives in his London SW1 flat and his Norfolk house when not traveling. Famous for his public declaration of celibacy in the \"Tatler\" back in the 1980s, Emma Thompson has characterised her friend as \"90 percent gay, 10 percent other.\" Stephen Fry was born in Hampstead, London, to Marianne Eve (Newman) and Alan Fry, a physicist and inventor. His maternal grandparents were Hungarian Jewish immigrants, while his father's family was of English background. He grew up in Norfolk and attended Uppingham School and Stout's Hill. After his notorious three months in Pucklechurch prison for credit card fraud, he attended Queens College, Cambridge in 1979, finishing with a 2:1 in English in 1981/2. While at Cambridge, he was a member of the Cherubs drinking club, and Footlights with Thompson, Tony Slattery, Martin Bergman, and Hugh Laurie (to whom he was introduced by E.T.). His prolific writing partnership with Laurie began in 1981 with resulting Footlights revues for (among others) Mayweek, Edinburgh Festival, and a three month tour of Australia. In 1984, Fry was engaged to do the rewrite of the Noel Gay musical \"Me and My Girl,\" which made him a millionaire before the age of 30. It also earned him a nomination for a Tony award in 1987. (Sidenote: It was upon SF's suggestion that Emma Thompson landed a leading role in the London cast of this show.) Throughout the 1980s, Fry did a huge amount of television and radio work, as well as writing for newspapers (e.g. a weekly column in the \"Daily Telegraph\") and magazines (e.g. articles for \"Arena\"). He is probably best known for his television roles in Black-Adder II (1986) and Jeeves and Wooster (1990). His support of the Terence Higgins Trust through events such as the first \"Hysteria\" benefit, as well as numerous other charity efforts, are probably those works of which he is most proud. Fry's acting career has not been limited to films and television. He had successful runs in Alan Bennett's \"Forty Years On,\" Simon Gray's \"The Common Pursuit\" with John Sessions, Rik Mayall, John Gordon Sinclair, and others. Michael Frayn's \"Look Look\" and Gray's \"Cell Mates\" were less successful for both Fry and their playwrights, the latter not helped by his walking out of the play after only a couple of weeks. Fry has published four novels as well as a collection of his radio and journalistic miscellanea. He has recorded audiotapes of his novels (an unabridged version of \"The Liar\" was released in 1995), as well as many other works for both adults and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000410","name":"Stephen Fry","idIMDB":"nm0000410"},"actorId":"nm0000410","character":"Sir Anthony Silk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Celia Imrie","urlProfile":"http://www.imdb.com/name/nm0408309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1952","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"Celia Diana Savile Imrie","height":"5' 5½\" (1.66 m)","bio":"Celia Diana Savile Imrie is an English actress. She is known for her appearances with Victoria Wood; including Claire in Pat and Margaret (1994), Philippa Moorcroft in Dinnerladies (1998-2000) and playing various characters in the sketch show Victoria Wood As Seen On TV (1985-87), including Miss Babs in the spoof soap opera sketches Acorn Antiques. She reprised the role of Miss Babs in Acorn Antiques: The Musical! in 2005, and won the Olivier Award for Best Supporting Performance in a Musical. Imrie's other television roles include Marianne Bellshade in Bergerac (1983), Diana Neal in After You've Gone (2007-08), Gloria Millington in Kingdom (2007-09), and Miss Kizlet in the 2013 Doctor Who season opener The Bells of Saint John. Her film appearances include Highlander (1986), Hilary and Jackie (1998), Bridget Jones's Diary (2001), Calendar Girls (2003), Bridget Jones: The Edge of Reason (2004), Imagine Me & You (2005), The Best Exotic Marigold Hotel (2012) and The Second Best Exotic Marigold Hotel (2015). She has been described as \"one of the most successful British actresses of recent decades\". Imrie was born in 1952 in Guildford, Surrey, the fourth of five children of Diana Elizabeth Blois (née Cator) and David Andrew Imrie, a radiologist. Her father was from Glasgow, Scotland. Imrie was educated at Guildford High School, an independent school for girls in her hometown of Guildford, followed by the Guildford School of Acting. Imrie's varied career spans films, television and radio drama, and the theatre. Her film credits include Nanny McPhee, Hilary and Jackie (playing Iris du Pré) and the 1997 film of The Borrowers where she played Homily Clock. Other films include Bridget Jones's Diary, Calendar Girls, Highlander and, as Fighter Pilot Bravo 5, in Star Wars: Episode I - The Phantom Menace. In 2004, Imrie played Doctor Imogen Reed in the schoolgirl thriller, Out of Bounds. In 2007 Imrie appeared in St Trinian's. Television series to feature Imrie include The Nightmare Man, Oranges Are Not the Only Fruit, Casualty, Absolutely Fabulous, \"Bergerac\",The Darling Buds of May and Upstairs, Downstairs. In the 2000 miniseries of Gormenghast, she played Lady Gertrude. She also had a guest appearance in an episode of the BBC Scotland sitcom Still Game in 2003, where she played a home help called Mrs Begg. She also appeared in the 2005 BBC television drama Mr. Harvey Lights a Candle, playing the part of a teacher taking an unruly party of pupils on a day-trip to Salisbury Cathedral. She starred in the BBC sitcom, After You've Gone, alongside Nicholas Lyndhurst and in the ITV1 drama Kingdom, with Stephen Fry. Her part in After You've Gone has, whilst being critically acclaimed, been described as \"criminally squandered\". In 2013 she guest starred in the BBC's Doctor Who where she played the villainous Miss Kizlet in the series opener The Bells of Saint John. Her radio work includes parts in BBC Radio 4's No Commitments, Adventures of a Black Bag, and Bleak Expectations. In early 2007, she narrated the book Arabella, broadcast over two weeks as the Book at Bedtime. In May 2016, she made her US television debut in the DC action-adventure series Legends of Tomorrow. Imrie is perhaps best known for her frequent collaborations with Victoria Wood, with whom she has appeared in TV programmes such as the sitcom Dinnerladies and sketch show Victoria Wood As Seen On TV. It was on the latter show in 1985 that she first played the infamous part of Miss Babs, owner of Acorn Antiques, a parody of the low budget British soap opera Crossroads. These sketches became such a British institution that the show was turned into a West End musical in 2005 starring most of the original cast (see the picture on the right). Imrie won an Olivier Award for her performance. The character has curly blonde hair, and is known for her frequent parodic flirtations with the customers, and her abuse of the housekeeper Mrs Overall (portrayed by Julie Walters). Imrie was the guest on Desert Island Discs on BBC Radio 4 on 13 February 2011. On 18 October 2013 she was awarded an honorary doctorate by the University of Winchester.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408309","name":"Celia Imrie","nicknames":["Impie","Ceals","Celia Impie"],"idIMDB":"nm0408309"},"actorId":"nm0408309","character":"Miss Rapier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Giamatti","urlProfile":"http://www.imdb.com/name/nm0316079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0MDAzMTU4N15BMl5BanBnXkFtZTcwNzA0NzcwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1967","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Paul Edward Valentine Giamatti","height":"5' 9\" (1.75 m)","bio":"Paul Giamatti is an American actor who has worked steadily and prominently for over twenty years, and is best known for leading roles in the films American Splendor (2003), Sideways (2004), and Le monde de Barney (2010) (for which he won a Golden Globe), and supporting roles in the films Cinderella Man (2005), The Illusionist (2006), and San Andreas (2015). Paul Edward Valentine Giamatti was born June 6, 1967 in New Haven, Connecticut, and is the youngest of three children. His mother, the former Toni Marilyn Smith, was an actress before marrying. His father, Bart Giamatti (Angelo Bartlett Giamatti), was a professor of Renaissance Literature at Yale University, and went on to become the university's youngest president (in 1986, Bart was appointed president of baseball's National League. He became Commissioner of Baseball on April 1, 1989 and served for five months until his untimely death on September 1, 1989. He was commissioner at the time Pete Rose was banned from the game). Paul's father also wrote six books. Paul's older brother, Marcus Giamatti, is also an actor. His sister, Elena, designs jewelry. His ancestry is Italian (from his paternal grandfather), German, English, Dutch, Scottish, and Irish. Paul graduated from Choate Rosemary Hall prep school, majored in English at Yale, and obtained his Master's Degree in Fine Arts, with his major in drama from the Yale University School of Drama. His acting roots are in theatre, from his college days at Yale, to regional productions (Seattle, San Diego and Williamstown, Massachusetts), to Broadway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0MDAzMTU4N15BMl5BanBnXkFtZTcwNzA0NzcwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0316079","name":"Paul Giamatti","idIMDB":"nm0316079"},"actorId":"nm0316079","character":"Johnson J. Johnson","urlCharacter":"http://www.imdb.com/character/ch0345522","main":true},{"actorName":"Ned Beatty","urlProfile":"http://www.imdb.com/name/nm0000885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1937","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Ned Thomas Beatty","height":"5' 7\" (1.7 m)","bio":"Stocky, genial-looking supporting actor Ned Beatty was once hailed by Daily Variety as the \"busiest actor in Hollywood\". Ned Thomas Beatty was born in Louisville, Kentucky, to Margaret (Fortney) and Charles William Beatty. He grew up fishing and working on farms. His hometown of St. Matthews, Kentucky, is hardly the environment to encourage a career in the entertainment industry, though, so when asked, \"How did you get into show business?\" Beatty responds, \"By hanging out with the wrong crowd.\" That \"crowd\" includes some of the industry's most prominent names, such as John Huston, Steven Spielberg, Robert Altman, Paul Newman, Richard Burton, Charlton Heston, Marlon Brando and Robert Redford. Beatty has garnered praise from both critics and peers as a dedicated actor's actor. He started as a professional performer at age ten, when he earned pocket money singing in gospel quartets and a barber shop. The big city and bright lights did not come easy, though. The first ten years of Beatty's career were spent at the Barter Theater in Abingdon, Virginia. He then moved on to the Erie Playhouse in Pennsylvania, the Playhouse Theater in Houston, Texas, and the prestigious Arena Stage Company in Washington, D.C. He was also a member of Shakespeare in Central Park, Louisville, Kentucky. Later, he appeared in the Broadway production of \"The Great White Hope\". At the Mark Taper Forum in Los Angeles, he won rave reviews when he starred in \"The Accidental Death of an Anarchist\". In 1971, Beatty was chosen by director John Boorman for the role of Bobby Trippe in the hit film/backwoods nightmare Deliverance (1972). Co-star Burt Reynolds and Beatty struck up a friendship together, and Ned has since been cast by Burt in several other films together, including White Lightning (1973), W.W. and the Dixie Dancekings (1975), and the abysmal Stroker Ace (1983). Ned's talents were also noticed by others in Hollywood and he was cast in many key productions of the 1970s turning in stellar performance, including an Academy Award nomination of Best Supporting Actor for his role in Network (1976). Beatty was also marvelous in Nashville (1975), under fire from a crazed sniper in The Deadly Tower (1975), an undercover FBI man in the action/comedy Silver Streak (1976), as Lex Luthor's bumbling assistant, Otis, in the blockbuster Superman (1978)... and he returned again with Gene Hackman to play Otis and Lex Luthor again in Superman II (1980). Beatty continued to remain busy throughout the 1980s with appearances in several big budget television productions including Les derniers jours de Pompéi (1984). However, the overall caliber of the productions in general did not match up to those he had appeared in during the 1970s. Nonetheless, Beatty still shone in films including The Big Easy (1986) and The Fourth Protocol (1987). Into the 1990s, Beatty's work output swung between a mixture of roles in family orientated productions (Gulliver's Travels (1996), Back to Hannibal: The Return of Tom Sawyer and Huckleberry Finn (1990), etc.) taking advantage of his \"fatherly\" type looks, but he could still accentuate a hard edge, and additionally was cast in Radioland Murders (1994) and Just Cause (1995). His many other films include The Toy (1982), All the President's Men (1976), Wise Blood (1979), Rudy (1993), Spring Forward (1999), Hear My Song (1991) -- for which he earned a Golden Globe nomination for Best Supporting Actor -- Prelude to a Kiss (1992), He Got Game (1998) and Cookie's Fortune (1999). Beatty's numerous television credits include three years on the NBC series Homicide: Life on the Street (1993), Streets of Laredo (1995), and The Boys (1993). Beatty received an Emmy Award nomination for Best Actor for his performance in Friendly Fire (1979) opposite Carol Burnett, and a Best Supporting Actor nomination for Family Channel's Last Train Home (1989). Other notable credits include The Wool Cap (2004), The Execution of Private Slovik (1974), A Woman Called Golda (1982), Pray TV (1982), the miniseries Robert Kennedy and His Times (1985), Lockerbie: A Night Remembered (1998) and T Bone N Weasel (1992). He also had a recurring role on Roseanne (1988) and performed musically on television specials for Dolly Parton and The Smothers Brothers. In 2001, Beatty returned to his theatrical roots starring in London's West End revival production of Tennessee Williams' \"Cat on a Hot Tin Roof\" with Brendan Fraser. He also appeared in the production on Broadway in 2003/2004 with Jason Patric and Ashley Judd. In 2006, Beatty completed three features to be released next year: The Walker (2007); a Paul Schrader film also starring Woody Harrelson, Kristin Scott Thomas, and Lily Tomlin; Paramount's Shooter (2007) starring Mark Wahlberg; and Charlie Wilson's War (2007), a Mike Nichols film with Tom Hanks, Philip Seymour Hoffman and Julia Roberts. Blessed with eight children, Beatty enjoys golf and playing the bass guitar. He gives himself until the age of 70 to become proficient at both. Also in the 21st century, Beatty turned out a terrific performance in the popular Where the Red Fern Grows (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000885","name":"Ned Beatty","nicknames":["The busiest actor in Hollywood"],"idIMDB":"nm0000885"},"actorId":"nm0000885","character":"Gen. Ed Sheppard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Cook","urlProfile":"http://www.imdb.com/name/nm1064214","urlPhoto":"","biography":{"bio":"Bruce Cook is an actor, known for Nicholas Nickleby (2002), Thunderpants (2002) and Wondrous Oblivion (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1064214","name":"Bruce Cook","idIMDB":"nm1064214"},"actorId":"nm1064214","character":"Patrick Smash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rupert Grint","urlProfile":"http://www.imdb.com/name/nm0342488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDA3NjA1N15BMl5BanBnXkFtZTcwMDcyMDYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1988","placeOfBirth":" Stevenage, Hertfordshire, England, UK","birthName":"Rupert Alexander Lloyd Grint","height":"5' 8\" (1.73 m)","bio":"Rupert Alexander Lloyd Grint was born in Harlow, Essex, England, the elder son of Joanne (Parsons) and Nigel Grint, who dealt in memorabilia. The first of 5 children, Rupert has one brother and 3 sisters. His brother James was born when Rupert was a year old, Georgina and Samantha were born in 1993 and 1996 respectively, and last, but not least, Charlotte, who was born in 1999. Rupert grew up in Hertfordshire, the English county directly to the north of London, conveniently placed for commuting to Leavesden Film Studios. Before successfully auditioning for the Harry Potter films, Rupert attended Richard Hale Secondary School in Hertford: here he took an active interest in school plays, being cast as Rumplestilskin in the Brothers Grimm fairy tales. He was also a regular attendee at weekend drama classes at Top Hat Stage School, also in Hertford. Time at school was limited, as Rupert was needed on set for the Harry Potter films, where all of the child actors were tutored for four hours a day on set, to keep up with legal requirements. During the summer of 2004, he took his GCSE (General Certificate of Secondary Education) exams and completed his formal education.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDA3NjA1N15BMl5BanBnXkFtZTcwMDcyMDYzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342488","name":"Rupert Grint","idIMDB":"nm0342488"},"actorId":"nm0342488","character":"Alan A. Allen","urlCharacter":"http://www.imdb.com/character/ch0334782","main":true},{"actorName":"Bronagh Gallagher","urlProfile":"http://www.imdb.com/name/nm0302345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTc2MTM4OF5BMl5BanBnXkFtZTcwMTY3MjQ1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1972","placeOfBirth":" County Londonderry, Northern Ireland, UK","height":"5' 3\" (1.6 m)","bio":"Bronagh Gallagher is an Irish-born singer and actress. Born in 1972 in Northern Ireland, Bronagh became involved in the performing arts, including music and drama during her teenage years. She later joined a local amateur drama group known as the Oakgrove Theatre Company. Bronagh made her screen debut in 1989, starting mostly on television series. Her first big feature film appearance was in Alan Parker 's _The Commitments (1991) _ followed three years later in Quentin Tarantino 's Pulp Fiction (1994). Five years after that she appeared in 'George Lucas' 's film prequel Star Wars: Episode I - The Phantom Menace (1999). Rolling into the 21st century, Bronagh's work balanced out evenly between television and film. Further film appearances included Tristan + Isolde (2006) and Sherlock Holmes (2009). Her additional television work included Holby City (1999), The Bill (1984), The Field of Blood (2011) and in 2012 Pramface (2012). Bronagh still remains active as a singer as well as a musician.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTc2MTM4OF5BMl5BanBnXkFtZTcwMTY3MjQ1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0302345","name":"Bronagh Gallagher","idIMDB":"nm0302345"},"actorId":"nm0302345","character":"Mrs. Smash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor McGuire","urlProfile":"http://www.imdb.com/name/nm0570302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDIwMzI2OV5BMl5BanBnXkFtZTcwMjg1MzMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1964","placeOfBirth":" Liverpool, England, UK","height":"5' 11\" (1.8 m)","bio":"Victor McGuire was born on March 17, 1964 in Liverpool, England. He is an actor, known for Star Wars: The Force Awakens (2015), The Phantom of the Opera (2004) and Lock, Stock and Two Smoking Barrels (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDIwMzI2OV5BMl5BanBnXkFtZTcwMjg1MzMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570302","name":"Victor McGuire","idIMDB":"nm0570302"},"actorId":"nm0570302","character":"Mr. Smash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Godley","urlProfile":"http://www.imdb.com/name/nm0324134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNzIzOTAwNl5BMl5BanBnXkFtZTgwMDg4NjA3NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1964","placeOfBirth":" Amersham, England, UK","height":"6' 1\" (1.85 m)","bio":"Adam Godley is a film, television and theatre actor. He is a Tony Award nominee and has been nominated three times for the Olivier Award. He began his acting career at the age of 9, in a BBC radio production of Hemingway's My Old Man. His first stage role came at age 11, as Prince Giovanni in The White Devil at The Old Vic. His childhood career also included work at London's National Theatre, in Lillian Helman's Watch on the Rhine, and Close of Play, directed by Harold Pinter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNzIzOTAwNl5BMl5BanBnXkFtZTgwMDg4NjA3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0324134","name":"Adam Godley","idIMDB":"nm0324134"},"actorId":"nm0324134","character":"Placido P. Placeedo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leslie Phillips","urlProfile":"http://www.imdb.com/name/nm0680587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NjYzMzU5NF5BMl5BanBnXkFtZTcwOTgyNjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1924","placeOfBirth":" Tottenham, London, England, UK","birthName":"Leslie Samuel Phillips","height":"5' 8½\" (1.74 m)","bio":"A much-loved comic actor who has specialized in playing plummy, quintessentially English stereotypes, Leslie Phillips' heart was in acting from a very young age. He received elocution lessons as a child in order to lose his natural cockney accent (at that time a regional British accent was a major impediment to an aspiring actor) and he attended the Italia Conti School. During the Second World War, he served with the Durham Light Infantry (1942-45) until he was invalided out suffering from shellshock. He returned to acting, and it was during the 1950s that he established himself as a notable player in British movies. His greatest claim to fame to this day are the \"Doctor\" series of movies, which he inherited from Dirk Bogarde. He also worked on radio, most notably 'The Navy Lark' for the BBC. In later life, he returned to playing supporting roles and even appeared in Steven Spielberg's Empire of the Sun (1987). He continues to make cameo appearances in films and television and is a regular guest on British chat shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NjYzMzU5NF5BMl5BanBnXkFtZTcwOTgyNjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0680587","name":"Leslie Phillips","idIMDB":"nm0680587"},"actorId":"nm0680587","character":"Judge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Hardy","urlProfile":"http://www.imdb.com/name/nm0362735","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTA5MzQxMl5BMl5BanBnXkFtZTcwODE0NjQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1925","placeOfBirth":" Cheltenham, Gloucestershire, England, UK","birthName":"Timothy Sydney Robert Hardy","height":"5' 9\" (1.75 m)","bio":"One of England's most enduringly successful character actors, Robert Hardy is noted for his versatility and depth. Born in Cheltenham in 1925, he studied at Oxford University and, in 1949, he joined the Shakespeare Memorial Theatre at Stratford-upon-Avon. Television viewers most fondly remember him as the overbearing Siegfried Farnon in All Creatures Great and Small (1978) but his most critically acclaimed performance was as the title character of Winston Churchill: The Wilderness Years (1981). His portrayal of Britain's wartime leader was so accurately observed that, in the following years, he was called on to reprise the role in such productions as The Woman He Loved (1988) and War and Remembrance (1988). Unlike some British character actors, Hardy has never been recognized by Hollywood and his work in films has therefore been restricted to appearances in predominantly British-based productions such as The Spy Who Came in from the Cold (1965), Mary Shelley's Frankenstein (1994) and Sense and Sensibility (1995). He has been awarded the CBE for services to acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTA5MzQxMl5BMl5BanBnXkFtZTcwODE0NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362735","name":"Robert Hardy","nicknames":["Tim"],"idIMDB":"nm0362735"},"actorId":"nm0362735","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Higgins","urlProfile":"http://www.imdb.com/name/nm0383417","urlPhoto":"","biography":{"bio":"John Higgins is an actor, known for Au nom du père (1993), All the Little Animals (1998) and La tranchée (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0383417","name":"John Higgins","idIMDB":"nm0383417"},"actorId":"nm0383417","character":"Paediatrician","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lillie Crossley","urlProfile":"http://www.imdb.com/name/nm1189006","urlPhoto":"","biography":{"bio":"Lillie Crossley is an actress, known for Thunderpants (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1189006","name":"Lillie Crossley","idIMDB":"nm1189006"},"actorId":"nm1189006","character":"Denise, age 5","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Davies","urlProfile":"http://www.imdb.com/name/nm1187959","urlPhoto":"","biography":{"bio":"Sam Davies is an actor, known for Thunderpants (2002), Framed (2009) and High Tide (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1187959","name":"Sam Davies","idIMDB":"nm1187959"},"actorId":"nm1187959","character":"Patrick, age 3","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0283054","urlIMDB":"http://www.imdb.com/title/tt0283054","business":{"budget":{"money":"$7,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"£430,913","country":"UK","day":"26","month":"05","year":"2002","remarks":"356 Screens"}],"gross":[{"money":"£1,860,002","country":"UK","day":"30","month":"06","year":"2002","remarks":""},{"money":"£1,805,300","country":"UK","day":"23","month":"06","year":"2002","remarks":""},{"money":"£1,696,519","country":"UK","day":"16","month":"06","year":"2002","remarks":""},{"money":"£1,561,209","country":"UK","day":"09","month":"06","year":"2002","remarks":""},{"money":"£727,554","country":"UK","day":"02","month":"06","year":"2002","remarks":""},{"money":"£430,913","country":"UK","day":"26","month":"05","year":"2002","remarks":""}],"weekendGross":[{"money":"£44,405","country":"UK","day":"30","month":"06","year":"2002","remarks":"248 Screens"},{"money":"£98,541","country":"UK","day":"23","month":"06","year":"2002","remarks":"306 Screens"},{"money":"£105,102","country":"UK","day":"16","month":"06","year":"2002","remarks":"325 Screens"},{"money":"£272,401","country":"UK","day":"09","month":"06","year":"2002","remarks":"354 Screens"},{"money":"£169,692","country":"UK","day":"02","month":"06","year":"2002","remarks":"360 Screens"},{"money":"£430,913","country":"UK","day":"26","month":"05","year":"2002","remarks":"356 Screens"}],"admissions":[{"money":"9,960","country":"Netherlands","day":"31","month":"12","year":"2003","remarks":""},{"money":"9,930","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"04","year":"2001","remarks":null},{"money":null,"country":null,"day":"19","month":"06","year":"2001","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 23 min (83 min) (UK)","1 hr 27 min (87 min) (UK)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm (Fuji)"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"3.6","filmingLocations":[{"location":"153 Hammersmith Road, Hammersmith, London, England, UK"}],"rated":"PG","awards":[{"award":"Lucas - International Festival of Films for Children and Young People 2002","titlesAwards":[{"titleAwardOutcome":"Won Lucas","categories":[{"category":"Best Film","names":[{"name":"Peter Hewitt","id":"nm0382072","role":null}]}]}]}],"votes":"4,719","type":"Movie","companyCreditsSimple":[{"idCompany":"co0027958","name":"CP Medien AG"},{"idCompany":"co0032206","name":"Mission Pictures"},{"idCompany":"co0108804","name":"Pathé Pictures International"}],"keywords":{"keywords":["invention","astronaut","tenor","dream","best friend","hero","dream comes true","countdown","spacecraft","rescue mission","command center","rocket launch","general","rocket","space station","courtroom","trial","arrest","spotlight","concert","opera singer","world tour","bully comeuppance","flying machine","friendship","singer","boy genius","school","child","voice over narration","first person narration","flatulence","undressing","underwear","punishment","public humiliation","bully","briefs","redhead"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:05:03"}}