{"data":{"movies":[{"title":"Reign of Fire","originalTitle":"","year":"2002","releaseDate":"20020712","directors":[{"name":"Rob Bowman","id":"nm0101385"}],"writers":[{"name":"Gregg Chabot","id":"nm0149305"},{"name":"Kevin Peterka","id":"nm0676270"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTUxNTMxNV5BMl5BanBnXkFtZTYwODg2ODU3._V1.jpg","countries":["USA","UK","Ireland"],"languages":["English"],"genres":["Action","Adventure","Fantasy","Sci-Fi","Thriller"],"plot":"It is twenty years in the future, and the planet has been devastated by vicious fire-breathing dragons. The last vestiges of humanity now struggle for survival at remote outposts. In a ruined castle in the English countryside, Quinn is desperately trying to hold together a band of frightened, restless survivors. As a boy, Quinn watched his mother die protecting him from one of the beasts, and is still haunted by the memory. One day, a group of American rogues shows up, led by a brash, tough-guy named Van Zan. He claims to have discovered a way to kill the dragons once and for all, and enlists Quinn's help. But doing so will force Quinn to confront his own frightening memories. This, and Quinn's responsibilities to those that are under his protection, results in a battle of wills between the two men. In the end, events cause them both to realize that they must work together to defeat the monsters--both without and within.","simplePlot":"A brood of fire-breathing dragons emerges from the earth and begins setting everything ablaze, establishing dominance over the planet.","actors":[{"actorName":"Christian Bale","urlProfile":"http://www.imdb.com/name/nm0000288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk4MjQ4MF5BMl5BanBnXkFtZTcwMzExODQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1974","placeOfBirth":" Haverfordwest, Pembrokeshire, Wales, UK","birthName":"Christian Charles Philip Bale","height":"6' (1.83 m)","bio":"Christian Charles Philip Bale was born in Pembrokeshire, Wales, UK on January 30, 1974, to English parents Jennifer \"Jenny\" (James) and David Charles Howard Bale. His mother was a circus performer and his father, who was born in South Africa, was a commercial pilot. The family lived in different countries throughout Bale's childhood, including England, Portugal, and the United States. Bale acknowledges the constant change was one of the influences on his career choice. His first acting job was a cereal commercial in 1983; amazingly, the next year, he debuted on the West End stage in \"The Nerd\". A role in the 1986 NBC mini-series Anastasia: The Mystery of Anna (1986) caught Steven Spielberg's eye, leading to Bale's well-documented role in Empire of the Sun (1987). For the range of emotions he displayed as the star of the war epic, he earned a special award by the National Board of Review for Best Performance by a Juvenile Actor. Adjusting to fame and his difficulties with attention (he thought about quitting acting early on), Bale appeared in Kenneth Branagh's 1989 adaptation of Shakespeare's Henry V (1989) and starred as Jim Hawkins in a TV movie version of Treasure Island (1990). Bale worked consistently through the 1990s, acting and singing in Newsies (1992), Swing Kids (1993), Little Women (1994), The Portrait of a Lady (1996), The Secret Agent (1996), Metroland (1997), Velvet Goldmine (1998), All the Little Animals (1998), and A Midsummer Night's Dream (1999). Toward the end of the decade, with the rise of the Internet, Bale found himself becoming one of the most popular online celebrities around, though he, with a couple notable exceptions, maintained a private, tabloid-free mystique. Bale roared into the next decade with a lead role in American Psycho (2000), director Mary Harron's adaptation of the controversial Bret Easton Ellis novel. In the film, Bale played a murderous Wall Street executive obsessed with his own physicality - a trait for which Bale would become a specialist. Subsequently, the 10th Anniversary issue for \"Entertainment Weekly\" crowned Bale one of the \"Top 8 Most Powerful Cult Figures\" of the past decade, citing his cult status on the Internet. EW also called Bale one of the \"Most Creative People in Entertainment\", and \"Premiere\" lauded him as one of the \"Hottest Leading Men Under 30\". Bale was truly on the Hollywood radar at this time, and he turned in a range of performances in the remake Shaft (2000), Captain Corelli's Mandolin (2001), the balmy Laurel Canyon (2002), and Reign of Fire (2002), a dragons-and-magic commercial misfire that has its share of defenders. Two more cult films followed: Equilibrium (2002) and The Machinist (2004), the latter of which gained attention mainly due to Bale's physical transformation - he dropped a reported 60+ pounds for the role of a lathe operator with a secret that causes him to suffer from insomnia for over a year. Bale's abilities to transform his body and to disappear into a character influenced the decision to cast him in Batman Begins (2005), the first chapter in Christopher Nolan's definitive trilogy that proved a dark-themed narrative could resonate with audiences worldwide. The film also resurrected a character that had been shelved by Warner Bros. after a series of demising returns, capped off by the commercial and critical failure of Batman & Robin (1997). A quiet, personal victory for Bale: he accepted the role after the passing of his father in late 2003, an event that caused him to question whether he would continue performing. Bale segued into two indie features in the wake of Batman's phenomenal success: The New World (2005) and Harsh Times (2005). He continued working with respected independent directors in 2006's Rescue Dawn (2006), Werner Herzog's feature version of his earlier, Emmy-nominated documentary, Little Dieter Needs to Fly (1997). Leading up to the second Batman film, Bale starred in The Prestige (2006), the remake of 3:10 to Yuma (2007), and a reunion with director Todd Haynes in the experimental Bob Dylan biography, I'm Not There. (2007). Anticipation for The Dark Knight (2008) was spun into unexpected heights with the tragic passing of Heath Ledger, whose performance as The Joker became the highlight of the sequel. Bale's graceful statements to the press reminded us of the days of the refined Hollywood star as the second installment exceeded the box-office performance of its predecessor. Bale's next role was the eyebrow-raising decision to take over the role of John Connor in the Schwarzenegger-less Terminator Salvation (2009), followed by a turn as federal agent Melvin Purvis in Michael Mann's Public Enemies (2009). Both films were hits but not the blockbusters they were expected to be. For all his acclaim and box-office triumphs, Bale would earn his first Oscar in 2011 in the wake of The Fighter (2010)'s critical and commercial success. Bale earned the Best Supporting Actor award for his portrayal of Dicky Eklund, brother to and trainer of boxer \"Irish\" Micky Ward, played by Mark Wahlberg. Bale again showed his ability to reshape his body with another gaunt, skeletal transformation. Bale then turned to another auteur, Yimou Zhang, for the epic Sacrifices of War (2011), in which Bale portrayed a priest trapped in the midst of the Rape of Nanking. Bale earned headlines for his attempt to visit with Chinese civil-rights activist Chen Guangcheng, which was blocked by the Chinese government. Bale capped his role as Bruce Wayne/Batman in The Dark Knight Rises (2012); in the wake of the Aurora, Colorado tragedy, Bale made a quiet pilgrimage to the state to visit with survivors of the attack that left theatergoers dead and injured. He also starred in the thriller Out of the Furnace (2013) with Crazy Heart (2009) writer/director Scott Cooper, and the drama-comedy American Hustle (2013), reuniting with David O. Russell. Bale will re-team with The New World (2005) director Terrence Malick for two upcoming projects: Knight of Cups (2015) and an as-yet-untitled drama. In his personal life, he devotes time to charities including Greenpeace and the World Wildlife Foundation. He lives with his wife, Sibi Blazic, and their daughter, Emmeline.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk4MjQ4MF5BMl5BanBnXkFtZTcwMzExODQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000288","name":"Christian Bale","idIMDB":"nm0000288"},"actorId":"nm0000288","character":"Quinn Abercromby","urlCharacter":"http://www.imdb.com/character/ch0011439","main":true},{"actorName":"Matthew McConaughey","urlProfile":"http://www.imdb.com/name/nm0000190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1969","placeOfBirth":" Uvalde, Texas, USA","birthName":"Matthew David McConaughey","height":"6' (1.83 m)","bio":"American actor and producer Matthew David McConaughey was born in Uvalde, Texas. His mother, Mary Kathleen (McCabe), is a substitute school teacher originally from New Jersey. His father, James Donald McConaughey, was a Mississippi-born gas station owner who ran an oil pipe supply business. He is of Scottish, Irish, English, German, and Swedish descent. Matthew grew up in Longview, Texas, where he graduated from the local High School (1988). Showing little interest in his father's oil business, which his two brothers later joined, Matthew was longing for a change of scenery, and spent a year in Australia, washing dishes and shoveling chicken manure. Back to the States, he attended the University of Texas in Austin, originally wishing to be a lawyer. But, when he discovered an inspirational Og Mandino book \"The Greatest Salesman in the World\" before one of his final exams, he suddenly knew he had to change his major from law to film. He began his acting career in 1991, appearing in student films and commercials in Texas and directed short films as Chicano Chariots (1992). Once, in his hotel bar in Austin, he met the casting director and producer Don Phillips, who introduced him to director Richard Linklater for his next project. At first, Linklater thought Matthew was too handsome to play the role of a guy chasing high school girls in his coming-of-age drama Dazed and Confused (1993), but cast him after Matthew grew out his hair and mustache. His character was initially in three scenes but the role grew to more than 300 lines as Linklater encouraged him to do some improvisations. In 1995, he starred in Texas Chainsaw Massacre: The Next Generation (1994), playing a mad bloodthirsty sadistic killer, opposite Renée Zellweger. Shortly thereafter, moving to L.A., Matthew became a sensation with his performances in two high-profile 1996 films Lone Star (1996), where he portrayed killing suspected sheriff and in the film adaptation of John Grisham's novel A Time to Kill (1996), where he played an idealistic young lawyer opposite Sandra Bullock and Kevin Spacey. The actor was soon being hailed as one of the industry's hottest young leading man inspiring comparisons to actor Paul Newman. His following performances were Robert Zemeckis' Contact (1997) with Jodie Foster (the film was finished just before the death of the great astronomer and popularizer of space science Carl Sagan) and Steven Spielberg's Amistad (1997), a fact-based 1839 story about the rebellious African slaves. In 1998, he teamed again with Richard Linklater as one of the bank-robbing brothers in The Newton Boys (1998), set in Matthew's birthplace, Uvalde, Texas. During this time, he also wrote, directed and starred in the 20-minute short The Rebel (1998). In 1999, he starred in the comedy Edtv (1999), about the rise of reality television, and in 2000, he headlined Jonathan Mostow's U-571 (2000), portraying officer Lt. Tyler, in a WW II story of the daring mission of American submariners trying to capture the Enigma cipher machine. In the 2000s, he became known for starring in romantic comedies, such as Un mariage trop parfait (2001), opposite Jennifer Lopez, and How to Lose a Guy in 10 Days (2003), in which he co-starred with Kate Hudson. He played Denton Van Zan, an American warrior and dragons hunter in the futuristic thriller Reign of Fire (2002), where he co-starred with Christian Bale. In 2006, he starred in the romantic comedy Failure to Launch (2006), and later as head coach Jack Lengyel in We Are Marshall (2006), along with Matthew Fox. In 2008, he played treasure hunter Benjamin \"Finn\" Finnegan in Fool's Gold (2008), again with Kate Hudson. After playing Connor Mead in Ghosts of Girlfriends Past (2009), co-starring with Jennifer Garner, McConaughey took a two year hiatus to open different opportunities in his career. Since 2010, he has moved away from romantic comedies. That change came in 2011, in his first movie after that pause, when he portrayed criminal defense attorney Mickey Haller in The Lincoln Lawyer (2011), that operates mostly from the back seat of his Lincoln car. After this performance that was considered one of his best until then, Matthew played other iconic characters as district attorney Danny Buck Davidson in Bernie (2011), the wild private detective \"Killer\" Joe Cooper in Killer Joe (2011), Mud in Mud (2012), reporter Ward Jensen in The Paperboy (2012), male stripper club owner Dallas in Magic Mike (2012), starring Channing Tatum. McConaughey's career certainly reached it's prime, when he played HIV carrier Ron Woodroof in the biographical drama Dallas Buyers Club (2013), shot in less than a month. For his portrayal of Ron, Matthew won the Best Actor in the 86th Academy Awards, as well as the Golden Globe Award for Best Actor, among other awards and nominations. The same year, he also appeared in Martin Scorsese's The Wolf of Wall Street (2013). In 2014, he starred in HBO's True Detective (2014), as detective Rustin Cohle, whose job is to investigate with his partner Martin Hart, played by Woody Harrelson, a gruesome murder that happened in his little town in Louisiana. The series was highly acclaimed by critics winning 4 of the 7 categories it was nominated at the 66th Primetime Emmy Awards; he also won a Critics' Choice Award for the role. Later in 2014, Matthew starred in Christopher Nolan's sci-fi film Interstellar (2014), playing Cooper, a former NASA pilot.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000190","name":"Matthew McConaughey","idIMDB":"nm0000190"},"actorId":"nm0000190","character":"Denton Van Zan","urlCharacter":"http://www.imdb.com/character/ch0011441","main":true},{"actorName":"Izabella Scorupco","urlProfile":"http://www.imdb.com/name/nm0001713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzM1MDEzMV5BMl5BanBnXkFtZTcwMDEyOTYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1970","placeOfBirth":" Bialystok, Podlaskie, Poland","birthName":"Izabella Dorota Skorupko","height":"5' 9\" (1.75 m)","bio":"Born in the northern Polish town of Bialystok, Izabella Scorupco moved to Sweden with her mother as a young child. She studied drama and music and, at 17, was discovered by a Swedish film director who cast her in the movie Ingen kan älska som vi (1988), which made her a local teenage idol. She then became a successful model in Sweden and throughout Europe, where she made good use of her fluency in four languages. In 1989, Scorupco displayed another facet of her talents, launching her career as a pop singer with her first single, Substitute. The single and subsequent album, IZA, both went gold, and she followed with another hit single, Shame, Shame, which she recorded in 1991. Returning to acting in 1994, she immediately won the lead role in the Swedish film The Tears of Saint Peter (1995). Scorupco stars as a woman who lives her life as a man in the medieval drama, which was released in August 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzM1MDEzMV5BMl5BanBnXkFtZTcwMDEyOTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001713","name":"Izabella Scorupco","nicknames":["Iza"],"idIMDB":"nm0001713"},"actorId":"nm0001713","character":"Alex Jensen","urlCharacter":"http://www.imdb.com/character/ch0011443","main":true},{"actorName":"Gerard Butler","urlProfile":"http://www.imdb.com/name/nm0124930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1969","placeOfBirth":" Paisley, Scotland, UK","birthName":"Gerard James Butler","height":"6' 2\" (1.88 m)","bio":"Gerard James Butler was born in Paisley, Scotland, to Margaret and Edward Butler, a bookmaker. His family is of Irish origin. Gerard spent some of his very early childhood in Montreal, Quebec, but was mostly raised, along with his older brother and sister, in his hometown of Paisley. His parents divorced when he was a child, and he and his siblings were raised primarily by their mother, who later remarried. He had no contact with his father between the ages of two and 16 years old, after which time they became close. His father passed away when Gerard was in his early 20s. Butler went on to attend Glasgow University, where he studied to be a lawyer/solicitor. He was president of the school's law society thanks to his outgoing personality and great social skills. His acting career began when he was approached in a London coffee shop by actor Steven Berkoff, who later appeared alongside Butler in Attila (2001), who gave him a role in a stage production of \"Coriolanus\". After that, Butler decided to give up law for acting. He was cast as Ewan McGregor's character \"Renton\" in the stage adaptation of Trainspotting. His film debut was as Billy Connolly's younger brother in Mrs Brown (1997). While filming the movie in Scotland, he was enjoying a picnic with his mother near the River Tay when they heard the shouts of a young boy, who had been swimming with a friend, who was in some trouble. Butler jumped in and saved the young boy from drowning. He received a Certificate of Bravery from the Royal Humane Society. He felt he only did what anyone in the situation would have done. His film career continued with small roles, first in the \"James Bond\" movie, Tomorrow Never Dies (1997), and then Russell Mulcahy's Tale of the Mummy (1998). In 2000, Butler was cast in two breakthrough roles, the first being \"Attila the Hun\" in the USA Network mini-series, Attila (2001). The film's producers wanted a known actor to play the part but kept coming back to Butler's screen tests and decided he was their man. He had to lose the thick Scottish accent, but managed well. Around the time \"Attila\" was being filmed, casting was in progress for Wes Craven's new take on the \"Dracula\" legacy. Also wanting a known name, Butler wasn't much of a consideration, but his unending tenacity drove him to hounding the producers. Eventually, he sent them a clip of his portrayal of \"Attila\". Evidently, they saw something because Dracula 2000 (2000) was cast in the form of Butler. Attila's producers, thinking that his big-screen role might help with their own film's ratings, finished shooting a little early so he could get to work on Dracula 2000 (2000). Following these two roles, Butler developed quite a fan base, an Internet site and began appearing on lists everywhere. Since then, he has appeared in Reign of Fire (2002) as \"Creedy\" and Lara Croft Tomb Raider: The Cradle of Life (2003) as \"Terry Sheridan\", alongside Angelina Jolie. The role that garnered him the most attention from both moviegoers and movie makers, alike, was that of \"Andre Marek\" in the big-screen adaptation of Michael Crichton's novel, Timeline (2003). Butler played an archaeologist who was sent back in time with a team of students to rescue a colleague. Last year, he appeared in Andrew Lloyd Webber's musical, The Phantom of the Opera (2004), playing the title character in the successful adaptation of the stage musical. It was a role that brought him much international attention. Other projects include Dear Frankie (2004), The Game of Their Lives (2005) and Beowulf, la légende viking (2005). In 2007, he starred as Spartan \"King Leonidas\" in the Warner Bros. production 300 (2006), based on the Frank Miller graphic novel, and Shattered (2007), co-starring Pierce Brosnan and Maria Bello, which aired on network TV under the title, \"Shattered\". He most recently starred in P.S. I Love You (2007), with Academy Award-winner Hilary Swank. In 2007, he appeared in Nim's Island (2008) and RocknRolla (2008), and completed the new Mark Neveldine / Brian Taylor film, Gamer (2009). His next films included The Ugly Truth (2009), co-starring Katherine Heigl, which began filming in April 2008, The Bounty Hunter (2010), How to Train Your Dragon (2010), Chasing Mavericks (2012) and Olympus Has Fallen (2013). Butler is also a relative of rising animator and film director Mark Flood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0124930","name":"Gerard Butler","nicknames":["Gerry"],"idIMDB":"nm0124930"},"actorId":"nm0124930","character":"Creedy","urlCharacter":"http://www.imdb.com/character/ch0011440","main":true},{"actorName":"Scott Moutter","urlProfile":"http://www.imdb.com/name/nm0610187","urlPhoto":"","biography":{"dateOfBirth":"10 November 1984","placeOfBirth":" Wolverhampton, England, UK","bio":"Scott Moutter was born on November 10, 1984 in Wolverhampton, England. He is an actor, known for Reign of Fire (2002), Dunkirk (2004) and In a Land of Plenty (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0610187","name":"Scott Moutter","idIMDB":"nm0610187"},"actorId":"nm0610187","character":"Jared Wilke","urlCharacter":"http://www.imdb.com/character/ch0049779","main":true},{"actorName":"David Kennedy","urlProfile":"http://www.imdb.com/name/nm0447986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzgxMzE4Nl5BMl5BanBnXkFtZTcwNjU0MTYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"David Kennedy was born David Mallett in 1964 and lived with his mother in Hornsey, North London before moving to Devon aged 5 with his mother and step father. He attended King Edward VI Comprehensive School in Totnes, Devon and lived in Bristol and Gloucester before returning to London in 1990 to study acting at Webber Douglas Academy of Dramatic Art. Since graduating from Webber Douglas in 1992 David has worked extensively in theatre, television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzgxMzE4Nl5BMl5BanBnXkFtZTcwNjU0MTYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447986","name":"David Kennedy","idIMDB":"nm0447986"},"actorId":"nm0447986","character":"Eddie Stax","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Siddig","urlProfile":"http://www.imdb.com/name/nm0796502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjYwMTA3MV5BMl5BanBnXkFtZTcwNDQxODYzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1965","placeOfBirth":" Sudan","birthName":"Siddig El Tahir El Fadil El Siddig Abderahman Mohammed Ahmed Abdel Karim El Mahdi","height":"5' 11¾\" (1.82 m)","bio":"Born in Sudan, Siddig was raised in Britain and attended the London Academy of Music and Dramatic Arts (LAMDA) where he studied acting and theater. Immediately after leaving LAMDA, Sid did a season of theater in Manchester, in addition to performing in various shows in pubs and small theaters. Later, Siddig worked as a director in a small theater in London. \"I was in a situation where I pretty much had a theater company at my disposal and a theater at my disposal and could do anything I liked...as long as I did it for nothing. Which is sort of a step before charging and not being able to do what you like. I was at a point where I could have just gone on and become a director in London, as a trainee at the Royal Shakespeare Company or something like that, and ended up being a bona fide director. It was quite a big struggle because for a year and a half, which is the time I spent directing immediately after I left acting school, you just have no money so you're just living on welfare and you're trying to make it. . .\" During this time of financial struggle Sid was offered the part of Emir Feisal in Great Performances: A Dangerous Man: Lawrence After Arabia (1992), the sequel to Lawrence of Arabia (1962). Sid co-starred with Ralph Fiennes who played T. E. Lawrence. Siddig's performance in Great Performances: A Dangerous Man: Lawrence After Arabia (1992) brought him to the attention of Rick Berman who was creating the new series Star Trek: Deep Space Nine (1993). Originally brought in to audition for the role of Captain Benjamin Sisko, Berman decided Siddig was too young for the role and cast him as Dr. Julian Bashir instead. The part had to be slightly rewritten for Siddig as the original \"bible\" had called for an Hispanic male to play the part, named Julian Amoros, although Berman reports that no other actors were considered for the role. During his time on Star Trek: Deep Space Nine (1993), Siddig and co-star Nana Visitor had a son (Django) and were married in 1997. They divorced in 2001, although they remain friends. After a successful seven-year run on television, Siddig began working in feature films, quickly accumulating roles in movies such as Vertical Limit (2000), Reign of Fire (2002), Kingdom of Heaven (2005), and the critically acclaimed Syriana (2005). Early 2005 saw Siddig return to the stage opposite Kim Cattrall in the West End production of \"Whose Life Is It Anyway?\" Following a controversial guest turn on MI-5 (2002), the title role in Hannibal (2006) in 2006 and a recurring role on 24 (2001) in 2007 brought Siddig back to the small screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjYwMTA3MV5BMl5BanBnXkFtZTcwNDQxODYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0796502","name":"Alexander Siddig","nicknames":["Sid"],"idIMDB":"nm0796502"},"actorId":"nm0796502","character":"Ajay","urlCharacter":"http://www.imdb.com/character/ch0011442","main":true},{"actorName":"Ned Dennehy","urlProfile":"http://www.imdb.com/name/nm0219329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDM2OTQ2Ml5BMl5BanBnXkFtZTgwNzE3OTcxMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1½\" (1.87 m)","bio":"Ned Dennehy (born 8 December, 1965) he is an Irish actor, who has appeared in British and Irish films and television. His most notable film role to date is Tommy in Tyrannosaur. He has also appeared in Blitz, he played Alderton in Harry Potter and the Deathly Hallows, - Part 1 and the independent British feature film Downhill. His television work includes RTÉ's Damo and Ivor and BBC dramas Parade's End, Luther, Peaky Blinders, and the Leading role of Letters Malloy in Banished and Dickensian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDM2OTQ2Ml5BMl5BanBnXkFtZTgwNzE3OTcxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0219329","name":"Ned Dennehy","idIMDB":"nm0219329"},"actorId":"nm0219329","character":"Barlow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rory Keenan","urlProfile":"http://www.imdb.com/name/nm0444676","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTYwOTcwMF5BMl5BanBnXkFtZTgwNTU3OTgyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Rory recently appears in the feature film The Young Messiah,The Head Hunter, the TV series The Brothers Grimsby, Stan Lee's Lucky Man (SKY) , as Bilibin in War and Peace (BBC) directed by Tom Harper and recurring role of Donal in season two of Peaky Blinders with Cillian Murphy and Tom Hardy for Tiger Aspect/BBC. Rory appeared as Aidan McBride in The Guard, a new feature film written and directed by John McDonagh and starring Brendan Gleeson and Don Cheadle for Element Films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTYwOTcwMF5BMl5BanBnXkFtZTgwNTU3OTgyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444676","name":"Rory Keenan","idIMDB":"nm0444676"},"actorId":"nm0444676","character":"Devon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terence Maynard","urlProfile":"http://www.imdb.com/name/nm0562793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjYxNzMyNV5BMl5BanBnXkFtZTcwOTU0ODczMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1969","placeOfBirth":" Liverpool, England, UK","height":"6' (1.83 m)","bio":"Terence Maynard was born in Liverpool and brought up in Nantwich, Cheshire. At the age of eight he showed a natural gift for dancing and, encouraged by his family, went to dance classes three times a week. As a result he became interested in performance in general and studied drama at the Guildford School of Acting, Guildford, where it became apparent to him that his main interest was in acting. On graduation in June 1991 he became a jobbing actor, his first big break being in 1998 in 'Roger, Roger', a comedy-drama series set in a taxi office. From this he graduated to a leading role in Sky One's football soap 'Dream Team' and has since appeared in a recurring role in 'Holby City' and the children's comedy series 'Young Dracula' as a descendant of Van Helsing, and, on the West End stage in 'Chicago.' In 2014 he joined the cast of 'Coronation Street'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjYxNzMyNV5BMl5BanBnXkFtZTcwOTU0ODczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0562793","name":"Terence Maynard","idIMDB":"nm0562793"},"actorId":"nm0562793","character":"Gideon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doug Cockle","urlProfile":"http://www.imdb.com/name/nm0168339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxOTk1MDI4MV5BMl5BanBnXkFtZTcwNjU0NDI5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1970","placeOfBirth":" Twentynine Palms, California, USA","birthName":"Douglas Steven Cockle","height":"5' 11½\" (1.82 m)","bio":"Doug Cockle was born on September 16, 1970 in Twentynine Palms, California, USA as Douglas Steven Cockle. He is an actor, known for Captain America: The First Avenger (2011), The Witcher 3: Wild Hunt (2015) and Reign of Fire (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxOTk1MDI4MV5BMl5BanBnXkFtZTcwNjU0NDI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0168339","name":"Doug Cockle","idIMDB":"nm0168339"},"actorId":"nm0168339","character":"Goosh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randall Carlton","urlProfile":"http://www.imdb.com/name/nm1055192","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMjYxMTI0OV5BMl5BanBnXkFtZTYwNDA5MTgy._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1969","placeOfBirth":" Fort Olgethorpe, Georgia, USA","birthName":"Randy Carlton","height":"6' 3\" (1.91 m)","bio":"Randall's diverse experiences and travels have provided a wealth of knowledge and have added great depth to his acting since growing up on a small humble family cattle farm in rural North Georgia. After completing the ROTC program in college and a four year tour of duty as an officer in the US Army in 1995, he returned home to Georgia and began working in his first degree field, Engineering, with a lucrative manufacturing plant. Realizing that it just was not satisfying enough, he and his wife, Jodi, sold their 36 acre farm and relocated from Northwest Georgia to Athens, Georgia in 1998 to attend UGA for further education. Being a \"non-traditional\" student, he began pursuing a second degree in history while also exploring a secondary dormant passion of his, acting. He had done a few talent shows while attending his first college, Berry College in Rome, Georgia, where he also was the school mascot in 1990, but acting or drama classes never really entered his mind. However, in Athens, he felt a new sense of freedom and a strong desire to pursue acting. So, he became heavily involved in community theatre, and sought out background work in Road Trip (2000) and Unshackled (2000), both in which he was cast on the spot for featured roles. Beginning to feel serious about acting, he enrolled and began actor training in the Alliance Theatre Acting Program in Atlanta at nights. After finishing at UGA, in mid 2000 he and his wife moved overseas to Dublin, Ireland, where he attended the prestigious Trinity College pursuing an accelerated master's degree in Irish Medieval History by day and attending the renowned Gaiety School of Acting in Dublin at night. After much background work in feature films, several principal roles in local Independent films, The Dance of Life (2001) some stage work, and countless auditions in Dublin and throughout Ireland, he finally landed a supporting role in one of the biggest films ever to shoot in Ireland, Reign of Fire (2002). Soon after, he was cast in the triple Academy Award nominated film, In America (2002), directed by Jim Sheridan. Acting became his full-time pursuit. Since returning to the US, he has been extremely busy with lead and supporting roles in numerous Independent feature and short films,including Performance Anxiety (2003), Sandtown (2004), Strike the Tent (2004), television appearances in the Critical Rescue (2003) series, commercials, and corporate/industrial films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMjYxMTI0OV5BMl5BanBnXkFtZTYwNDA5MTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1055192","name":"Randall Carlton","idIMDB":"nm1055192"},"actorId":"nm1055192","character":"Burke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Kelly","urlProfile":"http://www.imdb.com/name/nm0446268","urlPhoto":"","biography":{"bio":"Chris Kelly is known for his work on Reign of Fire (2002), Replicant (2001) and Resurrecting the Champ (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0446268","name":"Chris Kelly","idIMDB":"nm0446268"},"actorId":"nm0446268","character":"Mead","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Thornton","urlProfile":"http://www.imdb.com/name/nm0861488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDY3MTM4OV5BMl5BanBnXkFtZTYwMzY2ODU3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Ben Thornton is an actor, known for Reign of Fire (2002), Pollyanna (2003) and American Burger (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDY3MTM4OV5BMl5BanBnXkFtZTYwMzY2ODU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0861488","name":"Ben Thornton","idIMDB":"nm0861488"},"actorId":"nm0861488","character":"Young Quinn","urlCharacter":"http://www.imdb.com/character/ch0011439","main":true},{"actorName":"Alice Krige","urlProfile":"http://www.imdb.com/name/nm0000481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDk5NDQ3M15BMl5BanBnXkFtZTYwNzcwNTk2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1954","placeOfBirth":" Upington, South Africa","birthName":"Alice Maud Krige","height":"5' 5\" (1.65 m)","bio":"Alice Maud Krige was born on June 28, 1954 in Upington, South Africa where her father, Dr. Louis Krige, worked as a young physician. The Kriges later moved to Port Elizabeth where Alice grew up in what she describes as a \"very happy family\", a family that also included two brothers (both of whom became physicians) and her mother, Pat, a clinical psychologist. Interestingly, Alice also grew up without television, something which the actress calls a \"huge black hole in my education\" (South Africa did not start getting television until 1976, a year after Alice left the country to pursue an acting career in London). While growing up, she had no dreams or aspirations of pursuing an acting career, in fact as a child she had wanted to become a dancer, but her father disapproved. Instead, she prepared to follow in the footsteps of her mother by attending Rhodes University in Grahamstown where she pursued an undergraduate degree in psychology and literature (graduating in 1975). However, as luck or fate would have it, Alice decided to \"take up a bit of timetable\" by enrolling in a drama class in order to make use of a free credit. This decision would prove to be a life-altering one, resulting in an honors degree in drama from Rhodes, a move to London and a new career path. As Alice explains, \"I really got into it and it took over my life... it became my life-calling, all consuming.\" After arriving in England, she began three years of study at London's Central School of Speech and Drama. Her first professional acting performance was a tiny television role in a 1979 BBC Play for Today. In 1980, Alice made her feature film debut as Sybil Gordon in the Academy Award winning Best Picture, Chariots of Fire (1981). She then appeared in the television adaptation of Charles Dickens' A Tale of Two Cities (1980), which was followed by her memorable, dual role as the avenging spirit in Ghost Story (1981). Also in 1981, she debuted in a West End theatre production of Bernard Shaw's Arms and the Man, for which she received the honors of both a Plays and Players Award and a Laurence Olivier Award for Most Promising Newcomer. It was this early success in theatre that she decided to focus her career on next by spending some time working with the prestigious Royal Shakespeare Company. During her two seasons with the RSC (1982-83), Alice performed in such productions as \"King Lear\", \"The Tempest\", \"The Taming of the Shrew\" and \"Cyrano de Bergerac\". After her stint with the Royal Shakespeare Company, she returned to work in film and television. Her career could best be described as an eclectic mix of both mediums. She appeared in a diverse range of films, such as King David (1985), Barfly (1987), Haunted Summer (1988), Spies Inc. (1992) and See You in the Morning (1989). Her work in television included critically acclaimed miniseries, such as Ellis Island (1984) and Wallenberg: A Hero's Story (1985), as well as a healthy dose of what Alice herself calls, \"kitchen sink dramas\". This eclectic trend continued into the 1990s. In addition to numerous roles in television (including appearances on Beverly Hills, 90210 (1990) and Becker (1998), Alice also appeared in the films Sleepwalkers (1992), Institute Benjamenta, or This Dream That One Calls Human Life (1995), Donor Unknown (1995), Amanda (1996), Twilight of the Ice Nymphs (1997), Habitat (1997), The Commissioner (1998) and Molokai (1999). However, one notable standout was the film First Contact (1996) for which she won a 1997 Saturn Award for her portrayal of the Borg Queen. This is without a doubt the most commercial, mainstream film with which she has been involved. However, due to the amount of make-up and prosthetics that the role required, Alice claims that even today she is still most recognized from her role in Ghost Story (1981). One obvious and lasting impact of her experience with Star Trek: First Contact has been her initiation into the world of Star Trek/sci-fi conventions. These weekend-long conventions take place all over the United States and Europe (primarily in the United Kingdom and Germany). They feature \"guests\", such as Alice, who give presentations, sign autographs, etc. The new millennium finds her with several new projects to her credit, which include such works as Le petit vampire (2000), the Star Trek: Voyager (1995) series finale \"Endgame\", Attila (2001), Dinotopia (2002), Reign of Fire (2002), Children of Dune (2003), Natalie Wood - Le prix de la gloire (2004) and a recurring guest role in the HBO series Deadwood (2004). Current projects include a film about the life of Julius Caesar, the horror film Silent Hill (2006), Coeurs perdus (2006) and Le contrat (2006). In addition, she continues to make sporadic convention appearances and was recently awarded an honorary doctorate in literature from Rhodes University. Alice Krige is married to writer/director Paul Schoolman, and lives what she describes as an \"itinerant\" lifestyle. Although she and her husband maintain a permanent home in the United States, they spend much of their time living and working abroad.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDk5NDQ3M15BMl5BanBnXkFtZTYwNzcwNTk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000481","name":"Alice Krige","idIMDB":"nm0000481"},"actorId":"nm0000481","character":"Karen Abercromby","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0253556","urlIMDB":"http://www.imdb.com/title/tt0253556","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$15,632,281","country":"USA","day":"14","month":"07","year":"2002","remarks":"2,629 Screens"},{"money":"£932,168","country":"UK","day":"25","month":"08","year":"2002","remarks":"365 Screens"},{"money":"€837,577","country":"Italy","day":"24","month":"11","year":"2002","remarks":"171 Screens"},{"money":"€1,189,791","country":"Spain","day":"03","month":"11","year":"2002","remarks":"222 Screens"}],"gross":[{"money":"$43,061,982","country":"USA","day":"27","month":"10","year":"2002","remarks":""},{"money":"$43,060,566","country":"USA","day":"20","month":"10","year":"2002","remarks":""},{"money":"$43,051,553","country":"USA","day":"13","month":"10","year":"2002","remarks":""},{"money":"$43,033,102","country":"USA","day":"06","month":"10","year":"2002","remarks":""},{"money":"$42,993,616","country":"USA","day":"29","month":"09","year":"2002","remarks":""},{"money":"$42,929,971","country":"USA","day":"22","month":"09","year":"2002","remarks":""},{"money":"$42,830,488","country":"USA","day":"15","month":"09","year":"2002","remarks":""},{"money":"$42,668,272","country":"USA","day":"08","month":"09","year":"2002","remarks":""},{"money":"$42,451,145","country":"USA","day":"01","month":"09","year":"2002","remarks":""},{"money":"$42,014,439","country":"USA","day":"25","month":"08","year":"2002","remarks":""},{"money":"$41,628,862","country":"USA","day":"18","month":"08","year":"2002","remarks":""},{"money":"$41,123,172","country":"USA","day":"11","month":"08","year":"2002","remarks":""},{"money":"$39,830,595","country":"USA","day":"04","month":"08","year":"2002","remarks":""},{"money":"$36,406,517","country":"USA","day":"28","month":"07","year":"2002","remarks":""},{"money":"$29,246,331","country":"USA","day":"21","month":"07","year":"2002","remarks":""},{"money":"$15,632,281","country":"USA","day":"14","month":"07","year":"2002","remarks":""},{"money":"£3,216,609","country":"UK","day":"15","month":"09","year":"2002","remarks":""},{"money":"£2,983,525","country":"UK","day":"08","month":"09","year":"2002","remarks":""},{"money":"£2,298,692","country":"UK","day":"01","month":"09","year":"2002","remarks":""},{"money":"£932,168","country":"UK","day":"25","month":"08","year":"2002","remarks":""},{"money":"$39,088,201 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"€2,136,380","country":"Italy","day":"15","month":"12","year":"2002","remarks":""},{"money":"€2,013,209","country":"Italy","day":"08","month":"12","year":"2002","remarks":""},{"money":"€1,608,592","country":"Italy","day":"01","month":"12","year":"2002","remarks":""},{"money":"€837,577","country":"Italy","day":"24","month":"11","year":"2002","remarks":""},{"money":"€3,466,900","country":"Spain","day":"01","month":"12","year":"2002","remarks":""},{"money":"€3,232,740","country":"Spain","day":"24","month":"11","year":"2002","remarks":""},{"money":"€2,831,420","country":"Spain","day":"17","month":"11","year":"2002","remarks":""},{"money":"€2,227,040","country":"Spain","day":"10","month":"11","year":"2002","remarks":""},{"money":"€1,321,990","country":"Spain","day":"03","month":"11","year":"2002","remarks":""},{"money":"€1,189,791","country":"Spain","day":"03","month":"11","year":"2002","remarks":""}],"weekendGross":[{"money":"$4,635","country":"USA","day":"20","month":"10","year":"2002","remarks":"13 Screens"},{"money":"$9,825","country":"USA","day":"13","month":"10","year":"2002","remarks":"26 Screens"},{"money":"$25,721","country":"USA","day":"06","month":"10","year":"2002","remarks":"56 Screens"},{"money":"$41,205","country":"USA","day":"29","month":"09","year":"2002","remarks":"95 Screens"},{"money":"$62,983","country":"USA","day":"22","month":"09","year":"2002","remarks":"135 Screens"},{"money":"$114,877","country":"USA","day":"15","month":"09","year":"2002","remarks":"205 Screens"},{"money":"$133,336","country":"USA","day":"08","month":"09","year":"2002","remarks":"212 Screens"},{"money":"$279,483","country":"USA","day":"01","month":"09","year":"2002","remarks":"241 Screens"},{"money":"$277,681","country":"USA","day":"25","month":"08","year":"2002","remarks":"268 Screens"},{"money":"$251,827","country":"USA","day":"18","month":"08","year":"2002","remarks":"174 Screens"},{"money":"$403,975","country":"USA","day":"11","month":"08","year":"2002","remarks":"401 Screens"},{"money":"$1,566,807","country":"USA","day":"04","month":"08","year":"2002","remarks":"1,485 Screens"},{"money":"$3,469,035","country":"USA","day":"28","month":"07","year":"2002","remarks":"2,005 Screens"},{"money":"$7,317,994","country":"USA","day":"21","month":"07","year":"2002","remarks":"2,629 Screens"},{"money":"$15,632,281","country":"USA","day":"14","month":"07","year":"2002","remarks":"2,629 Screens"},{"money":"£101,146","country":"UK","day":"15","month":"09","year":"2002","remarks":"194 Screens"},{"money":"£325,415","country":"UK","day":"08","month":"09","year":"2002","remarks":"313 Screens"},{"money":"£603,437","country":"UK","day":"01","month":"09","year":"2002","remarks":"362 Screens"},{"money":"£932,168","country":"UK","day":"25","month":"08","year":"2002","remarks":"365 Screens"},{"money":"€54,920","country":"Italy","day":"15","month":"12","year":"2002","remarks":"58 Screens"},{"money":"€249,475","country":"Italy","day":"08","month":"12","year":"2002","remarks":"141 Screens"},{"money":"€527,039","country":"Italy","day":"01","month":"12","year":"2002","remarks":"167 Screens"},{"money":"€157,540","country":"Spain","day":"01","month":"12","year":"2002","remarks":"173 Screens"},{"money":"€307,538","country":"Spain","day":"24","month":"11","year":"2002","remarks":"221 Screens"},{"money":"€476,296","country":"Spain","day":"17","month":"11","year":"2002","remarks":"222 Screens"},{"money":"€671,361","country":"Spain","day":"10","month":"11","year":"2002","remarks":"222 Screens"},{"money":"€1,189,791","country":"Spain","day":"03","month":"11","year":"2002","remarks":"222 Screens"}],"admissions":[{"money":"404,385","country":"Germany","day":"26","month":"01","year":"2003","remarks":""},{"money":"318,267","country":"Germany","day":"19","month":"01","year":"2003","remarks":""},{"money":"166,112","country":"Germany","day":"12","month":"01","year":"2003","remarks":""},{"money":"718,933","country":"Spain","day":"28","month":"11","year":"2002","remarks":""},{"money":"704,692","country":"Spain","day":"24","month":"11","year":"2002","remarks":""},{"money":"614,771","country":"Spain","day":"17","month":"11","year":"2002","remarks":""},{"money":"480,984","country":"Spain","day":"10","month":"11","year":"2002","remarks":""},{"money":"250,598","country":"Spain","day":"03","month":"11","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"02","year":"2001","remarks":null},null],"copyrightHolder":"Copyright © 2002 B &amp; B Company"},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Panaflex Cameras, Panavision Anamorphic Lenses"],"laboratory":["Technicolor, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.2","metascore":"39","filmingLocations":[{"location":"Black Castle, Wicklow, Ireland"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2003","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Fantasy Film","names":[]}]}]},{"award":"Rondo Hatton Classic Horror Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Rondo Statuette","categories":[{"category":"Best Genre Film","names":[{"name":"Rob Bowman","id":"nm0101385","role":null}]}]}]},{"award":"Sitges - Catalonian International Film Festival 2002","titlesAwards":[{"titleAwardOutcome":"Won Best Visual Effects","categories":[{"category":"","names":[{"name":"Richard R. Hoover","id":"nm0393923","role":null}]}]},{"titleAwardOutcome":"Nominated Best Film","categories":[{"category":"","names":[{"name":"Rob Bowman","id":"nm0101385","role":null}]}]}]}],"votes":"111,052","type":"Movie","companyCreditsSimple":[{"idCompany":"co0031181","name":"Spyglass Entertainment"},{"idCompany":"co0049348","name":"Touchstone Pictures"},{"idCompany":"co0079026","name":"Tripod Entertainment"}],"keywords":{"keywords":["dragon","fire breathing dragon","survival","militia","castle","star wars reference","starving","tunnel construction","edinburgh scotland","sword fight","falcon","horse riding","british","death","eaten alive","dragonslayer","flying dragon","surrogate father","post apocalypse","2020s","england","axe","future","fire chief","refugee","boy","vehicle convoy","battle tank","winged dragon","human versus dragon","dragon feature","incineration","fire repellent","elevator","scholarship","pigeon","drilling","drill","northumberland","burning a document","harvesting","harvest","field","trapped","parachutist","parachute","ashes","theatre audience","children's theatre","theatre production","children","dormitory","eating","food","alarm","horse","pilot","motorcycle","orphan","audio montage","armor","drink","drinking","celebration","party","water","flying","shooting","flashlight","cave","creature","writing","inferno","animated scene","animated map","map","evolution","machine gun","tower","magnesium","arrow","telescope","teenage boy","blood","iodine","fight","crusade","sword","prayer","burned alive","dragon tooth","fireman","truck","rifle","girl","voice over narration","montage","surrogate son","father son relationship","rescue","loss of mother","part computer animation","skeleton","napalm","fortress","london england","helicopter","crossbow","tunnel","tank","eiffel tower paris","shot through the mouth","explosion","underground","death of mother","beast","american","fire","kaiju","military leader","skydiver","knight","hawk","telephone call","u.s. cavalry","cannibalism","mother son relationship","creature feature","title based on song","skydiving"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:07:24"}}