{"data":{"movies":[{"title":"Legally Blonde","originalTitle":"","year":"2001","releaseDate":"20010713","directors":[{"name":"Robert Luketic","id":"nm0525659"}],"writers":[{"name":"Amanda Brown","id":"nm0113005"},{"name":"Karen McCullah","id":"nm0527581"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNjUwMTkxMV5BMl5BanBnXkFtZTcwNjk0NDk0NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Elle Woods () has it all. She's the president of her sorority, a Hawaiian Tropic girl, Miss June in her campus calendar, and, above all, a natural blonde. She dates the cutest fraternity boy on campus and wants nothing more than to be Mrs. Warner Huntington III. But, there's just one thing stopping Warner () from popping the question: Elle is too blonde. Growing up across the street from might mean something in LA, but nothing to Warner's East-Coast blue blood family. So, when Warner packs up for Harvard Law and reunites with an old sweetheart from prep school, Elle rallies all her resources and gets into Harvard, determined to win him back. But law school is a far cry from the comforts of her poolside and the mall. Elle must wage the battle of her life, for her guy, for herself and for all the blondes who suffer endless indignities everyday.","simplePlot":"When a blonde sorority queen is dumped by her boyfriend, she decides to follow him to law school to get him back and, once there, learns she has more legal savvy than she ever imagined.","actors":[{"actorName":"Reese Witherspoon","urlProfile":"http://www.imdb.com/name/nm0000702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDcxMDA5Ml5BMl5BanBnXkFtZTgwNDM1NTU5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1976","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Laura Jeanne Reese Witherspoon","height":"5' 1½\" (1.56 m)","bio":"Laura Jeanne Reese Witherspoon was born on March 22, 1976 at Southern Baptist Hospital (now Memorial Medical Center) in New Orleans, Louisiana. She is the second child of Mary Elizabeth \"Betty\" (Reese) and Dr. John Draper Witherspoon, Sr. Her father was a military surgeon specializing in ear, nose and throat. Her mother was a Registered Nurse who later became a Ph.D in pediatric nursing. Reese spent the first four years of her life in Wiesbaden, Germany, where her father served as a lieutenant colonel in the US Army reserves. Shortly after, John moved the family back to the States, settling in Nashville, Tennessee. Reese was introduced to the entertainment industry at a very early age. At age 7, she began modeling. This led to appearances on several local television commercials. At age 11, she placed first in a Ten-State Talent Fair. In 1990, she landed her first major acting role in Robert Mulligan's The Man in the Moon (1991). Her role as a 14-year old tomboy earned her rave reviews. Roles in bigger films such as Jack the Bear (1993) and A Far Off Place (1993) followed shortly after. Following high school graduation in 1994 from Harpeth Hall, a Nashville all girls school, Reese decided to put her acting career on hold and attend Stanford University where she would major in English literature. However, her collegiate plans were shortly dashed when she accepted roles to star in two major motion pictures: Fear (1996) alongside Mark Wahlberg and Freeway (1996) with Kiefer Sutherland. Although neither film was a huge box-office success, they did help to establish Reese as a rising starlet in Hollywood and open the door for bigger and better film roles. Those bigger roles came in movies such as Pleasantville (1998), Election (1999) and Cruel Intentions (1999). Her breakthrough role came as Elle Woods in the 2001 comedy Legally Blonde (2001). The movie was huge box-office smash and established Reese as one of the top female draws in Hollywood. The next year, she scored a follow-up hit with Sweet Home Alabama (2002) which went on to gross over $100 million dollars at the box office. In 2006, she took home the best actress Oscar for her role as June Carter Cash in the Johnny Cash biopic Walk the Line (2005). In the late 2000s and early 2010s, Reese continued to star in more romantic comedies such as Tout... sauf en famille (2008) and How Do You Know (2010). In December 2010, she received a star on the Hollywood Walk of Fame. In the year 2014, she produced both Gone Girl (2014) and Wild (2014) for which she got nominated for best actress Oscar again for her role as Cheryl Strayed Off the screen, she was married to Ryan Phillippe from 1999 to 2007. They met at her 21st birthday party and subsequently worked together in Cruel Intentions (1999). They have two children: a daughter, Ava Elizabeth (born 9 September 1999) and a son, Deacon (born 23 October 2003). In March 2011, Reese remarried talent agent Jim Toth. She gave birth to a second son, Tennessee (born 27 September 2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDcxMDA5Ml5BMl5BanBnXkFtZTgwNDM1NTU5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000702","name":"Reese Witherspoon","idIMDB":"nm0000702"},"actorId":"nm0000702","character":"Elle Woods","urlCharacter":"http://www.imdb.com/character/ch0007378","main":true},{"actorName":"Luke Wilson","urlProfile":"http://www.imdb.com/name/nm0005561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE3MjYxNDk4Nl5BMl5BanBnXkFtZTcwMDQ5OTQzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1971","placeOfBirth":" Dallas, Texas, USA","birthName":"Luke Cunningham Wilson","height":"5' 11\" (1.8 m)","bio":"Handsome Texan Luke Cunningham Wilson was born in Dallas in 1971, to Irish-American parents originally from Massachusetts. The son of Laura (Cunningham), a photographer, and Robert Andrew Wilson, an advertising executive, he was raised with two brothers, Owen Wilson (the middle one) and Andrew Wilson (the eldest one). The three would all go on to make their careers in film, with Luke Wilson discovering his love of acting while a student at Occidental College. In 1993, the brothers Wilson collaborated with Wes Anderson to make Bottle Rocket (1994), which was initially a 13-minute short. The gleefully optimistic story of three Texans who aspire to become successful thieves, Bottle Rocket (1994) premiered at the 1993 Sundance Festival, where it attracted the attention of director James L. Brooks. With Brooks' help, the short became a full-length feature film released in 1996 under the same name, Bottle Rocket (1996). Afterwards, Wilson moved to Hollywood, setting up house with his two brothers and Anderson and the same year, Wilson also appeared in the coming-of-age drama Telling Lies in America (1997). After large roles in three 1998 comedies, Best Men (1997), Bongwater (1998), and Home Fries (1998) (the latter two co-starring Drew Barrymore), Wilson went on to star in another three comedies the following year. The first, Dog Park (1998), was a Canadian film directed by The Kids in the Hall (1988) alum Bruce McCulloch and featured Wilson as one of a group of twenty-something's undergoing the trials and tribulations of love. Blue Streak (1999) starred the actor as the sidekick of robber-turned-policeman Martin Lawrence, while Kill the Man (1999) (which premiered at the 1999 Sundance Festival) cast him as the owner of a small copy centre competing with a large chain store across the street. Though he would stick closely to comedy through 2001 with roles in Charlie's Angels (2000) and Legally Blonde (2001), Wilson took a turn for the sinister in the thrillers Bad Seed (2000) and Soul Survivors (2001) before reteaming with his brother Owen Wilson and Wes Anderson to give one of his most memorable performances as Richie in The Royal Tenenbaums (2001). In 2003, Wilson reprised two past roles, appearing in both Charlie's Angels: Full Throttle (2003) and Legally Blonde 2: Red, White & Blonde (2003). That same year, he also scored a hit as one of the stars of Todd Phillips' Old School (2003). The year 2004 saw Wilson embark on The Wendell Baker Story (2005), a film he starred in, co-directed with brother Andrew Wilson. Although he made his film debut in the acclaimed independent film Bottle Rocket (1996), he initially got more recognition for his real-life role as Drew Barrymore's boyfriend than for his acting. Fortunately for Wilson, his onscreen talents outlasted his relationship with Barrymore, and he has enjoyed steady employment and increasing visibility through substantial roles in a number of films","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE3MjYxNDk4Nl5BMl5BanBnXkFtZTcwMDQ5OTQzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005561","name":"Luke Wilson","nicknames":["One-Take Wilson"],"idIMDB":"nm0005561"},"actorId":"nm0005561","character":"Emmett","urlCharacter":"http://www.imdb.com/character/ch0143701","main":true},{"actorName":"Selma Blair","urlProfile":"http://www.imdb.com/name/nm0004757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDg0NDYwN15BMl5BanBnXkFtZTcwMzczOTA1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1972","placeOfBirth":" Southfield, Michigan, USA","birthName":"Selma Blair Beitner","height":"5' 4\" (1.63 m)","bio":"One of our most exciting and versatile actresses, Selma Blair first gained attention for her performance in Cruel Intentions (1999), a youthful retelling of the classic novel \"Les Liaisons Dangereuses\". Selma was born in Southfield, Michigan, to Molly Ann (Cooke), a judge, and Elliot I. Beitner, a lawyer. She had a Jewish upbringing. After graduating from high school in Michigan, Selma moved to New York City to pursue her goal of being a photographer but found her way to acting classes at The Stella Adler Conservatory and Stonestreet Studios. Selma starred for two seasons as the title character in the WB's Zoe, Duncan, Jack & Jane (1999) and then appeared in the hit comedy, Legally Blonde (2001) opposite Reese Witherspoon. She then starred opposite Cameron Diaz and Christina Applegate in The Sweetest Thing (2002) and in two independent films that garnered her much critical acclaim: Dana Lustig's Kill Me Later (2001) and Todd Solondz's controversial Storytelling (2001). In 2004, Selma starred in Guillermo del Toro's Hellboy (2004) and appeared in John Waters's A Dirty Shame (2004). Her other film credits include Paul Weitz's In Good Company (2004), opposite Topher Grace in Pretty Persuasion (2005), opposite Stellan Skarsgård in The Killing Gene (2007), in Ed Burns's Purple Violets (2007), in Robert Benton's Feast of Love (2007) starring opposite Morgan Freeman and Greg Kinnear.and Newton Thomas Sigel's award-winning short film, The Big Empty (2005) opposite Elias Koteas. 2008 was a busy year for Selma Blair. After My Mom's New Boyfriend (2008) (aka \"Homeland Security\"), Selma returned to the big screen as \"Liz Sherman\" in Guillermo del Toro's blockbuster sequel, Hellboy II: The Golden Army (2008). She also starred in an independent film by writer and director Lori Petty, titled The Poker House (2008), starring opposite Oscar and Golden Globe nominee, Jennifer Lawrence. In the fall of 2008, Selma went to television and shot one season with NBC's Kath & Kim (2008), starring opposite Molly Shannon. In the fall of 2009, Selma took to the stage and played \"Kathleen\" in award-winning playwright Rajiv Joseph's \"Gruesome Playground Injuries\". In 2010, Selma starred in the suspense thriller, Columbus Circle (2012), starring opposite Jason Lee, Amy Smart, Giovanni Ribisi and Kevin Pollak. Selma did some shorts during 2010, including 3 episodes of Lisa Kudrow's Web Therapy (2008), a Danko Jones music video starring opposite Elijah Wood, a guest episode of Fred Armisen's web TV show Portlandia (2011) and a Mollie Jones short titled Animal Love (2011). Selma completed two films in 2011. In Their Skin (2012), a home invasion thriller, starring opposite James D'Arcy, and Dark Horse (2011) - Todd Solondz's latest film starring opposite Jordan Gelber, Christopher Walken and Mia Farrow. Dark Horse (2011) was selected for competition and is set to have its world premiere at the 68th annual Venice Film Festival followed by the Toronto Film Festival in September of 2011. 2011 also brings Selma Blair's latest project, motherhood. Selma and her \"Ever Clothing\" fashion designer boyfriend, Jason Bleick, welcomed their son, Arthur Saint Bleick, on July 25th 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDg0NDYwN15BMl5BanBnXkFtZTcwMzczOTA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004757","name":"Selma Blair","idIMDB":"nm0004757"},"actorId":"nm0004757","character":"Vivian Kensington","urlCharacter":"http://www.imdb.com/character/ch0007381","main":true},{"actorName":"Matthew Davis","urlProfile":"http://www.imdb.com/name/nm0205127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzE2MTY3M15BMl5BanBnXkFtZTcwOTAyMzc0Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1978","placeOfBirth":" Salt Lake City, Utah, USA","birthName":"Matthew W. Davis","height":"6' 1¼\" (1.86 m)","bio":"Matthew W. Davis (born May 8, 1978), also professionally known as Matt Davis, is an American actor who is known for his roles as Adam Hillman on the ABC comedy-drama What About Brian from 2006 to 2007 and Alaric Saltzman on The CW fantasy drama The Vampire Diaries from 2009 to 2012. In 2014, he returned as a series regular for the sixth season, he starred on the short-lived CW mystery and horror drama Cult as Jeff Sefton, and had a recurring role on the CBS police drama CSI: Crime Scene Investigation as Sean Yeager. Davis was born in Salt Lake City, Utah. He attended Woods Cross High School, and the University of Utah. He was briefly married to actress Leelee Sobieski in 2008. Davis co-starred with Reese Witherspoon and Selma Blair in the comedy Legally Blonde (2001), as Warner Huntington III, who breaks up with Elle Woods (Witherspoon). His notable film credits include Blue Crush (2002) with Kate Bosworth and Michelle Rodriguez, Tigerland (2000) with Colin Farrell and BloodRayne (2005) with Kristanna Loken. Davis starred in The CW fantasy drama The Vampire Diaries, as Alaric Saltzman since 2009 and starred in the short-lived CW mystery and horror drama Cult, as Jeff Sefton that same year. Davis had a recurring role in the CBS police drama CSI: Crime Scene Investigation from 2013 to 2014 in the 14th season, as swing shift CSI Sean Yeager. He appeared in the sixth episode titled \"Passed Pawns\", the eighth episode titled \"Helpless\", and the 13th episode titled \"Boston Brakes\". He later returned to the hit The CW show The Vampire Diaries as Alaric Saltzman once again as a series regular.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzE2MTY3M15BMl5BanBnXkFtZTcwOTAyMzc0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205127","name":"Matthew Davis","nicknames":["Matt"],"idIMDB":"nm0205127"},"actorId":"nm0205127","character":"Warner","urlCharacter":"http://www.imdb.com/character/ch0117376","main":true},{"actorName":"Victor Garber","urlProfile":"http://www.imdb.com/name/nm0001255","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQxODYxNzE3NV5BMl5BanBnXkFtZTcwOTM4MTMwMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1949","placeOfBirth":" London, Ontario, Canada","birthName":"Victor Jay Garber","height":"6' 2\" (1.88 m)","bio":"Victor Garber has been in some of the most memorable projects of the past four decades. Victor is currently appearing in The Slap, The Flash, Motive and Web Therapy. He will soon star in Greg Berlanti's new Untitled DC Comics Superhero series for Warner Bros/CW. He has shared in two Screen Actors Guild (SAG) Award® nominations for Outstanding Motion Picture Cast, the latest for Milk (2008), and previously as a member of the cast of Titanic (1997) as well as winning with the cast of Argo (2012). Garber received three Emmy® nods for his role on Alias (2001-2006) and has also earned Emmy® nominations for Life with Judy Garland: Me and My Shadows (2001), and his guest roles on Frasier (2000) and Will & Grace (2004). He is also an accomplished stage actor, whose extensive credits encompass lead roles in both plays and musicals, and has earned four Tony Award® nominations, for his work in Damn Yankees (1994-1995), Lend Me a Tenor (1989-1990), Little Me (1982) and Deathtrap (1978-1982. Victor also starred in the 1998 Tony Award winning Best Play, Art.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQxODYxNzE3NV5BMl5BanBnXkFtZTcwOTM4MTMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001255","name":"Victor Garber","idIMDB":"nm0001255"},"actorId":"nm0001255","character":"Professor Callahan","urlCharacter":"http://www.imdb.com/character/ch0007388","main":true},{"actorName":"Jennifer Coolidge","urlProfile":"http://www.imdb.com/name/nm0177639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NjYyMzgxNl5BMl5BanBnXkFtZTcwMjgyMzM0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1961","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Jennifer Audrey Coolidge","height":"5' 10\" (1.78 m)","bio":"Jennifer Coolidge is a versatile character actress and experimental comedienne, best known for playing Stifler's mom in American Pie (1999). She was born on August 28, 1961, in Boston, Massachusetts, USA, to Gretchen (Knauff) and Paul Constant Coolidge, a plastics manufacturer. Young Coolidge was dreaming of becoming a singer. She attended Norwell High School and Emerson College in Boston, Massachusetts, and earned her bachelor's degree in theatre in 1985. She moved to New York and joined the Gotham City improv group. Then, she headed to Los Angeles where she became a long-running member of \"The Groundlings\" comedy troupe. Coolidge made her television debut in a guest role on NBC's Seinfeld (1989), playing a voluptuous masseuse who won't offer her professional services to boyfriend Jerry in a 1993 episode. The following year, she had a regular gig on ABC's short-lived sketch series She TV (1994), then briefly became a cast member and writer on another short-lived sketch comedy series, Fox's Saturday Night Special (1996) produced by Roseanne Barr. Coolidge made her big screen debut as a nurse in Not of This Earth (1995), then in the courtroom comedy Trial and Error (1997). Then, she appeared in small roles in several more feature films, and also continued her television work. Coolidge had her breakthrough role in American Pie (1999), as a boozed-up and sultry mom who seduces her son's classmate with the comment that she liked her scotch and men the same way: aged 18 years. She recreated the character in the sequel American Pie 2 (2001). Then, she reprized her role as \"Paulette\" opposite Reese Witherspoon in the \"Legally Blonde\" franchise. Although, she lost the part of \"Lynette Scavo\" on Desperate Housewives (2004) to Felicity Huffman, Coolidge graced several TV comedies as well, with major guest appearances on Frasier (1993) and Sex and the City (1998). Then, she landed a recurring role in the NBC sitcom Joey (2004), as \"Bobbie Morgenstern\", Joey's agent, appearing in 37 episodes over two seasons. Eventually, Coolidge emerged as a versatile character actress with her no-holds-barred approach to comedy and her vanity-free comfort with playing uninhibited, unappealing characters, and delivering lines with sexual innuendo. Her talent shines in a range of characters, from a gold-digging dog owner in Best in Show (2000), to a scheming wife of an elderly mogul in Les pieds sur terre (2001), to an opportunistic mother in American Dreamz (2006). Coolidge's gift for altering her appearance and manner, as well as her mastery of timing, shines in her perfectly hideous performance as \"Fiona\", a wicked stepmother in A Cinderella Story (2004) opposite Hilary Duff, for which Coolidge won a 2005 Teen Choice Award. Her lasting collaboration with director Christopher Guest continues in For Your Consideration (2006). She has been sharing her time between her two homes, one is in Hollywood, California, and one in New Orleans, where she bought a historic mansion before the Hurricane Katrina hit the city, and then became involved in its restoration.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NjYyMzgxNl5BMl5BanBnXkFtZTcwMjgyMzM0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177639","name":"Jennifer Coolidge","idIMDB":"nm0177639"},"actorId":"nm0177639","character":"Paulette","urlCharacter":"http://www.imdb.com/character/ch0007382","main":true},{"actorName":"Holland Taylor","urlProfile":"http://www.imdb.com/name/nm0852466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzcxODEwN15BMl5BanBnXkFtZTcwMDg3NTQyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1943","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Holland Virginia Taylor","height":"5' 4\" (1.63 m)","bio":"Holland Taylor was born in Philadelphia, Pennsylvania, the third-born (and last) daughter of her mother, Virginia (Davis), a painter, and the only child of her father, C. Tracy Taylor, an attorney. She spent her teen years in nearby Allentown, PA, where Holland got the nickname, \"Penny Taylor\" because of her coppery hair color. Holland attended Quaker schools, then majored in drama at Bennington College. At the age of 22 Holland moved to New York with the desire to become a \"great big Broadway star.\" After fifteen years of \"disappointments and near misses\" in New York and California, Holland was cast as Ruth Dunbar in the sitcom Bosom Buddies (1980) with Tom Hanks. It was Hollands \"breakout\" role and it lead to many other TV and film offers including the movie Romancing the Stone (1984) as Kathleen Turner's book publisher and friend. Holland had hesitated to accept the role but her acting coach and mentor Stella Adler encouraged her not to be so \"stage minded.\" In 1992 Holland was still living in Greenwhich Village, New York and traveling back and forth between a rented apartment in Hollywood and New York in order to work on both coasts. Holland has said her first love was the theater but the work for her in TV and films was better. However, by 1992, Holland said she was dealing with traveling back and forth \"less and less well\". Over the next few years, Holland moved to California full-time. In the last couple of years, she gave up her apartment in West Hollywood for her own home in the Hollywood Hills. Holland won an Emmy in 1999 for her work in The Practice (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzcxODEwN15BMl5BanBnXkFtZTcwMDg3NTQyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852466","name":"Holland Taylor","nicknames":["Penny Taylor"],"idIMDB":"nm0852466"},"actorId":"nm0852466","character":"Professor Stromwell","urlCharacter":"http://www.imdb.com/character/ch0007386","main":true},{"actorName":"Ali Larter","urlProfile":"http://www.imdb.com/name/nm0005123","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzA4Njc1NF5BMl5BanBnXkFtZTcwOTczNTUxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1976","placeOfBirth":" Cherry Hill, New Jersey, USA","birthName":"Alison Elizabeth Larter","height":"5' 8\" (1.73 m)","bio":"A native of Cherry Hill, New Jersey, Ali began modeling at age 13 and traveled the world before moving to Los Angeles to study acting. Her first professional acting job was a role on the television series Chicago Sons (1997). She received her breakthrough in the high school football drama Varsity Blues (1999) which included her infamous whipped cream bikini scene. Roles in the horror films House on Haunted Hill (1999) and Destination finale (2000) further transitioned her career as an actress. Acting alongside Colin Farrell, Larter starred in the Western comedy, American Outlaws (2001) which performed poorly at the box office. That year, she also starred as \"Brooke Taylor Windham\" in the comedy Legally Blonde (2001) with Reese Witherspoon. Not happy with how things were going, Larter moved to New York in 2002 to reassess her life and career. She reprized her role as \"Clear Rivers\" in the sequel Final Destination 2 (2003) for which she received star billing. A year later, she made a cameo appearance as herself on the pilot to the HBO comedy drama Entourage (2004) and starred in Three Way (2004) as \"Isobel Delano\". She had a role in A Lot Like Love (2005) as \"Gina\". Larter moved back to Los Angeles in 2006 where she auditioned for a role in the NBC sci-fi drama Heroes (2006). The pilot premiered on September 25, 2006 to successful ratings and many critics declaring it \"the new Lost (2004)\". The series ran for a total of 77 episodes in 4 Seasons when it was canceled due to diminishing ratings and high production costs. There has been interest in a mini-series or a movie to wrap up story lines. During her time on Heroes (2006), Larter made several appearances on film. The first was the Bollywood film Marigold (2007) where she received a seven-figure salary. The movie was met with primarily negative reviews. She also starred in Resident Evil: Extinction (2007), part 3 of the popular film franchise based on the Capcom video games. She played \"Claire Redfield\", based on the video game character of the same name. The movie was a box office success tripling its production budget, albeit being a critical flop. Larter also appeared in the caveman comedy Homo Erectus (2007) which was released direct-to-DVD. The film co-starred Hayes MacArthur, an actor whom she was engaged to marry in December 2007. In 2009, Larter starred opposite Beyoncé Knowles and Idris Elba in the thriller Obsessed (2009). The film opened at number one at the box office but was met with negative reviews, with some critics comparing it to Fatal Attraction (1987). It was also this year that Larter and MacArthur married in a small ceremony in Maine, among the guests was Larter's close friend, Amy Smart. She reprises her role as \"Claire Redfield\" in Resident Evil: Afterlife (2010), directed by Paul W.S. Anderson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzA4Njc1NF5BMl5BanBnXkFtZTcwOTczNTUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005123","name":"Ali Larter","nicknames":["Allegra Coleman"],"idIMDB":"nm0005123"},"actorId":"nm0005123","character":"Brooke Taylor Windham","urlCharacter":"http://www.imdb.com/character/ch0007376","main":true},{"actorName":"Jessica Cauffiel","urlProfile":"http://www.imdb.com/name/nm0004814","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTAxNTA5NF5BMl5BanBnXkFtZTcwMDE4OTE3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1976","placeOfBirth":" Detroit, Michigan, USA","height":"5' 4\" (1.63 m)","bio":"Jessica Cauffiel is best known for her memorable roles in several successful studio feature films, such as Legally Blonde, Legally Blonde 2: Red, White & Blonde, White Chicks, Hoot, Stuck On You, The World's Fastest Indian, Road Trip and Valentine; as well as popular network television series like The Drew Carey Show, My Name Is Earl, and Frasier. Following her producing debut in the acclaimed short film Bed Ridden, directed by Academy Award nominee Jonathan Heap and starring Alan Tudyk, Joel David Moore and herself, she produced and made her cinematic writing debut in the feature documentary The Original Mind, about visionary painter, poet and artist, Nicholas Kirsten Honshin. As Producer, Writer, and Assistant Editor, she heads behind the camera again for Master, which documents the extraordinary life of renowned 83-year-old Chinese Qi Gong and Kung Fu grandmaster, Master Zhou Ting Jue. Jessica is passionate about creating films that uplift, transform, and inspire people to realize their true power and the miraculous, unlimited potential within each of us.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTAxNTA5NF5BMl5BanBnXkFtZTcwMDE4OTE3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004814","name":"Jessica Cauffiel","nicknames":["Kada"],"idIMDB":"nm0004814"},"actorId":"nm0004814","character":"Margot","urlCharacter":"http://www.imdb.com/character/ch0007391","main":true},{"actorName":"Alanna Ubach","urlProfile":"http://www.imdb.com/name/nm0005513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NDIyNzgyNV5BMl5BanBnXkFtZTYwMzc3NDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1975","placeOfBirth":" Downey, California, USA","birthName":"Alanna Noel Ubach","height":"5' 3\" (1.6 m)","bio":"Alanna Ubach was born on October 3, 1975 in Downey, California, USA as Alanna Noel Ubach. She is an actress, known for Girlfriends' Guide to Divorce (2014), Meet the Fockers (2004) and Waiting... (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NDIyNzgyNV5BMl5BanBnXkFtZTYwMzc3NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005513","name":"Alanna Ubach","idIMDB":"nm0005513"},"actorId":"nm0005513","character":"Serena","urlCharacter":"http://www.imdb.com/character/ch0007385","main":true},{"actorName":"Oz Perkins","urlProfile":"http://www.imdb.com/name/nm0674020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1Njk2MTQ5NF5BMl5BanBnXkFtZTgwMjQ1NDU2ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1974","placeOfBirth":" New York City, New York, USA","birthName":"Osgood Robert Perkins","height":"6' 4\" (1.93 m)","bio":"Oz Perkins was born on February 2, 1974 in New York City, New York, USA as Osgood Robert Perkins. He is an actor and writer, known for Secretary (2002), Legally Blonde (2001) and Star Trek (2009). He was previously married to Sidney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1Njk2MTQ5NF5BMl5BanBnXkFtZTgwMjQ1NDU2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0674020","name":"Oz Perkins","idIMDB":"nm0674020"},"actorId":"nm0674020","character":"Dorky David Kidney","urlCharacter":"http://www.imdb.com/character/ch0007398","main":true},{"actorName":"Linda Cardellini","urlProfile":"http://www.imdb.com/name/nm0004802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MDM4MTM2NF5BMl5BanBnXkFtZTgwMTM4MjYyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1975","placeOfBirth":" Redwood City, California, USA","birthName":"Linda Edna Cardellini","height":"5' 3\" (1.6 m)","bio":"Linda Edna Cardellini was born in Redwood City, California, to Lorraine (Hernan) and Wayne David Cardellini, a businessman. She is of Italian (from her paternal grandfather), Irish (from her mother), German, English, and Scottish descent. Linda grew up in the San Francisco Bay area, California, the youngest of four children. She became interested in acting at age ten, when she performed a singing role in a school Christmas play. She continued to do school productions and community theater. Linda attended Saint Francis High School in Mountain View, California. After graduating, she had to decide whether to go to New York to pursue theater or Los Angeles to pursue film and television. She chose LA. Linda was cast in her first role, on the series Bone Chillers (1996). Her breakthrough part came when she was cast in Freaks and Geeks (1999). She played academic decathlete Lindsay Weir on the celebrated series, which won an Emmy Award in the Category of \"Outstanding Casting for a Comedy Series\". Cardellini captured the hearts of young girls, boys and teenagers, worldwide, for her portrayal of Velma in Warner Bros.'s Scooby-Doo (2002). She also co-starred in 'Brian Robbins'' Good Burger (1997), Legally Blonde (2001), with Reese Witherspoon, and Tom McLoughlin's Sous le silence (2001) with Andy Garcia, as well as in the Adam Sandler-produced comedy, Grandma's Boy (2006). In 2005, Cardellini starred in the ensemble film, American Gun (2005), for IFC Films, alongside Donald Sutherland, Forest Whitaker and Marcia Gay Harden. \"American Gun\" was the debut feature of director/co-writer Aric Avelino, which has earned a Best Picture nomination at the Independent Spirit Awards in 2007. In the same year, Cardellini delivered a heartfelt performance as a jilted lover in Ang Lee's highly-acclaimed drama, Brokeback Mountain (2005), which garnered major accolades from critics, including an Academy Award nomination and Golden Globe win for Best Picture and Outstanding Ensemble in a Motion Picture Drama by the Screen Actor's Guild. It was upon working with Larry McMurtry and Diana Ossana on this film, that they later cast her in CBS's Hallmark Hall of Fame mini-series Comanche Moon (2008), a testament to their trust in Cardellini's talent and presence on screen. Cardellini starred alongside Val Kilmer and Steve Zahn in the six-hour, epic mini-series in 2008, written by McMurtry (based on McMurtry's novel of the same name), directed by Simon Wincer and executive-produced by Ossana. This western, which was the prequel to \"Lonesome Dove,\" (the television series created in 1989 by McMurtry) aired on three consecutive evenings for two hours each night. In 2008, Cardellini portrayed the lead role of 'Julie Ingram' in the feature film \"The Lazarus Project\" starring alongside 'Paul Walker'. Directed by John Glenn, this thriller tells the story of a former criminal who is drawn into an illicit endeavor and subsequently finds himself living an inexplicable new life working at a psychiatric facility. In 2011, Cardellini co-starred in Jonathan Hensleigh's independent feature film \"Kill the Irishman,\" alongside Christopher Walken, Ray Stevenson and Val Kilmer. The film was based on the true story of Danny Greene, a tough Irish thug working for mobsters in Cleveland during the 1970s. In February 2012, Cardellini starred as 'Kelli' in the independent film \"Return,\" opposite Michael Shannon and John Slattery which earned Cardellini an Independent Spirit Award nomination for \"Best Female Lead.\" \"Return\" was featured in the Director's Fortnight section at the 2011 Cannes Film Festival and was an official entry at The Deauville, London and Palm Springs International Film Festivals. \"Return\" follows 'Kelli' as she returns home from war and learns how to adjust to a slower, normal life. In 2013, Cardellini was almost unrecognizable, but turned heads, for her provocative portrayal of 'Sylvia Rosen,' 'Don Draper's' married mistress, in a guest arc in the sixth season of the critically acclaimed AMC series, \"Mad Men.\" She received her first Emmy nomination for \"Outstanding Guest Actress in A Drama Series\" for her portrayal. Working in both film and television, Linda is well-known for her portrayal of 'Nurse Samantha Taggart' on NBC's highly-rated, critically acclaimed series, \"ER\". She will next be seen as 'Meg Rayburn' in Netflix's new untitled family drama series created by Glenn Kessler, Daniel Zelman and Todd Kessler. Cardellini also has a co-starring role in the indie comedy Welcome to Me (2014), opposite an all-star cast that includes Kristen Wiig, Tim Robbins, Joan Cusack, James Marsden and Wes Bentley. The film is directed by Shira Piven. \"Welcome to Me\" was produced by Will Ferrell and Adam McKay and premiered at the Toronto International Film Festival. On the small screen, Cardellini was a guest star, playing 'Dr. Megan Tillman', in CBS' Person of Interest (2011). The crime drama show was created by Jonathan Nolan and stars Jim Caviezel, Taraji P. Henson and Michael Emerson. Cardellini also lends her voice to a diverse group of animated series including Nickelodeon's \"Sanjay & Craig\" wherein she plays 'Megan,' IFC's \"Out There\" wherein she voices 'Starla,' and Disney's \"Gravity Falls,\" in which she is 'Wendy.' Cardellini's past voiceover work includes the role of 'Bliss,' the family daughter in the ABC animated television program, The Goode Family (2009). Linda has a Bachelor of Arts degree in Theatre from Loyola Marymount University, and completed a summer study program at the National Theatre in London. She resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MDM4MTM2NF5BMl5BanBnXkFtZTgwMTM4MjYyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004802","name":"Linda Cardellini","idIMDB":"nm0004802"},"actorId":"nm0004802","character":"Chutney","urlCharacter":"http://www.imdb.com/character/ch0007380","main":true},{"actorName":"Bruce Thomas","urlProfile":"http://www.imdb.com/name/nm0858573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNTIzNDYzOV5BMl5BanBnXkFtZTgwNzMwNzc1NDE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1961","placeOfBirth":" USA","height":"6' 2½\" (1.89 m)","bio":"Bruce Thomas was born on May 17, 1961 in the USA. He is known for his work on Army of Darkness (1992), Legally Blonde (2001) and Kyle XY (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNTIzNDYzOV5BMl5BanBnXkFtZTgwNzMwNzc1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0858573","name":"Bruce Thomas","idIMDB":"nm0858573"},"actorId":"nm0858573","character":"UPS Guy","urlCharacter":"http://www.imdb.com/character/ch0007393","main":true},{"actorName":"Meredith Scott Lynn","urlProfile":"http://www.imdb.com/name/nm0528761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjQxMTIwMV5BMl5BanBnXkFtZTYwMDE5NDEz._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1970","placeOfBirth":" Brooklyn, New York, USA","bio":"Meredith Scott Lynn was born on March 8, 1970 in Brooklyn, New York, USA. She is an actress and producer, known for Legally Blonde (2001), The Lion King 2: Simba's Pride (1998) and Days of Our Lives (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjQxMTIwMV5BMl5BanBnXkFtZTYwMDE5NDEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528761","name":"Meredith Scott Lynn","idIMDB":"nm0528761"},"actorId":"nm0528761","character":"Enid","urlCharacter":"http://www.imdb.com/character/ch0007399","main":true},{"actorName":"Raquel Welch","urlProfile":"http://www.imdb.com/name/nm0000079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjYyMTEyNV5BMl5BanBnXkFtZTgwMjcxMjMyMTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1940","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jo Raquel Tejada","height":"5' 6\" (1.68 m)","bio":"A new reigning 1960s international sex symbol took to the cinematic throne as soon as Raquel Welch emerged from the sea in her purposely depleted, furry prehistoric bikini. Tantalizingly wet with her garb clinging to all the right amazonian places, One Million Years B.C. (1966), if nothing else, captured the hearts and libidos of modern men (not to mention their teenage sons) while producing THE most definitive and best-selling pin-up poster of that time. After a major dry spell following the death of Marilyn Monroe in 1962, the auburn-maned Ms. Welch effortlessly assumed Marilyn's place and forever wiped away the notion that enduring sex goddesses came only in one form -- bottled blonds. She was born Jo Raquel Tejada on September 5, 1940 in Chicago, Illinois, the first of three children born to Bolivian Armando Carlos Tejada Urquizo, an aerospace engineer, and his Irish-American wife Josephine Sarah Hall, who was the daughter of American architect Emery Stanford Hall (1869-1939) and his wife Clara Louise Adams. The family moved to San Diego, California (her father was transferred) when Raquel was only two. Taking dance lessons as a youngster, she grew up to be quite a knockout and nailed a number of teen beauty titles (\"Miss Photogenic,\" \"Miss La Jolla,\" \"Miss Contour,\" \"Miss Fairest of the Fair\" and \"Miss San Diego\"). With her sights set on theater arts, she studied at San Diego State College on a scholarship starting in 1958 and married her first husband, high school sweetheart James Welch, the following year. They had two children Damon Welch (born 1959) and Tahnee Welch (born 1961). Tahnee went on to take advantage of her own stunning looks as an actress, most notably a prime featured role in Cocoon (1985). Off campus Raquel became a local TV weather girl in San Diego and eventually quit college. Following the end of her marriage in 1961 (she and Welch didn't divorced until 1965), she packed up her two children and moved to Dallas, Texas, where she modeled for Neiman-Marcus and worked as a barmaid for a time. Regrouping, she returned to California, migrated to Los Angeles, and made the rounds of film/TV auditions. Providing minor but sexy set decoration on the small screen (Bewitched (1964), McHale's Navy (1962) and The Virginian (1962)) as well as the large (Elvis Presley's Roustabout (1964) and Doris Day's Do Not Disturb (1965)). Caught in the midst of the \"beach party\" craze, it's not surprising to find out that her first prime film role was A Swingin' Summer (1965), which concentrated more on musical guests The Righteous Brothers and Gary Lewis & The Playboys than on Raquel's outstanding contributions. But 20th Century Fox certainly took notice and signed her up. With her very first film under contract (actually, she was on loan out to Britain's Hammer Studios at the time), she took on the remake of One Million B.C. (1940) in the Carole Landis role and the rest is history. Raquel remained an international celebrity in her first few years of stardom. In England, she was quite revealing as the deadly sin representing \"lust\" for the comedy team of Peter Cook and Dudley Moore in their vehicle Bedazzled (1967), and as the title secret agent in the sexy spy spoof Fathom (1967). In Italy, she gained some exposure in primarily mediocre vehicles opposite such heartthrobs as Marcello Mastroianni. Back in the U.S., however, she caused quite a stir in her ground-breaking sex scenes with black athlete Jim Brown in the \"spaghetti western\" 100 Rifles (1969), and as the transgendered title role in the unfathomable Myra Breckinridge (1970). Adapted from Gore Vidal novel, she created some unwelcome notoriety by locking horns with aging diva Mae West on the set. The instant cult movie was a laughingstock to all concerned and certainly didn't help Raquel's attempt at being taking seriously as an actress. Box office bombs abounded. Try as she might in such films as Kansas City Bomber (1972) and The Wild Party (1975), which drew some good reviews for her, her sexy typecast gave her little room to breathe. With determination, however, she partly offset this with modest supporting roles in larger ensemble pieces. She showed definite spark and won a Golden Globe for the swashbuckler The Three Musketeers (1973), and appeared to good advantage in the mystery thriller The Last of Sheila (1973). She planned on making a comeback in Cannery Row (1982), even agreeing to appear topless (which she had never done before), but was suddenly fired during production without notice. She sued MGM for breach of contract and ultimately won a $15 million settlement, but it didn't help her film career and only helped to label her as trouble on a set. TV movies became a positive milieu for Raquel as she developed sound vehicles for herself such as The Legend of Walks Far Woman (1982) and Right to Die (1987). She also found a lucrative avenue pitching beauty products in infomercials and developing exercise videos à la Jane Fonda. Raquel took advantage of her modest singing and dancing abilities by performing in splashy Las Vegas showrooms and starring in such plausible stage vehicles as \"Woman of the Year\" and \"Victor/Victoria.\" Still a dazzler broaching age 70, Raquel continues to show up here and there and still can turn heads. She has even spoofed her own diva image on occasion, most memorably on \"Seinfeld\". More recently she has co-starred in the Hispanic-oriented TV series American Family (2002) and in the short-lived comedy Welcome to the Captain (2008), and appeared in the movies Tortilla Soup (2001), Legally Blonde (2001) and Forget About It (2006). She is separated from her fourth husband Richard Palmer, who is 15 years her junior.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjYyMTEyNV5BMl5BanBnXkFtZTgwMjcxMjMyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000079","name":"Raquel Welch","idIMDB":"nm0000079"},"actorId":"nm0000079","character":"Mrs. Windham Vandermark","urlCharacter":"http://www.imdb.com/character/ch0007384","main":true}],"seasons":[],"idIMDB":"tt0250494","urlIMDB":"http://www.imdb.com/title/tt0250494","business":{"budget":{"money":"$18,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$20,377,426","country":"USA","day":"15","month":"07","year":"2001","remarks":"2,620 Screens"},{"money":"£1,453,148","country":"UK","day":"28","month":"10","year":"2001","remarks":"324 Screens"},{"money":"AUD 2,514,535","country":"Australia","day":"14","month":"10","year":"2001","remarks":"266 Screens"}],"gross":[{"money":"$95,001,351","country":"USA","day":"21","month":"10","year":"2001","remarks":""},{"money":"$94,496,786","country":"USA","day":"14","month":"10","year":"2001","remarks":""},{"money":"$93,933,331","country":"USA","day":"07","month":"10","year":"2001","remarks":""},{"money":"$93,261,138","country":"USA","day":"30","month":"09","year":"2001","remarks":""},{"money":"$92,127,850","country":"USA","day":"23","month":"09","year":"2001","remarks":""},{"money":"$90,600,793","country":"USA","day":"16","month":"09","year":"2001","remarks":""},{"money":"$89,632,204","country":"USA","day":"09","month":"09","year":"2001","remarks":""},{"money":"$88,552,416","country":"USA","day":"02","month":"09","year":"2001","remarks":""},{"money":"$86,179,945","country":"USA","day":"26","month":"08","year":"2001","remarks":""},{"money":"$83,345,846","country":"USA","day":"19","month":"08","year":"2001","remarks":""},{"money":"$78,696,785","country":"USA","day":"12","month":"08","year":"2001","remarks":""},{"money":"$71,358,267","country":"USA","day":"05","month":"08","year":"2001","remarks":""},{"money":"$59,843,094","country":"USA","day":"29","month":"07","year":"2001","remarks":""},{"money":"$43,488,647","country":"USA","day":"22","month":"07","year":"2001","remarks":""},{"money":"$20,377,426","country":"USA","day":"15","month":"07","year":"2001","remarks":""},{"money":"£6,016,447","country":"UK","day":"16","month":"12","year":"2001","remarks":""},{"money":"£5,950,005","country":"UK","day":"09","month":"12","year":"2001","remarks":""},{"money":"£5,848,779","country":"UK","day":"02","month":"12","year":"2001","remarks":""},{"money":"£5,566,536","country":"UK","day":"25","month":"11","year":"2001","remarks":""},{"money":"£4,971,252","country":"UK","day":"18","month":"11","year":"2001","remarks":""},{"money":"£4,149,638","country":"UK","day":"11","month":"11","year":"2001","remarks":""},{"money":"£3,085,013","country":"UK","day":"04","month":"11","year":"2001","remarks":""},{"money":"£1,453,148","country":"UK","day":"28","month":"10","year":"2001","remarks":""},{"money":"AUD 7,816,282","country":"Australia","day":"28","month":"10","year":"2001","remarks":""},{"money":"AUD 6,096,970","country":"Australia","day":"21","month":"10","year":"2001","remarks":""},{"money":"AUD 4,017,009","country":"Australia","day":"14","month":"10","year":"2001","remarks":""},{"money":"AUD 1,276,056","country":"Australia","day":"07","month":"10","year":"2001","remarks":""},{"money":"AUD 60,065","country":"Australia","day":"01","month":"10","year":"2001","remarks":""},{"money":"€2,112,078","country":"Spain","day":"15","month":"05","year":"2003","remarks":""},{"money":"€2,095,561","country":"Spain","day":"10","month":"08","year":"2002","remarks":""},{"money":"ESP 331,041,868","country":"Spain","day":"15","month":"02","year":"2002","remarks":""}],"weekendGross":[{"money":"$367,357","country":"USA","day":"21","month":"10","year":"2001","remarks":"711 Screens"},{"money":"$432,082","country":"USA","day":"14","month":"10","year":"2001","remarks":"836 Screens"},{"money":"$483,663","country":"USA","day":"07","month":"10","year":"2001","remarks":"836 Screens"},{"money":"$690,661","country":"USA","day":"30","month":"09","year":"2001","remarks":"1,057 Screens"},{"money":"$1,327,441","country":"USA","day":"23","month":"09","year":"2001","remarks":"1,304 Screens"},{"money":"$764,611","country":"USA","day":"16","month":"09","year":"2001","remarks":"655 Screens"},{"money":"$865,124","country":"USA","day":"09","month":"09","year":"2001","remarks":"766 Screens"},{"money":"$1,730,424","country":"USA","day":"02","month":"09","year":"2001","remarks":"878 Screens"},{"money":"$1,471,614","country":"USA","day":"26","month":"08","year":"2001","remarks":"1,204 Screens"},{"money":"$2,575,400","country":"USA","day":"19","month":"08","year":"2001","remarks":"1,770 Screens"},{"money":"$3,774,114","country":"USA","day":"12","month":"08","year":"2001","remarks":"2,031 Screens"},{"money":"$5,851,309","country":"USA","day":"05","month":"08","year":"2001","remarks":"2,536 Screens"},{"money":"$9,005,364","country":"USA","day":"29","month":"07","year":"2001","remarks":"2,725 Screens"},{"money":"$11,103,700","country":"USA","day":"22","month":"07","year":"2001","remarks":"2,695 Screens"},{"money":"$20,377,426","country":"USA","day":"15","month":"07","year":"2001","remarks":"2,620 Screens"},{"money":"£46,142","country":"UK","day":"16","month":"12","year":"2001","remarks":"97 Screens"},{"money":"£52,804","country":"UK","day":"09","month":"12","year":"2001","remarks":"143 Screens"},{"money":"£134,239","country":"UK","day":"02","month":"12","year":"2001","remarks":"217 Screens"},{"money":"£388,549","country":"UK","day":"25","month":"11","year":"2001","remarks":"287 Screens"},{"money":"£516,813","country":"UK","day":"18","month":"11","year":"2001","remarks":"326 Screens"},{"money":"£665,755","country":"UK","day":"11","month":"11","year":"2001","remarks":"330 Screens"},{"money":"£871,872","country":"UK","day":"04","month":"11","year":"2001","remarks":"325 Screens"},{"money":"£1,453,148","country":"UK","day":"28","month":"10","year":"2001","remarks":"324 Screens"},{"money":"AUD 1,240,291","country":"Australia","day":"28","month":"10","year":"2001","remarks":"256 Screens"},{"money":"AUD 1,428,256","country":"Australia","day":"21","month":"10","year":"2001","remarks":"270 Screens"},{"money":"AUD 2,514,535","country":"Australia","day":"14","month":"10","year":"2001","remarks":"266 Screens"},{"money":"AUD 1,215,450","country":"Australia","day":"07","month":"10","year":"2001","remarks":"157 Screens"},{"money":"AUD 53,166","country":"Australia","day":"01","month":"10","year":"2001","remarks":"67 Screens"}],"admissions":[{"money":"17,907,346","country":"USA","day":"31","month":"12","year":"2001","remarks":""},{"money":"9,432","country":"Argentina","day":"13","month":"11","year":"2001","remarks":""},{"money":"623,621","country":"Brazil","day":"06","month":"01","year":"2002","remarks":""},{"money":"600,069","country":"Brazil","day":"23","month":"12","year":"2001","remarks":""},{"money":"582,497","country":"Brazil","day":"16","month":"12","year":"2001","remarks":""},{"money":"539,721","country":"Brazil","day":"09","month":"12","year":"2001","remarks":""},{"money":"475,749","country":"Brazil","day":"02","month":"12","year":"2001","remarks":""},{"money":"395,109","country":"Brazil","day":"25","month":"11","year":"2001","remarks":""},{"money":"299,664","country":"Brazil","day":"18","month":"11","year":"2001","remarks":""},{"money":"108,182","country":"Brazil","day":"11","month":"11","year":"2001","remarks":"opening weekend"},{"money":"1,485,774","country":"Germany","day":"30","month":"12","year":"2001","remarks":""},{"money":"1,332,586","country":"Germany","day":"16","month":"12","year":"2001","remarks":""},{"money":"1,178,019","country":"Germany","day":"09","month":"12","year":"2001","remarks":""},{"money":"988,912","country":"Germany","day":"02","month":"12","year":"2001","remarks":""},{"money":"748,390","country":"Germany","day":"25","month":"11","year":"2001","remarks":""},{"money":"429,965","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""},{"money":"211,863","country":"Netherlands","day":"31","month":"12","year":"2001","remarks":""},{"money":"489,320","country":"Spain","day":"15","month":"05","year":"2003","remarks":""},{"money":"483,345","country":"Spain","day":"10","month":"08","year":"2002","remarks":""},{"money":"452,077","country":"Spain","day":"15","month":"02","year":"2002","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"10","year":"2000","remarks":null},{"money":null,"country":null,"day":"19","month":"12","year":"2000","remarks":null}],"copyrightHolder":"2001 Metro-Goldwyn-Mayer Pictures Inc."},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["DTS-Stereo","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Clairmont Cameras","Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["2,715 m (Spain)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.2","metascore":"59","filmingLocations":[{"location":"All Saint's Episcopal Church - 132 N. Euclid Avenue, Pasadena, California, USA"}],"rated":"PG-13","awards":[{"award":"Golden Globes, USA 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Comedy or Musical","names":[]},{"category":"Best Performance by an Actress in a Motion Picture - Comedy or Musical","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]}]}]},{"award":"BMI Film & TV Awards 2002","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Rolfe Kent","id":"nm0448843","role":null}]}]}]},{"award":"British Comedy Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated British Comedy Award","categories":[{"category":"Best Comedy Film","names":[]}]}]},{"award":"Casting Society of America, USA 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Comedy","names":[{"name":"Joseph Middleton","id":"nm0585523","role":null},{"name":"Michelle Morris","id":"nm0606813","role":null}]}]}]},{"award":"Costume Designers Guild Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated CDG Award","categories":[{"category":"Excellence in Contemporary Film","names":[{"name":"Sophie De Rakoff","id":"nm0136201","role":null}]}]}]},{"award":"Golden Schmoes Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Actress of the Year","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]}]}]},{"award":"Hollywood Makeup Artist and Hair Stylist Guild Awards 2002","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Makeup Artist and Hair Stylist Guild Award","categories":[{"category":"Best Contemporary Hair Styling - Feature","names":[{"name":"Joy Zapata","id":"nm0953185","role":null},{"name":"Linda Arnold","id":"nm0036536","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Female Movie Star","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]}]}]},{"award":"MTV Movie Awards 2002","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Best Comedic Performance","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]},{"category":"Best Line","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]},{"category":"Best Dressed","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]}]},{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Movie","names":[]},{"category":"Best Female Performance","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]}]}]},{"award":"Satellite Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Performance by an Actress in a Motion Picture, Comedy or Musical","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]},{"category":"Best Original Score","names":[{"name":"Rolfe Kent","id":"nm0448843","role":null}]}]}]},{"award":"Teen Choice Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Film - Choice Movie of the Summer","names":[]}]}]},{"award":"Young Artist Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature Film - Comedy","names":[]}]}]}],"votes":"139,990","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0093810","name":"Marc Platt Productions"}],"keywords":{"keywords":["blonde","law","sorority","harvard","law school","beauty salon","law student","professor","girl power","boy","girl","fraternity","bikini","blonde hair","color pink","pink","blonde girl","college student","teen comedy","chick flick","two word title","first part","blonde woman","roommate","reference to ricky martin","2000s","female protagonist","vegetarian","wolf whistle","harvard law school","reference to britney spears","black female judge","blonde stereotype","trust","smart blonde","sexual harassment","mistaken motive","intern","enlightenment","cultural conflict","client","broken engagement","ex boyfriend ex girlfriend relationship","teen movie","spa","shower","prison","aerobics","chihuahua","california","delivery man","murder","dog","what happened to epilogue","fish out of water","courtroom","manicurist","college","boston massachusetts","fashion","los angeles california","product placement","trial","lawyer","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:04:10"}}