{"data":{"movies":[{"title":"Babylon 5: The Legend of the Rangers: To Live and Die in Starlight","originalTitle":"","year":"2002","releaseDate":"20020119","directors":[{"name":"Michael Vejar","id":"nm0892144"}],"writers":[{"name":"J. Michael Straczynski","id":"nm0833089"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODk4Njc2NV5BMl5BanBnXkFtZTcwNTkwMjMzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"After being punished for retreat from combat, Ranger David Martel is given command of the Liandra, a haunted 20-year old Minbari fighting ship. He's escorting ambassadors to a secret archaeological site, the oldest city on record and a clue to a dangerous ancient race.","simplePlot":"A disgraced Ranger takes command of an old, possibly haunted, ship on an escort mission that encounters deadly peril from a new enemy civilization.","actors":[{"actorName":"Dylan Neal","urlProfile":"http://www.imdb.com/name/nm0623604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMDc2OTQ1N15BMl5BanBnXkFtZTgwMDA0NTU5OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1969","placeOfBirth":" Richmond Hill, Ontario, Canada","birthName":"Dylan J. Neal","height":"6' 2\" (1.88 m)","bio":"Dylan Neal was born in Richmond Hill, Ontario, Canada. Shortly thereafter, his family moved to Oakville, just west of Toronto, where he spent the remainder of his childhood. As a young student, he attended the prep school, Appleby College, where he was introduced to the game of squash. Dylan quickly fell in love with the sport and was soon playing for Canada at an international level. Toward the end of his teenage years, after many years of traveling across North America on the amateur squash circuit, Dylan decided a professional squash career was not for him. By that time, Dylan was attending Blakelock High School, where he was enrolled in the drama program. At the urging of his drama teacher, Dylan signed with a Toronto talent agent and began auditioning professionally. It didn't take long for Dylan to realize this was the direction his career would take. In 1992, Dylan moved to Los Angeles, where his career quickly took off. He lived in Los Angeles until 2006, when he and his family moved to Vancouver for production of the Lifetime television series 'Blood Ties'. In 2011, Dylan and his family returned to Los Angeles. Dylan Neal is a well-recognized face on television, having had series regular roles in eight American television series, including 'The Bold and the Beautiful', Aaron Spelling's 'Pacific Palisades', 'Hyperion Bay', and 'Blood Ties'. Dylan has had many major recurring roles, including his five-year stint on 'Dawson's Creek' playing Joshua Jackson's brother, Doug Witter, and as Aaron on 'Sabrina the Teenage Witch' opposite Melissa Joan Hart. He has had the good fortune of working with some of the biggest names in Hollywood and in 2012 was offered the male lead role of Jack Griffith opposite Andie MacDowell in the television series 'Cedar Cove'. The series is based on international best-selling author Debbie Macomber's series of books with the same name and premiered on the Hallmark Channel on July 20, 2013. Starting in 2014, Dylan began writing, executive producing and starring in a series of TV movies called The Gourmet Detective for The Hallmark Movies and Mysteries Channel. Dylan's career has allowed him to travel extensively for work, filming in such locations as Israel, Germany, China, the Caribbean, and throughout North America. In his downtime, Dylan enjoys spending as much time as he can with his family and friends. On occasion, he can also be spotted in his workshop, where, as an avid woodworker, he has for years re-created eighteenth- and nineteenth-century period furniture.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMDc2OTQ1N15BMl5BanBnXkFtZTgwMDA0NTU5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0623604","name":"Dylan Neal","idIMDB":"nm0623604"},"actorId":"nm0623604","character":"David Martell","urlCharacter":"http://www.imdb.com/character/ch0012579","main":true},{"actorName":"Andreas Katsulas","urlProfile":"http://www.imdb.com/name/nm0441537","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1946","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Andrew Constantine Katsulas","height":"6' (1.83 m)","bio":"Born in St. Louis, Missouri, Andreas from a working-class Greek-American family. Attracted from early childhood to being on stage when at 4 his mother took him to see a community theater performance, he took theatre as an extra-curricular activity in high school. He then majored in it at St. Louis University, where he worked his way through school doing things like waiting on tables. Next, after earning a drama fellowship, Katsulas received a Master's Degree in Theater Arts from one of the nation's top schools for the genre, Indiana University in Bloomington, Indiana. With never a doubt or hesitation, Andreas jumped right into the professional theater world, performing in plays in his native St. Louis with the Loretto-Hilton Repertory Theater. This was followed by work with the Theatre Company of Boston. After that, Katsulas moved to New York to some challenging off-off-Broadway theater at La Mama. This was followed by a fifteen-year heart and soul involvement with Peter Brook's International Theatre Company in Paris, performing around the world with a challenging combination of improvisational theater in every imaginable circumstance and space, and \"prepared\" theater pieces in traditional, as well as unconventional, theatrical spaces. Katsulas trod the boards from Lincoln Center in New York and The Kennedy Center in Washington, D.C., to the \"mean streets\" of Brooklyn and marketplaces in remote African Villages. There were performances from elite Theater Festivals in Iran, Avignon and Belgrade: in prisons & mental institutions; at rock quarries in Australia; on barrios in Venezuela; in sewage plants in Switzerland; winding through the streets of Venice, Italy; in the fields with farm workers in California, near the lakes of Minnesota with Native Americans, in sometimes extreme conditions like snow, rain, and intensive heat. During a hiatus from the stage, a part in Michael Cimino's The Sicilian (1987) brought Andreas to Los Angeles, after which he was immediately cast as Joey Venza in Ridley Scott's Someone to Watch Over Me (1987), then as Arthur, the chauffeur, in Blake Edwards's Sunset (1988). In early 2005, Andreas was diagnosed with inoperable lung cancer; he passed away a year later, in Los Angeles. He had lived there since 1986, and had hoped to return to working in the theater before his far-too-early death, just over three months shy of his 60th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441537","name":"Andreas Katsulas","idIMDB":"nm0441537"},"actorId":"nm0441537","character":"Citizen G'Kar","urlCharacter":"http://www.imdb.com/character/ch0012572","main":true},{"actorName":"Alex Zahara","urlProfile":"http://www.imdb.com/name/nm0951912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjAwMjY5M15BMl5BanBnXkFtZTcwNDU1NjI3OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Alex Zahara was born in Grande Prairie, Alberta, Canada. . Alex attended high school at the Grande Prairie Composite High School where he won a scholarship to college for his direction of the stage version of \"M*A*S*H\". He was inducted to the wall of honor at GPCH, where former alumni include Olympic Silver Medalist Willie DeWitt and World Skeleton Champion Michelle Skelly. He attended the University of Alberta and the University of British Columbia where he achieved a Bachelor of Fine Arts Degree in Theatre (Acting.) After graduation Alex started acting professionally with several award-winning plays, and got his first film role in The 13th Warrior (1999) with Antonio Banderas and Omar Sharif. Alex has been nominated for several acting awards, including three Jessie Richardson Awards (Vancouver Theatrical Awards), two for Best Actor, and winning for Best Ensemble. He was also nominated for Best Actor in The 2000 Leo Awards (British Columbia Film Awards.) His breakthrough role was his second television role ever, a guest-starring part on The Sentinel (1996) episode \"Night Shift\", playing Gabriel, a homeless man/angel. Alex has over 100 screen credits has appeared in numerous plays. Alex recently directed and co-produced his first short film, Not Indian Enough and Co-Produced the feature, Patterson's Wager, as well as having a lead role. Alex also recently played Butch Henley the lead antagonist in the feature film Lonesome Dove Church, with Tom Berenger. Alex has starred/co-starred in such shows as ABC's Once Upon A Time as King Midas, AMC's Hell On Wheels as Lt. Weston, (recurring) and can be seen as Doctor Renard in the upcoming feature film Horns starring Daniel Radcliff. The role Alex is most proud is of that of Karl Rademacher in The Outer Limits 100th episode Tribunal, (based on holocaust survivor Leo Egan's life) where Alex portrayed a Nazi officer at Auschwitz. A familiar face to sci-fi fans, Alex has also appeared as 8 different characters on Stargate SG-1, more than any other actor, most of them in full prosthetic makeup. Alex has also appeared in a number of science fiction films and TV shows including the Sci-Fi Network's mini series Riverworld where he portrayed real life Hindenberg engineer Ludwig Durr. Alex has received a Leo nomination for Best Actor in the short film Evirati and Jessie Richardson nominations for his work in the plays Mojo (winning Best Ensemble) and The Promised Land, lead Actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjAwMjY5M15BMl5BanBnXkFtZTcwNDU1NjI3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0951912","name":"Alex Zahara","idIMDB":"nm0951912"},"actorId":"nm0951912","character":"Dulann","urlCharacter":"http://www.imdb.com/character/ch0097770","main":true},{"actorName":"Myriam Sirois","urlProfile":"http://www.imdb.com/name/nm0802897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ2NzgyNjAxM15BMl5BanBnXkFtZTYwMjQ5MjEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1975","placeOfBirth":" Sept-Iles, Québec, Canada","bio":"Myriam Sirois was born on February 2, 1975 in Sept-Iles, Québec, Canada. She is an actress, known for Ranma ½ (1989), Ranma ½: Nettô-hen (1989) and Babylon 5: The Legend of the Rangers: To Live and Die in Starlight (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ2NzgyNjAxM15BMl5BanBnXkFtZTYwMjQ5MjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0802897","name":"Myriam Sirois","idIMDB":"nm0802897"},"actorId":"nm0802897","character":"Sarah Cantrell","urlCharacter":"http://www.imdb.com/character/ch0012590","main":true},{"actorName":"Dean Marshall","urlProfile":"http://www.imdb.com/name/nm0550832","urlPhoto":"","biography":{"dateOfBirth":"9 October 1969","placeOfBirth":" Montreal, Quebec, Canada","birthName":"Dean Stewart Marshall","bio":"Dean Marshall was born on October 9, 1969 in Montreal, Quebec, Canada as Dean Stewart Marshall. He is an actor, known for 2012 (2009), Tommy Boy (1995) and Babylon 5: The Legend of the Rangers: To Live and Die in Starlight (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0550832","name":"Dean Marshall","idIMDB":"nm0550832"},"actorId":"nm0550832","character":"Malcolm Bridges","urlCharacter":"http://www.imdb.com/character/ch0012591","main":true},{"actorName":"Warren Takeuchi","urlProfile":"http://www.imdb.com/name/nm0847619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgzODI4OTQwMl5BMl5BanBnXkFtZTgwMjc5MzIzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Warren Takeuchi was born in Toronto, Ontario, Canada. He is known for his work on Godzilla (2014), The 6th Day (2000) and Lake Placid (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgzODI4OTQwMl5BMl5BanBnXkFtZTgwMjc5MzIzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0847619","name":"Warren Takeuchi","idIMDB":"nm0847619"},"actorId":"nm0847619","character":"Kitaro Sasaki","urlCharacter":"http://www.imdb.com/character/ch0097771","main":true},{"actorName":"Jennie Rebecca Hogan","urlProfile":"http://www.imdb.com/name/nm0969326","urlPhoto":"","biography":{"dateOfBirth":"1971","placeOfBirth":"","bio":"Jennie Rebecca Hogan was born in 1971. She is an actress, known for Babylon 5: The Legend of the Rangers: To Live and Die in Starlight (2002), The Overcoat (2001) and Andromeda (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0969326","name":"Jennie Rebecca Hogan","idIMDB":"nm0969326"},"actorId":"nm0969326","character":"Na'Feel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mackenzie Gray","urlProfile":"http://www.imdb.com/name/nm0336797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjIyM2JjMjUtOTExOC00N2Q2LTljMmQtNzZjNjZiODY1MzhjL2ltYWdlXkEyXkFqcGdeQXVyMTk2Mjc4MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1957","placeOfBirth":" Toronto, Canada","birthName":"Alexander Mackenzie Gray","height":"6' (1.83 m)","bio":"Mackenzie Gray was born and raised in Toronto. A professional actor for over 40 years, he has appeared in over 150 films and television shows. As of 2017, he is a series regular on the Marvel/FX Series Legion (2017) playing \"The Eye\" and is a recurring cast member on both the CW series Riverdale (2017) as \"The Pathologist\" and plays \"The Time Master\" on DC's Legends of Tomorrow (2016). Since moving to Vancouver in 1998 as a series lead for the television series The Net (1998), he has appeared as a guest star in scores of Vancouver or Calgary-filmed productions, recently including the BBC America/Netflix series Dirk Gently's Holistic Detective Agency (2016), Fargo (2014), R.L. Stine's The Haunting Hour (2010), Alcatraz (2012), and Project Mc² (2015). He returned to Toronto to Guest-Star in the series Bitten (2014). Guest-Starring roles include \"John Amos\" in Les enfants du péché: secrets de famille (2015), \"David Bowie\" in Some Assembly Required (2014), \"Lex Luthor\" in Season 10 of Smallville (2001), \"The Djiin\" in Supernatural (2005), \"The Observer\" in the series finale of Fringe (2008), as the Devil, in the form of Keith Richards, in R.L. Stine's The Haunting Hour (2010), as a Southern U.S. Senator opposed to Civil Rights in the mini-series Les Kennedy (2011) and as a Graphic Novelist with a dark secret again in R.L. Stine's The Haunting Hour (2010). Other Guest-Star or Lead roles include work on the TV series Human Target (2010), Young Blades (2005), Da Vinci's Inquest (1998), The Collector (2004), First Wave (1998), Aux frontières de l'étrange (1999), Once Upon a Time (2011), True Justice (2010), The Bridge (2010), Sanctuary (2008), Psych (2006), Kyle XY (2006), The L Word (2004), Romeo! (2003), La treizième dimension (2002), Babylon 5: The Legend of the Rangers: To Live and Die in Starlight (2002), Big Sound (2000), Andromeda (2000), Cold Squad, brigade spéciale (1998), Voyage of the Unicorn (2001) and Welcome to Paradox (1998). Mackenzie was recently seen on the big screen in Warcraft: The Beginning (2016), and was celebrated around the world for his portrayal of \"Jax-Ur\" in Warner Brothers' Zack Snyder-directed Superman film Man of Steel (2013). He appeared as the band's Road Manager in Metallica's 3-D IMAX Feature Metallica Through the Never (2013) and appeared in Terry Gilliam's The Imaginarium of Doctor Parnassus (2009). Other feature film work includes co-starring roles in Grave Encounters (2011), Shooter (2007), Storm Seekers (2009), Riddles of the Sphinx (2008), Danger en altitude (2007), Joy Ride 2: Dead Ahead (2008), Strip Search (1997), Christmas on Chestnut Street (2006), 2103: The Deadly Wake (1997), La chute des héros (2003), The Hitcher II: I've Been Waiting (2003), Falling Fire (1997), In Her Mother's Footsteps (2006), Hard Ride to Hell (2010), Shepherd (1998), Fugitives Run (2005), Replikator (1994) and The Long Kiss Goodnight (1996). He co-produced and acted in the upcoming feature film Heart of Clay (2017), and the award-winning feature film Poe: Last Days of the Raven (2008). Mackenzie has written, produced and directed 7 short films. His Crazy 8's Film Noir short Under the Bridge of Fear (2013) screened at Cannes Court Métrage at The Cannes Film Festival, the Vancouver International Film Festival, the Whistler Film Festival and was broadcast by the CBC. It was nominated for 10 LEO Awards, winning one. Mackenzie has been nominated for many awards and is a 16-time Leo Award \"Best Actor\" nominee. He composed and recorded the theme songs and score for the films Graceland and My Mind's Eye and is composing the songs for the upcoming feature Earthlickers. Mackenzie also works extensively as a \"voice\" performer. He is the voice of \"Obadiah Stane\" in Marvel Comics' series Iron Man: Armored Adventures (2008), \"Gramorr\" in LoliRock (2014), and has recurring roles on the animated TV series Tetsujin, Stargate: Infinity (2002), Action Man (2000), Madeline, Evolution and NASCAR Racers (1999). He has also recorded several lead roles in animated feature films. Notable among these are \"Long John Silver\" in Treasure Island, \"Professor Henry\" in Madeline: My Fair Madeline (2002) and the dual lead roles of \"Doctor Nightingale\" and \"Adrian Rourke\" in Groove Squad (2002). Other animated work includes Tony Hawk, Ben Hur (2003) (with Charlton Heston) and Ark (2005), Master Keaton (1998), Sherlock Holmes in the 22nd Century (1999), Lost Continent, Mary-Kate and Ashley in Action! (2001) and Journey to the Center of the Earth. He has created many voices for Video Games, is the lead in the new Black Orchid XBox Game and several characters in the latest edition of Dawn of War. Mackenzie has worked on stage in Canada, Britain and in the United States in hundreds of plays, musicals and cabarets. He was recently seen onstage as \"Steve\" in the Pulitzer Prize-winning 'August: Osage County' at The Stanley Theatre in Vancouver. Recently, he played several roles in the Tom Waits/William S. Burroughs award-winning hit rock opera 'The Black Rider', in Toronto and Vancouver. He has played lead roles in many plays, including 'Bloody Poetry', 'The Rocky Horror Show', 'Jacob Two-Two Meets the Hooded Fang', 'Boxing Shakespeare', 'Playing With Fire', 'The Threepenny Opera', 'Danton's Death' and Videocabaret's multiple-award-winning plays 'The Great War' and 'The Life and Times of Mackenzie King'. Shakespearean work includes lead roles in 'Much Ado About Nothing', 'Macbeth', 'The Winter's Tale', 'Troilus and Cressida', and 'Romeo and Juliet'. Mackenzie wrote, scored and directed the play/musical 'Math Out Loud' which will tour across Canada this year. He has directed at The Stratford Festival and the Canadian Stage Company, wrote and directed the Ballet/Opera 'The Snow Maiden' at The Royal Alexandra Theatre, produced the award-winning hit play 'Unidentified Human Remains and the True Nature of Love' in Toronto and has directed and produced over 25 plays. He is a former board member and Director of the Performers Branch of the Academy of Canadian Cinema and Television. Mackenzie is a 16-time Leo Award \"Best Actor\" nominee, a 2-time Dora Award nominee, recently winning two Leo Awards for his work on the TV series Spooksville (2013) and Bitten (2014) and has won or been nominated for many awards in his various disciplines.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjIyM2JjMjUtOTExOC00N2Q2LTljMmQtNzZjNjZiODY1MzhjL2ltYWdlXkEyXkFqcGdeQXVyMTk2Mjc4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0336797","name":"Mackenzie Gray","idIMDB":"nm0336797"},"actorId":"nm0336797","character":"Minister Kafta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Storch","urlProfile":"http://www.imdb.com/name/nm0832409","urlPhoto":"","biography":{"bio":"David Storch is an actor and director, known for Edison: The Wizard of Light (1998), Babylon 5: The Legend of the Rangers: To Live and Die in Starlight (2002) and Troubled Waters (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0832409","name":"David Storch","idIMDB":"nm0832409"},"actorId":"nm0832409","character":"Tafeek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Enid-Raye Adams","urlProfile":"http://www.imdb.com/name/nm0010956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NDI1MjQ1OV5BMl5BanBnXkFtZTgwNDU2Nzk1NDE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1973","placeOfBirth":" Portage la Prairie, Manitoba, Canada","height":"5' 4\" (1.63 m)","bio":"Enid-Raye Adams was born in 1973 in Portage la Prairie, Manitoba. Since then, no one has ever pronounced her name correctly. Kids at school called her Igor and Enid The Peenid. (Those kids were ill-mannered and had gastric intestinal problems.) After two perms in a row in junior high, Enid-Raye bore a striking resemblance to Napoleon Dynamite (2004) from the major motion picture of the same name. Years later, Enid-Raye began her career in theater, performing in some of Shakespeare's classics. In 1993, she made her film debut as a feature extra in the Canadian independent For the Moment (1993) opposite Russell Crowe. Her only requirement in the film was to tap Russell Crowe's shoulder in a party scene and smile at him. This was meant to launch her career in film and television and cement her as a leading lady in the minds of directors and studio executives everywhere. Unfortunately, due to a severe case of nerves, Enid-Raye looked like a rabid gopher on camera and her part was cut from the film. In 1998, she moved to Vancouver to pursue her career and couldn't get arrested. If she jaywalked in front of the cops, they would say, \"I'm sorry, we've decided to go another way,\" or \"Jaywalk for us again when you have an agent.\" It was during this time that she co-wrote and performed in the hilarious one-woman show \"Would You Like Fries With That?\". She began and promptly finished doing stand-up comedy when she discovered she was much funnier in the privacy of her own home. Finally, she threatened to egg an agent's '87 Dodge Dart if he didn't sign her. Remarkably, he did and she has been working ever since. Enid-Raye was a host for The 16th Annual Leo Awards (2014) and has received two Leo Award nominations for her work: One for her chilling portrayal of the psychotic and highly disturbed Laura Maitland, a recurring character in the acclaimed series Da Vinci's Inquest (1998) for Chris Haddock; And the second for her role as a Mom suffering from depression in R.L. Stine's The Haunting Hour (2010), opposite Rico Rodriguez (Modern Family (2009)). Other select credits include No Men Beyond This Point (2015), iZombie (2015), Backstrom (2015), Lawrence & Holloman (2013), Endgame (2011), Fringe (2008), Psych (2006), Supernatural (2005), Intelligence (2005), Dead Like Me (2003), Jeremiah (2002), and Steven Spielberg's Taken (2002). She can next be seen on her sofa watching Kevin Spacey in House of Cards (2013). Enid-Raye works regularly in film, television, voice and commercials. She lives in Vancouver where she can be found loitering in front of Lee's Donuts in her chocolate milk mustache and buffet pants.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NDI1MjQ1OV5BMl5BanBnXkFtZTgwNDU2Nzk1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0010956","name":"Enid-Raye Adams","idIMDB":"nm0010956"},"actorId":"nm0010956","character":"Firell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gus Lynch","urlProfile":"http://www.imdb.com/name/nm0528311","urlPhoto":"","biography":{"dateOfBirth":"2 October 1972","placeOfBirth":"","birthName":"Jason Michael Gustine","bio":"Gus Lynch was born on October 2, 1972 as Jason Michael Gustine. He was an actor, known for Willard (2003), I Spy (2002) and Halloween: Resurrection (2002). He was married to Amanda Thompson. He died on December 1, 2014 in Coba, Quintana Roo, Mexico.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0528311","name":"Gus Lynch","idIMDB":"nm0528311"},"actorId":"nm0528311","character":"Tirk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Sandomirsky","urlProfile":"http://www.imdb.com/name/nm0762063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTY4ZDRiNDEtMjdjMi00YmEwLWI5OGYtOWRkZTI3NDdjMDMyL2ltYWdlXkEyXkFqcGdeQXVyNjgzMTk0MDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Todd Sandomirsky is known for his work on The Tracey Fragments (2007), Babylon 5: The Legend of the Rangers: To Live and Die in Starlight (2002) and Henry's Cafe (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTY4ZDRiNDEtMjdjMi00YmEwLWI5OGYtOWRkZTI3NDdjMDMyL2ltYWdlXkEyXkFqcGdeQXVyNjgzMTk0MDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0762063","name":"Todd Sandomirsky","idIMDB":"nm0762063"},"actorId":"nm0762063","character":"Tannier","urlCharacter":"http://www.imdb.com/character/ch0219133","main":true},{"actorName":"Andrew Kavadas","urlProfile":"http://www.imdb.com/name/nm0442515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDQ5MTgxNV5BMl5BanBnXkFtZTgwNzQ1MDgwOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Andrew Kavadas is an actor, known for Underworld: Evolution (2006), Les accusés (1988) and The 13th Warrior (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDQ5MTgxNV5BMl5BanBnXkFtZTgwNzQ1MDgwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0442515","name":"Andrew Kavadas","idIMDB":"nm0442515"},"actorId":"nm0442515","character":"Captain Bart Gregg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Simon Egan","urlProfile":"http://www.imdb.com/name/nm1000179","urlPhoto":"","biography":{"bio":"Simon Egan is an actor, known for Babylon 5: The Legend of the Rangers: To Live and Die in Starlight (2002), Stargate SG-1 (1997) and The Chris Isaak Show (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1000179","name":"Simon Egan","idIMDB":"nm1000179"},"actorId":"nm1000179","character":"Minbari Crewman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernard Cuffling","urlProfile":"http://www.imdb.com/name/nm0191259","urlPhoto":"","biography":{"bio":"Bernard Cuffling is an actor, known for Hector et la recherche du bonheur (2014), Fido (2006) and Double Jeopardy (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0191259","name":"Bernard Cuffling","idIMDB":"nm0191259"},"actorId":"nm0191259","character":"Sindell","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0280453","urlIMDB":"http://www.imdb.com/title/tt0280453","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.1","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"NOT RATED","awards":[],"votes":"3,062","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0039264","name":"Babylonian Productions"},{"idCompany":"co0076715","name":"Legendary Films Inc."},{"idCompany":"co0024368","name":"Sci-Fi Channel, The"}],"keywords":{"keywords":["ranger","space","based on cult tv series","space opera","23rd century","digit in title","antonyms in title","alien invasion","warrior","tv series pilot","starship","spacecraft","space battle","court martial","cgi","made for cable tv","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:29:47"}}