{"data":{"movies":[{"title":"Repli-Kate","originalTitle":"","year":"2002","releaseDate":"20020129","directors":[{"name":"Frank Longo","id":"nm0519419"}],"writers":[{"name":"Stuart Gibbs","id":"nm0316736"},{"name":"Stuart Gibbs","id":"nm0316736"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTY5NzcxN15BMl5BanBnXkFtZTYwNDYxNDk5._V1.jpg","countries":["Germany","USA"],"languages":["English"],"genres":["Comedy","Sci-Fi"],"plot":"A teenage scientist/lab technician named Max Fleming has just met the woman of his dreams -- beautiful, smart and sexy magazine reporter Kate Carson, who is trying to gain some scientific information from Max for an article she's working on about the lab where Max works. Unfortunately, a science geek like Max isn't Kate's type. One day, during an experiment, Max accidentally clones Kate. With the help of his buddy, Henry, Max takes advantage of the situation and transforms his Repli-Kate into a more mature and masculine-centered type of person -- a perfect mate. But when Max's maniacal boss, Dr. Jonas, has the real Kate return to finish her story on the genetic lab, Max is thrilled. Soon, Max realizes that the real Kate represents true perfection and love rather than the over-the-top Repli-Kate. Soon, the real Kate begins to fall for Max too, until she discovers Max's little secret.","simplePlot":"A scientist and his sidekick accidentally clone a journalist and decide to turn the mistake into Repli-Kate, their idea of the perfect woman, who loves, beer, football, and frat parties.","actors":[{"actorName":"Ali Landry","urlProfile":"http://www.imdb.com/name/nm0005118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE0MTg2NTAwNl5BMl5BanBnXkFtZTgwMjk2NzYwNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1973","placeOfBirth":" Breaux Bridge, Louisiana, USA","birthName":"Ali Germaine Landry","height":"5' 8\" (1.73 m)","bio":"Ali Landry broke onto the scene and gained instant fame as \"the Doritos Girl\", when she was featured in a commercial for Frito Lay during the 1998 Super Bowl telecast. The next day, the NY Post hailed in a cover story \"A star was born during Superbowl XXXII\". Later that year, she was named one of People Magazine's \"50 Most Beautiful\". Following the success of the commercial campaign, Ali, who was crowned Miss USA 1996, made the transition from modeling to acting with a variety of film and television roles. Most recently, she co-starred in the feature film Bella (2006), which won the Toronto Film Festival Award in 2006, in addition to three seasons on the hit UPN Network series Eve (2003). Other television appearances included recurring roles on Felicity (1998), Two Guys, a Girl and a Pizza Place (1998), Sunset Beach (1997) and Popular (1999). Her hosting credits have included the weekly music-talk show Farmclub.com (2001), Cooking with Mom (2003) and Full Frontal Fashion (2002) on WE: Women's Entertainment, and NBC's Spy TV (2001). Plus, Ali was an MTV staple in the summer of 1999, appearing in the popular video for 98 Degrees' single, \"I Do\". In feature films, she co-starred in Beautiful (2000), directed by Sally Field, in 2000. A trained dancer in jazz, tap and ballet for 15 years, Landry hails from Beaux Bridge, Louisiana. She also enjoys kickboxing and gymnastics. Ali currently lives in Los Angeles with her husband, director Alejandro Monteverde, and their daughter, Estela.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE0MTg2NTAwNl5BMl5BanBnXkFtZTgwMjk2NzYwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005118","name":"Ali Landry","nicknames":["The Doritos Girl"],"idIMDB":"nm0005118"},"actorId":"nm0005118","character":"Kate / Repli-Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Roday","urlProfile":"http://www.imdb.com/name/nm0734442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODI0OTUwOF5BMl5BanBnXkFtZTgwNDYyNDkyNjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1976","placeOfBirth":" San Antonio, Texas, USA","birthName":"James David Rodriguez","height":"5' 9\" (1.75 m)","bio":"James David Rodríguez was born on April 4, 1976. He is the son of Jim Rodríguez, who worked for Boardwalk Auto Group. Roday was born in San Antonio. He attended Taft High School. He studied theater at New York University's Experimental Theatre Wing, where he earned a bachelor's degree in fine arts. He has acted in several theatrical productions, which include \"The Three Sisters,\" \"Twelfth Night,\" \"A Respectable Wedding,\" and \"Severity's Mistress.\" He starred in the film Rolling Kansas (2003) and appeared in the 2005 film The Dukes of Hazzard (2005) as Billy Prickett, and in the 2006 film Beerfest (2006). Roday and writing partners Todd Harthan and James DeMonaco wrote the screenplay for the film Skinwalkers (2006). Roday's portrayal of Shawn Spencer on the television series Psych (2006) launched him into the public spotlight, and gave rise to numerous fan clubs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODI0OTUwOF5BMl5BanBnXkFtZTgwNDYyNDkyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0734442","name":"James Roday","idIMDB":"nm0734442"},"actorId":"nm0734442","character":"Max","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Desmond Askew","urlProfile":"http://www.imdb.com/name/nm0004718","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUwMTI2Mzc2OF5BMl5BanBnXkFtZTgwNjc4MTk5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1972","placeOfBirth":" London, England, UK","height":"5' 9\" (1.75 m)","bio":"Desmond Askew was born on December 17, 1972 in London, England. He is an actor, known for Go (1999), Roswell (1999) and The Hills Have Eyes (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUwMTI2Mzc2OF5BMl5BanBnXkFtZTgwNjc4MTk5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004718","name":"Desmond Askew","idIMDB":"nm0004718"},"actorId":"nm0004718","character":"Henry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugene Levy","urlProfile":"http://www.imdb.com/name/nm0506405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTQ5NjA3Ml5BMl5BanBnXkFtZTYwMDgwMjQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1946","placeOfBirth":" Hamilton, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Eugene Levy is an award-winning actor, writer, and producer. He has appeared in more than 60 motion pictures to date, eight of which having topped the $100M mark. The box office success of films such as Bringing Down The House, Cheaper By the Dozen 2, and Father Of The Bride Part II have established him as one of Hollywood's most popular comedic actors. But it was the role of Noah Levenstein in the American Pie franchise that cemented his reputation as America's favorite Dad. Levy's most recent big-screen role was that of Dory's Dad in the Disney/Pixar smash Finding Dory, in which he stars alongside Ellen DeGeneres and Diane Keaton. The film has surpassed the $1B mark worldwide, and is on track to become one of the highest-grossing animated films of all time. Partnering with Christopher Guest, Levy earned critical acclaim for co-writing and co-starring in Best In Show, Waiting For Guffman, For Your Consideration, and A Mighty Wind. Levy has been nominated for and won countless awards for his films including a New York Film Critics Circle Award and a Grammy Award® for A Mighty Wind and a Golden Globe® nomination for Best In Show. Other films include Splash, Armed and Dangerous, Multiplicity, Club Paradise, and Serendipity. In 2013, Levy formed Not A Real Company Productions (with his son Daniel Levy and principals Andrew Barnsley and Fred Levy) to produce Schitt's Creek, a television series for CBC/ITV he co-created, co-executive produces, and co-stars in with Daniel Levy. The single-cam, character-driven comedy also stars Catherine O'Hara, Annie Murphy, and Chris Elliott. In 2016, Levy won Lead Actor in a Comedy at the Canadian Screen Awards and, as Executive Producer, the CSA for Best Comedy, an award he shared with Daniel Levy, among others. Schitt's Creek swept the Canadian Screen Awards, winning nine of a possible 10 categories. Levy also received the prestigious Legacy Award (along with co-star and long-time collaborator, Catherine O'Hara) from the Academy of Canadian Cinema & Television. Levy won two Emmys® for his writing on SCTV in addition to many other awards and nominations for his television work. Levy is a Member of the Order of Canada and a recipient of The Governor General's Performing Arts Award - the foremost honour presented for excellence in the performing arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTQ5NjA3Ml5BMl5BanBnXkFtZTYwMDgwMjQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0506405","name":"Eugene Levy","nicknames":["Butch","Gene"],"idIMDB":"nm0506405"},"actorId":"nm0506405","character":"Jonas Fromer / Repli-Jonas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Robert Anderson","urlProfile":"http://www.imdb.com/name/nm0027522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTkzNzUwMF5BMl5BanBnXkFtZTcwNDQ3Mzg0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Todd Robert Anderson is a writer and director, known for Film Pigs (2012), Fuzz Track City (2012) and Repli-Kate (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTkzNzUwMF5BMl5BanBnXkFtZTcwNDQ3Mzg0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0027522","name":"Todd Robert Anderson","idIMDB":"nm0027522"},"actorId":"nm0027522","character":"Felix","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Alosio","urlProfile":"http://www.imdb.com/name/nm0022323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWIzNWQxNWMtYTQzMC00ZTBjLWE2MjQtZWJkYjc3ZmJiNmM0XkEyXkFqcGdeQXVyMDk0Mzg5NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1973","placeOfBirth":" Long Beach, California, USA","height":"6' 2\" (1.88 m)","bio":"Ryan Alosio is an actor and visual artist who holds dual citizenship in both Ireland and the U.S. The son of an Irish mother and an Italian father, Alosio spent 9 years in various boarding schools, including 3 in military academy. He graduated with honors from the Interlochen Arts Academy. Alosio also attended Northwestern University in Chicago, studying film and journalism and New York University where he majored in dramatic writing in the Tisch School of the Arts. Alosio has appeared in over 33 television shows and 23 films. He has worked with such noted actors as Hugh Laurie, Patrick Dempsey, John Hawks, Laura Dern, Gary Sinise, Jason Alexander and Elijah Wood. Alosio received the Austin Film Festival's 'Favorite New Actor' award for his leading role in 'The Hi-Line' which was also selected for, and premiered to much acclaim in the main competition at the Sundance Film Festival and many others. Originally theatre trained, Alosio has appeared in several stage productions including such classics as A Midsummer Night's Dream, Waiting For Godot, The Crucible and Chicago. Alosio has produced numerous short film projects and is a published writer and gallery shown and sold painter and photographer. His work has also been published in such noted publications as the Rizzoli International Press book, Modern Americana, Modern Magazine, The New York Times Magazine and Marie Claire. Alosio was the lead singer/song-writer of the alt-rock band, 'blackradio' which performed in such venues as The Viper Room, The Hard Rock and The Los Angeles Music Awards. He enjoys a lifelong passion of designing and custom building vintage motorcycles and American muscle cars. Alosio resides in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWIzNWQxNWMtYTQzMC00ZTBjLWE2MjQtZWJkYjc3ZmJiNmM0XkEyXkFqcGdeQXVyMDk0Mzg5NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0022323","name":"Ryan Alosio","idIMDB":"nm0022323"},"actorId":"nm0022323","character":"Derek Waters","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kurt Fuller","urlProfile":"http://www.imdb.com/name/nm0298281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzk1NzA3Ml5BMl5BanBnXkFtZTcwOTcwODU1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1953","placeOfBirth":" San Francisco, California, USA","height":"6' 3\" (1.91 m)","bio":"Kurt Fuller is best known for his work in the films Wayne's World (1992) with Mike Myers, Anger Management (2003), with Jack Nicholson and Adam Sandler, and most recently as part of the all star cast of Woody Allen's Midnight in Paris (2011). Kurt was born in San Francisco and raised in the agricultural heartland of California's San Joaquin Valley. He became passionate about acting while attending UC Berkley, where he received a degree in English literature. After graduating, Kurt made the move to Los Angeles with everything he owned stuffed into the back of a 1967 Dodge Dart (including a king size foam rubber mattress). For the next ten years he was a Realtor by day and a stage actor by night. Then, in 1986, he created the leading role of \"Frank\" in Steven Berkoff's explosively successful Kvetch, earning rave reviews on both coasts. Kurt has worked with Hollywood's best directors, including David O. Russell, Shawn Levy, Paul Schrader, Tony Scott, Wim Wenders, Taylor Hackford, Mike Newell, Harold Ramis, Brian De Palma and Ivan Reitman. His numerous film credits include Auto Focus (2002), Ray (2004), Pushing Tin (1999), The Jack Bull, Scary Movie (2000), Ghostbusters II (1989), Mr. Woodcock (2007), Nailed and _The Pursuit of Happyness_ (2006). This Fall Kurt will appear as \"Michael\", opposite Jane Kaczmarek, in Fox's new comedy _\"Us and Them\"_. His most recent series was the ABC's 2011 comedy, Better With You. He also had series regular roles ABC's Big Day, in which he starred with Wendie Malick, and That's My Bush! (2001), the television series from South Park (1997) & \"The Book of Mormon\" creators Trey Parker and Matt Stone. He has recurred and guest starred on over a hundred TV shows and telefilms over the years. Over the last year, Kurt has had recurring characters on many hit series including Parenthood, The Good Wife, Scandal and Psych (playing the lovable coroner Woody). In the past, Kurt has had arcs on, Supernatural, Desperate Housewives, Boston Legal, and Alias. His other TV appearances include HBO's Live From Baghdad, with Michael Keaton, as well as hit shows such as Glee, _\"Ugly Betty\"_ (2006), CSI, Men of a Certain Age, Grey's Anatomy, House, My Name is Earl, Monk, and Drop Dead Diva. Kurt still returns to the stage occasionally, his most recent theater work was The Cosmonaut's Last Message at the La Jolla Playhouse, and the highly acclaimed The Waiting Room at the Mark Taper Forum. Kurt has been married to wife Jessica Hendra, a recently published author, since 1994. They have two children; Julia and Charlotte.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzk1NzA3Ml5BMl5BanBnXkFtZTcwOTcwODU1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298281","name":"Kurt Fuller","idIMDB":"nm0298281"},"actorId":"nm0298281","character":"President Chumley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aimee Allen","urlProfile":"http://www.imdb.com/name/nm0020241","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Aimee Allen yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0020241","name":"Aimee Allen","idIMDB":"nm0020241"},"actorId":"nm0020241","character":"Wendy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amandah Reyne","urlProfile":"http://www.imdb.com/name/nm0721546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTI1NzQwOF5BMl5BanBnXkFtZTcwMTY5ODIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Amanda Cochrane","bio":"Started out modeling and dancing on the London stage. Worked as a behind the scenes reporter in London and then as a weather girl in Hong Kong. Grew up in London. Favorite movies are The Party, Love Actually, Grease, Closer and Educating Rita. Her father Jack is her mentor. Currently living in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTI1NzQwOF5BMl5BanBnXkFtZTcwMTY5ODIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721546","name":"Amandah Reyne","idIMDB":"nm0721546"},"actorId":"nm0721546","character":"Lili","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melissa Greenspan","urlProfile":"http://www.imdb.com/name/nm0339188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MjczMzE4MV5BMl5BanBnXkFtZTgwNzc2NDAzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' (1.52 m)","bio":"Melissa Greenspan is an actress and producer, known for The Wild Thornberrys Movie (2002), Repli-Kate (2002) and How to Beat Your Sister-in-Law (at everything) (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MjczMzE4MV5BMl5BanBnXkFtZTgwNzc2NDAzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339188","name":"Melissa Greenspan","idIMDB":"nm0339188"},"actorId":"nm0339188","character":"Brandi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Shilton","urlProfile":"http://www.imdb.com/name/nm0793526","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA1ZTQ2ODQtNWRiMi00MmFjLWI4ZWMtZjQ4MGVjZThhOGQ1L2ltYWdlXkEyXkFqcGdeQXVyNTkzNzk4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1976","placeOfBirth":" Los Angeles, California, USA","birthName":"Justin Ari Shilton","bio":"Justin Shilton was born on May 12, 1976 in Los Angeles, California, USA as Justin Ari Shilton. He is an actor and writer, known for Little Miss Sunshine (2006), Aviator (2004) and Repli-Kate (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA1ZTQ2ODQtNWRiMi00MmFjLWI4ZWMtZjQ4MGVjZThhOGQ1L2ltYWdlXkEyXkFqcGdeQXVyNTkzNzk4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0793526","name":"Justin Shilton","idIMDB":"nm0793526"},"actorId":"nm0793526","character":"Freshman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ned Brower","urlProfile":"http://www.imdb.com/name/nm1101478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM5ODI3NTA3Ml5BMl5BanBnXkFtZTcwOTc3MjQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1978","placeOfBirth":" Chapel Hill, North Carolina, USA","birthName":"Ned Andrew Brower","bio":"Ned Brower was born on December 15, 1978 in Chapel Hill, North Carolina, USA as Ned Andrew Brower. He is an actor and director, known for Not Another Teen Movie (2001), Big Fat Liar (2002) and Repli-Kate (2002). He has been married to Sarah Jane Morris since February 19, 2005. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM5ODI3NTA3Ml5BMl5BanBnXkFtZTcwOTc3MjQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1101478","name":"Ned Brower","idIMDB":"nm1101478"},"actorId":"nm1101478","character":"Stoner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kent Davis","urlProfile":"http://www.imdb.com/name/nm1395486","urlPhoto":"","biography":{"bio":"Kent Davis is an actor, known for Repli-Kate (2002), Angel (1999) and The Nanny (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1395486","name":"Kent Davis","idIMDB":"nm1395486"},"actorId":"nm1395486","character":"E.R. Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emilio Borelli","urlProfile":"http://www.imdb.com/name/nm0096322","urlPhoto":"","biography":{"bio":"Emilio Borelli is an actor, known for Smart House (1999), Repli-Kate (2002) and Stuart Bliss (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0096322","name":"Emilio Borelli","idIMDB":"nm0096322"},"actorId":"nm0096322","character":"Giovanni Bellini","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Clark","urlProfile":"http://www.imdb.com/name/nm1392510","urlPhoto":"","biography":{"bio":"David Clark is an actor, known for We're Back! A Dinosaur's Story (1993), Repli-Kate (2002) and Mobile Suit Gundam I (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1392510","name":"David Clark","idIMDB":"nm1392510"},"actorId":"nm1392510","character":"Bartender","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0260320","urlIMDB":"http://www.imdb.com/title/tt0260320","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"ITL 600,000","country":"Italy","day":"06","month":"06","year":"2002","remarks":""},{"money":"PHP 90,000","country":"Philippines","day":"11","month":"12","year":"2002","remarks":""},{"money":"$1,368,619","country":"Spain","day":"16","month":"09","year":"2002","remarks":""},{"money":"€1,268,584","country":"Spain","day":"31","month":"08","year":"2002","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2002/\">2002</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)","2 hr 1 min (121 min) (Argentina)","1 hr 31 min (91 min) (Spain)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.7","filmingLocations":[{"location":"Glendale Galleria, Glendale, California, USA"}],"rated":"R","awards":[],"votes":"4,552","type":"Movie","companyCreditsSimple":[{"idCompany":"co0069136","name":"Helkon Media"},{"idCompany":"co0100462","name":"Zide-Perry Productions"},{"idCompany":"co0113121","name":"Silver Nitrate Pictures"}],"keywords":{"keywords":["clone","experiment","perfect woman","journalist","spitting","monkey","laboratory","hamster","fitting room","female nudity","dog","clothing store","business presentation","burping","actress playing multiple roles","actress playing male role","actor playing multiple roles","national lampoon series","fellatio","cloning","blow job","sex","lingerie","oral sex","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:28:25"}}