{"data":{"movies":[{"title":"The Banger Sisters","originalTitle":"","year":"2002","releaseDate":"20020920","directors":[{"name":"Bob Dolman","id":"nm0231190"}],"writers":[{"name":"Bob Dolman","id":"nm0231190"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjA1OTQxNGEtNTRjNi00MWIwLWEyZGYtNGRjOGEwNzE5OWU2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"In West Hollywood, Suzette, now on the far side of middle age, has always been a party girl, leading a life solely for the here and now. When the here and now leads to her without a job, no money and thus no sense of whether her partying life has gotten her anywhere, she decides to go into her distant past to visit in Phoenix an old friend, Vinnie, who she has not seen or talked to in twenty years. In their shared past, Suzette and Vinnie were Los Angeles groupies coined the Banger Sisters for their penchant to sleep with any and all rock musicians who came through Southern California. Suzette does know however that Vinnie's life has changed, she married to Raymond, a lawyer who has political aspirations, the two who have two teenaged daughters. It is in part the reason she decides to visit now well off Vinnie, to see if she will lend her some money. Suzette reconsiders when she finds out just how far Vinnie has changed. She now goes by her full given name Lavinia, and is not only the...","simplePlot":"Lavinia and Suzette, former rock groupies and best friends, reconnect after twenty years; one is still as wild as ever, while the other has adopted a more conservative lifestyle.","actors":[{"actorName":"Goldie Hawn","urlProfile":"http://www.imdb.com/name/nm0000443","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDUzNzc4Ml5BMl5BanBnXkFtZTYwMzkyMDE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1945","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 6\" (1.68 m)","bio":"Goldie Jeanne Hawn was born in Washington D.C., to Laura Hawn (née Steinhoff), a jewelry shop/dance school owner, and Rut Hawn, a band musician. She has a sister, Patti Hawn, and a brother, Edward, who died in infancy before her birth. She was raised in the Jewish religion. Her mother was Jewish and the daughter of Hungarian immigrants. Her father was Presbyterian, and had German and English ancestry. At the age of three, Goldie began taking ballet and tap dance lessons and, at the age of ten, she danced in the chorus of the Ballet Russe de Monte Carlo production of \"The Nutcracker\". At the age of 19, she ran and instructed a ballet school, having dropped out of college, where she was majoring in drama. Before going into the film business, she worked as a professional dancer. Hawn had her feature film debut in The One and Only, Genuine, Original Family Band (1968), with a small role as a giggling dancer. Her first major role came in 1969, where she played opposite Walter Matthau and Ingrid Bergman in Cactus Flower (1969), a role which earned her an Academy Award for Best Supporting Actress. After her Academy Award win, her career took off and she followed with roles in successful comedies such as There's a Girl in My Soup (1970) and Shampoo (1975), and more dramatic roles in Butterflies Are Free (1972), The Girl from Petrovka (1974) and The Sugarland Express (1974). In 1978, she starred alongside Chevy Chase in the box office hit, Foul Play (1978). In 1980, she starred in another box office hit, Private Benjamin (1980), where she also served as producer. During the 1980s, she starred in movies such as Best Friends (1982), Swing Shift (1984), and Wildcats (1986). In 1987, she appeared with her boyfriend, Kurt Russell, in Overboard (1987), which became both a critical and box office disappointment. Her career slowed down after that until 1990, when she starred alongside Mel Gibson in Bird on a Wire (1990). In 1992, she starred in the successful film, Death Becomes Her (1992), with Meryl Streep and Bruce Willis, which was followed by another successful film, HouseSitter (1992), which co-starred Steve Martin. In 1996, she played the role of an aging alcoholic actress in the comedy, The First Wives Club (1996), with Diane Keaton and Bette Midler; it became a critical and financial success. She also starred in the Woody Allen film, Everyone Says I Love You (1996) and The Out-of-Towners (1999), which reunited her with Steve Martin. In 2001 and 2002, she starred in Town & Country (2001) with Warren Beatty, and The Banger Sisters (2002) with Susan Sarandon. Goldie has been married twice. First to actor/director Gus Trikonis, from 1968 to 1973. In 1975, she married musician Bill Hudson and became a mother, for the first time, in 1976, when she gave birth to their son, Oliver Hudson. In 1979, she had her second child with Hudson, daughter Kate Hudson. The marriage ended in divorce in 1980. Since 1983, she has been in a relationship with actor Kurt Russell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDUzNzc4Ml5BMl5BanBnXkFtZTYwMzkyMDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000443","name":"Goldie Hawn","nicknames":["Go-Go"],"idIMDB":"nm0000443"},"actorId":"nm0000443","character":"Suzette","urlCharacter":"http://www.imdb.com/character/ch0021456","main":true},{"actorName":"Susan Sarandon","urlProfile":"http://www.imdb.com/name/nm0000215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODMzMDUzNF5BMl5BanBnXkFtZTcwNzY4NzQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1946","placeOfBirth":" New York City, New York, USA","birthName":"Susan Abigail Tomalin","height":"5' 7\" (1.7 m)","bio":"Susan Sarandon was born Susan Abigail Tomalin in New York City, New York, to Lenora Marie (Criscione) and Phillip Leslie Tomalin, a television producer and advertising executive. She is of Italian (mother) and English, Irish, Welsh, and German (father) descent. Soon after the 1968 Democratic convention, there was a casting call for a film with several roles for the kind of young people who had disrupted the convention. Two recent graduates of Catholic University in Washington DC, went to the audition in New York for Joe (1970). Chris Sarandon, who had studied to be an actor, was passed over. His wife Susan got a major role. That role was as Susan Compton, the daughter of ad executive Bill Compton (Dennis Patrick). In the movie Dad Bill kills Susan's drug dealer boyfriend and next befriends Joe (Peter Boyle)-- a bigot who works on an assembly line and who collects guns. Five years later, Sarandon made the film where fans of cult classics have come to know her as \"Janet\", who gets entangled with transvestite \"Dr. Frank 'n' Furter\" in The Rocky Horror Picture Show (1975). More than 15 years after beginning her career Sarandon at last actively campaigned for a great role, Annie in Bull Durham (1988), flying at her own expense from Rome to Los Angeles. \"It was such a wonderful script ... and did away with a lot of myths and challenged the American definition of success\", she said. \"When I got there, I spent some time with Kevin Costner, kissed some ass at the studio and got back on a plane\". Her romance with the Bull Durham (1988) supporting actor, Tim Robbins, had produced two sons by 1992 and put Sarandon in the position of leaving her domestic paradise only to accept roles that really challenged her. The result was four Academy Award nominations in the 1990s and best actress for Dead Man Walking (1995). Her first Academy Award nomination was for Louis Malle's Atlantic City (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODMzMDUzNF5BMl5BanBnXkFtZTcwNzY4NzQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000215","name":"Susan Sarandon","idIMDB":"nm0000215"},"actorId":"nm0000215","character":"Lavinia Kingsley","urlCharacter":"http://www.imdb.com/character/ch0021454","main":true},{"actorName":"Geoffrey Rush","urlProfile":"http://www.imdb.com/name/nm0001691","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjkxNDU0NV5BMl5BanBnXkFtZTcwOTk3MDQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1951","placeOfBirth":" Toowoomba, Queensland, Australia","birthName":"Geoffrey Roy Rush","height":"5' 11½\" (1.82 m)","bio":"Geoffrey Roy Rush was born on July 6, 1951, in Toowoomba, Queensland, Australia, to Merle (Bischof), a department store sales assistant, and Roy Baden Rush, an accountant for the Royal Australian Air Force. His mother was of German descent and his father had English, Irish, and Scottish ancestry. He was raised in Brisbane, Queensland, after his parents split up. Rush attended Everton Park State High School during his formative years. His early interest in the theatre led to his 1971 stage debut at age 20 in \"Wrong Side of the Moon\" with the Queensland Theatre Company. Known for his classical repertory work over the years, he scored an unexpected hit with his Queensland role as Snoopy in the musical \"You're a Good Man, Charlie Brown\". A few years later he moved to France to study but subsequently returned to his homeland within a short time and continued work as both actor and director with the Queensland company (\"June and the Paycock,\" \"Aladdin,\" \"Godspell,\" \"Present Laughter,\" \"The Rivals\"). In the 1980s Rush became a vital member of the State Theatre Company of South Australia and showed an equally strong range there in such productions as \"Revenger's Tragedy,\" \"A Midsummer Night's Dream,\" \"Mother Courage...and Her Children,\" \"Blood Wedding,\" \"Pal Joey,\" \"Twelfth Night\" and as The Fool in \"King Lear\". Rush made an inauspicious debut in films with the feature Hoodwink (1981), having little more than a bit part, and didn't carry off his first major role until playing Sir Andrew Aguecheek in a movie production of Twelfth Night (1987). Yet, he remained a durable presence on stage with acclaimed productions in \"The Diary of a Madman\" in 1989 and \"The Government Inspector\" in 1991. Rush suffered a temporary nervous breakdown in 1992 due to overwork and anguish over his lack of career advancement. Resting for a time, he eventually returned to the stage. Within a few years film-goers finally began taking notice of Geoffrey after his performance in Children of the Revolution (1996). This led to THE role of a lifetime as the highly dysfunctional piano prodigy David Helfgott in Shine (1996). Rush's astonishing tour-de-force performance won him every conceivable award imaginable, including the Oscar, Golden Globe, British Film Award and Australian Film Institute Award. \"Shine\" not only put Rush on the international film map, but atypically on the Hollywood \"A\" list as well. His rather homely mug was made fascinating by a completely charming, confident and captivating demeanor; better yet, it allowed him to more easily dissolve into a number of transfixing historical portrayals, notably his Walsingham in Elizabeth (1998), Marquis de Sade in Quills (2000), and Leon Trotsky in Frida (2002). He's also allowed himself to have a bit of hammy fun in such box office escapism as Mystery Men (1999), House on Haunted Hill (1999), The Banger Sisters (2002), Finding Nemo (2003) and Pirates of the Caribbean: The Curse of the Black Pearl (2003). More than validating his early film success, two more Oscar nominations came his way in the same year for Quills (2000) (best actor) and Shakespeare in Love (1998) (support actor) in 2000. Geoffrey's amazing versatility continues to impress, more recently as the manic, volatile comedy genius Peter Sellers in the biopic The Life and Death of Peter Sellers (2004). Rush's intermittent returns to the stage have included productions of \"Marat-Sade,\" \"Uncle Vanya,\" \"Oleanna,\" \"Hamlet\" and \"The Small Poppies\". In 2009 he made his Broadway debut in \"Exit the King\" co-starring Susan Sarandon. His marriage (since 1988) to Aussie classical actress Jane Menelaus produced daughter Angelica (1992) and son James (1995). Menelaus, who has also performed with the State Theatre of South Australia, has co-starred on stage with Rush in \"The Winter's Tale\" (1987), \"Troilus and Cressida\" (1989) and \"The Importance of Being Earnest\" (as Gwendolyn to his Jack Worthing). She also had a featured role in his film Quills (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjkxNDU0NV5BMl5BanBnXkFtZTcwOTk3MDQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001691","name":"Geoffrey Rush","idIMDB":"nm0001691"},"actorId":"nm0001691","character":"Harry Plummer","urlCharacter":"http://www.imdb.com/character/ch0021455","main":true},{"actorName":"Erika Christensen","urlProfile":"http://www.imdb.com/name/nm0159776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Njk4MTM0NV5BMl5BanBnXkFtZTcwMjI3NDUwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1982","placeOfBirth":" Seattle, Washington, USA","birthName":"Erika Jane Christensen","height":"5' 5\" (1.65 m)","bio":"Erika Jane Christensen was born in 1982 in Seattle, Washington, to Kathy (Hendricks), a construction manager, and Steven Christensen, a human resources executive and insurance worker. She was raised in the suburban outskirts of Los Angeles, California. At age 12, Erika knew that she was going to be an actress. Talented in acting, singing and dance, the young Christensen was determined, not just lucky; it wasn't long before she landed her first job: a commercial for national advertising giant, McDonalds. She followed up with a part in Michael Jackson's music video for \"Childhood,\" then landed her big break: a lead role in Disney's Leave It to Beaver (1997). Christensen was only 13 years old, but acclaimed by critics for her \"chemistry\" and \"radiant self-assurance.\" Guest spots on television followed. Christensen popped up everywhere including prime time heavy hitters like Frasier (1993), Nothing Sacred (1997), The Practice (1997), 3rd Rock from the Sun (1996) and Touched by an Angel (1994). Erika received a nomination by the Hollywood Reporter for the 1998 Young Star Award (Best Performance By A Young Actress in a TV Drama Series) for her outstanding performance in Nothing Sacred (1997). Erika also kept her big screen presence known, in 1999 she worked on a Disney made-for-tv movie called Can of Worms (1999). And in 2000 Erika was able to show the world her acting chops when she took the gritty role of Caroline Wakefield, a teenage daughter of the White House Drug Czar who is herself a drug addict, in the award-winning Steven Soderbergh film, Traffic (2000). Aside from the distinction of playing alongside Hollywood's elite, Erika earned critical acclaim for the realism of the role, and received multiple awards including Female Breakthrough Performance at the MTV Movie Awards, Female Standout Performance at the Young Hollywood Awards, and Outstanding Performance by a Cast Ensemble at the Screen Actors Guild Awards. Erika is of Norwegian (from her paternal grandmother), Danish, English, German, Scottish, Welsh, and Irish descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Njk4MTM0NV5BMl5BanBnXkFtZTcwMjI3NDUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0159776","name":"Erika Christensen","idIMDB":"nm0159776"},"actorId":"nm0159776","character":"Hannah Kingsley","urlCharacter":"http://www.imdb.com/character/ch0021457","main":true},{"actorName":"Robin Thomas","urlProfile":"http://www.imdb.com/name/nm0859450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDE2NjgwN15BMl5BanBnXkFtZTgwNDg0OTQwMTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1949","placeOfBirth":" Pittsfield, Massachusetts, USA","birthName":"Robin Thomas Grossman","height":"5' 11\" (1.8 m)","bio":"Robin Thomas was born on February 12, 1949 in Pittsfield, Massachusetts, USA as Robin Thomas Grossman. He is known for his work on Pacific Rim (2013), Summer School (1987) and The Banger Sisters (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDE2NjgwN15BMl5BanBnXkFtZTgwNDg0OTQwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859450","name":"Robin Thomas","idIMDB":"nm0859450"},"actorId":"nm0859450","character":"Raymond Kingsley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eva Amurri Martino","urlProfile":"http://www.imdb.com/name/nm0025483","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY3NTk3NTc3OV5BMl5BanBnXkFtZTcwNDc4NjMwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1985","placeOfBirth":" New York City, New York, USA","birthName":"Eva Maria Livia Amurri","height":"5' 9\" (1.75 m)","bio":"Eva Amurri Martino was born on March 15, 1985 in New York City, New York, USA as Eva Maria Livia Amurri. She is known for her work on Saved! (2004), The Life Before Her Eyes (2007) and Dead Man Walking (1995). She has been married to Kyle Martino since October 29, 2011. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY3NTk3NTc3OV5BMl5BanBnXkFtZTcwNDc4NjMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0025483","name":"Eva Amurri Martino","idIMDB":"nm0025483"},"actorId":"nm0025483","character":"Ginger Kingsley","urlCharacter":"http://www.imdb.com/character/ch0021458","main":true},{"actorName":"Matthew Carey","urlProfile":"http://www.imdb.com/name/nm0137001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzM1MjMwMF5BMl5BanBnXkFtZTcwNTY0NjgzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1980","placeOfBirth":" Denver, Colorado, USA","height":"5' 9½\" (1.77 m)","bio":"Matthew Carey was born on April 6, 1980 in Denver, Colorado, USA. He is an actor and writer, known for Old School (2003), The Banger Sisters (2002) and Sound of My Voice (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzM1MjMwMF5BMl5BanBnXkFtZTcwNTY0NjgzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0137001","name":"Matthew Carey","idIMDB":"nm0137001"},"actorId":"nm0137001","character":"Jules","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andre Ware","urlProfile":"http://www.imdb.com/name/nm0912107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1Nzk1MDgyNl5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"August1965","placeOfBirth":" Kalamazoo, Michigan, USA","height":"6' 4\" (1.93 m)","bio":"Andre Ware was born in August 1965 in Kalamazoo, Michigan, USA. He is an actor, known for Die Hard with a Vengeance (1995), The Banger Sisters (2002) and Ultimate Avengers (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1Nzk1MDgyNl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912107","name":"Andre Ware","idIMDB":"nm0912107"},"actorId":"nm0912107","character":"Jake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Tomei","urlProfile":"http://www.imdb.com/name/nm0866608","urlPhoto":"","biography":{"dateOfBirth":"24 October 1967","placeOfBirth":" New York City, New York, USA","birthName":"Adam Jeffrey Tomei","bio":"Adam Tomei was born on October 24, 1967 in New York City, New York, USA as Adam Jeffrey Tomei. He is an actor and producer, known for Flight (2012), The Truman Show (1998) and Independence Day (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0866608","name":"Adam Tomei","idIMDB":"nm0866608"},"actorId":"nm0866608","character":"Club Owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sal Lopez","urlProfile":"http://www.imdb.com/name/nm0520199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4ODk1NTMxNV5BMl5BanBnXkFtZTgwNTM4MDgxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1954","placeOfBirth":"","height":"5' 7\" (1.7 m)","bio":"Sal Lopez was born on November 8, 1954. He is known for his work on Full Metal Jacket (1987), Port Charles (1997) and American Me (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4ODk1NTMxNV5BMl5BanBnXkFtZTgwNTM4MDgxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0520199","name":"Sal Lopez","idIMDB":"nm0520199"},"actorId":"nm0520199","character":"Pump Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kohl Sudduth","urlProfile":"http://www.imdb.com/name/nm0837173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMjg0NjU0OV5BMl5BanBnXkFtZTcwNzQ3OTQ0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1974","placeOfBirth":" Granada Hills, California, USA","birthName":"Walter Kohl Sudduth","bio":"Kohl Sudduth was born on August 8, 1974, in Granada Hills, California, and grew up in Circleville, Ohio. He earned a B.A. in English at Ohio University before moving to New York City at age 21 to pursue an acting career. After gaining experience in a handful of films, he landed a supporting role in Bowfinger (1999) starring Steve Martin and Eddie Murphy. He then went on to play a series regular in Darren Star's critically acclaimed Grosse Pointe (2000). Brother of Third Watch (1999) star Skipp Sudduth, he has appeared regularly on stage in New York, including Richard Greenberg's multiple Tony Award-winning \"Take Me Out\" and \"The Last Days of Judas Iscariot\" starring Sam Rockwell and directed by Philip Seymour Hoffman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMjg0NjU0OV5BMl5BanBnXkFtZTcwNzQ3OTQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0837173","name":"Kohl Sudduth","idIMDB":"nm0837173"},"actorId":"nm0837173","character":"Hotel Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tinsley Grimes","urlProfile":"http://www.imdb.com/name/nm0342249","urlPhoto":"","biography":{"dateOfBirth":"9 May 1984","placeOfBirth":" USA","height":"5' 4\" (1.63 m)","bio":"Tinsley Grimes was born on May 9, 1984 in the USA. She is an actress, known for The Banger Sisters (2002), Never Been Kissed (1999) and That '80s Show (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0342249","name":"Tinsley Grimes","idIMDB":"nm0342249"},"actorId":"nm0342249","character":"Prom Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Krask","urlProfile":"http://www.imdb.com/name/nm1249600","urlPhoto":"","biography":{"bio":"Larry Krask is an actor and assistant director, known for Adaptation. (2002), The Banger Sisters (2002) and Something Came Over Them (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1249600","name":"Larry Krask","idIMDB":"nm1249600"},"actorId":"nm1249600","character":"Man in Bar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marlayna Cherisse","urlProfile":"http://www.imdb.com/name/nm1248240","urlPhoto":"","biography":{"bio":"Marlayna Cherisse is known for her work on The Darkest Hour (2011), Her (2013) and Aaah! Zombies!! (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1248240","name":"Marlayna Cherisse","idIMDB":"nm1248240"},"actorId":"nm1248240","character":"Young Groupie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Todd","urlProfile":"http://www.imdb.com/name/nm0865205","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjgxNzAwMl5BMl5BanBnXkFtZTcwNTkwMDAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1971","placeOfBirth":" Los Angeles, California, USA","birthName":"Joshua Todd Gruber","bio":"Josh Todd was born on April 4, 1971 in Los Angeles, California, USA as Joshua Todd Gruber. He is an actor, known for The Town (2010), Disturbia (2007) and The Banger Sisters (2002). He is married to Mitzi Martin. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjgxNzAwMl5BMl5BanBnXkFtZTcwNTkwMDAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865205","name":"Josh Todd","idIMDB":"nm0865205"},"actorId":"nm0865205","character":"L.A. Buckcherry Band Member","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0280460","urlIMDB":"http://www.imdb.com/title/tt0280460","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,037,846","country":"USA","day":"22","month":"09","year":"2002","remarks":"2,738 Screens"},{"money":"£201,731","country":"UK","day":"02","month":"02","year":"2003","remarks":"181 Screens"},{"money":"€28,476","country":"Italy","day":"04","month":"05","year":"2003","remarks":"24 Screens"},{"money":"€331,444","country":"Spain","day":"02","month":"02","year":"2003","remarks":"152 Screens"}],"gross":[{"money":"$30,307,416","country":"USA","day":"26","month":"12","year":"2002","remarks":""},{"money":"$30,306,281","country":"USA","day":"22","month":"12","year":"2002","remarks":""},{"money":"$30,299,413","country":"USA","day":"15","month":"12","year":"2002","remarks":""},{"money":"$30,284,041","country":"USA","day":"08","month":"12","year":"2002","remarks":""},{"money":"$30,252,477","country":"USA","day":"01","month":"12","year":"2002","remarks":""},{"money":"$30,194,326","country":"USA","day":"24","month":"11","year":"2002","remarks":""},{"money":"$30,096,492","country":"USA","day":"17","month":"11","year":"2002","remarks":""},{"money":"$29,917,216","country":"USA","day":"10","month":"11","year":"2002","remarks":""},{"money":"$29,676,430","country":"USA","day":"03","month":"11","year":"2002","remarks":""},{"money":"$29,365,177","country":"USA","day":"27","month":"10","year":"2002","remarks":""},{"money":"$28,720,875","country":"USA","day":"20","month":"10","year":"2002","remarks":""},{"money":"$27,278,374","country":"USA","day":"13","month":"10","year":"2002","remarks":""},{"money":"$24,299,294","country":"USA","day":"06","month":"10","year":"2002","remarks":""},{"money":"$18,821,609","country":"USA","day":"29","month":"09","year":"2002","remarks":""},{"money":"$10,037,846","country":"USA","day":"22","month":"09","year":"2002","remarks":""},{"money":"£201,731","country":"UK","day":"02","month":"02","year":"2003","remarks":""},{"money":"€58,161","country":"Italy","day":"18","month":"05","year":"2003","remarks":""},{"money":"€28,476","country":"Italy","day":"04","month":"05","year":"2003","remarks":""},{"money":"€639,499","country":"Spain","day":"09","month":"02","year":"2003","remarks":""},{"money":"€331,444","country":"Spain","day":"02","month":"02","year":"2003","remarks":""}],"weekendGross":[{"money":"$1,575","country":"USA","day":"22","month":"12","year":"2002","remarks":"5 Screens"},{"money":"$10,439","country":"USA","day":"15","month":"12","year":"2002","remarks":"31 Screens"},{"money":"$16,427","country":"USA","day":"08","month":"12","year":"2002","remarks":"39 Screens"},{"money":"$28,458","country":"USA","day":"01","month":"12","year":"2002","remarks":"84 Screens"},{"money":"$58,291","country":"USA","day":"24","month":"11","year":"2002","remarks":"136 Screens"},{"money":"$111,112","country":"USA","day":"17","month":"11","year":"2002","remarks":"178 Screens"},{"money":"$168,988","country":"USA","day":"10","month":"11","year":"2002","remarks":"261 Screens"},{"money":"$172,000","country":"USA","day":"03","month":"11","year":"2002","remarks":"247 Screens"},{"money":"$351,333","country":"USA","day":"27","month":"10","year":"2002","remarks":"471 Screens"},{"money":"$749,526","country":"USA","day":"20","month":"10","year":"2002","remarks":"841 Screens"},{"money":"$1,692,519","country":"USA","day":"13","month":"10","year":"2002","remarks":"1,596 Screens"},{"money":"$3,484,958","country":"USA","day":"06","month":"10","year":"2002","remarks":"2,532 Screens"},{"money":"$5,426,857","country":"USA","day":"29","month":"09","year":"2002","remarks":"2,738 Screens"},{"money":"$10,037,846","country":"USA","day":"22","month":"09","year":"2002","remarks":"2,738 Screens"},{"money":"£201,731","country":"UK","day":"02","month":"02","year":"2003","remarks":"181 Screens"},{"money":"€3,361","country":"Italy","day":"18","month":"05","year":"2003","remarks":"6 Screens"},{"money":"€212,410","country":"Spain","day":"09","month":"02","year":"2003","remarks":"152 Screens"},{"money":"€331,444","country":"Spain","day":"02","month":"02","year":"2003","remarks":"152 Screens"}],"admissions":[{"money":"96,773","country":"France","day":"11","month":"02","year":"2003","remarks":""},{"money":"69,529","country":"France","day":"04","month":"02","year":"2003","remarks":""},{"money":"34,475","country":"Germany","day":"09","month":"02","year":"2003","remarks":""},{"money":"132,500","country":"Spain","day":"09","month":"02","year":"2003","remarks":""},{"money":"67,013","country":"Spain","day":"02","month":"02","year":"2003","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"03","year":"2001","remarks":null},null],"copyrightHolder":"Twentieth Century Fox Film Corporation, 2002 (on print)"},"technical":{"runtime":["1 hr 38 min (98 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Gold II, Panavision E-Series Lenses","Panavision Panaflex X, Panavision E-Series Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision 200T 5274, Vision 500T 5279)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm","Digital (Texas Instruments DLP 1280 x 1024, 1.9 : 1 anamorphic)"]},"rating":"5.6","metascore":"48","filmingLocations":[{"location":"Chatsworth, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 2003","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Motion Picture - Comedy or Musical","names":[{"name":"Goldie Hawn","id":"nm0000443","role":null}]}]}]},{"award":"Young Artist Awards 2003","titlesAwards":[{"titleAwardOutcome":"Won Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actress","names":[{"name":"Eva Amurri Martino","id":"nm0025483","role":null}]}]}]}],"votes":"12,730","type":"Movie","companyCreditsSimple":[{"idCompany":"co0028932","name":"Fox Searchlight Pictures"},{"idCompany":"co0177687","name":"Gran Via"},{"idCompany":"co0021490","name":"Elizabeth Cantillon Productions"}],"keywords":{"keywords":["lawyer","bartender","writer","road trip","groupie","gun","sex in a swimming pool","female protagonist","drug abuse","memory","kitchen","former best friend","dance","bathtub","bathroom","rock star","real life mother and daughter playing mother and daughter","parenthood","odd couple","novel","midlife crisis","female bonding","affection","typewriter","tour bus","tattoo","swearing","sister sister relationship","mother daughter relationship","hotel clerk","gas station","father son relationship","family dinner","dead father","cigarette smoking","candle","arrogance","photograph","hospital","fired from the job","driving test","dancing","bar","cemetery","friendship","phoenix arizona","graduation","class differences","nightclub","valedictorian","makeover","swimming","male nudity","premarital sex","basement","prom","los angeles california","drug overdose","secret past","amateur pornography","hotel","breast enlargement","truck stop","reference to led zeppelin","department of motor vehicles","reference to jim morrison","teen angst","female nudity","photography","marriage","talk to the dead","soccer mom","shady history","rock music","redhead","red wine","muse","mosh pit","leather pants","joint","hand job","dishwashing","dark past","collection","beige clothing","cannabis","high school","gunfire","liberal turned conservative","oral sex"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:12:06"}}