{"data":{"movies":[{"title":"Scooby-Doo's Creepiest Capers","originalTitle":"","year":"2001","releaseDate":"20011204","writers":[],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MjMxNTY3NF5BMl5BanBnXkFtZTcwMTY4NDcxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Comedy","Mystery"],"plot":"This features: Go Away Ghost Ship, Hassle in the Castle, The Haunted House Hang-Up and A Night of Fright Is No Delight","simplePlot":"This features: Go Away Ghost Ship, Hassle in the Castle, The Haunted House Hang-Up and A Night of Fright Is No Delight","actors":[{"actorName":"Nicole Jaffe","urlProfile":"http://www.imdb.com/name/nm0415476","urlPhoto":"","biography":{"dateOfBirth":"23 May 1941","placeOfBirth":" Montreal, Quebec, Canada","bio":"Jaffe's career was mainly based on doing voice-over work. She is best remembered as the voice of the nerdy-and-intelectual Velma Dinkley in the Scooby-Doo cartoons from 1969-1973; before actress Pat Stevens picked up the role. After the demise of the last Scooby cartoon The New Scooby-Doo Movies (1972) (in 1973), Jaffe got married and left Hanna-Barbera Studios, only to become a agent for actors/actresses at William Morris Agency - a year later; in 1974. Since 1974, Jaffe (now going by Nichole David) is still an agent, and at the same company. Some of Jaffe's other movie roles include Betty Smith, the girl who was seductively trying to land Elvis Presley in The Trouble with Girls (1969) and as the hippie girl in the dune-buggy in Disney's The Love Bug (1968).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0415476","name":"Nicole Jaffe","idIMDB":"nm0415476"},"actorId":"nm0415476","character":"Velma","urlCharacter":"http://www.imdb.com/character/ch0000505","main":true},{"actorName":"Casey Kasem","urlProfile":"http://www.imdb.com/name/nm0440487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2MzQ3OTcyOF5BMl5BanBnXkFtZTYwMzQ4NDMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1932","placeOfBirth":" Detroit, Michigan, USA","birthName":"Kemal Amen Kasem","height":"5' 6\" (1.68 m)","bio":"Casey Kasem was born on April 27, 1932 in Detroit, Michigan, USA as Kemal Amen Kasem. He was an actor, known for Ghostbusters (1984), La bataille des planètes (1978) and What's New, Scooby-Doo? (2002). He was married to Jean Kasem and Linda Myers. He died on June 15, 2014 in Gig Harbor, Washington, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2MzQ3OTcyOF5BMl5BanBnXkFtZTYwMzQ4NDMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0440487","name":"Casey Kasem","idIMDB":"nm0440487"},"actorId":"nm0440487","character":"Shaggy","urlCharacter":"http://www.imdb.com/character/ch0000527","main":true},{"actorName":"Don Messick","urlProfile":"http://www.imdb.com/name/nm0582106","urlPhoto":"","biography":{"dateOfBirth":"7 September 1926","placeOfBirth":" Buffalo, New York, USA","bio":"Don Messick is a legendary voice actor who spent his entire adult-hood in entertainment. He started out wanting to be a ventriloquist. Thankfully for cartoon lovers that career didn't pan out. How do you think his potential career would've stacked up against Edgar Bergen and later, Paul Winchell? No matter, Messick made his way to the hallowed halls of MGM in the early '50s on the recommendation of another voice actor, Daws Butler. At the time, MGM/Tex Avery were doing the theatrical \"Droopy\" cartoons. Bill Thompson, known for his hilarious voices on the radio show 'Fibber McGee and Molly', borrowed his Wallace Wimple voice and applied it to Droopy. Whenever Thompson couldn't make it to a session, MGM would ask Daws Butler to fill-in. Daws had been working for MGM since the mid '40s. Later, Daws apparently grew tired of the role and suggested Don Messick be Bill Thompson's fill-in. Butler, it's been said, literally squeezed his cheeks together to try and get that sound for Droopy while Messick simply thickened his tongue and loosened his jaws. Messick made the rounds and did every voice-over role large and small in this era. In 1957 Hanna-Barbera started their own company after departing from MGM...Daws Butler and Don Messick were the two voice actors the animation titans employed during the early days. Don was always heard as the \"second banana\" character or a walk-on. At various times he was the villain. His voice was heard as the 'narrator' on all of the early Hanna-Barbera cartoons. On \"Ruff and Reddy\", the duo's first made-for-TV cartoon series, Don was heard as \"Ruff\" the cat and as the Droopy-sounding \"Professor Gizmo\". Messick was also the narrator who interracted with the duo and got caught up in the action much like a soap opera announcer on radio. Daws was \"Reddy\", the dog, among other nameless characters in the show. In this 1957-1966 time span, Don Messick was cast as Daws Butler's voice partner and as the cartoon narrator. \"Boo-Boo\" was the little friend of \"Yogi Bear\" who lived in Jellystone Park. Yogi stole \"pic-a-nic\" baskets while Boo-Boo always tried, unsuccessfully, to steer Yogi to a more safer life always reminding him \"the Ranger isn't going to like it, Yogi\". The Ranger in question was \"Ranger Smith\", the park ranger who always chased and stopped Yogi's latest schemes. Messick gave voice to the Ranger. Daws was Yogi. In other programs, Messick was heard as \"Pixie Mouse\" to Daws Butler's \"Dixie Mouse\" and \"Mr. Jinx\". On \"Snagglepuss\", Messick was always heard as the villain, mostly the befuddled \"Major Minor\". Daws was Snagglepuss. In Huckleberry Hound, Daws was the star character while Messick usually did the narration as well as played a villain. Messick would later provide the voices of \"Astro\" and \"RUDI\" on the Jetsons. As a versatile voice actor, Messick performed a dozen wacky space aliens on the space cartoons of the mid '60s. The gibberish of \"Gloop\" and \"Gleep\" on the Herculoids cartoon was Messick. \"Blip\", \"Igoo\", \"Zorak\", \"Tundra\", and \"Zoc\" are just a few of the characters that Messick groaned or grunted for in the outer space cartoons...his most famous non-verbal voice is the snickering dog, \"Muttley\"...later called \"Mumbley\". \"Richochet Rabbit\", \"Vapor Man\", \"Falcon 7\", \"Dr. Benton Quest\", and \"Multi-Man\" are other voices from Messick in that era. In 1969 he provided the voice for his most famous role, \"Scooby-Doo\". Throughout the '70s and beyond, Messick gave voice to this cowardly great dane. In 1980 he became the voice of nephew, \"Scrappy-Doo\", while in later versions Daws Butler was on hand as \"Scooby-Dum\". On the 1977 Laff-a-Lympics cartoon, Messick not only announced the show but he performed some of the characters too. \"Papa Smurf\" became Messick's biggest original character in the '80s but he remained busy providing voices for his older characters in new Hanna-Barbera productions. Daws Butler and Mel Blanc were also living off their famed characters by reprising the voices in numerous made-for-TV cartoon movies and Saturday morning TV in the late '70s on into the next decade. Messick remained a much-used voice actor and in 1988 ABC announced \"A Pup Named Scooby-Doo\". Messick was back in the role and voiced the character until it's demise in 1990. His friend and voice partner, Daws Butler, passed away in 1988. In 1989 Mel Blanc passed away leaving Don Messick, June Foray, Stan Freberg, and Paul Winchell as the remaining link to the classic era. In 1989 The Smurfs went out of production. On the new Tiny Toon Adventures, Messick was heard as \"Hamton Pig\", a role he remained with until his mysterious retirement in 1996 at the age of 69 which was later revealed to be a result of a stroke. Don Messick died in 1997, closing a chapter in animation history in the process.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0582106","name":"Don Messick","idIMDB":"nm0582106"},"actorId":"nm0582106","character":"Scooby-Doo","urlCharacter":"http://www.imdb.com/character/ch0000609","main":true},{"actorName":"Heather North","urlProfile":"http://www.imdb.com/name/nm0636011","urlPhoto":"","biography":{"dateOfBirth":"13 December 1950","placeOfBirth":" Pasadena, California, USA","birthName":"Heather Lindsay North","bio":"Heather North was born on December 13, 1950 in Pasadena, California, USA as Heather Lindsay North. She is an actress, known for Scooby-Doo and the Legend of the Vampire (2003), Scooby-Doo and the Monster of Mexico (2003) and Days of Our Lives (1965). She was previously married to Wes Kenney.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0636011","name":"Heather North","idIMDB":"nm0636011"},"actorId":"nm0636011","character":"Daphne","urlCharacter":"http://www.imdb.com/character/ch0000494","main":true},{"actorName":"Frank Welker","urlProfile":"http://www.imdb.com/name/nm0919798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzU2ODYxMV5BMl5BanBnXkFtZTgwMzQ3MjcwMjE@._V1._CR55.1875,112.71306800842285,367,462.6363582611084_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1946","placeOfBirth":" Denver, Colorado, USA","birthName":"Franklin Wendell Welker","height":"5' 8\" (1.73 m)","bio":"Frank Welker was born on March 12, 1946 in Denver, Colorado, USA as Franklin Wendell Welker. He is an actor, known for Aladdin (1992), The Real Ghostbusters (1986) and The Smurfs (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzU2ODYxMV5BMl5BanBnXkFtZTgwMzQ3MjcwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0919798","name":"Frank Welker","nicknames":["Dr. Frankenwelker"],"idIMDB":"nm0919798"},"actorId":"nm0919798","character":"Fred","urlCharacter":"http://www.imdb.com/character/ch0000513","main":true}],"seasons":[],"idIMDB":"tt0255581","urlIMDB":"http://www.imdb.com/title/tt0255581","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.8","filmingLocations":[],"awards":[],"votes":"590","type":"Video","companyCreditsSimple":[{"idCompany":"co0024579","name":"Hanna-Barbera Productions"}],"keywords":{"keywords":["scooby doo","surrealism","cartoon dog","teenage girl","dog","teenage boy","horror for children","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:49:54"}}