{"data":{"movies":[{"title":"Blood Dolls","originalTitle":"","year":"1999","releaseDate":"20051109","directors":[{"name":"Charles Band","id":"nm0023929"}],"writers":[{"name":"Charles Band","id":"nm0023929"},{"name":"Charles Band","id":"nm0023929"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzc5NTQyMV5BMl5BanBnXkFtZTcwMTQxNjUyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Horror"],"plot":"Virgil Travis is a wealthy, soulless psychopath who lives in seclusion in his mansion home with his dwarf butler and maniac right hand man. Tortured and forcibly mutated as a child by a woman who put him through body transforming procedures, Virgil has an abnormally sized head. Basking in the suffering, degradation, pain, and death of others, Virgil has already killed, and kidnapped a female rock group that he keeps imprisoned in his basement to help satisfy his constant need for perverse amusement. Never satisfied, though, Virgil decides that he will once again try to fill the emptiness that exists within him, and so creates a trio of deformed, living dolls to systematically murder any and all people who have ever wronged him. What Virgil doesn't anticipate, though, is meeting his match and finding love, both of which come in the form of a woman who is even more evil and twisted than he is.","simplePlot":"Virgil, an eccentric freak billionaire, spends his days being a \"biological inventor.\" The \"blood dolls,\" his newest creation, aid him in getting revenge on those who betrayed him.","actors":[{"actorName":"Kristopher Logan","urlProfile":"http://www.imdb.com/name/nm0517606","urlPhoto":"","biography":{"dateOfBirth":"30 November 1960","placeOfBirth":" San Diego, California, USA","height":"5' 9\" (1.75 m)","bio":"Kristopher Logan was born on November 30, 1960 in San Diego, California, USA. He is an actor, known for Demolition Man (1993), The SpongeBob SquarePants Movie (2004) and Star Trek: Generations (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517606","name":"Kristopher Logan","idIMDB":"nm0517606"},"actorId":"nm0517606","character":"Virgil Travis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Debra Mayer","urlProfile":"http://www.imdb.com/name/nm0562364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ0NjY0NjE0NF5BMl5BanBnXkFtZTcwMzc1NzkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1969","placeOfBirth":" Hollywood, California, USA","birthName":"Debra M. Mayer","height":"5' 4\" (1.63 m)","bio":"Debra Mayer was born on August 23, 1969 in Hollywood, California, USA as Debra M. Mayer. She is known for her work on Voodoo Academy (2000), Blood Dolls (1999) and Hell Asylum (2002). She died in May 2015 in the USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ0NjY0NjE0NF5BMl5BanBnXkFtZTcwMzc1NzkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0562364","name":"Debra Mayer","idIMDB":"nm0562364"},"actorId":"nm0562364","character":"Moira Yulin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Paul Burns","urlProfile":"http://www.imdb.com/name/nm0122582","urlPhoto":"","biography":{"bio":"William Paul Burns actor, screenwriter, director, producer, opera singer. After Northwestern University and Miami University he became a member of the Actors Studio in NYC, under the direction of Lee Strasberg. The Metropolitan Opera Training program started William professional carrier with the Metropolitan Opera Sextet, appearing in \"Carmen\" \"Le Nozze di Figaro\" \"Boris Godunov\" \"La Boheme\" \"Mcbeth\" etc. His singing carrier moved to Broadway, Winter Garden Theatre, in Mel Brooks / Joshua Logan / Charles Strouse / Lee Adams musical \"All American\". William was invited by Princeton University to be a Guest Artiest, teaching in the Humanities program. His work on Broadway includes \"The Three Sisters,\" \"After the Rain,\" \"One Flew over the Cuckoo's Nest,\" \"Man of La Mancha.\" \"The Royal Hunt of the Sun,\" \"Camino Real\" - Tennessee Williams filmed this production, which is now in the National Archives at Lincoln Center, as the definitive work of his play and William as Kilroy. Universal Studios signed William to a seven year contract, including a mutable picture deal. Staring in many Television shows he was groomed for his own TV series created by David Victor. Other film works followed, include Lipstick, Passover Plot, Blood Dolls, Play Murder For Me, Voyeur II, Camino Real, Marianne, Hollywierd, Three Sisters etc. Recently William co-producer \"The Master and Margarita,\" feature film, novel by Mikhail Bulgakov, with John Cusack. A few of the artiest William has worked with: Francis Ford Coppola, Lamont Johnson, Dino DeLaurentis, Lee Strasberg, Paula Strasberg, Elia Kazan, Arthur Penn, Harold Clurman, Richard Avedon, Nikos Psacharapoulos, Joseph Campbell, Roshi Joan Halifax, Tennessee Williams, Bon Jovi, Vivian Matalon, Albert Marr, Mel Brooks, Joshua Logan, Lee Sankowich, Charles Strouse, Lee Adams, James L. Brooks, Allan Burns, Cecil-Beaton, Sid Shienberg & Laurane Shienberg, Freddie Fields - Milton Goldman -Sue Mengers [ICM], MOTP-Maestro Serra, Robin Wagner, Sergei Bodrov, Charles Band, Penelope Spheeris, Noel Black, Michael Campos, Hector Olivera AR, Robert Weaver, Thomas Job DE, Andy Morahan UK, Sir Peter Ustinov UK, Florence Riggs, Seth Riggs, Barbara Bragg, Linda Gates, Sue Seton, Phyllis Grandy, Ron Fields, Ron Lewis, Mat Maddox, Sandra Seacat, Penny Allen. Extreme athlete, William hopes, one day, to make an ascent on Mt Everest. His mentor, friend/advisor, the brilliant scholar, the late Joseph Campbell, would always say, \"Follow Your Bliss,\" \"Confront Limits.\" William ads, Survival/Self reliance are the keys. It's not the summit, but how you get there that makes all the difference. Trained as a Gestalt Therapist with Dick Price, primary student of Firtz Perls MD, who's theory's were developed after his work with Willhelm Reich and Sigumund Freud, published in his book titled \"Gestalt Therapy\" in 1950. Trained as a Trager Practitioner by Dr. Milton Trager and Dr. Betty Fuller. William-Paul also has in depth study with friends and scholars; Stanislav Grof, M.D. Ph.D., Roshi Joan Halifax, Ph.D., Richard Tarnas, Ph.D., Betty Fuller, Ph.D. In addition, his teachers included: Robert Bly, Al Huang, Jean Erdman, Gregory Bateson, Krishnamurti, Sam Keen, Michael Murphy, Barbara Myeroff, Dick Price, Julian Silverman, Ilana Rubenfeld, Bob Schwartz, Maharishi Mahesh Yogi, Ida Rolf, Vicki Topp etc. Focus of study: Psychology Mythology/Religion and Philosophy. Special Skills Boxing, Cycling, Equestrian, Fencing, Sailing, Scuba Diving, Swimming, Weight Training, Motorcyclist, Stunts, Climbing, Kayaking, Mounting Biking, Outdoor Survival, Confronting Limits, self-reliance.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0122582","name":"William Paul Burns","idIMDB":"nm0122582"},"actorId":"nm0122582","character":"Mr. Mascaro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Warren Draper","urlProfile":"http://www.imdb.com/name/nm0237184","urlPhoto":"","biography":{"height":"5' 10\" (1.78 m)","bio":"Warren Draper is an actor and director, known for Tomorrow Is Today (2006), Blood Dolls (1999) and Virtual Girl (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0237184","name":"Warren Draper","idIMDB":"nm0237184"},"actorId":"nm0237184","character":"Harrison Yulin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Worth","urlProfile":"http://www.imdb.com/name/nm0006431","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODYyODk5Ml5BMl5BanBnXkFtZTcwNjIxMTkwMw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1937","placeOfBirth":" St. Louis, Missouri, USA","height":"6' (1.83 m)","bio":"Character actor Nicholas Worth was born on September 4th, 1937 in St. Louis, Missouri. A big, beefy and imposing hulk of a man, Worth was often cast as extremely nasty and intimidating villains. Worth served in the armed forces as a paratrooper during the Vietnam war. Worth made his film debut in For Pete's Sake (1974). He then had small parts in such movies as Scream Blacula Scream (1973), \"The Terminal Man, \"Coma,\" and \"The Glove,\" making an especially funny appearance in the latter as a gay blank check dropper rugged bounty hunter John Saxon tosses into a pool. Worth gave a wonderfully wild, intense and inspired performance as a deranged, impotent, misogynistic Vietnam veteran porno photographer who brutally strangles lovely young ladies in the splendidly sleazy psycho gem \"Don't Answer the Phone.\" Worth was likewise quite chilling and unforgettable as a vicious homosexual criminal in the outstanding made-for-TV drama \"The Rape of Richard Beck.\" Worth's other memorable roles include Louis Jordan's moronic henchman Bruno in \"Swamp Thing,\" Larry Drake's mean flunky Pauly in \"Darkman,\" Craig T. Nelson's chauffeur in \"Action Jackson,\" an antagonistic bully Clint Eastwood beats up in a jail cell in \"Heartbreak Ridge,\" a ruffian enforcer for Ricardo Montalban in \"The Naked Gun: From the Files of Police Squad!,\" a mutant humanoid frogman in \"Hell Comes to Frogtown,\" a foul sex offender in \"The Ladies Club,\" and a transvestite in \"Armed and Dangerous.\" Among the TV shows Worth did guest spots on are \"Star Trek: Voyager\" and \"Star Trek: Deep Space Nine,\" \"The X-Files,\" \"Night Court,\" \"Moonlighting\" (in which he sings and dances with Bruce Willis!), \"Fame,\" \"MacGyver,\" \"The Greatest American Hero,\" \"Knight Rider,\" \"Hunter,\" \"Simon & Simon,\" \"Fantasy Island,\" \"Charlie's Angels,\" \"The Rockford Files,\" \"Quincy M.E.,\" \"Starsky and Hutch,\" \"Baretta,\" and \"Cannon.\" On stage Worth performed in everything from Shakespeare to musical comedies. A sweet and gentle man in real life (he's a born-again Christian), Worth was also an avid power-lifter and bodybuilder. More recently Worth lent his distinctive growly voice to several video games. Nicholas Worth died at age 69 from heart failure on May 7th, 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODYyODk5Ml5BMl5BanBnXkFtZTcwNjIxMTkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006431","name":"Nicholas Worth","nicknames":["Nicky"],"idIMDB":"nm0006431"},"actorId":"nm0006431","character":"George Warbeck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jodie Fisher","urlProfile":"http://www.imdb.com/name/nm0167546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE0Njc4Njc5N15BMl5BanBnXkFtZTgwMDk5MTM0NDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1960","placeOfBirth":" Dallas, Texas, USA","birthName":"Jodie Lin Fisher","height":"5' 8\" (1.73 m)","bio":"Jodie Fisher was born on July 17, 1960 in Dallas, Texas, USA as Jodie Lin Fisher. She is an actress and producer, known for NCIS: Los Angeles (2009), Age of Love (2007) and Call of Duty: Black Ops II (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE0Njc4Njc5N15BMl5BanBnXkFtZTgwMDk5MTM0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0167546","name":"Jodie Fisher","idIMDB":"nm0167546"},"actorId":"nm0167546","character":"Mercy Shaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phil Fondacaro","urlProfile":"http://www.imdb.com/name/nm0284496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTAwNjkzMV5BMl5BanBnXkFtZTYwNjMzMjky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1958","placeOfBirth":" New Orleans, Louisiana, USA","height":"3' 6\" (1.07 m)","bio":"Phil Fondacaro started his career in 1981 when a casting call went out for \"little people\" for the feature film Under the Rainbow (1981). This was the beginning of a career that is still going strong to this day. From that time he has worked in every genre. including drama, comedy, horror and animation. Phil has worked in films with directors such as Robert Zemeckis (The Polar Express (2004)), Ron Howard (Willow (1988), in which he played Vohnkar) and George Lucas (Star Wars: Episode VI - Return of the Jedi (1983), in which he played an Ewok - the only Ewok who died on screen). Phil's feature films include many in the horror genre, such as Troll (1986), Ghoulies II (1988), Bordello of Blood (1996), Blood Dolls (1999), Meridian (1990), and most recently he worked with George A. Romero in Land of the Dead - Le territoire des morts (2005). He also starred opposite Verne Troyer in a short film, Bit Players (2000), which premiered at Sundance and was directed by Andy Berman. Phil's television credits included a recurring role in Sabrina, the Teenage Witch (1996) as Roland. His TV work also includes some other memorable performances where he guest-starred in shows such as CSI: Crime Scene Investigation (2000), and had an amazing role in Touched by an Angel (1994). Phil Fondacaro stands 3' 6\" tall and lives by the quote, \"It is not the size of the man in the fight, but the size of the fight in the man\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTAwNjkzMV5BMl5BanBnXkFtZTYwNjMzMjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0284496","name":"Phil Fondacaro","idIMDB":"nm0284496"},"actorId":"nm0284496","character":"Hylas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Naomi McClure","urlProfile":"http://www.imdb.com/name/nm0566029","urlPhoto":"","biography":{"bio":"Naomi McClure is an actress, known for Blood Dolls (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0566029","name":"Naomi McClure","idIMDB":"nm0566029"},"actorId":"nm0566029","character":"Cindy Agami","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Forbes","urlProfile":"http://www.imdb.com/name/nm0285346","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAzMjc2NzQwNF5BMl5BanBnXkFtZTgwNzQ5NzA2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1959","placeOfBirth":" Long Beach, California, USA","bio":"Jack Forbes is an actor, writer (music and film) and lawyer. He was raised in Long Beach, California, graduated with a Bachelor of Arts from University of California at Santa Barbara, and a Juris Doctor degree, Cum Laude, from Pepperdine University School of Law. Jack had starring roles in the independent comedic feature film, Chick Magnet (2011)_, and in the independent dramatic feature, _Will to Power, The (2006)_. Jack had the starring lead in _Gun, The (from 6 to 7:30 p.m.) (2003)_, a film in competition at the 2003 Montreal World Film Festival, for which he was nominated for a Best Male Lead Actor. In The Gun, Jack introduced many of his own ideas in the development of his character, including, notably, the broken glasses. In 2014, Jack worked with Laura Regan and Lew Temple in the independent feature film Atlas Shrugged 3: Who Is John Galt?, directed by J. James Manera. In 2002, Jack landed a supporting role opposite Jeff Bridges and Noah Wiley in the Starz cable feature film, Scenes of the Crime. In 2001, Jack had the lead in the independent feature film/mockumentary, Interviewing Norman, where he played a documentary filmmaker striving to make a documentary on a man who claimed to be the devil. In 1998 he was the lead in the acclaimed short film Reflexus (1998) which among other awards won the Audience Choice Best of Festival award in the first Internet film festival in history, the 1st Annual Toshiba/Warner Bros.' Reel Time Film Festival. In a Guest Star role on Judging Amy, Jack played a physically abusive father, and was the lead detective on the pilot episode for Dick Wolf's acclaimed Arrest & Trial series. In the role of a police captain, Jack was the recurring father of a Series Regular in the Spelling pilot, Deep. He also Guest-Starred as a criminal defense attorney in the 2003 Discovery Channel pilot, Crime Time, produced and directed by reality TV veteran, Eddie Barbini. In 2012 and 2013, Jack was a popular recurring Guest Star character, Dell Cooper, on the TNT hit series SouthLAnd (\"The Winds\" and \"Heroes\"). The hard-headed father of Officer John Cooper (Series Regular Michael Cudlitz), Dell was serving Life-with-possibility-of-parole in State prison for a horrendous crime he committed over 20 years ago. Dell despises everything his estranged son John stands for. Jack has Guest-Starred and co-starred in many other television series, including Castle, Eleventh Hour, Women's Murder Club, ER, X-Files, Gideon's Crossing, The District, The Practice, Profiler, Michael Hayes, Guns of Paradise, Beauty and the Beast, FBI: The Untold Stories, America's Most Wanted, U.S. Customs Classified, Peepers, City Guys, Grace Under Fire, and multiple episodes of Unsolved Mysteries, Totally Hidden Video, Divorce Court and various soap operas such as General Hospital. He had the 3rd lead in the play, 'Agnes', at the Falcon Theatre under the direction of Scott Marshall (son of Gary Marshall). In a web series deadbangseries.com written and produced by Jack Forbes, Jack is the Series Regular Lead as retired C.I.A. Officer Shane Stasko. Also, Jack has been a principal actor in numerous National commercials, including, notably, Firestone Complete Auto Care, Miller Lite, Dodge, Chevrolet, CitiBank, Nike, AT&T World-Net, Tru-Value Hardware, Jack-In-The-Box and many others. Jack was the Dad hitting baseballs to his son in the youth smoking prevention PSA. Jack is an all-around athlete who has performed stunts in The Gun, and in many other productions. Jack races in Regional SCCA Cup races, is an expert rock climber, a Black Belt in Kenpo Karate, an expert in sticks and knives, an accomplished surfer, an off-road motorcyclist, a horse back rider, a water skier, an ex-Professional Ski Patrol at Sun Valley, Idaho, an ex-Huntington Beach ocean beach lifeguard, an avid badminton competitor, and an acoustic guitarist, among other skills and interests. As a trial lawyer, Jack has handled both criminal defense as a Deputy Public Defender and complex business litigation in private practice.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAzMjc2NzQwNF5BMl5BanBnXkFtZTgwNzQ5NzA2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285346","name":"Jack Forbes","idIMDB":"nm0285346"},"actorId":"nm0285346","character":"Squires","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Pace","urlProfile":"http://www.imdb.com/name/nm0655134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjAzNzMyN15BMl5BanBnXkFtZTcwMTU5MDI2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1974","placeOfBirth":" Richmond [now Staten Island], New York City, New York, USA","birthName":"Jason Robert Pace","bio":"Jason earned his Bachelor's Degree in Psychology and a Master's Degree in Education/Child Development at Wagner College. A veteran New York actor, he was seen in over 100 commercials and various recurring roles on television shows such as Kate & Allie, As the World turns and One Life to Live. After his graduation, Jason moved to Los Angeles in 1998. While in Los Angeles, Jason continued his on camera success while also becoming one of the leading voice over artists for film and television. In 2001, UPN decided to branch out to a larger demographic viewing audience and cast Jason to help expand their network. Jason had the good fortune of being cast as the first Caucasian lead actor on the hit UPN sitcom \"Girlfriends.\" He was cast as the quick-witted, handsome, plastic surgeon, Dr. Todd Garrett. He played the love interest and later husband of actress Jill Marie Jones' character. From 2001-2006, the comedy/drama of this bi-racial, bi-religious and child bearing couple brought the highest ratings to this popular show. During his time on the show, \"Girlfriends\" was the #1 show watched by all women 18-42 and was seen by over 9 million viewers per episode. As a way to give back to the community, Jason founded Children's Playhouse Theater, A Performing Arts School & Camp for Children in the summer of 2001. There he has had the enjoyment of co-writing and directing over 40 productions. CPT's curriculum has benefited over 3,000 students in the Los Angeles community. It's goal is to help support the voice of children and to ensure that all children of the LA community experience the benefits of the performing arts. In 2008, Jason began incorporating his passion for Psychology & Acting to create \"The Psychology of Acting\" workshop series. The workshops are based in Jungian & Depth Psychology. He has been asked to teach these workshops throughout Los Angeles and New York and has most recently taught them at Disney as part of their Diversity Program as well as Yale University in their Summer Film Institute. In 2004, Jason married and soon became a father of three beautiful children. He has recently returned to the industry after a 4 year hiatus raising his family. Upon his return, he quickly continued his success and In May of 2011, Jason finished filming the lead in filmmaker Shane Stanleys', (Disneys \"Gridiron Gang\",\"A Sight for Sore Eyes\"), new serio-comedy \"My Trip to the Darkside\" due out in 2011. Both Jason and the film won high honors at the Worldfest Houston International Film Festival bringing home the Gold Jury Prize for Best Picture. The director & actor tandem teamed up again to film the sequel \"My Trip Back to the Darkside\" due out in 2013. He also continues to be one of the leading voice over artist in Los Angeles with roles in \"Happy Feet Two\", \"Infamous\" and various radio spots for \"7-11\", \"KMart\" and \"Robbins Brothers\". Jason has recently been cast in the upcoming Dana Klein Pilot \"My Friends With Better Lives\" for CBS Network. There he plays Jimmy Bennina, friend to James Van Der beeks character Will Stokes & opposite Kevin Connolly, Brooklyn Decker, Majandra Delfino & Zoe Lister Jones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjAzNzMyN15BMl5BanBnXkFtZTcwMTU5MDI2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0655134","name":"Jason Pace","idIMDB":"nm0655134"},"actorId":"nm0655134","character":"Howard Loftus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J. Paradee","urlProfile":"http://www.imdb.com/name/nm0660815","urlPhoto":"","biography":{"bio":"J. Paradee is an actress, known for Blood Dolls (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0660815","name":"J. Paradee","idIMDB":"nm0660815"},"actorId":"nm0660815","character":"Shirley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Venesa Talor","urlProfile":"http://www.imdb.com/name/nm0848286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFhYjdlYjMtMTQzYS00MTI0LTg2ZjEtM2RjN2QxMmRmZGUwXkEyXkFqcGdeQXVyMTMxMTkwMzY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1970","placeOfBirth":" Long Island, New York, USA","birthName":"Vanessa Lynn Tendler","height":"5' 6\" (1.68 m)","bio":"Venesa Talor was born on May 6, 1970 in Long Island, New York, USA as Vanessa Lynn Tendler. She is an actress, known for Femalien II (1998), Femalien (1996) and Demonicus (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFhYjdlYjMtMTQzYS00MTI0LTg2ZjEtM2RjN2QxMmRmZGUwXkEyXkFqcGdeQXVyMTMxMTkwMzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848286","name":"Venesa Talor","idIMDB":"nm0848286"},"actorId":"nm0848286","character":"Cotton Baby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yvette Lera","urlProfile":"http://www.imdb.com/name/nm0503444","urlPhoto":"","biography":{"dateOfBirth":"March1969","placeOfBirth":"","bio":"Yvette Lera was born in March 1969. She is an actress, known for Judas Kiss (1998), Blood Dolls (1999) and The Exotic House of Wax (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0503444","name":"Yvette Lera","idIMDB":"nm0503444"},"actorId":"nm0503444","character":"Razor Baby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Persia White","urlProfile":"http://www.imdb.com/name/nm0925316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYThiN2RjN2MtNzk1ZC00Y2RkLThkOWItY2I2OTY4YTMzNjBlXkEyXkFqcGdeQXVyMjE4MjA1MDg@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1972","placeOfBirth":" Miami, Florida, USA","height":"5' 8\" (1.73 m)","bio":"At the age of eight, Persia White started showing her talents at the Coconut Grove Childrens' Theatre in Miami, Florida, where she was born. She is Puerto Rican, African-American and Irish. Most recognized as \"Lynn\" in the long running hit CW series \"Girlfriends.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYThiN2RjN2MtNzk1ZC00Y2RkLThkOWItY2I2OTY4YTMzNjBlXkEyXkFqcGdeQXVyMjE4MjA1MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925316","name":"Persia White","idIMDB":"nm0925316"},"actorId":"nm0925316","character":"Black Baby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Corboy","urlProfile":"http://www.imdb.com/name/nm0179275","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzQ0NzA4OV5BMl5BanBnXkFtZTgwNDg2Mjk3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1973","placeOfBirth":" Honolulu, Hawaii, USA","height":"6' 1\" (1.85 m)","bio":"Matt Corboy was born on June 4, 1973 in Honolulu, Hawaii, USA. He is known for his work on The Descendants (2011), Passengers (2016) and Straight Outta Compton (2015). He has been married to Kara McNamara Corboy since August 4, 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzQ0NzA4OV5BMl5BanBnXkFtZTgwNDg2Mjk3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0179275","name":"Matt Corboy","idIMDB":"nm0179275"},"actorId":"nm0179275","character":"Warbeck Security","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0203343","urlIMDB":"http://www.imdb.com/title/tt0203343","business":{"budget":{"money":"$1,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.8","filmingLocations":[],"rated":"R","awards":[],"votes":"1,232","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["murder","blood spatter","camp","black humor","black comedy","bare chested male","bare chested male bondage","evil doll","dominatrix","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:02:06"}}