{"data":{"movies":[{"title":"The Reckoning","originalTitle":"","year":"2002","releaseDate":"20040604","directors":[{"name":"Paul McGuigan","id":"nm0006476"}],"writers":[{"name":"Barry Unsworth","id":"nm0881343"},{"name":"Mark Mills","id":"nm0590105"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTY5Mzk0N15BMl5BanBnXkFtZTcwOTA1MDUyMQ@@._V1.jpg","countries":["UK","Spain"],"languages":["English","Latin"],"genres":["Crime","Drama","Mystery"],"plot":"In 14th-century England, a young monk breaks his vow of chastity and flees the wrath of his bishop and fellow monks. A fugitive priest, he then witnesses the murder of a traveling performer--and subsequently, the mourning of actor by his fellow troupe members. He eventually becomes initiated into the troupe as a player, replacing the murdered man. They travel from town to town performing their standard morality play. They arrive in a town where a boy has been killed and a young deaf-mute girl has been imprisoned for the crime--sentenced to death for witchcraft and murder. Discarding the expected bible stories, the actors stage a performance based on the crime. Through the performance of the play, they discover that the townspeople know the young woman did not, in fact, commit the murder. The stage becomes a place where vital human truth is told. Thus, simultaneously, the fugitive priest comes to terms with his own crime and makes a powerful sacrifice, thereby redeeming himself.","simplePlot":"A priest on the lam takes up with a traveling band of actors, who then discover a murder has occurred and try to solve it by recreating the crime in a play.","actors":[{"actorName":"Paul Bettany","urlProfile":"http://www.imdb.com/name/nm0079273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODg1MTA5Ml5BMl5BanBnXkFtZTcwNDQwMTQxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1971","placeOfBirth":" Harlesden, London, England, UK","height":"6' 3½\" (1.92 m)","bio":"Paul Bettany was born in Harlesden, London, England, into a theatre family. His father, Thane Bettany, is still an actor, but his mother, Anne Kettle, has retired from acting. His maternal grandmother, Olga Gwynne (her maiden and stage name), was a successful actress, while his maternal grandfather, Lesley Kettle, was a musician and promoter. He has an older sister who is a writer. Paul was brought up in North West London and, after the age of nine, in Hertfordshire (Brookmans Park). Immediately after finishing at Drama Centre London, he went into the West End to join the cast of \"An Inspector Calls\", though when asked to go on tour with this play, he chose to stay in England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODg1MTA5Ml5BMl5BanBnXkFtZTcwNDQwMTQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079273","name":"Paul Bettany","idIMDB":"nm0079273"},"actorId":"nm0079273","character":"Nicholas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marian Aguilera","urlProfile":"http://www.imdb.com/name/nm0013640","urlPhoto":"","biography":{"dateOfBirth":"12 March 1977","placeOfBirth":" Barcelona, Catalonia, Spain","birthName":"Marián Aguilera Pérez","height":"5' 6¼\" (1.68 m)","bio":"Marian Aguilera was born on March 12, 1977 in Barcelona, Catalonia, Spain as Marián Aguilera Pérez. She is an actress, known for Al salir de clase (1997), Paco's Men (2005) and The Reckoning (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0013640","name":"Marian Aguilera","idIMDB":"nm0013640"},"actorId":"nm0013640","character":"Nicholas' Lover","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Trevor Steedman","urlProfile":"http://www.imdb.com/name/nm0824365","urlPhoto":"","biography":{"dateOfBirth":"25 May 1954","placeOfBirth":" Thurrock, Essex, England, UK","bio":"Trevor Steedman was born on May 25, 1954 in Thurrock, Essex, England. He is known for his work on Children of Men (2006), Sherlock Holmes: A Game of Shadows (2011) and Aliens (1986). He died on June 25, 2016 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824365","name":"Trevor Steedman","idIMDB":"nm0824365"},"actorId":"nm0824365","character":"Jealous Husband","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Simon McBurney","urlProfile":"http://www.imdb.com/name/nm0564402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTEzOTg2M15BMl5BanBnXkFtZTYwNTU3MTQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1957","placeOfBirth":" Cambridge, Cambridgeshire, England, UK","birthName":"Simon Montagu McBurney","height":"5' 6½\" (1.69 m)","bio":"Simon McBurney was born on August 25, 1957 in Cambridge, Cambridgeshire, England as Simon Montagu McBurney. He is an actor and director, known for The Last King of Scotland (2006), Mission: Impossible - Rogue Nation (2015) and The Theory of Everything (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTEzOTg2M15BMl5BanBnXkFtZTYwNTU3MTQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564402","name":"Simon McBurney","idIMDB":"nm0564402"},"actorId":"nm0564402","character":"Stephen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Hardy","urlProfile":"http://www.imdb.com/name/nm0362766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1977","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Edward Thomas Hardy","height":"5' 9\" (1.75 m)","bio":"With his breakthrough performance as Eames in Christopher Nolan's science fiction thriller Inception (2010), English actor Tom Hardy has been brought to the attention of mainstream audiences worldwide. However, the versatile actor has been steadily working on both stage and screen since his television debut in the miniseries Band of Brothers (2001). After being cast in the World War II drama, Hardy left his studies at the prestigious Drama Centre in London and was subsequently cast as Twombly in Ridley Scott's Black Hawk Down (2001) and as the villain Shinzon in Star Trek: Nemesis (2002). Tom was born on September 15, 1977 in Hammersmith, London; his mother, Elizabeth Anne (Barrett), is an artist and painter, and his father, Edward Hardy, is a writer. He is of English and Irish descent. Hardy was brought up in East Sheen, London, and first studied at Reed's School. His education continued at Tower House School, then at Richmond Drama School, and subsequently at the Drama Centre London, along with fellow Oscar nominee Michael Fassbender. After winning a modeling competition at age 21, he had a brief contract with the agency Models One. Tom spent his teens and early twenties battling delinquency, alcoholism and drug addiction; after completing his work on Star Trek: Nemesis (2002), he sought treatment and has also admitted that his battles with addiction ended his 5-year marriage to Rachael Speed. Returning to work in 2003, Hardy was awarded the Evening Standard Most Promising Newcomer Award for his theatre performances in the productions of \"In Arabia, We'd All Be Kings\" and \"Blood\". In 2003, Tom also co-starred in the play \"The Modernists\" with Paul Popplewell, Jesse Spencer and Orlando Wells. During the next five years, Hardy worked consistently in film, television and theatre, playing roles as varied as Robert Dudley in the BBC's The Virgin Queen (2005), Bill Sikes in Oliver Twist (2007) and starring in \"The Man of Mode\" at the National Theatre. On the silver screen, he appeared in the crime thriller Layer Cake (2004) with Daniel Craig, Sofia Coppola's Marie Antoinette (2006), and the romp Scenes of a Sexual Nature (2006). In 2006, Hardy created \"Shotgun\", an underground theatre company along with director Robert Delamere, and directed a play, penned by his father for the company, called \"Blue on Blue\". In 2007, Hardy received a best actor BAFTA nomination for his touching performance as Stuart Shorter in the BBC adaptation of Alexander Masters' bestselling biography Stuart: A Life Backwards (2007). Hardy, hailed for his transformative character acting, was lauded for his emotionally and physically convincing portrayal in the ill-fated and warmhearted tale of Shorter, a homeless and occasionally violent man suffering from addiction and muscular dystrophy. The following year, he appeared as gay hoodlum Handsome Bob in the Guy Ritchie film RocknRolla (2008), but this would be his next transformation that would prove his extensive range and stun critics. In the film Bronson (2008), Hardy played the notorious Charles Bronson (given name, Michael Peterson), the \"most violent prisoner in Britain\". Bald, pumped-up, and outfitted with Bronson's signature strongman mustache, Hardy is unrecognizable and gives a harrowing performance that is physically fearless and psychologically unsettling. Director Nicolas Winding Refn breaks the fourth wall with Hardy retelling his tales directly to viewers as well as performing them outright before an audience of his own imagining. The performance mixes terrifying brutality, vaudevillian showmanship, wry humor, and an alarming amount of commitment, and won Hardy a British Independent Film Award for Best Actor. The performance got Hollywood's attention, and in 2009, Hardy was named one of Variety's \"10 Actors to Watch\". That year, he continued to garner praise for his starring role in The Take (2009), a four-part adaptation of Martina Cole's bestselling crime novel, as well as for his performance as Heathcliff in a version of Wuthering Heights (2009). Recent work includes the aforementioned breakthrough appearance in Inception (2010) alongside Leonardo DiCaprio, Joseph Gordon-Levitt, Cillian Murphy, Tom Berenger, Ken Watanabe, Michael Caine, Marion Cotillard and Ellen Page. The movie was released in July 2010 and became one of top 25 highest grossing films of all time, collecting eight Oscar nominations (including Best Picture) and winning four. Other films include Warrior (2011), opposite Joel Edgerton, the story of two estranged brothers facing the fight of a lifetime from director Gavin O'Connor, and This Means War (2012), directed by McG and co-starring Reese Witherspoon and Chris Pine. Tom also starred in the heralded Cold War thriller, La taupe (2011) with Colin Firth and Gary Oldman. Hardy rejoined Christopher Nolan for The Dark Knight Rises (2012); he played the villain role of Bane opposite Christian Bale, Anne Hathaway, Joseph Gordon-Levitt and Gary Oldman. Hardy's menacing physique and his character's scrambled, hard-to-distinguish voice became a major discussion point as the film was released. Outside of performing, Hardy is the patron for the charity \"Flack\", which is an organization to aid the recovery of the homeless in Cambridge. And in 2010, Hardy was named an Ambassador for The Prince's Trust, which helps disadvantaged youth. On the recent stage, he starred in the Brett C. Leonard play \"The Long Red Road\" in early 2010. Written for Hardy and directed by Philip Seymour Hoffman, the play was staged at Chicago's Goodman Theater. In 2015, Hardy starred as the iconic Mad Max in George Miller's reboot of his franchise, Mad Max: Fury Road (2015). He also collected a British Independent Film Award for his portrayal of both the Kray twins, Ronnie and Reggie, in Legend (2015), and an Oscar nomination for Best Supporting Actor for his role as John Fitzgerald in The Revenant (2015). He has an outlaw biker story among other projects in development. In 2010, Hardy became engaged to fellow English actress Charlotte Riley, whom he starred with in The Take (2009) and Wuthering Heights (2009), and is raising a young son, Louis, with ex-girlfriend Rachael Speed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362766","name":"Tom Hardy","idIMDB":"nm0362766"},"actorId":"nm0362766","character":"Straw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Cox","urlProfile":"http://www.imdb.com/name/nm0004051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNDUwMDMyNF5BMl5BanBnXkFtZTYwODU3MDQ1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1946","placeOfBirth":" Dundee, Scotland, UK","birthName":"Brian Denis Cox","height":"5' 7½\" (1.71 m)","bio":"Brian Cox is an Emmy Award-winning Scottish actor. He was born on June 1, 1946 in Dundee, Scotland, to Mary Ann Guillerline (McCann), a spinner, and Charles McArdle Campbell Cox, a shopkeeper and butcher. His father was of Irish ancestry and his mother was of Irish and Scottish descent. Cox first came to attention in the early 1970s with performances in numerous television films. His first big break was as Dr. Hannibal Lecter in Manhunter (1986). The film was not overly successful at the box office, although Cox's career prospects and popularity continued to develop. Through the 1990s, he appeared in nearly 20 films and television series, as well as making numerous television guest appearances. More recently, Cox has had roles in some major films, including The Corruptor (1999), The Ring (2002) and X-Men 2 (2003). He was awarded Commander of the Order of the British Empire in the 2003 Queen's New Year's Honours List for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNDUwMDMyNF5BMl5BanBnXkFtZTYwODU3MDQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004051","name":"Brian Cox","idIMDB":"nm0004051"},"actorId":"nm0004051","character":"Tobias","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willem Dafoe","urlProfile":"http://www.imdb.com/name/nm0000353","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjU2MTYyM15BMl5BanBnXkFtZTgwMjY5MDY4NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1955","placeOfBirth":" Appleton, Wisconsin, USA","birthName":"William J. Dafoe","height":"5' 9\" (1.75 m)","bio":"Willem Dafoe was born in Appleton, Wisconsin, to Muriel Isabel (Sprissler), a nurse, and Dr. William Alfred Dafoe, a surgeon. He is of German, French, English, Irish, and Scottish descent. In 1979, Dafoe was given a small role in Michael Cimino's Heaven's Gate (1980) from which he was fired. His first feature role came shortly after in Kathryn Bigelow's The Loveless (1981). From there, he went on to perform in over 80 films - in Hollywood (John Carter (2012), Spider-Man (2002), The English Patient (1996), Finding Nemo (2003), Once Upon a Time in Mexico (2003), Clear and Present Danger (1994), White Sands (1992), Mississippi Burning (1988), Streets of Fire (1984), American Dreamz (2006)) and in independent cinema in the U.S. (L'enlèvement (2004), Animal Factory (2000), The Boondock Saints (1999), American Psycho (2000)) and abroad (Theo Angelopoulos' La poussière du temps (2008), Yim Ho's Pavillon de femmes (2001), Yurek Bogayevicz's Edges of the Lord (2001), Wim Wenders' Faraway (2011), So Close (2009), Nobuhiro Suwa's segment of Paris, je t'aime (2006), Brian Gilbert's Tom & Viv (1994), Christian Carion's Farewell (2001), _Mr. Bean's Holiday and The Spierig Brothers' Daybreakers_, Daniel Nettheim's The Hunter (2011)). He has chosen projects for diversity of roles and opportunities to work with strong directors. He has worked in the films of Wes Anderson (The Life Aquatic with Steve Zissou (2004), Fantastic Mr. Fox (2009), The Grand Budapest Hotel (2014)), Martin Scorsese (Aviator (2004), The Last Temptation of Christ (1988)), Spike Lee (Inside Man (2006)), Julian Schnabel (Miral (2010), Basquiat (1996)), Paul Schrader (Auto Focus (2002), Affliction (1997), Light Sleeper (1992), The Walker (2007), Adam Resurrected (2008)), David Cronenberg (eXistenZ (1999)), Abel Ferrara (4:44 Last Day on Earth (2011), Go Go Tales (2007), New Rose Hotel (1998)), David Lynch (Wild at Heart (1990)), William Friedkin (To Live and Die in L.A. (1985)), Werner Herzog (My Son, My Son, What Have Ye Done (2009), Oliver Stone (Born on the Fourth of July (1989), Platoon (1986)), Giada Colagrande (A Woman (2010) and Before It Had a Name (2005)) and Lars von Trier (Antichrist (2009) and Manderlay (2005)). He was nominated twice for the Academy Award (Platoon (1986) and Shadow of the Vampire (2000)) and once for the Golden Globe. Among other nominations and awards, he received an LA Film Critics Award and an Independent Spirit Award. Upcoming films include Wes Anderson's The Grand Budapest Hotel (2014), Anton Corbjin's A Most Wanted Man (2014), Lars von Trier's Nymphomaniac - Volume 1 (2013), Scott Cooper's Out of the Furnace (2013), Josh Boone's The Fault In Our Stars (2014)_, David Leitch and Chad Stahelski's John Wick (2014)_, and Chris Brinker's Bad Country (2014). Dafoe is one of the founding members of The Wooster Group, the New York based experimental theatre collective. He created and performed in all of the group's work from 1977 thru 2005, both in the U.S. and internationally. Since then, he worked with Richard Foreman in Idiot Savant at The Public Theatre (NYC) and most recently the international productions of Robert Wilson's The Life & Death of Marina Abramovic abroad and Robert Wilson's The Old Woman with Mikhail Baryshnikov.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjU2MTYyM15BMl5BanBnXkFtZTgwMjY5MDY4NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000353","name":"Willem Dafoe","idIMDB":"nm0000353"},"actorId":"nm0000353","character":"Martin","urlCharacter":"http://www.imdb.com/character/ch0093191","main":true},{"actorName":"Gina McKee","urlProfile":"http://www.imdb.com/name/nm0571160","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTYyNDc5MF5BMl5BanBnXkFtZTcwNTI2NzM1OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1964","placeOfBirth":" Sunderland, Tyne and Wear, England, UK","height":"5' 8\" (1.73 m)","bio":"Gina McKee was born on April 14, 1964 in Sunderland, Tyne and Wear, England. She is an actress and producer, known for In the Loop (2009), Notting Hill (1999) and Atonement (2007). She has been married to Stephen J. (Kez) Cary since August 1989.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTYyNDc5MF5BMl5BanBnXkFtZTcwNTI2NzM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571160","name":"Gina McKee","idIMDB":"nm0571160"},"actorId":"nm0571160","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stuart Wells","urlProfile":"http://www.imdb.com/name/nm0920435","urlPhoto":"","biography":{"dateOfBirth":"18 September 1982","placeOfBirth":" Wallsend, England, UK","height":"5' 11\" (1.8 m)","bio":"After working as an Actor between 1999 and 2001 Stuart enlisted in the British army in October 2001. Stuart served as an Infantry Soldier progressing through the ranks from Private to Corporal until he left the Army in 2008. Whilst serving his country Stuart completed three operational tours including two of Iraq, the first of which was during the 'War Phase' in 2003. Stuart crossed the border into Iraq on 21 March 2003 as part of the First Fusilier Battlegroup. Since Stuart made the decision to leave the Army he has qualified as a Close Protection Operative and works as part of a Vessel Protection Team protecting ships against piracy within high risk areas. Recently Stuart has made the decision to again pursue a career in Acting and is currently considering different projects. Stuart lives in Newcastle, England with his fiancé Christine and his daughter Hannah-May.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0920435","name":"Stuart Wells","idIMDB":"nm0920435"},"actorId":"nm0920435","character":"Springer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vincent Cassel","urlProfile":"http://www.imdb.com/name/nm0001993","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDUzMzM5MV5BMl5BanBnXkFtZTcwNzY1OTYyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1966","placeOfBirth":" Paris, France","birthName":"Vincent Crochon","height":"6' 1½\" (1.87 m)","bio":"Blue-eyed Vincent Cassel was born in Paris to a leading actor father, Jean-Pierre Cassel, and a journalist mother, Sabine Litique. Often labeled as a tough guy because of his roles, eclectic choices and talent have made of him a star of European cinema. First in La Haine (1995), the young actor, actually coming from upper classes, succeeded to express the despair of a social class living in the suburbs of towns. This veracity in his play comes from the fact that he was in fact since years in connection with many hip-hop artists from the rising generation, (his own brother was leader of a legendary french rap group). Then the success of The crimson rivers, where he plays a young French cop alongside Jean Reno, made of him \"the man to count on.\" He never hid his taste for rap music, break dance, Capoeira, Brasil and his endless energy, but Vincent is also a family man, married to Monica Bellucci, his Italian co-star from The Apartment (1996) (aka The Apartment); and recently a father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDUzMzM5MV5BMl5BanBnXkFtZTcwNzY1OTYyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001993","name":"Vincent Cassel","nicknames":["Vinz"],"idIMDB":"nm0001993"},"actorId":"nm0001993","character":"Lord De Guise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elvira Mínguez","urlProfile":"http://www.imdb.com/name/nm0617799","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODIxOTMzMl5BMl5BanBnXkFtZTcwODMxNjU3Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1965","placeOfBirth":" Valladolid, Valladolid, Castilla y León, Spain","bio":"Elvira Mínguez was born on July 23, 1965 in Valladolid, Valladolid, Castilla y León, Spain. She is an actress and writer, known for Appel inconnu (2015), Tapas (2005) and Truman (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODIxOTMzMl5BMl5BanBnXkFtZTcwODMxNjU3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0617799","name":"Elvira Mínguez","idIMDB":"nm0617799"},"actorId":"nm0617799","character":"Martha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Durden","urlProfile":"http://www.imdb.com/name/nm0243983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDI0MjQyNl5BMl5BanBnXkFtZTcwNTg5NDUxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1944","placeOfBirth":" Hendon, Middlesex, England, UK","birthName":"Mark Richard Durden-Smith","bio":"Richard Durden was born on February 8, 1944 in Hendon, Middlesex, England as Mark Richard Durden-Smith. He is an actor, known for From Paris with Love (2010), Batman (1989) and Agora (2009). He has been married to Jane How since January 21, 1996. He was previously married to Maria Aitken.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDI0MjQyNl5BMl5BanBnXkFtZTcwNTg5NDUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0243983","name":"Richard Durden","idIMDB":"nm0243983"},"actorId":"nm0243983","character":"Town Justice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ewen Bremner","urlProfile":"http://www.imdb.com/name/nm0001971","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTVjNzNhNzItNjc1ZC00YTJjLWI2MjctMDc4MmMxOGZkZGUxXkEyXkFqcGdeQXVyMTg0NTYyNjU@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1972","placeOfBirth":" Edinburgh, Scotland, UK","height":"5' 8\" (1.73 m)","bio":"Born in Edinburgh, Scotland, Ewen Bremner has worked with many of the most respected directors in world cinema, including Danny Boyle, Mike Leigh, Ridley Scott, Joon-Ho Bong, Werner Herzog and Woody Allen. Ewen has established himself by creating unique characters in critically acclaimed films, as well as going toe to toe with many of Hollywood's biggest stars. Bremner had worked widely in theatre, television, and film for years before being cast in his breakout role in Trainspotting (1996), by Oscar-winning director Danny Boyle. Having originated the role of Mark Renton in Edinburgh's Traverse Theatre production, Bremner then made waves opposite Ewan McGregor playing Spud Murphy and earned screen immortality with his character's infamous \"speed fueled\" job interview scene. Prior to Trainspotting, Bremner gave a striking performance in Mike Leigh's Naked, starring opposite David Thewlis. In 1999, Bremner received critical acclaim for his portrayal of a schizophrenic man living with his dysfunctional family in Harmony Korine's Julien Donkey-Boy. Filmed strictly in accordance with the ultra-realist tenants of Lars Von Trier's Dogma 95 movement and starring opposite Werner Herzog, Bremner played Julien its eponymous hero, requiring him to assume an American accent. He then worked with director Michael Bay in his high-profile 2001 war film Pearl Harbor, proving his versatility once again by portraying the role of a wholeheartedly patriotic American soldier fighting in WWII. The following year, he stepped back into fatigues for a supporting role in Ridley Scott's Black Hawk Down, while rounding out the next several years with roles in high-profile Hollywood releases such as The Rundown, Disney's Around the World in 80 Days, Alien vs. Predator, Woody Allen's Match Point, the comedy Death at a Funeral directed by Frank Oz, and Fool's Gold starring Matthew McConaughey and Kate Hudson. This past year proved to be a busy one when Bremner was invited to join the DC Universe in the Zack Snyder-produced feature Wonder Woman, directed by Patty Jenkins, co-starring Gal Gadot and Chris Pine, and set for release by Warner Bros. in the summer of 2017. Ewen would also reprise his unforgettable role as \"Spud\" in the highly-anticipated sequel to Danny Boyle's cult classic, T2: Trainspotting, for Sony due out early 2017. He rounded out the year with the feature The Lake, produced by Luc Besson. Currently (2017), Bremner is filming the TNT Drama Series Will with Shekhar Kapur, produced by Craig Pearce, whose writing credits include the feature films The Great Gatsby, Moulin Rouge, Romeo + Juliet and Strictly Ballroom. The series will tell the story of the lost years of young William Shakespeare after his arrival to London in 1589. Other notable film credits include Woody Allen's You Will Meet a Tall Dark Stranger, David Mackenzie's Perfect Sense starring again alongside Ewan McGregor, Great Expectations directed by Mike Newell, Bryan Singer's Jack the Giant Slayer, and Snowpiercer directed by Bong Joon-Ho and starring opposite Chris Evans and Tilda Swinton. Further credits include Exodus: Gods and Kings, Wide Open Spaces, Mojo, Mediator, Faintheart, Hallam Foe, Sixteen Years of Alcohol, and Snatch. In television, Ewen has worked on many acclaimed productions including David Hare's Worriker trilogy starring Bill Nighy for BBC, Jimmy McGovern's Moving On and also his Australian mini-series Banished, Strike Back for Sky TV, Dominic Savage's Dive, the Dylan Thomas biopic, A Poet In New York and the adaptation of Day of the Triffids for the BBC. Other noteworthy series appearances include portraying legendary surrealist Salvador Dali in the U.K. television drama Surrealissimo: The Trial of Salvador Dali, and a guest spot on the successful NBC series, My Name is Earl. Ewen has worked extensively in theatre and his credits include God of Hell (Donmar Warehouse), Damascus (Traverse), Trainspotting (Citizens/Traverse/Bush Theatres), The Present (Bush Theatre), Gormenghast (Lyric Hammersmith), Bright Light Shinning (Bush Theatre) and Conquest of the South Pole (Traverse/Royal Court) among others. He currently spends his time between Scotland and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTVjNzNhNzItNjc1ZC00YTJjLWI2MjctMDc4MmMxOGZkZGUxXkEyXkFqcGdeQXVyMTg0NTYyNjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001971","name":"Ewen Bremner","idIMDB":"nm0001971"},"actorId":"nm0001971","character":"Simon Damian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Benton","urlProfile":"http://www.imdb.com/name/nm0072949","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Nzk3NzkwMF5BMl5BanBnXkFtZTcwNjQyNzE1OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1965","placeOfBirth":" Guisborough, Cleveland, England, UK","height":"5' 11\" (1.8 m)","bio":"Mark Benton was born on November 16, 1965 in Guisborough, Cleveland, England. He is an actor, known for The Imaginarium of Doctor Parnassus (2009), Eddie the Eagle (2016) and Scoop (2009). He has been married to Sarah Gardner since 2002. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Nzk3NzkwMF5BMl5BanBnXkFtZTcwNjQyNzE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0072949","name":"Mark Benton","idIMDB":"nm0072949"},"actorId":"nm0072949","character":"Sheriff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hamish McColl","urlProfile":"http://www.imdb.com/name/nm0566100","urlPhoto":"","biography":{"dateOfBirth":"28 January 1962","placeOfBirth":"","bio":"Hamish McColl was born on January 28, 1962. He is an actor and writer, known for Paddington (2014), Mr. Bean's Holiday (2007) and Johnny English Reborn (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0566100","name":"Hamish McColl","idIMDB":"nm0566100"},"actorId":"nm0566100","character":"Innkeeper","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0258816","urlIMDB":"http://www.imdb.com/title/tt0258816","business":{"budget":null,"openingWeekend":[{"money":"$18,044","country":"USA","day":"07","month":"03","year":"2004","remarks":"5 Screens"}],"gross":[{"money":"$256,620","country":"USA","day":"20","month":"06","year":"2004","remarks":""},{"money":"$252,901","country":"USA","day":"13","month":"06","year":"2004","remarks":""},{"money":"$245,961","country":"USA","day":"06","month":"06","year":"2004","remarks":""},{"money":"$239,817","country":"USA","day":"30","month":"05","year":"2004","remarks":""},{"money":"$234,695","country":"USA","day":"23","month":"05","year":"2004","remarks":""},{"money":"$230,089","country":"USA","day":"16","month":"05","year":"2004","remarks":""},{"money":"$225,704","country":"USA","day":"09","month":"05","year":"2004","remarks":""},{"money":"$220,114","country":"USA","day":"02","month":"05","year":"2004","remarks":""},{"money":"$216,774","country":"USA","day":"25","month":"04","year":"2004","remarks":""},{"money":"$208,280","country":"USA","day":"18","month":"04","year":"2004","remarks":""},{"money":"$193,061","country":"USA","day":"11","month":"04","year":"2004","remarks":""},{"money":"$165,812","country":"USA","day":"04","month":"04","year":"2004","remarks":""},{"money":"$123,154","country":"USA","day":"28","month":"03","year":"2004","remarks":""},{"money":"$90,367","country":"USA","day":"21","month":"03","year":"2004","remarks":""},{"money":"$52,208","country":"USA","day":"14","month":"03","year":"2004","remarks":""},{"money":"$18,044","country":"USA","day":"07","month":"03","year":"2004","remarks":""}],"weekendGross":[{"money":"$1,362","country":"USA","day":"20","month":"06","year":"2004","remarks":"3 Screens"},{"money":"$5,212","country":"USA","day":"13","month":"06","year":"2004","remarks":"6 Screens"},{"money":"$5,631","country":"USA","day":"06","month":"06","year":"2004","remarks":"5 Screens"},{"money":"$3,663","country":"USA","day":"30","month":"05","year":"2004","remarks":"7 Screens"},{"money":"$3,211","country":"USA","day":"23","month":"05","year":"2004","remarks":"6 Screens"},{"money":"$2,065","country":"USA","day":"16","month":"05","year":"2004","remarks":"8 Screens"},{"money":"$2,894","country":"USA","day":"09","month":"05","year":"2004","remarks":"7 Screens"},{"money":"$1,225","country":"USA","day":"02","month":"05","year":"2004","remarks":"5 Screens"},{"money":"$3,998","country":"USA","day":"25","month":"04","year":"2004","remarks":"8 Screens"},{"money":"$8,976","country":"USA","day":"18","month":"04","year":"2004","remarks":"16 Screens"},{"money":"$14,312","country":"USA","day":"11","month":"04","year":"2004","remarks":"17 Screens"},{"money":"$34,018","country":"USA","day":"04","month":"04","year":"2004","remarks":"32 Screens"},{"money":"$18,974","country":"USA","day":"28","month":"03","year":"2004","remarks":"25 Screens"},{"money":"$26,289","country":"USA","day":"21","month":"03","year":"2004","remarks":"30 Screens"},{"money":"$25,821","country":"USA","day":"14","month":"03","year":"2004","remarks":"25 Screens"},{"money":"$18,044","country":"USA","day":"07","month":"03","year":"2004","remarks":"5 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 52 min (112 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.6","metascore":"49","filmingLocations":[{"location":"Edlesborough, Buckinghamshire, England, UK"}],"rated":"R","awards":[{"award":"MovieGuide Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Epiphany Prize","categories":[{"category":"Most Inspiring Movie","names":[]}]},{"titleAwardOutcome":"Nominated Grace Award","categories":[{"category":"Most Inspiring Movie Acting","names":[{"name":"Paul Bettany","id":"nm0079273","role":null}]}]}]}],"votes":"5,092","type":"Movie","companyCreditsSimple":[{"idCompany":"co0025370","name":"Kanzaman"},{"idCompany":"co0080794","name":"M.D.A. Films S.L."},{"idCompany":"co0053488","name":"Renaissance Films"}],"keywords":{"keywords":["murder","priest","actor","boy","monk","death","fugitive","england","lord","morality play","bible","village","deaf mute","1380s","14th century","clergy as detective","murder of a boy","government","drawn and quartered","leaving the priesthood","benedictine","bite","wagon stage","mute woman","renouncing the priesthood","sentenced to death","reference to st. christopher","deaf and dumb","art","biblical play","heron","bird","vote","mime","purse","rigor mortis","hanged by the neck","hanging","execution","scaffold","mortal sin","justice","evil","hope","trust","reference to adam and eve","stiltwalker","stilts","celebration","festival","secret","graveyard","burial","innkeeper","death of sister","murder of father","brother sister relationship","disgrace","campfire","torch","costume","mask","obsession","confessor","innocence","guilt","breast feeding","topless female nudity","bare breasts","female nudity","nudity","isolation","snow","disappearance","teenage boy","woods","minstrel","chase","mercy killing","father daughter relationship","father son relationship","travelling players","mute","sex with a priest","sex","strangulation","horse riding","horse","flashback","crucifix","fear","ad lib","living newspaper","improvisation","suffering","reference to god","shaved head","cross","brutality","arrest","theatre audience","investigation","knight","theatre","mystery play","liar","lie","drunkenness","drinking","drink","infidelity","unfaithfulness","extramarital affair","redemption","temptation","middle ages","on the run","wrongful conviction","false accusation","medieval times","winter","serial killer","penance","norman","nobleman","fire","dead body","church","cemetery","horse and cart","blood","axel","adultery","trial","sermon","theatre production","plague","lip reading","judge","funeral","forest","euthanasia","dungeon","dead boy","acting","pantomime","exhumation","ex priest","crime reenactment","amateur detective","male rape","theatrical troupe","death of mother","death of father","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:46:22"}}