{"data":{"movies":[{"title":"Taxi 3","originalTitle":"","year":"2003","releaseDate":"20030129","directors":[{"name":"Gérard Krawczyk","id":"nm0470443"}],"writers":[{"name":"Luc Besson","id":"nm0000108"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGJjYTc3YTgtOGM3Mi00ZjcxLWFhNzQtZTllNjAyZWQ4ZjQ4XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["France"],"languages":["French"],"genres":["Action","Comedy","Crime"],"plot":"A gang of thieves calling themselves the Santa Claus Gang are wreaking havoc, and the police can't keep up. Police Captain Gilbert is distracted by a Chinese reporter writing a story on his squad, detective Emilien's wife has just announced that she's pregnant, and taxi driver Daniel is in the midst of a relationship crisis. After a string of mistakes in which the thieves outsmart the police time and time again with a reporter there to record it all, Daniel and his super-taxi pitch in.","simplePlot":"Out to stop a new gang disguised as Santa Claus, Emilien and Daniel must also handle major changes in their personal relationships.","actors":[{"actorName":"Samy Naceri","urlProfile":"http://www.imdb.com/name/nm0618651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MTcwNTU5NV5BMl5BanBnXkFtZTYwNTg0ODgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1961","placeOfBirth":" Paris, France","birthName":"Saïd Naceri","height":"6' (1.83 m)","bio":"Samy Naceri was born on July 2, 1961 in Paris, France as Saïd Naceri. He is an actor, known for Taxi (1998), Taxi 2 (2000) and Léon: The Professional (1994). He has been married to Marie Guillard since 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MTcwNTU5NV5BMl5BanBnXkFtZTYwNTg0ODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0618651","name":"Samy Naceri","idIMDB":"nm0618651"},"actorId":"nm0618651","character":"Daniel Morales","urlCharacter":"http://www.imdb.com/character/ch0008901","main":true},{"actorName":"Frédéric Diefenthal","urlProfile":"http://www.imdb.com/name/nm0225899","urlPhoto":"","biography":{"dateOfBirth":"26 July 1968","placeOfBirth":" Saint-Mandé, Val-de-Marne, France","birthName":"Frédéric Pierre Diefenthal-Girau-Guyard","height":"5' 7¼\" (1.71 m)","bio":"Frédéric Diefenthal was born on July 26, 1968 in Saint-Mandé, Val-de-Marne, France as Frédéric Pierre Diefenthal-Girau-Guyard. He is an actor and producer, known for Taxi (1998), Taxi 2 (2000) and Taxi 3 (2003). He has been married to Gwendoline Hamon since May 2004. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0225899","name":"Frédéric Diefenthal","idIMDB":"nm0225899"},"actorId":"nm0225899","character":"Émilien Coutant-Kerbalec","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernard Farcy","urlProfile":"http://www.imdb.com/name/nm0267188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzIxMzQ0Ml5BMl5BanBnXkFtZTYwOTc3MDIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 4½\" (1.94 m)","bio":"Bernard Farcy is an actor, known for Taxi (1998), Taxi 2 (2000) and Taxi 3 (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzIxMzQ0Ml5BMl5BanBnXkFtZTYwOTc3MDIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267188","name":"Bernard Farcy","idIMDB":"nm0267188"},"actorId":"nm0267188","character":"Commissaire Gibert","urlCharacter":"http://www.imdb.com/character/ch0008912","main":true},{"actorName":"Bai Ling","urlProfile":"http://www.imdb.com/name/nm0000499","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU1NjE4NTIzMl5BMl5BanBnXkFtZTYwNDU5ODY3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1966","placeOfBirth":" Chengdu, China","height":"5' 3\" (1.6 m)","bio":"Born in the city of Cheng Du in southern China, Bai Ling began her career at age of 14. She enlisted In the Chinese People's Liberation Army, where she spent three years in a performance troupe entertaining soldiers stationed in Tibet. She first gained the attention of audiences and critics alike when she won the coveted lead role opposite Richard Gere in Jon Avnet's Red Corner (1997). She received numerous accolades including the prestigious Breakthrough Performance Award from the National Board of Review. She also garnered the Discovery Star awarded by the Hollywood Women's Press Club for their Golden Apple Awards. While developing her remarkable facility with the English language, she has worked with such prestigious filmmakers as Oliver Stone in Nixon (1995), George Lucas in Star Wars: Episode III - Revenge of the Sith (2005), Barry Sonnenfeld in Wild Wild West (1999), Spike Lee in She Hate Me (2004), Andy Tennant in Anna and the King (1999), Ang Lee in The Wedding Banquet (1993), Alex Proyas in The Crow (1994) and Luc Besson' in )Taxi 3 (2003)_, in which she spoke French. She also starred in Terrence Malick's Broadway production of \"Sansho the Bailiff\". She dazzled audiences with her portrayal of the sexy, mysterious Achara in the hit TV series Lost (2004), and intrigued viewers with her seductive yet exhilarating role in HBO's Entourage (2004). Bai Ling was awarded the Asian Oscar for her brilliant performance in her first Hong Kong film 3 extrêmes (2004). It also earned her an additional tre major awards in the Far East. She received the Spirit Diversity Award by The Hollywood Motion Picture Association. Her film Southland Tales (2006), directed by Richard Kelly was in competition at the Cannes Film Festival. Bai starred in and executive-produced Shanghai Baby (2007). She has worked with Taylor Hackford in Love Ranch (2010), co-starring with Helen Mirren and Joe Pesci, and had a leading role in the Jason Statham action comedy Crank: High Voltage (2009) with costar with Jason Statham.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU1NjE4NTIzMl5BMl5BanBnXkFtZTYwNDU5ODY3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000499","name":"Bai Ling","idIMDB":"nm0000499"},"actorId":"nm0000499","character":"Qiu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Wiklund","urlProfile":"http://www.imdb.com/name/nm0803558","urlPhoto":"","biography":{"dateOfBirth":"13 September 1968","placeOfBirth":" Stockholm, Sweden","height":"5' 9½\" (1.77 m)","bio":"Emma Wiklund was born on September 13, 1968 in Stockholm, Sweden. She is an actress, known for Taxi (1998), Taxi 2 (2000) and Taxi 3 (2003). She has been married to Hans Wiklund since February 12, 2003. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0803558","name":"Emma Wiklund","idIMDB":"nm0803558"},"actorId":"nm0803558","character":"Petra","urlCharacter":"http://www.imdb.com/character/ch0008908","main":true},{"actorName":"Marion Cotillard","urlProfile":"http://www.imdb.com/name/nm0182839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTEzNTkwNF5BMl5BanBnXkFtZTcwNzQ2NDIwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1975","placeOfBirth":" Paris, France","height":"5' 6½\" (1.69 m)","bio":"Academy Award-winning Actress Marion Cotillard was born on September 30, 1975 in Paris. Cotillard is the daughter of Jean-Claude Cotillard, an actor, playwright and director, and Niseema Theillaud, an actress and drama teacher. Her father's family is Breton and her mother has Kabyle ancestry. Raised in Orléans, France, she made her acting debut as a child with a role in one of her father's plays. She studied drama at the Conservatoire d'Art Dramatique in Orléans. After small appearances and performances in theater, Cotillard had occasional and minor roles in TV series such as Highlander (1992) and Extrême limite (1994), but her career as a film actress began in the mid-1990s. While still a teenager, Cotillard made her cinema debut at the age of 18 in the film L'histoire du garçon qui voulait qu'on l'embrasse (1994), and had small but noticeable roles in films such as Arnaud Desplechin's My Sex Life... or How I Got Into an Argument (1996) and Coline Serreau's comedy La belle verte (1996). In 1996, she had her first lead role in the TV film Chloé (1996), playing the title role - a teenage runaway who is forced into prostitution. Cotillard co-starred opposite Anna Karina, the muse of the Nouvelle Vague. In 1997, she won her first film award at the Festival Rencontres Cinématographiques d'Istres in France, for her performance as the young imprisoned Nathalie in the short film Affaire classée (1997). Her first prominent screen role was Lilly Bertineau in Gérard Pirès's box-office hit Taxi (1998), a role which she reprised in two sequels: Taxi 2 (2000) and Taxi 3 (2003), this role earned her first César award nomination (France's equivalent to the Oscar) for Most Promising Actress in 1999. In 1999, Cotillard starred as Julie Bonzon in the Swiss war drama War in the Highlands (1999). For her performance in the film, she won the Best Actress award at the Autrans Film Festival in France. In 2001, Marion starred in Les jolies choses (2001) as the twin sisters Marie and Lucie, and was nominated for her second César award for Most Promising Actress. Cotillard's breakthrough in France came in 2003, when she starred in Yann Samuell's dark romantic comedy Love Me If You Dare (2003), in which she played Sophie Kowalsky, the daughter of Polish immigrants who lives a love-hate relationship with her childhood friend. The film was a box-office hit in France, became a cult film abroad and led Cotillard to bigger projects. Her first Hollywood movie was Tim Burton's Big Fish (2003), in which she played Joséphine, the wife of William Bloom (played by Billy Crudup). A few years later, Marion starred in Ridley Scott's A Good Year (2006) playing Fanny Chenal, a French café owner who falls in love with Russell Crowe's character. In 2004, she won the Chopard Thophy of Female Revelation at the Cannes Film Festival. In 2005, Cotillard won the César award for Best Supporting Actress for her performance of Tina Lombardi in Jean-Pierre Jeunet's A Very Long Engagement (2004). In 2007, Cotillard received international recognition for her iconic portrayal of Édith Piaf in La Vie en Rose (2007). Director Olivier Dahan cast Cotillard to play the legendary French singer because to him, her eyes were like those of \"Piaf\". The fact that she can sing also helped Cotillard land the role of \"Piaf\", although most of the singing in the film is that of Piaf's. The role won Cotillard the Academy Award for Best Actress along with a César, a Lumière Award, a BAFTA Award, and a Golden Globe. That made her only the second actress to win an acting Oscar performing in a language other than English next to Sophia Loren (Two Women (1960)). Only two male performers (Roberto Benigni for Life Is Beautiful (1997) and Robert De Niro for The Godfather: Part II (1974)) have won an Oscar for solely non-English parts. Trevor Nunn called her portrayal of \"Piaf\" \"one of the greatest performances on film ever\". At the Berlin International Film Festival, where the film premiered, Cotillard was given a 15-minute standing ovation. When she won the César, Alain Delon presented the award and announced the winner as \"La Môme Marion\" (The Kid Marion), he also praised her at the stage saying: \"Marion, I give you this César. I think this César is for a great great actress, and I know what I'm talking about\". Cotillard has worked much more frequently in English-language movies following her Academy Award recognition. In 2009, she acted opposite Johnny Depp in Michael Mann's Public Enemies (2009), and later that year played Luisa Contini in Rob Marshall's musical Nine (2009) and received a Golden Globe nomination for her performance. Time magazine ranked her as the fifth best performance by a female in 2009. The following year, she took on the main antagonist role, Mal, in Christopher Nolan's Inception (2010), and in 2011 she had memorable parts in Midnight in Paris (2011) and Contagion (2011) and reteamed with Christopher Nolan in The Dark Knight Rises (2012). In 2011 and 2012 respectively, Cotillard appeared on the top of Le Figaro's list of the highest paid actors in France, it was the first time in nine years that a female topped the list. Cotillard was also the highest paid foreign actress in Hollywood. In 2012, Cotillard received wide-spread critical acclaim for her role as the legless orca trainer Stéphanie in Rust and Bone (2012). The film was a box office hit in France and received a ten-minute standing ovation at the end of its screening at the 65th Cannes Film Festival. Cotillard won the Globe de Cristal (France's equivalent to the Golden Globe), the Étoile d'Or award and was nominated for the Golden Globes, SAG, BAFTA, Critics' Choice and César Awards for her performance in the film. Cate Blanchett wrote an op-ed for Variety praising Cotillard's performance in \"Rust and Bone\", the two actresses competed for the Academy Awards for Best Actress in 2008, Cate was nominated for her performance in Elizabeth: The Golden Age (2007) and Marion for her performance in La Vie en Rose (2007) and Cotillard won the Oscar. She had her first leading role in an American movie in 2013, in James Gray's The Immigrant (2013), in which she played Ewa Cybulska, a Polish immigrant who wants to experience the American dream. Cotillard received wide-spread acclaim for her performance in the film at the 66th Cannes Film Festival, where the film premiered, and also won several critics awards. In 2014, Cotillard played Sandra in the Belgian film Deux jours, une nuit (2014) by the Dardenne brothers. Her performance was unanimously praised at the 67th Cannes Film Festival, earned several critics awards, Cotillard won her first European Award for Best Actress and also received her second Oscar nomination and her sixth César award nomination. In 2015, she played Lady Macbeth opposite Michael Fassbender in Justin Kurzel's Macbeth (2015) and voiced two animated movies: Le Petit Prince (2015) in which she voiced The Rose, and Avril et le monde truqué (2015), in which she voiced the lead role, Avril. Her upcoming films for 2016 are Nicole Garcia's Mal de pierres (2016), Xavier Dolan's It's Only the End of the World (2016), Justin Kurzel's Assassin's Creed (2016), in which she will work again with her Macbeth co-star, Michael Fassbender; and Robert Zemeckis's Allied (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTEzNTkwNF5BMl5BanBnXkFtZTcwNzQ2NDIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0182839","name":"Marion Cotillard","nicknames":["Simone"],"idIMDB":"nm0182839"},"actorId":"nm0182839","character":"Lilly Bertineau","urlCharacter":"http://www.imdb.com/character/ch0008905","main":true},{"actorName":"Edouard Montoute","urlProfile":"http://www.imdb.com/name/nm0600180","urlPhoto":"","biography":{"dateOfBirth":"20 December 1970","placeOfBirth":" Cayenne, French Guyana, France","bio":"Edouard Montoute was born on December 20, 1970 in Cayenne, French Guyana, France. He is an actor, known for Cut (2013), La Haine (1995) and Femme fatale (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0600180","name":"Edouard Montoute","idIMDB":"nm0600180"},"actorId":"nm0600180","character":"Alain","urlCharacter":"http://www.imdb.com/character/ch0008913","main":true},{"actorName":"Jean-Christophe Bouvet","urlProfile":"http://www.imdb.com/name/nm0003133","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjI0ODAyNl5BMl5BanBnXkFtZTgwMjM4MzYwMjE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1947","placeOfBirth":" Paris, France","height":"5' 7¾\" (1.72 m)","bio":"Jean-Christophe Bouvet was born on March 24, 1947 in Paris, France. He is an actor and writer, known for Taxi 2 (2000), Marie Antoinette (2006) and Taxi 3 (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjI0ODAyNl5BMl5BanBnXkFtZTgwMjM4MzYwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003133","name":"Jean-Christophe Bouvet","idIMDB":"nm0003133"},"actorId":"nm0003133","character":"Général Edmond Bertineau","urlCharacter":"http://www.imdb.com/character/ch0008914","main":true},{"actorName":"Léon-Pierre Mondini","urlProfile":"http://www.imdb.com/name/nm1421126","urlPhoto":"","biography":{"bio":"Léon-Pierre Mondini is an actor, known for Taxi 3 (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1421126","name":"Léon-Pierre Mondini","idIMDB":"nm1421126"},"actorId":"nm1421126","character":"Policier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernard Llopis","urlProfile":"http://www.imdb.com/name/nm0515817","urlPhoto":"","biography":{"bio":"Bernard Llopis is known for his work on Taxi 3 (2003), The Connection (2014) and Bye-Bye (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0515817","name":"Bernard Llopis","idIMDB":"nm0515817"},"actorId":"nm0515817","character":"Policier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean-Louis Schlesser","urlProfile":"http://www.imdb.com/name/nm0772287","urlPhoto":"","biography":{"dateOfBirth":"12 September 1948","placeOfBirth":" Nancy, France","bio":"Jean-Louis Schlesser was born on September 12, 1948 in Nancy, France. He is known for his work on Taxi 2 (2000), Taxi 3 (2003) and Taxi (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0772287","name":"Jean-Louis Schlesser","idIMDB":"nm0772287"},"actorId":"nm0772287","character":"Policier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean-Pierre Mas","urlProfile":"http://www.imdb.com/name/nm0556004","urlPhoto":"","biography":{"bio":"Jean-Pierre Mas is known for his work on Léon: The Professional (1994), The Fifth Element (1997) and Lucy (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0556004","name":"Jean-Pierre Mas","idIMDB":"nm0556004"},"actorId":"nm0556004","character":"Policier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Neugarten","urlProfile":"http://www.imdb.com/name/nm0626907","urlPhoto":"","biography":{"bio":"Michel Neugarten is known for his work on District B13 (2004), Ronin (1998) and Le transporteur 3 (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0626907","name":"Michel Neugarten","idIMDB":"nm0626907"},"actorId":"nm0626907","character":"Policier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrice Abbou","urlProfile":"http://www.imdb.com/name/nm0008081","urlPhoto":"","biography":{"dateOfBirth":"15 April 1967","placeOfBirth":" Lyon, Rhône, Rhône-Alpes, France","bio":"Patrice Abbou was born on April 15, 1967 in Lyon, Rhône, Rhône-Alpes, France. He is an actor, known for Taxi 3 (2003), En grande pompe (2008) and Roselyne and the Lions (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0008081","name":"Patrice Abbou","idIMDB":"nm0008081"},"actorId":"nm0008081","character":"Rachid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claude Sésé","urlProfile":"http://www.imdb.com/name/nm0785892","urlPhoto":"","biography":{"bio":"Claude Sésé is an actor, known for Taxi 3 (2003), Fat Girl (2001) and Les nouvelles filles d'à côté (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0785892","name":"Claude Sésé","idIMDB":"nm0785892"},"actorId":"nm0785892","character":"Planton","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0295721","urlIMDB":"http://www.imdb.com/title/tt0295721","business":{"budget":{"money":"€14,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"€319,193","country":"Spain","day":"18","month":"05","year":"2003","remarks":"131 Screens"}],"gross":[{"money":"$13,171,234","country":"France","day":"04","month":"02","year":"2003","remarks":""},{"money":"€911,900","country":"Spain","day":"08","month":"06","year":"2003","remarks":""},{"money":"€789,156","country":"Spain","day":"01","month":"06","year":"2003","remarks":""},{"money":"€598,928","country":"Spain","day":"25","month":"05","year":"2003","remarks":""},{"money":"€329,937","country":"Spain","day":"18","month":"05","year":"2003","remarks":""}],"weekendGross":[{"money":"€86,600","country":"Spain","day":"08","month":"06","year":"2003","remarks":"120 Screens"},{"money":"€150,972","country":"Spain","day":"01","month":"06","year":"2003","remarks":"125 Screens"},{"money":"€198,170","country":"Spain","day":"25","month":"05","year":"2003","remarks":"126 Screens"},{"money":"€319,193","country":"Spain","day":"18","month":"05","year":"2003","remarks":"131 Screens"}],"admissions":[{"money":"2,251,493","country":"France","day":"04","month":"02","year":"2003","remarks":""},{"money":"10,324","country":"Netherlands","day":"31","month":"12","year":"2003","remarks":""},{"money":"167,305","country":"Spain","day":"01","month":"06","year":"2003","remarks":""},{"money":"125,666","country":"Spain","day":"25","month":"05","year":"2003","remarks":""},{"money":"67,907","country":"Spain","day":"18","month":"05","year":"2003","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"ARP"},"technical":{"runtime":["1 hr 24 min (84 min)","1 hr 30 min (90 min) (Spain)"],"soundMix":["Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 535B, Zeiss Ultra Prime and Variable Prime Lenses"],"laboratory":null,"filmLength":["2,395 m (Switzerland)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.7","filmingLocations":[{"location":"USA"}],"rated":"NOT RATED","awards":[],"votes":"32,812","type":"Movie","companyCreditsSimple":[{"idCompany":"co0048273","name":"EuropaCorp"},{"idCompany":"co0050869","name":"ARP Sélection"},{"idCompany":"co0127526","name":"Apipoulaï"}],"keywords":{"keywords":["taxi","taxi driver","local blockbuster","marseille","third part","policeman","police officer","cameo","vomiting","speed control","skiing","sequel","santa claus suit","pregnancy","police station","ice hole","helicopter","car in pool","car crash","birth","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:41:11"}}