{"data":{"movies":[{"title":"Operation Dirty Dozen","originalTitle":"","year":"1967","directors":[{"name":"Ronald Saland","id":"nm0757541"}],"writers":[{"name":"Jay Anson","id":"nm0030663"}],"runtime":"9 min","countries":["USA"],"languages":["English"],"genres":["Short","Documentary"],"plot":"A short film looking behind the scenes at the making of (1967). Showing many scenes being filmed just north of London, the short focuses mostly on star enjoying his pursuits on his one day off a week. He enjoys watching motorcycle racing and spends some time in \"swinging sixties\" London with his fellow actors.","simplePlot":"A short film looking behind the scenes at the making of (1967). Showing many scenes being filmed just north of London, the short focuses mostly on star enjoying ... ","actors":[{"actorName":"Lee Marvin","urlProfile":"http://www.imdb.com/name/nm0001511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NDQ2MTE2MF5BMl5BanBnXkFtZTYwMTE2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1924","placeOfBirth":" New York City, New York, USA","birthName":"Lamont Waltman Marvin Jr","height":"6' 1½\" (1.87 m)","bio":"Prematurely white-haired character star who began as a supporting player of generally vicious demeanor, then metamorphosed into a star of both action and drama projects, Lee Marvin was born in New York City, the son of Courtenay Washington (Davidge), a fashion writer, and Lamont Waltman Marvin, an advertising executive. The young Marvin was thrown out of dozens of schools for incorrigibility. His parents took him to Florida, where he attended St. Leo's Preparatory School near Dade City. Dismissed there as well, he enlisted in the U.S. Marine Corps at the beginning of World War II. In the battle of Saipan in June 1944, he was wounded in the buttocks by Japanese fire which severed his sciatic nerve. He received a medical discharge and got menial work as a plumber's apprentice in Woodstock, NY. While repairing a toilet at the local community theater, he was asked to replace an ailing actor in a rehearsal. He was immediately stricken with a love for the theater and went to New York City, where he studied and played small roles in stock and Off-Broadway. He landed an extra role in Henry Hathaway's You're in the Navy Now (1951), and found his role expanded when Hathaway took a liking to him. Returning to the stage, he made his Broadway debut in \"Billy Budd\", and after a succession of small TV roles, moved to Hollywood, where he began playing heavies and cops in roles of increasing size and frequency. Given a leading role in Eight Iron Men (1952), he followed it with enormously memorable heavies in The Big Heat (1953) and The Wild One (1953). Now established as a major screen villain, Marvin began shifting toward leading roles with a successful run as a police detective in the TV series M Squad (1957). A surprise Oscar for his dual role as a drunken gunfighter and his evil, noseless brother in the western comedy Cat Ballou (1965) placed him in the upper tiers of Hollywood leading men, and he filled out his career with predominantly action-oriented films. A long-term romantic relationship with Michelle Triola led, after their breakup, to a highly publicized lawsuit in which Triola asked for a substantial portion of Marvin's assets. Her case failed in its main pursuit, but did establish a legal precedent for the rights of unmarried cohabitors, the so-called \"palimony\" law. Marvin continued making films of varying quality, always as a star, until his sudden death from a heart attack in 1987.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NDQ2MTE2MF5BMl5BanBnXkFtZTYwMTE2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001511","name":"Lee Marvin","idIMDB":"nm0001511"},"actorId":"nm0001511","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Cassavetes","urlProfile":"http://www.imdb.com/name/nm0001023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjI3NTgwM15BMl5BanBnXkFtZTYwMjg2MDM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1929","placeOfBirth":" New York City, New York, USA","birthName":"John Nicholas Cassavetes","height":"5' 7\" (1.7 m)","bio":"John Cassavetes was born on December 9, 1929 in New York City, New York, USA as John Nicholas Cassavetes. He was an actor and director, known for Rosemary's Baby (1968), The Dirty Dozen (1967) and Opening Night (1977). He was married to Gena Rowlands. He died on February 3, 1989 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjI3NTgwM15BMl5BanBnXkFtZTYwMjg2MDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001023","name":"John Cassavetes","idIMDB":"nm0001023"},"actorId":"nm0001023","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Brown","urlProfile":"http://www.imdb.com/name/nm0000987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDUzNDU3NF5BMl5BanBnXkFtZTcwNzg3MTI0NA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1936","placeOfBirth":" St. Simons Island, Georgia, USA","birthName":"James Nathaniel Brown","height":"6' 2\" (1.88 m)","bio":"Often mentioned as the greatest player in NFL history, this ruggedly handsome African American fullback for the Cleveland Browns first appeared on movie screens in the western Rio Conchos (1964), followed by a strong supporting role as convict commando \"Jefferson\" in the terrific WW2 action film The Dirty Dozen (1967). He was kept busy with additional on screen appearances in other fast paced films including Ice Station Zebra (1968), 100 Rifles (1969) and El Condor (1970). Brown's popularity grew during the boom of \"blaxploitation\" cinema in the early 1970s portraying tough \"no nonsense\" characters in Slaughter (1972), Black Gunn (1972) and Three the Hard Way (1974). His on-screen work in the latter part of the 1970s and 1980s was primarily centered around guest spots on popular TV shows such as CHiPs (1977) and Knight Rider (1982). However, Brown then resurfaced in better quality films beginning with his role as a fiery assassin in The Running Man (1987), he parodied the blaxploitation genre along with many other African-American actors in the comedy I'm Gonna Git You Sucka (1988), played an ex-heavyweight boxer in the sci-fi comedy Mars Attacks! (1996) and ironically played an ex-football legend in the Oliver Stone directed sports film Any Given Sunday (1999). Additionally, Jim Brown was a ringside commentator for the first six events of the Ultimate Fighting Championships from 1993 through to 1996. A bona fide legend in American sports and a successful actor, he continues to remain busy in front of the camera with recent appearances in various sports shows & TV productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDUzNDU3NF5BMl5BanBnXkFtZTcwNzg3MTI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000987","name":"Jim Brown","idIMDB":"nm0000987"},"actorId":"nm0000987","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clint Walker","urlProfile":"http://www.imdb.com/name/nm0907636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTk5OTc4OF5BMl5BanBnXkFtZTcwNzA0OTUwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1927","placeOfBirth":" Hartford, Illinois, USA","birthName":"Norman Eugene Walker","height":"6' 6\" (1.98 m)","bio":"Clint Walker was born Norman Eugene Walker in Hartford, southwestern Illinois, to Gladys Huldah (Schwanda), a Czech immigrant, and Paul Arnold Walker, who was from Arkansas. Walker almost single-handedly started the western craze on TV in the 1950s as Cheyenne Bodie in Cheyenne (1955). Growing up in the Depression era meant taking work wherever you could get it, and Walker found himself working at such jobs as Mississippi River boatman, carnival roustabout and golf caddy. He quit high school at 16 and at age 17 joined the Merchant Marine. After the war he worked his way cross country, including working in the oil fields in Brownwood, Texas, and wound up in California, where he worked as an undercover agent for a private detective agency on the Long Beach waterfront. After a while he took a job as a security officer at the Sands Hotel in Las Vegas. It was there that he met quite a few Hollywood people who told him that his size, physique and good looks would serve him well in Hollywood and that he should go to Los Angeles and give it a try. He met actor Henry Wilcoxon, who introduced him to director Cecil B. DeMille, and Walker found himself playing the part of a Captain of the Guard in The Ten Commandments (1956). Someone from Warner Bros. saw the film, found out that Walker was under contract to producer Hal B. Wallis, bought up Walker's contract and gave him the lead in \"Cheyenne\". The series was a huge hit and spawned countless other western series, from Warners and other studios. However, Walker was dissatisfied with the way Warners was handling his career -- they would let other contract players make films, for example, but he wasn't allowed to -- and that triggered a dispute which ended up with him taking a walk from the show. He and Warners eventually settled their disagreements. When the show ended Walker began to get supporting parts in features, his biggest and most successful one being The Dirty Dozen (1967). He starred in the well-received The Night of the Grizzly (1966) and the not-so-well received None But the Brave (1965), a WWII film that was Frank Sinatra's one and only stab at directing. He also played the lead in Baker's Hawk (1976), and turned in a good performance as a villain in the TV movie Scream of the Wolf (1974). Lately he and several of his colleagues from \"The Dirty Dozen\" provided the voices for the animated film Small Soldiers (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTk5OTc4OF5BMl5BanBnXkFtZTcwNzA0OTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907636","name":"Clint Walker","idIMDB":"nm0907636"},"actorId":"nm0907636","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Bronson","urlProfile":"http://www.imdb.com/name/nm0000314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzY5OTQwNV5BMl5BanBnXkFtZTYwMTcyOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1921","placeOfBirth":" Ehrenfeld, Pennsylvania, USA","birthName":"Charles Dennis Buchinsky","height":"5' 8½\" (1.74 m)","bio":"The archetypal screen tough guy with weatherbeaten features--one film critic described his rugged looks as \"a Clark Gable who had been left out in the sun too long\"--Charles Bronson was born Charles Buchinsky, one of 15 children of struggling parents in Pennsylvania. His mother, Mary (Valinsky), was born in Pennsylvania, to Lithuanian parents, and his father, Walter Buchinsky, was a Lithuanian immigrant coal miner. He completed high school and joined his father in the mines (an experience that resulted in a lifetime fear of being in enclosed spaces) and then served in WW II. After his return from the war, Bronson used the GI Bill to study art (a passion he had for the rest of his life), then enrolled at the Pasadena Playhouse in California. One of his teachers was impressed with the young man and recommended him to director Henry Hathaway, resulting in Bronson making his film debut in You're in the Navy Now (1951). He appeared on screen often early in his career, though usually uncredited. However, he made an impact on audiences as the evil assistant to Vincent Price in the 3-D thriller House of Wax (1953). His sinewy yet muscular physique got him cast in action-type roles, often without a shirt to highlight his manly frame. He received positive notices from critics for his performances in Vera Cruz (1954), Target Zero (1955) and Run of the Arrow (1957). Indie director Roger Corman cast him as the lead in his well-received low-budget gangster flick Machine-Gun Kelly (1958), then Bronson scored the lead in his own TV series, Man with a Camera (1958). The 1960s proved to be the era in which Bronson made his reputation as a man of few words but much action. Director John Sturges cast him as half Irish/half Mexican gunslinger Bernardo O'Reilly in the smash hit western The Magnificent Seven (1960), and hired him again as tunnel rat Danny Velinski for the WWII POW big-budget epic The Great Escape (1963). Several more strong roles followed, then once again he was back in military uniform, alongside Lee Marvin and Ernest Borgnine in the testosterone-filled The Dirty Dozen (1967). European audiences had taken a shine to his minimalist acting style, and he headed to the Continent to star in several action-oriented films, including Guns for San Sebastian (1968) (aka \"Guns for San Sebastian\"), the cult western Once Upon a Time in the West (1968) (aka \"Once Upon a Time in The West\"), Rider on the Rain (1970) (aka \"Rider On The Rain\") and, in one of the quirkier examples of international casting, alongside Japansese screen legend Toshirô Mifune in the western Red Sun (1971) (aka \"Red Sun\"). American audiences were by now keen to see Bronson back on US soil, and he returned triumphantly in the early 1970s to take the lead in more hard-edged crime and western dramas, including Cosa Nostra (1972) and the revenge western Chato's Land (1972). After nearly 25 years as a working actor, he became an 'overnight\" sensation. Bronson then hooked up with British director Michael Winner to star in several highly successful urban crime thrillers, including The Mechanic (1972) and Le cercle noir (1973). He then scored a solid hit as a Colorado melon farmer-done-wrong in Richard Fleischer's Mr. Majestyk (1974). However, the film that proved to be a breakthrough for both Bronson and Winner came in 1974 with the release of the controversial Death Wish (1974) (written with Henry Fonda in mind, who turned it down because he was disgusted by the script). The US was at the time in the midst of rising street crime, and audiences flocked to see a story about a mild-mannered architect who seeks revenge for the murder of his wife and rape of his daughter by gunning down hoods, rapists and killers on the streets of New York City. So popular was the film that it spawned four sequels over the next 20 years. Action fans could not get enough of tough guy Bronson, and he appeared in what many fans--and critics--consider his best role: Depression-era street fighter Chaney alongside James Coburn in Hard Times (1975). That was followed by the somewhat slow-paced western Breakheart Pass (1975) (with wife Jill Ireland), the light-hearted romp (a flop) From Noon Till Three (1976) and as Soviet agent Grigori Borsov in director Don Siegel's Cold War thriller Telefon (1977). Bronson remained busy throughout the 1980s, with most of his films taking a more violent tone, and he was pitched as an avenging angel eradicating evildoers in films like the 10 to Midnight (1983), L'enfer de la violence (1984), Assassination (1987) and Kinjite: Forbidden Subjects (1989). Bronson jolted many critics with his forceful work as murdered United Mine Workers leader Jock Yablonski in the TV movie Act of Vengeance (1986), gave a very interesting performance in the Sean Penn-directed The Indian Runner (1991) and surprised everyone with his appearance as compassionate newspaper editor Francis Church in the family film Yes Virginia, There Is a Santa Claus (1991). Bronson's final film roles were as police commissioner Paul Fein in a well-received trio of crime/drama TV movies Tel père... tel flic! (1995), Le justicier braque la mafia (1997) and Le justicier reprend les armes (1999). Unfortunately, ill health began to take its toll; he suffered from Alzheimers disease for the last few years of his life, and finally passed away from pneumonia at Los Angeles' Cedars-Sinai Medical Center in August 2003. Bronson was a true icon of international cinema; critics had few good things to say about his films, but he remained a fan favorite in both the US and abroad for 50 years, a claim few other film legends can make.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzY5OTQwNV5BMl5BanBnXkFtZTYwMTcyOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000314","name":"Charles Bronson","nicknames":["Il Brutto","Le Sacre Monstre"],"idIMDB":"nm0000314"},"actorId":"nm0000314","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Trini López","urlProfile":"http://www.imdb.com/name/nm0530382","urlPhoto":"","biography":{"dateOfBirth":"15 May 1937","placeOfBirth":" Dallas, Texas, USA","birthName":"Trinidad Lopez III","bio":"Trini Lopez is a American singer and actor who had 16 Top 40 songs on the charts from 1963 through 1968. He was born Trinidad López III in the Little Mexico neighborhood Dallas, Texas on May 15, 1937. He started performing with his own band when he was 15 years old and caught the eye of rock and roll legend Buddy Holly, who recommended him to a music producer who signed Lopez and his band, \"The Big Beats\", to Columbia Records. Lopez eventually quit \"The Big Beats\" to go solo, but none of the singles he cut made the charts. He moved to Los Angeles to audition as a vocalist for Holly's old band \"The Crickets\", but didn't get the job. Performing in night clubs, he was discovered by Frank Sinatra, who signed Lopez to his label, Reprise Records. His cover of \"If I Had a Hammer\" from his first album, which was released in 1963, made it to #3 on the charts, eventually earning a gold disc with sales exceeding one million copies. His other big hits were \"Lemon Tree\" and \"I'm Comin' Home, Cindy\", both of which made it to #2 on the Easy Listening chart, and \"Michael\", \"Gonna Get Along Without Ya Now\" and \"The Bramble Bush\", which made it to $7, #6 and #4, respectively. Lopez's acting career was essentially still-born when he walked off the set of The Dirty Dozen (1967) at the urging of Sinatra (who supposedly thought his music career would stall if he continued to wok on the movie, which had gone over its scheduled shooting date) or was fired by director Robert Aldrich for being disagreeable. He appeared infrequently as an actor over the next 10 years, mostly on television. In addition to singing and acting, Lopez designed two guitars for the Gibson Guitar Corporation, the Trini Lopez Standard and the Lopez Deluxe. Trini Lopez was inducted into the International Latin Music Hall of Fame in 2003.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0530382","name":"Trini López","idIMDB":"nm0530382"},"actorId":"nm0530382","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Telly Savalas","urlProfile":"http://www.imdb.com/name/nm0001699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MTUwOTQxOV5BMl5BanBnXkFtZTYwNTg1MTI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1922","placeOfBirth":" Garden City, Long Island, New York, USA","birthName":"Aristotelis Savalas","height":"5' 11\" (1.8 m)","bio":"Son of Greek immigrants. Soldier during World War II. Studied psychology. Worked as journalist for ABC News. The bald-headed actor played character roles, often as sadistic or psychotic types. He became a TV favorite in the 1970s when his role as Det. Theo Kojak in the TV movie Kojak: The Marcus-Nelson Murders (1973) was expanded into the gritty Kojak (1973) TV series, lasting from 1973-78.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MTUwOTQxOV5BMl5BanBnXkFtZTYwNTg1MTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001699","name":"Telly Savalas","nicknames":["Golden Greek"],"idIMDB":"nm0001699"},"actorId":"nm0001699","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Aldrich","urlProfile":"http://www.imdb.com/name/nm0000736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzYyNTA0NV5BMl5BanBnXkFtZTcwMjE2MjIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1918","placeOfBirth":" Cranston, Rhode Island, USA","birthName":"Robert Burgess Aldrich","bio":"Robert Aldrich entered the film industry in 1941 when he got a job as a production clerk at RKO Pictures. He soon worked his way up to script clerk, then became an assistant director, a production manager and an associate producer. He began writing and directing for TV series in the early 1950s, and directed his first feature in 1953 (Big Leaguer (1953)). Soon thereafter he established his own production company and produced most of his own films, collaborating in the writing of many of them. Among his best-known pictures are Kiss Me Deadly (1955), What Ever Happened to Baby Jane? (1962) and the muscular WW II mega-hit The Dirty Dozen (1967).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzYyNTA0NV5BMl5BanBnXkFtZTcwMjE2MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000736","name":"Robert Aldrich","nicknames":["Bob"],"idIMDB":"nm0000736"},"actorId":"nm0000736","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Hyman","urlProfile":"http://www.imdb.com/name/nm0405184","urlPhoto":"","biography":{"dateOfBirth":"1928","placeOfBirth":" New York City, New York, USA","bio":"Kenneth Hyman was born in 1928 in New York City, New York, USA. He is a producer, known for The Dirty Dozen (1967), What Ever Happened to Baby Jane? (1962) and The Hill (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0405184","name":"Kenneth Hyman","idIMDB":"nm0405184"},"actorId":"nm0405184","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0259477","urlIMDB":"http://www.imdb.com/title/tt0259477","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["9 min"],"soundMix":["Mono"],"color":["Color (Metrocolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"Albury, Surrey, England, UK"}],"awards":[],"votes":"140","type":"Movie","companyCreditsSimple":[{"idCompany":"co0015179","name":"Professional Film Services"}],"keywords":{"keywords":["behind the scenes","promotional","war filmmaking","drama filmmaking","action filmmaking","narration"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 06:04:24"}}