{"data":{"movies":[{"title":"Born to Be King","originalTitle":"Sheng zhe wei wang","year":"2000","releaseDate":"20000721","directors":[{"name":"Wai-Keung Lau","id":"nm0490487"}],"writers":[{"name":"Manfred Wong","id":"nm0939236"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTM3MTg5OF5BMl5BanBnXkFtZTcwNDI4NzYyMQ@@._V1.jpg","countries":["Hong Kong"],"languages":["Cantonese","English","Japanese","Min Nan","Mandarin"],"genres":["Crime","Thriller"],"plot":"Triad member Chicken is designated by Taiwan's San Luen Gang to marry Nanako, the daughter of the fifth generation leader of the Yamada Gang in Japan. Later, the leader of the triad group gets murdered. Actually, all the San Luen Gang members suspect Chicken attacked their leader Liu, in order to make a chance for him to rule the Gang and thus have adopted an extremely hostile attitude towards him...","simplePlot":"Triad member Chicken is designated by Taiwan's San Luen Gang to marry Nanako, the daughter of the fifth generation leader of the Yamada Gang in Japan. Later, the leader of the triad group ... ","actors":[{"actorName":"Ekin Cheng","urlProfile":"http://www.imdb.com/name/nm0155562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExOTU1MDMxMV5BMl5BanBnXkFtZTcwMTA4MjQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1967","placeOfBirth":" Hong Kong","height":"5' 10\" (1.78 m)","bio":"Ekin Cheng Yee-Kin is a Hong Kong actor and Cantopop singer. Earlier in his career he was known as Noodle Cheng, though he has now reverted to a more conventional-sounding first name. Sometimes he uses Dior (because that was what it sounded like when his younger sister tried to call him) as a first name but usually Ekin is the name used. Ekin began acting in commercials when he was in high school, the most well-known being for Hi-C Lemon Tea. After high school, he enrolled in TVB's Martial Arts school, but did not like it and switched to their acting school. After that he began to get a number of TV roles. The latest TVB series he participated in was Always Ready, working with Charmaine Sheh, Bowie Lam, and Linda Chung. Ekin was caught up in a grand scandal after leaving Maggie Siu, an actress whom he dated for many years, for a decade younger actress and singer Gigi Leung. Maggie was well-loved by Hong Kong audiences and gave up her career to support Ekin's career and many slighted him after the breakup. In 2006, Ekin and Gigi broke up, ending their seven-year relationship. In September 2006, Ekin and 'Yoyo Mung' begun dating through their mutual interest in badminton. His first film was Girls Without Tomorrow (1992) and at the time he was still going by the name Dior Cheng. He changed his name to Ekin before his breakout role in the Young and Dangerous series as Chan Ho Nam. The film led to 6 sequels, all starring Ekin Cheng, and a lucrative working partnership with director Andrew Lau. Together they went on to make The Storm Riders, which was the highest-grossing Hong Kong movie at the time and the first film to utilize a truly large number of special effects. They also worked together on The Legend of Speed, A Man Called Hero, The Duel and the comedy Women From Mars. Ekin has branched out in the roles he's taken, including more comedy like earlier in his career with My Wife is 18 and Six Strong Guys, while still doing more action-oriented films like The Twins Effect and Tokyo Raiders. Recently Ekin returned to the movie scene (having taking a break in 2005 to work on the Ultraman TV Series in Thailand), He had a brief appearance in My Name is Fame as himself. Soon after that he starred in Heavenly Mission a triad/cop thriller starring alongside Stephen Fung & Alex Fong. He has completed a Pang Brothers film called The Forest of Death, which will be released in March 2007. He is currently filming a serial in Mainland China based on the life of martial arts master, Huo Yuanjia with former Young & Dangerous co-star Jordan Chan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExOTU1MDMxMV5BMl5BanBnXkFtZTcwMTA4MjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0155562","name":"Ekin Cheng","idIMDB":"nm0155562"},"actorId":"nm0155562","character":"Chan Ho-Nam","urlCharacter":"http://www.imdb.com/character/ch0173580","main":true},{"actorName":"Jordan Chan","urlProfile":"http://www.imdb.com/name/nm0150952","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDkwYmZmMzctMDdjZC00NDk1LWE4OTMtMmNhMGVmNjgxZjMwXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1967","placeOfBirth":" Hong Kong","height":"5' 9½\" (1.77 m)","bio":"Jordan Chan was born on July 8, 1967 in Hong Kong. He is an actor, known for Ip Man: Le combat final (2013), Trivisa (2016) and Big Bullet (1996). He has been married to Cherrie Ying since February 14, 2010. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDkwYmZmMzctMDdjZC00NDk1LWE4OTMtMmNhMGVmNjgxZjMwXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0150952","name":"Jordan Chan","idIMDB":"nm0150952"},"actorId":"nm0150952","character":"Chicken Chiu","urlCharacter":"http://www.imdb.com/character/ch0173581","main":true},{"actorName":"Shin'ichi Chiba","urlProfile":"http://www.imdb.com/name/nm0002002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MzY4NDE4NF5BMl5BanBnXkFtZTcwMTA0NDQyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1939","placeOfBirth":" Fukuoka, Japan","birthName":"Sadaho Maeda","height":"5' 10½\" (1.79 m)","bio":"Pivotal figure in the 1970s explosion of martial arts cinema as lethal \"fists for hire\" trouble shooter, Takuma (Terry) Tsurugi, starring in the phenomenally popular and ultra violent \"The Street Fighter\" series of action films. Sonny Chiba wasn't a graceful, fluid fighter like screen icon Bruce Lee, but rather he was a ferocious machine that mowed down his opponents with his fists and feet, always with a menacing grimace on his face! Chiba was born Sadao Maeda in Fukuoka, Japan in 1939 and shared a house along with four other siblings to a father who was a military test pilot. As a youth, he was keen on both theatre and gymnastics, and was a talented enough athlete to score a position in the Japanese Olympic Team, until a chronic back injury finished his gymnastic aspirations. However, whilst at university he took a strong interest in karate under the guidance of the legendary \"Mas Oyama\", and soon earned his first black belt. However, his life took another turn, when in 1960 he was discovered during a talent search by Toei Studios, and he soon began his screen career under the name of \"Shinichi Chiba\", appearing as \"Space Chief\" in _Uchu Kaisoku-ken (1961)_ (aka \"Invasion of the Neptune Men). Over the next decade, Chiba busied himself with many appearances in Japanese crime thrillers and steadily built a reputation for playing hard men of few words and direct actions. With his martial arts proficiency in karate, judo & kenpo, he was in the box seat to take advantage of the early 1970s martial arts boom commenced by Chinese superstar Bruce Lee, and Chiba starred in the brutal and uncompromising The Street Fighter (1974) (aka \"The Streetfighter\"). The film has Chiba playing a mercenary style, street thug who will do anything for a price, and take on most anyone, including the Japanese Yakuza. The approach of the film was quite different from the Bruce Lee films in that Lee only eliminated his enemies when he was defending his friends or his honor. Quite the opposite, Chiba was only after a fistful of dollars for his deadly services and would engage in mortal combat for the highest bidder, although this often clouded his judgement to his own detriment. The only person \"The Street Fighter\" respects is his martial arts teacher, the short rotund, karate master \"Masaoko\" played by Masafumi Suzuki, who manages to easily out smart and out fight the frustrated Chiba! Upon its release, the film was roundly criticised for its excessive violence, including the amazing finale where a lethal blow to the ringleader's skull is shown in x-ray on screen. Fans didn't care, and they flocked in their thousands to see this economically made, yet eye catching chop socky spectacular. A sequel quickly followed with him back again in the messy production Return of the Street Fighter (1974) (aka \"Return of The Streetfighter\"), which was followed by a third Streetfighter movie also starring female martial arts dynamo Etsuko Shihomi in the gritty Sister Street Fighter (1974) (aka \"Sister Street Fighter\"), and then the fourth and final film in the series _Gyakushu Satsujin ken (1974)_ (aka \"The Street Fighters Last Revenge\"), which was arguably the best of all the sequels. Chiba had firmly established himself as a key anti-hero of Asian martial arts cinema who said little, and used his fists to sort out his troubles. With the demand high from keen action fans, he remained remarkably busy on screen for the next twenty years starring in numerous Japanese film & TV productions with an emphasis on bruising fights, samurai swords, Yakuza gangsters and pretty girls in trouble. Outside of Japan, the \"Street Fighter\" series of films has achieved enduring popularity through many midnight cult screenings, and their style heavily influenced a youthful indie filmaker named Quentin Tarantino. Tarantino has used strong references and imagery from the \"Street Fighter\" movies in several of his films including True Romance (1993) and _Pulp Fiction (1995)_. And when Tarantino came around to casting his mammoth Kill Bill: Vol. 1 (2003) project, he was awed to have Chiba accept the key role of the hot headed, and sometimes humourous, Okinawan sword maker \"Hattori Hanzo. Sonny Chiba has undoubtedly been a major figure and ongoing influence in the worldwide passion for martial arts movies for over thirty years, and he continues to actively contribute to the genre by encouraging & training young hopefuls seeking to make their mark on screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MzY4NDE4NF5BMl5BanBnXkFtZTcwMTA0NDQyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002002","name":"Shin'ichi Chiba","idIMDB":"nm0002002"},"actorId":"nm0002002","character":"Isako Kusaraki","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Qi Shu","urlProfile":"http://www.imdb.com/name/nm0795517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjAwNDIyNV5BMl5BanBnXkFtZTYwMzg1MTI1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1976","placeOfBirth":" Taipei, Taiwan","birthName":"Li-Hui Lin","height":"5' 6\" (1.68 m)","bio":"Born in Taiwan, Qi Shu has won the prestigious Golden Horse Awards in Taiwan (regarded as the East Asian Oscars) for Best Supporting Actress. She has also received a nomination for Best Actress from the Golden Horse Awards. She appeared with Jackie Chan in the romantic comedy Gorgeous (1999) (\"Gorgeous\"). Her name is spelled in a variety of ways, including Hsu Qi, Hsu Chi, Qi Shu, and Shu Kei, and there are quite a few other variations on her name on foreign V.C.D.s, D.V.D.s, and internet sites.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjAwNDIyNV5BMl5BanBnXkFtZTYwMzg1MTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0795517","name":"Qi Shu","idIMDB":"nm0795517"},"actorId":"nm0795517","character":"Mei Ling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Ho","urlProfile":"http://www.imdb.com/name/nm0387363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBhZWVhYjItYjM1ZS00NjdiLTlhODItZDE4YjZiYjEzYmEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1975","placeOfBirth":" Hong Kong","height":"6' 0¾\" (1.85 m)","bio":"Peter Ho was born on September 13, 1975 in Hong Kong. He is an actor, known for Sword Master (2016), Sophie's Revenge (2009) and Le roi singe (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBhZWVhYjItYjM1ZS00NjdiLTlhODItZDE4YjZiYjEzYmEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0387363","name":"Peter Ho","idIMDB":"nm0387363"},"actorId":"nm0387363","character":"Lui","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gigi Lai","urlProfile":"http://www.imdb.com/name/nm0481687","urlPhoto":"","biography":{"dateOfBirth":"1 October 1971","placeOfBirth":" Hong Kong","height":"5' 5\" (1.65 m)","bio":"Gigi Lai Chi, is a Hong Kong actress under contract to the TVB television channel. Gigi is very well known for her beautiful image and her love of beauty, the Hong Kong media has dubbed her the nickname \"Goddess of Beauty.\" In the past, Gigi would turn down roles if they affected her appearance on screen. But now Gigi has changed, placing greater emphasis on acting opportunities rather than the need to appear beautiful on screen. After entering th entertainment industry, Gigi first started out as a singer, she released many albums during the 1990s, in both Cantonese and Mandarin. Gigi has made several box office hits, especially for her role as the innocent and stuttering \"Smartie\" in the popular Young and Dangerous movies. She won the TVB Most Popular Actress Award in 2004 for her portrayal of a scheming and conniving concubine in the hit series \"War and Beauty\". Gigi has since become very popular with fans from Hong Kong and mainland China and many overseas countries.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0481687","name":"Gigi Lai","idIMDB":"nm0481687"},"actorId":"nm0481687","character":"Rong Yu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Tse","urlProfile":"http://www.imdb.com/name/nm0874864","urlPhoto":"","biography":{"dateOfBirth":"15 July 1967","placeOfBirth":" Hong Kong","height":"5' 10\" (1.78 m)","bio":"Michael Tse was born on July 15, 1967 in Hong Kong. He is an actor and composer, known for Turning Point (2009), Turning Point 2 (2011) and Young and Dangerous 3 (1996). He has been married to Tina Lee Tin Yan since 2005.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0874864","name":"Michael Tse","idIMDB":"nm0874864"},"actorId":"nm0874864","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandra Kwan Yue Ng","urlProfile":"http://www.imdb.com/name/nm0510950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmYjFhOGYtNjM4ZS00ZGY3LWExZWQtODk0ZmJiNjU1YmQ5XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1965","placeOfBirth":" Hong Kong, China","bio":"Sandra Kwan Yue Ng was born on August 2, 1965 in Hong Kong, China. She is an actress and producer, known for Echoes of the Rainbow (2010), Golden Chicken (2002) and Young and Dangerous: Portland Street Blues (1998). She is married to Peter Ho-Sun Chan. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmYjFhOGYtNjM4ZS00ZGY3LWExZWQtODk0ZmJiNjU1YmQ5XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0510950","name":"Sandra Kwan Yue Ng","idIMDB":"nm0510950"},"actorId":"nm0510950","character":"Sister 13","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Lamb","urlProfile":"http://www.imdb.com/name/nm0482970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTNiMDBiNWItNzQyNC00ZDhmLTkwYjAtN2U3MzhkZTdkZTE5L2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1970","placeOfBirth":" Hong Kong","bio":"Jerry Lamb was born on September 29, 1970 in Hong Kong. He is an actor, known for 3 go shou shang de jing cha (1996), Young and Dangerous 3 (1996) and Young and Dangerous 2 (1996). He has been married to Lily Hong since December 19, 2002. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTNiMDBiNWItNzQyNC00ZDhmLTkwYjAtN2U3MzhkZTdkZTE5L2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0482970","name":"Jerry Lamb","idIMDB":"nm0482970"},"actorId":"nm0482970","character":"Pou-pan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kar Lok Chin","urlProfile":"http://www.imdb.com/name/nm0157759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU5NDVlOGUtY2ZjNC00N2EyLTlkN2UtOThmNjRlOTlkMjJlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1965","placeOfBirth":" Hong Kong","height":"5' 7\" (1.7 m)","bio":"Kar Lok Chin was born on August 6, 1965 in Hong Kong. He is known for his work on Lust, Caution (2007), The Legend of Drunken Master (1994) and Cold War (2012). He has been married to Angela Ying-Ying Tong since November 13, 2012. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU5NDVlOGUtY2ZjNC00N2EyLTlkN2UtOThmNjRlOTlkMjJlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0157759","name":"Kar Lok Chin","idIMDB":"nm0157759"},"actorId":"nm0157759","character":"Big Head","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Chu","urlProfile":"http://www.imdb.com/name/nm0160836","urlPhoto":"","biography":{"bio":"Jason Chu is an actor, known for Young and Dangerous 3 (1996), Young and Dangerous (1996) and Young and Dangerous 2 (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0160836","name":"Jason Chu","idIMDB":"nm0160836"},"actorId":"nm0160836","character":"Jason","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roy Cheung","urlProfile":"http://www.imdb.com/name/nm0156559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzVjNmRhMTMtMzE4ZC00OTU0LWJlMTktNjI3MDI3YWNiNmZjXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1963","placeOfBirth":" Hong Kong, British Crown Colony","birthName":"Yiu-Yeung Cheung","height":"5' 11\" (1.8 m)","bio":"Roy Cheung was born on July 20, 1963 in Hong Kong, British Crown Colony as Yiu-Yeung Cheung. He is an actor, known for In the Mood for Love (2000), The mission (1999) and Exilé (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzVjNmRhMTMtMzE4ZC00OTU0LWJlMTktNjI3MDI3YWNiNmZjXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0156559","name":"Roy Cheung","idIMDB":"nm0156559"},"actorId":"nm0156559","character":"Akira Kusaraki","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anya","urlProfile":"http://www.imdb.com/name/nm0031704","urlPhoto":"","biography":{"dateOfBirth":"17 February 1976","placeOfBirth":" Taiwan","birthName":"Anya Wu","height":"5' 3¾\" (1.62 m)","bio":"Anya Wu was born on February 17th, in 1976 in Taiwan. She moved to the United States, together with her family, by the age of 6. She was raised in New York City and was discovered by a record company to become a singer back in Taiwan. While she was in Taiwan and preparing for her album release, Anya, became the first girl DJ in Taiwan clubs. She caught alot of media attention, even media from Hong Kong. With so much public attention, her interview in a magazine caught the eye of Director Jingle Ma, who then convinced Golden Harvest, a film production, distribution and exhibition company to relocate her to Hong Kong and sign her. Unfortunately, by the time they found her, he had already started \"Moi Moi Cha\", the movie in which he had wanted her for. So her debut film became Born To Be King, the final installment of the Young & Dangerous series,as Jordan Chan's wife, Nanako. Relocating to Hong Kong, Anya's profile has increased swiftly with Golden Harvest's support. She has since had larger roles in several of the studio's post-millenium efforts. She appeared as one of Ekin Cheng's many girls in For Bad Boys Only and in 2001 took more action-oriented roles in two hot action films. Sharp Guns and 2002, where her Fire Ghost menaced Stephen Fung and Nicholas Tse. She went on to become one of the top upcoming actresses in both Hong Kong and Taiwan and with her undoubtable gorgeous looks has also graced numerous magazine covers, print ads, and TV shows in both regions. In 2002, Anya began work on the \"remake/sequel\" to Naked Killer, titled Naked Weapon as Kat, the best friend to Charlene, Maggie Q's character. She also recently worked in HK on a stage play Glengarry Glenross in which she took on the challenging role of Blake that has been always played by a man. Tickets were sold out and another day had to be added. Afterwards, she starred in Tsui Hark's thriller Vampire Hunters as Sasa. After the liquidation of Golden Harvest's talent agency, Anya decided to go back to her native Taiwan and experiment on some TV series there. There she did starred in a TV series called Pink Godfather, as well as Taiwan's version of \"Sex And The City\" where she played \"Samantha\". After being there for a year, she realized that her focus was still more in films, and headed to join the fierce competitive, but growing industry in China. Being fluent in Chinese as well as English, her current works are on co-productions with China and foreign production companies.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0031704","name":"Anya","idIMDB":"nm0031704"},"actorId":"nm0031704","character":"Nanako","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Feng Chang","urlProfile":"http://www.imdb.com/name/nm2186174","urlPhoto":"","biography":{"dateOfBirth":"6 April 1923","placeOfBirth":" Harbin, China","bio":"Feng Chang was born on April 6, 1923 in Harbin, China. He is an actor and assistant director, known for The Warmth of an Old House (1984), Le Kid face au Lama (1980) and Chun shao yun kai (1968).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2186174","name":"Feng Chang","idIMDB":"nm2186174"},"actorId":"nm2186174","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kuang-Chien Chen","urlProfile":"http://www.imdb.com/name/nm5704286","urlPhoto":"","biography":{"bio":"Kuang-Chien Chen is an actor, known for Island of Greed (1997), Born to Be King (2000) and Burning Island 2 (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5704286","name":"Kuang-Chien Chen","idIMDB":"nm5704286"},"actorId":"nm5704286","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0265739","urlIMDB":"http://www.imdb.com/title/tt0265739","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.5","filmingLocations":[],"awards":[],"votes":"471","type":"Movie","companyCreditsSimple":[{"idCompany":"co0204379","name":"Artwell Productions"},{"idCompany":"co0050080","name":"B.O.B. and Partners"},{"idCompany":"co0035542","name":"GH Pictures"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:02:34"}}