{"data":{"movies":[{"title":"Secret Santa","originalTitle":"","year":"2003","releaseDate":"20031214","directors":[{"name":"Ian Barry","id":"nm0058018"}],"writers":[{"name":"Beth Polson","id":"nm0689848"},{"name":"Robert Tate Miller","id":"nm1086699"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDZmNTIyOTEtN2MxZS00MzVhLThhZDMtNDlhMzdiYjliNDE1XkEyXkFqcGdeQXVyNjExODE1MDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Family"],"plot":"Newspaper reporter Rebecca Chandler, who feels she got no fair chance to prove her worth in her three years career, looks forward to a Hawaian holiday with her fiancé Ryan, but instead of a ring he brings her- walking orders, he found better. So she accepts again to be the bachelor on duty in the Christmas season, and write the annual romantic non-news feel good-story, once more about the elusive Secret Santa in small-town Hamden, where the Christmas spirit it said to last all year. Bad luck follows her from Indianapolis: her car breaks down, she can only get lodgings in a home for the elderly without Internet, and nobody wants to help her unmask the secret Santa. Soon she guesses it must be the only rich philanthropist, but the popular Mr. John Martin Carter doesn't grant her an interview and isn't tricked either, in fact meets her at the worst repeatedly without her knowing him, until he arranges to be presented at the mayor's Christmas party, then invites her for dinner and proves ...","simplePlot":"Newspaper reporter Rebecca Chandler, who feels she got no fair chance to prove her worth in her three years career, looks forward to a Hawaian holiday with her fiancé Ryan, but instead of a... ","actors":[{"actorName":"Jennie Garth","urlProfile":"http://www.imdb.com/name/nm0001259","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgxMDYxNDgxNl5BMl5BanBnXkFtZTcwODMwNjk0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1972","placeOfBirth":" Urbana, Illinois, USA","birthName":"Jennifer Eve Garth","height":"5' 5\" (1.65 m)","bio":"Jennifer Eve Garth was born on April 3rd, 1972 in Urbana, Illionis, USA to John and Carolyn Garth, who both had 3 children each from different marriages, before they had Jennie. She grew up on a 25-acre horse ranch outside Urbana, Illinois with her 6 older siblings: Johnny, Chuck, Lisa, Cammie, Wendy and Lynn. When Jennie was 13, she and her family moved to Phoenix, Arizona. She took dancing lessons and did a little modeling while living in Arizona, and she dreamed of going to college and later start her own dance studio. At age 15, Jennie was discovered and encouraged to pursue an acting career by a talent scout, who had seen her win a talent competition. Therefore, she dropped out of high school during her junior year, and she and her mom moved to Los Angeles, California so she could become an actress. She later obtained her diploma in California. There, she started taking acting classes and went to auditions almost every day. After living in LA for about four months, she landed the role of 'Ericka McCray' on the NBC series A Brand New Life (1989). Within a year, she was cast as 'Kelly Taylor' on the long-running hit teen drama-series Beverly Hills, 90210 (1990) on FOX television. Ever since, she has starred in several movies made for TV, a number of which she has produced and directed herself. On January 20th, 2001, she married actor Peter Facinelli, the father of her first daughter, Luca Bella (born June 29th, 1997), on her ranch in Santa Barbara, California. On December 6th, 2002, Jennie and Peter welcomed their second daughter, Lola Ray and their third daughter Fiona Eve on September 30th, 2006. Jennie most recently starred in the WB network sitcom What I Like About You (2002) as 'Valerie Tyler' until its cancellation in 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgxMDYxNDgxNl5BMl5BanBnXkFtZTcwODMwNjk0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001259","name":"Jennie Garth","idIMDB":"nm0001259"},"actorId":"nm0001259","character":"Rebecca Chandler","urlCharacter":"http://www.imdb.com/character/ch0119700","main":true},{"actorName":"Steven Eckholdt","urlProfile":"http://www.imdb.com/name/nm0248692","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzcxNDI1Ml5BMl5BanBnXkFtZTcwNzc1NTU0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1961","placeOfBirth":" Los Angeles, California, USA","height":"6' 2\" (1.88 m)","bio":"Steven Eckholdt was born on September 6, 1961 in Los Angeles, California, USA. He is an actor and producer, known for Message in a Bottle (1999), It's Like, You Know... (1999) and The Wonderful World of Disney: Santa Who? (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzcxNDI1Ml5BMl5BanBnXkFtZTcwNzc1NTU0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0248692","name":"Steven Eckholdt","nicknames":["Mr Perfect"],"idIMDB":"nm0248692"},"actorId":"nm0248692","character":"John Martin Carter","urlCharacter":"http://www.imdb.com/character/ch0119701","main":true},{"actorName":"Charles Robinson","urlProfile":"http://www.imdb.com/name/nm0732455","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MzU4NTAzNF5BMl5BanBnXkFtZTcwMjk5ODgxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1945","placeOfBirth":" Houston, Texas, USA","height":"6' 3\" (1.91 m)","bio":"In the late 1960's, Charlie attended, and was enrolled in, Studio 7, an acting school operated by Chris Wilson at the Houston Music Theatre. He stayed with Chris when the school was moved to another location in Southwest Houston where mainly children's theatre was presented. Charlie was cast in a made for TV production and soon moved to the Hollywood area where his career took off.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MzU4NTAzNF5BMl5BanBnXkFtZTcwMjk5ODgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732455","name":"Charles Robinson","idIMDB":"nm0732455"},"actorId":"nm0732455","character":"Russell","urlCharacter":"http://www.imdb.com/character/ch0119702","main":true},{"actorName":"Joel McKinnon Miller","urlProfile":"http://www.imdb.com/name/nm0571930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkxMDg3NzA5NV5BMl5BanBnXkFtZTgwOTA1MzI5OTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"A native of Minnesota, Joel McKinnon Miller had his first experiences as an actor in high school.He then went on to study opera and theatre at the University of Minnesota-Duluth. After college, Joel was invited to join John Houseman's The Acting Company, a classical theatre touring company based in New York City. For three years, he toured the U.S. performing in plays which included The Skin of Our Teeth, Much Ado About Nothing, As You Like It, A New Way to Pay Old Debts and the world premiere of Orchards, a collection of seven Chekhov short stories adapted into one-act plays by American playwrights John Guare, Spalding Gray, David Mamet, Michael Weller, Wendy Wasserstein, Samm-Art Williams and Cuban playwright Maria Irene Fornes. After touring, he continued to work off-Broadway at Joseph Papp's Public Theatre, Classical Stage Company, Theatre for a New Audience and in regional theatres which included the Hartford Stage Company and the Folger Shakespeare Theatre in Washington D.C. Joel moved to Los Angeles in 1991 and made his television debut on (the #1 rated show at that time), Murphy Brown. He has numerous television and film appearances to his credit, including - Everybody Loves Raymond, Cold Case, American Horror Story, Workaholics, Bones. Features - The Truman Show, Friday After Next, The Family Man as well as Super 8, directed by J.J. Abrams. In December 2010, Joel completed filming his fifth and final season on the HBO series Big Love. Currently he can be seen playing the role of Detective\"Scully\" on the hit FOX comedy Brooklyn Nine-Nine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkxMDg3NzA5NV5BMl5BanBnXkFtZTgwOTA1MzI5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571930","name":"Joel McKinnon Miller","idIMDB":"nm0571930"},"actorId":"nm0571930","character":"Harley","urlCharacter":"http://www.imdb.com/character/ch0119704","main":true},{"actorName":"Victor Raider-Wexler","urlProfile":"http://www.imdb.com/name/nm0706838","urlPhoto":"","biography":{"dateOfBirth":"31 December 1943","placeOfBirth":" Toledo, Ohio, USA","bio":"Victor Raider-Wexler was born on December 31, 1943 in Toledo, Ohio, USA. He is known for his work on The Pursuit of Happyness (2006), Minority Report (2002) and Dr. Dolittle 2 (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0706838","name":"Victor Raider-Wexler","idIMDB":"nm0706838"},"actorId":"nm0706838","character":"Bob","urlCharacter":"http://www.imdb.com/character/ch0119705","main":true},{"actorName":"Josh Randall","urlProfile":"http://www.imdb.com/name/nm0709620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjQ3OTQxOF5BMl5BanBnXkFtZTgwNzcwODk5MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1972","placeOfBirth":" Pacific Grove, California, USA","birthName":"Joshua R. Randall","height":"6' 3\" (1.91 m)","bio":"Josh Randall was born on January 27, 1972 in Pacific Grove, California, USA as Joshua R. Randall. He is an actor and writer, known for Ed (2000), Timber Falls (2007) and Boned (2015). He was previously married to Claire Rankin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MjQ3OTQxOF5BMl5BanBnXkFtZTgwNzcwODk5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0709620","name":"Josh Randall","idIMDB":"nm0709620"},"actorId":"nm0709620","character":"Ryan","urlCharacter":"http://www.imdb.com/character/ch0041096","main":true},{"actorName":"Kathryn Joosten","urlProfile":"http://www.imdb.com/name/nm0429760","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzNDkxMTU0N15BMl5BanBnXkFtZTcwODYwNTU5MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1939","placeOfBirth":" Chicago, Illinois, USA","birthName":"Kathryn Rausch","height":"5' 3\" (1.6 m)","bio":"Kathryn is best known for her portrayals of \"Karen McCluskey\" on Desperate Housewives (2004) on ABC and of \"Mrs. Landingham\", secretary to the President (Martin Sheen), on the critically-acclaimed NBC drama, The West Wing (1999). She has also recurred on Dharma & Greg (1997), and guest-starred on many hit television series, such as Becker (1998), Arli$$ (1996), Ally McBeal (1997), Providence (1999), Scrubs (2001) and over twenty other prime-time shows. Kathryn will also be seen later this year on ABC's daytime drama, General Hospital (1963). Her credits are impressive for any actor, let alone one that only began the craft at age 42. Although only put into action well into her middle years, Kathryn's dream began in her twenties, when her mother died of cancer in 1963. While dying in the hospital, her mother shared that her biggest regret was not following her dreams. Kathryn vowed, at that moment, that she would someday pursue her own dream of acting. At the time, she was entering into a new career as a psychiatric nurse in a medium security wing for disturbed teenagers. Through that job, she met and married a psychiatrist, gave birth to two boys and settled down as a suburban housewife in Lake Forest, Illinois, a well-to-do suburb of Chicago. But Kathryn never forgot her dream of acting, something that she never had time to pursue in-between caring for her children and husband. In 1980, her husband's alcoholism led Kathryn to a divorce and a difficult situation; a single mother with two young sons. Rather than lose hope, she took the opportunity to change her life forever and follow her lost dream. Kathryn took classes at Steppenwolf Theater in Chicago and performed at community theaters all over Northern Illinois. By day, she supported her family hanging wallpaper and painting the mansions of Lake Forest, working as a sales person for a Welcome Wagon company and using her contacts to book film and print locations in the houses she was painting. By night, Kathryn was improving her skills and moving from community theater to semi-professional theater. Her first break was in 1991. Disney held a cattle call for street performers for Disney World. After standing in line for five hours, Kathryn got the part and moved shop to Orlando, Florida. Though she was living behind an adult arcade in the \"tourist unfriendly\" part of Buena Vista, Kathryn was finally earning her living through performance and loving it. The part only lasted for a year and, once again, Kathryn was forced to supplement her acting income with other work -- bar-tending and catering during the day, theater at night. Though the acting gig was over, the move to Florida proved one thing to Kathryn...she had the talent to make it as an actor. She did it once and she could do it again. Unfortunately, it took her two and half years to realize it wouldn't happen in central Florida. In December 1995, Kathryn again packed a truck and drove to Hollywood. Although she didn't have an agent and had no contacts, Kathryn never hesitated following her dream. In only five months, she landed her first part...two lines in Family Matters (1989). In the six years since then, she has appeared in over a dozen plays, six movies, eleven national television commercials, two pilots, ten drama series and over twenty sitcoms. From her many roles, Kathryn is recognized as one of Murphy Brown (1988)'s secretaries, Frasier (1993)'s agent's mother and the bingo buddy to Drew Carey's girlfriend, on The Drew Carey Show (1995). But it is her portrayal of \"Mrs. Landingham\", the foil, friend and secretary to Martin Sheen's \"President Bartlet\" on The West Wing (1999) that propelled her into the spotlight she truly deserves. She followed that up with her last huge roll as Karen McCluskey for 8 seasons on ABC's Desperate Housewives (2004), which won her two Emmy awards. Joosten made a guest appearance on CBS daytime soap The Bold and the Beautiful as part of the show's 6000th episode, which featured several other real-life lung cancer survivors discussing their experiences. She was named the national spokesperson for the Lung Cancer Profiles campaign on behalf of Pfizer. Joosten died of lung cancer on the morning of June 2, 2012. Her death happened 20 days after the onscreen death of her character Karen McCluskey on the final episode of Desperate Housewives. The hit show ended its eight-year run on ABC last month with a series finale in which Joosten's character passed away. Her character's battle with brain cancer was a story line in the show.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzNDkxMTU0N15BMl5BanBnXkFtZTcwODYwNTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0429760","name":"Kathryn Joosten","nicknames":["Kathy"],"idIMDB":"nm0429760"},"actorId":"nm0429760","character":"Winifred","urlCharacter":"http://www.imdb.com/character/ch0119706","main":true},{"actorName":"Sam Anderson","urlProfile":"http://www.imdb.com/name/nm0027402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0OTcwOTc5OF5BMl5BanBnXkFtZTcwNzUyMTk5Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1947","placeOfBirth":" South Dakota, USA","height":"5' 10\" (1.78 m)","bio":"Sam Anderson was born on April 2, 1947 in South Dakota, USA. He is an actor, known for Forrest Gump (1994), Water for Elephants (2011) and Devil's Due (2014). He has been married to Barbara Ann Hancock since August 17, 1985. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0OTcwOTc5OF5BMl5BanBnXkFtZTcwNzUyMTk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0027402","name":"Sam Anderson","idIMDB":"nm0027402"},"actorId":"nm0027402","character":"Mr. Gibson","urlCharacter":"http://www.imdb.com/character/ch0119707","main":true},{"actorName":"Marnette Patterson","urlProfile":"http://www.imdb.com/name/nm0005297","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTM4NjYyMF5BMl5BanBnXkFtZTcwNTMxOTcyMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Marnette Provost Patterson","height":"5' 6½\" (1.69 m)","bio":"Marnette Patterson is an American born actress who was raised in Los Angeles California. Her name is a combination of her two great aunt's: Mary and Nettie. Her aunt is Dana Dillaway, former child actress who appeared in Giant (1956) as Elizabeth Taylor and Rock Hudson's daughter Judy. She is a singer who started as a Junior Vocal Winner on \"Star Search\" when she was 9. She has worked in numerous film and television projects with the likes of Sharon Stone and Amy Adams. On September 4, 2011, Marnette married James Verzino, a Financial Advisor, at a Vineyard in Malibu. After a two year hiatus she returned to film opposite Bradley Cooper in Clint Eastwood's 'American Sniper'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTM4NjYyMF5BMl5BanBnXkFtZTcwNTMxOTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005297","name":"Marnette Patterson","idIMDB":"nm0005297"},"actorId":"nm0005297","character":"Callie","urlCharacter":"http://www.imdb.com/character/ch0119708","main":true},{"actorName":"Cody Fleetwood","urlProfile":"http://www.imdb.com/name/nm1507813","urlPhoto":"","biography":{"bio":"Cody Fleetwood is an actor, known for Fat Albert (2004), Secret Santa (2003) and Apartment 20 (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1507813","name":"Cody Fleetwood","idIMDB":"nm1507813"},"actorId":"nm1507813","character":"Scotty","urlCharacter":"http://www.imdb.com/character/ch0119709","main":true},{"actorName":"Barbara Billingsley","urlProfile":"http://www.imdb.com/name/nm0082511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTA1NjA0Nl5BMl5BanBnXkFtZTcwMzUwNjAwNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1915","placeOfBirth":" Los Angeles, California, USA","birthName":"Barbara Lillian Combes","height":"5' 5\" (1.65 m)","bio":"Born Barbara Lillian Combes, she attended Los Angeles Junior College in the mid-1930s and then moved to New York City, where she worked as a model. In 1945, she received a contract from MGM, and she appeared in several films during the late 1940s and 1950s, sometimes without screen credit. In the 1950s, she turned to television and appeared in shows including the sitcoms Professional Father (1955) and The Box Brothers (1956), as well as guest-starring on \"The Abbott and Costello Show\", the David Niven anthology series, Four Star Playhouse (1952), and the sitcom, Mr. Adams and Eve (1957). In 1957, Billingsley began starring in the sitcom, Leave It to Beaver (1957), as \"June Cleaver\", mother to \"Wally\" and \"Theodore\", nicknamed \"Beaver\". She appeared in her most famous role for 234 episodes, remaining with the show until it ended after six seasons. After 17 years of semi-retirement, Billingsley returned to movies in 1980's Airplane! (1980), creating another iconic role by spoofing her wholesome image with a brief appearance in this send-up of 1970s disaster movies, as a middle-aged white passenger who could translate between a white stewardess and two African-American passengers, because \"I speak jive\". She also appeared in The New Leave It to Beaver (1983), which ran from 1983 to 1989, and voiced the character of \"Nanny\" in the Muppet Babies (1984) cartoon series, from 1984 to 1991. Billingsley continued to act occasionally, including appearances on the sitcoms, Roseanne (1988) and Empty Nest (1988), and died at her home, after having dealt for several years with the effects of a rheumatoid disease.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTA1NjA0Nl5BMl5BanBnXkFtZTcwMzUwNjAwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0082511","name":"Barbara Billingsley","idIMDB":"nm0082511"},"actorId":"nm0082511","character":"Miss Ruthie","urlCharacter":"http://www.imdb.com/character/ch0119710","main":true},{"actorName":"Marilyn O'Connor","urlProfile":"http://www.imdb.com/name/nm0640429","urlPhoto":"","biography":{"bio":"Marilyn O'Connor was born in Duluth, Minnesota, USA. She was an actress, known for Secret Santa (2003), Song of the Vampire (2001) and Get Outta Town (1960). She was married to Charles Davis. She died on November 13, 2011 in Simi Valley, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0640429","name":"Marilyn O'Connor","idIMDB":"nm0640429"},"actorId":"nm0640429","character":"Betty","urlCharacter":"http://www.imdb.com/character/ch0119711","main":true},{"actorName":"Fiona Hale","urlProfile":"http://www.imdb.com/name/nm0354902","urlPhoto":"","biography":{"dateOfBirth":"7 February 1926","placeOfBirth":" New York, USA","birthName":"Fiona Campbell Shields","bio":"Fiona Hale was born on February 7, 1926 in New York, USA as Fiona Campbell Shields. She was an actress, known for The Curious Case of Benjamin Button (2008), Seven Pounds (2008) and Minority Report (2002). She died on April 22, 2014.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0354902","name":"Fiona Hale","idIMDB":"nm0354902"},"actorId":"nm0354902","character":"Beatrice","urlCharacter":"http://www.imdb.com/character/ch0119712","main":true},{"actorName":"Nick Pietropaolo","urlProfile":"http://www.imdb.com/name/nm1515911","urlPhoto":"","biography":{"bio":"Nick Pietropaolo is known for his work on Secret Santa (2003) and Lana Turner... a Daughter's Memoir (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1515911","name":"Nick Pietropaolo","idIMDB":"nm1515911"},"actorId":"nm1515911","character":"The maitre'd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John A. Keim","urlProfile":"http://www.imdb.com/name/nm0445106","urlPhoto":"","biography":{"bio":"John A. Keim is known for his work on Pirates of the Caribbean: At World's End (2007), Austin Powers in Goldmember (2002) and The Midnight Meat Train (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0445106","name":"John A. Keim","idIMDB":"nm0445106"},"actorId":"nm0445106","character":"Santa Claus","urlCharacter":"http://www.imdb.com/character/ch0004985","main":true}],"seasons":[],"idIMDB":"tt0369910","urlIMDB":"http://www.imdb.com/title/tt0369910","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"2003 Madison Avenue Productions, Inc."},"technical":{"runtime":["1 hr 40 min (100 min) (Brazil)","2 hr (120 min) (including commercials) (USA)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Laser Pacific Media Corporation, Los Angeles (CA), USA"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","filmingLocations":[{"location":"Los Angeles, California, USA"}],"awards":[{"award":"Accolade Competition 2005","titlesAwards":[{"titleAwardOutcome":"Won Award of Excellence","categories":[{"category":"Original Score","names":[{"name":"Alan Williams","id":"nm0002765","role":null}]},{"category":"Original Score/Music","names":[{"name":"Alan Williams","id":"nm0002765","role":null}]}]}]},{"award":"Character and Morality in Entertainment Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won Camie","categories":[{"category":"","names":[{"name":"Robert Tate Miller","id":"nm1086699","role":"screenplay"},{"name":"Charles Robinson","id":"nm0732455","role":"actor"},{"name":"Jennie Garth","id":"nm0001259","role":"actress"},{"name":"Victor Raider-Wexler","id":"nm0706838","role":"actor"},{"name":"Kathryn Joosten","id":"nm0429760","role":"actress"},{"name":"Joel McKinnon Miller","id":"nm0571930","role":"actor"},{"name":"Steven Eckholdt","id":"nm0248692","role":"actor"},{"name":"Barbara Billingsley","id":"nm0082511","role":"actress"},{"name":"Sam Anderson","id":"nm0027402","role":"actor"},{"name":"Cody Fleetwood","id":"nm1507813","role":"actor"},{"name":"Ian Barry","id":"nm0058018","role":"director"}]}]}]}],"votes":"529","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0028056","name":"Madison Avenue Productions Inc."},{"idCompany":"co0007433","name":"Polson Company, The"}],"keywords":{"keywords":["christmas"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:36:14"}}