{"data":{"movies":[{"title":"Glory Road","originalTitle":"","year":"2006","releaseDate":"20060113","directors":[{"name":"James Gartner","id":"nm1595280"}],"writers":[{"name":"Christopher Cleveland","id":"nm1480450"},{"name":"Bettina Gilois","id":"nm0319619"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MDY4OTE1N15BMl5BanBnXkFtZTcwOTI5OTMzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama","Sport"],"plot":"In 1965, the coach of the high school girl basketball team Don Haskins is invited by the Texas Western Miners to be their coach. Despite the lack of budget, Haskins sees the chance to dispute the NCAA and moves with his wife and children to the college dormitory. He recruits seven talented and rejected black players to play with five Caucasian players and formed a legendary team that won the 1966 national championship against the powerful Kentucky.","simplePlot":"In 1966, Texas Western coach Don Haskins led the first all-black starting line-up for a college basketball team to the NCAA national championship.","actors":[{"actorName":"Josh Lucas","urlProfile":"http://www.imdb.com/name/nm0524197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkzOTAzMV5BMl5BanBnXkFtZTcwMTE3Mjc4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1971","placeOfBirth":" Fayetteville, Arkansas, USA","birthName":"Joshua Lucas Easy Dent Maurer","height":"5' 11½\" (1.82 m)","bio":"Josh Lucas was born in Little Rock, Arkansas, to Michele (LeFevre), a nurse midwife, and Don Maurer, an ER doctor. Lucas' film career began by accident in 1979 when a small Canadian film production shot on the tiny coastal South Carolina Island, Sullivan's Island, where Lucas and his family lived. Unbeknownst to the filmmakers, 8 year old Lucas was hiding in the sand dunes watching filming during the climatic scene where teenage lovers engage in a lovesick fight. It was during this experience that Lucas decided to pursue a career in film which he has now done for nearly 3 decades. Born to young radical politically active parents in Arkansas in 1971, Lucas spent his early childhood nomadically moving around the southern U.S. The family finally settled in Gig Harbor, Washington, where Lucas attended high school. The school had an award winning drama/debate program and Lucas won the State Championship in Dramatic Interpretation and competed at the 1989 National Championship. Brief stints in professional theater in Seattle followed before Lucas moved to Los Angeles. After receiving breaks playing a young George Armstrong Custer in the Steven Spielberg produced Class of '61 (1993) and Frank Marshall's film Alive (1993), Lucas' career toiled in minor TV appearances. Frustrated, he decided to start over and relocated to New York City. In NYC, Lucas studied acting for years under Suzanne Shepherd and worked in smaller theater productions like Shakespeare in the Parking Lot before receiving another break in 1997 when he was cast as Judas in Terrence McNally's controversial off-Broadway production Corpus Christi. The play led to his being cast in the films You Can Count on Me (2000) and American Psycho (2000). These films were followed by interesting performances in the Oscar-winning A Beautiful Mind (2001) and the box office hit Sweet Home Alabama (2002). Lucas has since worked with many of the film community's greatest talents. He starred alongside Jon Voight in Jerry Bruckheimer's Glory Road (2006), for which Lucas added 40 pounds to transform himself into legendary basketball coach Don Haskins. Lucas also starred with Kurt Russell and Richard Dreyfuss in Wolfgang Petersen's Poseidon (2006). He starred with Morgan Freeman and Robert Redford in Lasse Hallström's An Unfinished Life (2005). He also starred opposite Jamie Bell in David Gordon Green's Undertow (2004), which was also produced by Terrence Malick. Additionally, Lucas worked alongside Christopher Walken in Around the Bend (2004). He performed with Jennifer Connelly and Eric Bana in Ang Lee's Hulk (2003). Other credits include Wonderland (2003), The Deep End (2001), American Psycho (2000), Session 9 (2001) and You Can Count on Me (2000). Lucas' theater credits include the off-Broadway run of \"Spalding Gray: Stories Left to Tell\"; Tennessee Williams' \"The Glass Menagerie\", which appeared on Broadway in 2005; Terrence McNally's \"Corpus Christi\" at the Manhattan Theater Club; Christopher Shinn's \"What Didn't Happen\"; and \"The Picture of Dorian Gray\". Lucas has always been fascinated by documentaries and performed voice work with film legend Ken Burns on the documentary The War (2007), and also provided voice-over work for Operation Homecoming: Writing the Wartime Experience (2007), Trumbo (2007) and Resolved (2007). Lucas' first venture into production was Stolen (2009), in which he played the single father of a mentally challenged boy. The film was the first project to be produced through Lucas' production company, \"Two Bridges\". In the past few years, Lucas' films include The Lincoln Lawyer (2011), Daydream Nation (2010), Peacock (2010), as Charles Lindbergh in Clint Eastwood's film J. Edgar (2011), and the massive Australian box office and critical success Red Dog (2011), for which Lucas won Australia's best actor award (The I.F. Award). He also played Beat generation legend Neal Cassady in Big Sur (2013). He can be seen in Kevin Connolly's Dear Eleanor (2016), the upcoming Sundance festival film Little Accidents and the NY indie film The Mend.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkzOTAzMV5BMl5BanBnXkFtZTcwMTE3Mjc4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0524197","name":"Josh Lucas","idIMDB":"nm0524197"},"actorId":"nm0524197","character":"Don Haskins","urlCharacter":"http://www.imdb.com/character/ch0020842","main":true},{"actorName":"Derek Luke","urlProfile":"http://www.imdb.com/name/nm1035682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTcxMDMwOF5BMl5BanBnXkFtZTgwODc2ODI2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1974","placeOfBirth":" Jersey City, New Jersey, USA","height":"5' 11\" (1.8 m)","bio":"Derek Luke was born on April 24, 1974 in Jersey City, New Jersey, USA. He is an actor, known for Captain America: The First Avenger (2011), Antwone Fisher (2002) and Glory Road (2006). He has been married to Sophia Adella Luke since 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTcxMDMwOF5BMl5BanBnXkFtZTgwODc2ODI2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1035682","name":"Derek Luke","idIMDB":"nm1035682"},"actorId":"nm1035682","character":"Bobby Joe Hill","urlCharacter":"http://www.imdb.com/character/ch0020847","main":true},{"actorName":"Austin Nichols","urlProfile":"http://www.imdb.com/name/nm0629538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmQxODQ5M2YtMWZmZS00YjA3LWEwZjgtMTQ5Yjg4MGViZDJhL2ltYWdlXkEyXkFqcGdeQXVyMjI1NTI0NDk@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1980","placeOfBirth":" Ann Arbor, Michigan, USA","birthName":"Austin Don Nichols","height":"6' 3\" (1.91 m)","bio":"Austin Nichols was born in Ann Arbor, Michigan, and was raised in Austin, Texas until the age of 18, when he moved to Los Angeles to pursue a career in pictures. He graduated from the University of Southern California in 2002 with a degree in creative writing. Austin was also a competitive water skier, representing the U.S. Junior Water Ski Team in the Pan-American Championships in 1997. Was once ranked #3 in the World Junior Rankings list in the Tricks event and skied in the Junior U.S. Masters Championships twice. Despite this, Austin had to undergo rigorous training to beef up his legs for the role of \"Jake Hammond\" in Wimbledon (2004). He trained in Los Angeles with Murphy Jensen (1993 French Open Doubles champion with his brother Luke Jensen) for two months and then went to London for a month and trained with Pat Cash (1987 Wimbledon singles champ) prior to filming his role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmQxODQ5M2YtMWZmZS00YjA3LWEwZjgtMTQ5Yjg4MGViZDJhL2ltYWdlXkEyXkFqcGdeQXVyMjI1NTI0NDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629538","name":"Austin Nichols","idIMDB":"nm0629538"},"actorId":"nm0629538","character":"Jerry Armstrong","urlCharacter":"http://www.imdb.com/character/ch0020846","main":true},{"actorName":"Jon Voight","urlProfile":"http://www.imdb.com/name/nm0000685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTE3NDA3M15BMl5BanBnXkFtZTgwMDMyNTM1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1938","placeOfBirth":" Yonkers, New York, USA","birthName":"Jonathan Vincent Voight","height":"6' 2½\" (1.89 m)","bio":"Jon Voight was born on December 29, 1938 in Yonkers, New York, USA as Jonathan Vincent Voight. He is an actor, known for Mission: Impossible (1996), Heat (1995) and Transformers (2007). He was previously married to Marcheline Bertrand and Lauri Peters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTE3NDA3M15BMl5BanBnXkFtZTgwMDMyNTM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000685","name":"Jon Voight","idIMDB":"nm0000685"},"actorId":"nm0000685","character":"Adolph Rupp","urlCharacter":"http://www.imdb.com/character/ch0020843","main":true},{"actorName":"Evan Jones","urlProfile":"http://www.imdb.com/name/nm0428055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDg3MTAyMF5BMl5BanBnXkFtZTgwNTA1NjI5OTE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"bio":"Evan Jones is an actor, known for 8 Mile (2002), The Book of Eli (2010) and A Million Ways to Die in the West (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDg3MTAyMF5BMl5BanBnXkFtZTgwNTA1NjI5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428055","name":"Evan Jones","idIMDB":"nm0428055"},"actorId":"nm0428055","character":"Moe Iba","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Schin A.S. Kerr","urlProfile":"http://www.imdb.com/name/nm1687952","urlPhoto":"","biography":{"bio":"Schin A.S. Kerr is an actor, known for Glory Road (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1687952","name":"Schin A.S. Kerr","idIMDB":"nm1687952"},"actorId":"nm1687952","character":"David Lattin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alphonso McAuley","urlProfile":"http://www.imdb.com/name/nm1593505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0Nzk3MDc2MV5BMl5BanBnXkFtZTcwNDEzNjEwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Alphonso McAuley is an actor and director, known for Glory Road (2006), Walk of Shame (2014) and Pride (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0Nzk3MDc2MV5BMl5BanBnXkFtZTcwNDEzNjEwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1593505","name":"Alphonso McAuley","idIMDB":"nm1593505"},"actorId":"nm1593505","character":"Orsten Artis","urlCharacter":"http://www.imdb.com/character/ch0020853","main":true},{"actorName":"Mehcad Brooks","urlProfile":"http://www.imdb.com/name/nm1419635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTE0NzIzMF5BMl5BanBnXkFtZTcwMDgzNzQ2Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1980","placeOfBirth":" Austin, Texas, USA","birthName":"Mehcad Jason McKinley Brooks","height":"6' 4\" (1.93 m)","bio":"Mehcad Brooks continues to rise as one of Hollywood's most promising stars. Brooks was in USA's new drama Necessary Roughness (2011), in which he portrayed Terrence \"TK\" King, the star wide receiver for the Hawks who is becoming notorious for his frequent fumbles -- not to mention his regular run-ins with the law. He is forced into counseling which becomes the key that unlocks his troubled past and helps him on the path to healing. Audiences saw Brooks star as the much talked about \"Eggs\" on Alan Ball's HBO hit series True Blood (2008), opposite Anna Paquin and Stephen Moyer. He is a SAG Award winner for Outstanding Performance by an Ensemble in a Comedy Series on the ABC show Desperate Housewives (2004), playing the role of Alfre Woodard's son. It was his portrayal of character 'Matthew Applewhite' which led to an Image Award nominee for Outstanding Supporting Actor in a Comedy Series for his performance and his inclusion in Daily Variety's \"Ten Young Actors to Watch\" feature in August 2005. His film credits include the Paul Haggis film In the Valley of Elah (2007) opposite Tommy Lee Jones and Charlize Theron, and the Jerry Bruckheimer film for Disney, Glory Road (2006), which debuted at #1 at the box-office. The film, directed by James Gartner and written by Christopher Cleveland, tells the story of the 1966 college basketball team who was the first all-black starting line-up to win the NCAA national championship, and was led by Coach Don Haskins. Brooks portrays 'Harry Flournoy,' one of the star players of the team. Also starring is Josh Lucas as 'Coach Haskins.' An athlete himself, Brooks grew up in Austin, Texas where he was an All-State basketball player in addition to playing football and baseball. He was accepted into Yale University, but instead attended the University of Southern California to study at their prestigious School of Cinema-Television. He also modeled during his high school and college years. His first breaks came as guest-starring roles on Malcolm in the Middle (2000), Boston Public (2000), One on One (2001), Cold Case (2003) and Ghost Whisperer (2005). He also starred in the Disney television movie, Tiger Cruise (2004), ABC's legal drama The Deep End (2010) and ABC's docu-drama My Generation (2010). Brooks' more recent films include Just Wright (2010), a romantic sports comedy, Creature (2011), a thriller set in Baton Rouge, Louisiana directed by Fred Andrews, About Last Night (2014), romantic comedy starring Kevin Hart and Adulterers (2015). He is also starring in Supergirl (2015)'s pilot as James Olsen. In addition to acting, Brooks was also one of the four new faces of the notorious Calvin Klein underwear advertisements which were seen worldwide.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTE0NzIzMF5BMl5BanBnXkFtZTcwMDgzNzQ2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1419635","name":"Mehcad Brooks","nicknames":["Cad"],"idIMDB":"nm1419635"},"actorId":"nm1419635","character":"Harry Flournoy","urlCharacter":"http://www.imdb.com/character/ch0020849","main":true},{"actorName":"Sam Jones III","urlProfile":"http://www.imdb.com/name/nm0427389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDcxODUzM15BMl5BanBnXkFtZTcwNTkwMDgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1983","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Samuel L. Jones III","height":"5' 8\" (1.73 m)","bio":"Sam Jones III was born on April 29, 1983 in Boston, Massachusetts, USA as Samuel L. Jones III. He is an actor, known for Smallville (2001), Glory Road (2006) and Home of the Brave (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDcxODUzM15BMl5BanBnXkFtZTcwNTkwMDgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0427389","name":"Sam Jones III","idIMDB":"nm0427389"},"actorId":"nm0427389","character":"Willie Worsley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Damaine Radcliff","urlProfile":"http://www.imdb.com/name/nm1690482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjI1MjQ2M15BMl5BanBnXkFtZTcwNzE3MTAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1979","placeOfBirth":" Bronx, New York, USA","birthName":"Damaine Anthony Radcliff","height":"6' 5\" (1.96 m)","bio":"Out of the Highbridge section of the northern Bronx borough is the up-and-comer Damaine Radcliff. As a youth he was thought to have potentially excelled in two areas other than acting. While at IS 229 he was a part of the nationally ranked chess team (which coincidentally became a movie). His athletic prowess then shone as he became an All-City basketball star at Samuel Gompers High School. While at Milford Academy Prep he sustained an injury which preempted an athletic scholarship. It seems, luckily, that Damaine's star simply was meant to shine in another galaxy. Upon returning home he began pursuing another love, acting and filmmaking. He would write comedy skits and then film them with friends, family or anyone who happened to be walking down Macombs Road where the Radcliffs lived. It soon became common for people from the neighborhood to be recognized from a role in one of these skits which were then on DVDs, copied and circulating around the city. Damaine then began the grind of show biz. He began with doing tons of background/extra work, which he was able to parlay into a couple of PSA's and a Sprite Campaign. His big break could almost be considered a \"break-in.\" An acting buddy told him about auditions being held for a 'little' basketball movie and suggested that Damaine crash the audition. He did as his friend suggested and that little movie actually was Jerry Bruckhiemer's Glory Road. And the role was a lead portraying another Bronx native, legend Willie Cager. After months of filming and more months of waiting for release, the reward is the number one movie in America, which is drawing comparisons to great sports movies like \"Hoosiers.\" Damaine next appeared in \"Step Up\" with Channing Tatum, Jenna Dewan, platinum recording artists Mario Drew, Sidora and rapper/actor Heavy D, which was released in 2006. He also starred in an episode of \"Law and Order-Trail By Jury\" (Pattern of Conduct episode 1.6). Due to the nature of the business Damaine reluctantly had to move to Hollywood. Not to despair, he returns home often to extend his hand to those who were with him \"on the come up.\" His acting troupe, known as The Drama Unit, still collaborate with him on projects. He also gives back to the neighborhood by producing audition reels for kids who want to get into the business.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjI1MjQ2M15BMl5BanBnXkFtZTcwNzE3MTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1690482","name":"Damaine Radcliff","nicknames":["Maine"],"idIMDB":"nm1690482"},"actorId":"nm1690482","character":"Willie 'Scoops' Cager","urlCharacter":"http://www.imdb.com/character/ch0020848","main":true},{"actorName":"Emily Deschanel","urlProfile":"http://www.imdb.com/name/nm0221043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjY2OTYzM15BMl5BanBnXkFtZTcwNzM2Njg0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1976","placeOfBirth":" Los Angeles, California, USA","birthName":"Emily Erin Deschanel","height":"5' 9\" (1.75 m)","bio":"Emily Erin Deschanel (born October 11, 1976) is an American actress and producer. She is best known for starring in the Fox crime procedural comedy-drama series Bones as Dr. Temperance Brennan since 2005. Deschanel was born in Los Angeles, California, to cinematographer and director Caleb Deschanel and actress Mary Jo Deschanel (née Weir). Her younger sister is actress and singer-songwriter Zooey Deschanel. Her paternal grandfather was French, from Oullins, Rhône; her ancestry also includes Swiss, Dutch, English, Irish, and other French roots. Deschanel attended Harvard-Westlake and Crossroads School in Los Angeles before graduating from Boston University's Professional Actors Training Program with a Bachelor of Fine Arts in Theater. In 1994, Deschanel made her feature film debut in It Could Happen to You. Her next notable role was in Stephen King's Rose Red in 2002. Then she appeared in Cold Mountain, The Alamo, and Glory Road and was named one of \"six actresses to watch\" by Interview Magazine in 2004. In 2005, Deschanel won the role of Dr. Temperance Brennan with David Boreanaz as FBI agent Seeley Booth on the Fox crime procedural comedy-drama Bones, based on the novels and the career of forensic anthropologist and author Kathy Reichs that premiered on September 13, 2005. For her performance, she received a 2006 Satellite Award nomination and a 2007 Teen Choice Award nomination. Deschanel and Boreanaz served as co-producers at the start of the show's third season, before becoming producers in the middle of the show's fourth season. Deschanel, with Alyson Hannigan, Jaime King, Minka Kelly, and Katharine McPhee made a video slumber party featured on FunnyorDie.com to promote regular breast cancer screenings for the organization Stand Up 2 Cancer. In recent years, her passion for animal welfare has led her to providing the narration for My Child Is a Monkey and serving as an associate producer on the documentary film How I Became an Elephant. Deschanel ranked number 72 in The 2012 Hot 100 on AfterEllen. Deschanel is a vegan and a committed supporter of animal rights causes. She can be seen in an Access Hollywood video at the book launch event of Karen Dawn's Thanking the Monkey: Rethinking the Way We Treat Animals, discussing how vegetarian and vegan diets help the environment, and a video on the homepage of the book's website talking about the importance of animal rights. She collaborated with PETA on a video encouraging mothers to raise their children as vegans. In September 2014, she joined the board of directors at Farm Sanctuary. Deschanel was raised Roman Catholic, but is no longer practicing, and has expressed agnostic views, saying \"I am more of a spiritual person, if anything, and I am of the belief that we don't know, and I'm not going to pretend that I do.\" On September 25, 2010, Deschanel married It's Always Sunny in Philadelphia actor and writer David Hornsby in a small private ceremony in the Pacific Palisades area of Los Angeles. On September 21, 2011, Deschanel gave birth to their son Henry Lamar Hornsby. On June 8, 2015, she gave birth to their second son, Calvin. Deschanel is best friends with her Bones co-star Michaela Conlin, who plays her best friend Angela Montenegro on the show; she is also friends with her Bones co-star David Boreanaz with whom she has a strong working relationship.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjY2OTYzM15BMl5BanBnXkFtZTcwNzM2Njg0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0221043","name":"Emily Deschanel","idIMDB":"nm0221043"},"actorId":"nm0221043","character":"Mary Haskins","urlCharacter":"http://www.imdb.com/character/ch0020844","main":true},{"actorName":"Al Shearer","urlProfile":"http://www.imdb.com/name/nm0790412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMzg5MDk3MzNeQTJeQWpwZ15BbWU2MDMwMDAwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1977","placeOfBirth":" Columbus, Ohio, USA","height":"6' 4\" (1.93 m)","bio":"Al Shearer was born on August 14, 1977 in Columbus, Ohio, USA. He is an actor, known for Honey (2003), How High (2001) and Glory Road (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMzg5MDk3MzNeQTJeQWpwZ15BbWU2MDMwMDAwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0790412","name":"Al Shearer","nicknames":["Aly Al"],"idIMDB":"nm0790412"},"actorId":"nm0790412","character":"Nevil Shed","urlCharacter":"http://www.imdb.com/character/ch0020851","main":true},{"actorName":"Red West","urlProfile":"http://www.imdb.com/name/nm0922307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Nzk3NDc4OF5BMl5BanBnXkFtZTgwMDk5OTMxNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1936","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Robert Gene West","height":"6' 2\" (1.88 m)","bio":"Robert \"Red\" Gene West was a close friend of Elvis Presley and a member of Presley's inner circle, known as \"The Memphis Mafia\". He first met Elvis in high school, where he was a year behind him. West played football for the Memphis Tigers high school football team, boxed in the Golden Gloves and played football for Jones Junior College playing center. West lived with his mother, Lois West, in the Hurt Housing project in Memphis. West became Elvis's personal driver in driving Elvis and band members Scotty Moore, Bill Black and later D.J. Fontana to different cities in the South for live appearances from 1955 to 1956. West served in the US Marine Corps from 1956 to late 1958 and was stationed in Norfolk, Virginia, which allowed him to stay in contact with Elvis. On August 14, 1958, West's estranged father, Newton Thomas West, died, the same day as Elvis' mother, Gladys Presley. After Elvis' discharge from the US Army in 1960, West was employed as one of Elvis' bodyguards. Over the years Elvis bought West a number of vehicles as he became a world-famous celebrity. West also became a movie stuntman and appeared in 16 of Elvis' films in the 1960s, usually playing extras or bit and supporting parts. West married one of Elvis' secretaries, Pat West, on July 1, 1961. A man of many talents, West became a songwriter for songs that Elvis, Pat Boone, Ricky Nelson and Johnny Rivers recorded, including the classic tune \"Separate Ways\" for Elvis, which won a BMI Award. In addition to the Elvis movies, West appeared in three Robert Conrad TV series The Wild Wild West (1965), Black Sheep Squadron (1976) and The Duke (1979). During the 1970s West, his cousin Del 'Sonny' West and 'Dave Hebler' served as Elvis' bodyguards, in charge of his daily transportation and, especially, in keeping weirdo, or potentially dangerous, fans away from him. On July 13, 1976, Vernon Presley, Elvis' father, fired West, Sonny West and Hebler after criticizing what he believed to be their heavy-handed tactics. The three of them collaborated on a book about their lives as Elvis' bodyguards, which was published just two weeks before Elvis' death in 1977. West has since continued his acting and songwriting careers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Nzk3NDc4OF5BMl5BanBnXkFtZTgwMDk5OTMxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922307","name":"Red West","idIMDB":"nm0922307"},"actorId":"nm0922307","character":"Ross Moore","urlCharacter":"http://www.imdb.com/character/ch0020850","main":true},{"actorName":"Kip Weeks","urlProfile":"http://www.imdb.com/name/nm1399550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTA3OTgxMF5BMl5BanBnXkFtZTgwNTgwOTg2NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Kip Weeks is an actor, known for The Strangers (2008), Glory Road (2006) and On a Country Road (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTA3OTgxMF5BMl5BanBnXkFtZTgwNTgwOTg2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1399550","name":"Kip Weeks","idIMDB":"nm1399550"},"actorId":"nm1399550","character":"Togo Railey","urlCharacter":"http://www.imdb.com/character/ch0020852","main":true},{"actorName":"Mitch Eakins","urlProfile":"http://www.imdb.com/name/nm0247153","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMjU1NDI4MV5BMl5BanBnXkFtZTgwNDc1MjM1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mitch Eakins is an actor and assistant director, known for Glory Road (2006), 1968 Tunnel Rats (2008) and Evil Bong (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMjU1NDI4MV5BMl5BanBnXkFtZTgwNDc1MjM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247153","name":"Mitch Eakins","idIMDB":"nm0247153"},"actorId":"nm0247153","character":"Dick Myers","urlCharacter":"http://www.imdb.com/character/ch0020854","main":true}],"seasons":[],"idIMDB":"tt0385726","urlIMDB":"http://www.imdb.com/title/tt0385726","business":{"budget":null,"openingWeekend":[{"money":"$16,927,589","country":"USA","day":"15","month":"01","year":"2006","remarks":"2,222 Screens"}],"gross":[{"money":"$42,643,187","country":"USA","day":"07","month":"05","year":"2006","remarks":""},{"money":"$42,628,773","country":"USA","day":"30","month":"04","year":"2006","remarks":""},{"money":"$42,602,016","country":"USA","day":"23","month":"04","year":"2006","remarks":""},{"money":"$42,550,894","country":"USA","day":"16","month":"04","year":"2006","remarks":""},{"money":"$42,448,852","country":"USA","day":"09","month":"04","year":"2006","remarks":""},{"money":"$42,343,615","country":"USA","day":"02","month":"04","year":"2006","remarks":""},{"money":"$42,329,885","country":"USA","day":"26","month":"03","year":"2006","remarks":""},{"money":"$42,303,527","country":"USA","day":"19","month":"03","year":"2006","remarks":""},{"money":"$42,240,617","country":"USA","day":"12","month":"03","year":"2006","remarks":""},{"money":"$42,163,462","country":"USA","day":"05","month":"03","year":"2006","remarks":""},{"money":"$41,992,769","country":"USA","day":"26","month":"02","year":"2006","remarks":""},{"money":"$41,672,955","country":"USA","day":"19","month":"02","year":"2006","remarks":""},{"money":"$40,713,387","country":"USA","day":"12","month":"02","year":"2006","remarks":""},{"money":"$38,835,141","country":"USA","day":"05","month":"02","year":"2006","remarks":""},{"money":"$34,948,401","country":"USA","day":"29","month":"01","year":"2006","remarks":""},{"money":"$27,709,549","country":"USA","day":"22","month":"01","year":"2006","remarks":""},{"money":"$16,927,589","country":"USA","day":"15","month":"01","year":"2006","remarks":""}],"weekendGross":[{"money":"$9,762","country":"USA","day":"07","month":"05","year":"2006","remarks":"29 Screens"},{"money":"$18,166","country":"USA","day":"30","month":"04","year":"2006","remarks":"34 Screens"},{"money":"$25,493","country":"USA","day":"23","month":"04","year":"2006","remarks":"65 Screens"},{"money":"$50,954","country":"USA","day":"16","month":"04","year":"2006","remarks":"120 Screens"},{"money":"$102,314","country":"USA","day":"09","month":"04","year":"2006","remarks":"223 Screens"},{"money":"$7,981","country":"USA","day":"02","month":"04","year":"2006","remarks":""},{"money":"$15,547","country":"USA","day":"26","month":"03","year":"2006","remarks":"34 Screens"},{"money":"$26,331","country":"USA","day":"19","month":"03","year":"2006","remarks":"55 Screens"},{"money":"$42,744","country":"USA","day":"12","month":"03","year":"2006","remarks":"79 Screens"},{"money":"$108,317","country":"USA","day":"05","month":"03","year":"2006","remarks":"175 Screens"},{"money":"$225,564","country":"USA","day":"26","month":"02","year":"2006","remarks":"289 Screens"},{"money":"$561,951","country":"USA","day":"19","month":"02","year":"2006","remarks":"532 Screens"},{"money":"$1,146,550","country":"USA","day":"12","month":"02","year":"2006","remarks":"1,351 Screens"},{"money":"$2,840,287","country":"USA","day":"05","month":"02","year":"2006","remarks":"2,141 Screens"},{"money":"$5,345,859","country":"USA","day":"29","month":"01","year":"2006","remarks":"2,397 Screens"},{"money":"$8,769,735","country":"USA","day":"22","month":"01","year":"2006","remarks":"2,396 Screens"},{"money":"$16,927,589","country":"USA","day":"15","month":"01","year":"2006","remarks":"2,222 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"08","year":"2004","remarks":null},null],"copyrightHolder":"Copyright © 2006 Disney Enterprises, Inc. and Jerry Bruckheimer, Inc."},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":["SDDS","Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses","Arriflex Cameras"],"laboratory":["Company 3 (digital intermediate)","Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"7.2","metascore":"58","filmingLocations":[{"location":"Baton Rouge, Louisiana, USA"}],"rated":"PG","awards":[{"award":"Black Reel Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Best Screenplay, Original or Adapted","names":[{"name":"Christopher Cleveland","id":"nm1480450","role":null},{"name":"Bettina Gilois","id":"nm0319619","role":null}]},{"category":"Best Song","names":[{"name":"Alicia Keys","id":"nm1006024","role":"Performer"},{"name":"Lyfe Jennings","id":"nm2119272","role":"Performer"},{"name":"Curtis Mayfield","id":"nm0562631","role":"Writer"}]}]}]},{"award":"ESPY Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won ESPY","categories":[{"category":"Best Sports Movie","names":[]}]}]},{"award":"Hollywood Film Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Breakthrough Award","categories":[{"category":"Breakthrough Actor","names":[{"name":"Derek Luke","id":"nm1035682","role":null}]}]}]},{"award":"Humanitas Prize 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Humanitas Prize","categories":[{"category":"Feature Film Category","names":[{"name":"Christopher Cleveland","id":"nm1480450","role":null},{"name":"Bettina Gilois","id":"nm0319619","role":null}]}]}]}],"votes":"36,320","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0026281","name":"Jerry Bruckheimer Films"},{"idCompany":"co0185863","name":"Texas Western Productions"}],"keywords":{"keywords":["national championship","texas","coach","ncaa","college","basketball","dormitory","college basketball","basketball team","ends with historical notes","husband wife relationship","ends with real life photos","ends with biographical notes","basketball movie","beating","racial prejudice","racial discrimination","racial tension","civil rights","civil rights movement","coach player relationship","final","pep talk","heart condition","reference to david and goliath","reference to elijah muhammad","singing along with a record","reference to the harlem globetrotters","reference to smokey robinson","college recruitment","interracial conflict","what happened to epilogue","basketball coach","n word","racial slur","championship game","college coach","teenage boy","teenager","year 1966","two word title","underdog","race relations","sports team","threat","teamwork","single mother","scoreboard","respect","punishment","mother","discipline","bus","blood","bleachers","basketball game","washington state","stadium","seattle washington","racist","racism","mexico","lubbock texas","indiana","gary indiana","basketball court","arena","maryland","marriage","el paso texas","1960s","college sports","based on true story"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:24:25"}}