{"data":{"movies":[{"title":"Der Fall Gehring","originalTitle":"","year":"2003","releaseDate":"20030414","directors":[{"name":"Markus Imboden","id":"nm0408153"}],"writers":[{"name":"Holger Karsten Schmidt","id":"nm0772988"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWFiYjU3YmItNDk1OC00Y2RkLTkxYTUtZmJmZGQ0ZDM4NTdiXkEyXkFqcGdeQXVyMzA3Njg4MzY@._V1.jpg","countries":["Germany"],"languages":["German"],"genres":["Crime"],"plot":"Berlin in 1945 after Germany's defeat in the war. The former military surgeon Dr. Hans Mertens (Ernst Wilhelm Borchert) returns home from the battlefield to find his home destroyed. He suffers from the terrible memories of the war and becomes an alcoholic. An artist and Nazi concentration camp survivor, Susanne Wallner (Hildegard Knef), finds him living in her apartment as she returns home and they become roommates and even friends. Eventually, Mertens meets his former captain Ferdinand Brückner (Arno Paulsen), who had been responsible for the shooting of a hundred civilians on Christmas Eve of 1942 in a Polish village on the Eastern Front. He is now a successful businessman, producing pots out of old Stahlhelme, the German military steel helmet. On Christmas Eve, Mertens plans to kill him, but Wallner stops him at the last minute. They decide to have Brückner put on trial then, and the two start a new life together.","simplePlot":"Berlin in 1945 after Germany's defeat in the war. The former military surgeon Dr. Hans Mertens (Ernst Wilhelm Borchert) returns home from the battlefield to find his home destroyed. He ... ","actors":[{"actorName":"Susanne Schäfer","urlProfile":"http://www.imdb.com/name/nm0778091","urlPhoto":"","biography":{"dateOfBirth":"7 March 1963","placeOfBirth":" Frankfurt am Main, West Germany","height":"5' 5¼\" (1.66 m)","bio":"Susanne Schäfer was born on March 7, 1963 in Frankfurt am Main, West Germany. She is an actress and producer, known for Todesspiel (1997), Der Fall Gehring (2003) and Le labyrinthe du silence (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0778091","name":"Susanne Schäfer","idIMDB":"nm0778091"},"actorId":"nm0778091","character":"Julia Stein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christoph Waltz","urlProfile":"http://www.imdb.com/name/nm0910607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDk3OTYxOF5BMl5BanBnXkFtZTcwMDk5OTUwOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1956","placeOfBirth":" Vienna, Austria","height":"5' 7\" (1.7 m)","bio":"Christoph Waltz is an Austrian-German actor. He is known for his works with American filmmaker Quentin Tarantino, receiving acclaim for portraying SS-Standartenführer Hans Landa in Inglourious Basterds (2009) and bounty hunter Dr. King Schultz in Django Unchained (2012). For each performance, he won an Academy Award, a BAFTA Award, and a Golden Globe Award for Best Supporting Actor. Additionally, he received the Best Actor Award at the Cannes Film Festival and a Screen Actors Guild Award for his portrayal of Landa. Christoph Waltz was born in Vienna, Austria, to Elisabeth Urbancic, an Austrian-born costume designer, and Johannes Waltz, a German-born stage builder. He has three siblings. He was born into a theater family, as his maternal grandmother was Viennese Burgtheater actress Maria Mayen, and his step-grandfather was fellow Burgtheater actor Emmerich Reimers. His maternal grandfather, Rudolf von Urban, was a psychologist and psychiatrist who wrote the 1949 book \"Sex Perfection and Marital Happiness\". Waltz attended the Theresianium and Billrothstrasse in Vienna. Upon graduation, he attended the Max-Reinhardt-Seminar before going to New York to the Lee Strasberg Institute. While in New York, Christoph met his first wife, and moved back to Vienna, then to London. During the 80s, Christoph worked primarily in theater, commuting from his home in London to Germany. Slowly he began to work in TV, taking one-off roles on series, and TV movies. Film roles soon followed, however, attempts to break into English-speaking film and TV were unsuccessful. Christoph has stated he is grateful to have made a living and supported his family through acting. For thirty years he worked steadily, tirelessly, in this manner. It was not until he met Quentin Tarantino that his career in Hollywood took off. The role of Colonel Hans Landa in Inglourious Basterds (2009) catapulted Christoph from a lifetime working in German TV/film to the new life of an international superstar and Academy Award-winning actor. He won 27 awards for his performance as Hans Landa, including the Cannes prix d'interpretation Masculin for 2009, the Golden Globe for Best Supporting Actor, the BAFTA Best Supporting Actor award, and the Academy Award for Best Supporting Actor (which he won again for 2012's Django Unchained (2012)). He also portrayed computer genius Qohen Leth in the film The Zero Theorem (2013), American plagiarist Walter Keane in the biographical film _Big Eyes (2014), and 007's nemesis and head of SPECTRE Ernst Stavro Blofeld in _Spectre (2015)_. In Quentin Tarantino's 2009 film Inglourious Basterds, Waltz portrayed SS-Standartenführer Hans Landa, aka \"The Jew Hunter\". Clever, courteous, and multilingual - but also self-serving, cunning, implacable, and murderous. Waltz played gangster Benjamin Chudnofsky in The Green Hornet (2011). That same year, he starred in Water for Elephants (2011), Roman Polanski's Carnage (2011), and a remake of Les Trois Mousquetaires (2011). He played German bounty hunter Dr. King Schultz in Quentin Tarantino's Django Unchained (2012), a role Tarantino wrote specifically for Waltz. Christoph resides in Berlin and Los Angeles. His wife is costume builder Judith Holste.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDk3OTYxOF5BMl5BanBnXkFtZTcwMDk5OTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910607","name":"Christoph Waltz","idIMDB":"nm0910607"},"actorId":"nm0910607","character":"Martin Bach","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hermann Lause","urlProfile":"http://www.imdb.com/name/nm0491548","urlPhoto":"","biography":{"dateOfBirth":"7 February 1939","placeOfBirth":" Meppen, Germany","bio":"Hermann Lause was born on February 7, 1939 in Meppen, Germany. He was an actor, known for Head-On (2004), Schtonk (1992) and Jede Menge Kohle (1981). He died on March 28, 2005 in Hamburg, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0491548","name":"Hermann Lause","idIMDB":"nm0491548"},"actorId":"nm0491548","character":"Juergen Lorenz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Schmauser","urlProfile":"http://www.imdb.com/name/nm0772589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzN2I5MWEtYzI5MS00YTZmLTk0ZWItNDgwMTFhMGNjODgyXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1972","placeOfBirth":" Burgebrach, Germany","height":"5' 9¾\" (1.77 m)","bio":"Thomas Schmauser was born on November 30, 1972 in Burgebrach, Germany. He is an actor, known for Joyeux Noel (2005), The Loneliness of the Crocodiles (2000) and Undertaker's Paradise (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzN2I5MWEtYzI5MS00YTZmLTk0ZWItNDgwMTFhMGNjODgyXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0772589","name":"Thomas Schmauser","idIMDB":"nm0772589"},"actorId":"nm0772589","character":"Frank Wegner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Giering","urlProfile":"http://www.imdb.com/name/nm0317385","urlPhoto":"","biography":{"dateOfBirth":"23 November 1971","placeOfBirth":" Magdeburg, German Democratic Republic [now Federal Republic of Germany]","height":"5' 7\" (1.7 m)","bio":"Born and raised in Magdeburg (Germany), Frank Giering gained first stage experience as a background actor at the former known \"Maxim-Gorki\" theatre Magdeburg\". During this time the desire arose to become an actor even though he said at a later time, that this desire was mainly animated due to his hunger to get visible and noticed combined with the unrealistic belief to get more interesting for the womankind. Nevertheless he started his studies at the \"Westfälischen Schauspielschule Bochum\" (Germany) but changed short time after to the \"Hochschule für Film und Fernsehen\" (HFF) in Potsdam Babelsberg (Germany). But again he felt quite uncomfortable with the education methods. Some exercises led him to his physical and mental limits. Furthermore he failed on his teacher's demands to \"fill up the space of the theatre\". As he realized that he clenched more and more as soon as he got instructions to \"give more\" or to become \"louder\" he decided to break off. His last public theatre performance before leaving the HFF Potsdam in summer 1994 was the turning point. He gained the attention of an assistant director, which gave him the possibility to attend a casting for the television film Der Verräter (1995), in which he starred an instable young man searching for acceptance and affection who got into the claws of a neo-Nazi gang. Finally - in front of the film camera - he was able to live out his own belief of acting which was the opposite of the requirements at school. He loved to reduce and to express feelings solely by glances and a minimum of gestures and facial expression. According to his teachers in the theatre he was only able to catch the first row. But now he met the facility - not to gain the last rows by broaden himself - but to bring them closer using the camera. At last he felt like coming home. With his first role he gained the attention of the Austrian director Michael Haneke, who cast him for two of his productions. After the Kafka adaption Le château (1997), Giering starred the cine film Funny Games (1997). With the figure of the sadistic murderer he became popular over night. The final breakthrough followed 1999 with his performance as Floyd in Gigantic (1999) by Sebastian Schipper, a small but particular film about friendship, longing and farewell and a very last but magic night in Hamburg. For a short time he was announced as one of the promising up-and-coming actors of Germany. Comparisons were drawn with James Dean, much less due to similarities in visual nature but due to an aura of \"lostness\" and lonesomeness which both actors surrounded. Giering felt quite overstrained to live up this expectation. He described himself as extremely shy and uncertain, full of feelings of inferiority and melancholia. Only in front of the camera he felt really free and secure. Aside of the camera he suffered from fear of loss and anxiety about the future, which also led to the break of several relationships. Actually he said once that he couldn't believe in being loved by someone. Due to the fact that he never had faith in the skills he owned but only in those he lacked. His alcohol consumption - to compensate his uncertainties and the emptiness between the films - raised more and more a problem. In 2001 he decided for a half-yearly rehab. In the following he always stood by his struggle against alcoholism (and his very own demons) in a quite public way, also to give impulses and courage for people in the same situation, something he sadly missed in his own setting. Giering attended twice at the film festival Berlinale (Berlin, Germany), 2002 starring Andreas Baader in Baader (2002), 2004 with the Jon Fosse adaption Et la nuit chante (2004). Both films were failed by the bigger part of the press and leads to controversial discussions. Especially the production of \"Die Nacht singt ihre Lieder\" (about the shattering of a love affair and the cruelty of silence in occasions something rather should have been said) was a matter close to his heart due to some parallels in his own vita. After this negative experience Giering mainly gave up the cinema business and focused on television productions. In his opinion he was much less attackable on the smaller screen. From 2006 until his death in June 2010 Giering played - next to Christian Berkel - the role of \"Kommissar Henry Weber\" in the TV series Der Kriminalist (2006). After his sudden death during the current production, the figure of Henry Weber died, too. For paying deep respect and sympathy the production company decided not to impute a fictional ending. For that reason episode 7.3 \"Tod eines Begleiters\" opened with the funeral of Henry Weber. In many obituaries was read - due to the quantity and deficient diligence by selecting his roles - Giering undersold himself and burned out by less important featured parts. Indeed he seemed not to care about what he was acting as long as he was acting and able to forget his fears and lonesomeness for just that moment. Just as many times it was mentioned that scarcely anybody else in Germany was able to act with such an intensity and depth. Due to the fact that he never ever played (simulate) emotions but lived it in the moment of acting he offered much more of himself than usual and allowed the audience to get adamantly close to him. That and the fact that hardly anyone else ever radiated such a sadness and lonesomeness might be the reason that he was able to deeply move even in his least roles. Frank Giering died on 23th of June 2010. The official cause of dead is given by multiple organ failure due to an acute bilious colic. On 9th of July 2010 he was buried at the \"Neustädter Friedhof\" in Magdeburg (Germany).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0317385","name":"Frank Giering","idIMDB":"nm0317385"},"actorId":"nm0317385","character":"Kai Wegner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Schendel","urlProfile":"http://www.imdb.com/name/nm0770863","urlPhoto":"","biography":{"dateOfBirth":"1956","placeOfBirth":" Düsseldorf, Germany","height":"6' 1½\" (1.87 m)","bio":"Thomas Schendel was born in 1956 in Düsseldorf, Germany. He is an actor, known for Lammbock (2001), Love in Thoughts (2004) and Dead (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0770863","name":"Thomas Schendel","idIMDB":"nm0770863"},"actorId":"nm0770863","character":"Hans-Werner Gehring","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miriam Morgenstern","urlProfile":"http://www.imdb.com/name/nm1177394","urlPhoto":"","biography":{"dateOfBirth":"20 May 1987","placeOfBirth":" Gräfelfing, Bavaria, Germany","height":"5' 6¼\" (1.68 m)","bio":"Miriam Morgenstern was born on May 20, 1987 in Gräfelfing, Bavaria, Germany. She is an actress, known for Summer Storm (2004), Jasmin (2016) and Der Fall Gehring (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1177394","name":"Miriam Morgenstern","idIMDB":"nm1177394"},"actorId":"nm1177394","character":"Natalie Lorenz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tina Engel","urlProfile":"http://www.imdb.com/name/nm0257151","urlPhoto":"","biography":{"dateOfBirth":"6 April 1950","placeOfBirth":" Hannover, Germany","height":"5' 5¾\" (1.67 m)","bio":"Tina Engel was born on April 6, 1950 in Hannover, Germany. She is an actress, known for The Tin Drum (1979), Das Boot ist voll (1981) and The Second Awakening of Christa Klages (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0257151","name":"Tina Engel","idIMDB":"nm0257151"},"actorId":"nm0257151","character":"Nadja Lorenz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Theresa Hübchen","urlProfile":"http://www.imdb.com/name/nm0406100","urlPhoto":"","biography":{"dateOfBirth":"20 February 1971","placeOfBirth":" East Berlin, East Germany","height":"5' 4¼\" (1.63 m)","bio":"Theresa Hübchen was born on February 20, 1971 in East Berlin, East Germany. She is an actress, known for Mörder in Weiß - Der Tod lauert im OP (2005), Alles auf Anfang (1994) and Der Fall Gehring (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0406100","name":"Theresa Hübchen","idIMDB":"nm0406100"},"actorId":"nm0406100","character":"Jasmin Wegner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Günter Schubert","urlProfile":"http://www.imdb.com/name/nm0775796","urlPhoto":"","biography":{"dateOfBirth":"8 April 1938","placeOfBirth":" Weisswasser, Germany","height":"5' 7¾\" (1.72 m)","bio":"Günter Schubert was born on April 8, 1938 in Weisswasser, Germany. He was an actor, known for Gute Aussichten (1999), Elbflorenz (1994) and Sechse kommen durch die Welt (1972). He was married to Petra Nathan and Jutta Schubert. He died on January 2, 2008 in Berlin, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0775796","name":"Günter Schubert","idIMDB":"nm0775796"},"actorId":"nm0775796","character":"Wirt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karl Kranzkowski","urlProfile":"http://www.imdb.com/name/nm0469843","urlPhoto":"","biography":{"dateOfBirth":"1953","placeOfBirth":" Drieberg, German Democratic Republic","height":"5' 9¼\" (1.76 m)","bio":"Karl Kranzkowski was born in 1953 in Drieberg, German Democratic Republic. He is an actor, known for SOKO Stuttgart (2009), Downfall (2004) and A Ship Is Coming (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0469843","name":"Karl Kranzkowski","idIMDB":"nm0469843"},"actorId":"nm0469843","character":"Ruediger Krohn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Bideller","urlProfile":"http://www.imdb.com/name/nm1188647","urlPhoto":"","biography":{"dateOfBirth":"1954","placeOfBirth":"","bio":"Michael Bideller was born in 1954. He is an actor, known for Der Fall Gehring (2003), Enderal (2016) and Lucy (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1188647","name":"Michael Bideller","idIMDB":"nm1188647"},"actorId":"nm1188647","character":"Bauer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Max Herbrechter","urlProfile":"http://www.imdb.com/name/nm0378685","urlPhoto":"","biography":{"dateOfBirth":"12 March 1958","placeOfBirth":" Dortmund, North Rhine-Westphalia, West Germany","height":"5' 9\" (1.75 m)","bio":"Max Herbrechter was born on March 12, 1958 in Dortmund, North Rhine-Westphalia, West Germany. He is an actor, known for Rochade (1997), Gran Paradiso (2000) and Bermuda Triangle North Sea (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0378685","name":"Max Herbrechter","idIMDB":"nm0378685"},"actorId":"nm0378685","character":"Rainer Selditz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wilfried Dziallas","urlProfile":"http://www.imdb.com/name/nm0246171","urlPhoto":"","biography":{"dateOfBirth":"8 May 1944","placeOfBirth":" Hamburg, Germany","height":"5' 10¾\" (1.8 m)","bio":"Wilfried Dziallas was born on May 8, 1944 in Hamburg, Germany. He is an actor and director, known for Großstadtrevier (1986), Freundschaft mit Herz (1995) and Edgar (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0246171","name":"Wilfried Dziallas","idIMDB":"nm0246171"},"actorId":"nm0246171","character":"Bauer Salewski","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brigitte Böttrich","urlProfile":"http://www.imdb.com/name/nm0127177","urlPhoto":"","biography":{"dateOfBirth":"1945","placeOfBirth":"","height":"5' 3\" (1.6 m)","bio":"Brigitte Böttrich was born in 1945. She is an actress, known for Charly la malice (1995), Broti & Pacek - irgendwas ist immer (2002) and Karniggels (1991). She is married to Andreas von der Meden.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0127177","name":"Brigitte Böttrich","idIMDB":"nm0127177"},"actorId":"nm0127177","character":"Hilde Salewski","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0366423","urlIMDB":"http://www.imdb.com/title/tt0366423","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min) (Germany)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.1","filmingLocations":[{"location":"Hamburg, Germany"}],"awards":[{"award":"German Television Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated German Television Award","categories":[{"category":"Best Supporting Actor (Bester Schauspieler in einer Nebenrolle)","names":[{"name":"Frank Giering","id":"nm0317385","role":null}]},{"category":"Best Supporting Actor (Bester Schauspieler in einer Nebenrolle)","names":[{"name":"Hermann Lause","id":"nm0491548","role":null}]}]}]},{"award":"Golden Camera, Germany 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Camera","categories":[{"category":"Best German Actor","names":[{"name":"Christoph Waltz","id":"nm0910607","role":null}]}]}]}],"votes":"141","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0051628","name":"Multimedia Film- und Fernsehproduktions GmbH"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:16:31"}}