{"data":{"movies":[{"title":"Anything Else","originalTitle":"","year":"2003","releaseDate":"20030919","directors":[{"name":"Woody Allen","id":"nm0000095"}],"writers":[{"name":"Woody Allen","id":"nm0000095"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkyNjYyMzAzNV5BMl5BanBnXkFtZTYwMTMxNDU3._V1.jpg","countries":["USA","France","UK"],"languages":["English","Latin"],"genres":["Comedy","Romance"],"plot":"Jerry Falk and David Dobel, who meet at a business meeting, become fast friends. Their commonality is that they are both fledgling New York based comedy writers, largely writing material for stand-ups, are Jewish (although David is an atheist), and are each of bundle of different neuroses. Their big difference is that Jerry is twenty-one, while David is sixty, with forty more years worth of life experience, knowledge and neuroses. While Jerry writes full time - he also working on a novel - David has kept his day job as a public school teacher just in case. In their relationship, David becomes somewhat of Jerry's mentor, providing advice on Jerry's life issues, most which revolve around the fact that Jerry is a product of inertia, he having trouble leaving anyone. That's why Jerry's still with the one and only manager he's ever had, Harvey Wexler. Jerry not only being Harvey's only client (which is a testament to his effectiveness in the job), Harvey also has a 25% take as stipulated ...","simplePlot":"Jerry Falk learns a lesson the hard way when he falls head over heels in love with a beautiful but flighty girl, Amanda.","actors":[{"actorName":"Woody Allen","urlProfile":"http://www.imdb.com/name/nm0000095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjU3MTI2MF5BMl5BanBnXkFtZTcwMDgxNTE4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1935","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Allan Stewart Konigsberg","height":"5' 5\" (1.65 m)","bio":"Woody Allen was born Allan Stewart Konigsberg on December 1, 1935 in Brooklyn, New York, to Nettie (Cherrie), a bookkeeper, and Martin Konigsberg, a waiter and jewellery engraver. His father was of Russian Jewish descent, and his maternal grandparents were Austrian Jewish immigrants. As a young boy, he became intrigued with magic tricks and playing the clarinet, two hobbies that he continues today. Allen broke into show business at 15 years when he started writing jokes for a local paper, receiving $200 a week. He later moved on to write jokes for talk shows but felt that his jokes were being wasted. His agents, Charles Joffe and Jack Rollins, convinced him to start doing stand-up and telling his own jokes. Reluctantly he agreed and, although he initially performed with such fear of the audience that he would cover his ears when they applauded his jokes, he eventually became very successful at stand-up. After performing on stage for a few years, he was approached to write a script for Warren Beatty to star in: Quoi de neuf, Pussycat? (1965) and would also have a moderate role as a character in the film. During production, Woody gave himself more and better lines and left Beatty with less compelling dialogue. Beatty inevitably quit the project and was replaced by Peter Sellers, who demanded all the best lines and more screen-time. It was from this experience that Woody realized that he could not work on a film without complete control over its production. Woody's theoretical directorial debut was in What's Up, Tiger Lily? (1966); a Japanese spy flick that he dubbed over with his own comedic dialogue about spies searching for the secret recipe for egg salad. His real directorial debut came the next year in the mockumentary Take the Money and Run (1969). He has written, directed and, more often than not, starred in about a film a year ever since, while simultaneously writing more than a dozen plays and several books of comedy. While best known for his romantic comedies Annie Hall (1977) and Manhattan (1979), Woody has made many transitions in his films throughout the years, transitioning from his \"early, funny ones\" of Bananas (1971), Love and Death (1975) and Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972); to his more storied and romantic comedies of Annie Hall (1977), Manhattan (1979) and Hannah and Her Sisters (1986); to the Bergmanesque films of Stardust Memories (1980) and Interiors (1978); and then on to the more recent, but varied works of Crimes and Misdemeanors (1989), Husbands and Wives (1992), Mighty Aphrodite (1995), _Celebrity_ and Deconstructing Harry (1997); and finally to his films of the last decade, which vary from the light comedy of Scoop (2006), to the self-destructive darkness of Match Point (2005) and, most recently, to the cinematically beautiful tale of Vicky Cristina Barcelona (2008). Although his stories and style have changed over the years, he is regarded as one of the best filmmakers of our time because of his views on art and his mastery of filmmaking.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjU3MTI2MF5BMl5BanBnXkFtZTcwMDgxNTE4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000095","name":"Woody Allen","idIMDB":"nm0000095"},"actorId":"nm0000095","character":"David Dobel","urlCharacter":"http://www.imdb.com/character/ch0018300","main":true},{"actorName":"Jason Biggs","urlProfile":"http://www.imdb.com/name/nm0004755","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Mzg0NjMwMV5BMl5BanBnXkFtZTcwNDgyNzE4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1978","placeOfBirth":" Pompton Plains, New Jersey, USA","birthName":"Jason Matthew Biggs","height":"5' 9\" (1.75 m)","bio":"Jason Matthew Biggs was born on May 12, 1978, in Pompton Plains, New Jersey, to Angela (Zocco), a nurse, and Gary Biggs, a shipping company manager. Jason has two sisters, Heather, a tax specialist born in 1971, and Chiara, born in 1980. He was raised Catholic, and is of English and mostly Italian descent. Jason started acting at age five, appearing in several national commercials. In 1991, at 13 he won a part on the FOX sitcom Drexell's Class (1991), but the show was canceled after one season. Also during that year, he made his Broadway debut opposite Judd Hirsch in the play, Conversations With My Father. The play helped earn him a spot on As the World Turns (1956), as the rebellious Pete Wendall. The role earned him a nomination for Best Younger Actor in a Drama Series at the Daytime Emmy's. After graduating high school in 1996, he studied briefly at New York University and Montclair State University in New Jersey but dropped out to pursue acting again. In 1997, he costarred in the short lived television series Camp Stories (1997). In 1999 came his breakthrough role in the teen sex comedy American Pie (1999). His performance shocked yet wooed audiences, critics, and casting agents to bring him for the first time the chance to choose new roles and scripts. He chose such roles in Loser (2000) and Boys and Girls (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Mzg0NjMwMV5BMl5BanBnXkFtZTcwNDgyNzE4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004755","name":"Jason Biggs","idIMDB":"nm0004755"},"actorId":"nm0004755","character":"Jerry Falk","urlCharacter":"http://www.imdb.com/character/ch0018303","main":true},{"actorName":"Fisher Stevens","urlProfile":"http://www.imdb.com/name/nm0001770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTE2NTMxM15BMl5BanBnXkFtZTYwNjkwMDM0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1963","placeOfBirth":" Chicago, Illinois, USA","birthName":"Steven Fisher","height":"5' 7\" (1.7 m)","bio":"Fisher Stevens moved from his native Chicago to New York at the age of 13 to pursue an acting career. He tried, unsuccessfully, to get any kind of job and was, he recalls, even rejected as extra for a Crest commercial. When his acting teacher, Dan Fauci, lost the lease to his teaching studio, he rented Fisher's loft and built a stage in the living room. He later studied with Uta Hagen. His first professional theatrical production was playing Tiny Tim's brother, Harry, in the musical version of Dickens' \"A Christmas Carol\" in the basement of an off-off-off Broadway theatre when he was 14. Since then he has performed in more than 20 stage productions including 544 performances in Harvey Fierstein's \"Torch Song Triology\", both on and off Broadway. He also played Eugene in Neil Simon's \"Brighton Beach Memories\". Most recently, he played the leads in Thomas Babe's \"Carrying School Children\", \"Almost Romance\" opposite Helen Slater and Jules Feiffer's \"Little Murders\" with Christine Lahti. He also sang and danced in the musicals \"Miami\" by Wendy Wasserstein and the late Michael Bennett's Broadway production of \"Scandal\" with Swoosie Kurtz and Treat Williams. He also appeared in the recent New York City Shakespeare Festival production of \"A Midsummer Nights Dream\". Fisher made his motion picture debut getting his fingers chopped off in the horror film The Burning (1981) when he was 16-years-old. After that he appeared in Baby It's You (1983) and The Brother from Another Planet (1984). He co-starred with Matt Dillon in the hit comedy film The Flamingo Kid (1984) where he met the then fledgling producer Gary Foster. He appeared as sidekick to Steve Guttenberg's character in Short Circuit (1986). In television he has performed in ABC's Ryan's Hope (1975), Showtime's Tall Tales & Legends (1985) and CBS' Early Edition (1996). Despite having lived in New York City for more than a decade, where, with some other actors, Stevens has started an off-off-off Broadway theatre company called Naked Angels, he insists that he is still a fan of the Chicago Cubs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTE2NTMxM15BMl5BanBnXkFtZTYwNjkwMDM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001770","name":"Fisher Stevens","idIMDB":"nm0001770"},"actorId":"nm0001770","character":"Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Arkin","urlProfile":"http://www.imdb.com/name/nm0035061","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjg4MzMyMl5BMl5BanBnXkFtZTgwNTY4MjgzMDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1967","placeOfBirth":"","bio":"Anthony Arkin was born in 1967. He is an actor and editor, known for Anything Else (2003), Hollywood Ending (2002) and Pipe Dream (2002). He is married to Amelia Campbell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjg4MzMyMl5BMl5BanBnXkFtZTgwNTY4MjgzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035061","name":"Anthony Arkin","nicknames":["Tony"],"idIMDB":"nm0035061"},"actorId":"nm0035061","character":"Pip's Comic","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny DeVito","urlProfile":"http://www.imdb.com/name/nm0000362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1944","placeOfBirth":" Asbury Park, New Jersey, USA","birthName":"Daniel Michael DeVito Jr.","height":"4' 10\" (1.47 m)","bio":"Danny DeVito has amassed a formidable and versatile body of work as an actor, producer and director that spans the stage, television and film. Daniel Michael DeVito Jr. was born on November 17, 1944, in Neptune, New Jersey, to Italian-American parents. His mother, Julia (Moccello), was a homemaker. His father, Daniel, Sr., was a small business owner whose ventures included a dry cleaning shop, a dairy outlet, a diner, and a pool hall. While growing up in Asbury Park, his parents sent him to private schools. He attended Our Lady of Mount Carmel grammar school and Oratory Prep School. Following graduation in 1962, he took a job as a cosmetician at his sister's beauty salon. A year later, he enrolled at New York's American Academy of Dramatic Arts so he could learn more about cosmetology. While at the academy, he fell in love with acting and decided to further pursue an acting career. During this time, he met another aspiring actor Michael Douglas at the National Playwrights Conference in Waterford, Connecticut. The two would later go on to collaborate on numerous projects. Soon after he also met an actress named Rhea Perlman. The two fell in love and moved in together. They were married in 1982 and had three children together. In 1968, Danny landed his first part in a movie when he appeared as a thug in the obscure Dreams of Glass (1970). Despite this minor triumph, Danny became discouraged with the film industry and decided to focus on stage productions. He made his Off-Broadway debut in 1969 in \"The Man With the Flower in His Mouth.\" He followed this up with stage roles in \"The Shrinking Bride,\" and \"Lady Liberty.\" In 1975, he was approached by director Milos Forman and Michael Douglas about appearing in the film version of One Flew Over the Cuckoo's Nest (1975), which would star Jack Nicholson in the leading role. With box office success almost guaranteed and a chance for national exposure, Danny agreed to the role. The movie became a huge hit, both critically and financially, and still ranks today as one the greatest movies of all time. Unfortunately, the movie did very little to help Danny's career. In the years following, he was relegated to small movie roles and guest appearances on television shows. His big break came in 1978 when he auditioned for a role on an ABC sitcom pilot called Taxi (1978), which centered around taxi cab drivers at a New York City garage. Danny auditioned for the role of dispatcher Louie DePalma. At the audition, the producers told Danny that he needed to show more attitude in order to get the part. He then slammed down the script and yelled, \"Who wrote this sh**?\" The producers, realizing he was perfect for the part, brought him on board. The show was a huge success, running from 1978 to 1983. Louie DePalma, played flawlessly by Danny, became one of the most memorable (and reviled) characters in television history. While he was universally hated by TV viewers, he was well-praised by critics, winning an Emmy award and being nominated three other times. Throughout the 1980s and 1990s, Danny maintained his status as a great character actor with memorable roles in movies like Romancing the Stone (1984), Ruthless People (1986), Throw Momma from the Train (1987) and Twins (1988). He also had a great deal of success behind the camera, directing movies like The War of the Roses (1989) and Hoffa (1992). In 1992, Danny was introduced to a new generation of moviegoers when he was given the role of The Penguin/Oswald Cobblepot in Tim Burton's highly successful Batman Returns (1992). This earned him a nomination for Best Villain at the MTV Movie Awards. That same year, along with his then-wife Rhea Perlman, Danny co-founded Jersey Films, which has produced many popular films and TV shows, including Pulp Fiction (1994), Get Shorty (1995), Man on the Moon (1999) and Erin Brockovich (2000). DeVito has many directing credits to his name as well, including Throw Momma from the Train (1987), The War of the Roses (1989), Hoffa (1992), Death to Smoochy (2002) and the upcoming St. Sebastian. In 2006, he returned to series television in the FX comedy series It's Always Sunny in Philadelphia (2005). With a prominent role in a hit series, Devito's comic talents were now on display for a new generation of television viewers. In 2012, he provided the title voice role in Dr. Seuss' The Lorax (2012). These days, he continues to work with many of today's top talents as an actor, director and producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000362","name":"Danny DeVito","idIMDB":"nm0000362"},"actorId":"nm0000362","character":"Harvey Wexler","urlCharacter":"http://www.imdb.com/character/ch0144400","main":true},{"actorName":"Christina Ricci","urlProfile":"http://www.imdb.com/name/nm0000207","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUzMzk5NzcyNV5BMl5BanBnXkFtZTcwNzQ1NjkzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1980","placeOfBirth":" Santa Monica, California, USA","height":"5' 0¼\" (1.53 m)","bio":"Precocious, outspoken child-teen starlet of the 1990s, Christina Ricci was born in 1980 in Santa Monica, California, the youngest of four children of Sarah (Murdoch), a realtor, and Ralph Ricci, a lawyer and therapist. She is of Italian (from her paternal grandfather), Irish, and Scots-Irish descent. She made her screen debut at the age of 9 in Mermaids (1990), in which she worked with Winona Ryder and Cher. Her breakthrough adult role was in Ice Storm (1997), in which she plays a nymphet who skillfully seduces two brothers. She worked with Johnny Depp and Casper Van Dien in the Tim Burton film Sleepy Hollow (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUzMzk5NzcyNV5BMl5BanBnXkFtZTcwNzQ1NjkzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000207","name":"Christina Ricci","nicknames":["Squant"],"idIMDB":"nm0000207"},"actorId":"nm0000207","character":"Amanda","urlCharacter":"http://www.imdb.com/character/ch0243628","main":true},{"actorName":"KaDee Strickland","urlProfile":"http://www.imdb.com/name/nm0834380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzMwNDc5OV5BMl5BanBnXkFtZTcwNzgzNjI4Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1975","placeOfBirth":" Patterson, Georgia, USA","birthName":"Katherine Dee Strickland","height":"5' 5\" (1.65 m)","bio":"KaDee Strickland was born on December 14, 1975 in Patterson, Georgia, USA as Katherine Dee Strickland. She is an actress, known for Private Practice (2007), The Sixth Sense (1999) and The Grudge (2004). She has been married to Jason Behr since November 10, 2006. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzMwNDc5OV5BMl5BanBnXkFtZTcwNzgzNjI4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834380","name":"KaDee Strickland","idIMDB":"nm0834380"},"actorId":"nm0834380","character":"Brooke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Fallon","urlProfile":"http://www.imdb.com/name/nm0266422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDIwOTg3OV5BMl5BanBnXkFtZTcwMjE3MjM3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1974","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"James Thomas Fallon Jr.","height":"6' (1.83 m)","bio":"Jimmy Fallon was born in 1974 in Brooklyn, New York, to Gloria (Feeley) and Jimmy Fallon. He is of Irish, German, and Norwegian descent. He was raised in Saugerties, New York, which is in upstate New York. He has performed stand up, impressions and characters across the country, in some of the biggest comedy clubs, such as the Improv (in Los Angeles) and Caroline's Comedy Club (in New York City). He also took acting classes with The Groundlings, an LA-based breeding ground for great comedians. Jimmy joined the cast of Saturday Night Live (1975) as a featured player in September 1998. He has already been called the best SNL player since Phil Hartman, and is popular amongst SNL fans.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDIwOTg3OV5BMl5BanBnXkFtZTcwMjE3MjM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0266422","name":"Jimmy Fallon","idIMDB":"nm0266422"},"actorId":"nm0266422","character":"Bob Stiles","urlCharacter":"http://www.imdb.com/character/ch0018302","main":true},{"actorName":"Diana Krall","urlProfile":"http://www.imdb.com/name/nm0005106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDAwNjA2Ml5BMl5BanBnXkFtZTcwMzExOTM0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1964","placeOfBirth":" Nanaimo, British Columbia, Canada","birthName":"Diana Jean Krall","height":"5' 8½\" (1.74 m)","bio":"Diana Jean Krall was born in Nanaimo, British Columbia, Canada, to Adella A. (Wende), an elementary school teacher, and Stephen James Krall, an accountant. She has Czech, German, English, and Scottish ancestry. Krall was raised in Nanaimo, a small community on Vancouver Island, where she began performing professionally at age 15 as a jazz pianist. In 1981, Diana won a Vancouver Jazz Festival scholarship to study at Berklee College of Music in Boston and, after a year and a half of serious study, she returned to British Columbia. Renowned bassist Ray Brown heard her playing one night in Nanaimo and convinced Diana to move to Los Angeles where she obtained a Canadian Arts Council grant to study with Jimmy Rowles. Jimmy encouraged Diana to explore her vocals to supplement her already blossoming piano skills. With several successful CDs to her credit, Diana has won numerous awards including Canada's Juno Award for Best Jazz Vocal Album (2000) and a Grammy for Best Jazz Vocal Performance (2000). She received the Order of British Columbia in 2000 for being a good-will ambassador for British Columbia and epitomizing Canadian culture. The greatest talent in the jazz field to come along in a generation, she frequently acknowledges her roots in Nanaimo where she began. She epitomizes Canadian culture and is an outstanding citizen and good-will ambassador for British Columbia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDAwNjA2Ml5BMl5BanBnXkFtZTcwMzExOTM0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005106","name":"Diana Krall","idIMDB":"nm0005106"},"actorId":"nm0005106","character":"Diana Krall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Hill","urlProfile":"http://www.imdb.com/name/nm0384771","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTUxNDk4Nl5BMl5BanBnXkFtZTgwOTgzNzM2MDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1961","placeOfBirth":" Newark, New Jersey, USA","bio":"William Hill was born and raised in the North Ward of Newark, New Jersey. After doing Theatre in the NJ area, he trained as an actor with Sanford Meisner at the Neighborhood Playhouse School Of The Theatre in New York City. In addition to film and television projects he has appeared on Broadway and in Theatre's across the country.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTUxNDk4Nl5BMl5BanBnXkFtZTgwOTgzNzM2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384771","name":"William Hill","idIMDB":"nm0384771"},"actorId":"nm0384771","character":"Psychiatrist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stockard Channing","urlProfile":"http://www.imdb.com/name/nm0000330","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTc0NDQ4NV5BMl5BanBnXkFtZTYwODYyMjA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1944","placeOfBirth":" New York City, New York, USA","birthName":"Susan Williams Antonia Stockard","height":"5' 3\" (1.6 m)","bio":"One of Broadway and Hollywood's cleverer talents who tends to shine a smart, cynical light on her surroundings, Stockard Channing was born Susan Williams Antonia Stockard on February 13, 1944, in New York City, to a Catholic family, with English and Irish ancestry. The daughter of Lester Napier Stockard, a well-to-do shipping executive, and Mary Alice (née English) Stockard, her father died when she was 16 and left her a sizable estate. She grew up in Brooklyn and attended the prolific Chapin School in NYC, then later attended the Madeira School, a Virginia boarding school for girls. She studied at Radcliffe College where she majored in both literature and history before graduating summa cum laude in 1965. In 1964, at the age of 20, she married the first of four husbands, Walter Channing Jr., a businessman whose last name she kept as part of her own stage moniker after their divorce four years later. Stockard made her stage debut in a production of \"The Investigation\" at the experimental Theatre Company of Boston in 1966. She went on to play a number of offbeat roles with the company. She eventually migrated to New York where she took her first Broadway bow as a chorus member and understudy in the musical version of \"Two Gentlemen of Verona\" in 1971. Two years later she would take over the prime role of Julia in the L.A. national company. Other theater roles during this time included \"Adaptation/Next\" (1970) \"Arsenic and Old Lace\" (1970), \"Play Strindberg\" (1971) and \"No Hard Feelings\" (1973). Somewhat plaintive yet unique-looking, the dark-haired actress began first appearing in pictures with small parts in the dark comedy The Hospital (1971) and the edgy Barbra Streisand fantasy-drama Up the Sandbox (1972). Taking on the top female lead as an heiress and potential victim of shysters Jack Nicholson and Warren Beatty in Mike Nichols' comedy The Fortune (1975), the film, despite its male star power, would not become the star-making hit for Channing as initially hoped and Channing. Her next two films (The Big Bus (1976) and Sweet Revenge (1976)) faded away even quicker. Earlier, however, she hit a home with the TV-movie The Girl Most Likely to... (1973), a clever black comedy written by Joan Rivers wherein Stockard played a former ugly duckling-turned-beauty (à la plastic surgery) who knocks off the men who formerly mistreated her. This was Channing at her smart and cynical best, traits that would carry her far in Hollywood. At the age of 33(!), she was handed the feisty role of high school teen Betty Rizzo in the box-office film version of the hit musical Grease (1978) starring Olivia Newton-John and John Travolta. While long in the tooth for such a role (as were others), Stockard's sly performance earned her the People's Choice Awards for Favorite Motion Picture Supporting Actress. This popular film clinched her place as a top-ranking contender. As a result, she was handed two sitcom vehicles within a year on CBS: Stockard Channing in Just Friends (1979), as a newly-separated wife starting life anew in another city (L.A.), and The Stockard Channing Show (1980), which again cast her as a divorced lady trying to find herself again in L.A. Neither made her a TV star. Both failed to catch on and lasted but a few months. Stalled at a critical juncture in her career, Stockard decided to return to her first love -- the theater. With \"Vanities\", \"Absurd Person Singular\" and \"As You Like It\" (as Rosalind) already on her resume, she earned fine notices on Broadway with the musical \"They're Playing Our Song\" replacing Lucie Arnaz in 1980, then garnered rave reviews in the part of the mother of a developmentally disabled child in the New Haven production of Peter Nichols' \"A Day in the Death of Joe Egg\" in 1982. She repeated her role on Broadway a few years later (the title now shortened to \"Joe Egg\") and copped the 1985 Tony Award for Best Actress in a Play. Subsequent Tony nominations came her way for her offbeat work in \"The House of Blue Leaves\" (1986); \"Six Degrees of Separation\" (1991) (for which she also won an Off-Broadway Obie), \"Four Baboons Adoring the Sun\" (1992); and for her Eleanor of Aquitaine in \"The Lion in Winter\" in 1999. Award-worthy projects came her way on TV as well. Nominated for an Emmy for the CBS miniseries Echoes in the Darkness (1987), she also won a CableACE Award for her work in Tidy Endings (1988). In film, she received Oscar and Golden Globe nominations when her stage triumph, Six Degrees of Separation (1993), was turned into a film and also received the London Film Critics Circle Award for Best Actress in the film _Business of Strangers, The (2001). In 1999, Stockard became a recurring member of the cast of The West Wing (1999) as First Lady Abigail Bartlet. Audiences were so drawn to her shrewd, classy character that producers wisely started featuring her regularly into the third season. In 2002 she won both Emmy and SAG awards for this role, as well as a second Emmy that same year for her supporting turn as Judy Sheppard in The Matthew Shepard Story (2002), a docudrama about the gay-bashing murder of young Matthew Shepard. Stockard thought she finally found sitcom success with the series Out of Practice (2005) and was even Emmy-nominated for her role as a sharp-tongued but caring doctor. As luck would have it, she again couldn't find a core audience and the show lasted but a mere season. Stockard continues to excel in sly, worldly roles that combine a dark wit with an even darker cynical edge. True to form, she recently completed a picture aptly titled Multiple Sarcasms (2010). Divorced four times, including one to writer/producer David Debin, she has no children. She has been in a long-term relationship with cinematographer Daniel Gillham since 1988. A sister, Lesly Stockard Smith, became mayor of Palm Beach in 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTc0NDQ4NV5BMl5BanBnXkFtZTYwODYyMjA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000330","name":"Stockard Channing","idIMDB":"nm0000330"},"actorId":"nm0000330","character":"Paula Chase","urlCharacter":"http://www.imdb.com/character/ch0018304","main":true},{"actorName":"Maurice Sonnenberg","urlProfile":"http://www.imdb.com/name/nm0814400","urlPhoto":"","biography":{"bio":"Maurice Sonnenberg is an actor, known for Midnight in Paris (2011), Vicky Cristina Barcelona (2008) and Blue Jasmine (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0814400","name":"Maurice Sonnenberg","idIMDB":"nm0814400"},"actorId":"nm0814400","character":"Movie Theater Patron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Edelson","urlProfile":"http://www.imdb.com/name/nm0249029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTA2MjAzN15BMl5BanBnXkFtZTYwNjQyODgy._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Kenneth Edelson is an actor, known for Anything Else (2003), Husbands and Wives (1992) and Mighty Aphrodite (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTA2MjAzN15BMl5BanBnXkFtZTYwNjQyODgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249029","name":"Kenneth Edelson","idIMDB":"nm0249029"},"actorId":"nm0249029","character":"Hotel Desk Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Conrad","urlProfile":"http://www.imdb.com/name/nm0175633","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTk3ODM2NV5BMl5BanBnXkFtZTcwODQ0MDIyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1967","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"David Crawford Conrad","height":"6' 1\" (1.85 m)","bio":"David Conrad was born on August 17, 1967 in Pittsburgh, Pennsylvania, USA as David Crawford Conrad. He is an actor, known for Ghost Whisperer (2005), Wedding Crashers (2005) and Men of Honor (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTk3ODM2NV5BMl5BanBnXkFtZTcwODQ0MDIyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175633","name":"David Conrad","idIMDB":"nm0175633"},"actorId":"nm0175633","character":"Dr. Phil Reed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Lyle Taylor","urlProfile":"http://www.imdb.com/name/nm0852668","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMDE4NDkwMV5BMl5BanBnXkFtZTgwNzc3MDk5MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1964","placeOfBirth":" Vidor, Texas, USA","birthName":"Joseph Lyle Taylor Jr.  ","bio":"Joseph Lyle Taylor was born on September 20, 1964 in Vidor, Texas, USA as Joseph Lyle Taylor Jr.  . He is an actor and producer, known for The Dark Knight Rises (2012), Seven Psychopaths (2012) and He Got Game (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMDE4NDkwMV5BMl5BanBnXkFtZTgwNzc3MDk5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852668","name":"Joseph Lyle Taylor","idIMDB":"nm0852668"},"actorId":"nm0852668","character":"Bill","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0313792","urlIMDB":"http://www.imdb.com/title/tt0313792","business":{"budget":{"money":"$18,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,673,125","country":"USA","day":"21","month":"09","year":"2003","remarks":"1,033 Screens"},{"money":"£39,149","country":"UK","day":"01","month":"08","year":"2004","remarks":"26 Screens"},{"money":"$32,000","country":"Hungary","day":"18","month":"04","year":"2004","remarks":"11 Screens"},{"money":"€423,066","country":"Spain","day":"07","month":"12","year":"2003","remarks":"113 Screens"}],"gross":[{"money":"$3,203,044","country":"USA","day":"12","month":"10","year":"2003","remarks":""},{"money":"$3,135,535","country":"USA","day":"05","month":"10","year":"2003","remarks":""},{"money":"$2,781,677","country":"USA","day":"28","month":"09","year":"2003","remarks":""},{"money":"$1,673,125","country":"USA","day":"21","month":"09","year":"2003","remarks":""},{"money":"£39,149","country":"UK","day":"01","month":"08","year":"2004","remarks":""},{"money":"$1,944,486","country":"France","day":"11","month":"11","year":"2003","remarks":""},{"money":"$1,222,666","country":"France","day":"04","month":"11","year":"2003","remarks":""},{"money":"€1,950,395","country":"Italy","day":"07","month":"12","year":"2003","remarks":""},{"money":"€1,921,801","country":"Italy","day":"23","month":"11","year":"2003","remarks":""},{"money":"€1,896,856","country":"Italy","day":"16","month":"11","year":"2003","remarks":""},{"money":"€1,819,540","country":"Italy","day":"02","month":"11","year":"2003","remarks":""},{"money":"€1,725,402","country":"Italy","day":"26","month":"10","year":"2003","remarks":""},{"money":"€1,544,401","country":"Italy","day":"19","month":"10","year":"2003","remarks":""},{"money":"€1,196,931","country":"Italy","day":"12","month":"10","year":"2003","remarks":""},{"money":"€21,870","country":"Netherlands","day":"30","month":"05","year":"2004","remarks":""},{"money":"€2,364,500","country":"Spain","day":"11","month":"01","year":"2004","remarks":""},{"money":"€2,108,710","country":"Spain","day":"04","month":"01","year":"2004","remarks":""},{"money":"€1,803,990","country":"Spain","day":"28","month":"12","year":"2003","remarks":""},{"money":"€1,286,116","country":"Spain","day":"21","month":"12","year":"2003","remarks":""},{"money":"€974,637","country":"Spain","day":"14","month":"12","year":"2003","remarks":""},{"money":"€423,066","country":"Spain","day":"07","month":"12","year":"2003","remarks":""}],"weekendGross":[{"money":"$18,280","country":"USA","day":"12","month":"10","year":"2003","remarks":"34 Screens"},{"money":"$117,105","country":"USA","day":"05","month":"10","year":"2003","remarks":"238 Screens"},{"money":"$644,826","country":"USA","day":"28","month":"09","year":"2003","remarks":"1,033 Screens"},{"money":"$1,673,125","country":"USA","day":"21","month":"09","year":"2003","remarks":"1,033 Screens"},{"money":"£39,149","country":"UK","day":"01","month":"08","year":"2004","remarks":"26 Screens"},{"money":"$32,000","country":"Hungary","day":"18","month":"04","year":"2004","remarks":"11 Screens"},{"money":"€52,261","country":"Italy","day":"02","month":"11","year":"2003","remarks":"20 Screens"},{"money":"€94,929","country":"Italy","day":"26","month":"10","year":"2003","remarks":"42 Screens"},{"money":"€203,691","country":"Italy","day":"19","month":"10","year":"2003","remarks":"101 Screens"},{"money":"€361,298","country":"Italy","day":"12","month":"10","year":"2003","remarks":"163 Screens"},{"money":"€8,420","country":"Netherlands","day":"30","month":"05","year":"2004","remarks":"4 Screens"},{"money":"€131,060","country":"Spain","day":"11","month":"01","year":"2004","remarks":"102 Screens"},{"money":"€224,770","country":"Spain","day":"04","month":"01","year":"2004","remarks":"114 Screens"},{"money":"€262,030","country":"Spain","day":"28","month":"12","year":"2003","remarks":"109 Screens"},{"money":"€223,401","country":"Spain","day":"21","month":"12","year":"2003","remarks":"111 Screens"},{"money":"€314,039","country":"Spain","day":"14","month":"12","year":"2003","remarks":"114 Screens"},{"money":"€423,066","country":"Spain","day":"07","month":"12","year":"2003","remarks":"113 Screens"}],"admissions":[{"money":"469,451","country":"France","day":"06","month":"01","year":"2004","remarks":""},{"money":"304,415","country":"France","day":"11","month":"11","year":"2003","remarks":""},{"money":"248,950","country":"Spain","day":"21","month":"12","year":"2003","remarks":""},{"money":"188,658","country":"Spain","day":"14","month":"12","year":"2003","remarks":""},{"money":"81,892","country":"Spain","day":"07","month":"12","year":"2003","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"05","year":"2002","remarks":null},null],"copyrightHolder":"2003 Gravier Productions, Inc."},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["DTS (Mono)","Dolby Digital (Mono)","SDDS (Mono)"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Millennium, Panavision Primo and C-Series Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (prints)","Technicolor, New York (NY), USA (color)"],"filmLength":["2,973 m (Switzerland)"],"negativeFormat":["35 mm (Eastman EXR 100T 5248, Kodak Vision 320T 5277)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"6.4","metascore":"43","filmingLocations":[{"location":"50 Commerce St, Greenwich Village, Manhattan, New York City, New York, USA"}],"rated":"R","awards":[],"votes":"26,062","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040938","name":"DreamWorks"},{"idCompany":"co0044777","name":"Gravier Productions"},{"idCompany":"co0028557","name":"Canal+"}],"keywords":{"keywords":["writer","love at first sight","teacher","sex","new york city","moving","panties","two word title","written and directed by cast member","manhattan new york city","voice over narration","flashback","central park manhattan new york city","reference to sophia loren","directed by co star","self discipline","wedding anniversary","directed by star","kitchen","vandalism","taxi ride","survival kit","spaghetti","revenge","psychiatrist","park bench","new york skyline","mentor","fired from the job","eccentric","dysfunctional relationship","taxi driver","underwear","talking to the camera","stand up comedian","split screen","sex talk","record store","neurotic","masturbation","jazz club","hand grenade","flashlight","flare gun","dieting","compass","clipboard","cigarette smoking","boyfriend girlfriend relationship","therapy","theatrical agent","surveillance","surplus dealer","rifle","restaurant","premarital sex","piano","party","paranoia","new jersey","mother daughter relationship","medical examination","jewish","jealousy","hotel","hospital","heart attack","flirting","fantasy sequence","doctor","convertible","contract","confession","computer","comedy club","cocaine","cheating on one's boyfriend","car smashing","breaking the fourth wall","break up","atheist","actress"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:51:04"}}