{"data":{"movies":[{"title":"Sea of Fear","originalTitle":"","year":"2006","releaseDate":"20060822","directors":[{"name":"Andrew Schuth","id":"nm0776893"}],"writers":[{"name":"Andrew Schuth","id":"nm0776893"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjIwOTEwNl5BMl5BanBnXkFtZTcwOTMyMDQzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"College athlete Lance and his friend Tom meet Tom's girlfriend Kate and her friend Ashley in a marina to travel on a rented boat on a leisure trip. The Captain brings his navigator and first mate Joel and another unexpected passenger, Derek, along on the trip. Soon the boat is stranded and one by one the shipmates are murdered.","simplePlot":"College athlete Lance and his friend Tom meet Tom's girlfriend Kate and her friend Ashley in a marina to travel on a rented boat on a leisure trip. The Captain brings his navigator and ... ","actors":[{"actorName":"Edward Albert","urlProfile":"http://www.imdb.com/name/nm0001902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDk5NTIzMV5BMl5BanBnXkFtZTcwNjU2NzgzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1951","placeOfBirth":" Los Angeles, California, USA","birthName":"Edward Laurence Heimberger","height":"6' (1.83 m)","bio":"The only son of Green Acres (1965) star Eddie Albert and Mexican actress/dancer Margo, Edward Laurence Albert managed to come out from under his father's strong shadow and make a gallant showing of his own as a gifted thespian. Born in Los Angeles on February 20, 1951, Edward's multi-cultural heritage and talented gene pool allowed him to become a man of many talents: songwriter, drummer, singer, photographer and, most importantly, activist. Growing up, he inherited an early interest in music and the performing arts. He made an auspicious film debut at the age of 14 in Violent Journey (1965) co-starring as a young runaway who teams up with a tormented Civil War veteran (Anthony Perkins), a teaming that leads to murder. A strong, mature role for such a youngster, his next film appearance wouldn't come about until seven years later. In the meantime Edward attended Oxford University and was studying psychology at UCLA when offered the breakthrough of a lifetime. Signed up to play the difficult role of blind Don Baker--played on Broadway by Keir Dullea--who yearns for freedom away from his domineering mom (Oscar winner Eileen Heckart) and finds it in the arms of a liberated lass named Jill (Goldie Hawn) in Butterflies Are Free (1972), Edward easily captured the hearts of millions with his tender, life-affirming performance. Edward walked home with the cinema's Golden Globe Award as \"Male Newcomer of the Year.\" A confident, intelligent actor with a serene handsomeness and 1000-watt smile who just happened to possess the most magnetic pale eyes this side of Meg Foster, Edward was on a seemingly strong path to film stardom. Although he never found a comparable success to \"Butterfly,\" he did follow it up with another theater comedy favorite, 40 Carats (1973), in which he had a dalliance with older actress Liv Ullmann. He also played Charlton Heston's military son in Midway (1976), followed by highly visible roles in The Domino Killings (1977) and The Greek Tycoon (1978). When film stardom did not pan out, Edward saw TV as a welcoming medium and made up for his sudden lack of star power with wonderful turns in major TV minimovies, notably The Last Convertible (1979). By the 1980s he had started making the rounds in formula low-budget action films and usually fared best when his flashy villainous side came into view. While such obvious movie titles as The House Where Evil Dwells (1982), Fist Fighter (1989), Demon Keeper (1994) and Stageghost (2000) pointed out the lack of quality in his offerings, it did provide a steady income and visibility. He also made frequent guest appearances on such shows as Falcon Crest (1981), L.A. Law (1986), Star Trek: Deep Space Nine (1993) and Dr. Quinn, Medicine Woman (1993) that kept him in the public eye. A solid regular as both good guy and bad guy on series TV, he gave his life (and, it seems, his paycheck) to the Beast after three seasons on Beauty and the Beast (1987) and, in contrast, played the dastardly Dr. Bennett Devlin on the daytime soap Port Charles (1997) for its first three seasons. Edward also used his vocal talents in animation involving such superhero icons as The Fantastic Four (1978), Spider-Man (1994) and \"The Power Rangers\". From his father and mother Edward developed a deep love and appreciation for the land and the diversity of cultures. As such, he divided his time between acting work and activism just as his father had done. Having owned a ranch in Malibu for over 30 years, he was a strong, positive influence and passionate spokesperson when it came to environmental and cultural affairs. In recent years he served on the California Coastal Commission and California Native American Heritage Commission. Long married to lovely British-born actress Katherine Woodville, the couple's daughter, Thais, continued the family musical tradition as a singer/songwriter for the rock group Sugar in Wartime. Following his mother's passing from brain cancer in 1985, Edward became a selfless caregiver to his aging father, who began to develop early signs of Alzheimer's disease in the 1990s. His father lived for more than a decade in declining health, dying in May 2005. In early 2005, Edward discovered he too was seriously ill after being diagnosed with lung cancer. He died surrounded by family on September 22, 2006, at the relatively young age of 55.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDk5NTIzMV5BMl5BanBnXkFtZTcwNjU2NzgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001902","name":"Edward Albert","idIMDB":"nm0001902"},"actorId":"nm0001902","character":"Captain","urlCharacter":"http://www.imdb.com/character/ch0343203","main":true},{"actorName":"Katherine Bailess","urlProfile":"http://www.imdb.com/name/nm1349694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjI5OTIwM15BMl5BanBnXkFtZTcwOTUxNzU1OQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1980","placeOfBirth":" Vicksburg, Mississippi, USA","height":"5' 5\" (1.65 m)","bio":"Born in Mississippi, Bailess began studying classical dance at the age of four and competed in gymnastics, dance and cheerleading. At age 11, she began performing live on television as a dancer in the Miss Mississippi Pageant where she continued for 7 more years. After attending ballet workshops across the country, Katherine won a scholarship with the Broadway Dance Center in New York and at Ann Reinking's Broadway theatre Project in Florida. After focusing on dance and musical theatre at Marymount Manhattan College, Katherine went on to study at the William Esper Studio's two-year intensive program. She recently wrapped filming the new VH1 TV Series 'Hit the Floor' as Kyle, a series regular and one of the elite Los Angeles 'Devil Girl' Professional Basketball Dancers. The show, created by James LaRosa, premiered over Memorial Day Weekend this year. Katherine is no stranger to television or film as she has recurred on a number of TV shows including 'Gilmore Girls', 'One Tree Hill', 'The Loop' and 'Sordid Lives: The Series'. She has also appeared on shows like 'NCIS' and on the big screen as a lead opposite Kelly Clarkson in \"From Justin to Kelly\" and \"Bring It On Again.\" She also has numerous other independent films including, \"Below the Beltway\", \"Elle: A Modern Cinderella Tale\", \"Stone Markers\" and \"2 Dead 2 Kill.\" On occasion, she is also known to step in as a co-host for \"Afterbuzz TV\" alongside Maria Menounos. Never one to neglect her passion for music, Kat is getting back to her Mississippi roots by writing and performing country music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjI5OTIwM15BMl5BanBnXkFtZTcwOTUxNzU1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1349694","name":"Katherine Bailess","idIMDB":"nm1349694"},"actorId":"nm1349694","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kieren Hutchison","urlProfile":"http://www.imdb.com/name/nm0404456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q4MGFiZTQtZjVmMi00NWIzLTg1OGUtYmMyMWE5ZThmODY4XkEyXkFqcGdeQXVyMjQxMDE5ODc@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1974","placeOfBirth":" Auckland, New Zealand","birthName":"Kieren Robert Hutchison","bio":"Kieren Hutchison was born on October 9, 1974 in Auckland, New Zealand as Kieren Robert Hutchison. He is an actor, known for The Legend of William Tell (1998), One Tree Hill (2003) and Flower Girl (2009). He has been married to Nicole Tubiola since August 10, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q4MGFiZTQtZjVmMi00NWIzLTg1OGUtYmMyMWE5ZThmODY4XkEyXkFqcGdeQXVyMjQxMDE5ODc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0404456","name":"Kieren Hutchison","idIMDB":"nm0404456"},"actorId":"nm0404456","character":"Tom","urlCharacter":"http://www.imdb.com/character/ch0343205","main":true},{"actorName":"Burgess Jenkins","urlProfile":"http://www.imdb.com/name/nm0420792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMjkwNDE0MV5BMl5BanBnXkFtZTgwMDU4ODg2OTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1973","placeOfBirth":" Winston-Salem, North Carolina, USA","height":"6' (1.83 m)","bio":"After studying Psychology in graduate school Burgess continued his training at the famed Playhouse West in Los Angeles where he would spend 4 years under the instruction of Robert Carnegie and Oscar nominated actor Jeff Goldblum. Known for a wide range of memorable characters, some of his credits include: the antagonist Ray Budds in the blockbuster film \"Remember the Titans\" opposite Academy Award winner Denzel Washington; His tenure as a series regular on the flagship drama \"Army Wives\" (Lifetime) portraying the conflicted Ranger & family man, Eddie Hall. In the Warner Brothers thriller, \"The Reaping\" Burgess stars as David Winter the husband of Katherine played by Oscar winner Hilary Swank. Additionally Burgess has recurred as Randy Roberts on the smash hit \"Nashville\" (ABC), Bobby Irons on the CW favorite \"One Tree Hill\" & Jeff Rumson on the comedy series \"Marry Me\" with Lucy Liu. Notably, he was nominated for Best Actor at the Boston Film Festival for his turn as Bruce Snow in the award winning thriller \"Insignificant Others\". Recently, Burgess has been a series regular on the long running hit CBS show \"The Young and the Restless\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMjkwNDE0MV5BMl5BanBnXkFtZTgwMDU4ODg2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0420792","name":"Burgess Jenkins","idIMDB":"nm0420792"},"actorId":"nm0420792","character":"Lance","urlCharacter":"http://www.imdb.com/character/ch0343206","main":true},{"actorName":"Adam Mayfield","urlProfile":"http://www.imdb.com/name/nm1484151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxODA4NDc2OV5BMl5BanBnXkFtZTgwODM4Mjg1NDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Adam recently appeared as Tall Tony in an episode of the popular CBS crime show \"NCIS\" and was in several episodes of ABC's \"Days of our lives\" in 2015. Prior to that he had the lead in Hallmark's \"A Christmas Kiss 2,\" played Jenny Garth's husband in the ABC Family comedy, \"Mystery Girls,\" and starred in the made-for-TV movie \"Sweet Surrender\" with Haylie Duff and Constance Marie. After filming the psychological thriller, \"Would You Rather,\" he was off to France accepting the award for Best Feature Film at the 2013 St. Tropez International Film Festival for the film \"The Preachers Daughter.\" Adam, who was also nominated for Best Lead Actor, starred opposite Andrea Bowen in this dark family drama. The tall Texas native with swagger and matinee good looks cut his teeth into acting while in high school. After graduating DePaul University's respected Theatre School in Chicago and having numerous plays and musicals under his belt, Adam moved to Los Angeles. He quickly got noticed and made his TV debut in David E. Kelley's \"Boston Public.\" After some guest star work, Los Angeles theatre and countless commercials, Adam was led to New York, where he landed a contract role on ABC's \"All my Children.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxODA4NDc2OV5BMl5BanBnXkFtZTgwODM4Mjg1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1484151","name":"Adam Mayfield","idIMDB":"nm1484151"},"actorId":"nm1484151","character":"Joel","urlCharacter":"http://www.imdb.com/character/ch0343207","main":true},{"actorName":"Christopher Showerman","urlProfile":"http://www.imdb.com/name/nm0962398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTA2ODUzMl5BMl5BanBnXkFtZTgwOTMxNTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1971","placeOfBirth":" Jackson, Michigan, USA","birthName":"Christopher Clare Showerman","height":"6' 2\" (1.88 m)","bio":"Christopher Showerman was born on June 24, 1971 in Jackson, Michigan, USA as Christopher Clare Showerman. He is an actor and producer, known for George of the Jungle 2 (2003), Big Game (2008) and Radio America (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTA2ODUzMl5BMl5BanBnXkFtZTgwOTMxNTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0962398","name":"Christopher Showerman","idIMDB":"nm0962398"},"actorId":"nm0962398","character":"Derek","urlCharacter":"http://www.imdb.com/character/ch0343208","main":true},{"actorName":"Jeri Sprague","urlProfile":"http://www.imdb.com/name/nm1455929","urlPhoto":"","biography":{"bio":"Jeri Sprague is known for her work on Sea of Fear (2006), Heavy Put-Away (2004) and Malibu Spring Break (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1455929","name":"Jeri Sprague","idIMDB":"nm1455929"},"actorId":"nm1455929","character":"Dead Girl On Boat","urlCharacter":"http://www.imdb.com/character/ch0343209","main":true},{"actorName":"Caroline Walker","urlProfile":"http://www.imdb.com/name/nm1404567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDg5MDIxOV5BMl5BanBnXkFtZTcwNzYwNTcyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1979","placeOfBirth":" Moline, Illinois, USA","bio":"Caroline Walker was born on June 21, 1979 in Moline, Illinois, USA. She is an actress, known for Christmas Vacation 2: Cousin Eddie's Island Adventure (2003), Sea of Fear (2006) and Carolina (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDg5MDIxOV5BMl5BanBnXkFtZTcwNzYwNTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1404567","name":"Caroline Walker","idIMDB":"nm1404567"},"actorId":"nm1404567","character":"Ashley MacDougle","urlCharacter":"http://www.imdb.com/character/ch0343210","main":true}],"seasons":[],"idIMDB":"tt0389360","urlIMDB":"http://www.imdb.com/title/tt0389360","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Sony HDW-F900"],"laboratory":null,"filmLength":null,"negativeFormat":["Video"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"2.6","filmingLocations":[{"location":"Marina del Rey, California, USA"}],"rated":"PG-13","awards":[],"votes":"547","type":"Movie","companyCreditsSimple":[{"idCompany":"co0120183","name":"Even Keel Productions LLC"}],"keywords":{"keywords":["pirate","suffocation","shark attack","murder","drowning"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:22:05"}}