{"data":{"movies":[{"title":"The Three Stooges","originalTitle":"","year":"2012","releaseDate":"20120413","directors":[{"name":"Bobby Farrelly","id":"nm0268370"},{"name":"Peter Farrelly","id":"nm0268380"}],"writers":[{"name":"Mike Cerrone","id":"nm0148808"},{"name":"Bobby Farrelly","id":"nm0268370"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzYwNjQ3OF5BMl5BanBnXkFtZTcwNzczNDMxNw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family"],"plot":"Left on the doorstep of an orphanage run by nuns at birth, three friends Moe, Larry and Curly spend their time eye poking and slapping each other all the day long. But when their orphanage suddenly goes bankrupt, the three Stooges set out to save it by journeying into the world to find a way to raise the money required. But their quest brings them into being used in a murder scheme and landing them into a popular reality show.","simplePlot":"While trying to save their childhood orphanage, Moe, Larry and Curly inadvertently stumble into a murder plot and wind up starring in a reality television show.","actors":[{"actorName":"Sean Hayes","urlProfile":"http://www.imdb.com/name/nm0005003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDg2MTE2Ml5BMl5BanBnXkFtZTcwNjk4NjI0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1970","placeOfBirth":" Glen Ellyn, Illinois, USA","birthName":"Sean Patrick Hayes","height":"5' 11\" (1.8 m)","bio":"Sean Patrick Hayes was born and raised in the Chicago suburb of Glen Ellyn, Illinois. His father, Ronald, a lithographer, left the family when Sean was a young child, leaving his mother to raise Sean and his four siblings as a single mother. His mother, Mary, works at a food bank. Sean supported himself as a classical pianist and as a member of a pop band for five years, while attending Illinois State University, where he majored in performance and orchestral conducting. He began his post-collegiate professional career in Chicago theatre, as musical director at the Pheasant Run Theater for several years, appearing on stage in several productions as well. He also appeared in the original production of \"Role Play\" at the Organic Theatre. An alumnus of Chicago's famed Second City improvisational comedy group, Hayes had gigs as a stand-up comic, performing at The Comedy Club in Los Angeles. While still in Chicago, Hayes won roles in television shows as well as the television movie A & P (1996), based on a story by John Updike, before landing the role which earned him an Emmy Award in 2001 - Jack McFarland - on the hit NBC comedy series Will & Grace (1998). He has also been honored with a SAG Award, an American Comedy Award and a TV Guide Award as well as with two Golden Globe Nominations. Hayes made his feature film debut in 1998 in the title role of the art-house hit Billy's Hollywood Screen Kiss (1998), which won critical acclaim at the Sundance Film Festival. He also co-starred in the box-office hit Cats & Dogs (2001) for Warner Bros Studios. Of Irish descent, Sean Hayes makes his home in Los Angeles with his long time boyfriend, now husband (as of November 2014), Scotty Icenogle, a Los Angeles music producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDg2MTE2Ml5BMl5BanBnXkFtZTcwNjk4NjI0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005003","name":"Sean Hayes","idIMDB":"nm0005003"},"actorId":"nm0005003","character":"Larry","urlCharacter":"http://www.imdb.com/character/ch0031536","main":true},{"actorName":"Will Sasso","urlProfile":"http://www.imdb.com/name/nm0766005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODk3MDk1OF5BMl5BanBnXkFtZTYwMjYxMzky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1975","placeOfBirth":" Ladner, British Columbia, Canada","birthName":"William Sasso","height":"6' 3½\" (1.92 m)","bio":"Will Sasso was born in Ladner, British Columbia (a suburb of Vancouver), to a family of Italian descent. He grew up respecting comedy of all styles, thanks in part to an unhealthy relationship with the family television that began when Will was around two or three. With his mind consequently bent, Sasso decided at an early age to become an actor. At the age of fifteen, he landed his first agent and quickly began booking roles in television and film. Before moving from Vancouver to Los Angeles, Sasso starred for five seasons as the quirky teen, \"Derek Wakaluk\" on the award-winning Canadian dramatic series Madison (1993) allowing him to hone his acting and improvisational skills as well as providing him with enough money to buy a television of his own. Will starred for five seasons on FOX's hit sketch comedy series MADtv (1995) giving TV viewers a reason to stay up late with characters like the accident-prone handyman \"Paul Timberman\" and offbeat impressions of Bill Clinton, Kenny Rogers, Arnold Schwarzenegger, Steven Seagal and Randy Newman. After a successful tenure with the show beginning in 1997, Sasso decided to leave the late-night staple in 2002, eager to explore the next stage of his career. Moviegoers know Sasso from his roles in more than twenty-five feature films including Best in Show (2000), directed by Christopher Guest, Belles à mourir (1999), Beverly Hills Ninja (1997) starring the late Chris Farley, and The Hot Chick (2002) starring Rob Schneider and produced by Adam Sandler, with whom Sasso previously worked on Happy Gilmore (1996). More recently, Sasso can be seen every week as \"Carl Monari\" on the ABC sitcom Less Than Perfect (2002). In his spare time, Sasso enjoys the outdoors and the indoors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODk3MDk1OF5BMl5BanBnXkFtZTYwMjYxMzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0766005","name":"Will Sasso","idIMDB":"nm0766005"},"actorId":"nm0766005","character":"Curly","urlCharacter":"http://www.imdb.com/character/ch0031542","main":true},{"actorName":"Chris Diamantopoulos","urlProfile":"http://www.imdb.com/name/nm0224565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzQyMTI1NF5BMl5BanBnXkFtZTcwMjY2MDIxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1975","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 9\" (1.75 m)","bio":"Chris grew up splitting his time between Greece and Canada. At age 9, he started doing TV commercials and professional theater. He left home at 18 to perform in a series of US national tours after which, he landed on Broadway. Chris now splits his time between New York and Los Angeles acting in TV and Film. Also an established voice-over artist, he can be heard on numerous national campaigns and networks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzQyMTI1NF5BMl5BanBnXkFtZTcwMjY2MDIxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0224565","name":"Chris Diamantopoulos","nicknames":["Dimo"],"idIMDB":"nm0224565"},"actorId":"nm0224565","character":"Moe","urlCharacter":"http://www.imdb.com/character/ch0031549","main":true},{"actorName":"Jane Lynch","urlProfile":"http://www.imdb.com/name/nm0528331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDcwOTA1M15BMl5BanBnXkFtZTcwNTQ2Njg0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1960","placeOfBirth":" Dolton, Illinois, USA","birthName":"Jane Marie Lynch","height":"6' (1.83 m)","bio":"Jane Lynch was born on July 14, 1960 in Dolton, Illinois, USA as Jane Marie Lynch. She is an actress, known for Glee (2009), Wreck-It Ralph (2012) and The 40-Year-Old Virgin (2005). She was previously married to Lara Embry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDcwOTA1M15BMl5BanBnXkFtZTcwNTQ2Njg0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528331","name":"Jane Lynch","idIMDB":"nm0528331"},"actorId":"nm0528331","character":"Mother Superior","urlCharacter":"http://www.imdb.com/character/ch0300766","main":true},{"actorName":"Sofía Vergara","urlProfile":"http://www.imdb.com/name/nm0005527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDkwMDcxOV5BMl5BanBnXkFtZTcwMDk0MjQ2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1972","placeOfBirth":" Barranquilla, Colombia","birthName":"Sofía Margarita Vergara Vergara","height":"5' 7\" (1.7 m)","bio":"Sofía Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Dávila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school. She then went on to study pre-dentistry. However, Sofía was discovered by a photographer, whilst at the beach, and this led to various jobs in modeling and television. At age 23, she was a runway model. From 1995 to 1998, she co-hosted a travel show, Fuera de serie (1995), which gave her exposure in the United States. Her first film role was the criminal comedy Big Trouble (2002). Her breakthrough role was as Gloria Delgado-Pritchett on the American television series Modern Family (2009). In 2010-2013, she received four Emmy nominations for Outstanding Supporting Actress in a Comedy Series for this role. Sofía resides in Los Angeles, California with her son, Manolo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDkwMDcxOV5BMl5BanBnXkFtZTcwMDk0MjQ2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005527","name":"Sofía Vergara","nicknames":["La Toti"],"idIMDB":"nm0005527"},"actorId":"nm0005527","character":"Lydia","urlCharacter":"http://www.imdb.com/character/ch0300963","main":true},{"actorName":"Jennifer Hudson","urlProfile":"http://www.imdb.com/name/nm1617685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTczMDU5OV5BMl5BanBnXkFtZTcwNDI0ODY1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1981","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jennifer Kate Hudson","height":"5' 9\" (1.75 m)","bio":"Jennifer Hudson is a Grammy Award-winning recording artist, Academy Award-winning actress and best-selling author. Bright and booming talent Hudson is a perfect example of how NOT winning the title of American Idol (2002) can actually be a boon to your career and not necessarily the end of a childhood dream. Hudson was born Jennifer Kate Hudson on September 12, 1981, in Chicago, Illinois, to Darnell Donnerson and Samuel Simpson. She earned minor attention as one of the twelve finalists on the third season of the FOX TV series in 2004. She came in an underwhelming sixth runner-up. Hudson grew up singing in gospel choirs, acting in community theater productions, singing on cruise ships and touring for in Disney's Hercules: The Musical. With no formal musical training, her gospel-tinged voice initially pleased the panel of judges. The songs were arguably ill-advised but evidence of her greatness peeked through at times. She, Fantasia Barrino and La Toya London were promoted as the show's own version of the Dreamgirls and were expected to be the final three standing in the competition when Jennifer was unexpectedly cut from the pack. Fantasia won the competition and all the glory and the fame. Hudson appeared with the \"American Idol\" summer tour and performed on the road in concerts over the next two years. She auditioned for the coveted role of Effie Melody White, the cast-off member of a popular 60s Supremes-like girl group in the long-awaited film version of the Broadway musical Dreamgirls. Among Jennifer's competition was Fantasia herself. This time Jennifer was the winner, and was ordered to gain weight for the role. With the insurmountable task of taking over a role so indelibly identified with Tony-winning legend Jennifer Holliday, the making of Dreamgirls (2006). In a role of a lifetime, Hudson no longer had to play second fiddle to anyone. Her role in Dreamgirls (2006) was one of the most triumphant musical film debuts since Barbra Streisand in Funny Girl (1968). Hudson made the role her own delivering the same heart-breaking, gut-wrenching one-two punch that made Holliday the toast of Broadway in 1981. To outshine Beyoncé Knowles and Eddie Murphy is no easy task but Hudson was the heart and soul of the movie. She copped awards from the National Board of Review, New York Film Critics, Phoenix Film Critics Society, Golden Satellite, Golden Globe, the British Film and the coveted Oscar. The late, tragic Florence Ballard, on whom the Effie character is based, would be very inspired indeed to see Jennifer Hudson's meteoric rise to musical star. Hudson has since made an impact in the world of music with the successful release of both of her Sony/Arista Records albums. Her sophomore album, \"I Remember Me,\" was introduced on March 22, 2011 to rave reviews. The album debuted at No. 2 on Billboard's Top 200 and R&B Albums charts and has since been certified RIAA Gold in the U.S. She went on to receive a 2012 Billboard Music Award nomination for Top R&B Album as well as taking home two 2012 NAACP Image Awards for Outstanding Music Video and Outstanding Album. Additional collaborations include \"Think Like A Man\" with Ne-Yo and Rick Ross for the title track of the film and critically acclaimed single \"Night Of Your Life\" with David Guetta for his most recent hit-album \"Nothing But The Beat.\" Hudson's 2008 debut self-titled record won a Grammy Award for \"Best R & B Album,\" which was presented by one of Hudson's idols, Whitney Houston. She also received three additional nominations including \"Best Female R&B Vocal Performance,\" \"Best R&B Performance by a Duo or Group with Vocals\" and \"Best R&B Song.\" The album then went on to win three awards at the 2009 NAACP Image Awards including \"Best Album.\" The RIAA Gold Certified album entered Billboard's Top 200 at No. 2 and marked the biggest first week sales for an R&B female entry since 2004 and has since sold over 1.1 million albums worldwide to date. 2013 was an exciting year for Hudson's music career, most recently being honored with a star on the Hollywood Walk of Fame. Hudson also ended the year by releasing the critically acclaimed single \"I Can't Describe (The Way I Feel),\" produced by Pharrell Williams and featuring T.I.. She was also honored with the privilege to perform the Presidential Inauguration, Super Bowl XLVII and the Academy Awards. In addition, Hudson was also honored by the Recording Academy at the Annual Grammy's on the Hill for her philanthropic efforts, specifically with her organization, the Julian D. King Gift Foundation. The same year, Hudson was honored at VH1's Do Something Awards for her charitable work and also at Variety's Power of Women luncheon with the Samsung Galaxy Impact Award. In 2014, Hudson released the third single off her Sony/RCA album, scheduled for release this fall. The song, \"It's Your World\" features R. Kelly, who also produced the Studio 54-inspired dance track. Just prior, Hudson released \"Walk It Out,\" produced by and featuring Timbaland, which functions as a reminder and a connection to Hudson's roots. The unreleased album has been garnering serious attention with the release of fresh tracks that show off a new sound, a thoughtful departure and a fearless rendering of her work produced by artists like Pharrell, Gorgon City, Timbaland, R. Kelly and others. In spring of 2014, Hudson was seen in \"Lullaby,\" a film by director Andrew Levitas. In November 2013, Hudson also appeared in her first movie musical since \"Dreamgirls,\" in \"Black Nativity.\" Just prior, Hudson was seen in \"The Inevitable Defeat of Mister and Pete.\" In September of the same year, Hudson starred alongside Terrence Howard in Darrell Roodt's \"Winnie Mandela.\" The role recently garnered Hudson an NAACP Image Award nomination for \"Best Actress\". Expanding her talents in the arts, Hudson added author to her list of accomplishments in January 2012 with the release her New York Times best-selling memoir, \"I Got This: How I Changed My Ways, Found Myself and Lost Everything that Weighed Me Down\". Hudson also received an NAACP Image Award nomination in 2009 for her role in Fox Searchlight's \"The Secret Life of Bees.\" Prior to \"Bees,\" Hudson co-starred in the box office hit \"Sex and the City: The Movie.\" In 2009, Jennifer, along with her sister Julia, founded The Julian D. King Gift Foundation, as a catalyst for change in children's health, education and welfare. The Foundation exists to provide stability, support and positive experiences for children of all backgrounds so that they will become productive, confident and happy adults.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTczMDU5OV5BMl5BanBnXkFtZTcwNDI0ODY1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1617685","name":"Jennifer Hudson","idIMDB":"nm1617685"},"actorId":"nm1617685","character":"Sister Rosemary","urlCharacter":"http://www.imdb.com/character/ch0300768","main":true},{"actorName":"Craig Bierko","urlProfile":"http://www.imdb.com/name/nm0081572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NTY0NTc1NV5BMl5BanBnXkFtZTcwNzA3NDYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1964","placeOfBirth":" Rye Brook, New York, USA","birthName":"Craig Philip Bierko","height":"6' 3½\" (1.92 m)","bio":"Craig Bierko was born on August 18, 1964 in Rye Brook, New York, USA as Craig Philip Bierko. He is an actor, known for Cinderella Man (2005), Passé virtuel (1999) and Fear and Loathing in Las Vegas (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NTY0NTc1NV5BMl5BanBnXkFtZTcwNzA3NDYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0081572","name":"Craig Bierko","idIMDB":"nm0081572"},"actorId":"nm0081572","character":"Mac","urlCharacter":"http://www.imdb.com/character/ch0309154","main":true},{"actorName":"Stephen Collins","urlProfile":"http://www.imdb.com/name/nm0004834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMzU0OTYxM15BMl5BanBnXkFtZTYwODgzNzIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1947","placeOfBirth":" Des Moines, Iowa, USA","birthName":"Stephen Weaver Collins","height":"6' 0½\" (1.84 m)","bio":"Stephen Collins was born on October 1, 1947 in Des Moines, Iowa, USA as Stephen Weaver Collins. He is an actor, known for 7th Heaven (1996), Blood Diamond (2006) and All the President's Men (1976). He was previously married to Faye Grant and Marjorie Weinman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMzU0OTYxM15BMl5BanBnXkFtZTYwODgzNzIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004834","name":"Stephen Collins","idIMDB":"nm0004834"},"actorId":"nm0004834","character":"Mr. Harter","urlCharacter":"http://www.imdb.com/character/ch0309156","main":true},{"actorName":"Larry David","urlProfile":"http://www.imdb.com/name/nm0202970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Njg4MzQxNV5BMl5BanBnXkFtZTcwNDgzNDUwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1947","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Lawrence Gene David","height":"5' 11\" (1.8 m)","bio":"Larry David was born on July 2, 1947 in Brooklyn, New York City, New York, USA as Lawrence Gene David. He is a writer and producer, known for Seinfeld (1989), Curb Your Enthusiasm (2000) and Clear History (2013). He was previously married to Laurie Lennard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Njg4MzQxNV5BMl5BanBnXkFtZTcwNDgzNDUwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0202970","name":"Larry David","idIMDB":"nm0202970"},"actorId":"nm0202970","character":"Sister Mary-Mengele","urlCharacter":"http://www.imdb.com/character/ch0301006","main":true},{"actorName":"Kirby Heyborne","urlProfile":"http://www.imdb.com/name/nm1109458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIxODg0NTgxOV5BMl5BanBnXkFtZTcwMDE4MzkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1977","placeOfBirth":"","bio":"Kirby Heyborne was born in 1977. He is an actor, known for Saints and Soldiers (2003), The Three Stooges (2012) and Pirates of the Great Salt Lake (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIxODg0NTgxOV5BMl5BanBnXkFtZTcwMDE4MzkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1109458","name":"Kirby Heyborne","idIMDB":"nm1109458"},"actorId":"nm1109458","character":"Teddy","urlCharacter":"http://www.imdb.com/character/ch0299784","main":true},{"actorName":"Carly Craig","urlProfile":"http://www.imdb.com/name/nm2092503","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUxMDg3MjMtMTc5Ni00YTk3LThiM2UtZWY2NzgzMDI0NTVmXkEyXkFqcGdeQXVyMTA5NzIyMjU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1980","placeOfBirth":" La Mesa, California, USA","birthName":"Carly Christina Craig","height":"5' 7\" (1.7 m)","bio":"Born and raised in San Diego, California, Carly comes from a large Italian-Irish family that includes two professional baseball players: her father, Rocky Craig, and little brother, Casey Craig. She has one sister and two brothers. Carly is well-known on the internet for her hilarious and disturbingly-edgy songs and improv pieces, most notably \"The Daddy Song\", and \"Judy Garland Orgasm\". Though she studied drama for years at The Stella Adler Academy, a conversation with Dan Akroyd would change her life when he suggested she study at Second City, where she later graduated. She met famed manager Bernie Brillstein while waiting tables and decided to put on a comedy show with her classmates. Bernie came to that show and soon after, signed her as a client. Before long, Director David Wain cast her in \"Role Models\" as the object of Seann William Scott's desire and the rest, as they say, is history. Other projects would include Mike Leigh's critically-lauded live show \"Ecstasy\", Neil LaBute's \"Bash\", independent feature film \"Star Sucker\" with Tom Arnold, Rob Corddry's \"Children's Hospital\", and The Farrelly Brother's \"The Heartbreak Kid.\" Carly most recently co-starred opposite Owen Wilson and Jason Sudeikis in the Farrelly Brother's film, \"Hall Pass\". Her comedic talents are highlighted in this role in a film-stealing moment in the bathroom with Jason that exemplifies the Farrelly's slapstick humor. The standout role sealed her a place as a \"Vanities Girl\" for the April 2011 edition of \"Vanity Fair\" where she follows many young ingenues like Kristen Bell, Lesly Mann and Mila Kunis. She will next be seen in the Farrelly's next feature, \"Three Stooges\", playing Mrs. Harter, the wife of Stephen Collins' character. Together the couple sets out to adopt the Stooges. The film began shooting in May 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUxMDg3MjMtMTc5Ni00YTk3LThiM2UtZWY2NzgzMDI0NTVmXkEyXkFqcGdeQXVyMTA5NzIyMjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2092503","name":"Carly Craig","idIMDB":"nm2092503"},"actorId":"nm2092503","character":"Mrs. Harter","urlCharacter":"http://www.imdb.com/character/ch0309155","main":true},{"actorName":"Kate Upton","urlProfile":"http://www.imdb.com/name/nm4478322","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTA2ODQ1MF5BMl5BanBnXkFtZTcwMjkwMDYxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1992","placeOfBirth":" St. Joseph, Michigan, USA","height":"5' 10\" (1.78 m)","bio":"Katherine Elizabeth Upton was born in St. Joseph, Michigan, to Shelley Fawn (Davis), a state tennis champion from Texas, and Jefferson Matthew Upton, a high school athletics director. Her uncle is Michigan congressman Fred Upton. Upton always knew she wanted to be a model. Since signing with IMG Models in 2010, Kate has taken the world by storm. For the past two years, Kate has graced the cover of the legendary Sports Illustrated Swimsuit issue, which has led to an onslaught of media buzz about the 21-year-old. Kate's stardom was elevated to an even higher level with her June 2013 American Vogue cover shot by Mario Testino, whose byline proclaims \"American Dream Girl: How Kate Upton Became the Hottest Supermodel on Earth.\" She has appeared on Jimmy Kimmel, Late Night with Jimmy Fallon, The Ellen Show, The Late Show, Saturday Night Live, The Dan Patrick Show, and Le Grand Journal, and continues to be one of the most searched-for names on Google. Beyond Sports Illustrated, Kate has been featured on the covers of Vogue Italia, British Vogue, CR Fashion Book, Cosmopolitan, French ELLE, GQ, Italian GQ, German GQ, Jalouse, Sunday Times Style, Esquire, The Daily, and Muse Magazine. She has appeared in fashion editorials for American Vogue, Vogue Spain, V Magazine, Harper's Bazaar, and Russian Interview, and has worked with photographers such as Mario Testino, Steven Meisel, Terry Richardson, Alasdair McLellan, Bruce Weber, Sebastian Kim, Guy Aroch, Matt Jones, Miguel Reveriego, Norman Jean Roy, Josh Olins, Gilles Bensimon, Yu Tsai, Sebastian Faena, Walter Iooss, Ellen von Unwerth, and Stewart Shining. A favorite of high-fashion notables such as Stephen Gan, Tonne Goodman, Carlyne Cerf, Carine Roitfeld, and Katie Grand, Kate was also shot for the Metropolitan Museum of Art's \"Schiaparelli and Prada: Impossible Conversations\" Exhibition Catalogue in 2012. Models.com exclaims, \"The sexy market just got a little more competitive thanks to the meteoric rise of Kate Upton. The Sports Illustrated swimsuit edition was a major coup, but the momentum keeps building with cover after cover. We can't remember the last time a newbie made such a splash!\" Kate's YouTube video of her dancing to Cali Swag District's \"Teach Me How to Dougie\" last year was the number one watched video on Twitter and Google for multiple weeks. She has an enterprising reputation for creating viral hits, and the clip has over 8 million views. Known for her vivacious personality and incredible physique, Kate has been the face for Sam Edelman, Accessorize, Guess Lingerie, Guess Jeans, Guess Accessories, Liverpool, Dylan George, and Dooney & Burke. She has also worked with Gillette, Skullcandy Headphones and Beach Bunny Swimwear, even designing a Beach Bunny Swimwear collection herself. She has starred in commercials for Mercedes-Benz, Carl's Junior and Sobe, and starred in The Other Woman (2014), by director Nick Cassavetes. Kate resides in New York City. Kate is a five-time world champion equestrian, and she enjoys hanging out at the barn, horseback riding, and is an avid sportsfan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTA2ODQ1MF5BMl5BanBnXkFtZTcwMjkwMDYxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4478322","name":"Kate Upton","idIMDB":"nm4478322"},"actorId":"nm4478322","character":"Sister Bernice","urlCharacter":"http://www.imdb.com/character/ch0309157","main":true},{"actorName":"Marianne Leone","urlProfile":"http://www.imdb.com/name/nm0502906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMTY1NTY2MV5BMl5BanBnXkFtZTcwOTQ3ODcwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1952","placeOfBirth":" Boston, Massachusetts, USA","bio":"Marianne Leone was born on January 2, 1952 in Boston, Massachusetts, USA. She is an actress, known for Goodfellas (1990), Joy (2015) and The Three Stooges (2012). She has been married to Chris Cooper since July 8, 1983. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMTY1NTY2MV5BMl5BanBnXkFtZTcwOTQ3ODcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502906","name":"Marianne Leone","idIMDB":"nm0502906"},"actorId":"nm0502906","character":"Sister Ricarda","urlCharacter":"http://www.imdb.com/character/ch0309158","main":true},{"actorName":"Brian Doyle-Murray","urlProfile":"http://www.imdb.com/name/nm0236519","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5Njc3MjgzNF5BMl5BanBnXkFtZTcwNzIyMTM0OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1945","placeOfBirth":" Chicago, Illinois, USA","birthName":"Brian Murray","height":"5' 8½\" (1.74 m)","bio":"Brian Doyle-Murray was born on October 31, 1945 in Chicago, Illinois, USA as Brian Murray. He is an actor and writer, known for Groundhog Day (1993), Caddyshack (1980) and Wayne's World (1992). He has been married to Christina Stauffer since August 28, 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5Njc3MjgzNF5BMl5BanBnXkFtZTcwNzIyMTM0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236519","name":"Brian Doyle-Murray","idIMDB":"nm0236519"},"actorId":"nm0236519","character":"Monsignor Ratliffe","urlCharacter":"http://www.imdb.com/character/ch0309160","main":true},{"actorName":"Mike 'The Situation' Sorrentino","urlProfile":"http://www.imdb.com/name/nm3725626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTc0MjE0OF5BMl5BanBnXkFtZTcwMzc4NDE5Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1982","placeOfBirth":" New Brighton, Staten Island, New York City, New York, USA","birthName":"Michael Sorrentino","height":"5' 11\" (1.8 m)","bio":"Mike 'The Situation' Sorrentino was born on July 4, 1982 in New Brighton, Staten Island, New York City, New York, USA as Michael Sorrentino. He is an actor and producer, known for Jersey Shore (2009), Comedy Central Roast of Donald Trump (2011) and The Tonight Show with Jay Leno (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTc0MjE0OF5BMl5BanBnXkFtZTcwMzc4NDE5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3725626","name":"Mike 'The Situation' Sorrentino","idIMDB":"nm3725626"},"actorId":"nm3725626","character":"The Situation","urlCharacter":"http://www.imdb.com/character/ch0275438","main":true}],"seasons":[],"idIMDB":"tt0383010","urlIMDB":"http://www.imdb.com/title/tt0383010","business":{"budget":null,"openingWeekend":[{"money":"$17,010,125","country":"USA","day":"15","month":"04","year":"2012","remarks":"3,477 Screens"}],"gross":[{"money":"$44,328,238","country":"USA","day":"12","month":"08","year":"2012","remarks":""},{"money":"$44,297,663","country":"USA","day":"05","month":"08","year":"2012","remarks":""},{"money":"$44,239,909","country":"USA","day":"29","month":"07","year":"2012","remarks":""},{"money":"$44,160,312","country":"USA","day":"22","month":"07","year":"2012","remarks":""},{"money":"$44,053,042","country":"USA","day":"15","month":"07","year":"2012","remarks":""},{"money":"$43,913,204","country":"USA","day":"08","month":"07","year":"2012","remarks":""},{"money":"$43,809,328","country":"USA","day":"01","month":"07","year":"2012","remarks":""},{"money":"$43,656,890","country":"USA","day":"24","month":"06","year":"2012","remarks":""},{"money":"$43,442,677","country":"USA","day":"17","month":"06","year":"2012","remarks":""},{"money":"$43,122,972","country":"USA","day":"10","month":"06","year":"2012","remarks":""},{"money":"$42,746,812","country":"USA","day":"03","month":"06","year":"2012","remarks":""},{"money":"$42,385,220","country":"USA","day":"27","month":"05","year":"2012","remarks":""},{"money":"$41,830,632","country":"USA","day":"20","month":"05","year":"2012","remarks":""},{"money":"$41,153,769","country":"USA","day":"13","month":"05","year":"2012","remarks":""},{"money":"$39,669,015","country":"USA","day":"06","month":"05","year":"2012","remarks":""},{"money":"$36,907,965","country":"USA","day":"29","month":"04","year":"2012","remarks":""},{"money":"$29,919,660","country":"USA","day":"22","month":"04","year":"2012","remarks":""},{"money":"$17,010,125","country":"USA","day":"15","month":"04","year":"2012","remarks":""}],"weekendGross":[{"money":"$13,794","country":"USA","day":"12","month":"08","year":"2012","remarks":"27 Screens"},{"money":"$27,495","country":"USA","day":"05","month":"08","year":"2012","remarks":"32 Screens"},{"money":"$44,253","country":"USA","day":"29","month":"07","year":"2012","remarks":"39 Screens"},{"money":"$53,445","country":"USA","day":"22","month":"07","year":"2012","remarks":"53 Screens"},{"money":"$105,596","country":"USA","day":"15","month":"07","year":"2012","remarks":"72 Screens"},{"money":"$51,142","country":"USA","day":"08","month":"07","year":"2012","remarks":"76 Screens"},{"money":"$72,567","country":"USA","day":"01","month":"07","year":"2012","remarks":"117 Screens"},{"money":"$114,004","country":"USA","day":"24","month":"06","year":"2012","remarks":"154 Screens"},{"money":"$204,303","country":"USA","day":"17","month":"06","year":"2012","remarks":"201 Screens"},{"money":"$255,804","country":"USA","day":"10","month":"06","year":"2012","remarks":"245 Screens"},{"money":"$269,381","country":"USA","day":"03","month":"06","year":"2012","remarks":"285 Screens"},{"money":"$322,573","country":"USA","day":"27","month":"05","year":"2012","remarks":"325 Screens"},{"money":"$436,495","country":"USA","day":"20","month":"05","year":"2012","remarks":"594 Screens"},{"money":"$1,078,339","country":"USA","day":"13","month":"05","year":"2012","remarks":"1,416 Screens"},{"money":"$1,832,233","country":"USA","day":"06","month":"05","year":"2012","remarks":"2,174 Screens"},{"money":"$5,167,421","country":"USA","day":"29","month":"04","year":"2012","remarks":"3,105 Screens"},{"money":"$9,764,214","country":"USA","day":"22","month":"04","year":"2012","remarks":"3,482 Screens"},{"money":"$17,010,125","country":"USA","day":"15","month":"04","year":"2012","remarks":"3,477 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"05","year":"2011","remarks":null},null],"copyrightHolder":"Twentieth Century Fox Film Corporation and Dune Entertainment III LLC in all territories except Brazil, Italy, Japan, Korea and Spain; TCF Hungary Film Rights Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation and Dune Entertainment III LLC in Brazil, Italy, Japan, Korea and Spain"},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby","Datasat"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arricam LT, Cooke S4 and Angenieux Optimo Lenses","Arricam ST, Cooke S4 and Angenieux Optimo Lenses"],"laboratory":["CineFilm Laboratory, Atlanta (GA), USA","DeLuxe, Hollywood (CA), USA (prints)","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["2,522 m (5 reels)"],"negativeFormat":["35 mm (Kodak Vision3 250D 5207)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3514DI)","D-Cinema"]},"rating":"5.1","metascore":"56","filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"rated":"PG","awards":[{"award":"ALMA Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Favorite Movie Actress-Supporting Role","names":[{"name":"Sofía Vergara","id":"nm0005527","role":null}]}]}]},{"award":"Golden Trailer Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Most Original TV Spot","names":[{"name":"Twentieth Century Fox Film Corporation","id":null,"role":null},{"name":"Refinery, The","id":null,"role":null}]}]}]},{"award":"Houston Film Critics Society Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Worst Picture","names":[]}]}]},{"award":"Razzie Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Screen Couple","names":[{"name":"Nicole 'Snooki' Polizzi","id":"nm3725472","role":null},{"name":"Mike 'The Situation' Sorrentino","id":"nm3725626","role":null},{"name":"Jenni 'Jwoww' Farley","id":"nm3725828","role":null},{"name":"Ronnie Ortiz-Magro","id":"nm3720514","role":null},{"name":"Sammi 'Sweetheart' Giancola","id":"nm3725635","role":null}]}]}]}],"votes":"26,274","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0030016","name":"Conundrum Entertainment"},{"idCompany":"co0037906","name":"Wessler Entertainment"}],"keywords":{"keywords":["orphanage","nun","the three stooges","scheme","money","reality show","cartoon sound effects","tennis court","mule","audition","fish out of water","basketball","car accident","caper","farm","foot chase","chase","jumping from height","husband wife relationship","adoptive father","arm sling","love triangle","scam","attempted murder","wedding cake","cross dressing","impostor","urination","nurse","doctor","leg brace","pistol","protest","animal attack","revolver","millionaire","escape","rooftop","hospital","ambulance","balloon","cameo","tv producer","hit in the face","insurance fraud","insurance","money problems","infidelity","cell phone","security guard","brawl","fight","fistfight","police officer","police","hotel","fart joke","car into water","car chase","explosion","fire hose used as rope","wheelchair","lion","betrayal","double cross","media coverage","news report","inheritance","bank foreclosure","surprise during end credits","scene during end credits","party","mansion","butler","trampoline","deception","extramarital affair","2010s","bald man","baby","race against time","lawyer","rat","femme fatale","falling from height","seduction","hit with a hammer","binoculars","photograph","conspiracy","orphan","friendship","young version of character","homage","restaurant","film split into chapters","no opening credits","farce","absurdism","slapstick comedy","arrest","gold digger","trophy wife","horseback riding","hdtv","cartoon on tv","villain arrested","mini trampoline","cheering","adoption","woman wearing monokini","swimming pool","miniature golf","flatulence","submerged in car","held at gunpoint","running up stairs","double barreled shotgun","anniversary party","facial scratch","octopus","lobster","tuxedo","helium balloon","skateboard","poodle","washing glasses","sick child","flyer","peanut","dolphin","african lion","polar bear","zoo","mouth wired shut","human battering ram","running from police","golf course","salmon","fire hose","clothes iron","dynamite","full body cast","changing a diaper","baby urinating","biting finger","stethoscope","false eyelashes","man dressed as a woman","disguise","hot foot","shot with an arrow","street cleaner","hit by a bus","pogo stick","bass drum","seat belt","female singer","pet rat","tandem bicycle","saluting","face slap","hit by a falling object","sledge hammer","coffee break","doughnut","golf cart","chainsaw","cheese cube","ladder","sleeping","three in a bed","duffel bag","all day lollipop","pulling hair out","bait and switch scenario","flash forward","arm cast","croquet mallet","tied to a table","three word title","slapstick","number in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:12:21"}}