{"data":{"movies":[{"title":"Dirty Dancing: Havana Nights","originalTitle":"","year":"2004","releaseDate":"20040227","directors":[{"name":"Guy Ferland","id":"nm0272704"}],"writers":[{"name":"Kate Gunzinger","id":"nm1568308"},{"name":"Peter Sagal","id":"nm0755969"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMjUyNTk5MzNeQTJeQWpwZ15BbWU2MDI0NTYyNw@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama","Music","Romance"],"plot":"In November 1958, the American teenager Katey Miller moves with her parents and her younger sister to Havana. Her father is an executive of Ford expatriated to Cuba, and Katey is an excellent high school senior student that misses her friends. The family is lodged in a fancy hotel, where Katey accidentally meets the local teenage waiter Javier Suarez. Later she sees Javier dancing in a public square and they become friends, but he is fired from the hotel because her acquaintances have seen them together. Katey invites Javier to participate of a Latin Ballroom Contest in the local Palace club to help him to raise some money, and she secretly meets him in the La Rosa Negra nightclub for rehearsals. Later they fall in love for each other in times of revolution.","simplePlot":"In November 1958, the American teenager Katey Miller moves with her parents and her younger sister to Havana. Her father is an executive of Ford expatriated to Cuba, and Katey is an ... ","actors":[{"actorName":"Diego Luna","urlProfile":"http://www.imdb.com/name/nm0526019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0MjI2NDczMl5BMl5BanBnXkFtZTcwMTgwMDgyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1979","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Diego Luna Alexander","height":"5' 10\" (1.78 m)","bio":"Diego Luna Alexander was born on December 29, 1979 in Mexico City, Mexico, to Alejandro Luna and Fiona Alexander, who worked as a costume designer. His father is Mexican and his mother was British, of Scottish and English descent. His mother died when Diego was only two, in a car accident. He soon became immersed in his father's passion, entertainment - he is the most acclaimed living theatre, cinema and opera set designer in Mexico. From an early age he began acting working in tv, movies, and theater. His first television role was in the movie The Last New Year (1991). His next role in the Mexican soap opera El abuelo y yo (1992). His childhood best friend and fellow actor Gael Garcia Bernal played the title role. After 'El Abuelo y Yo', Diego began to receive more and more parts in theater, movies and TV. His big break came in 2001 when he was cast in the critically acclaimed Y Tu Mamá También (2001), once again alongside his best friend Gael Garcia Bernal, as Tenoch Iturbide. His star continues to shine and he is making a name for himself in the American market such as starring alongside Bon Jovi in Vampires: Los Muertos (2002) and the Oscar winning Frida (2002). He has just wrapped 'Havana Nights: Dirty Dancing 2', the prequel to 'Dirty Dancing' and is working on more projects in both Latin America and the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0MjI2NDczMl5BMl5BanBnXkFtZTcwMTgwMDgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0526019","name":"Diego Luna","idIMDB":"nm0526019"},"actorId":"nm0526019","character":"Javier Suarez","urlCharacter":"http://www.imdb.com/character/ch0009386","main":true},{"actorName":"Romola Garai","urlProfile":"http://www.imdb.com/name/nm0304801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4ODg0NjAyMl5BMl5BanBnXkFtZTcwNjI5MjgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1982","placeOfBirth":" Hong Kong, British Crown Colony","birthName":"Romola Sadie Garai","height":"5' 8½\" (1.74 m)","bio":"Born in Hong Kong to father Adrian (banker) and mother Janet (journalist), Romola Garai's unusual name is the female version of Romolo, an Italian name for boys (from Latin Romulus, the founder of Rome). She grew up in Singapore and Hong Kong until she was eight when her family returned to lay roots in Wiltshire. At sixteen, she left her parents and youngest sister, Roxy, to live in London with her older sister, Rosie, and attend school at City of London's School for Girls, where her major studies were based on theatre. She got her beginnings as a professional actress when she was spotted in a school production by a casting director looking for girls to play Judi Dench in the ITV drama The Last of the Blonde Bombshells (2000). After that role, she went on with her studies, eventually enrolling in University of London where she read English, planning to become a journalist like her mother once was. But after offers for other roles began to come in, she deferred her degree and eventually quit altogether to focus more on her acting career. Romola went on to film Daniel Deronda (2002), I Capture the Castle (2003), Nicholas Nickleby (2002), Dirty Dancing: Havana Nights (2004) and Vanity Fair (2004) with Reese Witherspoon. Not to mention her role in the West End play by Michael Hastings, Calico as Lucia Joyce for which she was nominated Outstanding Newcomer by the Evening Standard Theatre Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4ODg0NjAyMl5BMl5BanBnXkFtZTcwNjI5MjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0304801","name":"Romola Garai","nicknames":["Romster"],"idIMDB":"nm0304801"},"actorId":"nm0304801","character":"Katey Miller","urlCharacter":"http://www.imdb.com/character/ch0009379","main":true},{"actorName":"Sela Ward","urlProfile":"http://www.imdb.com/name/nm0000688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NjYzNDAwN15BMl5BanBnXkFtZTYwNzMwMjA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1956","placeOfBirth":" Meridian, Mississippi, USA","birthName":"Sela Ann Ward","height":"5' 7\" (1.7 m)","bio":"Hallelujah for Sela. Everyone's favorite \"Sister\" was born Sela Ann Ward, on July 11, 1956, in Meridian, Mississippi. Sela's parents were Annie Kate (Boswell) and Granberry Holland Ward, Jr., an electrical engineer; the three younger children in the family are Jenna (1957), Berry (1959) and Brock (1961). \"Sela\" is a Hebrew word that means \"rock, boulder, cliff.\" Sela graduated from the University of Alabama in 1977, with a Bachelor of Fine Arts degree in art and advertising; Sela was also a cheerleader for the Crimson Tide football team, a Homecoming Queen and a member of the Chi Omega sorority. Sela moved to New York to work for an advertising agency. Responding to a friend's suggestion that she was tall (5'7\") and pretty enough to try modeling, Sela began a highly successful career with the Wilhelmina Agency. Sela's first gig was in the Pepsi advertising department, and her first commercial was for Maybelline. After appearing in 20 national TV commercials, Sela moved to L.A. and got her first TV role in Emerald Point N.A.S. (1983); she dated tall costar Richard Dean Anderson for 3 years (which is much longer than the TV series lasted). Sela's movie break came by appearing with Burt Reynolds in the film The Man Who Loved Women (1983), and by now her acting career was established. But perhaps Sela is best known for starring in the TV series Sisters (1991), which ran for 6 seasons. The series was a big hit with women, and if the males in the audience stuck around after the steamy (literally) opening sauna sequence, they too would discover a series with fascinating writing and story plots, with Sela as \"Teddy\"-- in the fashion industry she began her first company, which she wanted to call Teddy Wear. In 1992 and 1994, Sela got the Golden Globe nomination for best lead actress in a drama series; in 1994, she won an Emmy Award and, in 1996, the Screen Actors Guild Award. During the series' run, Sela married Howard Sherman (May 23, 1992 - present). They had two children: Austin Ward (May 13, 1994), Anabella Raye (May 30, 1998). Still very much a pretty woman, Sela appeared in Runaway Bride (1999) as Pretty Bar Woman. In 2000, Sela won her 2nd Emmy award, this time for work in Once and Again (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NjYzNDAwN15BMl5BanBnXkFtZTYwNzMwMjA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000688","name":"Sela Ward","idIMDB":"nm0000688"},"actorId":"nm0000688","character":"Jeannie Miller","urlCharacter":"http://www.imdb.com/character/ch0009388","main":true},{"actorName":"John Slattery","urlProfile":"http://www.imdb.com/name/nm0805476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTIyNDY5MV5BMl5BanBnXkFtZTgwODM2OTQyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1962","placeOfBirth":" Boston, Massachusetts, USA","birthName":"John M. Slattery Jr.","height":"5' 10\" (1.78 m)","bio":"John Slattery was born and raised in Boston, Massachusetts, the son of Joan (Mulhern), a CPA, and John \"Jack\" Slattery, a leather merchant, both of Irish descent. John landed his first TV gig on the 1988 series Dirty Dozen: The Series (1988) and has worked steadily since then. His television career has included the short-lived series Under Cover (1991), Homefront (1991), Maggie (1998) and Feds (1997); and the mini-series A Woman of Independent Means (1995) with Sally Field and From the Earth to the Moon (1998), in which he played Walter Mondale. By having recurring roles on Will & Grace (1998) as Will's big brother, \"Sam\"; Judging Amy (1999) as Amy's estranged husband; and Sex and the City (1998) as a very kinky politician, John has become one of the most in-demand character actors. In 2001, he had a role on NBC's comedy-drama Ed (2000), where he played the confident, cool, aloof high school principal \"Dennis Martino\". This role earned him much notoriety, and made him the subject of debate among Ed (2000) fans. John has also had a long, successful and diverse career in the theater. He made his theater debut in the 1989 play \"The Lisbon Traviata\", which also starred Nathan Lane. He has had several successful collaborations with the playwright Richard Greenberg and appeared in the author's \"The Extra Man\", \"Night and Her Stars\" and \"Three Days of Rain\", for which he earned critical praise for his dual roles of father and son. In 1993, John made his Broadway debut starring opposite Nathan Lane in Neil Simon's \"Laughter on the 23rd Floor\". Returning to the theater in 2000, John starred in a revival of Harold Pinter's \"Betrayal\". Making his feature film debut in 1996, John had a small role in the movie City Hall (1996). He then appeared in the movies Eraser (1996), Where's Marlowe? (1998), Traffic (2000), and the Anthony Hopkins/Chris Rock vehicle Bad Company (2002)_, before finding greater fame as one of the stars of the television series Mad Men (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTIyNDY5MV5BMl5BanBnXkFtZTgwODM2OTQyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0805476","name":"John Slattery","idIMDB":"nm0805476"},"actorId":"nm0805476","character":"Bert Miller","urlCharacter":"http://www.imdb.com/character/ch0009394","main":true},{"actorName":"Jonathan Jackson","urlProfile":"http://www.imdb.com/name/nm0005044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODcyMDQzN15BMl5BanBnXkFtZTcwODk4OTMwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1982","placeOfBirth":" Orlando, Florida, USA","birthName":"Jonathan Stevens Jackson","height":"5' 9\" (1.75 m)","bio":"Jonathan Jackson was born in Orlando, Florida, to Jeanine (Sharp), an officer manager, and Dr. Rick Lee Jackson, a family doctor and country musician. He is the younger brother of actor/singer Richard Lee Jackson and Candice E. Jackson. His ancestry includes English, German, Finnish, Scottish, and Scandinavian (Swedish, Norwegian, and Danish). Jackson's family moved to Washington state when he was very young. Jonathan gave serious thought to an acting career following a family visit to Universal Studios Hollywood in 1991. His parents decided to let their sons try their luck in acting for 6 months, and so Jonathan and Richard moved down to Los Angeles with their mother while their father stayed back in Washington with Candice. Soon after, Jonathan landed a Corn Pops commercial. He had a few commercials under his belt before he was chosen, from several hundred young hopefuls, for the sought-after role of Luke and Laura's son, \"Lucky Spencer\", on the series General Hospital (1963). His first air date was October 29, 1993. He stayed on the soap opera for 6 years as the original \"Lucky\", garnering 6 Daytime Emmy nominations and 3 Daytime Emmys for Younger Actor along the way. While shooting the soap, Jackson also made 5 movies. His film debut was with Christopher Lloyd in 1994's Camp Nowhere (1994). He also made two TV movies, The Legend of the Ruby Silver (1996) and The Prisoner of Zenda, Inc. (1996) in 1996. In 1997, he took time from the soap to shoot what would become his breakthrough film role as Michelle Pfeiffer's troubled son \"Vincent Cappadora\" in The Deep End of the Ocean (1999). In 1998, he filmed several episodes for the ABC series Boy Meets World (1993). In 1999, he again took a short break from GH to film a supporting role in the independent film True Rights (2000). After leaving the soap in 1999, Jackson was cast in a variety of films. At one point, he was considered the favorite to play \"Anakin Skywalker\" in the Star Wars films. He has played son to Sissy Spacek, William Hurt, Treat Williams, JoBeth Williams, Barbara Hershey and Judy Davis, and romantic interest to Alexis Bledel, Carly Pope, Erika Christensen, Romola Garai and Agnes Bruckner. He has also played brother to Brian Austin Green and best friend to Cillian Murphy and Nick Stahl, and has also shared the screen with Al Pacino, David Arquette and Ben Kingsley. He was also cast in Walden Media's \"The Dark is Rising\" but his scenes were cut before the film was released. Jackson's other abiding passion has been his music. He has been the lead singer and guitarist in a number of bands, most recently for Enation. Jonathan first sang his own work on General Hospital (1963) and his music has since been featured in a number of his movies. Although acting is his favorite activity, Jonathan also participates in most sports, including basketball, baseball and rollerblading. He also enjoys playing the guitar.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODcyMDQzN15BMl5BanBnXkFtZTcwODk4OTMwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005044","name":"Jonathan Jackson","nicknames":["J.J, Jon","Jono"],"idIMDB":"nm0005044"},"actorId":"nm0005044","character":"James Phelps","urlCharacter":"http://www.imdb.com/character/ch0209124","main":true},{"actorName":"January Jones","urlProfile":"http://www.imdb.com/name/nm0005064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODE1Mjg4NF5BMl5BanBnXkFtZTcwMTE5MjQ1Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1978","placeOfBirth":" Sioux Falls, South Dakota, USA","birthName":"January Kristen Jones","height":"5' 6\" (1.68 m)","bio":"January Kristen Jones was born in Sioux Falls, South Dakota, but for the first decade of her life, she was raised in Hecla, a small town of some 400 souls, in the Mount Rushmore State. She is the daughter of Karen Sue (Cox), a sporting goods store manager, and Marvin Roger Jones, a gym teacher and fitness director. She was named after January Wayne, a character in Jacqueline Susann's potboiler Once Is Not Enough (1975). She is of Czech, Danish, English, Welsh, and German ancestry. January worked at the All-American job of counter girl at Dairy Queen after school. The family eventually moved back to Sioux Falls, the largest city in South Dakota. After graduating from Roosevelt High School in Sioux Falls, she moved to New York City to become a model. Despite her stature (5'6\", which is short for a fashion model), she got modeling gigs, including Abercrombie & Fitch ads, because of her striking good looks. However, modeling was just a means to an end, to get out of South Dakota and avoid going to college. She got her first taste of acting from TV commercials and found that she had flair for it, even though she did not act in high school and had no training. January appeared in a couple of television pilots and a cable television series before making her big screen debut in All the Rage (1999), an indie that never got a real release. She followed it up with a small role in the teen thriller The Glass House (2001). Her actual debut in the sense of attracting attention was in the near silent role of the beauty who entices Jane Fonda's son, Troy Garity, in the Bruce Willis-Cate Blanchett-Billy Bob Thornton comedy Bandits (2001). It was not a career-making part. At the time the movie was released, she was ending a three-year relationship with Ashton Kutcher. Small roles followed, including a \"don't blink or you won't see me\" part in the Adam Sandler-Jack Nicholson comedy Anger Management (2003). She gained some career traction with a good role in another comedy, American Wedding (2003), a sequel to American Pie (1999). Until she landed the part on Mad Men (2007), which made its debut on AMC in 2007, her career was steady but undistinguished. \"I choose roles that are not me\", January has said. The role of Betty Draper has garnered her two Golden Globe nominations and an Emmy nomination as Best Actress. Her cool, Grace Kelly-ish blonde ice queen looks -- counterpointed by her soul burning in her bright blue eyes -- have established her as a retro icon of the 21st Century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODE1Mjg4NF5BMl5BanBnXkFtZTcwMTE5MjQ1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005064","name":"January Jones","idIMDB":"nm0005064"},"actorId":"nm0005064","character":"Eve","urlCharacter":"http://www.imdb.com/character/ch0452947","main":true},{"actorName":"Mika Boorem","urlProfile":"http://www.imdb.com/name/nm0095561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYyOTA4MGMtYzljYi00OGZiLWJjNTgtMWE1YmQ3YmVhMTdjL2ltYWdlXkEyXkFqcGdeQXVyMjAwMDUxMDc@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1987","placeOfBirth":" Tucson, Arizona, USA","birthName":"Mika Sue Boorem","height":"5' 5\" (1.65 m)","bio":"Mika Boorem is a actress, director, writer, and producer based in Los Angeles. Boorem began directing and producing plays in 2010. Boorem is best known for her acting career that began in 1994. Her feature film credits include Smile, Sleepover, Blue Crush, The Patriot, Along Came a Spider, Hearts in Atlantis, The Ward, Virgin Alexander, Good Day For It, Dirty Dancing: Havana Nights, Jack Frost, A Dark Desire, Carolina, Riding in Cars with Boys, Things You Can Tell Just by Looking at Her, Mighty Joe Young, Trucker and others. She has appeared on Dawson's Creek, House, Touched by an Angel, Ghost Whisperer. She starred in ABC Family's The Initiation of Sarah and the Lifetime Movie drama, Augusta, Gone, for which she won a Prism Award. Her work in Smile was honored at the Stony Brook Film Festival where she received the Rising Star Award. Mika was also nominated for a Teen Choice Award and four Young Artist Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYyOTA4MGMtYzljYi00OGZiLWJjNTgtMWE1YmQ3YmVhMTdjL2ltYWdlXkEyXkFqcGdeQXVyMjAwMDUxMDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095561","name":"Mika Boorem","idIMDB":"nm0095561"},"actorId":"nm0095561","character":"Susie Miller","urlCharacter":"http://www.imdb.com/character/ch0009390","main":true},{"actorName":"René Lavan","urlProfile":"http://www.imdb.com/name/nm0491762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MzA0OTY3MV5BMl5BanBnXkFtZTYwOTU4Mjcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1968","placeOfBirth":" Artemisa, Cuba","height":"5' 10\" (1.78 m)","bio":"Originally from Artemisa, Cuba, Rene Lavan debuted on Broadway in 2005 with the critically acclaimed play \"Latinologues\", a comedy about life in America. Early this year he worked with Benicio Del Toro on the feature film \"Guerrilla\" directed by Steven Soderbergh. Rene plays the young lead in Revolution Studio's \"Christmas With The Kranks\" starring opposite Tim Allen, Jaime Lee Curtis, Dan Aykroyd and Cheech Marin. This film is directed by Joe Roth. Lavan plays the role of the Revolutionary, Carlos Suarez, on LGF/Miramax's \"Havana Nights, Dirty Dancing\". He has been a guest-star on CBS's \"CSI Miami\" and on NBC's \"Las Vegas\". He co-stars in \"El Nominado\", an independent film shot in Chile in October 2003, now playing at many international film festivals. Rene was chosen as one of The Top Ten To Watch In 2004 by the San Diego Latino Film Festival. American audiences first knew Lavan when he played the role of Javier on \"One Life to Live\" for the ABC network. It was while working as a cast member on this series that he was offered the role of a lifetime as the lead in the critically acclaimed feature film \"Bitter Sugar\", directed by Leon Ichaso (Pinero). The film was inspired by true events of the oppressive Cuban regime governed by Fidel Castro. It chronicles the character of Gustavo (Lavan), an honor student and Castro supporter who could no longer tolerate the decay and repression in his beloved Cuba. Lavan received rave reviews and the film was very well received, both domestically and internationally. Rene first gained recognition as an actor co-starring in one of the most popular Spanish telenovelas ever \"Morelia\". He has since starred in the very popular telenovelas (TV series) \"Maria Belen\" and \"Enamorada\". He has become an internationally re-known actor and is a household name in Spanish speaking homes around the world. His soaps and films have been seen in over one hundred countries. Fluent in both English and Spanish Rene has been working steadily in both the General and Spanish markets since receiving his education at the prestigious New World school of the arts, Performance and Visual Arts Center and with Uta Hagen. Lavan co-starred in the half-hour sitcom pilot \"Macio\" for UPN and starred in the independent film \"The Emerald Cut.\" Rene has appeared in hundreds of television and radio commercials and has hosted the following TV shows: The Billboard Music Awards, Fox Sports and Suenos de Fama (Star Search) to name a few. Lavan has graced the pages of American publications such as \"Vanity Fair\", \"Harper's Bazaar\", \"Details\", \"W\" and hundreds of Spanish publications such as \"Vanidades\", \"Cosmopolitan\", \"Cristina\" and recently was named \"one of the 25 most Beautiful\" of \" People en Espanol Magazine\". Rene Lavan is a true crossover actor in every sense of the word, from film to television, from drama to comedy. He is one of the few actors that have successfully made a name in both the General and Spanish Markets. His latest challenge is starring and producing Latino theme television shows and films for his newly formed production company","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MzA0OTY3MV5BMl5BanBnXkFtZTYwOTU4Mjcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0491762","name":"René Lavan","idIMDB":"nm0491762"},"actorId":"nm0491762","character":"Carlos Suarez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mya","urlProfile":"http://www.imdb.com/name/nm0616550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzgwNTY1OV5BMl5BanBnXkFtZTcwMTY1MDYxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1979","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Mya Marie Harrison","height":"5' 4½\" (1.64 m)","bio":"Mýa Marie Harrison (born October 10, 1979), professionally referred to as Mýa, is an American R&B and pop recording artist, entertainer, philanthropist, and actress. A Washington, D.C. native, as a young child, Harrison took ballet lessons from the age of two and added jazz and tap dancing lessons to her schedule two years later. As she entered her teens, Harrison began to shift her focus to music. Gifted and musically-inclined, with the help of her parents she put together a demo tape when she was 15 and found the interest of a record label while still attending high school. At the age of 16, she began recording her first solo album later to be released on Interscope Records. Harrison's eponymous debut album through Interscope Records was released in the spring of April 1998. It sold over one million copies in the United States, producing the gold-certified top ten single \"It's All About Me\" featuring Sisqó.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzgwNTY1OV5BMl5BanBnXkFtZTcwMTY1MDYxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0616550","name":"Mya","nicknames":["Ms. Caramel"],"idIMDB":"nm0616550"},"actorId":"nm0616550","character":"Lola Martinez","urlCharacter":"http://www.imdb.com/character/ch0009395","main":true},{"actorName":"Polly Cole","urlProfile":"http://www.imdb.com/name/nm0193826","urlPhoto":"","biography":{"bio":"A classically trained actress, Polly Cole made her feature film debut opposite Romola Garai and January Jones in Dirty Dancing: Havana Nights. She garnered strong reviews for her turn as a meth addict opposite Anson Mount in the gritty indie Cook County and recently co-wrote and starred in another indie feature, Amber Lake. Polly has recurred and guest starred on many popular television shows such as Criminal Minds and Cold Case. A graduate of Vassar College and The Oxford School of Drama in England, Polly has also appeared in several stage productions including runs of John Patrick Shanley's Women of Manhattan and The Dreamer Examines His Pillow as well as the world premiere of Bad Hurt on Cedar Street. In addition to acting, Polly is an accomplished photographer; her photos have been featured in The New York Times and The Los Angeles Times as well as in the pages of various travel and lifestyle magazines.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0193826","name":"Polly Cole","idIMDB":"nm0193826"},"actorId":"nm0193826","character":"Polly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Engen","urlProfile":"http://www.imdb.com/name/nm0257346","urlPhoto":"","biography":{"dateOfBirth":"25 October 1979","placeOfBirth":" Apple Valley, California, USA","bio":"Chris Engen is best known for his role of Adam Wilson on \"The Young and the Restless\". He began playing this role on February 12, 2008, and left around mid-may of the following year. After he was replaced, speculation arose that the actor left because he did not agree with the direction his character was going.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0257346","name":"Chris Engen","idIMDB":"nm0257346"},"actorId":"nm0257346","character":"Steph","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Kavelin","urlProfile":"http://www.imdb.com/name/nm1572440","urlPhoto":"","biography":{"bio":"Tommy Kavelin is an actor, known for Dirty Dancing: Havana Nights (2004), Welcome to the Jungle (2013) and One Hot Summer (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1572440","name":"Tommy Kavelin","idIMDB":"nm1572440"},"actorId":"nm1572440","character":"Señor Alonso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wilmer Cordero","urlProfile":"http://www.imdb.com/name/nm1565898","urlPhoto":"","biography":{"bio":"Wilmer Cordero is an actor, known for Dirty Dancing: Havana Nights (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1565898","name":"Wilmer Cordero","idIMDB":"nm1565898"},"actorId":"nm1565898","character":"Teacher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlie Rodriguez","urlProfile":"http://www.imdb.com/name/nm1579400","urlPhoto":"","biography":{"bio":"Charlie Rodriguez is an actor, known for Dirty Dancing: Havana Nights (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1579400","name":"Charlie Rodriguez","idIMDB":"nm1579400"},"actorId":"nm1579400","character":"Grandpa Suarez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donato Poveda","urlProfile":"http://www.imdb.com/name/nm0232254","urlPhoto":"","biography":{"birthName":"Donato Poveda López","bio":"Donato Poveda was born as Donato Poveda López.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0232254","name":"Donato Poveda","idIMDB":"nm0232254"},"actorId":"nm0232254","character":"Troubador","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0338096","urlIMDB":"http://www.imdb.com/title/tt0338096","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,811,325","country":"USA","day":"29","month":"02","year":"2004","remarks":"2,042 Screens"},{"money":"€125,854","country":"Netherlands","day":"09","month":"05","year":"2004","remarks":"50 Screens"}],"gross":[{"money":"$14,140,215","country":"USA","day":"18","month":"04","year":"2004","remarks":""},{"money":"$14,070,444","country":"USA","day":"11","month":"04","year":"2004","remarks":""},{"money":"$14,007,836","country":"USA","day":"04","month":"04","year":"2004","remarks":""},{"money":"$13,848,674","country":"USA","day":"28","month":"03","year":"2004","remarks":""},{"money":"$13,409,744","country":"USA","day":"21","month":"03","year":"2004","remarks":""},{"money":"$12,382,121","country":"USA","day":"14","month":"03","year":"2004","remarks":""},{"money":"$10,149,976","country":"USA","day":"07","month":"03","year":"2004","remarks":""},{"money":"$5,811,325","country":"USA","day":"29","month":"02","year":"2004","remarks":""},{"money":"€933,516","country":"Italy","day":"26","month":"09","year":"2004","remarks":""},{"money":"€435,901","country":"Italy","day":"19","month":"09","year":"2004","remarks":""},{"money":"€112,107","country":"Italy","day":"22","month":"08","year":"2004","remarks":""},{"money":"€519,973","country":"Netherlands","day":"06","month":"06","year":"2004","remarks":""},{"money":"€171,570","country":"Netherlands","day":"09","month":"05","year":"2004","remarks":""}],"weekendGross":[{"money":"$50,671","country":"USA","day":"18","month":"04","year":"2004","remarks":"127 Screens"},{"money":"$29,426","country":"USA","day":"11","month":"04","year":"2004","remarks":"46 Screens"},{"money":"$53,516","country":"USA","day":"04","month":"04","year":"2004","remarks":"81 Screens"},{"money":"$184,568","country":"USA","day":"28","month":"03","year":"2004","remarks":"189 Screens"},{"money":"$472,351","country":"USA","day":"21","month":"03","year":"2004","remarks":"477 Screens"},{"money":"$1,396,187","country":"USA","day":"14","month":"03","year":"2004","remarks":"1,239 Screens"},{"money":"$2,962,008","country":"USA","day":"07","month":"03","year":"2004","remarks":"2,042 Screens"},{"money":"$5,811,325","country":"USA","day":"29","month":"02","year":"2004","remarks":"2,042 Screens"},{"money":"€49,429","country":"Italy","day":"26","month":"09","year":"2004","remarks":"44 Screens"},{"money":"€159,987","country":"Italy","day":"19","month":"09","year":"2004","remarks":"113 Screens"},{"money":"€23,471","country":"Netherlands","day":"06","month":"06","year":"2004","remarks":"43 Screens"},{"money":"€125,854","country":"Netherlands","day":"09","month":"05","year":"2004","remarks":"50 Screens"}],"admissions":[{"money":"71,257","country":"Switzerland","day":"28","month":"07","year":"2004","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"18","month":"03","year":"2003","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA","iO Film, North Hollywood (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"6.0","metascore":"39","filmingLocations":[{"location":"Puerto Rico"}],"rated":"PG-13","awards":[],"votes":"22,828","type":"Movie","companyCreditsSimple":[{"idCompany":"co0060306","name":"Lions Gate Films"},{"idCompany":"co0022594","name":"Miramax"},{"idCompany":"co0093776","name":"Lawrence Bender Productions"}],"keywords":{"keywords":["dancing","revolution","cuba","love","nightclub","dance instructor","woman wearing only a man's shirt","beach","father daughter relationship","sister sister relationship","protective male","lingerie slip","forbidden love","coming of age","couple","dance lesson","dance club","salsa","sequel","havana cuba","interracial romance"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:47:35"}}