{"data":{"movies":[{"title":"The Grudge","originalTitle":"","year":"2004","releaseDate":"20041022","directors":[{"name":"Takashi Shimizu","id":"nm1234345"}],"writers":[{"name":"Stephen Susco","id":"nm0839812"},{"name":"Takashi Shimizu","id":"nm1234345"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxODg1Nzc3NF5BMl5BanBnXkFtZTcwMjM0MjEzMw@@._V1.jpg","countries":["USA","Japan"],"languages":["English","Japanese"],"genres":["Horror","Mystery","Thriller"],"plot":"Karen Davis, an American Nurse, moves to Tokyo and encounters a supernatural spirit who is vengeful and often possesses its victims. A series of horrifying and mysterious deaths start to occur, with the spirit passing its curse onto each victim. Karen must now find away to break this spell, before she becomes its next victim.","simplePlot":"An American nurse living and working in Tokyo is exposed to a mysterious supernatural curse, one that locks a person in a powerful rage before claiming their life and spreading to another victim.","actors":[{"actorName":"Sarah Michelle Gellar","urlProfile":"http://www.imdb.com/name/nm0001264","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA5MDA4MTEwOV5BMl5BanBnXkFtZTcwNzY2MjcyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1977","placeOfBirth":" New York City, New York, USA","height":"5' 4\" (1.63 m)","bio":"Emmy Award-winning Sarah Michelle Gellar was born on April 14, 1977 in New York City, the daughter of Rosellen (Greenfield), who taught at a nursery school, and Arthur Gellar, who worked in the garment industry. Her maternal grandparents were Hungarian Jewish immigrants, and her father was also from a Jewish family. Eating in a local restaurant, Sarah was discovered by an agent when she was 4 years old. Soon after, she was making her first movie An Invasion of Privacy (1983). Besides a long list of movies, she has also appeared in many TV commercials and on the stage. Her breakthrough came with the television series Swans Crossing (1992). During 1997, she became known to the cinema audience when she appeared in two movies: I Know What You Did Last Summer (1997) and Scream 2 (1997). But she is most commonly known for her title role in the long-running television series Buffy the Vampire Slayer (1997). She also won an Emmy Award for her performance as Kendall Hart on the soap opera All My Children (1970). Sarah has since appeared in several movies, including Simplement irrésistible (1999), Cruel Intentions (1999) and the live-action Scooby-Doo (2002) movies as the lovable Daphne Blake. She also provided her voice to several movies, including Small Soldiers (1998), Happily N'Ever After (2006) and TMNT- les tortues ninja (2007), starred in the box office hit The Grudge (2004), and co-starred with Robin Williams and James Wolk in the television series The Crazy Ones (2013). She resides in Los Angeles, California, with her husband, Freddie Prinze Jr.. They have been married since 2002, and have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA5MDA4MTEwOV5BMl5BanBnXkFtZTcwNzY2MjcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001264","name":"Sarah Michelle Gellar","nicknames":["Sassy","SMG"],"idIMDB":"nm0001264"},"actorId":"nm0001264","character":"Karen","urlCharacter":"http://www.imdb.com/character/ch0006890","main":true},{"actorName":"Jason Behr","urlProfile":"http://www.imdb.com/name/nm0004736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDY5OTA3OF5BMl5BanBnXkFtZTgwNTU3NjEyNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1973","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Jason Nathaniel Behr","height":"6' (1.83 m)","bio":"Jason Nathaniel Behr was born on December 30, 1973 in Minneapolis, Minnesota, to Patricia Ann (Steiner) and David Paul Behr. His ancestry includes Swiss-German, German, Austrian, Irish, English, and Danish. Jason began acting at the age of five, appearing in a number of theatrical productions, commercials, voice overs and modeling. Jason continued to perform throughout his school years. At the age of nineteen, following his graduation from Richfield Senior High School, Jason moved out to Los Angeles. Shortly after his arrival, Jason began a series of guest roles on popular television shows such as Step by Step (1991), JAG (1995), Buffy the Vampire Slayer (1997), 7th Heaven (1996) and Dawson's Creek (1998). In 1998, Jason made his film debut in the film Pleasantville (1998), starring Reese Witherspoon, Tobey Maguire and William H. Macy. This role was followed up by another role in the indie film Rites of Passage (1999), opposite James Remar and Dean Stockwell, where Jason garnered praised for his portrayal of a young homosexual male. Jason was cast in his first leading role on the television series Roswell (1999) playing \"Max Evans\". The show ran from 1999 to 2002. In 2001, Jason appeared alongside Kevin Spacey, Cate Blanchett and Judi Dench in The Shipping News (2001). The role earned him a Movieline Award for Standout performance. Jason continued to appear in indie films such as Happily Even After (2004), an independent film which premiered at the Tribeca Film Festival in New York City. More indie films followed, including Happily Even After (2004), Shooting Livien (2005), Man of God (2005), Senseless (2008) and The Tattooist (2007). In 2005, Jason starred opposite former \"Buffy\" star Sarah Michelle Gellar in the supernatural thriller The Grudge (2004). Most recently, Jason finished two unaired pilots for the Fox and NBC networks, respectively. He completed another indie film, 'The Last International Playboy\", which played at both the Slamdance and Gen Art film festivals and was released in select theaters on July 12, 2009. Jason married actress KaDee Strickland in 2006. The couple have a son, Atticus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDY5OTA3OF5BMl5BanBnXkFtZTgwNTU3NjEyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004736","name":"Jason Behr","nicknames":["Jay"],"idIMDB":"nm0004736"},"actorId":"nm0004736","character":"Doug","urlCharacter":"http://www.imdb.com/character/ch0006891","main":true},{"actorName":"William Mapother","urlProfile":"http://www.imdb.com/name/nm0544611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzkyMTgyOF5BMl5BanBnXkFtZTcwODI1MTkzNQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1965","placeOfBirth":" Louisville, Kentucky, USA","birthName":"William Reibert Mapother Jr.","height":"6' 1\" (1.85 m)","bio":"William Mapother was born on April 17, 1965 in Louisville, Kentucky, USA as William Reibert Mapother Jr. He graduated from the University of Notre Dame with a B.A. in English. He is the co-founder of the film finance marketplace Slated. He is known for his work on Lost (2004), In the Bedroom (2001) and Another Earth (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzkyMTgyOF5BMl5BanBnXkFtZTcwODI1MTkzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544611","name":"William Mapother","idIMDB":"nm0544611"},"actorId":"nm0544611","character":"Matthew","urlCharacter":"http://www.imdb.com/character/ch0222440","main":true},{"actorName":"Clea DuVall","urlProfile":"http://www.imdb.com/name/nm0245112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU0NDc3MTM4NV5BMl5BanBnXkFtZTcwMjY4Mzc1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1977","placeOfBirth":" Los Angeles, California, USA","birthName":"Clea Helen D'etienne DuVall","height":"5' 5\" (1.65 m)","bio":"Clea DuVall was born in Los Angeles on September 25, 1977, to Rosemary (Hatch) and actor Steph DuVall. DuVall's teenage years presented her with many challenges. Her parents divorced when she was twelve, and, when her mother remarried, DuVall moved out because she did not feel at home in the newly-reconstituted family, dropping out of high school and getting her own apartment. An only child, she sought entertainment in movies and television programs, which she consumed voraciously, memorizing entire scenes from movies. Though a rather shy person, DuVall decided she wanted to be an actress, and returned to high school, this time the Los Angeles High School of the Arts. However, the rigors of independent living (she had to work to support herself) meant that she could spend little time in class, and, as a result, she fared poorly in the school. Nonetheless, DuVall had intensity, commitment and strong natural talent, and soon after graduating, the roles began to come, at first guest spots in television programs and small roles in small films. Soon her first major role came, in Robert Rodriguez's successful 1998 take on the alien-body-snatcher genre, The Faculty (1998), which featured many other up-and-coming young actors such as Elijah Wood and Josh Hartnett, as well as a strong cast of established adult performers. DuVall played Stokely, a bizarre, tough Goth Girl. This role was typical of DuVall's casting - the outsider, attractive though in an edgy and sometimes slightly disturbing way. (DuVall is pretty and can be glamorous, or can appear rough-around-the-edges, for a role.) Similar roles came in But I'm a Cheerleader (1999) as a tattooed lesbian and Girl, Interrupted (1999) as a mental patient. DuVall is a complex person - soft-spoken and friendly, yet tough and independent - and she ably lends this complexity to her characters, making her a popular casting choice. She continues to turn in strong performances in such productions as the ensemble thriller Identity (2003), the HBO Gen-X supernatural series La caravane de l'étrange (2003) and the critically-praised 21 Grams (2003). DuVall is a chain smoker and a close friend of director Jamie Babbit. She is no relation to veteran actors Robert Duvall or Shelley Duvall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU0NDc3MTM4NV5BMl5BanBnXkFtZTcwMjY4Mzc1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0245112","name":"Clea DuVall","idIMDB":"nm0245112"},"actorId":"nm0245112","character":"Jennifer","urlCharacter":"http://www.imdb.com/character/ch0222439","main":true},{"actorName":"KaDee Strickland","urlProfile":"http://www.imdb.com/name/nm0834380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzMwNDc5OV5BMl5BanBnXkFtZTcwNzgzNjI4Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1975","placeOfBirth":" Patterson, Georgia, USA","birthName":"Katherine Dee Strickland","height":"5' 5\" (1.65 m)","bio":"KaDee Strickland was born on December 14, 1975 in Patterson, Georgia, USA as Katherine Dee Strickland. She is an actress, known for Private Practice (2007), The Sixth Sense (1999) and The Grudge (2004). She has been married to Jason Behr since November 10, 2006. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzMwNDc5OV5BMl5BanBnXkFtZTcwNzgzNjI4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834380","name":"KaDee Strickland","idIMDB":"nm0834380"},"actorId":"nm0834380","character":"Susan","urlCharacter":"http://www.imdb.com/character/ch0222441","main":true},{"actorName":"Grace Zabriskie","urlProfile":"http://www.imdb.com/name/nm0951471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4ODkyOF5BMl5BanBnXkFtZTgwMTc5NDIzNTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1941","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Grace Zabriskie Caplinger","height":"5' 4\" (1.63 m)","bio":"\"Amazing Grace\" Zabriskie was born in New Orleans, Louisiana. She wrote her own original poetry, then performed at coffee shops and various artist hangouts in Atlanta. She was also a wonderful silk-screen printmaker. She moved to Hollywood and made her acting debut in Norma Rae (1979). She went on to appear in over 80 movies. She gave an acclaimed performance as Mrs. Ames in East of Eden (1981), the adaptation of John Steinbeck's novel. Grace appeared in the highly acclaimed and Oscar-nominated An Officer and a Gentleman (1982) and The Big Easy (1986), set in her beloved New Orleans. She worked with producer and director David Lynch, and was a series regular in the cult favorite Twin Peaks (1990) as Sarah Palmer, the part with which she is most often identified. She also appeared in Lynch's Wild at Heart (1990) the same year. She has played a wide variety of roles, and gave a terrific performance in the Oscar-nominated Fried Green Tomatoes (1991) and showed great character depth as the lonely and despondent widow in The Passion of Darkly Noon (1995). Grace's more recent roles were in the zany Sparkler (1997) and in the big-name feature Sans motif apparent (2002), based on a short story by Dashiell Hammett. A woman of many talents, she is currently creating her own original paintings, unique sculptures and woodwork art that can be viewed in Los Angeles galleries. Her visual arts, which include creating lamps or \"sculptures with light\" as she calls them, are available from the L.A.-based ArtHaus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4ODkyOF5BMl5BanBnXkFtZTgwMTc5NDIzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0951471","name":"Grace Zabriskie","nicknames":["Gracie"],"idIMDB":"nm0951471"},"actorId":"nm0951471","character":"Emma","urlCharacter":"http://www.imdb.com/character/ch0222437","main":true},{"actorName":"Bill Pullman","urlProfile":"http://www.imdb.com/name/nm0000597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mzk2MDEyM15BMl5BanBnXkFtZTgwMTczMDQzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1953","placeOfBirth":" Hornell, New York, USA","birthName":"William James Pullman","height":"6' 1½\" (1.87 m)","bio":"William James Pullman was born in Hornell, New York, one of seven children of Johanna (Blaas), a nurse, and James Pullman, a doctor. He is of Dutch (mother) and English, Northern Irish, and Scottish (father) descent. After high school, Bill went into a building construction program at SUNY Delhi in New York. He transferred to State University of New York College at Oneonta where he received his BA in Theater. He received both his MFA in Theater/Directing and an honorary PHD from University of Massachusetts at Amherst. While teaching Directing at Montana State University in Bozeman, Montana, one of Bill's students was the soon-to-be film director John Dahl, who later cast Mr. Pullman in \"The Last Seduction\". Moving to New York City, he worked with Kathy Bates in the acclaimed stage production of \"Curse of the Starving Class\". However, it was his first work in three strikingly diverse films that brought him to the attention of his audience: \"Ruthless People\" with Danny DeVito and Bette Milder, the Mel Brooks hit \"Spaceballs\" and the Oscar-nominated (and winner for Best Actress Gina Davis) \"The Accidental Tourist\". Still attracted to the art and study of building construction, Bill has designed and/or restored three \"barns\": In Montana, he converted a 1933 barn at his ranch into his family home. In Los Angeles, he built a Truss barn in the style of LA's 1910 fruit storage barns. In western New York State, he restored a '3-bay' barn that sometimes serves as a community center near his hometown of Hornell, New York. Focused more on neighborhoods than show business-based charities and societies, Pullman has defined himself by his work with his local communities. He works to bridge communities of Los Angeles through his board work with Cornerstone Theater. Pullman continues to work with his neighbors who formed \"Concerned Citizens Montana\" to secure a place at the table regarding the national need for a smart grid for energy transmission. He also works with the local university (Alfred University, New York) as well as supports local health services (\"The Pullman Women's Health and Birthing Center\" at St James Hospital, Hornell, NY). Pullman is also an MS Society Ambassador. Based in Los Angeles, New York City and Western Montana, Pullman is married to the dancer, Tamara Hurwitz Pullman, and they have three children, daughter singer/songwriter Maesa Rae, and multi-talented sons Jack and Lewis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mzk2MDEyM15BMl5BanBnXkFtZTgwMTczMDQzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000597","name":"Bill Pullman","idIMDB":"nm0000597"},"actorId":"nm0000597","character":"Peter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rosa Blasi","urlProfile":"http://www.imdb.com/name/nm0087726","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzU3NzM5MF5BMl5BanBnXkFtZTcwNjgyNTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1972","placeOfBirth":" Chicago, Illinois, USA","height":"5' 2\" (1.57 m)","bio":"A native of Chicago, Rosa comes from a strong theater background, having performed in more than 40 professional productions beginning at age eight; ranging from comedy at the esteemed Piven Performance Company, as well as Second City, to starring in numerous musicals and touring with Kenny Rogers. Blasi's television debut was a recurring role on the CBS soap opera, \"The Bold and the Beautiful.\" Soon to follow was a starring role on the MTV/UPN sitcom \"Hitz.\" Rosa's rare combination of sex appeal and comedic timing landed her guest roles on hit shows such as \"Frasier,\" \"Becker,\" \"Caroline in the City,\" \"Drew Carey,\" \"Grown Up,\" \"Holding the Baby\" and \"Beverly Hills, 90210.\" and then went on to star in the hit LIfetime series \"Strong Medicine.\" She later starred in the dramatic Showtime film, \"Noriega: God's Favorite,\" which was shot in the Philippines. The film was directed by Roger Spottiswoode, and co-starred Bob Hoskins. Both the film and Blasi's performance were critically acclaimed. Blasi recently starred in the Vagina Monologues at the Apollo Theater and has recorded numerous radio and television voice-overs. Her sharp tongue and quick wit have earned her a reputation as a favorite and often repeat guest on talk shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzU3NzM5MF5BMl5BanBnXkFtZTcwNjgyNTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0087726","name":"Rosa Blasi","idIMDB":"nm0087726"},"actorId":"nm0087726","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted Raimi","urlProfile":"http://www.imdb.com/name/nm0001646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTIwMTI4Nl5BMl5BanBnXkFtZTcwNjQ3OTExOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1965","placeOfBirth":" Detroit, Michigan, USA","birthName":"Theodore R. Raimi","height":"6' 2\" (1.88 m)","bio":"Ted Raimi was born on December 14, 1965 in Detroit, Michigan, USA as Theodore R. Raimi. He is an actor and writer, known for Ash vs Evil Dead (2015), Spider-Man 3 (2007) and The Midnight Meat Train (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTIwMTI4Nl5BMl5BanBnXkFtZTcwNjQ3OTExOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001646","name":"Ted Raimi","nicknames":["Theo"],"idIMDB":"nm0001646"},"actorId":"nm0001646","character":"Alex","urlCharacter":"http://www.imdb.com/character/ch0028012","main":true},{"actorName":"Ryo Ishibashi","urlProfile":"http://www.imdb.com/name/nm0410903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYxNzY2ODQ3OF5BMl5BanBnXkFtZTcwMjA1NzMzOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1956","placeOfBirth":" Kurume, Fukuoka, Japan","birthName":"Hideki Ishibashi","height":"5' 7\" (1.7 m)","bio":"Ishibashi Ryo (Ryo Ishibashi) was born on July 20, 1956, in Fukuoka City, Kyushu, Japan. Being a multi-talented star, and an international celebrity, Ryo Ishibashi has starred in many TV programs, and movies both within his native Japan, and abroad. He began his celebrity career when he started his own rock band the ARB (Alexiander's Ragtime Band) in 1977, which made their recording debut on October 29, 1978. He released over a dozen records with the band until their breakup in 1990. Ryo Ishibashi started his acting career in 1986 when he became acquainted with the late actor Yûsaku Matsuda (who was also internationally known for his co-starring role with Michael Douglas in the movie Black Rain (1989)). He made his movie debut in Matsuda's movie \"Ahomance\" in which ARB's 13th single \"After 45\" was used as its theme song. Ryo Ishibashi has been concentrating on his acting career since his split with ARB in 1990, and has appeared in several movies outside his native country Japan, and became an internationally recognized celebrity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYxNzY2ODQ3OF5BMl5BanBnXkFtZTcwMjA1NzMzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0410903","name":"Ryo Ishibashi","idIMDB":"nm0410903"},"actorId":"nm0410903","character":"Nakagawa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yôko Maki","urlProfile":"http://www.imdb.com/name/nm1536988","urlPhoto":"","biography":{"dateOfBirth":"15 October 1982","placeOfBirth":" Chiba, Japan","height":"5' 3\" (1.6 m)","bio":"At her young age, Yoko Maki is already a well-rounded actress. 2001 proved to be a busy year for the young actress, beginning with her film debut at the age of 19, in the film Drug, directed by Hiroshi Sugawara. This was quickly followed by Pelican Road. More attention was then garnered with her role as Aya in the highly modernized remake of the Japanese vengeance film Lady Snowblood, re-titled as The Princess Blade. Not one to be confined solely to the screen, Maki spent 2002 acting on stage: first in her highly acclaimed performance in \"Cross\", produced by the Asagaya Spiders and directed by Keishi Nagatsuka, and second in the November 2002 Third Stage Show series production of \"This Time It's Real\", directed by Kyoichi Itagaki. 2003 saw a return to form for Maki, as she appeared in the sequel to the groundbreaking cult hit Battle Royale, Battle Royale II, as the member of one of the \"Wild Seven.\" With her fan-base and critical acclaim growing, Maki continued to live up to such praise by keeping busy in 2004 with roles in films such as Shimotsuma Monogatari, Ren-ai Shousetsu, Koibumi Biyori, and Kansen. 2004 would also be the year of three great accomplishments for the then 22 year old. First, there was her role in the short film, Do Androids Dream of Electric Santa? directed by Hirohisa Sasaki, which saw its debut at the American Film Market. Second, was her work as an on location reporter in Thailand for the television documentary, Ururun-Taizaiki. Third and most exciting of all, was her role in Takashi Shimizu's big budget Hollywood film The Grudge, which was a remake of his original Ju-On: The Grudge, the third of the Japanese Ju-On horror film series. Starring American actors Sarah Michelle Gellar and Bill Pullman, The Grudge was at the top of the U.S. film box office for two weeks straight upon its release. Maki stood out amongst the cast in her first film introduction to American audiences as the doomed caretaker/nurse, Yoko, whose grim fate has left an indelible impression. Come 2005, more film opportunities opened up to Maki as she starred in more principal roles, starting with Pattchigi!, which garnered awards such as the 9th Pusan International Film Festival \"A window on Asian cinema\" and the 17th Tokyo International Film Festival Official Invitation. More roles followed in the films In the Pool, The Summer Time Machine Blues, and A Rain Town. When not appearing on the screen and stage, Maki keeps busy with work on numerous television dramas such as \"The Tokyo Friends\" among others, and appearances in commercials. An avid film fan herself, Maki enjoys watching films in her spare time, as well as keeping active in track and field sports and wire action. As time marches on, Maki continues to keep busy as more and more prospective film and television work opens up to her. And with such a strong work ethic and dedication to perfecting her craft in all mediums, Yoko Maki has a bright, promising, future ahead of her.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1536988","name":"Yôko Maki","idIMDB":"nm1536988"},"actorId":"nm1536988","character":"Yoko","urlCharacter":"http://www.imdb.com/character/ch0028636","main":true},{"actorName":"Yuya Ozeki","urlProfile":"http://www.imdb.com/name/nm1505005","urlPhoto":"","biography":{"dateOfBirth":"5 June 1996","placeOfBirth":" Tokyo, Japan","bio":"Yuya Ozeki was born on June 5, 1996 in Tokyo, Japan. He is an actor, known for The Grudge (2004), Ju-on: The Grudge (2002) and Ju-on: The grudge 2 (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1505005","name":"Yuya Ozeki","idIMDB":"nm1505005"},"actorId":"nm1505005","character":"Toshio","urlCharacter":"http://www.imdb.com/character/ch0006903","main":true},{"actorName":"Takako Fuji","urlProfile":"http://www.imdb.com/name/nm1232416","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMxNzEwOTg4NV5BMl5BanBnXkFtZTcwNDAxMTQyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1972","placeOfBirth":" Tokyo, Japan","height":"5' 5\" (1.65 m)","bio":"Born in Tokyo on July 27th 1972, Takako Fuji started her career when she joined En Theatrical Campany when she was studying acting at Aoyama Gakuin University. She was mainly playing on the stage or voice-over, and had the screen debut in 2003 as Kayako Saeki in \"Ju-On\" directed by Takashi Shimizu. Her specialty is dancing modern ballet, and speaking English.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMxNzEwOTg4NV5BMl5BanBnXkFtZTcwNDAxMTQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1232416","name":"Takako Fuji","idIMDB":"nm1232416"},"actorId":"nm1232416","character":"Kayako","urlCharacter":"http://www.imdb.com/character/ch0006900","main":true},{"actorName":"Takashi Matsuyama","urlProfile":"http://www.imdb.com/name/nm0559690","urlPhoto":"","biography":{"dateOfBirth":"2 April 1960","placeOfBirth":" Tokyo, Japan","bio":"Takashi Matsuyama was born on April 2, 1960 in Tokyo, Japan. He is an actor, known for Ghost in the Shell (1995), The Wolverine (2013) and The Grudge (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0559690","name":"Takashi Matsuyama","idIMDB":"nm0559690"},"actorId":"nm0559690","character":"Takeo","urlCharacter":"http://www.imdb.com/character/ch0006904","main":true},{"actorName":"Hiroshi Matsunaga","urlProfile":"http://www.imdb.com/name/nm0559588","urlPhoto":"","biography":{"bio":"Hiroshi Matsunaga is known for his work on The Grudge (2004), Waterboys (2001) and The Woman Prosecutor of Kyôto (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0559588","name":"Hiroshi Matsunaga","idIMDB":"nm0559588"},"actorId":"nm0559588","character":"Igarashi","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0391198","urlIMDB":"http://www.imdb.com/title/tt0391198","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$39,128,715","country":"USA","day":"24","month":"10","year":"2004","remarks":"3,245 Screens"},{"money":"£2,261,710","country":"UK","day":"07","month":"11","year":"2004","remarks":"362 Screens"},{"money":"€1,539,138","country":"Italy","day":"09","month":"01","year":"2005","remarks":"327 Screens"},{"money":"€430,155","country":"Netherlands","day":"09","month":"01","year":"2005","remarks":"71 Screens"}],"gross":[{"money":"$110,175,871","country":"USA","day":"19","month":"12","year":"2004","remarks":""},{"money":"$109,903,025","country":"USA","day":"12","month":"12","year":"2004","remarks":""},{"money":"$109,231,802","country":"USA","day":"05","month":"12","year":"2004","remarks":""},{"money":"$107,778,950","country":"USA","day":"28","month":"11","year":"2004","remarks":""},{"money":"$104,422,638","country":"USA","day":"21","month":"11","year":"2004","remarks":""},{"money":"$99,248,187","country":"USA","day":"14","month":"11","year":"2004","remarks":""},{"money":"$88,755,563","country":"USA","day":"07","month":"11","year":"2004","remarks":""},{"money":"$70,684,627","country":"USA","day":"31","month":"10","year":"2004","remarks":""},{"money":"$39,128,715","country":"USA","day":"24","month":"10","year":"2004","remarks":""},{"money":"£7,743,528","country":"UK","day":"12","month":"12","year":"2004","remarks":""},{"money":"£7,594,339","country":"UK","day":"05","month":"12","year":"2004","remarks":""},{"money":"£7,175,344","country":"UK","day":"28","month":"11","year":"2004","remarks":""},{"money":"£6,339,134","country":"UK","day":"21","month":"11","year":"2004","remarks":""},{"money":"£4,875,891","country":"UK","day":"14","month":"11","year":"2004","remarks":""},{"money":"£2,261,710","country":"UK","day":"07","month":"11","year":"2004","remarks":""},{"money":"€4,801,869","country":"Italy","day":"30","month":"01","year":"2005","remarks":""},{"money":"€4,649,613","country":"Italy","day":"23","month":"01","year":"2005","remarks":""},{"money":"€4,079,041","country":"Italy","day":"16","month":"01","year":"2005","remarks":""},{"money":"€2,768,539","country":"Italy","day":"09","month":"01","year":"2005","remarks":""},{"money":"€1,423,105","country":"Netherlands","day":"13","month":"02","year":"2005","remarks":""},{"money":"€1,157,112","country":"Netherlands","day":"23","month":"01","year":"2005","remarks":""},{"money":"€567,074","country":"Netherlands","day":"09","month":"01","year":"2005","remarks":""}],"weekendGross":[{"money":"$162,688","country":"USA","day":"19","month":"12","year":"2004","remarks":"278 Screens"},{"money":"$456,934","country":"USA","day":"12","month":"12","year":"2004","remarks":"732 Screens"},{"money":"$1,104,474","country":"USA","day":"05","month":"12","year":"2004","remarks":"1,286 Screens"},{"money":"$1,952,301","country":"USA","day":"28","month":"11","year":"2004","remarks":"1,486 Screens"},{"money":"$3,812,121","country":"USA","day":"21","month":"11","year":"2004","remarks":"2,112 Screens"},{"money":"$7,010,551","country":"USA","day":"14","month":"11","year":"2004","remarks":"2,816 Screens"},{"money":"$12,675,393","country":"USA","day":"07","month":"11","year":"2004","remarks":"3,336 Screens"},{"money":"$21,817,598","country":"USA","day":"31","month":"10","year":"2004","remarks":"3,348 Screens"},{"money":"$39,128,715","country":"USA","day":"24","month":"10","year":"2004","remarks":"3,245 Screens"},{"money":"£59,662","country":"UK","day":"12","month":"12","year":"2004","remarks":"125 Screens"},{"money":"£227,422","country":"UK","day":"05","month":"12","year":"2004","remarks":"251 Screens"},{"money":"£439,726","country":"UK","day":"28","month":"11","year":"2004","remarks":"289 Screens"},{"money":"£800,277","country":"UK","day":"21","month":"11","year":"2004","remarks":"362 Screens"},{"money":"£1,516,854","country":"UK","day":"14","month":"11","year":"2004","remarks":"362 Screens"},{"money":"£2,261,710","country":"UK","day":"07","month":"11","year":"2004","remarks":"362 Screens"},{"money":"€57,225","country":"Italy","day":"30","month":"01","year":"2005","remarks":"48 Screens"},{"money":"€358,449","country":"Italy","day":"23","month":"01","year":"2005","remarks":"191 Screens"},{"money":"€783,322","country":"Italy","day":"16","month":"01","year":"2005","remarks":"301 Screens"},{"money":"€28,280","country":"Netherlands","day":"13","month":"02","year":"2005","remarks":"38 Screens"},{"money":"€168,777","country":"Netherlands","day":"23","month":"01","year":"2005","remarks":"72 Screens"},{"money":"€430,155","country":"Netherlands","day":"09","month":"01","year":"2005","remarks":"71 Screens"}],"admissions":[{"money":"425,646","country":"Germany","day":"01","month":"01","year":"2006","remarks":""},{"money":"304,180","country":"Germany","day":"20","month":"03","year":"2005","remarks":""},{"money":"232,658","country":"Germany","day":"13","month":"03","year":"2005","remarks":""},{"money":"116,054","country":"Germany","day":"06","month":"03","year":"2005","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"26","month":"01","year":"2004","remarks":null},null],"copyrightHolder":"copyright 2004 GHP 2 - Grudge, LLC"},"technical":{"runtime":["1 hr 31 min (91 min)","1 hr 38 min (98 min) (Unrated Extended Director's Cut)","1 hr 38 min (98 min) (unrated)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras"],"laboratory":["Imagica Corporation, Shinagawa-ku, Tokyo, Japan","DeLuxe, USA (also prints)","FotoKem Laboratory, Burbank (CA), USA"],"filmLength":["2,699 m (5 reels)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"5.9","metascore":"49","filmingLocations":[{"location":"Aoyama, Tokyo, Japan"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]}]}]},{"award":"BMI Film & TV Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Christopher Young","id":"nm0002366","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won Chainsaw Award","categories":[{"category":"Best Score","names":[{"name":"Christopher Young","id":"nm0002366","role":null}]}]},{"titleAwardOutcome":"3rd place Chainsaw Award","categories":[{"category":"Worst Film","names":[]}]}]},{"award":"Golden Schmoes Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Horror Movie of the Year","names":[]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2004","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for a Horror/Thriller Film","names":[{"name":"Christopher Young","id":"nm0002366","role":null}]}]}]},{"award":"MTV Movie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Frightened Performance","names":[{"name":"Sarah Michelle Gellar","id":"nm0001264","role":null}]}]}]},{"award":"Sitges - Catalonian International Film Festival 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Best Film","categories":[{"category":"","names":[{"name":"Takashi Shimizu","id":"nm1234345","role":null}]}]}]},{"award":"Teen Choice Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Thriller","names":[]},{"category":"Choice Movie Actress: Action Adventure/Thriller","names":[{"name":"Sarah Michelle Gellar","id":"nm0001264","role":null}]},{"category":"Choice Movie Scream Scene","names":[{"name":"Yuya Ozeki","id":"nm1505005","role":null}]},{"category":"Choice Movie Scary Scene","names":[{"name":"KaDee Strickland","id":"nm0834380","role":null}]}]}]}],"votes":"119,754","type":"Movie","companyCreditsSimple":[{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0116611","name":"Ghost House Pictures"},{"idCompany":"co0167921","name":"Fellah Pictures"}],"keywords":{"keywords":["curse","american","nurse","rage","japan","terror","ghost","death","son","care","old woman","elderly","first part","male frontal nudity","murdered in a bathtub","diary","adultery","housewife","two word title","remake of japanese film","hospital","missing person","detective","police officer","fear","police car","shock","flashback","pet cat","little boy","care work","inter cultural","cemetery","buddhism","tokyo japan","ritual","spider web","japanese","jealousy","bathtub","teacher","video cassette","mail","vcr","surveillance footage","husband wife relationship","computer","mother son relationship","real estate agent","remake by original director","haunted house","drowning someone","gothic","supernatural power","horror movie remake","neck breaking","family relationships","cell phone","loss of husband","psycho thriller","goth","stabbing","severed jaw","neo noir","gore","female protagonist","wraith","waiter","vision","video surveillance","suicide","stalker","stairwell","social worker","sink","shower","realtor","professor","police detective","photograph","nonlinear timeline","murder","murder of wife","morgue","marriage","ghost child","filicide","falling from height","elevator","drowning","dating","crime scene","corpse","closet","cat","catatonia","bus","brother sister relationship","balcony","attic","arson","security guard","police","office","murder suicide","boyfriend girlfriend relationship","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:52:56"}}