{"data":{"movies":[{"title":"The Interpreter","originalTitle":"","year":"2005","releaseDate":"20050422","directors":[{"name":"Sydney Pollack","id":"nm0001628"}],"writers":[{"name":"Martin Stellman","id":"nm0826369"},{"name":"Brian Ward","id":"nm0911422"}],"runtime":"128 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MjMxNDUzNV5BMl5BanBnXkFtZTcwNTM2NzgyMQ@@._V1.jpg","countries":["UK","France","Germany","USA","South Africa"],"languages":["Aboriginal","English","French","Portuguese"],"genres":["Crime","Mystery","Thriller"],"plot":"Escalating events begin when U.N. interpreter Silvia Broome alleges that she has overheard a death threat against an African head of state, spoken in a rare dialect few people other than Silvia can understand. With the words \"The Teacher will never leave this room alive,\" in an instant, Silvia's life is turned upside down as she becomes a hunted target of the killers. Placed under the protection of federal agent Tobin Keller, Silvia's world only grows more nightmarish. As Keller digs deeper into his eyewitnesses' past and her secretive world of global connections, the more suspicious he becomes that she herself might be involved in the conspiracy. With every step of the way, he finds more reasons to mistrust her. Is Sylvia a victim? A suspect? Or something else entirely? And can Tobin, coping with his own personal heartache, keep her safe? Though they must depend on one another, Silvia and Tobin couldn't be more different. Silvia's strengths are words, diplomacy and the subtleties of ...","simplePlot":"Political intrigue and deception unfold inside the United Nations, where a U.S. Secret Service agent is assigned to investigate an interpreter who overhears an assassination plot.","actors":[{"actorName":"Nicole Kidman","urlProfile":"http://www.imdb.com/name/nm0000173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1967","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Nicole Mary Kidman","height":"5' 11\" (1.8 m)","bio":"Elegant blonde Nicole Kidman, known as one of Hollywood's top Australian imports, was actually born in Honolulu, Hawaii, while her Australian parents were there on educational visas. Kidman is the daughter of Janelle Ann (Glenny), a nursing instructor, and Antony David Kidman, a biochemist and clinical psychologist. She is of English, Irish, and Scottish descent. Shortly after her birth, the family moved to Washington, D.C., where Nicole's father pursued his research on breast cancer, and then, three years later, made the pilgrimage back to her parents' native Sydney in Australia, where Nicole was raised. Young Nicole's first love was ballet, but she eventually took up mime and drama as well (her first stage role was a bleating sheep in an elementary school Christmas pageant). In her adolescent years, acting edged out the other arts and became a kind of refuge -- as her classmates sought out fun in the sun, the fair-skinned Kidman retreated to dark rehearsal halls to practice her craft. She worked regularly at the Philip Street Theater, where she once received a personal letter of praise and encouragement from audience member Jane Campion (then a film student). Kidman eventually dropped out of high school to pursue acting full-time. She broke into movies at age 16, landing a role in the Australian holiday favorite Bush Christmas (1983). That appearance touched off a flurry of film and television offers, including a lead in Le gang des BMX (1983) and a turn as a schoolgirl-turned-protester in the miniseries Vietnam (1987) (for which she won her first Australian Film Institute Award). With the help of an American agent, she eventually made her US debut opposite Sam Neill in the at-sea thriller Calme blanc (1989). Kidman's next casting coup scored her more than exposure. While starring as Tom Cruise's doctor/love interest in the racetrack romance Days of Thunder (1990), she won over the Hollywood hunk hook, line and sinker. After a whirlwind courtship (and decent box office returns), the couple wed on December 24, 1990. Determined not to let her new marital status overshadow her fledgling career, the actress pressed on. She appeared as a catty high school senior in the Australian film Flirting (1991), then as Dustin Hoffman's moll in the gangster flick Billy Bathgate (1991). She reunited with Cruise for Far and Away (1992), the story of young Irish lovers who flee to America in the late 1800s, and starred opposite Michael Keaton in the tear-tugger My Life (1993). Despite her steady employment, critics and moviegoers still had not quite warmed to Kidman as a leading lady. She tried to spice up her image by seducing Val Kilmer in Batman Forever (1995), but achieved her real breakthrough with Gus Van Sant's To Die For (1995). As a fame-crazed housewife determined to eliminate any obstacle in her path, Kidman proved that she had an impressive range and deadly comic timing. She took home a Golden Globe and several critics' awards for the performance. In 1996, Kidman stepped into a corset to work with her countrywoman and onetime admirer, Jane Campion, on the adaptation of Henry James's The Portrait of a Lady (1996). A few months later, she tore across the screen as a nuclear weapons expert in The Peacemaker (1997), adding \"action star\" to her professional repertoire. She and Cruise then disappeared into a notoriously long, secretive shoot for Stanley Kubrick's sexual thriller Eyes Wide Shut (1999). The couple's on-screen shenanigans prompted an increase in public speculation about their sex life (rumors had long been circulating that their marriage was a cover-up for Cruise's homosexuality); tired of denying tabloid attacks, they successfully sued The Star for a story alleging that they needed a sex therapist to coach them through love scenes. Family life has always been a priority for Kidman. Born to social activists (mother was a feminist; father, a labor advocate), Nicole and her little sister, Antonia Kidman, discussed current events around the dinner table and participated in their parents' campaigns by passing out pamphlets on street corners. When her mother was diagnosed with breast cancer, 17-year-old Nicole stopped working and took a massage course so that she could provide physical therapy (her mother eventually beat the cancer). She and Cruise adopted two children: Isabella Jane (born 1993) and Connor Antony (born 1995). Despite their rock-solid image, the couple announced in early 2001 that they were separating due to career conflicts. Her marriage to Cruise ended mid-summer of 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000173","name":"Nicole Kidman","nicknames":["Nic"],"idIMDB":"nm0000173"},"actorId":"nm0000173","character":"Silvia Broome","urlCharacter":"http://www.imdb.com/character/ch0010756","main":true},{"actorName":"Sean Penn","urlProfile":"http://www.imdb.com/name/nm0000576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjMzMjY3NF5BMl5BanBnXkFtZTcwMzkxNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1960","placeOfBirth":" Santa Monica, California, USA","birthName":"Sean Justin Penn","height":"5' 8\" (1.73 m)","bio":"Sean Penn is a powerhouse film performer capable of intensely moving work, who has gone from strength to strength during a colourful film career, and who has drawn much media attention for his stormy private life and political viewpoints. Sean Justin Penn was born in Los Angeles, California, the second son of actress Eileen Ryan (née Annucci) and director, actor, and writer Leo Penn. His brother was actor Chris Penn. His father was from a Lithuanian Jewish/Russian Jewish family, and his mother is of half Italian and half Irish descent. Penn first appeared in roles as strong-headed or unruly youths such as the military cadet defending his academy against closure in Taps (1981), then as fast-talking surfer stoner Jeff Spicoli in Fast Times at Ridgemont High (1982). Fans and critics were enthused about his obvious talent and he next contributed a stellar performance alongside Timothy Hutton in the Cold War spy thriller The Falcon and the Snowman (1985), followed by a teaming with icy Christopher Walken in the chilling At Close Range (1986). The youthful Sean then paired up with his then wife, pop diva Madonna in the woeful, and painful, Shanghai Surprise (1986), which was savaged by the critics, but Sean bounced back with a great job as a hot-headed young cop in Colors (1988), gave another searing performance as a US soldier in Vietnam committing atrocities in Casualties of War (1989) and appeared alongside Robert De Niro in the uneven comedy We're No Angels (1989). However, the 1990s was the decade in which Sean really got noticed by critics as a mature, versatile and accomplished actor, with a string of dynamic performances in first-class films. Almost unrecognisable with frizzy hair and thin rimmed glasses, Penn was simply brilliant as corrupt lawyer David Kleinfeld in the Brian De Palma gangster movie Carlito's Way (1993) and he was still in trouble with authority as a Death Row inmate pleading with a caring nun to save his life in Dead Man Walking (1995), for which he received his first Oscar nomination. Sean then played the brother of wealthy Michael Douglas, involving him in a mind-snapping scheme in The Game (1997) and also landed the lead role of Sgt. Eddie Walsh in the star-studded anti-war film The Thin Red Line (1998), before finishing the 1990s playing an offbeat jazz musician (and scoring another Oscar nomination) in Sweet and Lowdown (1999). The gifted and versatile Sean had also moved into directing, with the quirky but interesting The Indian Runner (1991), about two brothers with vastly opposing views on life, and in 1995 he directed Jack Nicholson in The Crossing Guard (1995). Both films received overall positive reviews from critics. Moving into the new century, Sean remained busy in front of the cameras with even more outstanding work: a mentally disabled father fighting for custody of his seven-year-old daughter (and receiving a third Oscar nomination) for I Am Sam (2001); an anguished father seeking revenge for his daughter's murder in the gut-wrenching Clint Eastwood-directed Mystic River (2003) (for which he won the Oscar as Best Actor); a mortally ill college professor in 21 Grams (2003) and a possessed businessman in The Assassination of Richard Nixon (2004). Certainly Sean Penn is one of Hollywood's most controversial, progressive and gifted actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjMzMjY3NF5BMl5BanBnXkFtZTcwMzkxNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000576","name":"Sean Penn","idIMDB":"nm0000576"},"actorId":"nm0000576","character":"Tobin Keller","urlCharacter":"http://www.imdb.com/character/ch0010757","main":true},{"actorName":"Catherine Keener","urlProfile":"http://www.imdb.com/name/nm0001416","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzQ1Mzg1MF5BMl5BanBnXkFtZTcwNTE4MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1959","placeOfBirth":" Miami, Florida, USA","birthName":"Catherine Ann Keener","height":"5' 8\" (1.73 m)","bio":"Catherine Keener is an American actress, Oscar-nominated for her roles in the independent films Being John Malkovich (1999) and Capote (2005). Acclaimed in her community for her quirky roles in independent film and mainstream such as The 40-Year-Old Virgin (2005), Keener got her start as a casting director in New York City. Catherine Ann Keener was born in Miami, Florida, and was raised in Hialeah, FL. She is the daughter of Evelyn (Jamiel) and James Keener, who owned an auto shop. She is of Lebanese (mother) and English, Scottish, and German (father) descent. Keener attended Wheaton College in Massachusetts. She began taking acting classes when she was unable to sign up for a photography class. After graduating, Keener managed a McDonalds in New York City before becoming an assistant casting director and soon relocating to Los Angeles. Not long after, Keener told her superior of her aspirations for acting and she landed a one-worded role as a waitress in About Last Night... (1986). Two years later, she landed a role in a film called Survival Quest (1988), where she met her future husband, Dermot Mulroney. After struggling for years in the industry, Keener landed a role in an independent film, opposite the unknown Brad Pitt, in Johnny Suede (1991). Her ascent in independent film began as she starred in Living in Oblivion (1995) and Walking and Talking (1996) before her mainstream break with Being John Malkovich (1999) in 1999, which earned Keener her first Oscar nomination. Since then, Catherine Keener has starred in several critically acclaimed films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzQ1Mzg1MF5BMl5BanBnXkFtZTcwNTE4MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001416","name":"Catherine Keener","idIMDB":"nm0001416"},"actorId":"nm0001416","character":"Dot Woods","urlCharacter":"http://www.imdb.com/character/ch0010758","main":true},{"actorName":"Jesper Christensen","urlProfile":"http://www.imdb.com/name/nm0159802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzk2OTgzMl5BMl5BanBnXkFtZTYwMTc0NzAz._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1948","placeOfBirth":" Copenhagen, Denmark","height":"5' 11\" (1.8 m)","bio":"Born 1948 in central Copenhagen. Lived there ever since. Did 25 years of theatre, - like Alceste in the Misanthropist, Richard in Richard lll (solo), Faust in Faust, Astrov in Vanja, a lot of worried men,- stopped doing it in 1998. Since then only worried men on film. Worked on more than 100 films by Per Fly, Marc Forster, John Madden, Lone Scherfig, Sydney Pollack, Jan Troell, Martin Campbell, Anette K Olesen, Pernille Fischer Christensen, and others. Since 2000 lives with Tove Bornhoeft, wonderful Danish theatre manager/director/actress. Two grown up daughters. No animals. Dogs, pigs, chickens, cats, birds, horses, fish, rabbits - all gone now.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzk2OTgzMl5BMl5BanBnXkFtZTYwMTc0NzAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0159802","name":"Jesper Christensen","idIMDB":"nm0159802"},"actorId":"nm0159802","character":"Nils Lud","urlCharacter":"http://www.imdb.com/character/ch0246888","main":true},{"actorName":"Yvan Attal","urlProfile":"http://www.imdb.com/name/nm0040939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTkyNDg1MF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1965","placeOfBirth":" Tel Aviv, Israel","height":"5' 6½\" (1.69 m)","bio":"Yvan Attal was born on January 4, 1965 in Tel Aviv, Israel. He is an actor and director, known for Rush Hour 3 (2007), Munich (2005) and The Interpreter (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTkyNDg1MF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0040939","name":"Yvan Attal","idIMDB":"nm0040939"},"actorId":"nm0040939","character":"Philippe","urlCharacter":"http://www.imdb.com/character/ch0507602","main":true},{"actorName":"Earl Cameron","urlProfile":"http://www.imdb.com/name/nm0131565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NzEyMTI5MV5BMl5BanBnXkFtZTcwNDgxNDIzOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1917","placeOfBirth":" Pembroke, Bermuda","bio":"Earl Cameron was born on August 8, 1917 in Pembroke, Bermuda. He is an actor, known for Inception (2010), The Interpreter (2005) and Thunderball (1965). He has been married to Barbara Cameron since September 20, 1994. He was previously married to Audrey Cameron.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NzEyMTI5MV5BMl5BanBnXkFtZTcwNDgxNDIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0131565","name":"Earl Cameron","idIMDB":"nm0131565"},"actorId":"nm0131565","character":"Zuwanie","urlCharacter":"http://www.imdb.com/character/ch0507596","main":true},{"actorName":"George Harris","urlProfile":"http://www.imdb.com/name/nm0364711","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njc1MTgyMV5BMl5BanBnXkFtZTcwNzc1MDkyMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1949","placeOfBirth":" Grenada, British West Indies [now Grenada]","height":"6' 0¾\" (1.85 m)","bio":"George Harris was born on October 20, 1949 in Grenada, British West Indies. He is an actor and producer, known for Raiders of the Lost Ark (1981), Harry Potter and the Order of the Phoenix (2007) and Layer Cake (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njc1MTgyMV5BMl5BanBnXkFtZTcwNzc1MDkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364711","name":"George Harris","idIMDB":"nm0364711"},"actorId":"nm0364711","character":"Kuman-Kuman","urlCharacter":"http://www.imdb.com/character/ch0507600","main":true},{"actorName":"Michael Wright","urlProfile":"http://www.imdb.com/name/nm0942646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMTE5MTIwMV5BMl5BanBnXkFtZTcwMTY1NDAxMw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1956","placeOfBirth":" New York City, New York, USA","height":"6' 1½\" (1.87 m)","bio":"Michael Wright was born on April 30, 1956 in New York City, New York, USA. He is an actor, known for The Interpreter (2005), The Five Heartbeats (1991) and The Principal (1987). He was previously married to Mitzie Lau.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMTE5MTIwMV5BMl5BanBnXkFtZTcwMTY1NDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942646","name":"Michael Wright","idIMDB":"nm0942646"},"actorId":"nm0942646","character":"Marcus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clyde Kusatsu","urlProfile":"http://www.imdb.com/name/nm0476226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjQ1NzYxOF5BMl5BanBnXkFtZTcwMDQ2Nzg1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1948","placeOfBirth":" Honolulu, Hawaii, USA","height":"5' 5\" (1.65 m)","bio":"Clyde Kusatsu was born on September 13, 1948 in Honolulu, Hawaii, USA. He is an actor, known for Paradise Road (1997), The Interpreter (2005) and Midway (1976). He has been married to Gayle Shuffler since August 29, 1976. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjQ1NzYxOF5BMl5BanBnXkFtZTcwMDQ2Nzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476226","name":"Clyde Kusatsu","idIMDB":"nm0476226"},"actorId":"nm0476226","character":"Police Chief Lee Wu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Keenleyside","urlProfile":"http://www.imdb.com/name/nm0444776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MDU3NDI0OF5BMl5BanBnXkFtZTcwMjA5OTgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1957","placeOfBirth":" St. Stephen, New Brunswick, Canada","height":"6' 2\" (1.88 m)","bio":"Born in St. Stephen, New Brunswick, he grew up in London, Ontario, with a year and a half in Brisbane, Australia. He apprenticed at the Stratford Festival after graduating from the University of Windsor. Now living near Vancouver, British Columbia, he and his wife, actress Peg Christopherson, became naturalized US citizens after living in Los Angeles and in upstate Washington for many years. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MDU3NDI0OF5BMl5BanBnXkFtZTcwMjA5OTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444776","name":"Eric Keenleyside","idIMDB":"nm0444776"},"actorId":"nm0444776","character":"Rory Robb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugo Speer","urlProfile":"http://www.imdb.com/name/nm0817563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA5MDM4NzI3MV5BMl5BanBnXkFtZTcwMDM5NjkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1969","placeOfBirth":" Harrogate, Yorkshire, England, UK","bio":"Hugo Speer was born in 1969 in Harrogate, Yorkshire, England. He is an actor and director, known for The Full Monty (1997), The Interpreter (2005) and Nymphomaniac - Volume 1 (2013). He has been married to Vivienne Harvey since February 19, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA5MDM4NzI3MV5BMl5BanBnXkFtZTcwMDM5NjkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0817563","name":"Hugo Speer","idIMDB":"nm0817563"},"actorId":"nm0817563","character":"Simon Broome","urlCharacter":"http://www.imdb.com/character/ch0507597","main":true},{"actorName":"Maz Jobrani","urlProfile":"http://www.imdb.com/name/nm0423414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ1ODQ2NjU2N15BMl5BanBnXkFtZTgwNDExOTI0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1972","placeOfBirth":" Tehran, Iran","birthName":"Maziyar Jobrani","bio":"Maz Jobrani was born on February 26, 1972 in Tehran, Iran as Maziyar Jobrani. He is an actor and writer, known for The Interpreter (2005), 13 Going on 30 (2004) and Jimmy Vestvood: Amerikan Hero (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ1ODQ2NjU2N15BMl5BanBnXkFtZTgwNDExOTI0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0423414","name":"Maz Jobrani","nicknames":["Persian Pink Panther"],"idIMDB":"nm0423414"},"actorId":"nm0423414","character":"Mo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yusuf Gatewood","urlProfile":"http://www.imdb.com/name/nm0309650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODcxMDEyNV5BMl5BanBnXkFtZTgwOTA2ODY0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Yusuf Keith Gatewood is an American actor that portrays the role of Vincent Griffith, a witch formerly possessed by Finn Mikaelson, in The Originals. Initially joining Season 2 as a recurring actor, he became a series regular in the second half of the season. His television work includes several guest appearances on the television series such as Hack (2003), Law & Order: Criminal Intent (2006), CSI and CSI: Miami (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODcxMDEyNV5BMl5BanBnXkFtZTgwOTA2ODY0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0309650","name":"Yusuf Gatewood","idIMDB":"nm0309650"},"actorId":"nm0309650","character":"Doug","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Curtiss Cook","urlProfile":"http://www.imdb.com/name/nm1478007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NTk0NDM5OV5BMl5BanBnXkFtZTgwMDQzNzc5MDE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Curtiss Cook was born in Dayton, Ohio, USA. He is an actor and director, known for Shutter Island (2010), The Interpreter (2005) and Arbitrage (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NTk0NDM5OV5BMl5BanBnXkFtZTgwMDQzNzc5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1478007","name":"Curtiss Cook","idIMDB":"nm1478007"},"actorId":"nm1478007","character":"Ajene Xola","urlCharacter":"http://www.imdb.com/character/ch0507601","main":true},{"actorName":"Byron Utley","urlProfile":"http://www.imdb.com/name/nm0882541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMDYzOTg3MF5BMl5BanBnXkFtZTcwNzMwMzAzMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Byron Utley is an actor, known for The Interpreter (2005), Awakenings (1990) and Wall Street (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMDYzOTg3MF5BMl5BanBnXkFtZTcwNzMwMzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0882541","name":"Byron Utley","idIMDB":"nm0882541"},"actorId":"nm0882541","character":"Jean Gamba","urlCharacter":"http://www.imdb.com/character/ch0507598","main":true}],"seasons":[],"idIMDB":"tt0373926","urlIMDB":"http://www.imdb.com/title/tt0373926","business":{"budget":{"money":"$80,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$22,822,455","country":"USA","day":"24","month":"04","year":"2005","remarks":"2,758 Screens"},{"money":"£1,589,829","country":"UK","day":"17","month":"04","year":"2005","remarks":"370 Screens"},{"money":"€220,892","country":"Netherlands","day":"17","month":"04","year":"2005","remarks":"55 Screens"}],"gross":[{"money":"$72,515,360","country":"USA","day":"24","month":"07","year":"2005","remarks":""},{"money":"$72,389,240","country":"USA","day":"17","month":"07","year":"2005","remarks":""},{"money":"$72,213,730","country":"USA","day":"10","month":"07","year":"2005","remarks":""},{"money":"$72,037,795","country":"USA","day":"04","month":"07","year":"2005","remarks":""},{"money":"$71,816,920","country":"USA","day":"26","month":"06","year":"2005","remarks":""},{"money":"$71,542,675","country":"USA","day":"19","month":"06","year":"2005","remarks":""},{"money":"$71,179,015","country":"USA","day":"12","month":"06","year":"2005","remarks":""},{"money":"$70,405,780","country":"USA","day":"05","month":"06","year":"2005","remarks":""},{"money":"$65,403,045","country":"USA","day":"22","month":"05","year":"2005","remarks":""},{"money":"$61,161,945","country":"USA","day":"15","month":"05","year":"2005","remarks":""},{"money":"$54,403,865","country":"USA","day":"08","month":"05","year":"2005","remarks":""},{"money":"$43,152,385","country":"USA","day":"01","month":"05","year":"2005","remarks":""},{"money":"$22,822,455","country":"USA","day":"24","month":"04","year":"2005","remarks":""},{"money":"£6,874,069","country":"UK","day":"22","month":"05","year":"2005","remarks":""},{"money":"£6,536,907","country":"UK","day":"15","month":"05","year":"2005","remarks":""},{"money":"£5,992,825","country":"UK","day":"08","month":"05","year":"2005","remarks":""},{"money":"£5,028,573","country":"UK","day":"01","month":"05","year":"2005","remarks":""},{"money":"£3,645,758","country":"UK","day":"24","month":"04","year":"2005","remarks":""},{"money":"£1,589,829","country":"UK","day":"17","month":"04","year":"2005","remarks":""},{"money":"$162,944,923","country":"Worldwide","day":"06","month":"01","year":"2008","remarks":""},{"money":"$72,100,000","country":"Worldwide","day":"12","month":"06","year":"2005","remarks":"except USA"},{"money":"€1,020,157","country":"Netherlands","day":"22","month":"05","year":"2005","remarks":""},{"money":"€220,892","country":"Netherlands","day":"17","month":"04","year":"2005","remarks":""},{"money":"PHP 12,097,256","country":"Philippines","day":"10","month":"05","year":"2005","remarks":""}],"weekendGross":[{"money":"$71,750","country":"USA","day":"24","month":"07","year":"2005","remarks":"113 Screens"},{"money":"$105,775","country":"USA","day":"17","month":"07","year":"2005","remarks":"149 Screens"},{"money":"$125,290","country":"USA","day":"10","month":"07","year":"2005","remarks":"179 Screens"},{"money":"$141,115","country":"USA","day":"04","month":"07","year":"2005","remarks":"169 Screens"},{"money":"$161,190","country":"USA","day":"26","month":"06","year":"2005","remarks":"208 Screens"},{"money":"$206,995","country":"USA","day":"19","month":"06","year":"2005","remarks":"276 Screens"},{"money":"$385,825","country":"USA","day":"12","month":"06","year":"2005","remarks":"364 Screens"},{"money":"$799,175","country":"USA","day":"05","month":"06","year":"2005","remarks":"686 Screens"},{"money":"$2,910,580","country":"USA","day":"22","month":"05","year":"2005","remarks":"2,164 Screens"},{"money":"$4,592,505","country":"USA","day":"15","month":"05","year":"2005","remarks":"2,602 Screens"},{"money":"$7,822,950","country":"USA","day":"08","month":"05","year":"2005","remarks":"2,815 Screens"},{"money":"$13,833,815","country":"USA","day":"01","month":"05","year":"2005","remarks":"2,764 Screens"},{"money":"$22,822,455","country":"USA","day":"24","month":"04","year":"2005","remarks":"2,758 Screens"},{"money":"£191,900","country":"UK","day":"22","month":"05","year":"2005","remarks":"224 Screens"},{"money":"£303,290","country":"UK","day":"15","month":"05","year":"2005","remarks":"304 Screens"},{"money":"£508,727","country":"UK","day":"08","month":"05","year":"2005","remarks":"347 Screens"},{"money":"£749,529","country":"UK","day":"01","month":"05","year":"2005","remarks":"370 Screens"},{"money":"£1,212,734","country":"UK","day":"24","month":"04","year":"2005","remarks":"370 Screens"},{"money":"£1,589,829","country":"UK","day":"17","month":"04","year":"2005","remarks":"370 Screens"},{"money":"€75,080","country":"Netherlands","day":"22","month":"05","year":"2005","remarks":"56 Screens"},{"money":"€220,892","country":"Netherlands","day":"17","month":"04","year":"2005","remarks":"55 Screens"}],"admissions":[{"money":"1,113,180","country":"Germany","day":"12","month":"06","year":"2005","remarks":""},{"money":"225,089","country":"Germany","day":"24","month":"04","year":"2005","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"03","year":"2004","remarks":null},null],"copyrightHolder":"Motion Picture Jota Produktionsgesellschaft mbH &amp; Co. KG and Universal Studios"},"technical":{"runtime":["2 hr 8 min (128 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam ST, Cooke Xtal Express and Technovision/Cooke Lenses","Arriflex 35-III, Cooke Xtal Express and Technovision/Cooke Lenses","Arriflex 435, Cooke Xtal Express and Technovision/Cooke Lenses","Bell & Howell Eyemo"],"laboratory":["EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)","Technicolor, Hollywood (CA), USA"],"filmLength":["3,524 m (Sweden)"],"negativeFormat":["35 mm (Kodak Vision2 100T 5212, Vision2 Expression 500T 5229)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","J-D-C Scope (anamorphic) (source format)","Technovision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6.4","metascore":"62","filmingLocations":[{"location":"Praça de Touros Monumental, Maputo, Mozambique"}],"rated":"PG-13","awards":[{"award":"ASCAP Film and Television Music Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"James Newton Howard","id":"nm0006133","role":null}]}]}]},{"award":"Golden Trailer Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Drama","names":[]}]}]},{"award":"Huabiao Film Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won Huabiao Film Award","categories":[{"category":"Outstanding Translated Foreign Film","names":[]}]}]},{"award":"Los Angeles Film Critics Association Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Catherine Keener","id":"nm0001416","role":null},{"name":"Capote","id":"tt0379725","role":null},{"name":"The Ballad of Jack and Rose","id":"tt0357110","role":null},{"name":"The 40 Year Old Virgin","id":"tt0405422","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 2006","titlesAwards":[{"titleAwardOutcome":"3rd place NSFC Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Catherine Keener","id":"nm0001416","role":null},{"name":"The Ballad of Jack and Rose","id":"tt0357110","role":null},{"name":"Capote","id":"tt0379725","role":null},{"name":"The 40 Year Old Virgin","id":"tt0405422","role":null}]}]}]}],"votes":"88,044","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0057311","name":"Working Title Films"},{"idCompany":"co0085725","name":"Misher Films"}],"keywords":{"keywords":["assassination","interpreter","african","dialect","threat","suspect","teacher","diplomacy","secret","death","intrigue","united nations","secret service","woman","f rated","hitchcockian","female nudity","political thriller","arrest","disarming someone","stalking","secret agent","showdown","sniper rifle","sniper","opening action scene","child soldier","stripper","child uses gun","blonde","mexican standoff","key","african artifact","justice","mantra","locker","national security agency","nsa","criminal","court","photo exhibit","french","tv newscaster","johannesburg south africa","south africa","park bench","bench","park","roommate","flute lesson","flutist","flute","paris france","doctor","jeep","jukebox","evacuation","death list","death of sister","death of family","rally","protest","reference to pepsi cola","dog","eye bandage","international criminal court","santa fe new mexico","land mine","british airways","men's bathroom","carnation","lightning","thunder","rain","laguardia airport queens new york city","newark international airport new jersey","jfk international airport queens new york city","shootout","silencer","gurney","ambulance","new york police department","nypd","motorcycle","convoy","surveillance camera","gun held to one's head","shooting out a window","reference to the beatles","aids","new york fire department","nyfd","wound","letter","chess","bathtub","bath","bridge","subway","pbs","swimming","storytelling","drowning","fire escape","strand of hair","telephone number","divorce","car accident","dancing","dancer","dual citizenship","e mail","mail","metal detector","coincidence","motor scooter","lap dancer","nightclub","strip club","prime minister","soccer stadium","soccer","notebook","sunglasses","computer","terrorism","terrorist","government","death of wife","sleeplessness","search","beating","strangulation","infidelity","unfaithfulness","adultery","extramarital affair","lie detector","listening to music","ethnic cleansing","security guard","security check","linguistics","airplane","airport","ambassador","helicopter","limousine","liberator","tyrant","exile","capitalist","socialist","pacifist","passport","liar","lie","american flag","palm reading","speech","demonstration","picking a lock","breaking and entering","african mask","mask","mourning","grief","revenge","vengeance","suicide bomber","door lock","binoculars","blood","brooklyn new york city","tv news","watching tv","death of brother","microphone","gun","policeman","police","answering machine","pay phone","cell phone","telephone call","diplomat","cia","photograph","drinking","drink","bar","earphones","photographer","camera","overheard conversation","translator","being followed","following someone","mass murder","massacre","corpse","dead body","surveillance","walkie talkie","fleeing","running","pursuit","chase","prologue","shot in the head","shooting","investigation","violence","flash forward","shower","man on the verge of tears","woman with glasses","vespa","exploding bus","politics","manhattan new york city","flashback","drunkenness","unsubtitled foreign language","fictional country","hospice","freeze frame","bomb","bodyguard","assassin","pistol","machine gun","loss of brother","fbi","dictator","africa","suicide","shot to death","murder","interrogation","genocide","brother sister relationship","suspense","fbi agent","witness protection","new york city","explosion","car chase","bus","assassination attempt","death of father","death of mother","death of friend","based on novel","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:03:03"}}