{"data":{"movies":[{"title":"The Muppets Go to the Movies","originalTitle":"","year":"1981","releaseDate":"19810520","directors":[{"name":"Peter Harris","id":"nm0365192"}],"writers":[{"name":"Jim Henson","id":"nm0001345"},{"name":"Jerry Juhl","id":"nm0432075"}],"runtime":"60 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjRjOTZlNzUtM2UxYS00ZDQ4LWI2Y2EtNWJhNDk0NTFkNzJjXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Family","Comedy"],"simplePlot":"","actors":[{"actorName":"Dudley Moore","urlProfile":"http://www.imdb.com/name/nm0001545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjY5MTQxOF5BMl5BanBnXkFtZTcwNTAxMTkwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1935","placeOfBirth":" Dagenham, Essex, England, UK","birthName":"Dudley Stuart John Moore","height":"5' 2½\" (1.59 m)","bio":"Dudley Moore, the gifted comedian who had at least three distinct career phases that brought him great acclaim and success, actually started out as a musical prodigy as a child. He was born in Dagenham, Essex, England, in 1935, to working class parents, Ada Francis (Hughes), an English secretary, and John Havlin Moore, a Scottish railway electrician (originally from Glasgow). Dudley won a music scholarship to Magdalen College, Oxford, to study the organ. At university, he also studied composition and became a classically trained pianist, though his forte on the piano for public performance was jazz. After graduating from Magdalen College in 1958, Moore was offered a position as organist at King's College, Cambridge, but turned it down in order to go to London and pursue a music and acting career. Fellow Oxonian Alan Bennett (Exter Colelge, B.A., Medieval History, 1957) had already recommended him to John Bassett, who was putting together a satirical comedy revue called \"Beyond The Fringe\". \"Beyond The Fringe\" was to be Moore's first brush with fame, along with co-stars Bennett, future theatrical director Jonathan Miller (now Sir Jonathan, who studied Medicine at Cambridge and was a physician), and Peter Cook, who was destined to become Moore's comic partner during the 1960s and '70s. It was Miller who had recommended Cook for \"Beyond the Fringe\", in much the same way that Bennett had bird-dogged Moore. Cook, who had studied modern languages at Cambridge, had been part of the famous Cambridge theatrical, the Footlights revue in 1959, had subsequently gone to London to star in a West End revue for Kenneth Williams, \"Pieces of Eight\". This old-fashioned review was such a success there was a sequel, \"One Over The Eight\". He was advised by his agent not to star in the fringe with the three others as he was a professional whereas they were amateurs. Ironically, the great success of \"Beyond the Fringe\", which was a new kind of satirical comedy, would doom the very old-fashioned reviews that Cook had just tasted success in. \"Beyond the Fringe\" not only won great acclaim in the UK, but it was a hit in the U.S.. The four won a special Tony Award in 1963 for their Broadway production of \"Beyond The Fringe\" and there was a television program made of the revue in 1964. Moore and Cook were offered the TV show Not Only... But Also (1965) by the BBC in 1965. Peter Cook was on as a guest. Their pairing was so successful, it enjoyed a second season in 1966 and a third in 1970. They were particularly funny as the working-class characters \"Pete\" and \"Dud\". The duo then broke into the movies, including The Wrong Box (1966) and Bedazzled (1967). In 1974, the duo won their second Tony Award for their show \"Good Night\", which was the stage version of their TV series \"Not Only... But Also\". In the mid- to late 1970s, they issued three comic albums in the guise of the characters \"Derek\" and \"Clive\" (Moore and Cook, respectively), two lavatory attendants that many viewed as reincarnations of their earlier TV characters \"Pete\" and \"Dud\". The albums, ad libbed in a recording studio while the two drank vast quantities of alcohol, were noted at the time for their obscenity. Their typical routine was a stream-of-consciousness fugue by Cook, interspersed with interjections by Moore. With their obscenity-laden, free-formed riffs, Derke and Clive presaged the more free-wheeling shock comedy of the 1980s and '90s. After marrying American actress Tuesday Weld in 1975, Moore moved to the U.S. and began a second career as a solo screen comedian, stealing the show from Chevy Chase and Goldie Hawn as the horny conductor in the movie comedy, Foul Play (1978). When George Segal dropped out of the movie 10 (1979), director Blake Edwards cast Moore in the lead role as the composer undergoing a mid-life crisis. It was a huge hit, but was surpassed by his Oscar-nominated turn as the dipsomaniac billionaire in Arthur (1981). In the early 1980s, Moore was a top box office attraction. In 1983, the National Alliance of Theater Owners named him the Top Box Office Star-Male of the Year. His career began petering out after he turned down the lead in Splash (1984), a role that helped establish Tom Hanks as a top movie comedian and position him for his transition into movie drama and super-stardom. As Hanks star waxed, Moore's star waned, and by 1985 he was reduced to playing an elf in Santa Claus: The Movie (1985), one of the all time turkeys. Even a second turn as \"Arthur\" in Arthur 2: On the Rocks (1988) couldn't revive his box office, the dependent clause of the title all too well describing his career. His TV series Dudley (1993) [TV-Series] was a bust, and the 1990s proved a wasteland for the once-honored and prosperous comedian. Moore was deeply affected by the January 1995 death of Peter Cook by a gastrointestinal hemorrhage at the age of 57. Moore organized a two-day memorial to Cook in Los Angeles that was held in November 1995. Less than four years later, in September 1999, Moore announced that he was afflicted with progressive supra-nuclear palsy, a disease for which there is no treatment. Dudley Moore was invested as a Commander of the Order of The British Empire (one step below knighthood) in June 2001. Moore personally attended the ceremony at Buckingham Palace to accept his CBE from Prince Charles, despite being unable to speak and being wheelchair-bound. He died in Watchung, New Jersey on March 27, 2002, from the pneumonia related to progressive supra-nuclear palsy. He was 66 years old. Dudley Moore was married four times, to actresses Suzy Kendall, Tuesday Weld, Brogan Lane and 'Nicole Rothschild', and had two sons, one with Tuesday Weld and one with Nicole Rothschild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjY5MTQxOF5BMl5BanBnXkFtZTcwNTAxMTkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001545","name":"Dudley Moore","nicknames":["Cuddly Dudley","The Sex Thimble"],"idIMDB":"nm0001545"},"actorId":"nm0001545","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lily Tomlin","urlProfile":"http://www.imdb.com/name/nm0005499","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjc5NzA2NV5BMl5BanBnXkFtZTcwNjk1MTk3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1939","placeOfBirth":" Detroit, Michigan, USA","birthName":"Mary Jean Tomlin","height":"5' 5½\" (1.66 m)","bio":"Lily Tomlin was born September 1, 1939 in Detroit, Michigan, to Lillie Mae (Ford) and Guy Tomlin, who moved to Michigan from Paducah, Kentucky, during the Great Depression. Her mother was a nurse's aide and her father was a factory worker. She graduated from Cass Technical High School in 1957, and later enrolled at Wayne State University. She began career by doing stand-up comedy in nightclubs in Detroit and New York City. Her first television appearance was on \"The Merv Griffin Show\". She went on to have astronomical success with several characters, notably, Ernestine, a nosy, condescending telephone operator who generally treated customers with little sympathy and regard, on Rowan & Martin's Laugh-In (1967). Other notable characters are in film include, Linnea Reese, a gospel-singing mother of two deaf children who has an affair with a womanizing country singer (played by (Keith Carradine) in Robert Altman's Nashville (1975). A performance for which she was nominated an Academy Award. Violet Newstead who joins her on-screen coworkers (played by Jane Fonda and Dolly Parton) in seeking revenge on their monstrous and sexist boss, Franklin M. Hart Jr., (played by Dabney Coleman) in the comedy 9 to 5 (1980), The Incredible Shrinking Woman (1981), Doreen Piggot in Robert Altman's Short Cuts (1993), Cher's best-friend and American compatriot Georgie Rockwell in Un thé avec Mussolini (1999), deadpan private investigator, and existentialist Vivian Jaffe in I Heart Huckabees (2004), and Country-Western singer Rhonda Johnson in Robert Altman's final film A Prairie Home Companion (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjc5NzA2NV5BMl5BanBnXkFtZTcwNjk1MTk3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005499","name":"Lily Tomlin","idIMDB":"nm0005499"},"actorId":"nm0005499","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Oz","urlProfile":"http://www.imdb.com/name/nm0000568","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1944","placeOfBirth":" Hereford, England, UK","birthName":"Frank Richard Oznowicz","height":"6' 2\" (1.88 m)","bio":"Frank Richard Oznowicz was born in Hereford, England to puppeteers Frances and Isidore Oznowicz. His family moved to Montana in 1951, eventually settling in Oakland, California. As a teenager, he worked as an apprentice puppeteer at Children's Fairyland amusement park. He is one of the primary puppeteers responsible for the development of Jim Henson's Sesame Street (1969) and _\"The Muppet Show\" (1976)_ as well as over 75 other Muppet productions. 'George Lucas' originally contacted Henson to play the part of Yoda in Star Wars: Episode V - The Empire Strikes Back (1980), but he recommended Oz for the part instead. He developed the character's trademark syntax, returning to voice and puppet the Jedi Master in Star Wars: Episode VI - Return of the Jedi (1983) and Star Wars: Episode I - The Phantom Menace (1999). He voiced the CGI character in Star Wars: Episode II - Attack of the Clones (2002) and Star Wars: Episode III - Revenge of the Sith (2005), supporting the transition of the character's rendering to digital. In 2011, the Blu-Ray edition of The Phantom Menace replaced the puppet Yoda with CGI to match the other prequel films. He began a career of behind-the-camera puppet and live action filmmaking by co-directing The Dark Crystal (1982) with Henson. He went on to direct The Muppets Take Manhattan (1984), Little Shop of Horrors (1986), Dirty Rotten Scoundrels (1988), What About Bob? (1991), The Indian in the Cupboard (1995), Bowfinger (1999), The Score (2001), The Stepford Wives (2004) and Death at a Funeral (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000568","name":"Frank Oz","idIMDB":"nm0000568"},"actorId":"nm0000568","character":"Fozzie Bear / Miss Piggy / Sam the Eagle","urlCharacter":"http://www.imdb.com/character/ch0000530","main":true},{"actorName":"Jerry Nelson","urlProfile":"http://www.imdb.com/name/nm0625456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg1NjEzNjU4NF5BMl5BanBnXkFtZTcwNzYxOTEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1934","placeOfBirth":" Tulsa, Oklahoma, USA","bio":"Puppeteer, actor, musician, and master of voices, Jerry Nelson originally joined Henson & Company as a temporary replacement for Frank Oz, who had been drafted into the armed services in the 60's. He later re-joined the crew as a full-time performer in the 70's, and has since been heavily involved in almost every major Muppet project, including Sesame Street (1969), The Muppet Show (1976), Fraggle Rock (1983) and feature films. Memorable characters include \"The Count\", \"Herry Monster\", \"Mumford the Magician\", \"Robin the Frog\", \"Crazy Harry\" and \"Gobo\". Come the late 1990s, Nelson has begun to focus more on his musical career but continues his involvement in The Muppets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg1NjEzNjU4NF5BMl5BanBnXkFtZTcwNzYxOTEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625456","name":"Jerry Nelson","idIMDB":"nm0625456"},"actorId":"nm0625456","character":"Lew Zealand / Pops / Dr. Julius Strangepork / Sgt. Floyd Pepper","urlCharacter":"http://www.imdb.com/character/ch0000702","main":true},{"actorName":"Richard Hunt","urlProfile":"http://www.imdb.com/name/nm0402611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDM0NzQzMV5BMl5BanBnXkFtZTgwMDk4MTY4NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1951","placeOfBirth":" Bronx, New York, USA","bio":"Richard Hunt did not have a face known to many -- his voice was known more than anything else. He was a major stronghold behind Jim Henson's \"Muppets\". 'Scooter', 'Janice', 'Sweetums' and a few others, were some of the \"Muppets\" that Richard was a performer and puppeteer of. He helped pave the way for Jim Henson and his company from the 1970s through the early 90s, until his surprising death in 1992 of AIDS.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDM0NzQzMV5BMl5BanBnXkFtZTgwMDk4MTY4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0402611","name":"Richard Hunt","idIMDB":"nm0402611"},"actorId":"nm0402611","character":"Beaker / Janice / Scooter / Sheriff / Statler","urlCharacter":"http://www.imdb.com/character/ch0000608","main":true},{"actorName":"Dave Goelz","urlProfile":"http://www.imdb.com/name/nm0324397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzg3NzQyMF5BMl5BanBnXkFtZTgwMzE5MDAyNzE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"David Charles Goelz","height":"5' 10\" (1.78 m)","bio":"A longtime puppet designer and performer, Goelz was picked up by Jim Henson and company to design Muppets for various television projects in the early 70's. By the time Jim Henson and Frank Oz were beginning work on \"The Muppet Show\", they managed to convince Dave to come work as a puppeteer. He soon began to perform and develop such memorable characters as the Great Gonzo and Dr. Bunsen Honeydew. He has gone on to become a principal Muppeteer and one of the major talents of the Jim Henson Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzg3NzQyMF5BMl5BanBnXkFtZTgwMzE5MDAyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0324397","name":"Dave Goelz","idIMDB":"nm0324397"},"actorId":"nm0324397","character":"The Great Gonzo / Joe / Beauregarde / Fireman","urlCharacter":"http://www.imdb.com/character/ch0040025","main":true},{"actorName":"Steve Whitmire","urlProfile":"http://www.imdb.com/name/nm0926209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDM3NzE0MV5BMl5BanBnXkFtZTgwMDk4MDAyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1958","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Steven Lawrence Whitmire","height":"6' 4\" (1.93 m)","bio":"Steve Whitmire was born on September 24, 1958 in Atlanta, Georgia, USA as Steven Lawrence Whitmire. He is an actor, known for The Muppets (2011), The Muppet Christmas Carol (1992) and The Dark Crystal (1982). He has been married to Melissa Whitmire since June 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDM3NzE0MV5BMl5BanBnXkFtZTgwMDk4MDAyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926209","name":"Steve Whitmire","nicknames":["Kermit"],"idIMDB":"nm0926209"},"actorId":"nm0926209","character":"Rizzo the Rat / The Scarlet Pimpernel / Jed","urlCharacter":"http://www.imdb.com/character/ch0000703","main":true},{"actorName":"Louise Gold","urlProfile":"http://www.imdb.com/name/nm0325028","urlPhoto":"","biography":{"dateOfBirth":"1956","placeOfBirth":" London, England, UK","height":"5' 9\" (1.75 m)","bio":"Louise Gold was born in 1956 in London, England. She is an actress, known for The Dark Crystal (1982), The Muppet Show (1976) and The Great Muppet Caper (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0325028","name":"Louise Gold","idIMDB":"nm0325028"},"actorId":"nm0325028","character":"Popcorn Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathryn Mullen","urlProfile":"http://www.imdb.com/name/nm0612020","urlPhoto":"","biography":{"dateOfBirth":"10 February 1940","placeOfBirth":" New York City, New York, USA","bio":"Kathryn Mullen was born on February 10, 1940 in New York City, New York, USA. She is an actress, known for The Dark Crystal (1982), Fraggle Rock (1983) and Between the Lions (1999). She is married to Michael K. Frith.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0612020","name":"Kathryn Mullen","idIMDB":"nm0612020"},"actorId":"nm0612020","character":"Gaffer / Muppet Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Muehl","urlProfile":"http://www.imdb.com/name/nm0610970","urlPhoto":"","biography":{"bio":"Brian Muehl is an actor and writer, known for The Dark Crystal (1982), The Great Muppet Caper (1981) and Big Bird in China (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0610970","name":"Brian Muehl","idIMDB":"nm0610970"},"actorId":"nm0610970","character":"Muppet Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Payne","urlProfile":"http://www.imdb.com/name/nm0668267","urlPhoto":"","biography":{"bio":"Bob Payne is known for his work on The Dark Crystal (1982), The Muppet Movie (1979) and The Great Muppet Caper (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0668267","name":"Bob Payne","idIMDB":"nm0668267"},"actorId":"nm0668267","character":"Muppet Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rollin Krewson","urlProfile":"http://www.imdb.com/name/nm0471109","urlPhoto":"","biography":{"dateOfBirth":"21 July 1952","placeOfBirth":" Bay Village, Ohio, USA","birthName":"Rollin L. Krewson","bio":"Rollin Krewson was born on July 21, 1952 in Bay Village, Ohio, USA as Rollin L. Krewson. She is known for her work on Labyrinth (1986), The Muppet Show (1976) and The Muppet Christmas Carol (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0471109","name":"Rollin Krewson","idIMDB":"nm0471109"},"actorId":"nm0471109","character":"Muppet Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Henson","urlProfile":"http://www.imdb.com/name/nm0001345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1936","placeOfBirth":" Greenville, Mississippi, USA","birthName":"James Maury Henson","height":"6' 1\" (1.85 m)","bio":"Jim Henson never thought that he would make a name of himself in puppetry; it was merely a way of getting himself on television. The vehicle that achieved it was Sam and Friends (1955), a late-night puppet show that was on after the 11:00 news in Washington DC. It proved to be very popular and inspired Jim to continue using puppets for his work. He made many commercials, developing the signature humor that Henson Productions is known for. A key reason for the success of his puppets is that Jim realized he didn't need to hide puppeteers behind a structure when they were in front of a camera. All he had to do was instruct the camera operators to focus on the puppets and keep the puppeteers out of the frame. This allowed the puppets to dominate the image and make them more lifelike. This work on puppets and television would lead to separate projects that had different goals. The first one was his work on the The Jimmy Dean Show (1963) with the character Rowlf the Dog, the oldest clearly identified character that Henson Productions still uses. This show provided an income that allowed Jim to work on a pet project. That project was Time Piece (1965), a surrealistic short about time which was nominated for best live-action short Oscar. Henson shot to prominence when he was approached to use his muppets for the revolutionary educational show Sesame Street (1969). The show was a smash hit and his characters have become staples on public television. Unforetunately, this also led to Henson being typecast as only an entertainer for children. He sought to disprove that by being part of the initial crew of Saturday Night Live (1975), but his style and that of the creative staff simply didn't jibe. It was this circumstance that encouraged him to develop a variety show format that had the kind of sophisticated humor that \"Sesame Street (1969)\" didn't work with. No American broadcaster was interested, but British producer Lew Grade was. This led to The Muppet Show (1976). It initially struggled both in the ratings and in the search for guest stars, but in the second season it became a smash hit and would eventually become the most widely watched series in television history. Hungry for a new challenge, Henson made The Muppet Movie (1979), defying the popular industry opinion that his characters would never work in a movie. The film became a hit and spawned a series of features which included the moody fantasy The Dark Crystal (1982), which was a drastic and bold departure from the amiable tone of his previous work. The most successful TV work in the 1980s was Fraggle Rock (1983), a fantasy series specifically designed to appeal to as many cultural groups as possible. During this time he also established the Creature Shop, a puppet studio that became renowned for being as brilliant with puppetry as ILM was at special effects. When he died all too soon in 1990, he was indisputably one of the geniuses of puppetry. More importantly, he was a man who achieved his phenomenal success while still retaining his social conscience and artistic integrity as his work in promoting environmentalism and his brilliant The Storyteller (1987) series respectively attest to.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001345","name":"Jim Henson","idIMDB":"nm0001345"},"actorId":"nm0001345","character":"Kermit the Frog / Rowlf / The Swedish Chef / Waldorf / Link Hogthrob","urlCharacter":"http://www.imdb.com/character/ch0000604","main":true}],"seasons":[],"idIMDB":"tt0344086","urlIMDB":"http://www.imdb.com/title/tt0344086","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr (60 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.6","filmingLocations":[],"awards":[],"votes":"120","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0075163","name":"Henson Associates"}],"keywords":{"keywords":["the muppets","spoof"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:09:37"}}