{"data":{"movies":[{"title":"Six: The Mark Unleashed","originalTitle":"","year":"2004","releaseDate":"20040506","directors":[{"name":"Kevin Downes","id":"nm0235948"}],"writers":[{"name":"Kevin Downes","id":"nm0235948"},{"name":"Chipper Lowell","id":"nm0523083"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MjA1MDkzMjBeQTJeQWpwZ15BbWU3MDM2NjI3NDk@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","Sci-Fi","Thriller"],"plot":"In the last days before Armaggeddon, three men must made one eternal choice: receive the mark of the devil or stand for Christ. This movie will make you think about your own life choices.","simplePlot":"In the last days before Armaggeddon, three men must made one eternal choice: receive the mark of the devil or stand for Christ. This movie will make you think about your own life choices.","actors":[{"actorName":"Stephen Baldwin","urlProfile":"http://www.imdb.com/name/nm0000286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTA4OTc5MF5BMl5BanBnXkFtZTcwOTQ3ODE5MQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1966","placeOfBirth":" Massapequa, Long Island, New York, USA","birthName":"Stephen Andrew Baldwin","height":"5' 10\" (1.78 m)","bio":"Stephen Baldwin was born on May 12, 1966 in Massapequa, Long Island, New York, USA as Stephen Andrew Baldwin. He is an actor and producer, known for The Usual Suspects (1995), The Young Riders (1989) and Born on the Fourth of July (1989). He has been married to Kennya Baldwin since June 10, 1990. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTA4OTc5MF5BMl5BanBnXkFtZTcwOTQ3ODE5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000286","name":"Stephen Baldwin","idIMDB":"nm0000286"},"actorId":"nm0000286","character":"Luke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David A.R. White","urlProfile":"http://www.imdb.com/name/nm0924684","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTQ4OTI5M15BMl5BanBnXkFtZTcwMDUzMzU0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1970","placeOfBirth":" Dodge City, Kansas, USA","birthName":"David Andrew Roy White","height":"6' (1.83 m)","bio":"David A.R. White has been a working actor, director and producer in Los Angeles for over twenty years. He was raised in a small Mennonite farming community outside of Dodge City, Kansas. At the age of 19, David moved to LA, and only six months after moving, landed a recurring role on the hit top 10, TV CBS sitcom, Evening Shade for close to four years. He played the best friend of Burt Reynolds's son. David then went on to guest appearances on such shows as: Coach, Saved by the Bell, Sisters, Melrose Place, Martial Law and many others. In 1999, produced and starred in his first feature length film, The Moment After. The following year, he produced and starred in the groundbreaking faith based theatrical film, Mercy Streets opposite Eric Roberts, Stacy Keach and Cynthia Watros. David was nominated for a movie guide's \"best actor\" award for his dual roles in the film. Sony picked up both films for distribution. David kept producing and starring in films throughout the next several years. In late 2005, David became a founding partner in the film distribution/production entity Pure Flix. Today, Pure Flix maintains its position as the number one Faith based studio, producing and distributing more films in this genre than any other studio. David also maintains his position as one of the most prolific actors/filmmakers in the faith based arena, as he writes, directs, produces and stars in many of the films. David has starred in over 20 films. Some of his film credits include: SIX...the Mark Unleashed, The Moment After 1,2, In the Blink of an Eye, Hidden Secrets, Holyman Undercover, Run On, Marriage Retreat, Me Again, Jerusalem Countdown (based on the best selling book that sold over 2 million units and the Revelation Road movies. In 2012, David created, produced and starred in the UP original film, Brother White. He co-starred with Reginald Vel Johnson, Jackee, Victoria Jackson, academy award nominee Bruce Davison, Ray Wise and his lovely real life wife, Andrea Logan White. At the TCA's that year, David got rave reviews and became a darling, charming the critics with his real life Mennonite stories. For his performance in Brother White, David was named a finalist in 5th Annual Cable FAX Program Awards in the category of Best Actor/Actress - Family Friendly In 2014, David produced and Co Starred in the #1 live action independent movie of the year, God's Not Dead. He starred with Kevin Sorbo and Dean Cain in God's Not Dead. God's Not Dead maintains it's position as the 6th most profitable movie in cinema history based on it's ROI. Also in 2014, David helped produced a new Sony Film, which he helped create with his wife, Mom's Night Out. This movie starred Patricia Heaton, Trace Atkins, Sean Astin and his wife, Andrea Logan White. In 2015, David starred in the new action/comedy dog movie Dancer and the Dame. He starred opposite Billy Gardell. (Mike on Mike & Molly). He continues to be at the helm of Pure Flix shooting and releasing 4 theatricals films a year, and building and creating content for Pureflix.com","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTQ4OTI5M15BMl5BanBnXkFtZTcwMDUzMzU0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0924684","name":"David A.R. White","idIMDB":"nm0924684"},"actorId":"nm0924684","character":"Brody Sutton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Downes","urlProfile":"http://www.imdb.com/name/nm0235948","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ1NTAxMl5BMl5BanBnXkFtZTcwMzE1MDEyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kevin Downes is a California native. He grew up in Visalia, just 3 hours north of Los Angeles where most of the Christian films he and his friends and co-workers have made were shot. Before writing and producing The Moment After, Kevin worked with David White on The Crossing and The End of the Harvest. He produced the award-winning Warner Bros. short film/music video for Clay Walker, Chain of Love. He also produced Mercy Streets - released in theaters nationwide in 2000, and executive-produced Lay It Down. He produced the theatrically released Time Changer for Trinity Broadcasting Network and was writer/producer/director on Six: The Mark Unleashed. Kevin lives in Visalia, California with his wife Catherine and dog Darby.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ1NTAxMl5BMl5BanBnXkFtZTcwMzE1MDEyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235948","name":"Kevin Downes","idIMDB":"nm0235948"},"actorId":"nm0235948","character":"Jerry Willis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey Dean Morgan","urlProfile":"http://www.imdb.com/name/nm0604742","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcxOTQ0MTgxNl5BMl5BanBnXkFtZTgwMzIxNDY3NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1966","placeOfBirth":" Seattle, Washington, USA","height":"6' 2\" (1.88 m)","bio":"Jeffrey Dean Morgan endeared himself to audiences with his recurring role on ABC's smash hit series, Grey's Anatomy (2005). His dramatic arc as heart patient \"Denny Duquette\", who wins the heart of intern \"Izzie Stevens\" (Katherine Heigl) in a star-crossed romance, made him a universal fan favorite. He also had recurring roles on The CW and Warner Bros. Television's drama series, Supernatural (2005), and on Showtime and Lions Gate Television's award-winning comedy series, Weeds (2005). Morgan starred in Warner Bros.' Watchmen (2009), director Zack Snyder's (300 (2006)) adaptation of the iconic graphic novel. He played the pivotal role of \"The Comedian\", a Vietnam vet who is a member of a group of heroes called \"the Minutemen\". He next appeared in producer Joel Silver's The Losers (2010), for Warner Bros. It is an adaptation of DC-Vertigo's acclaimed comic book series about a band of black ops commandos who are set up to be killed by their own government. The team barely survives and sets out to get even. James Vanderbilt adapted the screenplay, and Sylvain White directed. He appeared in Focus Features' Taking Woodstock (2009), directed by Oscar-winning director Ang Lee. He also starred opposite Uma Thurman in Yari Film Group's romantic comedy, The Accidental Husband (2008). Additional feature credits include a cameo role opposite Rachel Weisz in Warner Bros.' comedy, Fred Claus (2007), and the independent office comedy, Kabluey (2007), in which he played a charismatic yet smarmy co-worker to Lisa Kudrow's character. In 2011, the in-demand actor starred in the independent murder mystery, Texas Killing Fields (2011). In the film, based on a true story, Morgan plays a detective transplanted from New York who teams with a local investigator (Sam Worthington) to work on a series of unsolved murders in industrial wastelands surrounding Gulf Coast refineries, where as many as 70 bodies turned up over the past two decades. Together, they wage a war against the unknown assailants. Michael Mann produced the film, while his daughter, Ami Canaan Mann, directed. The actor traveled to Thailand, where he filmed the Weinstein Company's period drama, Shanghai (2010), under the direction of Mikael Håfström (1408 (2007)). John Cusack stars as an American who returns to a corrupt, Japanese-occupied Shanghai four months prior to Pearl Harbor and learns that his friend \"Connor\" (Morgan) has been killed. While trying to solve the murder, he discovers a much larger secret that his own government is hiding. In addition, Morgan has a role in Michael London's Groundswell Productions' All Good Things (2010), starring Kirsten Dunst and Ryan Gosling, also for The Weinstein Co. He also stars opposite two-time Academy Award winner Hilary Swank in the suspense thriller, The Resident (2011), for Hammer Films. It is the story of a young doctor (Swank) who moves into a Brooklyn loft and becomes suspicious that she is not alone. Morgan plays \"Max\", her charming new landlord who she discovers has developed a dangerous obsession with her. Morgan previously co-starred with Swank in Warner Bros.' P.S. I Love You (2007). Morgan also appeared in the MGM/UA reboot of the 1984 action movie, Red Dawn (2012). The plot focuses on a group of teenagers who form an insurgency, called \"the Wolverines\", when their town is invaded by Cuban and Russian soldiers. Morgan plays the role of \"Lieutenant Andrew Tanner\", leader of the U.S. Special Forces who finds the Wolverines. Morgan was born in Seattle, Washington, to Sandy Thomas and Richard Dean Morgan. In his spare time, Morgan enjoys barbecuing on the grill, reading, watching movies and listening to his favorite band, The Eagles. He also loves to root for his home team, the Seattle Seahawks. He resides in Los Angeles with his dogs, Bisou and Bandit Mogan, a puppy he rescued in Puerto Rico while filming The Losers (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcxOTQ0MTgxNl5BMl5BanBnXkFtZTgwMzIxNDY3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604742","name":"Jeffrey Dean Morgan","nicknames":["Jeff","McNaughty"],"idIMDB":"nm0604742"},"actorId":"nm0604742","character":"Tom Newman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Roberts","urlProfile":"http://www.imdb.com/name/nm0000616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1956","placeOfBirth":" Biloxi, Mississippi, USA","birthName":"Eric Anthony Roberts","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's edgier, more intriguing characters running around and about for decades, Eric Anthony Roberts started life in Biloxi, Mississippi. He is the son of Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights. His siblings are actors Lisa Roberts Gillan and Julia Roberts, and he grew up in Atlanta, Georgia. He began his acting career at age 5 in a local theater company called the \"Actors and Writers Workshop\", founded by his late father. After his schooling at Grady High, he studied drama at age 17 in London for two years at the Royal Academy of Dramatic Arts, then returned to the States and continued his studies at the American Academy in New York. He made his NY stage debut in \"Rebel Women\" in 1976 at age 20 and appeared in regional productions, once playing the newspaper boy in a production of \"A Streetcar Named Desire\" starring Shirley Knight and Glenn Close. After appearing in such daytime soaps as Another World (1964) and How to Survive a Marriage (1974), his career began to shift fast forward when he copped a leading role in a major film. In King of the Gypsies (1978), based on Peter Maas' best-seller about a fracturing dynasty of New York City gypsies, he made his debut alongside an intimidating roster of stars including Judd Hirsch, Susan Sarandon, Shelley Winters and Sterling Hayden. Young Eric held his own expertly (winning a Golden Globe nomination) while his burning intensity and brooding charm marked sure signs of star potential. After this, he won the lead opposite Milo O'Shea in the 1980 stage production of \"Mass Appeal\". He suffered serious injuries in a car accident during his nascent film career but lost no fans by the time he returned to co-star with Sissy Spacek as a small-town stranger in Raggedy Man (1981). It was, however, his stark and frightening portrayal of two-bit hustler Paul Snider, the cast-off boyfriend who slays Playmate-turned-movie starlet Dorothy Stratten (played by Mariel Hemingway) in Star 80 (1983) that really put him on the movie map and earned him a second Golden Globe nomination. A wide range of fascinating, whacked-out roles were immediately offered to him on a silver plate. He played another dangerous streetwise hustler type in The Pope of Greenwich Village (1984) opposite fellow rebel Mickey Rourke; a cocky soda pop sales exec in the Australian comedy Coca-Cola kid (1985); appeared with more charm and restraint opposite Rosanna Arquette in the offbeat romantic comedy Nobody's Fool (1986) and topped his prolific period off with an Academy Award nomination as a young prison escapee hiding out with Jon Voight aboard an out-of-control train in the ultra-violent, character-driven action adventure Runaway Train (1985). Good things continued to happen when he was a replacement lead in the original run of \"Burn This\" and won a Theatre World Award for his 1988 Broadway debut. A risky, no-holds-barred actor, he was often guilty of overacting if given half the chance. His film career began to slide in the late 1980s, appearing in more quantity than quality pictures. A series of missteps led to unheralded appearances in such bombs as the karate-themed Best of the Best (1989); the NY urban thriller The Ambulance (1990); the action western Blood Red (1989), which took three years to release and is the only film Eric and his sister Julia Roberts appeared in together; and Rude Awakening (1989) when he filled in as a burned-out hippie opposite a Chong-less Cheech Marin. More under appreciated \"B\" filming came with the 1990s (Freefall (1994), Sensation (1994), The Nature of the Beast (1995), etc.), while also chewing the scenery with a number of mobster types in TV-movies, including one as \"Al Capone\". He soon began appearing as flashy secondary villains and creepies that showcased other stars instead, such as Final Analysis (1992) starring Richard Gere, Heaven's Prisoners (1996) top lining Alec Baldwin, and The Dark Knight (2008), part of the \"Batman\" series with Christian Bale and the late Heath Ledger. Eric's undeniable, unconventional talent would occasionally mesh with the perfect role. At the Sundance Film Festival in 1996, he received critical applause for his starring role as a man dying of AIDS in the uplifting and emotional film It's My Party (1996) and earned more honors as a writer marked for murder in the mob-themed story La Cucaracha (1998). He was also perfectly cast as one of the cold-blooded killers in the Emmy-nominated TV adaptation of Truman Capote's chiller In Cold Blood (1996). Eric continued to appear sporadically on TV in such dramatic series as Law & Order: Criminal Intent (2001), while sometimes showing a fun side as well in comedy (The King of Queens (1998)). His own series work included Less Than Perfect (2002) and, more recently, and in the cult program Heroes (2006) where promise for a longer participation ended with his character's death. Recovered from a long-standing cocaine problem, Eric wed, for the first time, actress/writer Eliza Roberts (nee Garrett). They have appeared in such films as Killer Weekend (2004) and Final Approach (2005). His daughter from a former relationship, Emma Roberts, is a newly popular and fast-rising \"tween\" actress from the series Unfabulous (2004) and has played youthful super-sleuth Nancy Drew (2007) on film. Eric's unpredictable, volatile nature which works so mesmerizing on screen has also led to troubling times off camera; his relationship with younger sis Julia Roberts has been seriously strained for quite some time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000616","name":"Eric Roberts","idIMDB":"nm0000616"},"actorId":"nm0000616","character":"Dallas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Moon","urlProfile":"http://www.imdb.com/name/nm0600589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTEwODc3N15BMl5BanBnXkFtZTcwMzQ5NTcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Amy Moon is an actress, known for Six: The Mark Unleashed (2004), Woman's Solitude (1997) and Last Mistake (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTEwODc3N15BMl5BanBnXkFtZTcwMzQ5NTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0600589","name":"Amy Moon","nicknames":["Moon"],"idIMDB":"nm0600589"},"actorId":"nm0600589","character":"Jeseca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Troy Winbush","urlProfile":"http://www.imdb.com/name/nm0934569","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2MTAyMzYxM15BMl5BanBnXkFtZTgwMTM0NTY0OTE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Troy Lee Winbush was born on March 12, 1970, in Harlem, New York. He attended Louis B. Brandeis High School and was known as the class clown. Troy idolized Eddie Murphy and enjoyed making his classmates laugh; however, making the class laugh and disrupting the class was not a good time for his jokes and he was constantly disciplined for his actions. At the age of 14 years old, Troy's mother enrolled him in Weist Barron acting school hoping this will allow Troy to express his humor in the proper environment and not get into trouble at school any more. That same year, Troy discovered his acting bug and booked his first movie \"Who's That Girl\" with Madonna; unfortunately, due to bad weather, production was moved to California and Troy was released from his first big break. A couple of months later, Troy booked the motion picture film, \"The Principle\". At the age of 15 years old, Troy got a recurring role on the most popular family comedy show of the 1980s, \"The Cosby Show\" as Denny, appearing on the series from 1987-1991. While spending the next few years working Bicoastal, Troy decided to officially move to Los Angeles in 1998. Troy has had much success co-starring on feature films such as; John Q, The Replacement and National Treasure just to name a few. Troy has also been featured in numerous television shows; Law & Order, NYPD Blue, CSI: Miami, The Parkers, and Medical Investigation to today's hit shows including Scandal, Big Bang Theory and among other popular series. Troy has also taken his talent to the stage appearing in stage plays including (Joe Turners) \"Come and Gone\", Pearly Victorious, Gang on the Roof and countless others. Today's Troy continues to successfully stay active in TV and film as well as inspiring others in his work. He spends his free time mentoring young teen boy's in group homes and encourages them to become a better man in society no matter what they've been though, they can be victorious in whatever they put their minds too. Troy also supports important causes, like breast cancer and cervical cancer. He enjoys spending time with his daughter whom he loves and supports unconditionally. On his off days you can find Troy working out in the gym or enjoying a ride on his motorcycle in the beautiful Southern California weather.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2MTAyMzYxM15BMl5BanBnXkFtZTgwMTM0NTY0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934569","name":"Troy Winbush","idIMDB":"nm0934569"},"actorId":"nm0934569","character":"Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Coleman Luck","urlProfile":"http://www.imdb.com/name/nm1686037","urlPhoto":"","biography":{"bio":"Coleman Luck is an actor, known for Six: The Mark Unleashed (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1686037","name":"Coleman Luck","idIMDB":"nm1686037"},"actorId":"nm1686037","character":"Charles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sung Hi Lee","urlProfile":"http://www.imdb.com/name/nm0498308","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODg5NzI3Ml5BMl5BanBnXkFtZTcwNTE4OTYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1970","placeOfBirth":" Seoul, South Korea","height":"5' 4\" (1.63 m)","bio":"Sung Hi Lee was born on April 1, 1970 in Eunpyong-Gu (Gija-Chon), a borough of Seoul, South Korea. She moved to the United States in 1978 and spent a large part of her childhood moving around from city to city. Sung Lee was a studious child and teenager spending more time at the library than at stay-overs and parties before attended Ohio State University on a scholarship for three years. During a visit to a local night club she joined a pageant which drew attention to her. She soon received a scholarship and started modeling. This led to that and several months later Sung Lee landing in the pages of Playboy. Sung Lee, still a college student, put her academics on hold to pursue modeling in New York City. Her short stature made it hard to land permanent gigs. However, during a trip to Los Angeles she met once more with Playboy and from 1993 to 1998 appeared 12 time for the magazine. While in Los Angeles, she also made movie and silver screen contacts and landed a few parts on the Mortal Kombat TV series, Nurse Betty, and V.I.P., amongst others - as well as advertisement spots. Sung Hi Lee hasn't forgotten her books and wishes to pursue her degree in sports medicine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODg5NzI3Ml5BMl5BanBnXkFtZTcwNTE4OTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0498308","name":"Sung Hi Lee","idIMDB":"nm0498308"},"actorId":"nm0498308","character":"Beautiful Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Declan Joyce","urlProfile":"http://www.imdb.com/name/nm1238005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDc0ZmUyODYtZTFiYi00ZWI0LWFiZjctMDEzOTc2MzNlNmFjXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1970","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Declan Edmund Leo Joyce","height":"6' 2\" (1.88 m)","bio":"Declan Joyce was born on October 14, 1970 in Cleveland, Ohio, USA as Declan Edmund Leo Joyce. He is an actor and producer, known for Cops and Robbers, American Idiots (2013) and Not Another Not Another Movie (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDc0ZmUyODYtZTFiYi00ZWI0LWFiZjctMDEzOTc2MzNlNmFjXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1238005","name":"Declan Joyce","idIMDB":"nm1238005"},"actorId":"nm1238005","character":"Joe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Gilbert","urlProfile":"http://www.imdb.com/name/nm0318110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3ODM0MjgyNF5BMl5BanBnXkFtZTcwMDEwNTIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"John Gilbert is an actor and producer, known for The Moment After II: The Awakening (2006), Intoxicated Demons (2005) and Drive Thru (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3ODM0MjgyNF5BMl5BanBnXkFtZTcwMDEwNTIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0318110","name":"John Gilbert","idIMDB":"nm0318110"},"actorId":"nm0318110","character":"Commander","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Heller","urlProfile":"http://www.imdb.com/name/nm0375280","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQxODQ3NzQ1OV5BMl5BanBnXkFtZTgwNzQwMzg2OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Brad Heller is an actor and producer, known for God's Not Dead 2 (2016), Moms' Night Out (2014) and Most (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQxODQ3NzQ1OV5BMl5BanBnXkFtZTgwNzQwMzg2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0375280","name":"Brad Heller","idIMDB":"nm0375280"},"actorId":"nm0375280","character":"Preston Scott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tiny Ron","urlProfile":"http://www.imdb.com/name/nm0864096","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc4NDQwMDA4NV5BMl5BanBnXkFtZTcwMTE4MzQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1947","placeOfBirth":" Torrance, California, USA","birthName":"Ronald Taylor","height":"7' (2.13 m)","bio":"Played professional basketball in the 70s in Vienna, Austria - won Austrian Championship-Ring 6 times then back home in the US he started his movie-career","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc4NDQwMDA4NV5BMl5BanBnXkFtZTcwMTE4MzQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0864096","name":"Tiny Ron","nicknames":["Tiny Ron"],"idIMDB":"nm0864096"},"actorId":"nm0864096","character":"Eddie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elena Lyons","urlProfile":"http://www.imdb.com/name/nm0529050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NzU0MjcwOV5BMl5BanBnXkFtZTcwOTQxNDgyMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1973","placeOfBirth":" Madrid, Spain","birthName":"Elena Rosaia","height":"5' 7½\" (1.71 m)","bio":"Elena moved to Los Angeles from New Orleans after high school to pursue an acting career. She is currently the 10th ranked female in the state of California in sporting clay and trap shooting (shotgun). In 2005 she made Maxim Magazine's Hot 100 list. She has two Great Danes and a parrot. She loves Hot Rod's and has owned three, her favorite a '65 Convertible Chevelle Malibu SS. Elena is currently taking flight lessons to be a pilot. So look out.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NzU0MjcwOV5BMl5BanBnXkFtZTcwOTQxNDgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0529050","name":"Elena Lyons","idIMDB":"nm0529050"},"actorId":"nm0529050","character":"Rahab","urlCharacter":"http://www.imdb.com/character/ch0036027","main":true},{"actorName":"Monte Rex Perlin","urlProfile":"http://www.imdb.com/name/nm0674194","urlPhoto":"","biography":{"dateOfBirth":"23 November 1956","placeOfBirth":" Henderson, Nevada, USA","bio":"Monte Rex Perlin was born on November 23, 1956 in Henderson, Nevada, USA. He is known for his work on Memento (2000), Mr. & Mrs. Smith (2005) and Indiana Jones and the Kingdom of the Crystal Skull (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0674194","name":"Monte Rex Perlin","idIMDB":"nm0674194"},"actorId":"nm0674194","character":"Foley","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0344777","urlIMDB":"http://www.imdb.com/title/tt0344777","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 44 min (104 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.9","filmingLocations":[{"location":"Visalia, California, USA"}],"awards":[{"award":"Golden Trailer Awards 2003","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Trailer - No Movie","names":[]}]}]}],"votes":"1,187","type":"Movie","companyCreditsSimple":[{"idCompany":"co0093130","name":"Majestic Productions"},{"idCompany":"co0072098","name":"Signal Hill Pictures"}],"keywords":{"keywords":["future","implant","prison","christian film","law","dystopia","christian propaganda","antichrist","eschatology","bible prophecy","torture","politics","morality","mark of the devil","immorality","human experiment","experiment","ethics","end times","brainwashing","book of revelation","apocalypse","bible","666","rapture aftermath","religion","microchip","guillotine","execution","christian","christianity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:53:50"}}