{"data":{"movies":[{"title":"The Hitchhiker's Guide to the Galaxy","originalTitle":"","year":"2005","releaseDate":"20050429","directors":[{"name":"Garth Jennings","id":"nm1134029"}],"writers":[{"name":"Douglas Adams","id":"nm0010930"},{"name":"Douglas Adams","id":"nm0010930"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmU5MGU4MjctNjA2OC00N2FhLWFhNWQtMzQyMGI2ZmQ0Y2YyL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["USA","UK"],"languages":["English"],"genres":["Adventure","Comedy","Sci-Fi"],"plot":"Everyone has bad mornings. You wake up late, you stub your toe, you burn the toast...but for a man named Arthur Dent, this goes far beyond a bad day. When he learns that a friend of his is actually an alien with advanced knowledge of Earth's impending destruction, he is transported off the Earth seconds before it is exploded to make way for a new hyperspace motorway. And as if that's not enough, throw in being wanted by the police, Earth II, an insane electronic encyclopedia, no tea whatsoever, a chronically depressed robot and the search for the meaning of life, and you've got the greatest adventure off Earth.","simplePlot":"Mere seconds before the Earth is to be demolished by an alien construction crew, journeyman Arthur Dent is swept off the planet by his friend Ford Prefect, a researcher penning a new edition of \"The Hitchhiker's Guide to the Galaxy.\"","actors":[{"actorName":"Bill Bailey","urlProfile":"http://www.imdb.com/name/nm0047155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzOTMwNTQxOV5BMl5BanBnXkFtZTcwNDkzNTQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1965","placeOfBirth":" Bath, Somerset, England, UK","birthName":"Mark Bailey","height":"5' 7½\" (1.72 m)","bio":"Bill Bailey is known for his sharp wit and classic sense of humor. he is most famous for being in Never Mind The Buzzcocks, celebrity game-show in which he is a team captain. Bill is a stand up comedian, and has also starred in cult comedies such as Spaced and of course Black Books. He was given the award for the \"best stand-up\" at the British comedy awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzOTMwNTQxOV5BMl5BanBnXkFtZTcwNDkzNTQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0047155","name":"Bill Bailey","nicknames":["Bilbo"],"idIMDB":"nm0047155"},"actorId":"nm0047155","character":"The Whale","urlCharacter":"http://www.imdb.com/character/ch0007558","main":true},{"actorName":"Anna Chancellor","urlProfile":"http://www.imdb.com/name/nm0151250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODI2MjY0OF5BMl5BanBnXkFtZTcwOTAzODU3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1965","placeOfBirth":" Richmond, Surrey, England, UK","height":"5' 10\" (1.78 m)","bio":"Anna Chancellor was born on April 27, 1965 in Richmond, Surrey, England. She is an actress, known for The Hitchhiker's Guide to the Galaxy (2005), The Dreamers (2003) and What a Girl Wants (2003). She was previously married to Nigel Willoughby.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODI2MjY0OF5BMl5BanBnXkFtZTcwOTAzODU3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0151250","name":"Anna Chancellor","idIMDB":"nm0151250"},"actorId":"nm0151250","character":"Questular Rontok","urlCharacter":"http://www.imdb.com/character/ch0007557","main":true},{"actorName":"Warwick Davis","urlProfile":"http://www.imdb.com/name/nm0001116","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNzk3MjA3Ml5BMl5BanBnXkFtZTcwOTAxNjA3Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1970","placeOfBirth":" Epsom, Surrey, England, UK","birthName":"Warwick Ashley Davis","height":"3' 6\" (1.07 m)","bio":"English actor Warwick Davis was born in Epsom, Surrey, England, the son of Susan J. (Pain) and Ashley Davis, an insurance broker. Davis was born with the condition spondyloepiphyseal dysplasia congenital (SED), which caused his dwarfism. He was educated at City of London Freemen's School. When he was 11 years old, his grandmother heard a radio appeal for people under four feet tall to appear in Star Wars: Episode VI - Return of the Jedi (1983). A huge Star Wars fan, Davis auditioned successfully and was cast as an extra, playing an Ewok. Kenny Baker was cast as lead Ewok Wicket, but fell ill so George Lucas chose Davis to replace him. The film was a smash hit, and Davis went on to reprise his role as Wicket in further TV projects - The Ewok Adventure (1984) and Ewoks: The Battle for Endor (1985). Davis next big role came with a part specifically written for him, as the titular hero in Willow (1988). Other successes followed with roles in such projects as Prince Caspian and the Voyage of the Dawn Treader (1989) and two distinctly different film series - the 'Harry Potter' and 'Leprechaun' film series. In 2006, he appeared in a cameo role in Ricky Gervais and Stephen Merchant's hit sitcom Extras (2005), which led to the pair writing a series specifically for Davis, the comic mockumentary Life's Too Short (2011). Davis, along with his father-in-law Peter Burroughs, is also the director of an acting agency for very short and tall actors called Willow Management. He is married to Samantha Davis and they have a son and a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNzk3MjA3Ml5BMl5BanBnXkFtZTcwOTAxNjA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001116","name":"Warwick Davis","idIMDB":"nm0001116"},"actorId":"nm0001116","character":"Marvin","urlCharacter":"http://www.imdb.com/character/ch0007553","main":true},{"actorName":"Yasiin Bey","urlProfile":"http://www.imdb.com/name/nm0080049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NTYzODcxN15BMl5BanBnXkFtZTcwNTg3MTEwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1973","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Dante Terrell Smith","height":"5' 9½\" (1.77 m)","bio":"Regarded as one of hip-hop's most introspective and insightful artists, Mos Def has shaped a career that transcends music genres and artistic medium. Taking a cue from the Afrocentric stylings of the Native Tongues crew, which included De La Soul, Jungle Brothers, A Tribe Called Quest and Andres Titus, Mos Def has emerged as one of the more conscientious voices of new school hip-hop, alongside the likes of Common, Outkast, Goodie Mob and The Roots, to name just a few. Mos Def was born in Brooklyn, New York City, to Sheron Smith and Abdul Rahman. A child of hip-hop's Golden Era, he spent his childhood imbedded in the culture surrounding him as well as absorbing knowledge from across the artistic spectrum. With the release of \"Universal Magnetic\" (1996) Mos became an underground favorite in the hip hop world, leading to his legendary collaboration with Talib Kweli. The two formed Black Star whose debut album, Mos Def and Talib Kweli Are Black Star, would become one of the most critically acclaimed hip-hop albums. Mos followed that release with his 1999 solo debut, Black On Both Sides, which was certified gold and credited by critics as bringing hip-hop back to its soapbox roots. As with his music, Mos has demonstrated insight and passion with his acting career, appearing in Spike Lee's Bamboozled, MTV's Carmen: A Hip Hopera, 2002's critically acclaimed Monster's Ball, Showtime, and the 2002 romantic comedy Brown Sugar, for which he received an NAACP Image Award nomination. In addition Mos has served as the host, music supervisor and co-executive producer for the HBO series Def Poetry and served as a writer, producer and actor on the MTV sketch comedy series Lyricist Lounge. Mos completed his Broadway debut in 2002 in the Tony nominated, Pulitzer Prize winning, Topdog/Underdog. Mos re-teamed with Topdog playwright, Suzan Lori Parks and director George Wolfe for an off-Broadway play for which he was awarded an Obie Award. In 2003, Mos Def starred in Paramount Pictures' The Italian Job, alongside Ed Norton, Mark Wahlberg and Charlize Theron. Last year Mos Def starred opposite Alan Rickman in the critically acclaimed HBO movie Something the Lord Made, for which he has received a 2004 Emmy Nomination for Outstanding Lead Actor In A Miniseries Or A Movie. Def was also nominated for both a Golden Globe Award (Best Performance by an Actor in a Mini-Series or Motion Picture) and Golden Satellite Award (Best Actor in a Miniseries or a Motion Picture Made for Television) for the same role. He co-starred in the feature film The Woodsman, with Kevin Bacon, Benjamin Bratt, Eve and Kyra Sedgwick. The New York Times said of his performance, \"I hope we don't have to wait too much longer to see him in a big-screen leading role,\" and USA Today heralded him as \"the movie's best performance.\" In addition, he co-starred in Spyglass Entertainment's The Hitchhiker's Guide To The Galaxy, released in April 2005. In the film, an adaptation of the classic Douglas Adams Science Fiction novel, Def starred as hero \"Ford Prefect.\" Mos Def released his highly-anticipated and critically acclaimed sophomore solo release, The New Danger (Geffen Records), on October 12th. The album was met with praise from both critics and fans alike, with Rolling Stone giving it 4 Stars and hailing the album as \"Ghetto rock and righteous hip-hop from dazzingly talented Def\" and the New York Daily News proclaimed \"No one is doing more to change our notion of how hip hop can sound.\" The first single, \"Sex, Love and Money' earned Def a 2005 Grammy nomination for Best Alternative/Urban Performance and the album was certified gold by the RIAA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NTYzODcxN15BMl5BanBnXkFtZTcwNTg3MTEwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0080049","name":"Yasiin Bey","nicknames":["Pretty Flaco","Flaco Bey","The Mighty Mos Def","Bezé","Yasiin Bey","Mister Definitely"],"idIMDB":"nm0080049"},"actorId":"nm0080049","character":"Ford Prefect","urlCharacter":"http://www.imdb.com/character/ch0007554","main":true},{"actorName":"Zooey Deschanel","urlProfile":"http://www.imdb.com/name/nm0221046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjM2NDE1OF5BMl5BanBnXkFtZTcwMjA2NDU5OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Zooey Claire Deschanel","height":"5' 5\" (1.65 m)","bio":"Zooey Deschanel was born in 1980 into a showbiz family. Her father, Caleb Deschanel, is an Academy Award-nominated cinematographer (perhaps most notably for The Passion of the Christ (2004)) and her mother, Mary Jo Deschanel (née Weir), is an actress who appeared in Twin Peaks (1990). Her paternal grandfather was French, and her other roots include English, German, Scottish, Irish, and Dutch. Driven from an early age to become a successful actress, Zooey got her big break, at age 17, playing a model in the TV sitcom, Veronica's Closet (1997). She got her first film role, the following year, in Mumford (1999), which prompted her to quit university to pursue acting full-time. Mostly thanks to a role in Cameron Crowe's popular biopic, Almost Famous (2000), Zooey's rise to fame has been steadily increasing as the 21st century wears on. Her distinctive acting style found her critical acclaim in 2003, when she was voted Best Actress at the Mar Del Plata Film Festival for her role in David Gordon Green's All the Real Girls (2003). She also gained a Best Female Lead nomination (for All the Real Girls (2003)) at the following year's Independent Spirit Awards, but lost out to Charlize Theron. Zooey has appeared in such films as 500 Days of Summer (2009), Our Idiot Brother (2011), Yes Man (2008) (opposite Jim Carrey), Elf (2003) (opposite Will Farrell), Your Highness (2011), The Happening (2008) (opposite Mark Wahlberg), The Hitchhiker's Guide to the Galaxy (2005) and is the star of the FOX sitcom, New Girl (2011). Zooey is often compared to golden era Hollywood starlets and is also a talented singer. She has said in interviews that she believes her singing ability was pivotal in gaining the role of \"Jovie\" in Elf (2003). She also sang (and acted) in the Disney-produced musical, The Wonderful World of Disney: Once Upon a Mattress (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjM2NDE1OF5BMl5BanBnXkFtZTcwMjA2NDU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0221046","name":"Zooey Deschanel","nicknames":["Zo","Zuzu"],"idIMDB":"nm0221046"},"actorId":"nm0221046","character":"Trillian","urlCharacter":"http://www.imdb.com/character/ch0007547","main":true},{"actorName":"Su Elliot","urlProfile":"http://www.imdb.com/name/nm0254332","urlPhoto":"","biography":{"dateOfBirth":"18 December 1950","placeOfBirth":" Newcastle-upon-Tyne, England, UK","birthName":"Susan Elliott","bio":"Su Elliot was born on December 18, 1950 in Newcastle-upon-Tyne, England as Susan Elliott. She is an actress, known for The Hitchhiker's Guide to the Galaxy (2005), Jane Eyre (2011) and Harry Potter and the Goblet of Fire (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0254332","name":"Su Elliot","idIMDB":"nm0254332"},"actorId":"nm0254332","character":"Pub Customer","urlCharacter":"http://www.imdb.com/character/ch0455607","main":true},{"actorName":"Martin Freeman","urlProfile":"http://www.imdb.com/name/nm0293509","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjAwOTMzMF5BMl5BanBnXkFtZTcwMDg1MjEyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1971","placeOfBirth":" Aldershot, Hampshire, England, UK","birthName":"Martin John Christopher Freeman","height":"5' 6½\" (1.69 m)","bio":"Martin Freeman is an English actor, best known for portraying Bilbo Baggins in Peter Jackson's The Hobbit film trilogy, Tim Canterbury in the original UK version of sitcom mockumentary The Office (2001), Dr. John Watson in the British crime drama Sherlock (2010) and Lester Nygaard in the dark comedy-crime drama TV series Fargo (2014). His other notable film roles include the romantic comedy Love Actually (2003) and the comic science fiction film The Hitchhiker's Guide to the Galaxy (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjAwOTMzMF5BMl5BanBnXkFtZTcwMDg1MjEyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0293509","name":"Martin Freeman","idIMDB":"nm0293509"},"actorId":"nm0293509","character":"Arthur Dent","urlCharacter":"http://www.imdb.com/character/ch0007552","main":true},{"actorName":"Stephen Fry","urlProfile":"http://www.imdb.com/name/nm0000410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1957","placeOfBirth":" Hampstead, London, England, UK","birthName":"Stephen John Fry","height":"6' 4½\" (1.94 m)","bio":"Writer, actor, comedian, doer of good works, excellent good friend to the famous and not, Fry lives in his London SW1 flat and his Norfolk house when not traveling. Famous for his public declaration of celibacy in the \"Tatler\" back in the 1980s, Emma Thompson has characterised her friend as \"90 percent gay, 10 percent other.\" Stephen Fry was born in Hampstead, London, to Marianne Eve (Newman) and Alan Fry, a physicist and inventor. His maternal grandparents were Hungarian Jewish immigrants, while his father's family was of English background. He grew up in Norfolk and attended Uppingham School and Stout's Hill. After his notorious three months in Pucklechurch prison for credit card fraud, he attended Queens College, Cambridge in 1979, finishing with a 2:1 in English in 1981/2. While at Cambridge, he was a member of the Cherubs drinking club, and Footlights with Thompson, Tony Slattery, Martin Bergman, and Hugh Laurie (to whom he was introduced by E.T.). His prolific writing partnership with Laurie began in 1981 with resulting Footlights revues for (among others) Mayweek, Edinburgh Festival, and a three month tour of Australia. In 1984, Fry was engaged to do the rewrite of the Noel Gay musical \"Me and My Girl,\" which made him a millionaire before the age of 30. It also earned him a nomination for a Tony award in 1987. (Sidenote: It was upon SF's suggestion that Emma Thompson landed a leading role in the London cast of this show.) Throughout the 1980s, Fry did a huge amount of television and radio work, as well as writing for newspapers (e.g. a weekly column in the \"Daily Telegraph\") and magazines (e.g. articles for \"Arena\"). He is probably best known for his television roles in Black-Adder II (1986) and Jeeves and Wooster (1990). His support of the Terence Higgins Trust through events such as the first \"Hysteria\" benefit, as well as numerous other charity efforts, are probably those works of which he is most proud. Fry's acting career has not been limited to films and television. He had successful runs in Alan Bennett's \"Forty Years On,\" Simon Gray's \"The Common Pursuit\" with John Sessions, Rik Mayall, John Gordon Sinclair, and others. Michael Frayn's \"Look Look\" and Gray's \"Cell Mates\" were less successful for both Fry and their playwrights, the latter not helped by his walking out of the play after only a couple of weeks. Fry has published four novels as well as a collection of his radio and journalistic miscellanea. He has recorded audiotapes of his novels (an unabridged version of \"The Liar\" was released in 1995), as well as many other works for both adults and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000410","name":"Stephen Fry","idIMDB":"nm0000410"},"actorId":"nm0000410","character":"Narrator / The Guide","urlCharacter":"http://www.imdb.com/character/ch0007565","main":true},{"actorName":"Richard Griffiths","urlProfile":"http://www.imdb.com/name/nm0341743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDc2MjY4OF5BMl5BanBnXkFtZTcwODU5NjEzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1947","placeOfBirth":" Thornaby-on-Tees, North Yorkshire, England, UK","birthName":"Richard Thomas Griffiths","height":"5' 9\" (1.75 m)","bio":"British character actor Richard Griffiths came from radio and the classical stage where he built up an early reputation as a Shakespearean clown, with larger-than-life portrayals of Henry VIII, Falstaff in \"The Merry Wives of Windsor\" and Bottom in \"A Midsummer Night's Dream\" with the Royal Shakespeare Company just a few of his standout credits. The son of deaf parents, he learned sign language at an early age and, interestingly enough, developed a talent for dialects which allowed him to show off in a number of ethnic portrayals. In films from 1975 both here and abroad, his better roles have been in both contemporary and period pieces, such as Gorky Park (1983), Withnail & I (1987), King Ralph (1991), Guarding Tess (1994), Sleepy Hollow (1999) and recently the 'Harry Potter' series as Uncle Vernon Dursley. Typically cast as comic relief in serious fare, he is well known in England for a number of comedy series including Pie in the Sky (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDc2MjY4OF5BMl5BanBnXkFtZTcwODU5NjEzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341743","name":"Richard Griffiths","idIMDB":"nm0341743"},"actorId":"nm0341743","character":"Jeltz","urlCharacter":"http://www.imdb.com/character/ch0007556","main":true},{"actorName":"Dominique Jackson","urlProfile":"http://www.imdb.com/name/nm1165344","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzQyNTEwMV5BMl5BanBnXkFtZTgwODYwNzMzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1991","placeOfBirth":" Oldham, Lancashire, England, UK","birthName":"Dominique Hannah Jackson","height":"5' 4\" (1.63 m)","bio":"Dominique Jackson was born on December 3, 1991 in Oldham, Lancashire, England as Dominique Hannah Jackson. She is an actress, known for Hollyoaks (1995), The Hitchhiker's Guide to the Galaxy (2005) and Buried Treasure (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzQyNTEwMV5BMl5BanBnXkFtZTgwODYwNzMzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1165344","name":"Dominique Jackson","idIMDB":"nm1165344"},"actorId":"nm1165344","character":"Fook","urlCharacter":"http://www.imdb.com/character/ch0007562","main":true},{"actorName":"Simon Jones","urlProfile":"http://www.imdb.com/name/nm0429254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNTUwNjU2M15BMl5BanBnXkFtZTgwMDYxNjczOTE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1950","placeOfBirth":" Charlton Park, Wiltshire, England, UK","bio":"Simon Jones was born on July 27, 1950 in Charlton Park, Wiltshire, England. He is an actor, known for The Hitch Hikers Guide to the Galaxy (1981), Brideshead Revisited (1981) and The Hitchhiker's Guide to the Galaxy Radio Show Live (2016). He has been married to Nancy Lewis since December 3, 1983. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNTUwNjU2M15BMl5BanBnXkFtZTgwMDYxNjczOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0429254","name":"Simon Jones","idIMDB":"nm0429254"},"actorId":"nm0429254","character":"Ghostly Image","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Lennon","urlProfile":"http://www.imdb.com/name/nm0502073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTMyNjYwMV5BMl5BanBnXkFtZTcwNDI2MjkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1970","placeOfBirth":" Chicago, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Thomas Lennon was born on August 9, 1970 in Chicago, Illinois, USA. He is an actor and producer, known for Night at the Museum (2006), Night at the Museum: Battle of the Smithsonian (2009) and Memento (2000). He has been married to Jenny Robertson since April 27, 2002. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDNmZTc5NDAtZTZiNi00MWE1LWExYWItNjIxZGU0MzBkOGY4XkEyXkFqcGdeQXVyNDQwOTUzMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502073","name":"Thomas Lennon","idIMDB":"nm0502073"},"actorId":"nm0502073","character":"Eddie the Computer","urlCharacter":"http://www.imdb.com/character/ch0007555","main":true},{"actorName":"Mark Longhurst","urlProfile":"http://www.imdb.com/name/nm0519339","urlPhoto":"","biography":{"bio":"Mark Longhurst is an actor, known for V for Vendetta (2005), The Hitchhiker's Guide to the Galaxy (2005) and Sky News: Sunrise (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0519339","name":"Mark Longhurst","idIMDB":"nm0519339"},"actorId":"nm0519339","character":"Bulldozer Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Macdonald","urlProfile":"http://www.imdb.com/name/nm0531808","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc5NTU2MzY0Nl5BMl5BanBnXkFtZTcwMzU4MjA0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1976","placeOfBirth":" Glasgow, Scotland, UK","height":"5' 2½\" (1.59 m)","bio":"Scottish actress Kelly Macdonald was born and raised in Glasgow. Her parents divorced when she was young, and she was raised by her mother, a sales executive in the garment industry. She has one brother, David. As a hobby, she acted in an amateur theatrical club, which she enjoyed a great deal. Macdonald was working as a barmaid, when she saw a leaflet for an open casting call for a film. She went along and was cast as Diane in Trainspotting (1996). For this breakout role, she was nominated for a BAFTA Scotland Award and began a highly successful acting career. Other notable film projects include Stella Does Tricks (1996), Elizabeth (1998), Gosford Park (2001) and No Country for Old Men (2007). She won an Emmy for her role as Gina in The Girl in the Café (2005) and appeared as Helena Ravenclaw in the wildly popular Harry Potter and the Deathly Hallows: Part 2 (2011). In 2010, she won the role of Margaret Schroeder in Boardwalk Empire (2010). Macdonald is married to Travis bassist Dougie Payne, and they have a son, Freddie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc5NTU2MzY0Nl5BMl5BanBnXkFtZTcwMzU4MjA0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531808","name":"Kelly Macdonald","idIMDB":"nm0531808"},"actorId":"nm0531808","character":"Reporter","urlCharacter":"http://www.imdb.com/character/ch0413829","main":true},{"actorName":"John Malkovich","urlProfile":"http://www.imdb.com/name/nm0000518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDM5ODUwOF5BMl5BanBnXkFtZTYwMzEwOTI4._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1953","placeOfBirth":" Christopher, Illinois, USA","birthName":"John Gavin Malkovich","height":"6' (1.83 m)","bio":"John Gavin Malkovich was born in Christopher, Illinois, to Joe Anne (Choisser), who owned a local newspaper, and Daniel Leon Malkovich, a state conservation director. His paternal grandparents were Croatian. In 1976, Malkovich joined Chicago's Steppenwolf Theatre, newly founded by his friend Gary Sinise. After that, it would take seven years before Malkovich would show up in New York and win an Obie in Sam Shepard's play \"True West\". In 1984, Malkovich would appear with Dustin Hoffman in the Broadway revival of \"Death of a Salesman\", which would earn him an Emmy when it was made into a made-for-TV movie the next year. His big-screen debut would be as the blind lodger in Places in the Heart (1984), which earned him an Academy Award Nomination for best supporting actor. Other films would follow, including The Killing Fields (1984) and The Glass Menagerie (1987), but he would be well remembered as Vicomte de Valmont in Dangerous Liaisons (1988). Playing against Michelle Pfeiffer and Glenn Close in a costume picture helped raise his standing in the industry. He would be cast as the psychotic political assassin in Clint Eastwood's In the Line of Fire (1993), for which he would be nominated for both the Academy Award and the Golden Globe. In 1994, Malkovich would portray the sinister Kurtz in the made-for-TV movie Heart of Darkness (1993), taking the story to Africa as it was originally written. Malkovich has periodically returned to Chicago to both act and direct.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDM5ODUwOF5BMl5BanBnXkFtZTYwMzEwOTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000518","name":"John Malkovich","idIMDB":"nm0000518"},"actorId":"nm0000518","character":"Humma Kavula","urlCharacter":"http://www.imdb.com/character/ch0007551","main":true}],"seasons":[],"idIMDB":"tt0371724","urlIMDB":"http://www.imdb.com/title/tt0371724","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$21,103,203","country":"USA","day":"01","month":"05","year":"2005","remarks":"3,133 Screens"},{"money":"£3,298,262","country":"UK","day":"01","month":"05","year":"2005","remarks":"465 Screens"},{"money":"€108,385","country":"Netherlands","day":"07","month":"08","year":"2005","remarks":"39 Screens"}],"gross":[{"money":"$51,085,416","country":"USA","day":"21","month":"07","year":"2005","remarks":""},{"money":"$51,019,112","country":"USA","day":"17","month":"07","year":"2005","remarks":""},{"money":"$50,801,179","country":"USA","day":"10","month":"07","year":"2005","remarks":""},{"money":"$50,518,187","country":"USA","day":"03","month":"07","year":"2005","remarks":""},{"money":"$50,110,404","country":"USA","day":"26","month":"06","year":"2005","remarks":""},{"money":"$49,793,273","country":"USA","day":"19","month":"06","year":"2005","remarks":""},{"money":"$49,605,344","country":"USA","day":"12","month":"06","year":"2005","remarks":""},{"money":"$49,307,254","country":"USA","day":"05","month":"06","year":"2005","remarks":""},{"money":"$48,776,566","country":"USA","day":"29","month":"05","year":"2005","remarks":""},{"money":"$46,902,653","country":"USA","day":"22","month":"05","year":"2005","remarks":""},{"money":"$43,516,918","country":"USA","day":"15","month":"05","year":"2005","remarks":""},{"money":"$35,782,098","country":"USA","day":"08","month":"05","year":"2005","remarks":""},{"money":"$21,103,203","country":"USA","day":"01","month":"05","year":"2005","remarks":""},{"money":"£10,563,392","country":"UK","day":"12","month":"06","year":"2005","remarks":""},{"money":"£10,467,488","country":"UK","day":"05","month":"06","year":"2005","remarks":""},{"money":"£9,618,055","country":"UK","day":"22","month":"05","year":"2005","remarks":""},{"money":"£8,682,307","country":"UK","day":"15","month":"05","year":"2005","remarks":""},{"money":"£6,930,462","country":"UK","day":"08","month":"05","year":"2005","remarks":""},{"money":"£3,298,262","country":"UK","day":"01","month":"05","year":"2005","remarks":""},{"money":null,"country":null,"day":"30","month":"06","year":"2005","remarks":""},{"money":"€141,913","country":"Netherlands","day":"07","month":"08","year":"2005","remarks":""}],"weekendGross":[{"money":"$99,015","country":"USA","day":"17","month":"07","year":"2005","remarks":"200 Screens"},{"money":"$161,420","country":"USA","day":"10","month":"07","year":"2005","remarks":"265 Screens"},{"money":"$245,279","country":"USA","day":"03","month":"07","year":"2005","remarks":"284 Screens"},{"money":"$233,464","country":"USA","day":"26","month":"06","year":"2005","remarks":"166 Screens"},{"money":"$113,006","country":"USA","day":"19","month":"06","year":"2005","remarks":"145 Screens"},{"money":"$147,904","country":"USA","day":"12","month":"06","year":"2005","remarks":"151 Screens"},{"money":"$321,635","country":"USA","day":"05","month":"06","year":"2005","remarks":"301 Screens"},{"money":"$957,992","country":"USA","day":"29","month":"05","year":"2005","remarks":"801 Screens"},{"money":"$2,054,904","country":"USA","day":"22","month":"05","year":"2005","remarks":"2,211 Screens"},{"money":"$5,049,938","country":"USA","day":"15","month":"05","year":"2005","remarks":"2,770 Screens"},{"money":"$9,792,648","country":"USA","day":"08","month":"05","year":"2005","remarks":"3,133 Screens"},{"money":"$21,103,203","country":"USA","day":"01","month":"05","year":"2005","remarks":"3,133 Screens"},{"money":"£47,554","country":"UK","day":"12","month":"06","year":"2005","remarks":"121 Screens"},{"money":"£132,703","country":"UK","day":"05","month":"06","year":"2005","remarks":"222 Screens"},{"money":"£513,991","country":"UK","day":"22","month":"05","year":"2005","remarks":"437 Screens"},{"money":"£1,038,352","country":"UK","day":"15","month":"05","year":"2005","remarks":"451 Screens"},{"money":"£1,785,683","country":"UK","day":"08","month":"05","year":"2005","remarks":"462 Screens"},{"money":"£3,298,262","country":"UK","day":"01","month":"05","year":"2005","remarks":"465 Screens"},{"money":"€108,385","country":"Netherlands","day":"07","month":"08","year":"2005","remarks":"39 Screens"}],"admissions":[{"money":"43,816 (Czech","country":"Republic","day":"30","month":"06","year":"2005","remarks":""},{"money":"482,923","country":"France","day":"13","month":"09","year":"2005","remarks":""},{"money":"435,741","country":"France","day":"31","month":"08","year":"2005","remarks":""},{"money":"368,403","country":"France","day":"30","month":"08","year":"2005","remarks":""},{"money":"1,047,057","country":"Germany","day":"24","month":"07","year":"2005","remarks":""},{"money":"306,797","country":"Germany","day":"12","month":"06","year":"2005","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"04","year":"2004","remarks":null},{"money":null,"country":null,"day":"20","month":"08","year":"2004","remarks":null}],"copyrightHolder":"Touchstone Pictures"},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["Dolby Digital","SDDS","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor Creative Services, London, UK (digital intermediate)","Technicolor"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"6.8","metascore":"63","filmingLocations":[{"location":"Canary Islands, Spain"}],"rated":"PG","awards":[{"award":"Casting Society of America, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Feature Film Casting - Comedy","names":[{"name":"Marcia Ross","id":"nm0743638","role":null}]}]}]},{"award":"Empire Awards, UK 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Comedy","names":[]},{"category":"Best British Film","names":[]}]}]},{"award":"Golden Schmoes Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Sci-Fi Movie of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2005","titlesAwards":[{"titleAwardOutcome":"Won Golden Trailer","categories":[{"category":"Most Original","names":[{"name":"Creative Partnership","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Voice Over","names":[{"name":"Creative Partnership","id":null,"role":null}]}]}]},{"award":"Online Film & Television Association 2006","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Music, Original Song","names":[{"name":"Joby Talbot","id":"nm0847926","role":"music, lyrics, and performed by"},{"name":"Christopher Austin","id":"nm1317290","role":"music and lyrics by"},{"name":"Garth Jennings","id":"nm1134029","role":"lyrics by"}]}]}]},{"award":"Teen Choice Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Action Adventure","names":[]},{"category":"Choice Rap Artist in a Movie","names":[{"name":"Yasiin Bey","id":"nm0080049","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Song or Song Performance in a Film or End Credits","names":[{"name":"Neil Hannon","id":"nm0973252","role":null}]}]}]}],"votes":"161,394","type":"Movie","companyCreditsSimple":[{"idCompany":"co0049348","name":"Touchstone Pictures"},{"idCompany":"co0031181","name":"Spyglass Entertainment"},{"idCompany":"co0136709","name":"Everyman Pictures"}],"keywords":{"keywords":["galaxy","friend","spaceship","alien","hyperspace","everyman","planet","meaning of life","fish","brain","robot","reading","book","hitchhiker","love","president","party","poetry","demolition","android","human in outer space","manic pixie dream girl","phone video","based on cult tv series","vomiting","talking robot","universal translator","washroom","peanuts","vacuum","univac","rabbit","bird","leech","butt slap","aerosol deodorant","election","nose","cow","headache","penal code","sussex england","fake documentary","water show","thermonuclear power","islington england","highway construction","bulldozer","microphone","head in a paper bag","third arm","two headed person","hostage","beheading","laser","giant","beast","monster","stop motion animation","animated sequence","voice over narration","paranoia","saving a life","reference to charles darwin","floating head","spider","shower","kidnapping","computer","pajamas","underwear","planet earth","satire","norway","ice","snow","wind","northern territory australia","pursuit","chase","survival","outer space","explosion","love triangle","kiss","flashback","drink","drinking","prologue","handshake","tackled to the ground","flatulence","intergalactic travel","ring","kidnapping the president","missile","madagascar","evolution","minister","priest","hymn","church","prison cell","prisoner","highway","yawning","reference to dr. livingstone","pith helmet","record player","recording","ray gun","flower","eating","food","gun","guide book","reference to god","asia minor","tv show","tv reporter","physics","actor","girl","beer","answering machine","cell phone","telephone","costume","costume party","surprise party","forklift","petunia","matrix","destroying a house","demolishing a house","based on radio series","face slap","destruction of planet","scene during end credits","destruction of earth","forced perspective","bureaucrat","bureaucracy","bathrobe","poet","uluru northern territory australia","sofa","pub","portal","himalayas","escape pod","crash landing","crab","caravan","whale","mouse","dolphin","alien invasion","exploding planet","spacecraft","friendship","diner","based on radio show","space travel","end of the world","towel","hitchhiking","based on novel","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:04:17"}}