{"data":{"movies":[{"title":"50 First Dates","originalTitle":"","year":"2004","releaseDate":"20040213","directors":[{"name":"Peter Segal","id":"nm0781842"}],"writers":[{"name":"George Wing","id":"nm1286500"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzc4MDgxNF5BMl5BanBnXkFtZTYwNjUwMzE3._V1.jpg","countries":["USA"],"languages":["English","Hawaiian","Mandarin","Turkish"],"genres":["Comedy","Romance"],"plot":"Henry Roth lives in a Hawaiian paradise with the company of endless women with no strings attached. This is until he meets Lucy Whitmore. Both Henry and Lucy enjoy the company of each other and feel the start of a serious relationship occurring. Approaching Lucy the next day, Henry is confused when Lucy fails to recognize him. This is the moment Henry discovers that Lucy actually suffers from short term memory loss and can't remember each individual day. Henry won't let this stop him and is prepared to make her fall in love with him all over again, each and every day.","simplePlot":"Henry Roth is a man afraid of commitment up until he meets the beautiful Lucy. They hit it off and Henry think he's finally found the girl of his dreams, until he discovers she has short-term memory loss and forgets him the very next day.","actors":[{"actorName":"Adam Sandler","urlProfile":"http://www.imdb.com/name/nm0001191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1966","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Adam Richard Sandler","height":"5' 9½\" (1.77 m)","bio":"Adam Richard Sandler was born September 9, 1966 in Brooklyn, New York, to Judith (Levine), a teacher at a nursery school, and Stanley Alan Sandler, an electrical engineer. He is of Russian Jewish descent. At 17, he took his first step towards becoming a stand-up comedian when he spontaneously took the stage at a Boston comedy club. He found he was a natural comic. He nurtured his talent while at New York University (graduating with a Bachelor of Fine Arts degree in 1991) by performing regularly in clubs and at universities. During his freshman year, he snagged a recurring role as the Huxtable family's friend Smitty on The Cosby Show (1984). While working at a comedy club in L.A., he was \"discovered\" by Dennis Miller, who recommended him to Saturday Night Live (1975) producer Lorne Michaels and told him that Sandler had a big talent. This led to his being cast in the show in 1990, which he also wrote for in addition to performing. After Saturday Night Live (1975), Sandler went on to the movies, starring in such hit comedies as Airheads (1994), Happy Gilmore (1996), Billy Madison (1995) and Big Daddy (1999). He has also starred in Mr. Deeds (2002) alongside Winona Ryder; Eight Crazy Nights (2002), an animated movie about the Jewish festival of Chanukah; and Punch-Drunk Love (2002). He also writes and produces many of his own films and has composed songs for several of them, including The Wedding Singer (1998). Sandler has had several of his songs placed on the \"Billboard\" charts, including the classic \"The Chanukah Song\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001191","name":"Adam Sandler","nicknames":["Sandman"],"idIMDB":"nm0001191"},"actorId":"nm0001191","character":"Henry Roth","urlCharacter":"http://www.imdb.com/character/ch0008979","main":true},{"actorName":"Drew Barrymore","urlProfile":"http://www.imdb.com/name/nm0000106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTMzODIxM15BMl5BanBnXkFtZTcwODM2NTY5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1975","placeOfBirth":" Culver City, California, USA","birthName":"Drew Blyth Barrymore","height":"5' 4\" (1.63 m)","bio":"Since melting audiences' hearts - at the age of six - in Steven Spielberg's beloved sci-fi blockbuster, E.T. the Extra-Terrestrial (1982), Drew Barrymore has emerged as one of the most endearing and talented actresses of her generation. Drew Blyth Barrymore was born in Culver City, California, to actors John Drew Barrymore and Jaid Barrymore (née Ildiko Jaid Mako). Her father came from a long showbusiness legacy, as the son of actors John Barrymore and Dolores Costello, while her mother was the daughter of Hungarian refugees. Despite a troubled and much-publicized adolescence, and a string of \"bad girl\" parts in lurid crime dramas such as Poison Ivy (1992), Barrymore's star was officially on the rise during the mid-1990s, with notable appearances in Boys on the Side (1995), Woody Allen's Everyone Says I Love You (1996), and the game-changing horror hit Scream (1996). An eclectic mix of high-profile and low-key film projects followed - such as The Wedding Singer (1998), Ever After: A Cinderella Story (1998), Never Been Kissed (1999), Charlie's Angels (2000), Donnie Darko (2001), Riding in Cars with Boys (2001) and Confessions of a Dangerous Mind (2002) - proving to once-cynical audiences that Barrymore was not only a capable leading lady, but also a gifted and versatile actor. Next came headlining parts in Duplex (2003), 50 First Dates (2004), Fever Pitch (2005), Music and Lyrics (2007), Lucky You (2007), He's Just Not That Into You (2009), and the much-lauded Grey Gardens (2009), for which she earned Golden Globe and Screen Actors Guild awards for her portrayal of Edith Bouvier Beale. In 2009, Barrymore - whose production company, Flower Films, has spawned several lucrative features - made her long-awaited directional debut with the comedy-drama Whip It (2009), emerging as \"a sensitive director who knows how and when to let an emotional moment linger on the screen\" (TIME). Alongside a recurring guest spot - as the voice of Jillian - on the cult animated series Family Guy (1999), recent acting roles have included Everybody's Fine (2009), Going the Distance (2010), Big Miracle (2012), Blended (2014), and Miss You Already (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTMzODIxM15BMl5BanBnXkFtZTcwODM2NTY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000106","name":"Drew Barrymore","nicknames":["D"],"idIMDB":"nm0000106"},"actorId":"nm0000106","character":"Lucy Whitmore","urlCharacter":"http://www.imdb.com/character/ch0008980","main":true},{"actorName":"Rob Schneider","urlProfile":"http://www.imdb.com/name/nm0001705","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDE4MTE0MF5BMl5BanBnXkFtZTcwOTYyOTM3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1963","placeOfBirth":" San Francisco, California, USA","birthName":"Robert Michael Schneider","height":"5' 7\" (1.7 m)","bio":"Robert Michael \"Rob\" Schneider (born October 31, 1963) is an American actor, comedian, screenwriter, and director. A stand-up comic and veteran of the NBC sketch comedy series Saturday Night Live (1975), Schneider has gone on to a successful career in feature films, including starring roles in the comedy films Deuce Bigalow: Male Gigolo (1999), The Hot Chick (2002), and Grown Ups (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDE4MTE0MF5BMl5BanBnXkFtZTcwOTYyOTM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001705","name":"Rob Schneider","idIMDB":"nm0001705"},"actorId":"nm0001705","character":"Ula","urlCharacter":"http://www.imdb.com/character/ch0008982","main":true},{"actorName":"Sean Astin","urlProfile":"http://www.imdb.com/name/nm0000276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjczOTQ1NF5BMl5BanBnXkFtZTcwMzI2NzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1971","placeOfBirth":" Santa Monica, California, USA","birthName":"Sean Patrick Duke","height":"5' 7\" (1.7 m)","bio":"Sean Astin is well known for his film debut portraying Mikey in Steven Spielberg's The Goonies (1985), for playing the title role in the critically acclaimed Rudy (1993), and for his role as the beloved Sam Gamgee in the Academy Award winning trilogy, The Lord of the Rings: The Fellowship of the Ring (2001), The Lord of the Rings: The Two Towers (2002), and The Lord of the Rings: The Return of the King (2003). Astin was born Sean Patrick Duke on February 25, 1971 in Santa Monica, California. His mother was actress Patty Duke. At the time of his birth, his biological father was believed to be entertainer Desi Arnaz Jr., but Astin discovered through a DNA test in the 1990s that his biological father is music promoter Michael Tell, who was married to Patty Duke in 1970. Sean was raised by his stepfather, actor John Astin, who married Patty Duke in 1972 and whose surname Sean took. Sean's mother was of Irish and more distant German ancestry, and Sean's biological father is of Austrian Jewish and Polish Jewish descent. At age nine, Sean starred with his mother in the after-school special Please Don't Hit Me, Mom (1981). Followed by Sean's feature debut The Goonies (1985) and since then, he has had a steady stream of roles. Starring in Toy Soldiers (1991), Where the Day Takes You (1991), Rudy (1993) and Harrison Bergeron (1995). He directed and co-produced the short film Kangaroo Court (1994), which was nominated in the best short film category at The 67th Annual Academy Awards (1995). Sean's adoptive father John Astin was nominated for the same award in 1969. Politically, Sean has been very active having served in two non-partisan Presidential appointments. Sean also hosts a live weekly 2 hour in-studio bi-partisan political radio talk show, 'Vox Populi Radio' which was made possible by a successful crowdfunding campaign in 2013. In 2004, Sean broke into the publishing world and authored the NY Times Best Selling release of There and Back Again a memoir of his film career (co-written with Joe Layden). Sean attended Crossroads High School for the Arts and studied with the famous Stella Adler. He graduated with honors from UCLA; B.A. in History & B.A. in English American Literature and Culture. Sean is married to Christine Astin, his co-producer on Kangaroo Court (1994). The couple lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjczOTQ1NF5BMl5BanBnXkFtZTcwMzI2NzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000276","name":"Sean Astin","idIMDB":"nm0000276"},"actorId":"nm0000276","character":"Doug Whitmore","urlCharacter":"http://www.imdb.com/character/ch0008981","main":true},{"actorName":"Lusia Strus","urlProfile":"http://www.imdb.com/name/nm0835363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzY2ODkyOV5BMl5BanBnXkFtZTgwNTY5MjM4MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Lusia Strus was born in Chicago, Illinois, USA. She is an actress, known for Good Behavior (2016), Wayward Pines (2015) and 50 First Dates (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzY2ODkyOV5BMl5BanBnXkFtZTgwNTY5MjM4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835363","name":"Lusia Strus","idIMDB":"nm0835363"},"actorId":"nm0835363","character":"Alexa","urlCharacter":"http://www.imdb.com/character/ch0008985","main":true},{"actorName":"Dan Aykroyd","urlProfile":"http://www.imdb.com/name/nm0000101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDA3NTg0NF5BMl5BanBnXkFtZTYwMzM5ODgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1952","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Daniel Edward Aykroyd","height":"6' 1\" (1.85 m)","bio":"Daniel Edward Aykroyd was born on July 1, 1952 in Ottawa, Ontario, Canada, to Lorraine Hélène (Gougeon), a secretary from a French-Canadian family, and Samuel Cuthbert Peter Hugh Aykroyd, a civil engineer who advised prime minister Pierre Trudeau. Aykroyd attended Carleton University in 1969, where he majored in Criminology and Sociology, but he dropped out before completing his degree. He worked as a comedian in various Canadian nightclubs and managed an after-hours speakeasy, Club 505, in Toronto for several years. He worked with Second City Stage Troupe in Toronto and started his acting career at Carleton University with Sock'n'Buskin, the campus theater/drama club. Married to Donna Dixon since 1983, he has two daughters. His parents are named Peter and Lorraine and his brother Peter Aykroyd is a psychic researcher. Dan received an honorary Doctorate from Carleton University in 1994 and was made a Member of the Order of Canada in 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDA3NTg0NF5BMl5BanBnXkFtZTYwMzM5ODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000101","name":"Dan Aykroyd","nicknames":["Danny"],"idIMDB":"nm0000101"},"actorId":"nm0000101","character":"Dr. Keats","urlCharacter":"http://www.imdb.com/character/ch0008983","main":true},{"actorName":"Amy Hill","urlProfile":"http://www.imdb.com/name/nm0384032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTc2OTA0OF5BMl5BanBnXkFtZTgwOTcyNDI5NDE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1953","placeOfBirth":" Deadwood, South Dakota, USA","bio":"Amy Hill was born on May 9, 1953 in Deadwood, South Dakota, USA. She is an actress and writer, known for 50 First Dates (2004), Lilo & Stitch (2002) and The Cat in the Hat (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTc2OTA0OF5BMl5BanBnXkFtZTgwOTcyNDI5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384032","name":"Amy Hill","idIMDB":"nm0384032"},"actorId":"nm0384032","character":"Sue","urlCharacter":"http://www.imdb.com/character/ch0057645","main":true},{"actorName":"Allen Covert","urlProfile":"http://www.imdb.com/name/nm0184445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjI1ODE1Ml5BMl5BanBnXkFtZTYwODg1Mjkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1964","placeOfBirth":" Palm Beach County, Florida, USA","birthName":"Allen Stephen Covert","height":"5' 9\" (1.75 m)","bio":"Allen Covert was born on October 13, 1964 in Palm Beach County, Florida, USA as Allen Stephen Covert. He is an actor and producer, known for Grandma's Boy (2006), Big Daddy (1999) and Anger Management (2003). He is married to Kathryn Covert. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MjI1ODE1Ml5BMl5BanBnXkFtZTYwODg1Mjkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0184445","name":"Allen Covert","idIMDB":"nm0184445"},"actorId":"nm0184445","character":"Ten Second Tom","urlCharacter":"http://www.imdb.com/character/ch0008984","main":true},{"actorName":"Blake Clark","urlProfile":"http://www.imdb.com/name/nm0163703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2NTc4NDcyOF5BMl5BanBnXkFtZTcwMDc2MjcyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1946","placeOfBirth":" Macon, Georgia, USA","bio":"For the last 20 or so years, Clark has been doing stand-up comedy on the club circuit, on \"The Tonight Show\", on HBO comedy specials, on Late Night with David Letterman (1982) and Late Night with Conan O'Brien (1993). In addition, he has been in over 50 feature motion pictures and hundreds of episodic TV shows. A decorated Infantry Platoon Leader in Vietnam, Clark brought the plight of the Vietnam Veteran to the people of America in a humorous way in the 80s and was \"adopted\" by numerous Veteran Organizations throughout the United States. Having moved from his home state of Georgia to Hollywood, Clark soon landed his first The Tonight Show Starring Johnny Carson (1962) and soon, thereafter, was cast in his first of many recurring roles on television as \"Fred the Chauffeur\" on Remington Steele (1982). Since then, he has been \"Harry\" on Home Improvement (1991), \"Jules Lambermont\" on The Drew Carey Show (1995), \"Chet Hunter\" on Boy Meets World (1993) and \"Bob Nelson\" on The Jamie Foxx Show (1996). But Clark is perhaps best known as \"Farmer Fran\" in The Waterboy (1998). And he recently received critical acclaim as \"Marlin Whitmore\" in 50 First Dates (2004). He has traveled the world doing comedy and recently went to Iraq for an extended USO Tour with Drew Carey. Clark is a warm, smart, funny and innovative social commentator and a man of all seasons with a quiet patriotism that he lives as well as portrays. His comedy runs the gamut from observation on the current military conflict to his Southern root in Georgia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2NTc4NDcyOF5BMl5BanBnXkFtZTcwMDc2MjcyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163703","name":"Blake Clark","idIMDB":"nm0163703"},"actorId":"nm0163703","character":"Marlin Whitmore","urlCharacter":"http://www.imdb.com/character/ch0008986","main":true},{"actorName":"Maya Rudolph","urlProfile":"http://www.imdb.com/name/nm0748973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzOTQwMzAyOF5BMl5BanBnXkFtZTYwNzA1OTc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1972","placeOfBirth":" Gainesville, Florida, USA","birthName":"Maya Khabira Rudolph","height":"5' 7\" (1.7 m)","bio":"Maya Rudolph was born in Gainesville, Florida, on July 27th, 1972, to Dick Rudolph, a music producer, and soul singer Minnie Riperton. Her mother was African-American and her father is Ashkenazi Jewish (from a family from Lithuania, Russia, Germany, and Hungary). In 1973, Maya, her parents, and her older brother, Marc Rudolph, moved to California to further Minnie's music career. Here Minnie recorded \"Lovin' You\", her most famous single, in which one can hear her sing \"Maya, Maya, Maya\" at the end of the song; Riperton claimed that this song was used as a lullaby for Maya. During adolescence, Maya attended St. Augustine by the Sea School, where she met childhood friend, Gwyneth Paltrow. The Paltrows and the Rudolphs became family friends and, in 2000, Dick Rudolph and Maya filled the role of music supervisors on the Bruce Paltrow-directed film Duets (2000), which starred Gwyneth. In 1990, Maya enrolled at the University of California at Santa Cruz, majoring in photography. It was here that Maya formed the band \"Supersauce\" with fellow students. After graduation in 1994, Maya left the band and soon joined The Rentals, fronted by Weezer bassist Matt Sharp. Maya was featured on the 1999 release \"Seven More Minutes\", where she sang backup vocals on \"Barcelona\" and \"My Head is in the Sun\". Maya began touring with the group, singing backup and playing Moog synthesizer. When The Rentals disbanded, Maya decided to pursue her dream of a career in comedy, joining the famed troupe \"The Groundlings\". On May 6, 2000, Maya joined the cast of Saturday Night Live (1975). and has since become one of that show's most popular performers. Favorite sketches include a dead-on impression of fashion diva Donatella Versace; high school flake \"Megan\", the host of her own morning talk show, \"Wake-up WakeField\"; and one of the members of the R&B parody \"Gemini's Twin\". In 2005, Maya gave birth to her first child with director Paul Thomas Anderson; in 2006, she was cast in the film, A Prairie Home Companion (2006), directed by the legendary Robert Altman and based on the NPR show by Garrison Keillor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzOTQwMzAyOF5BMl5BanBnXkFtZTYwNzA1OTc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0748973","name":"Maya Rudolph","idIMDB":"nm0748973"},"actorId":"nm0748973","character":"Stacy","urlCharacter":"http://www.imdb.com/character/ch0057646","main":true},{"actorName":"Pomaika'i Brown","urlProfile":"http://www.imdb.com/name/nm1366553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjcwMzU2NV5BMl5BanBnXkFtZTYwMzUzMDcy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1961","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Nephi Pomaika'i Brown","height":"5' 11½\" (1.82 m)","bio":"Pomai Brown, was born in Honolulu, Hawaii on January 5, 1961 to Wilfred Ku'ualoha Brown and Amy Kaelehiwa Keko'olani. Being of Hawaiian decent (Keko'olani of Waipi'o), he attended and graduated from The Kamehameha Schools at Kapalama. He began his musical career playing the ukulele with Ka Hale Hula O Keko'olani at the age of 12 and continued on with Band, Orchestra and Concert Glee at Kamehameha. In 1994 he studied the Hawaiian Steel Guitar with world renown steel guitarist Jerry Byrd, and upon graduation, traveled with Jerry to Japan for a concert performance. A graduate of Hawaii Pacific College (Magna Cum Laude), Pomai has used his business degree in entrepreneurial studies to help promote and advance his career in the entertainment industry. He has studied the \"energy\" of acting from Cary-Hiroyuki Tagawa, method acting from Scott Rogers, and Improvisation from Roger Wilko. His first acting role as Nick, the chef in 50 First Dates (2004) was made possible by comedian Adam Sandler and Director Peter Segal. Casting Director Roger Mussenden saw Pomai playing the ukulele on the TV series The Mole: Episode #3.1 (2003) and invited him to submit an audition tape. Pomai and his wife Toni, currently head their own production company, Hollywood Brown Entertainment. They produce Island contemporary music, T.V. productions and live Polynesian show productions for select clientèle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjcwMzU2NV5BMl5BanBnXkFtZTYwMzUzMDcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1366553","name":"Pomaika'i Brown","nicknames":["Pomai"],"idIMDB":"nm1366553"},"actorId":"nm1366553","character":"Nick","urlCharacter":"http://www.imdb.com/character/ch0008987","main":true},{"actorName":"Joe Nakashima","urlProfile":"http://www.imdb.com/name/nm1367628","urlPhoto":"","biography":{"bio":"Joe Nakashima was an actor, known for 50 First Dates (2004). He died on May 23, 2013 in Gardena, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1367628","name":"Joe Nakashima","idIMDB":"nm1367628"},"actorId":"nm1367628","character":"Old Hawaiian Man","urlCharacter":"http://www.imdb.com/character/ch0351846","main":true},{"actorName":"Peter Dante","urlProfile":"http://www.imdb.com/name/nm0200601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MjY0NTUyNV5BMl5BanBnXkFtZTcwMTc3MzQ1MQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1968","placeOfBirth":" West Hartford, Connecticut, USA","birthName":"Peter Francis Dante","height":"6' 2\" (1.88 m)","bio":"Peter Dante was born on December 16, 1968 in West Hartford, Connecticut, USA as Peter Francis Dante. He is known for his work on 50 First Dates (2004), Grandma's Boy (2006) and Mr. Deeds (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MjY0NTUyNV5BMl5BanBnXkFtZTcwMTc3MzQ1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0200601","name":"Peter Dante","idIMDB":"nm0200601"},"actorId":"nm0200601","character":"Security Guard","urlCharacter":"http://www.imdb.com/character/ch0351847","main":true},{"actorName":"Dom Magwili","urlProfile":"http://www.imdb.com/name/nm0536657","urlPhoto":"","biography":{"dateOfBirth":"8 December 1949","placeOfBirth":" Alameda, California, USA","birthName":"Domingo Albert Magwili","bio":"Dom Magwili was born on December 8, 1949 in Alameda, California, USA as Domingo Albert Magwili. He is an actor and director, known for 50 First Dates (2004), Future War (1997) and Drive (1997). He is married to Saachiko.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0536657","name":"Dom Magwili","idIMDB":"nm0536657"},"actorId":"nm0536657","character":"Security Guard","urlCharacter":"http://www.imdb.com/character/ch0351847","main":true},{"actorName":"Jonathan Loughran","urlProfile":"http://www.imdb.com/name/nm0521781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODEyMzg5N15BMl5BanBnXkFtZTcwMjUwNjE2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1966","placeOfBirth":" USA","height":"6' 4\" (1.93 m)","bio":"Jonathan Loughran was born in 1966 in the USA. He is known for his work on Kill Bill: Vol. 2 (2004), Kill Bill: Vol. 1 (2003) and 50 First Dates (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODEyMzg5N15BMl5BanBnXkFtZTcwMjUwNjE2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0521781","name":"Jonathan Loughran","idIMDB":"nm0521781"},"actorId":"nm0521781","character":"Jennifer","urlCharacter":"http://www.imdb.com/character/ch0057648","main":true}],"seasons":[],"idIMDB":"tt0343660","urlIMDB":"http://www.imdb.com/title/tt0343660","business":{"budget":{"money":"$75,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$45,107,871","country":"USA","day":"16","month":"02","year":"2004","remarks":"3,591 Screens"},{"money":"£1,651,544","country":"UK","day":"11","month":"04","year":"2004","remarks":"395 Screens"},{"money":"€306,306","country":"Italy","day":"20","month":"06","year":"2004","remarks":"131 Screens"},{"money":"€150,812","country":"Netherlands","day":"13","month":"06","year":"2004","remarks":"31 Screens"}],"gross":[{"money":"$120,776,832","country":"USA","day":"20","month":"06","year":"2004","remarks":""},{"money":"$120,616,191","country":"USA","day":"13","month":"06","year":"2004","remarks":""},{"money":"$120,398,106","country":"USA","day":"06","month":"06","year":"2004","remarks":""},{"money":"$120,196,997","country":"USA","day":"30","month":"05","year":"2004","remarks":""},{"money":"$119,861,977","country":"USA","day":"23","month":"05","year":"2004","remarks":""},{"money":"$119,614,568","country":"USA","day":"16","month":"05","year":"2004","remarks":""},{"money":"$119,543,649","country":"USA","day":"09","month":"05","year":"2004","remarks":""},{"money":"$119,447,383","country":"USA","day":"02","month":"05","year":"2004","remarks":""},{"money":"$119,284,583","country":"USA","day":"25","month":"04","year":"2004","remarks":""},{"money":"$119,067,647","country":"USA","day":"18","month":"04","year":"2004","remarks":""},{"money":"$118,804,464","country":"USA","day":"11","month":"04","year":"2004","remarks":""},{"money":"$118,206,131","country":"USA","day":"04","month":"04","year":"2004","remarks":""},{"money":"$116,748,548","country":"USA","day":"28","month":"03","year":"2004","remarks":""},{"money":"$113,080,464","country":"USA","day":"21","month":"03","year":"2004","remarks":""},{"money":"$106,701,379","country":"USA","day":"14","month":"03","year":"2004","remarks":""},{"money":"$99,348,370","country":"USA","day":"07","month":"03","year":"2004","remarks":""},{"money":"$88,683,963","country":"USA","day":"29","month":"02","year":"2004","remarks":""},{"money":"$71,738,493","country":"USA","day":"22","month":"02","year":"2004","remarks":""},{"money":"$45,107,871","country":"USA","day":"16","month":"02","year":"2004","remarks":""},{"money":"£7,708,648","country":"UK","day":"30","month":"05","year":"2004","remarks":""},{"money":"£7,606,144","country":"UK","day":"23","month":"05","year":"2004","remarks":""},{"money":"£7,400,281","country":"UK","day":"16","month":"05","year":"2004","remarks":""},{"money":"£7,138,299","country":"UK","day":"09","month":"05","year":"2004","remarks":""},{"money":"£6,408,332","country":"UK","day":"02","month":"05","year":"2004","remarks":""},{"money":"£5,513,738","country":"UK","day":"25","month":"04","year":"2004","remarks":""},{"money":"£4,356,363","country":"UK","day":"18","month":"04","year":"2004","remarks":""},{"money":"£1,651,544","country":"UK","day":"11","month":"04","year":"2004","remarks":""},{"money":"$75,577,026 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"€1,273,629","country":"Italy","day":"25","month":"07","year":"2004","remarks":""},{"money":"€1,198,754","country":"Italy","day":"18","month":"07","year":"2004","remarks":""},{"money":"€1,088,108","country":"Italy","day":"11","month":"07","year":"2004","remarks":""},{"money":"€896,633","country":"Italy","day":"04","month":"07","year":"2004","remarks":""},{"money":"€306,306","country":"Italy","day":"20","month":"06","year":"2004","remarks":""},{"money":"€151,424","country":"Netherlands","day":"13","month":"06","year":"2004","remarks":""}],"weekendGross":[{"money":"$80,436","country":"USA","day":"20","month":"06","year":"2004","remarks":"127 Screens"},{"money":"$127,642","country":"USA","day":"13","month":"06","year":"2004","remarks":"151 Screens"},{"money":"$131,970","country":"USA","day":"06","month":"06","year":"2004","remarks":"176 Screens"},{"money":"$228,450","country":"USA","day":"30","month":"05","year":"2004","remarks":"222 Screens"},{"money":"$231,731","country":"USA","day":"23","month":"05","year":"2004","remarks":"237 Screens"},{"money":"$53,337","country":"USA","day":"16","month":"05","year":"2004","remarks":"67 Screens"},{"money":"$72,603","country":"USA","day":"09","month":"05","year":"2004","remarks":"95 Screens"},{"money":"$125,143","country":"USA","day":"02","month":"05","year":"2004","remarks":"110 Screens"},{"money":"$167,554","country":"USA","day":"25","month":"04","year":"2004","remarks":"163 Screens"},{"money":"$155,848","country":"USA","day":"18","month":"04","year":"2004","remarks":"166 Screens"},{"money":"$272,952","country":"USA","day":"11","month":"04","year":"2004","remarks":"235 Screens"},{"money":"$772,113","country":"USA","day":"04","month":"04","year":"2004","remarks":"781 Screens"},{"money":"$2,385,220","country":"USA","day":"28","month":"03","year":"2004","remarks":"1,759 Screens"},{"money":"$4,186,739","country":"USA","day":"21","month":"03","year":"2004","remarks":"2,153 Screens"},{"money":"$5,425,736","country":"USA","day":"14","month":"03","year":"2004","remarks":"2,586 Screens"},{"money":"$7,637,128","country":"USA","day":"07","month":"03","year":"2004","remarks":"3,040 Screens"},{"money":"$12,565,729","country":"USA","day":"29","month":"02","year":"2004","remarks":"3,450 Screens"},{"money":"$20,427,325","country":"USA","day":"22","month":"02","year":"2004","remarks":"3,612 Screens"},{"money":"$45,107,871","country":"USA","day":"16","month":"02","year":"2004","remarks":"3,591 Screens"},{"money":"£56,580","country":"UK","day":"30","month":"05","year":"2004","remarks":"114 Screens"},{"money":"£118,067","country":"UK","day":"23","month":"05","year":"2004","remarks":"202 Screens"},{"money":"£140,254","country":"UK","day":"16","month":"05","year":"2004","remarks":"273 Screens"},{"money":"£323,917","country":"UK","day":"09","month":"05","year":"2004","remarks":"309 Screens"},{"money":"£590,730","country":"UK","day":"02","month":"05","year":"2004","remarks":"385 Screens"},{"money":"£648,692","country":"UK","day":"25","month":"04","year":"2004","remarks":"399 Screens"},{"money":"£1,196,553","country":"UK","day":"18","month":"04","year":"2004","remarks":"395 Screens"},{"money":"£1,651,544","country":"UK","day":"11","month":"04","year":"2004","remarks":"395 Screens"},{"money":"€42,103","country":"Italy","day":"25","month":"07","year":"2004","remarks":"46 Screens"},{"money":"€49,729","country":"Italy","day":"18","month":"07","year":"2004","remarks":"81 Screens"},{"money":"€91,413","country":"Italy","day":"11","month":"07","year":"2004","remarks":"107 Screens"},{"money":"€150,812","country":"Netherlands","day":"13","month":"06","year":"2004","remarks":"31 Screens"}],"admissions":[{"money":"1,314,783","country":"Germany","day":"06","month":"06","year":"2004","remarks":""},{"money":"335,621","country":"Germany","day":"25","month":"04","year":"2004","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"03","year":"2003","remarks":null},null],"copyrightHolder":"Columbia Pictures Industries, Inc."},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision2 500T 5218)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"6,8","metascore":"48","filmingLocations":[{"location":"Blackstone Bay, Alaska, USA"}],"rated":"PG-13","awards":[{"award":"BMI Film & TV Awards 2004","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Teddy Castellucci","id":"nm0144841","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2005","titlesAwards":[{"titleAwardOutcome":"Won Blimp Award","categories":[{"category":"Favorite Movie Actor","names":[{"name":"Adam Sandler","id":"nm0001191","role":null}]}]},{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie Actress","names":[{"name":"Drew Barrymore","id":"nm0000106","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing in a Feature - Music - Feature Film","names":[{"name":"J.J. George","id":"nm0313454","role":"music editor"},{"name":"Stuart Grusin","id":"nm0344704","role":"music editor"}]}]}]},{"award":"MTV Movie Awards 2004","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Best On-Screen Team","names":[{"name":"Adam Sandler","id":"nm0001191","role":null},{"name":"Drew Barrymore","id":"nm0000106","role":null}]}]},{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Movie","names":[]},{"category":"Best Male Performance","names":[{"name":"Adam Sandler","id":"nm0001191","role":null}]},{"category":"Best Female Performance","names":[{"name":"Drew Barrymore","id":"nm0000106","role":null}]}]}]},{"award":"People's Choice Awards, USA 2005","titlesAwards":[{"titleAwardOutcome":"Won People's Choice Award","categories":[{"category":"Favorite On-Screen Chemistry","names":[{"name":"Drew Barrymore","id":"nm0000106","role":null},{"name":"Adam Sandler","id":"nm0001191","role":null}]}]}]},{"award":"Teen Choice Awards 2004","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Choice Movie - Date Movie","names":[]},{"category":"Choice Movie Actor - Comedy","names":[{"name":"Adam Sandler","id":"nm0001191","role":null}]}]},{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie - Comedy","names":[]},{"category":"Choice Movie Actress - Comedy","names":[{"name":"Drew Barrymore","id":"nm0000106","role":null}]},{"category":"Choice Movie Liplock","names":[{"name":"Drew Barrymore","id":"nm0000106","role":null},{"name":"Adam Sandler","id":"nm0001191","role":null}]},{"category":"Choice Movie Chemistry","names":[{"name":"Drew Barrymore","id":"nm0000106","role":null},{"name":"Adam Sandler","id":"nm0001191","role":null}]}]}]}],"votes":"276 677","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"},{"idCompany":"co0059609","name":"Happy Madison Productions"},{"idCompany":"co0017525","name":"Anonymous Content"}],"keywords":{"keywords":["short term memory loss","dream","hawaii","veterinarian","hawaiian shirt","anterograde amnesia","reference to j. edgar hoover","lifting someone into the air","animal vomit","nipples","masturbation","sex","kiss","wet dream","stitch","chick flick","wet clothes","see through clothes","nipples visible through clothing","boat accident","metrosexual","amnesia","daydream","obscene finger gesture","true love","shark","rain","dolphin","womanizer","wedding","walrus","wager","waffles","videotape","video footage","video camera","teacher","swimming","steroids","screwball comedy","scream","sailboat","restaurant","prologue","product placement","prank","playing with food","pineapple","painting","memory loss","journal","jet ski","golf","friendship","flashback","father son relationship","father daughter relationship","fantasy sequence","drug humor","doctor","diner","deception","clinic","car accident","cannabis","brother sister relationship","break up","birthday party","beach party","aquarium","androgyny","beach","lisp","penguin","baseball bat","number in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:11:36"}}