{"data":{"movies":[{"title":"The Game of Their Lives","originalTitle":"","year":"2005","releaseDate":"20050422","directors":[{"name":"David Anspaugh","id":"nm0000770"}],"writers":[{"name":"Geoffrey Douglas","id":"nm1326238"},{"name":"Angelo Pizzo","id":"nm0686233"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTg3MDkxN15BMl5BanBnXkFtZTcwNTg4ODgyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama","History","Sport"],"plot":"Based on a true story, this film tells the tale of the 1950 US soccer team who, against all odds, beat England 1 - 0 in the city of Belo Horizonte, Brazil. Although no US team has ever won a World Cup title, this story is about the family traditions and passions which shaped the lives of the players who made up this team of underdogs.","simplePlot":"Based on a true story, this film tells the tale of the 1950 US soccer team who, against all odds, beat England 1 - 0 in the city of Belo Horizonte, Brazil. Although no US team has ever won a World Cup title, this story is about the family traditions and passions which shaped the lives of the players who made up this team of underdogs.","actors":[{"actorName":"Gerard Butler","urlProfile":"http://www.imdb.com/name/nm0124930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1969","placeOfBirth":" Paisley, Scotland, UK","birthName":"Gerard James Butler","height":"6' 2\" (1.88 m)","bio":"Gerard James Butler was born in Paisley, Scotland, to Margaret and Edward Butler, a bookmaker. His family is of Irish origin. Gerard spent some of his very early childhood in Montreal, Quebec, but was mostly raised, along with his older brother and sister, in his hometown of Paisley. His parents divorced when he was a child, and he and his siblings were raised primarily by their mother, who later remarried. He had no contact with his father between the ages of two and 16 years old, after which time they became close. His father passed away when Gerard was in his early 20s. Butler went on to attend Glasgow University, where he studied to be a lawyer/solicitor. He was president of the school's law society thanks to his outgoing personality and great social skills. His acting career began when he was approached in a London coffee shop by actor Steven Berkoff, who later appeared alongside Butler in Attila (2001), who gave him a role in a stage production of \"Coriolanus\". After that, Butler decided to give up law for acting. He was cast as Ewan McGregor's character \"Renton\" in the stage adaptation of Trainspotting. His film debut was as Billy Connolly's younger brother in Mrs Brown (1997). While filming the movie in Scotland, he was enjoying a picnic with his mother near the River Tay when they heard the shouts of a young boy, who had been swimming with a friend, who was in some trouble. Butler jumped in and saved the young boy from drowning. He received a Certificate of Bravery from the Royal Humane Society. He felt he only did what anyone in the situation would have done. His film career continued with small roles, first in the \"James Bond\" movie, Tomorrow Never Dies (1997), and then Russell Mulcahy's Tale of the Mummy (1998). In 2000, Butler was cast in two breakthrough roles, the first being \"Attila the Hun\" in the USA Network mini-series, Attila (2001). The film's producers wanted a known actor to play the part but kept coming back to Butler's screen tests and decided he was their man. He had to lose the thick Scottish accent, but managed well. Around the time \"Attila\" was being filmed, casting was in progress for Wes Craven's new take on the \"Dracula\" legacy. Also wanting a known name, Butler wasn't much of a consideration, but his unending tenacity drove him to hounding the producers. Eventually, he sent them a clip of his portrayal of \"Attila\". Evidently, they saw something because Dracula 2000 (2000) was cast in the form of Butler. Attila's producers, thinking that his big-screen role might help with their own film's ratings, finished shooting a little early so he could get to work on Dracula 2000 (2000). Following these two roles, Butler developed quite a fan base, an Internet site and began appearing on lists everywhere. Since then, he has appeared in Reign of Fire (2002) as \"Creedy\" and Lara Croft Tomb Raider: The Cradle of Life (2003) as \"Terry Sheridan\", alongside Angelina Jolie. The role that garnered him the most attention from both moviegoers and movie makers, alike, was that of \"Andre Marek\" in the big-screen adaptation of Michael Crichton's novel, Timeline (2003). Butler played an archaeologist who was sent back in time with a team of students to rescue a colleague. Last year, he appeared in Andrew Lloyd Webber's musical, The Phantom of the Opera (2004), playing the title character in the successful adaptation of the stage musical. It was a role that brought him much international attention. Other projects include Dear Frankie (2004), The Game of Their Lives (2005) and Beowulf, la légende viking (2005). In 2007, he starred as Spartan \"King Leonidas\" in the Warner Bros. production 300 (2006), based on the Frank Miller graphic novel, and Shattered (2007), co-starring Pierce Brosnan and Maria Bello, which aired on network TV under the title, \"Shattered\". He most recently starred in P.S. I Love You (2007), with Academy Award-winner Hilary Swank. In 2007, he appeared in Nim's Island (2008) and RocknRolla (2008), and completed the new Mark Neveldine / Brian Taylor film, Gamer (2009). His next films included The Ugly Truth (2009), co-starring Katherine Heigl, which began filming in April 2008, The Bounty Hunter (2010), How to Train Your Dragon (2010), Chasing Mavericks (2012) and Olympus Has Fallen (2013). Butler is also a relative of rising animator and film director Mark Flood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0124930","name":"Gerard Butler","nicknames":["Gerry"],"idIMDB":"nm0124930"},"actorId":"nm0124930","character":"Frank Borghi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wes Bentley","urlProfile":"http://www.imdb.com/name/nm0004747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyOTY5OTA5OF5BMl5BanBnXkFtZTcwNzM1MjM1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1978","placeOfBirth":" Jonesboro, Arkansas, USA","birthName":"Wesley Cook Bentley","height":"5' 11\" (1.8 m)","bio":"Wes Bentley is an American actor who first became well-known via his role in the Oscar-winning film American Beauty (1999), in which he played the soulful, artistic next-door neighbor Ricky Fitts. He also portrayed gamemaker Seneca Crane in The Hunger Games (2012), and co-stars in Lovelace (2013) as photographer Thomas. Wesley Cook Bentley was born September 4, 1978, in Jonesboro, Arkansas, to David and Cherie Bentley, two Methodist ministers. Wes joined older brothers Jamey and Philip, and was later joined by younger brother, Patrick. Wes attended Sylvan Hills High School in Sherwood, Arkansas, where he was in the drama club. Interest in acting came from Improv Comedy. He, his brother Patrick, his best friend Damien Bunting and other close friend Josh Cowdery developed an Improv group called B(3) + C. They regularly dominated competitions in Arkansas. He then placed First in the state of Arkansas in solo acting in 1996, his senior year of high school, Second in Duet, and also regularly won for Poetry and Prose Readings. Wes appeared on-stage quite a bit in Little Rock. At The Weekend Theater, Wes played the straight son of the gay couple in a production of La Cage aux Folles. At Murry's Dinner Playhouse, Wes' plays included Oliver. At his mother's urging, Wes attended Juilliard School in New York after high school graduation. He was there only a short time but appeared in stage work like Henry IV, Part 1 and The Weavers. Wes then worked at Blockbuster and was a waiter at TGI Friday's on Long Island. Wes has stated that his most prideful venture in life was starting a soccer team from scratch at his high school and subsequently putting together a full Conference, one of Arkansas's first. Wes had no real experience in soccer before doing this. Bentley made his onscreen debut in Jonathan Demme's Beloved (1998). Following his success in American Beauty, Bentley struggled with substance abuse, which cost him his first marriage, to actress Jennifer Quanz. Although he continued to land parts in films, including that of the primary antagonist in Ghost Rider (2007) and another major role in The Game of Their Lives (2005), Bentley has publicly admitted that during most of the 2000s he only took on acting roles to earn enough money to buy drugs. Bentley did not enter a 12-step program until 2009. He has stated that he considers his sobriety to be an ongoing process. Bentley is one of the main subjects featured in the documentary My Big Break (2009), which followed him and former roommates Chad Lindberg, Brad Rowe and Greg Fawcett as they struggle to find success within the film industry. In 2010, Bentley made his professional stage debut with Nina Arianda in David Ives's award-winning play \"Venus In Fur.\" Bentley has one child with his second wife, producer Jacqui Swedberg.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyOTY5OTA5OF5BMl5BanBnXkFtZTcwNzM1MjM1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004747","name":"Wes Bentley","idIMDB":"nm0004747"},"actorId":"nm0004747","character":"Walter Bahr","urlCharacter":"http://www.imdb.com/character/ch0216177","main":true},{"actorName":"Jay Rodan","urlProfile":"http://www.imdb.com/name/nm0734421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmZhMGNlM2ItZWIwZC00ODVkLThjMzAtYWRiODQwNTQ4NGMxL2ltYWdlXkEyXkFqcGdeQXVyMzEzMzkxOTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1974","placeOfBirth":" South Africa","height":"5' 11\" (1.8 m)","bio":"Jay Rodan was born in Durban, South Africa. His father is Scottish, and he was raised in London, Edinburgh, Africa, India and Canada. He has worked in film and television in the United States, the U.K. and Europe. He has been twice nominated by the Writer's Guild of America, in 2013 and 2014, and he owns a production company producing commercials and stills.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmZhMGNlM2ItZWIwZC00ODVkLThjMzAtYWRiODQwNTQ4NGMxL2ltYWdlXkEyXkFqcGdeQXVyMzEzMzkxOTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0734421","name":"Jay Rodan","idIMDB":"nm0734421"},"actorId":"nm0734421","character":"Frank 'Pee Wee' Wallace","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gavin Rossdale","urlProfile":"http://www.imdb.com/name/nm0569962","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjMxNjg4MF5BMl5BanBnXkFtZTcwOTQyMDYzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1965","placeOfBirth":" Kilburn, London, England, UK","birthName":"Gavin McGregor Rossdale","height":"6' 1\" (1.86 m)","bio":"Gavin Rossdale was born on October 30, 1965 in Kilburn, London, England as Gavin McGregor Rossdale. He was previously married to Gwen Stefani.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjMxNjg4MF5BMl5BanBnXkFtZTcwOTQyMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569962","name":"Gavin Rossdale","nicknames":["Mr. Stefani"],"idIMDB":"nm0569962"},"actorId":"nm0569962","character":"Stanley Mortensen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Costas Mandylor","urlProfile":"http://www.imdb.com/name/nm0541908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTU4MjA3NF5BMl5BanBnXkFtZTgwMjczMjk1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1965","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Costas Theodosopoulos","height":"5' 11\" (1.8 m)","bio":"Costas Mandylor was born on September 3, 1965 in Melbourne, Victoria, Australia as Costas Theodosopoulos. He is an actor, known for Saw IV (2007), Saw V (2008) and Saw VI (2009). He has been married to Victoria Ramos since October 10, 2013. He was previously married to Talisa Soto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTU4MjA3NF5BMl5BanBnXkFtZTgwMjczMjk1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0541908","name":"Costas Mandylor","idIMDB":"nm0541908"},"actorId":"nm0541908","character":"Charlie 'Gloves' Columbo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Mandylor","urlProfile":"http://www.imdb.com/name/nm0541909","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkzODQzNjQ3Nl5BMl5BanBnXkFtZTYwMjI4NDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1966","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Louis Theodosopoulos","bio":"Recently reprising his role in, my big Fat Greek Wedding 2, the 400 million dollar- grossing history-making comedy sequel, Mandylor's latest movies / Daylights End playing Lance Hendrickson's son in a Post apocalypse zombie infested world/ Mandylor also leads his expendable type crew through a high Octane action drama Titled HUNTED\", Mandylor also teams up with Creig Sheffer in chasing down the exciting Steven Segal in CODE OF HONOR a 2016 NEW RELEASE Sept by Sony. Some of Mandylor 's other credits are numerous hit television shows/ Grace Under Fire, Martial Law, the worldwide-loved Friends, episodes of CSI, Castle & NCSI..Mandylor's production company, has steadily raised the bar for independent filmmaking following the successful production of its first three award-winning feature films. Top HONORS at The AOF film festival not to mention the coveted best drama feature distinction and an array of best picture awards for In the eyes of a Killer. Mandylor has since produced and directed 8 films comprising of world wide sales and awards to accompany. Mandylor's latest film BLACKOUT has opened best seller at RED BOX 2016 and getting high acclaim.. With this momentum, At AFM 2016 Mandylor merged and Launched with Marc Clebanoff to steer a new fully funded and operational world wide sales-production company Odyssey Motion Pictures. With a slate of films set for 2016 and the release of DAYLIGHTD END Louis remains a sought after entity in HOLLYWOOD.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkzODQzNjQ3Nl5BMl5BanBnXkFtZTYwMjI4NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0541909","name":"Louis Mandylor","nicknames":["Louie"],"idIMDB":"nm0541909"},"actorId":"nm0541909","character":"Gino Pariani","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zachery Ty Bryan","urlProfile":"http://www.imdb.com/name/nm0117022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk1Y2E1OWQtMDdmOC00OWNiLTlkM2UtY2MzOGMxMDJiYWE0L2ltYWdlXkEyXkFqcGdeQXVyMjA4NzI4Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1981","placeOfBirth":" Aurora, Colorado, USA","birthName":"Zachery Tyler Bryan","height":"5' 11\" (1.8 m)","bio":"Zach was born in Colorado on October 9th 1981 to Jenny and Dwight Bryan. Beginning his acting career at an early age, he has appeared on television and major motion pictures. He is probably best-known for his role as \"Brad Taylor\" on Home Improvement (1991). Movie roles included First Kid (1996), The Rage: Carrie 2 (1999) and ESPN's The Fast and the Furious: Tokyo Drift (2006). Zach has maintained an active television career with guest roles including Shark (2006) and on Veronica Mars (2004). In addition to Zach's on-screen presence, he's busy writing and can be often spotted at the popular Hollywood bar he co-owns, \"Big Wangs\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk1Y2E1OWQtMDdmOC00OWNiLTlkM2UtY2MzOGMxMDJiYWE0L2ltYWdlXkEyXkFqcGdeQXVyMjA4NzI4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0117022","name":"Zachery Ty Bryan","nicknames":["ZTB","Zach"],"idIMDB":"nm0117022"},"actorId":"nm0117022","character":"Harry Keough","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Jean-Louis","urlProfile":"http://www.imdb.com/name/nm1097515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ5MDE0OTgwMF5BMl5BanBnXkFtZTgwMDg0NjY0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1968","placeOfBirth":" Pétion-Ville, Haiti","height":"5' 11¼\" (1.81 m)","bio":"Jimmy led a simple life in a remote village in Haiti until the age of twelve, when he moved to Paris. He has worked in musical theatre in Spain, spending three years with a musical theater \"La Belle Epoque\", and has had a successful career as an international model. Jimmy moved to Los Angeles in 1998 and immediately started honing his chosen craft by lending his abilities to underground and independent films. That eventually led to him landing a role in Jean Claude Van Damme's \"Derailed\", which set the stage for subsequent roles with other Hollywood A-listers. He went on to shoot \"Tears of the sun\" with Bruce Willis and Monica Belluci, \"Hollywood Homicide\" with Harrison Ford and Josh Hartnet, \"Monster-in-law\" with Jane Fonda and Jennifer Lopez and \"The Miracle match\" with Patrick Stewart, Wes Bentley and Gerard Butler. He played the lead role in \"The Diary of a tired black man \" and in \"Phat Girlz\" starring opposite Oscar winner Monique Imes Jackson as her love interest. Jimmy portrayed the charismatic Rene \"the Haitian\" in the hit TV show \"Heroes\". With an international appeal, he's been working in many parts of the world including France, England, Indonesia, Ghana, Nigeria...making full use of his ability to speak 5 different languages. He received a best actor nomination in the movie \"Sinking Sand\" at the AMAA 2011, the equivalent of the African Oscars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ5MDE0OTgwMF5BMl5BanBnXkFtZTgwMDg0NjY0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1097515","name":"Jimmy Jean-Louis","idIMDB":"nm1097515"},"actorId":"nm1097515","character":"Joe Gaetjens","urlCharacter":"http://www.imdb.com/character/ch0460425","main":true},{"actorName":"Richard Jenik","urlProfile":"http://www.imdb.com/name/nm0420736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTYyODk0N15BMl5BanBnXkFtZTcwMjk5NzgyMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1967","placeOfBirth":" Delanco, New Jersey, USA","birthName":"Richard Yenick","height":"6' (1.83 m)","bio":"Was born in the little town of Delanco, New Jersey. Very close with his parents and two older sisters. Was an All-American soccer player. Went to Old Dominion University in Norfolk, Virginia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTYyODk0N15BMl5BanBnXkFtZTcwMjk5NzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0420736","name":"Richard Jenik","nicknames":["RJ"],"idIMDB":"nm0420736"},"actorId":"nm0420736","character":"Joe Maca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nelson Vargas","urlProfile":"http://www.imdb.com/name/nm1328374","urlPhoto":"","biography":{"bio":"Nelson Vargas is an actor, known for The Game of Their Lives (2005) and Manito (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1328374","name":"Nelson Vargas","idIMDB":"nm1328374"},"actorId":"nm1328374","character":"John 'Clarkie' Souza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig Hawksley","urlProfile":"http://www.imdb.com/name/nm0370289","urlPhoto":"","biography":{"bio":"Craig Hawksley was born in St. Louis, Missouri, USA. He is an actor, known for The Express (2008), Meet Bill (2007) and King of the Hill (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0370289","name":"Craig Hawksley","idIMDB":"nm0370289"},"actorId":"nm0370289","character":"Walter Giesler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Smitrovich","urlProfile":"http://www.imdb.com/name/nm0810488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1NTg2M15BMl5BanBnXkFtZTgwNTcyMzkwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1947","placeOfBirth":" Bridgeport, Connecticut, USA","birthName":"William Stanley Smitrovich","height":"6' (1.83 m)","bio":"Connecticut-born actor Bill Smitrovich (on May 16, 1947) started his acting career rather late. A Masters degree holder from Smith College and a former acting teacher at the University of Massachusetts, the hefty actor earned his big break in an understudy role in the world premiere of Arthur Miller's \"The American Clock\" at the Spoleto Festival, a production that went to Broadway. Other stage parts have included \"Food from Trash,\" \"Requiem for a Heavyweight,\" \"Far East\" and \"Frankie & Johnny at the Claire de Lune.\" Bill was a founding member of the No Theatre Company, now in association with the Wooster Group, whose members included Willem Dafoe and the late Spalding Gray. Bill made his 1978 New York debut in the company's production of \"The Elephant Man.\" In the early 1980s he started tackling film and TV roles, often playing cops and assorted villainous types. He made his film debut in a small role in A Little Sex (1982) and went on to play a prime part in the TV-movie pilot of Miami Vice (1984). A co-starring detective part on the series Crime Story (1986) led to more visibility. He finally became a household face (if not quite a name) as former construction worker-turned-restaurateur Drew Thatcher, the father of three on the critically acclaimed dramatic series Life Goes On (1989). Co-starring with Patti LuPone (of \"Evita\" fame), they played parents to a son born with Down Syndrome (portrayed by Chris Burke). The much-admired family-oriented show, which went on to deal with other topical themes such as AIDS, lasted four seasons. Since then Bill has involved himself in raising public consciousness and sensitivity of Down Syndrome. He has hosted the annual \"Life Goes On Celebrity Golf Classic\" for the Down Syndrome Association of Los Angeles. Following this TV success, Bill co-starred on the A Nero Wolfe Mystery (2000) with Timothy Hutton and Maury Chaykin, had a recurring chief prosecutor role on The Practice (1997) and played a lieutenant in the Fox hit series Millennium (1996). His many film roles include Key Exchange (1985), Renegades (1989), The Trigger Effect (1996) with Dermot Mulroney, Independence Day (1996) with Will Smith, a strong role as a public defender in Rob Reiner's Ghosts of Mississippi (1996), Air Force One (1997) and, more recently, as a general in Kevin Costner's Cuban Missile Crisis drama Thirteen Days (2000). He also played Alexander Haig in the TV-movie biopic on Ronald Reagan starring James Brolin and Judy Davis. Bill is married with two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1NTg2M15BMl5BanBnXkFtZTgwNTcyMzkwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0810488","name":"Bill Smitrovich","idIMDB":"nm0810488"},"actorId":"nm0810488","character":"Admiral Higgins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Stewart","urlProfile":"http://www.imdb.com/name/nm0001772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzU5ODQ5OF5BMl5BanBnXkFtZTYwODIwODk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1940","placeOfBirth":" Mirfield, Yorkshire, England, UK","birthName":"Patrick Hewes Stewart","height":"5' 10\" (1.78 m)","bio":"Sir Patrick Stewart was born in Mirfield, Yorkshire, England, to Gladys (Barrowclough), a textile worker and weaver, and Alfred Stewart, who was in the army. He was a member of various local drama groups from about age 12. He left school at age 15 to work as a junior reporter on a local paper; he quit when his editor told him he was spending too much time at the theatre and not enough working. Stewart spent a year as a furniture salesman, saving cash to attend drama school. He was accepted by Bristol Old Vic Theatre School in 1957. He made his professional debut in 1959 in the repertory theatre in Lincoln; he worked at the Manchester Library Theatre and a tour around the world with the Old Vic Company followed in the early 1960s. Stewart joined the Royal Shakespeare Company in 1966, to begin his 27-year association. Following a spell with the Royal National Theatre in the mid 1980s, he went to Los Angeles, California to star on Star Trek: The Next Generation (1987), which ran from 1987-1994, playing the role of Captain Jean-Luc Picard. After the series ended, Stewart reprised his role for a string of successful Star Trek films: Star Trek: Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002). Stewart continues to work on the stage and in various films. He was awarded Knight Bachelor of the Order of the British Empire in the 2010 Queen's New Year's Honours List for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzU5ODQ5OF5BMl5BanBnXkFtZTYwODIwODk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001772","name":"Patrick Stewart","nicknames":["Old Baldy","Beef Stew"],"idIMDB":"nm0001772"},"actorId":"nm0001772","character":"Older Dent McSkimming","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terry Kinney","urlProfile":"http://www.imdb.com/name/nm0455767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDcxODcwMV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1954","placeOfBirth":" Lincoln, Illinois, USA","height":"6' (1.83 m)","bio":"Terry Kinney, the stage, film and television actor, was born on January 29, 1954 in Lincoln, Illinois and attended Illinois State University. While at university, his friend, the aspiring actor Jeff Perry, took Kinney to Chicago to see a production of \"Grease\" in which his best friend, Gary Sinise, was appearing. The like-minded trio of Sinise, Perry and Kinney opened their own Chicago theatrical troupe, the Steppenwolf Theater, in 1973 in the basement of a church in Highland Park. The company's metamorphosis into one of the country's great regional theatrical companies began in 1976, after Kinney and Perry joined it full-time after graduating from college. The theater has, since 1976, put on a full season of ensemble works. The founders of Steppenwolf supported the theater and themselves with odd jobs until he company began financially self-supporting in the early 1980s. Re-located in the old St. Nicholas Theater, Steppenwolf's productions began to attract a steady audience. Steppenwolf flourished artistically and financially in the '80s, and moved once again to its permanent home at 1650 N. Halsted Street in Chicago. At the height of the company's fame, Kinney and Sinise were Steppenwolf's artistic co-directors, winning numerous awards, and even transferring some productions, such as their monumental adaptation of John Steinbeck's \"The Grapes of Wrath\", to Broadway. In addition to Kinney and Sinise, the company included such first rate actors as John Malkovich, Joan Allen and John Mahoney. As an actor, Kinney was nominated for a Tony Award for his appearance as the \"Reverend Casey\" in \"Grapes\". Kinney made his movie debut in 1985, with a bit part in Seven Minutes in Heaven (1985), and has been much in demand as a supporting actor ever since. On television, he had a small but recurring role on Thirtysomething (1987) and appeared as a regular on the HBO prison drama Oz (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDcxODcwMV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455767","name":"Terry Kinney","idIMDB":"nm0455767"},"actorId":"nm0455767","character":"Dent McSkimming","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Rhys-Davies","urlProfile":"http://www.imdb.com/name/nm0722636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNDY3NjQxMF5BMl5BanBnXkFtZTcwMDc3NTYyOQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1944","placeOfBirth":" Ammanford, Wales, UK","height":"6' 1\" (1.85 m)","bio":"Acclaimed Welsh actor John Rhys-Davies was born in Ammanford, Carmarthenshire, Wales, to Mary Margaretta Phyllis (Jones), a nurse, and Rhys Davies, a mechanical engineer and Colonial Officer. He graduated from the University of East Anglia and is probably best known to film audiences for his roles in the blockbuster hits Raiders of the Lost Ark (1981) and Indiana Jones and the Last Crusade (1989). Rhys-Davies was introduced to a new generation of fans in the blockbuster trilogy \"The Lord of the Rings\" (The Lord of the Rings: The Fellowship of the Ring (2001), (The Lord of the Rings: The Two Towers (2002), and (The Lord of the Rings: The Return of the King (2003)) in the role of Gimli the dwarf. He has also had leading roles in Victor Victoria (1982), The Living Daylights (1987) and King Solomon's Mines (1985). Rhys-Davies, who was raised in England, Africa and Wales, credits his early exposure to classic literature for his decision to pursue acting and writing. he later refined his craft at London's renowned Royal Academy of Dramatic Arts. His television credits include James Clavell's Shogun (1980) and Noble House (1988), Great Expectations (1989), War and Remembrance (1988) and Archaeology (1991). An avid collector of vintage automobiles, Rhys-Davies has a host of theater roles to his credit, including \"The Misanthrope\", \"Hedda Gabler\" and most of Shakespeare's works. He divides his time between Los Angeles and the Isle of Man.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNDY3NjQxMF5BMl5BanBnXkFtZTcwMDc3NTYyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0722636","name":"John Rhys-Davies","idIMDB":"nm0722636"},"actorId":"nm0722636","character":"Bill Jeffrey","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0354595","urlIMDB":"http://www.imdb.com/title/tt0354595","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$175,336","country":"USA","day":"24","month":"04","year":"2005","remarks":"64 Screens"}],"gross":[{"money":"$375,474","country":"USA","day":"12","month":"06","year":"2005","remarks":""},{"money":"$369,168","country":"USA","day":"05","month":"06","year":"2005","remarks":""},{"money":"$354,822","country":"USA","day":"22","month":"05","year":"2005","remarks":""},{"money":"$347,419","country":"USA","day":"15","month":"05","year":"2005","remarks":""},{"money":"$335,307","country":"USA","day":"08","month":"05","year":"2005","remarks":""},{"money":"$300,690","country":"USA","day":"01","month":"05","year":"2005","remarks":""},{"money":"$175,336","country":"USA","day":"24","month":"04","year":"2005","remarks":""}],"weekendGross":[{"money":"$522","country":"USA","day":"12","month":"06","year":"2005","remarks":"2 Screens"},{"money":"$12,257","country":"USA","day":"05","month":"06","year":"2005","remarks":"19 Screens"},{"money":"$4,323","country":"USA","day":"22","month":"05","year":"2005","remarks":"3 Screens"},{"money":"$6,138","country":"USA","day":"15","month":"05","year":"2005","remarks":"6 Screens"},{"money":"$15,373","country":"USA","day":"08","month":"05","year":"2005","remarks":"14 Screens"},{"money":"$84,044","country":"USA","day":"01","month":"05","year":"2005","remarks":"54 Screens"},{"money":"$175,336","country":"USA","day":"24","month":"04","year":"2005","remarks":"64 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"06","year":"2003","remarks":null},null],"copyrightHolder":"Game of Their Lives, LLC"},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":["DTS","SDDS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (also prints)"],"filmLength":null,"negativeFormat":["35 mm (Fuji)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.2","metascore":"47","filmingLocations":[{"location":"Belo Horizonte, Minas Gerais, Brazil"}],"rated":"PG","awards":[],"votes":"2,708","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046530","name":"Independent Film Channel (IFC)"},{"idCompany":"co0129170","name":"Bristol Bay Productions"},{"idCompany":"co0078216","name":"Peter Newman Productions"}],"keywords":{"keywords":["world cup","brazil","1950s","soccer","soccer movie","slow motion scene","sportscaster","soccer fan","soccer coach","soccer game","goalkeeper","airplane trip","soccer team","soccer shirt","voodoo","rain","soccer star","soccer match","sports history","camaraderie","german american","italian american","interracial friendship","american abroad","friend","family relationships","amateur","world war two veteran","wedding reception","washington d.c.","u.s. air force","uniform","told in flashback","st. louis missouri","rooftop","rio de janeiro brazil","reporter","rainstorm","railway station","new york city","mother son relationship","mailman","locker room","hotel","general","funeral","funeral home","friendship","ethnic slur","english","drugged drink","diner","dancing","cook","coach","claustrophobia","cigar smoking","cemetery","catholic","catholic church","bus","bar","banquet","airplane","based on true story","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:17:45"}}