{"data":{"movies":[{"title":"Journal intime d'une future star","originalTitle":"Confessions of a Teenage Drama Queen","year":"2004","releaseDate":"20040220","directors":[{"name":"Sara Sugarman","id":"nm0837406"}],"writers":[{"name":"Dyan Sheldon","id":"nm1358381"},{"name":"Gail Parent","id":"nm0661275"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMDE0MDQ5Ml5BMl5BanBnXkFtZTcwNTUwMDUyMQ@@._V1.jpg","countries":["Germany","USA"],"languages":["English"],"genres":["Comedy","Family","Music","Romance"],"plot":"When the teenager Mary Elizabeth Steppe, a.k.a. Lola, moves with her mother and two younger twin sisters from New York to the suburb of Dellwood, New Jersey, she has the feeling that her cultural and entertaining world ended. While in school, the displaced Lola becomes close friend of the unpopular Ella, who is also a great fan of the her favorite rock band Sidarthur. However, the most popular girl in the school, Carla Santini, disputes the lead role in an adaptation of Pygmalion with Lola and also the leadership of their mates. When the last concert of Sidarthur is sold-out, Lola plans with Ella to travel to New York and buy the tickets from scalpers. However, the girls get into trouble while helping the lead singer and Lola's idol Stu Wolf, changing their lives forever.","simplePlot":"A teenage girl is convinced that her home city revolves around her until her family packs up and moves to the suburbs, where she finds herself competing for attention.","actors":[{"actorName":"Lindsay Lohan","urlProfile":"http://www.imdb.com/name/nm0517820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1NzE3NTM2Ml5BMl5BanBnXkFtZTgwNDQ4MDk5NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1986","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Lindsay Dee Lohan","height":"5' 5\" (1.65 m)","bio":"Lindsay Dee Lohan was born in New York City on 2 July 1986. Her mother, Dina Lohan (née Donata Melina Nicolette Sullivan), is a former Wall Street analyst, and her father, Michael Lohan, is a businessman and former Wall Street trader. She has Irish, Italian, and German ancestry. Lohan began her career at age three as a model at the Eileen Ford Agency, and made appearances in over 60 television commercials, including spots for The Gap, Pizza Hut, Wendy's and Jell-O (opposite Bill Cosby). Lohan made her acting debut in 1996 as the third actress to play Ali Fowler in the television drama Another World (1964). Shortly afterward she was hand-picked by Oscar-nominated writer Nancy Meyers as estranged twin sisters in an adaptation by Walt Disney Pictures of a novel by Erich Kästner, which marked Meyers' directorial debut. Lohan's first feature film, The Parent Trap (1998), a remake of The Parent Trap (1961), was a modest commercial success, earning her widespread critical acclaim and a Young Artist award for Best Leading Young Actress in a Feature Film, as well as Blockbuster Entertainment and YoungStar award nominations. After signing a three-movie contract with Disney, she returned to the small screen to star in the made-for-TV movies The Wonderful World of Disney: Life-Size (2000) (opposite Tyra Banks) and Get a Clue (2002) (opposite Bug Hall). She also appeared as Rose in the pilot episode of the short-lived comedy series Bette (2000), which starred Bette Midler. In June 2001 Lohan took a brief hiatus from acting. Her music career was launched over a year later, when Estefan Enterprises made a five-album production deal with her in September 2002, and she signed a recording contract with the reactivated Casablanca Records. However, Lohan was not turning her back on her blossoming acting career. Just over a month previously she had been cast opposite Jamie Lee Curtis for another Disney adaptation of a novel, this time a fantasy comedy by Mary Rodgers. Freaky Friday (2003), a remake of Freaky Friday (1976), was a huge hit (generating over $160 million in worldwide box office receipts) and critics were spellbound by delightful performances from Lohan and Curtis (who went on to receive a Golden Globe nomination for her work). In addition, Lohan won the 2004 MTV Movie Award for Best Breakthrough Female, as well as a Saturn award nomination and another Young Artist award nomination. Lohan relocated permanently to Los Angeles between projects and moved into an apartment with fellow actress Raven-Symoné. She also dated pop star Aaron Carter for a short time. Her next acting role was the title character in the comedy Journal intime d'une future star (2004), a Disney adaptation of the novel by Dyan Sheldon. The film received scathing reviews upon its release and died a quick death at the box office, but even the harshest of critics were impressed by Lohan's charming turn as aspiring actress Lola. Lohan's next project, Mean Girls (2004), saw her reunite with Freaky Friday (2003) director Mark Waters. Inspired by a non-fiction book by Rosalind Wiseman and written by Saturday Night Live (1975) scribe Tina Fey, the high-school comedy-drama opened to glowing reviews and grossed $86 million in the US. This earned her status as a bankable actress, and a salary of $7.5 million for the Donald Petrie romantic comedy Just My Luck (2006). One of the most sought-after young actresses in the industry, she starred in Bobby (2006) (opposite Demi Moore and Sharon Stone), the Disney fantasy adventure Herbie Fully Loaded (2005) (a pseudo-sequel to The Love Bug (1968)) and the critically acclaimed A Prairie Home Companion (2006). On top of a thriving film career Lohan also launched a music career, releasing her debut album, \"Speak,\" which hit shelves in December 2004. In 2009 Lohan launched her own fashion line titled 6126, mainly focusing on the production of women's leggings. By spring she launched a self-tanning spray line titled \"Sevin Nyne\" and by the end of the year she became an artistic designer for fashion house Ungaro. Lindsay continues her career in acting, having played a supporting role in the action film Machete (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1NzE3NTM2Ml5BMl5BanBnXkFtZTgwNDQ4MDk5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0517820","name":"Lindsay Lohan","nicknames":["Linds","La Lohan","LL","LiLo"],"idIMDB":"nm0517820"},"actorId":"nm0517820","character":"Lola","urlCharacter":"http://www.imdb.com/character/ch0048804","main":true},{"actorName":"Adam Garcia","urlProfile":"http://www.imdb.com/name/nm0305081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzdmMTZmZTktY2U1OC00ZDkyLWJiMzgtZmY4MjU4ZDE1ZTM4XkEyXkFqcGdeQXVyMjA2NzY5MzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1973","placeOfBirth":" Wahroonga, New South Wales, Australia","birthName":"Adam Gabriel Garcia","height":"5' 10\" (1.78 m)","bio":"Adam Garcia is an Australian actor and tap dancer of partial Colombian descent (his father is from Colombia). Garcia left university to take the role of Slide in the production of the musical Hot Shoe Shuffle, which toured Australia before transferring to London, England. Garcia stayed on in London to act in West End musicals. Garcia played Doody in the West End's version of Grease in London. He also played a Travolta character, Tony Manero, in the stage version of Saturday Night Fever, which ran from 1998 to 1999 in London. Garcia was nominated for an Olivier Award for his performance. Garcia reached #15 in the UK singles chart in 1998, with his cover version of the Bee Gees song \"Night Fever\", taken from Saturday Night Fever. In 2000, Garcia performed a solo Tap dance in the Sydney Olympic Opening Ceremony Garcia has been nominated for multiple awards during his stage acting career. His transition into a film actor began in 1997, when he played Jones in Wilde, a movie about the life of writer Oscar Wilde. Garcia then went on to act in such movies as Coyote Ugly, Bootmen & Riding In Cars With Boys and, in 2004, the role of rock star Stu Wolf in Confessions of a Teenage Drama Queen He appeared as government official Alex Klein in the 2005 Christmas special of the long-running British science fiction television series Doctor Who. According to the audio commentary for the episode, Garcia accepted the relatively minor role as he is a science fiction fan. . Garcia worked with Idina Menzel and Kristin Chenoweth to help create the role of Fiyero in the 2002 workshop edition of an in-production musical called Wicked. After Wicked's success, the show soon spawned a London production, in which Garcia got to play the role of Fiyero. The show opened 27 September 2006, after previews began 7 September. He played his final performance 14 July 2007. In the latter part of 2008, Garcia appeared in two ITV dramas, Britannia High in which he plays the dance teacher, and Mr Eleven, a two-part comedy/drama alongside Michelle Ryan and Sean Maguire. In January 2010 Garcia appeared alongside Ashley Banjo and Kimberly Wyatt as a judge on the reality show Got To Dance. He also was a judge on Australias' Dancing With The Stars for 2 seasons He made a guest appearance alongside Franki \"Searing\" Sears in Episode 19 (The Choice) on 6 of House. In 2010 Garcia starred in the London West End production of Tap Dogs in the Novello Theatre from 15 June to 5 September. In 2012 Garcia received another Olivier nomination for his performance of Bill Calhoun/Lucentio in Trevor Nunn's revival of Kiss Me Kate at the Old Vic. In 2016, Garcia created Father Damien Karras for Birmingham Repertory Theatre's production of The Exorcist.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzdmMTZmZTktY2U1OC00ZDkyLWJiMzgtZmY4MjU4ZDE1ZTM4XkEyXkFqcGdeQXVyMjA2NzY5MzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0305081","name":"Adam Garcia","idIMDB":"nm0305081"},"actorId":"nm0305081","character":"Stu","urlCharacter":"http://www.imdb.com/character/ch0031440","main":true},{"actorName":"Glenne Headly","urlProfile":"http://www.imdb.com/name/nm0000444","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjc2NzIwMl5BMl5BanBnXkFtZTcwMDM4MjAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1955","placeOfBirth":" New London, Connecticut, USA","height":"5' 8\" (1.73 m)","bio":"For the past fourteen years, she has said that family has been the most important thing to her and she has set most of her time aside to be a \"present\" mother to her son. Movies, plays and television are chosen, for the most part, when they occur in town or on a school break. She has taken the current year to homeschool her son for his seventh grade. But it wasn't always this way. She was raised in New York City and wanted to be an actress from the time she was a child, graduating with acting honors from the High School of Performing Arts. She chose to opt out of studying acting in college and attended a small college in Europe, majoring in art history and literature, knowing that acting would take up a great deal of her life and that her college years would be her only real time to learn about something else. Upon graduation, she returned to New York City but a chance trip to Chicago inspired her to move there and become a part of its budding theatre community. It was in a production of \"Curse of The Starving Class\", directed by Robert Falls and co-starring John Malkovich, that she was first seen by the Steppenwolf Theatre Company and, subsequently, asked to join their troupe. She did and learned what it really was to be an actress on her feet, performing in all kinds of roles in both comedy and drama. During this time, she won four Joseph Jefferson awards for best supporting actress. With a return move to New York, she received a Theatre World Award for \"best newcomer\" for her role in \"the Philanthropist\" at the Manhattan Theatre Club and appeared in \"Extremities\" with Susan Sarandon. This was followed by her appearance in the very successful Steppenwolf production in New York of \"Balm in Gilead\". She then starred on Broadway opposite Kevin Kline and Raul Julia in \"Arms & the Man\", directed by John Malkovich, her husband at the time. She was cast in several smaller films including Nadine (1987), Making Mr. Right (1987) and Paperhouse (1988) as well as Lonesome Dove (1989) for television for which she received her first of two Emmy nominations for best supporting actress. But her breakout film performance was in Dirty Rotten Scoundrels (1988), in which she played the cunning \"victim\", who gets the best of con artists Michael Caine and Steve Martin. This led to her being cast in the blockbuster comic strip parody, Dick Tracy (1990), in which she portrayed the girlfriend, \"Tess Trueheart\", to Warren Beatty's lead. She went on to appear in the films Mr. Holland's Opus (1995) opposite Richard Dreyfuss, Mortal Thoughts (1991) opposite Demi Moore, 2 Days in the Valley (1996), What's the Worst That Could Happen? (2001), Breakfast of Champions (1999), Around the Bend (2004) and Journal intime d'une future star (2004). On television, she had a recurring part on ER (1994) and Monk (2002) and was in the short-lived sit-com Encore! Encore! (1998) with Nathan Lane and Joan Plowright. She was in the live theatrical presentation of \"On Golden Pond\" as the troubled daughter of Christopher Plummer and Julie Andrews and also appeared in the telefilms Women vs. Men (2002), My Own Country (1998) and Pronto (1997), among others. She received her second Emmy nomination for best supporting actress for Bastard Out of Carolina (1996), directed by Anjelica Huston. Her most recent appearances were in the films The Amateurs (2005) (aka \"The Amateurs\"), The Namesake (2006), Comeback Season (2006), Kit Kittredge: An American Girl (2008) and The Joneses (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjc2NzIwMl5BMl5BanBnXkFtZTcwMDM4MjAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000444","name":"Glenne Headly","idIMDB":"nm0000444"},"actorId":"nm0000444","character":"Karen","urlCharacter":"http://www.imdb.com/character/ch0031442","main":true},{"actorName":"Alison Pill","urlProfile":"http://www.imdb.com/name/nm0683467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDMyMDkzMl5BMl5BanBnXkFtZTcwNjQ4ODgwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1985","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Alison Courtney Pill","height":"5' 6½\" (1.69 m)","bio":"Alison is a Canadian born TV, film and theater actress. She was born in Toronto, Ontario. Her father, who is Estonian, is a financier. She attended Vaughan Road Academy, and decided she wanted to be an actor when she was age 10. She was a member of the Toronto Children's Chorus and was chosen to narrate one of their performances. From there, she gained a job narrating children's audio books. She achieved her first on-screen role as a background performer on Kung Fu: The Legend Continues (1993), after which, she got herself an agent. She was booking roles successfully from the age of 11. She later moved to New York to pursue roles in theater, where has enjoyed much success. She earned a Tony nomination for her performance in The Lieutenant of Inishmore. She is also very much enjoying life as a TV and film actress. Her breakthrough film role came with Scott Pilgrim vs. the World (2010). In 2012, she is playing Maggie Jordan in Aaron Sorkin's TV show The Newsroom (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDMyMDkzMl5BMl5BanBnXkFtZTcwNjQ4ODgwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0683467","name":"Alison Pill","nicknames":["Ali","Al"],"idIMDB":"nm0683467"},"actorId":"nm0683467","character":"Ella","urlCharacter":"http://www.imdb.com/character/ch0121453","main":true},{"actorName":"Eli Marienthal","urlProfile":"http://www.imdb.com/name/nm0547349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwOTc5MTE1Nl5BMl5BanBnXkFtZTcwODI4MTcyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1986","placeOfBirth":" Santa Monica, California, USA","birthName":"Eli Kenneth Marienthal","bio":"Eli Marienthal was born on March 6, 1986, in Santa Monica, California, though he has lived most of his life in Berkeley. His career started in Bay Area theatres, where he has performed in \"Missing Persons,\" \"The Cryptogram,\" \"Hecuba,\" \"A Midsummer Night's Dream,\" \"Every 17 Minutes the Crowd Goes Crazy,\" and \"The Life of Galileo.\" His parents' names are Joe and Lola, and he currently lives with his mother in Berkeley, though during the 3rd and 4th grades he spent some time in Paris with his father. He graduated from the private East Bay French-American School, where all the students learn to speak fluent French and attend classes in two languages.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwOTc5MTE1Nl5BMl5BanBnXkFtZTcwODI4MTcyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0547349","name":"Eli Marienthal","idIMDB":"nm0547349"},"actorId":"nm0547349","character":"Sam","urlCharacter":"http://www.imdb.com/character/ch0133612","main":true},{"actorName":"Carol Kane","urlProfile":"http://www.imdb.com/name/nm0001406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDgzMzMwOV5BMl5BanBnXkFtZTYwNjg1NzY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1952","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Carolyn Laurie Kane","height":"5' 2\" (1.57 m)","bio":"Carol Kane was born Carolyn Laurie Kane on June 18, 1952 in Cleveland, Ohio, to Elaine Joy (Fetterman), a jazz singer and pianist, and Michael Myron Kane, an architect. Her family is Jewish (from Russia, Poland, and Austria). Due to her parents' divorce, Carol spent most of her childhood in boarding schools, starting at age twelve, when she attended the Cherry Lawn School, a progressive boarding school in Darien, Connecticut, until 1965, followed by enrollment at the Professional Children's School in New York City. She made her professional theater debut in a 1966 production of \"The Prime of Miss Jean Brodie\". She worked prolifically in several successful received films of the 1970s, Carnal Knowledge (1971) (her film film debut), Dog Day Afternoon (1975), Hester Street (1975) (for which she earned an Oscar nomination for her performance), Annie Hall (1977) and When a Stranger Calls (1979). From 1981-1983 she played the part of what is considered to be her most memorable role. Simka Dahblitz-Gravas, the wife of Latka Gravas (played by 'Andy Kaufman), on the American television series _Taxi_. For her performance in the series, she earned two Emmy Awards. Other notable credits include: Pandemonium (1982), Racing with the Moon (1984), Transylvania 6-5000 (1985), Jumpin' Jack Flash (1986), Ishtar (1987), The Princess Bride (1987), Scrooged (1988), The Lemon Sisters (1989) and Addams Family Values (1993). Carol is first and foremost an actress of the stage and is known for her portrayal of the evil headmistress Madame Morrible in the Broadway musical \"Wicked\". She played in various productions from 2005-2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDgzMzMwOV5BMl5BanBnXkFtZTYwNjg1NzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001406","name":"Carol Kane","idIMDB":"nm0001406"},"actorId":"nm0001406","character":"Miss Baggoli","urlCharacter":"http://www.imdb.com/character/ch0021120","main":true},{"actorName":"Megan Fox","urlProfile":"http://www.imdb.com/name/nm1083271","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjgyMzk4NF5BMl5BanBnXkFtZTcwODk2OTM4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1986","placeOfBirth":" Rockwood, Tennessee, USA","birthName":"Megan Denise Fox","height":"5' 4\" (1.63 m)","bio":"Megan Denise Fox was born in Rockwood, Tennessee, to Gloria Darlene (Cisson) and Franklin Thomas Fox, a parole officer. Megan began her training in drama and dance at age 5 and, at age 10, moved to St. Petersburg, Florida where she continued her training and finished school. Megan began acting and modeling at age 13 after winning several awards at the 1999 American Modeling and Talent Convention in Hilton Head, South Carolina. At age 17, she tested out of school using correspondence and eventually moved to Los Angeles, California. Megan made her film debut as Brianna Wallace in the Mary-Kate Olsen and Ashley Olsen film Holiday in the Sun (2001). Her best known roles are as Sam Witwicky's love interest Mikaela Banes in the first two installments of the Transformers series, Transformers (2007) and Transformers: Revenge of the Fallen (2009), and as April O'Neil in the film reboot of Teenage Mutant Ninja Turtles (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjgyMzk4NF5BMl5BanBnXkFtZTcwODk2OTM4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1083271","name":"Megan Fox","nicknames":["Mega Fox","Foxy Megan"],"idIMDB":"nm1083271"},"actorId":"nm1083271","character":"Carla","urlCharacter":"http://www.imdb.com/character/ch0021118","main":true},{"actorName":"Sheila McCarthy","urlProfile":"http://www.imdb.com/name/nm0565319","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NjM1NjU4OV5BMl5BanBnXkFtZTcwNTEwNzUzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1956","placeOfBirth":" Toronto, Ontario, Canada","bio":"Sheila met spouse Peter Donaldson while doing an aerobics warm-up (she was the instructor) while in a punk-rock production of \"Godspell\" at the Grand Theatre in London, Ontario in 1983. With Donaldson (whose father was a Commodore of the Canadian Steamship Line), she had two daughters: one born in 1992 and one born in 1988. Before Donaldson's death, they lived in Stratford, Ontario in a century-old home that is known to be free of \"bohemian exuberance\" - Ridpath sofas, club chairs, oriental carpets. The one concession to McCarthy's whimsy is the stainless steel and chrome-clad kitchen with the ceiling covered in retro pressed-tin squares. In the summer of 2004, she played in \"Guys and Dolls\" and \"Anything Goes\" in the Stratford Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NjM1NjU4OV5BMl5BanBnXkFtZTcwNTEwNzUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0565319","name":"Sheila McCarthy","idIMDB":"nm0565319"},"actorId":"nm0565319","character":"Mrs. Gerard","urlCharacter":"http://www.imdb.com/character/ch0458459","main":true},{"actorName":"Tom McCamus","urlProfile":"http://www.imdb.com/name/nm0564805","urlPhoto":"","biography":{"dateOfBirth":"25 July 1955","placeOfBirth":" Winnipeg, Manitoba, Canada","height":"5' 10\" (1.78 m)","bio":"Tom McCamus was born on July 25, 1955 in Winnipeg, Manitoba, Canada. He is an actor, known for Room (2015), De beaux lendemains (1997) and A Man in Uniform (1993). He is married to Chick Reid.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0564805","name":"Tom McCamus","idIMDB":"nm0564805"},"actorId":"nm0564805","character":"Calum","urlCharacter":"http://www.imdb.com/character/ch0460095","main":true},{"actorName":"Richard Fitzpatrick","urlProfile":"http://www.imdb.com/name/nm0280584","urlPhoto":"","biography":{"bio":"An American citizen, native of Boston, Mass., member of ACTRA and SAG, Richard has worked professionally for more than forty years. In major feature films, movies for television, mini-series and episodic television he has appeared in a variety of leading and supporting roles that showcase his versatility and range as an actor. He is happily married to the Goddess of Magic and has one son, Alex, a warrior artist.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0280584","name":"Richard Fitzpatrick","idIMDB":"nm0280584"},"actorId":"nm0280584","character":"Mr. Gerard","urlCharacter":"http://www.imdb.com/character/ch0460096","main":true},{"actorName":"Sheila Sealy-Smith","urlProfile":"http://www.imdb.com/name/nm1537940","urlPhoto":"","biography":{"bio":"Sheila Sealy-Smith was an actress, known for Journal intime d'une future star (2004). She was married to Hubert Alonza 'Nicky' Sealy. She died on June 8, 2013 in St. Michael, Barbados, West Indies.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1537940","name":"Sheila Sealy-Smith","idIMDB":"nm1537940"},"actorId":"nm1537940","character":"Sgt. Rose","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashley Leggat","urlProfile":"http://www.imdb.com/name/nm1430154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjcxOTc2MF5BMl5BanBnXkFtZTcwNzc1NzEzMQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1986","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Ashley Margaret Anne Leggat","height":"5' 5½\" (1.66 m)","bio":"Ashley Leggat, a twice Gemini nominated actress, was born into a large family in Hamilton, Ontario. She joined her parents, Roy (a car dealer) and Patty (a former Secondary School teacher) and four older brothers -Rob, Brett, and twins Todd and Bram. Ashley's four brothers, all very athletic, played hockey in the winters and baseball in the summers, meaning she basically grew up in arenas and baseball parks. Ashley never actually walked -she danced, so when she was two and a half she started Baby Ballet -and she fell in love. This was the beginning of Ashley's passion for dance. Until she graduated from high school, Ashley danced competitively in the top divisions in tap, jazz, ballet, pointe, acrobatics, lyrical, musical theatre and hip hop. She was crowned the top soloist awards at all of the major dance competitions including, International Dance Challenge, Showstoppers, 5-6-7-8 Showtime, Flash Dance, and Dance, Dance, Dance to name a few. Ashley excelled in all aspects of her dance career, but another passion had already taken her heart. When Ashley was just eight she heard about a summer school acting program at Theatre Aquarius in Hamilton and insisted that she had to attend. Theatre became Ashley's second passion and without hesitation, she auditioned and won the coveted role in her first professional theatrical role of Marta in \"The Sound of Music\". Over the next four years, she managed to combine her school work, 30 hours a week of dancing, and continued her acting career by starring in the following plays: \"Jekyll and Hyde\", \"Jacob Two-Two Meets the Hooded Fang\", \"The Wizard of Oz\", \"Anne of Green Gables\", \"Cinderella\", and \"The Lion, The Witch and The Wardrobe\". When she was age 13, she won the role of Clara in \"The Nutcracker\". That same year, the young theatre veteran began to work in television and movies, and quickly discovered this was her third passion. Her first TV role was to star in \"Real Kids, Real Adventures\". She shone on set and there was no looking back. By the time she was just age 18, she had recurring roles on: \"I was a Sixth Grade Alien\", \"Ace Lightning\", and guest starred in \"The Zack Files\", and \"In A Heartbeat\" (Shawn Ashmore). She appeared in Disney's \"Cadet Kelly\" (Hilary Duff), \"What Girls Learn\", (Elizabeth Perkins), ABC's MOW \"The Music Man\" (Matthew Broderick), and \"A Very Married Christmas\" (Joe Mategna). Next, she hit the big screen with a lead role in \"Confessions of a Teenage Drama Queen\" (Lindsay Lohan and Megan Fox). On her 18th birthday she decided she would put her acting career on hold to attend University in pursuit of a teaching degree, but fate had other plans for her. One week after classes began, she got an offer she couldn't refuse. Ashley had won the sought after lead role of Casey in \"Life With Derek\" and she made the decision to put school on hold. The next four years were an exciting adventure, collaborating with Shaftesbury Productions on this incredibly successful show. \"Life with Derek\" was ultimately sold to Disney and shown in over 100 countries around the world, breaking records on many networks. The success of this show led to a movie called \"Vacation with Derek\"which opened to the highest ratings ever recorded by Family Channel and earned her second Gemini nomination for Best Actress. During breaks from shooting \"Life with Derek\", Ashley was a recurring character on \"Darcy's Wild Life\" (Sara Paxton), a regular on the new genre TV series \"11 Cameras\", and guest starred on \"The Latest Buzz\", \"Aaron Stone\", and \"Unnatural History\". In 2008, a rare opportunity came to this rising star's lap. She was asked to play Baby in \"Dirty Dancing\" at the Royal Alexandra Theatre in Toronto. Although she hadn't been on stage in nearly ten years, she returned with a vengeance and won critical acclaim for her dead on portrayal of Baby. Following a year back in the spotlight of the theatre, she returned to the small screen guest-starring in the popular TV show \"Murdoch Mysteries\". Ashley had a lead role in MTV's \"Made, The Movie\", the feature film \"My Dog's Christmas Miracle\" (Cynthia Gibb) and \"The Perfect Roommate\". She most recently guest starred on one of her favorite prime time shows \"Criminal Minds\". She then went on to join the popular Hallmark movie series \"The Good Witch's Charm\" and the upcoming \"The Good Witch's Destiny\". Next up, Ashley is very excited for the premiere \"The Perfect Boss\" which airs on May 24th on Lifetime. In her personal life, Ashley is heavily involved with children's hospitals, spending her spare time fundraising for McMaster Sick Kids Hospital, Toronto Sick Kids and Manitoba Hospital for Children. She is also a huge advocate for anti-bullying, and has toured across Canada to help the cause. She most enjoys spending time with her family and close friends, and her \"fur-baby\" Teacup Yorkie, Rambo -who has also had cameos in many of her TV shows and movies. As for her love life, Ashley married her long time boyfriend Jeremy Williams in August 2011. Jeremy is a successful hockey player, formerly with the Toronto Maple Leafs, Detroit Red Wings organization, and New York Rangers organization. Most recently he played in Austria and Germany, and this year he will play in Sweden, where Ashley will join him in her off time. They have a daughter together, Olivia Patricia Anne Williams (b. February 17, 2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjcxOTc2MF5BMl5BanBnXkFtZTcwNzc1NzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1430154","name":"Ashley Leggat","nicknames":["Ash"],"idIMDB":"nm1430154"},"actorId":"nm1430154","character":"Marcia","urlCharacter":"http://www.imdb.com/character/ch0171350","main":true},{"actorName":"Barbara Mamabolo","urlProfile":"http://www.imdb.com/name/nm0540980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjg2ODk5NjNeQTJeQWpwZ15BbWU4MDEzMTU1NzYx._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1986","placeOfBirth":" Thornhill, Ontario, Canada","bio":"Barbara Mamabolo was born in 1986 in Thornhill, Ontario, Canada. She is an actress, known for Journal intime d'une future star (2004), 5ive Girls (2006) and Born to Be Blue (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjg2ODk5NjNeQTJeQWpwZ15BbWU4MDEzMTU1NzYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0540980","name":"Barbara Mamabolo","idIMDB":"nm0540980"},"actorId":"nm0540980","character":"Robin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maggie Oskam","urlProfile":"http://www.imdb.com/name/nm1537931","urlPhoto":"","biography":{"dateOfBirth":"5 April 1996","placeOfBirth":" Canada","bio":"Maggie Oskam was born on April 5, 1996 in Canada. She is an actress, known for Journal intime d'une future star (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1537931","name":"Maggie Oskam","idIMDB":"nm1537931"},"actorId":"nm1537931","character":"Paige","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rachael Oskam","urlProfile":"http://www.imdb.com/name/nm1537932","urlPhoto":"","biography":{"dateOfBirth":"5 April 1996","placeOfBirth":" Canada","bio":"Rachael Oskam was born on April 5, 1996 in Canada. She is an actress, known for Journal intime d'une future star (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1537932","name":"Rachael Oskam","idIMDB":"nm1537932"},"actorId":"nm1537932","character":"Paula","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0361467","urlIMDB":"http://www.imdb.com/title/tt0361467","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$9,350,572","country":"USA","day":"22","month":"02","year":"2004","remarks":"2,503 Screens"},{"money":"£177,036","country":"UK","day":"09","month":"05","year":"2004","remarks":"227 Screens"}],"gross":[{"money":"$29,331,068","country":"USA","day":"20","month":"05","year":"2004","remarks":""},{"money":"$29,302,097","country":"USA","day":"16","month":"05","year":"2004","remarks":""},{"money":"$29,268,163","country":"USA","day":"09","month":"05","year":"2004","remarks":""},{"money":"$29,227,473","country":"USA","day":"02","month":"05","year":"2004","remarks":""},{"money":"$29,155,661","country":"USA","day":"25","month":"04","year":"2004","remarks":""},{"money":"$29,058,170","country":"USA","day":"18","month":"04","year":"2004","remarks":""},{"money":"$28,868,056","country":"USA","day":"11","month":"04","year":"2004","remarks":""},{"money":"$28,695,607","country":"USA","day":"04","month":"04","year":"2004","remarks":""},{"money":"$28,487,331","country":"USA","day":"28","month":"03","year":"2004","remarks":""},{"money":"$27,592,110","country":"USA","day":"21","month":"03","year":"2004","remarks":""},{"money":"$24,942,380","country":"USA","day":"14","month":"03","year":"2004","remarks":""},{"money":"$21,803,186","country":"USA","day":"07","month":"03","year":"2004","remarks":""},{"money":"$16,905,932","country":"USA","day":"29","month":"02","year":"2004","remarks":""},{"money":"$9,350,572","country":"USA","day":"22","month":"02","year":"2004","remarks":""},{"money":"£395,519","country":"UK","day":"30","month":"05","year":"2004","remarks":""},{"money":"£361,330","country":"UK","day":"23","month":"05","year":"2004","remarks":""},{"money":"£290,344","country":"UK","day":"16","month":"05","year":"2004","remarks":""},{"money":"£177,036","country":"UK","day":"09","month":"05","year":"2004","remarks":""},{"money":"$33,051,296 (Worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$3,720,228 (Non-USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"€298,946","country":"Netherlands","day":"22","month":"08","year":"2004","remarks":""}],"weekendGross":[{"money":"$21,742","country":"USA","day":"16","month":"05","year":"2004","remarks":"68 Screens"},{"money":"$27,187","country":"USA","day":"09","month":"05","year":"2004","remarks":"101 Screens"},{"money":"$55,951","country":"USA","day":"02","month":"05","year":"2004","remarks":"125 Screens"},{"money":"$70,799","country":"USA","day":"25","month":"04","year":"2004","remarks":"149 Screens"},{"money":"$95,156","country":"USA","day":"18","month":"04","year":"2004","remarks":"189 Screens"},{"money":"$127,269","country":"USA","day":"11","month":"04","year":"2004","remarks":"272 Screens"},{"money":"$82,219","country":"USA","day":"04","month":"04","year":"2004","remarks":"161 Screens"},{"money":"$463,722","country":"USA","day":"28","month":"03","year":"2004","remarks":"601 Screens"},{"money":"$1,560,872","country":"USA","day":"21","month":"03","year":"2004","remarks":"1,281 Screens"},{"money":"$2,472,097","country":"USA","day":"14","month":"03","year":"2004","remarks":"1,801 Screens"},{"money":"$4,045,006","country":"USA","day":"07","month":"03","year":"2004","remarks":"2,180 Screens"},{"money":"$6,346,941","country":"USA","day":"29","month":"02","year":"2004","remarks":"2,503 Screens"},{"money":"$9,350,572","country":"USA","day":"22","month":"02","year":"2004","remarks":"2,503 Screens"},{"money":"£27,785","country":"UK","day":"30","month":"05","year":"2004","remarks":"119 Screens"},{"money":"£52,173","country":"UK","day":"23","month":"05","year":"2004","remarks":"150 Screens"},{"money":"£74,605","country":"UK","day":"16","month":"05","year":"2004","remarks":"210 Screens"},{"money":"£177,036","country":"UK","day":"09","month":"05","year":"2004","remarks":"227 Screens"},{"money":"€57,109","country":"Netherlands","day":"22","month":"08","year":"2004","remarks":"39 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"06","year":"2003","remarks":null},null],"copyrightHolder":"Copyright © MMIV Argentum Film Produktion GmbH &amp; Co. Betriebs KG"},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"4.6","metascore":"33","filmingLocations":[{"location":"Birchmount Collegiate, Toronto, Ontario, Canada"}],"rated":"PG","awards":[{"award":"Teen Choice Awards 2004","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Choice Breakout Movie Star - Female","names":[{"name":"Lindsay Lohan","id":"nm0517820","role":null},{"name":"Mean Girls","id":"tt0377092","role":null},{"name":"Freaky Friday","id":"tt0322330","role":null}]}]}]}],"votes":"24,078","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0100004","name":"Confessions Productions"},{"idCompany":"co0067367","name":"Argentum Film Produktion und Betriebes KG"}],"keywords":{"keywords":["suburb","band","new york city","friend","teenager","school play","new jersey","divorced mother","teenage girl","popularity","mean girl","teenage protagonist","asking for autograph","f rated","vomiting","title directed by female","female protagonist","flip book","violet dress","showbiz","red dress","new york police department","lack of money","friendship between girls","drunkenness","musician","friendship","teen movie","teenage crush","rivalry","new girl in town","heavy rain","father daughter relationship","dancing","aspiring actress","teen angst","female bonding","single parent","school life","new kid","mother daughter relationship","fish out of water","actress","rock star","rock concert","police station","party","infatuation","high school","fantasy sequence","divorced parents","best friend","audition","animal in cast credits","alcoholic","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:10:31"}}