{"data":{"movies":[{"title":"Melinda and Melinda","originalTitle":"","year":"2004","releaseDate":"20050408","directors":[{"name":"Woody Allen","id":"nm0000095"}],"writers":[{"name":"Woody Allen","id":"nm0000095"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDM3NTEzMl5BMl5BanBnXkFtZTcwODA2MjgyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"Al, Louise, Max and Sy - four literary types who work in the theater business - are discussing what they believe to be the real life truths underlying their work, Max who writes primarily tragic plays, and Sy who writes primarily comic plays. Al proceeds to tell them a real story of a troubled woman named Melinda Robicheaux showing up unexpectedly at a door in the middle of an important business dinner party. Melinda long ago left her physician husband to embark on a relationship with who she initially believed to be the man of her dreams, which ended up not being the case. Melinda tries to put her life back together with the help of select people at the dinner party, some who have their own ulterior motives. Melinda's appearance also opens up the cracks existing in the marriage of one of the couples at the dinner party, while it leads to the dissolution of a friendship that has existed since college. With this basic outline of a story, Max and Sy try to make their point of life being...","simplePlot":"Two alternating stories, one comedy and the other tragedy, about Melinda's attempts to straighten out her life.","actors":[{"actorName":"Wallace Shawn","urlProfile":"http://www.imdb.com/name/nm0001728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1943","placeOfBirth":" New York City, New York, USA","birthName":"Wallace Michael Shawn","height":"5' 2\" (1.57 m)","bio":"American character actor and writer Wallace Shawn has one of those fun, mischievously homely faces just made to entertain. Though he got out of the starting gate rather slowly, he has since excelled on stage, television and film while managing to turn himself into a winner with his loser-type looks. Woody Allen's character in the movie Manhattan (1979) amusingly describes Wallace's character as \"a homunculus\", which is a pretty fair description of this predominantly bald, wan, pucker-mouthed, butterball-framed, slightly lisping gent. Wallace made his movie debut in Allen's heralded classic playing Diane Keaton's ex-husband. Born to privilege on November 12, 1943 in New York City, Wallace was the son of renowned editor William Shawn of \"The New Yorker\" fame and educated at both Harvard University, where he studied history, and Magdalen College, Oxford. Wallace initially taught English in India on a Fulbright scholarship, and then English, Latin and drama back in New York. However, a keen interest in writing and acting soon compelled him to leave his cushy position and pursue a stage career as both playwright and actor. During his distinguished career, Wallace turned out several plays. \"Our Late Night\", the first of his works to be performed, was awarded an off-Broadway Obie in 1975. \"A Thought in Three Parts\" (1976); \"The Mandrake\" (1977), which he translated from the original Italian and in which he made his acting debut; \"Marie and Bruce\" (1979); \"Aunt Dan and Lemon\" (1985) and \"The Fever\", for which he received his second Obie Award for \"Best New Play\" during the 1990-91 season, then followed. A popular support player in both comedy and occasional drama, his assorted kooks, creeps, eggheads and schmucks possessed both endearing and unappetizing qualities. He earned some of his best early notices partnered with theatre director/actor Andre Gregory in the unique Louis Malle-directed film My Dinner with Andre (1981). Shawn co-wrote the improvisatory, humanistic piece and his brother, Allen Shawn, was the composer. Shawn and Gregory would collaborate again for Malle in another superb, original-concept film Vanya on 42nd Street (1994). Among the quality offbeat filming involving has been Bruce Paltrow's A Little Sex (1982); James Ivory's The Bostonians (1984); Stephen Frears' Prick Up Your Ears (1987); Rob Reiner's The Princess Bride (1987); Alan Rudolph's The Moderns (1988) and Mrs. Parker and the Vicious Circle (1994); Paul Bartel's Scenes from the Class Struggle in Beverly Hills (1989); and several others for Woody Allen: Radio Days (1987), Shadows and Fog (1991), The Curse of the Jade Scorpion (2001) and Melinda and Melinda (2004). Of late, he has lent his vocal talents to a considerable number of animated pictures including A Goofy Movie (1995), Toy Story (1995) (and its sequel), The Jungle Book: Mowgli's Story (1998), The Incredibles (2004), Chicken Little (2005) and Happily N'Ever After (2006). Over the decades, Shawn has scurried about effortlessly in a number of television guest appearances including Taxi (1978), Homicide: Life on the Street (1993), Ally McBeal (1997), Law & Order: Criminal Intent (2001) and Desperate Housewives (2004), and has drummed up a few recurring roles for himself in the process, including The Cosby Show (1984), Murphy Brown (1988), Star Trek: Deep Space Nine (1993) and Crossing Jordan (2001). In the series Clueless (1996), based on the highly successful of the same name Clueless (1995), Shawn revisited his role as the owlish high school teacher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001728","name":"Wallace Shawn","idIMDB":"nm0001728"},"actorId":"nm0001728","character":"Sy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil Pepe","urlProfile":"http://www.imdb.com/name/nm0672495","urlPhoto":"","biography":{"dateOfBirth":"23 June 1963","placeOfBirth":" Bloomington, Indiana, USA","bio":"Neil Pepe was born on June 23, 1963 in Bloomington, Indiana, USA. He is an actor, known for Melinda and Melinda (2004), Analyze This (1999) and Magnolia (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0672495","name":"Neil Pepe","idIMDB":"nm0672495"},"actorId":"nm0672495","character":"Al","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephanie Roth Haberle","urlProfile":"http://www.imdb.com/name/nm0745029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNzU2MDAyMV5BMl5BanBnXkFtZTgwNzQxNzQwMzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1963","placeOfBirth":" Boston, Massachusetts, USA","bio":"Stephanie Roth Haberle was born on January 7, 1963 in Boston, Massachusetts, USA. She is an actress, known for Philadelphia (1993), Crimes and Misdemeanors (1989) and Deconstructing Harry (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNzU2MDAyMV5BMl5BanBnXkFtZTgwNzQxNzQwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745029","name":"Stephanie Roth Haberle","idIMDB":"nm0745029"},"actorId":"nm0745029","character":"Louise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Pine","urlProfile":"http://www.imdb.com/name/nm0683978","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NzY3MzE4MF5BMl5BanBnXkFtZTYwMjI1MDE0._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1945","placeOfBirth":" Tucson, Arizona, USA","bio":"Larry Pine was born on March 3, 1945 in Tucson, Arizona, USA. He is an actor, known for The Grand Budapest Hotel (2014), One Life to Live (1968) and Moonrise Kingdom (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NzY3MzE4MF5BMl5BanBnXkFtZTYwMjI1MDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0683978","name":"Larry Pine","idIMDB":"nm0683978"},"actorId":"nm0683978","character":"Max","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Radha Mitchell","urlProfile":"http://www.imdb.com/name/nm0593664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1973","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Radha Rani Amber Indigo Anunda Mitchell","height":"5' 5¾\" (1.67 m)","bio":"Radha Mitchell (born 12 November 1973) is an Australian actress. She started her career acting in various Australian TV series and movies, and later became known for her appearance in Hollywood films. Mitchell, a native of Melbourne, began acting when she was still in high school and had her professional debut on the popular Australian soap, Les voisins (1985) in 1994. Two years later, she made her film debut in the romantic comedy Love and Other Catastrophes (1996), in which she starred as a college student experiencing a messy breakup. The film proved to be fairly popular in Australia, but it wasn't until she was cast in High Art (1998) that Mitchell gained an introduction to a wider audience. The critical success of \"High Art\" made it possible for her to do more international work, and her increasing popularity was reflected by her subsequent casting in a number of projects. Among them were Pitch Black (2000), a sci-fi horror film in which Mitchell played a pilot whose ship crashes on a hostile planet, and Everything Put Together (2000), a drama where she plays a suburban woman shunned by her peers after the death of her baby. Her career continued with a diverse run of films, including Nobody's Baby (2001), Man on Fire (2004), Finding Neverland (2004), and landing the lead in Woody Allen's Melinda and Melinda (2004). Those last three films all hit the screens in 2004, and although kept working steadily, she never quite capitalized on the buzz she generated that year. Her other credits include Silent Hill (2006), Henry Poole Is Here (2008), Surrogates (2009) and The Crazies (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593664","name":"Radha Mitchell","idIMDB":"nm0593664"},"actorId":"nm0593664","character":"Melinda Robicheaux","urlCharacter":"http://www.imdb.com/character/ch0017404","main":true},{"actorName":"Michael J. Farina","urlProfile":"http://www.imdb.com/name/nm1716813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTk0NDA0NV5BMl5BanBnXkFtZTcwNTE3MTgyMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Michael J. Farina is an actor, known for Melinda and Melinda (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTk0NDA0NV5BMl5BanBnXkFtZTcwNTE3MTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1716813","name":"Michael J. Farina","idIMDB":"nm1716813"},"actorId":"nm1716813","character":"Man with Dog","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonny Lee Miller","urlProfile":"http://www.imdb.com/name/nm0001538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMjc0NTA2M15BMl5BanBnXkFtZTcwMTA4MzQ2OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1972","placeOfBirth":" Kingston upon Thames, Surrey, England, UK","birthName":"Jonathan Lee Miller","height":"5' 9¾\" (1.77 m)","bio":"Jonny Lee Miller (sometimes credited with an H) was born on November 15, 1972, in Kingston, England, UK, to actors Anna Lee and Alan Miller, and the grandson of actor Bernard Lee. After appearing in many high school plays at his selective state grammar school, Johnny dropped out at 17, to pursue acting full time. Although he was reportedly quiet and shy in high school, he certainly expresses himself well in all his films. His very first popular film was Hackers (1995), alongside Angelina Jolie and Matthew Lillard. Later his co-star Angelina became his wife. They were divorced 4 years later. Interesting fact is that his entire family is well into acting, all the way back to his grandparents. He has a partnership in the production company, Natural Nylon, which also includes Ewan McGregor and Jude Law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMjc0NTA2M15BMl5BanBnXkFtZTcwMTA4MzQ2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001538","name":"Jonny Lee Miller","idIMDB":"nm0001538"},"actorId":"nm0001538","character":"Lee","urlCharacter":"http://www.imdb.com/character/ch0400707","main":true},{"actorName":"Chloë Sevigny","urlProfile":"http://www.imdb.com/name/nm0001721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3ODUwMTc1NDFeQTJeQWpwZ15BbWU4MDk1MjE2Nzkx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1974","placeOfBirth":" Springfield, Massachusetts, USA","birthName":"Chloë Stevens Sevigny","height":"5' 8\" (1.73 m)","bio":"Known in the mid to late nineties for her status as a fashion impresario and \"it girl,\" with over a dozen art house films to her credit, Chloe Sevigny also stands out as one of the most prominent queens of contemporary independent cinema. Originally hailing from Darien, Connecticut, Sevigny attributes weekend trips into nearby New York City in her teens as an important early saving grace from her super rich and stuffy hometown. It was on one such trip at the age of eighteen, that Sevigny was spotted on the street by a fashion editor for Sassy magazine. Impressed by her flair for street fashion, the editors of the progressive teen mag asked Sevigny to intern in their offices which led to a few modeling jobs with both Sassy and x-girl, the urban clothing line created by Sonic Youth front woman Kim Gordon. At this time Sevigny also spent a lot of her time watching the skateboarders who convened in New York's Tompkins square park. It was here that she met young aspiring director Harmony Korine, and a friendship ensued, resulting in her being cast as the lead in Korine and Larry Clark's collaboration Kids (1995). At around the same time Sevigny snagged the cover of Interview magazine, and even inspired writer Jay McInerney to write a piece about her for The New Yorker in which he hailed her the new \"it girl.\" The late nineties saw Sevigny continuing her acting career with a string of independent films, among them Trees Lounge (1996), Palmetto (1998), and Whit Stillman's homage to early 80s yuppiedom The Last Days of Disco (1998). In 1997 Sevigny and Korine teamed up again to make Gummo (1997), in which Sevigny both starred and acted as chief costume designer. It was in 2000 however that Sevigny's career made a turn towards more mainstream recognition when her portrayal of Lana Tisdel in Boys Don't Cry (1999) garnered her an Oscar nod at the age of twenty-five. Known for signing on to projects based on her interest in a good script rather than a hefty price tag, one of Sevigny's most recent roles, making the climb from indie princess to A list actress, should see her surprising both audiences and Hollywood alike with roles in interesting and thoughtful projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3ODUwMTc1NDFeQTJeQWpwZ15BbWU4MDk1MjE2Nzkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001721","name":"Chloë Sevigny","idIMDB":"nm0001721"},"actorId":"nm0001721","character":"Laurel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Servitto","urlProfile":"http://www.imdb.com/name/nm0785854","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njk1NDM3NF5BMl5BanBnXkFtZTcwMzI0MzIzMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1965","placeOfBirth":" Teaneck, New Jersey, USA","birthName":"Matthew Joseph Servitto","bio":"Matt Servitto was born on April 7, 1965 in Teaneck, New Jersey, USA as Matthew Joseph Servitto. He is an actor and writer, known for The Sopranos (1999), Banshee (2013) and Brotherhood (2006). He has been married to Anne Lauterbach since September 15, 2001. He was previously married to Charissa Marie Sgouros.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Njk1NDM3NF5BMl5BanBnXkFtZTcwMzI0MzIzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785854","name":"Matt Servitto","idIMDB":"nm0785854"},"actorId":"nm0785854","character":"Jack Oliver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arija Bareikis","urlProfile":"http://www.imdb.com/name/nm0054397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjUwMDgzNF5BMl5BanBnXkFtZTYwNjQ0MzYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1966","placeOfBirth":" Bloomington, Indiana, USA","birthName":"Arija Allison Bareikis","bio":"Arija Bareikis was born on 21 July 1966 in Bloomington, Indiana. She attended Bloomington High School South from 1980-1984. After graduating from Stanford University in 1988, she moved to Southern California to take care of horses for a brief period of time. Next, Arija moved to New York City first working as a paralegal while contemplating which direction to take her life in. Originally, she had dreamed of becoming a dancer, which has been reflected in some of her roles on the stage. She eventually decided to become an actress, so she took acting lessons in New York in her free time and then migrated into recurring soap opera roles. She has appeared in stage plays, TV shows and numerous movies such as Deuce Bigalow: Male Gigolo (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjUwMDgzNF5BMl5BanBnXkFtZTYwNjQ0MzYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0054397","name":"Arija Bareikis","idIMDB":"nm0054397"},"actorId":"nm0054397","character":"Sally Oliver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brooke Smith","urlProfile":"http://www.imdb.com/name/nm0807548","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODM3MjgyMF5BMl5BanBnXkFtZTgwMjQ4OTIxNDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1967","placeOfBirth":" New York City, New York, USA","height":"5' 9¼\" (1.76 m)","bio":"Brooke Smith grew up in New York in the shadow of show business owing to the fact that she is the daughter of powerful publicist Lois Smith. After studying at the American Academy of Dramatic Arts, her \"first big thing\" was playing Catherine Martin, the abducted young girl in The Silence of the Lambs (1991). She went on to play Sonya in Louis Malle's Vanya on 42nd Street (1994) and Dawn in Daniel Minahan's brutal sendup of reality television Series 7: The Contenders (2001). Whether she is humming a Tom Petty tune, as her character did in \"Lambs,\" or screaming for a bean dip, as her pregnant character does in \"Series 7,\" Smith is known for giving brooding, detailed performances. In addition to stage work, her other interests include filmmaking (she has directed a short film and a feature-length documentary), journalism (she has published interviews with actors Steve Buscemi, Ed Harris, and Fred Ward), and travel (she has traveled extensively, especially to Africa).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODM3MjgyMF5BMl5BanBnXkFtZTgwMjQ4OTIxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807548","name":"Brooke Smith","idIMDB":"nm0807548"},"actorId":"nm0807548","character":"Cassie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zak Orth","urlProfile":"http://www.imdb.com/name/nm0651008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzMxMzkwN15BMl5BanBnXkFtZTcwOTY3MjI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1970","placeOfBirth":" Libertyville, Illinois, USA","birthName":"Adam Zakary Orth","height":"6' 1\" (1.85 m)","bio":"Zak Orth was born on October 15, 1970 in Libertyville, Illinois, USA as Adam Zakary Orth. He is an actor, known for Wet Hot American Summer (2001), Revolution (2012) and Casual (2015). He has been married to Kat Schaufelberger since 2010. He was previously married to Heidi Neurauter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzMxMzkwN15BMl5BanBnXkFtZTcwOTY3MjI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651008","name":"Zak Orth","idIMDB":"nm0651008"},"actorId":"nm0651008","character":"Peter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Ferrell","urlProfile":"http://www.imdb.com/name/nm0002071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1967","placeOfBirth":" Irvine, California, USA","birthName":"John William Ferrell","height":"6' 3\" (1.91 m)","bio":"John William Ferrell was born in Irvine, California, to Betty Kay (Overman), a teacher, and Roy Lee Ferrell, Jr., a musician. His parents were both originally from Roanoke Rapids, North Carolina. A graduate of the University of Southern California, Ferrell became interested in performing while a student at University High School in Irvine, where he made his school's daily morning announcements over the public address system in disguised voices. He started as a member of the Los Angeles comedy/improvisation group The Groundlings, where fellow cast members Ana Gasteyer, Maya Rudolph and former Saturday Night Live (1975) repertory players such as Laraine Newman, Jon Lovitz and Phil Hartman began their careers. It was there he met Chris Kattan and the two became good friends and both went on to Saturday Night Live (1975) later. He has also appeared on several television programs, including Strangers with Candy (1999), Grace Under Fire (1993) and Living Single (1993) during his time at The Groundlings. Will also lent his voice to the armless and legless dad of cartoon family \"The Oblongs\". In 1995 he became a feature cast member at Saturday Night Live (1975) during the show's rapid re-casting. He was declared quite possibly the worst cast member ever during his first season. However, his talents of impersonations and range of characters shot him forward to making him arguably the greatest Saturday Night Live (1975) cast member ever. During his seven year run he is one of the few cast members to ever be nominated for an Emmy for a performance and played George W. Bush during the 2000 elections. He's appeared in every Saturday Night Live (1975) movie since his premiere on the show in 1995. In 2002 he left Saturday Night Live (1975) and was the only cast member to ever receive a farewell from all the current cast members at the end of the season finale show. Since leaving the show Will has pursued a career in films. In 2000 he married and now lives in L.A.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002071","name":"Will Ferrell","nicknames":["Wilf"],"idIMDB":"nm0002071"},"actorId":"nm0002071","character":"Hobie","urlCharacter":"http://www.imdb.com/character/ch0017403","main":true},{"actorName":"Andy Borowitz","urlProfile":"http://www.imdb.com/name/nm0097273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNTIwODgyOV5BMl5BanBnXkFtZTYwNDY5NDAz._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1958","placeOfBirth":" Cleveland, Ohio, USA","bio":"Andy Borowitz was born on January 4, 1958 in Cleveland, Ohio, USA. He is known for his work on The Fresh Prince of Bel-Air (1990), Day by Day (1988) and Dreams (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNTIwODgyOV5BMl5BanBnXkFtZTYwNDY5NDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0097273","name":"Andy Borowitz","idIMDB":"nm0097273"},"actorId":"nm0097273","character":"Doug","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amanda Peet","urlProfile":"http://www.imdb.com/name/nm0001605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Nzk0NjgxN15BMl5BanBnXkFtZTcwMzI3NDE1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1972","placeOfBirth":" New York City, New York, USA","height":"5' 6½\" (1.69 m)","bio":"Amanda Peet was born and raised in New York City. She is the daughter of Penny (Levy), a social worker, and Charles Peet, a lawyer, and has an older sister. Her father was of mostly English and German ancestry, and her mother was from a Jewish family (from Germany, Russia, and Hungary). Peet's great-grandfathers were politician Samuel Levy and showbiz impresario S.L. Rothafel. Peet made an unconventional stage debut at the age of three, when she jumped onto the stage during a play. Yet, despite this early start, she later studied acting more as a hobby than anything else. She studied history at Columbia University, where a drama professor convinced her to audition for acting teacher Uta Hagen, with whom she later went on to study for a four-year period. During this time, she participated in the off-Broadway revival of Clifford Odets's \"Awake and Sing.\" She supported herself during the audition phase of her career by working as a waitress and with the residual checks she received from a Skittles candy commercial. Perseverance and hard work paid off, and, in 1995, she was cast in a guest-starring role on the hit series Law & Order (1990). Her feature film debut came in 1995 with the movie Animal Room (1995). For a while afterward, Amanda continued to find steady work but also found herself appearing in a depressingly large number of indie films that were never picked up for distribution. She did, however, meet her boyfriend Brian Van Holt on the set of indie movie Whipped (2000). Her turn as the ditzy hit-woman with the heart of gold in the hit comedy The Whole Nine Yards (2000), opposite Bruce Willis, took her from supporting role status to leading lady. That same year she was voted one of the 50 Most Beautiful People in the World by \"People\" Magazine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Nzk0NjgxN15BMl5BanBnXkFtZTcwMzI3NDE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001605","name":"Amanda Peet","idIMDB":"nm0001605"},"actorId":"nm0001605","character":"Susan","urlCharacter":"http://www.imdb.com/character/ch0037312","main":true}],"seasons":[],"idIMDB":"tt0378947","urlIMDB":"http://www.imdb.com/title/tt0378947","business":{"budget":null,"openingWeekend":[{"money":"$74,238","country":"USA","day":"20","month":"03","year":"2005","remarks":"1 Screen"},{"money":"£129,257","country":"UK","day":"27","month":"03","year":"2005","remarks":"53 Screens"},{"money":"€210,782","country":"Italy","day":"26","month":"12","year":"2004","remarks":"68 Screens"},{"money":"€769,112","country":"Spain","day":"31","month":"10","year":"2004","remarks":"156 Screens"}],"gross":[{"money":"$3,825,351","country":"USA","day":"19","month":"06","year":"2005","remarks":""},{"money":"$3,820,826","country":"USA","day":"12","month":"06","year":"2005","remarks":""},{"money":"$3,810,607","country":"USA","day":"05","month":"06","year":"2005","remarks":""},{"money":"$3,770,730","country":"USA","day":"22","month":"05","year":"2005","remarks":""},{"money":"$3,727,614","country":"USA","day":"15","month":"05","year":"2005","remarks":""},{"money":"$3,660,377","country":"USA","day":"08","month":"05","year":"2005","remarks":""},{"money":"$3,559,517","country":"USA","day":"01","month":"05","year":"2005","remarks":""},{"money":"$3,373,364","country":"USA","day":"24","month":"04","year":"2005","remarks":""},{"money":"$3,036,583","country":"USA","day":"17","month":"04","year":"2005","remarks":""},{"money":"$2,450,648","country":"USA","day":"10","month":"04","year":"2005","remarks":""},{"money":"$1,767,602","country":"USA","day":"03","month":"04","year":"2005","remarks":""},{"money":"$989,814","country":"USA","day":"27","month":"03","year":"2005","remarks":""},{"money":"$74,238","country":"USA","day":"20","month":"03","year":"2005","remarks":""},{"money":"£330,741","country":"UK","day":"03","month":"04","year":"2005","remarks":""},{"money":"£129,257","country":"UK","day":"27","month":"03","year":"2005","remarks":""},{"money":"€1,444,214","country":"Italy","day":"30","month":"01","year":"2005","remarks":""},{"money":"€1,392,204","country":"Italy","day":"23","month":"01","year":"2005","remarks":""},{"money":"€1,279,417","country":"Italy","day":"16","month":"01","year":"2005","remarks":""},{"money":"€1,062,598","country":"Italy","day":"09","month":"01","year":"2005","remarks":""},{"money":"€667,944","country":"Italy","day":"02","month":"01","year":"2005","remarks":""},{"money":"€211,615","country":"Italy","day":"26","month":"12","year":"2004","remarks":""},{"money":"€246,079","country":"Italy","day":"26","month":"12","year":"2004","remarks":""},{"money":"€3,246,907","country":"Spain","day":"19","month":"12","year":"2004","remarks":""},{"money":"€2,449,337","country":"Spain","day":"14","month":"11","year":"2004","remarks":""},{"money":"€1,803,506","country":"Spain","day":"07","month":"11","year":"2004","remarks":""}],"weekendGross":[{"money":"$2,484","country":"USA","day":"19","month":"06","year":"2005","remarks":"10 Screens"},{"money":"$6,787","country":"USA","day":"12","month":"06","year":"2005","remarks":"12 Screens"},{"money":"$7,339","country":"USA","day":"05","month":"06","year":"2005","remarks":"18 Screens"},{"money":"$22,588","country":"USA","day":"22","month":"05","year":"2005","remarks":"41 Screens"},{"money":"$41,481","country":"USA","day":"15","month":"05","year":"2005","remarks":"58 Screens"},{"money":"$60,794","country":"USA","day":"08","month":"05","year":"2005","remarks":"76 Screens"},{"money":"$101,111","country":"USA","day":"01","month":"05","year":"2005","remarks":"101 Screens"},{"money":"$195,317","country":"USA","day":"24","month":"04","year":"2005","remarks":"204 Screens"},{"money":"$407,254","country":"USA","day":"17","month":"04","year":"2005","remarks":"297 Screens"},{"money":"$520,502","country":"USA","day":"10","month":"04","year":"2005","remarks":"294 Screens"},{"money":"$558,707","country":"USA","day":"03","month":"04","year":"2005","remarks":"197 Screens"},{"money":"$740,619","country":"USA","day":"27","month":"03","year":"2005","remarks":"95 Screens"},{"money":"$74,238","country":"USA","day":"20","month":"03","year":"2005","remarks":"1 Screen"},{"money":"£93,835","country":"UK","day":"03","month":"04","year":"2005","remarks":"55 Screens"},{"money":"£129,257","country":"UK","day":"27","month":"03","year":"2005","remarks":"53 Screens"},{"money":"€29,956","country":"Italy","day":"30","month":"01","year":"2005","remarks":"22 Screens"},{"money":"€61,213","country":"Italy","day":"23","month":"01","year":"2005","remarks":"41 Screens"},{"money":"€147,395","country":"Italy","day":"16","month":"01","year":"2005","remarks":"81 Screens"},{"money":"€178,658","country":"Italy","day":"09","month":"01","year":"2005","remarks":"83 Screens"},{"money":"€255,826","country":"Italy","day":"02","month":"01","year":"2005","remarks":"97 Screens"},{"money":"€406,818","country":"Spain","day":"14","month":"11","year":"2004","remarks":"157 Screens"},{"money":"€596,366","country":"Spain","day":"07","month":"11","year":"2004","remarks":"157 Screens"}],"admissions":[{"money":"2,195","country":"Norway","day":"30","month":"12","year":"2004","remarks":""},{"money":"629,878","country":"Spain","day":"19","month":"12","year":"2004","remarks":""},{"money":"344,846","country":"Spain","day":"07","month":"11","year":"2004","remarks":""},{"money":"144,895","country":"Spain","day":"31","month":"10","year":"2004","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"09","year":"2003","remarks":null},null],"copyrightHolder":"2004 Twentieth Century Fox Film Corporation in all territories except Brazil, Italy, Korea, Japan and Spain"},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Dolby Digital (Mono)"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe (color and prints)"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision2 500T 5218, Vision Expression 500T 5284)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.5","metascore":"54","filmingLocations":[{"location":"Central Park, Manhattan, New York City, New York, USA"}],"rated":"PG-13","awards":[],"votes":"27,985","type":"Movie","companyCreditsSimple":[{"idCompany":"co0028932","name":"Fox Searchlight Pictures"},{"idCompany":"co0044777","name":"Gravier Productions"},{"idCompany":"co0307422","name":"LF Hungary Film Rights Exploitation"}],"keywords":{"keywords":["dinner party","party","actor","restaurant","filmmaker","female filmmaker as a character","female director as a chaacter","f rated","three word title","disco","reference to bela bartok","flirtation","reference to raphael","reference to ernest hemingway","reference to shakespeare's othello","reference to gustav mahler","racetrack","overdose","reference to igor stravinsky","attempted suicide","pregnant woman","central park","reference to madame bovary","alcoholic","reference to pandora's box","baseball bat","liberal","reference to anton chekhov","scotch","premeditated murder","recording studio","political conservatism","reference to king lear","reference to pollyanna","basketball court","jump cut","reference to august strindberg","death of wife","interracial romance","reference to cole porter","parallel narrative","repetition in title","female protagonist","affair","adultery","bistro","musician","recording session","pills","hospital","big game hunter","trampoline","dentist","barcelona spain","composer","pianist","matchmaking","vodka","bra","cheating","dysfunctional marriage","dating","horse racing","cafe","movie camera","suicide attempt","stage play","making a film","flashback","conversation","bus ride","multiple roles","actress playing multiple roles","new york city","small talk","pregnancy","marriage problems","extramarital affair","alcoholism","interracial relationship","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:14:17"}}