{"data":{"movies":[{"title":"LD 50 Lethal Dose","originalTitle":"","year":"2003","releaseDate":"20031127","directors":[{"name":"Simon De Selva","id":"nm0211529"}],"writers":[{"name":"Matthew McGuchan","id":"nm0570079"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1NTk4NzIxNF5BMl5BanBnXkFtZTcwMzU2OTcyMQ@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Horror"],"plot":"Re-formed by a coded message to their web site, a group of animal rights activists set off to free an imprisoned colleague from a terrifying ordeal. Their rescue mission leads them to a disused lab, but what should have been a simple raid turns into a series of twisted and mind bending incidents where the free and the caged switch places, in this tormented psychological horror.","simplePlot":"Re-formed by a coded message to their web site, a group of animal rights activists set off to free an imprisoned colleague from a terrifying ordeal. Their rescue mission leads them to a ... ","actors":[{"actorName":"Katharine Towne","urlProfile":"http://www.imdb.com/name/nm0870007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODQwNTAzMl5BMl5BanBnXkFtZTcwNjM5OTQ0Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1978","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Katharine Payne Towne","height":"5' 7\" (1.7 m)","bio":"Katharine Towne was born on July 17, 1978 in Hollywood, Los Angeles, California, USA as Katharine Payne Towne. She is an actress, known for What Lies Beneath (2000), Mulholland Drive (2001) and Evolution (2001). She was previously married to Charlie Hunnam.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODQwNTAzMl5BMl5BanBnXkFtZTcwNjM5OTQ0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0870007","name":"Katharine Towne","nicknames":["Skip","Kate"],"idIMDB":"nm0870007"},"actorId":"nm0870007","character":"Helen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melanie Brown","urlProfile":"http://www.imdb.com/name/nm0114256","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQ4NDgxOF5BMl5BanBnXkFtZTYwMDgwNjQ0._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1975","placeOfBirth":" Leeds, West Yorkshire, England, UK","birthName":"Melanie Janine Brown","height":"5' 5\" (1.65 m)","bio":"Born on the 29th May 1975 in Leeds, England, Melanie Brown became a member of Spice Girls in 1994. Their three albums sold than 40 million copies worldwide and they had nine singles at number 1 in the UK. \"Hot\" was her first solo album, released on 9th October 2000. It entered the UK charts at #28. Despite producing 2 Top 5 singles (3, if you include the hit \"I Want You Back\"), the album only ever re-entered the chart once after dropping out of the Top 100 - peaking at #95 when \"Feels So Good\" was being promoted in February 2001. To date, the album has sold about 50,000 copies in the UK. The album sold 8,000 copies in its first week. After she parted with Virgin Records, she started a new successful career as TV presenter and actress. In 2001, her own show This Is My Moment (2001) was a great success and, after the second series, she made a documentary about Africans voodoos. In 2002, she was one of the protagonists of the BBC3's sit-com Burn It (2003) and made her theater debut with \"The Vagina Monologues\" in London. She has a lead role in two upcoming movies: the horror LD 50 Lethal Dose (2003) and the comedy The Seat Filler (2004) (with Kelly Rowland of Destiny's Child). From April to September 2004, she played the role of \"Mimi\" in the famous musical \"Rent\" on Broadway. In 2005, Melanie released her second solo album, \"L.A. State Of Mind\", featuring the single \"Today\". Both the single and the album flopped...","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQ4NDgxOF5BMl5BanBnXkFtZTYwMDgwNjQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114256","name":"Melanie Brown","nicknames":["Scary Spice","Mel B"],"idIMDB":"nm0114256"},"actorId":"nm0114256","character":"Louise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Hardy","urlProfile":"http://www.imdb.com/name/nm0362766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1977","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Edward Thomas Hardy","height":"5' 9\" (1.75 m)","bio":"With his breakthrough performance as Eames in Christopher Nolan's science fiction thriller Inception (2010), English actor Tom Hardy has been brought to the attention of mainstream audiences worldwide. However, the versatile actor has been steadily working on both stage and screen since his television debut in the miniseries Band of Brothers (2001). After being cast in the World War II drama, Hardy left his studies at the prestigious Drama Centre in London and was subsequently cast as Twombly in Ridley Scott's Black Hawk Down (2001) and as the villain Shinzon in Star Trek: Nemesis (2002). Tom was born on September 15, 1977 in Hammersmith, London; his mother, Elizabeth Anne (Barrett), is an artist and painter, and his father, Edward Hardy, is a writer. He is of English and Irish descent. Hardy was brought up in East Sheen, London, and first studied at Reed's School. His education continued at Tower House School, then at Richmond Drama School, and subsequently at the Drama Centre London, along with fellow Oscar nominee Michael Fassbender. After winning a modeling competition at age 21, he had a brief contract with the agency Models One. Tom spent his teens and early twenties battling delinquency, alcoholism and drug addiction; after completing his work on Star Trek: Nemesis (2002), he sought treatment and has also admitted that his battles with addiction ended his 5-year marriage to Rachael Speed. Returning to work in 2003, Hardy was awarded the Evening Standard Most Promising Newcomer Award for his theatre performances in the productions of \"In Arabia, We'd All Be Kings\" and \"Blood\". In 2003, Tom also co-starred in the play \"The Modernists\" with Paul Popplewell, Jesse Spencer and Orlando Wells. During the next five years, Hardy worked consistently in film, television and theatre, playing roles as varied as Robert Dudley in the BBC's The Virgin Queen (2005), Bill Sikes in Oliver Twist (2007) and starring in \"The Man of Mode\" at the National Theatre. On the silver screen, he appeared in the crime thriller Layer Cake (2004) with Daniel Craig, Sofia Coppola's Marie Antoinette (2006), and the romp Scenes of a Sexual Nature (2006). In 2006, Hardy created \"Shotgun\", an underground theatre company along with director Robert Delamere, and directed a play, penned by his father for the company, called \"Blue on Blue\". In 2007, Hardy received a best actor BAFTA nomination for his touching performance as Stuart Shorter in the BBC adaptation of Alexander Masters' bestselling biography Stuart: A Life Backwards (2007). Hardy, hailed for his transformative character acting, was lauded for his emotionally and physically convincing portrayal in the ill-fated and warmhearted tale of Shorter, a homeless and occasionally violent man suffering from addiction and muscular dystrophy. The following year, he appeared as gay hoodlum Handsome Bob in the Guy Ritchie film RocknRolla (2008), but this would be his next transformation that would prove his extensive range and stun critics. In the film Bronson (2008), Hardy played the notorious Charles Bronson (given name, Michael Peterson), the \"most violent prisoner in Britain\". Bald, pumped-up, and outfitted with Bronson's signature strongman mustache, Hardy is unrecognizable and gives a harrowing performance that is physically fearless and psychologically unsettling. Director Nicolas Winding Refn breaks the fourth wall with Hardy retelling his tales directly to viewers as well as performing them outright before an audience of his own imagining. The performance mixes terrifying brutality, vaudevillian showmanship, wry humor, and an alarming amount of commitment, and won Hardy a British Independent Film Award for Best Actor. The performance got Hollywood's attention, and in 2009, Hardy was named one of Variety's \"10 Actors to Watch\". That year, he continued to garner praise for his starring role in The Take (2009), a four-part adaptation of Martina Cole's bestselling crime novel, as well as for his performance as Heathcliff in a version of Wuthering Heights (2009). Recent work includes the aforementioned breakthrough appearance in Inception (2010) alongside Leonardo DiCaprio, Joseph Gordon-Levitt, Cillian Murphy, Tom Berenger, Ken Watanabe, Michael Caine, Marion Cotillard and Ellen Page. The movie was released in July 2010 and became one of top 25 highest grossing films of all time, collecting eight Oscar nominations (including Best Picture) and winning four. Other films include Warrior (2011), opposite Joel Edgerton, the story of two estranged brothers facing the fight of a lifetime from director Gavin O'Connor, and This Means War (2012), directed by McG and co-starring Reese Witherspoon and Chris Pine. Tom also starred in the heralded Cold War thriller, La taupe (2011) with Colin Firth and Gary Oldman. Hardy rejoined Christopher Nolan for The Dark Knight Rises (2012); he played the villain role of Bane opposite Christian Bale, Anne Hathaway, Joseph Gordon-Levitt and Gary Oldman. Hardy's menacing physique and his character's scrambled, hard-to-distinguish voice became a major discussion point as the film was released. Outside of performing, Hardy is the patron for the charity \"Flack\", which is an organization to aid the recovery of the homeless in Cambridge. And in 2010, Hardy was named an Ambassador for The Prince's Trust, which helps disadvantaged youth. On the recent stage, he starred in the Brett C. Leonard play \"The Long Red Road\" in early 2010. Written for Hardy and directed by Philip Seymour Hoffman, the play was staged at Chicago's Goodman Theater. In 2015, Hardy starred as the iconic Mad Max in George Miller's reboot of his franchise, Mad Max: Fury Road (2015). He also collected a British Independent Film Award for his portrayal of both the Kray twins, Ronnie and Reggie, in Legend (2015), and an Oscar nomination for Best Supporting Actor for his role as John Fitzgerald in The Revenant (2015). He has an outlaw biker story among other projects in development. In 2010, Hardy became engaged to fellow English actress Charlotte Riley, whom he starred with in The Take (2009) and Wuthering Heights (2009), and is raising a young son, Louis, with ex-girlfriend Rachael Speed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362766","name":"Tom Hardy","idIMDB":"nm0362766"},"actorId":"nm0362766","character":"Matt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ross McCall","urlProfile":"http://www.imdb.com/name/nm0564680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODYxMTgwOF5BMl5BanBnXkFtZTcwNDQ4NzU2Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1976","placeOfBirth":" Port Glasgow, Scotland, UK","height":"5' 9\" (1.75 m)","bio":"Born in Port Glasgow, Scotland, McCall started his career in West End productions of Oliver, Les Miserables, The King and I, and Neil Simon's Lost in Yonkers. He then ventured into film and television, working opposite, among others, Bob Hoskins, Michael Caine, Jeremy Irons, and the rock group, Queen, playing Freddie Mercury in their MTV video, The Miracle. After many years with the BBC on various productions, he landed the role of Liebgott in Band of Brothers for HBO. This led to him coming to the US to work once more with Tom Hanks in the Robert Zemeckis film, The Polar Express. He began to star in various U.S. television shows, allowing him to move to the US full time. After starring alongside Dennis Hopper in Paul Haggis and Glen Mazzara's Crash, he went on to play the lead in many award winning films and television series including White Collar, In Embryo, AutoMotive and Castle. He resides in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODYxMTgwOF5BMl5BanBnXkFtZTcwNDQ4NzU2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564680","name":"Ross McCall","idIMDB":"nm0564680"},"actorId":"nm0564680","character":"Gary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Toby Fisher","urlProfile":"http://www.imdb.com/name/nm0279815","urlPhoto":"","biography":{"bio":"Toby Fisher is an actor, known for The Whole of the Moon (1997), LD 50 Lethal Dose (2003) and Fix (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0279815","name":"Toby Fisher","idIMDB":"nm0279815"},"actorId":"nm0279815","character":"Justin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo Bill","urlProfile":"http://www.imdb.com/name/nm1095324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTU3NjEyNl5BMl5BanBnXkFtZTcwMjA1Njk1MQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1980","placeOfBirth":" Warwickshire, England, UK","height":"6' (1.83 m)","bio":"Leo Bill was born on August 31, 1980 in Warwickshire, England. He is an actor, known for 28 Days Later... (2002), Alice in Wonderland (2010) and The Girl with the Dragon Tattoo (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTU3NjEyNl5BMl5BanBnXkFtZTcwMjA1Njk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1095324","name":"Leo Bill","idIMDB":"nm1095324"},"actorId":"nm1095324","character":"Danny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Winchester","urlProfile":"http://www.imdb.com/name/nm0934618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTYzMjU5MF5BMl5BanBnXkFtZTgwOTYyNDkwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1981","placeOfBirth":" Montana, USA","birthName":"Philip C. Winchester","height":"6' 1\" (1.85 m)","bio":"Philip Winchester was born on March 24, 1981 in Montana, USA as Philip C. Winchester. He is an actor, known for Strike Back (2010), Flyboys (2006) and In My Sleep (2010). He has been married to Megan Marie since December 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTYzMjU5MF5BMl5BanBnXkFtZTgwOTYyNDkwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934618","name":"Philip Winchester","idIMDB":"nm0934618"},"actorId":"nm0934618","character":"Vaughn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Lord","urlProfile":"http://www.imdb.com/name/nm0520510","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4ODI3NDM5M15BMl5BanBnXkFtZTgwNzc5NzIxNzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1972","placeOfBirth":" Salford, Manchester, England, UK","height":"5' 8\" (1.73 m)","bio":"Stephen trained at Salford College of Music and Drama and graduated with the highest Grade A Distinction. Stephen's love affair for film and TV soon began with his debut role in Cannes winner, Raining Stones (1993), a Ken Loach film and then the lead as\"Jonno Fox\" in the award-winning \"Common As Muck\" (1994)_, for the BBC, which led him to BAFTA recognition. His solid performances as \"Darwin Craven\" in two series of Carla Lane's comedy for the BBC Luv (1993), Into the Fire (1996) by award-winning writer, Tony Marchant, led to 2 series of City Central (1998), for the BBC, playing rookie cop, \"PC Steve Jackson\". Stephen's next job was the hard-hitting drama, Real Men (2003), by Frank Deasy, playing the sexually abused and abuser, \"Alex Collins\", directed by Sallie Aprahamian for David Snodin, at the BBC, which created much controversy, whilst receiving great reviews. His talent also led him to play the guest lead in the popular TV series, Sea of Souls (2004), for the BBC. A familiar face on the small screen, Stephen lit up the big screen with his performances in Screen One: The Bullion Boys (1993), which picked up the Emmy award, directed by Christopher Morahan. Judge Dredd (1995), Giving Tongue (1996) and \"Prince of Denmark Hill\" (1999) followed. With a filmography that many actors dream of, Stephen also played a mad anarchist, \"Fazer\", in South West 9 (2001), for Fruit Salad Films and Capone's Boys (2002), opposite Ricky Tomlinson and Richard Roundtree, which was directed by \"Cracker\" (1993)_'s original director, Richard Standeven. As well as Octane (2003), with Madeleine Stowe, for Random Harvest and Four Horseman Films and the leading role of \"Spook\", a psychotic marine in Random Harvest opposite Tom Hardy and Four Horseman's LD 50 Lethal Dose (2003). Stephen also enjoyed filming Reverb (2008), a psychological thriller with Leo Gregory and Eva Birthistle, and he played opposite the much-loved Stephen Rea and Jean-Claude Van Damme in the new action film, Until Death (2007). One of his many amazing short films was an adaptation of Edgar Allan Poe's The Tell-Tale Heart (2004), working with Oscar-winner Jack Cardiff. He also worked on the small micro-budget film, The Truth (2006), with Elaine Cassidy and Elizabeth McGovern, and again with Jean-Claude Van Damme, playing an American bad guy, \"Benjamin Myers\", in the $12 million action film, The Shepherd (2008). As well as an amazing acting career, Stephen has been writing and producing inspired by his working class roots in Salford and his time traveling back and forth to Ireland.. Stephen has written and directed 2 short films, Untitled (2000) and In Loving Memory (2000). Stephen produced an animated pilot \"Gettin On\" with the award-winning Slinky Pictures. Stephen wrote, directed and produced his 1st doc feature film, It's Not the End of the World (2000), which has played at various film festivals. He also created, wrote, directed and produced a pilot webisode/mobisode, \"Dr Hoo\", starring Ian Hart and Elaine Cassidy, which was the first ever original drama on www.virgin1.co.uk.His production company, Lord Entertainment Group, is based in London. Stephen continues to choose amazing projects, having played the explosive role of football hooligan and devoted father, \"Jase Dyer\", in EastEnders (1985), for 1 year before making one of the most dramatic exits on British TV, which caused a huge reaction in the National Press as his character was stabbed to death in front of his 12-year-old son at the time when knife crime hit a peak in the UK. Stephen has gone on to film Jackboots on Whitehall (2010), starring alongside Ewan McGregor, Timothy Spall and Richard E. Grant. He also took a trip back to his roots, by working with the much-loved director, Ken Loach, in his latest film, Route Irish (2010), and worked with the 3-times Oscar DOP whose films include \"The Killing Fields\" (2000). His 1st scripted feature film, \"The Wronguns\" (2012), which is a modern-day fairy tale and heroic comedy is planned to shoot in 2014. IN 2012 Stephen filmed the controversial film \"Default\" by columbian filmmaker Simon Brand which is about the kidnapping of CNN journalists by Somalian Pirates. The film got picked up by Wildbunch and CAA. 2012 Stephen played the guest lead in the hit comedy show \"The Phone Shop\" for E4 and then went on to do another comedy pilot \"Meet The Police\". 2012 to 2013 Stephen played the alcoholic priest and sexual deviant Dominic Meak in 3 seasons of the hit series \"Shameless\" for channel 4. 2013 marked the debut of Stephen breaking into the US with a guest starring arc over multiple episodes in the hit show for ABC \"Once Upon A Time\" 2014 kicked off with a role in John Logan's \"Penny Dreadful\" exec Sam Mendes for Showtime and Sky playing American bounty hunter Mr Roper. Stephen takes on his most demanding film and role to date in the prolific writer and now director Helen Walsh's 1st feature film \"Violators\" playing Mickey Finnaghan. Stephen reunites with Tom Hardy in Brian Hegeland's \"The Legend\" \"Default is released October 17th 2014. Stephen returns to play Warren Roper in the second series of \"Penny Dreadful\" Collateral Films is set up in the UK with investment secured for a slate of films. \"Strangeways Here We Come\" gets green light and starts filming and Stephen plays Nolan the infamous debt collector. \"Violators\" premieres at the Edinburgh Festival and is nominated for The Best Of British award. \"Violators\" continues to play film festivals all over the world and a general release is set for 2016. \"Legend\" is released in the UK and is released in the USA on November 20th 2015. 2016 Stephen joins the cast of \"Marcella\" by Hans Rosenfeldt( Bron/The Bridge) and Nicola Larder which swiftly is transmitted grabbing high ratings for ITV and Netflix. 2016 Stephen appeared in the Anthony Harrowitz 7 part crime drama \"New Blood\" for BBC. \"Violators\" is released in the Uk and Eire, on online platforms and to very positive reviews and personal mentions for his standout performance. He is married to Elaine Cassidy, and they have 2 children Kíla and Lynott.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4ODI3NDM5M15BMl5BanBnXkFtZTgwNzc5NzIxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0520510","name":"Stephen Lord","idIMDB":"nm0520510"},"actorId":"nm0520510","character":"Spook","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tania Emery","urlProfile":"http://www.imdb.com/name/nm0256349","urlPhoto":"","biography":{"dateOfBirth":"26 June 1976","placeOfBirth":" Windsor, Berkshire, England, UK","bio":"Tania Emery was born on June 26, 1976 in Windsor, Berkshire, England. She is an actress and director, known for The Bill (1984), Strong Language (2000) and The Truth Game (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0256349","name":"Tania Emery","idIMDB":"nm0256349"},"actorId":"nm0256349","character":"Jenny Wheeler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Talbot","urlProfile":"http://www.imdb.com/name/nm0847880","urlPhoto":"","biography":{"bio":"Alan Talbot is known for his work on The Living Daylights (1987), Under Suspicion (1991) and Shadowlands (1993). He died on November 25, 2014 in England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0847880","name":"Alan Talbot","idIMDB":"nm0847880"},"actorId":"nm0847880","character":"Foreman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antony Zaki","urlProfile":"http://www.imdb.com/name/nm0952306","urlPhoto":"","biography":{"dateOfBirth":"25 December 1968","placeOfBirth":"","height":"5' 10\" (1.78 m)","bio":"Antony Zaki was born on December 25, 1968. He is an actor and director, known for The Journey (1997), Annie: A Royal Adventure! (1995) and Such a Long Journey (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0952306","name":"Antony Zaki","idIMDB":"nm0952306"},"actorId":"nm0952306","character":"Yoga Teacher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Xanthe Elbrick","urlProfile":"http://www.imdb.com/name/nm1287143","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzgxMTM3OV5BMl5BanBnXkFtZTYwMDg0ODky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1978","placeOfBirth":" London, England, UK","birthName":"Xanthe Eleanora Marie Davina Elbrick","height":"5' 8½\" (1.74 m)","bio":"Trained at the Royal Academy of Dramatic Art in London, and The Actors Studio (MFA) in New York City. She graduated with a Masters in Philosophy from Edinburgh University (2000) where she was also Director of the Edinburgh Footlights Theatre Company. Xanthe won the BBC Drama 'Act Up' Award (2001), and made her television debut as Miriam Jacobs on 'Doctors' (BBC) that same year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzgxMTM3OV5BMl5BanBnXkFtZTYwMDg0ODky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1287143","name":"Xanthe Elbrick","idIMDB":"nm1287143"},"actorId":"nm1287143","character":"Receptionist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0337659","urlIMDB":"http://www.imdb.com/title/tt0337659","business":{"budget":{"money":"$8,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"10","year":"2002","remarks":null},{"money":null,"country":null,"day":"31","month":"01","year":"2003","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Moviecam Compact, Zeiss Ultra Prime Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Kodak Vision2 500T 5218)"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"4.2","filmingLocations":[{"location":"London, England, UK"}],"rated":"R","awards":[],"votes":"797","type":"Movie","companyCreditsSimple":[{"idCompany":"co0104695","name":"Four Horsemen Films"},{"idCompany":"co0059198","name":"Isle of Man Film Commission"},{"idCompany":"co0237783","name":"Crossfire Productions"}],"keywords":{"keywords":["animal rights","experiments on people","secret experiment","human experimentation","underground laboratory","beagle","animal liberation","caged animal","digit in title","acronym in title","marijuana","hippie","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:10:59"}}