{"data":{"movies":[{"title":"The Lost City","originalTitle":"","year":"2005","releaseDate":"20060526","directors":[{"name":"Andy Garcia","id":"nm0000412"}],"writers":[{"name":"Guillermo Cabrera Infante","id":"nm0127788"}],"runtime":"144 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM4ODM1MTMzOF5BMl5BanBnXkFtZTcwMzY1NzczMQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama","Romance"],"plot":"In Havana, Cuba in the late 1950s, a wealthy family, one of whose sons is a prominent night-club owner, is caught in the violent transition from the oppressive regime of Batista to the government of Fidel Castro. Castro's regime ultimately leads the night-club owner to flee to New York.","simplePlot":"In Havana, Cuba in the late 1950s, a wealthy family, one of whose sons is a prominent night-club owner, is caught in the violent transition from the oppressive regime of Batista to the ... ","actors":[{"actorName":"Alfredo Armenteros","urlProfile":"http://www.imdb.com/name/nm1113349","urlPhoto":"","biography":{"dateOfBirth":"4 April 1928","placeOfBirth":" Santa Clara, Cuba","bio":"Alfredo Armenteros was born on April 4, 1928 in Santa Clara, Cuba. He died on January 6, 2016 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1113349","name":"Alfredo Armenteros","idIMDB":"nm1113349"},"actorId":"nm1113349","character":"Chocolate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Pino","urlProfile":"http://www.imdb.com/name/nm0992694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ1OTY2MDM2NF5BMl5BanBnXkFtZTcwMzA1NjYyMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1974","placeOfBirth":" Miami, Florida, USA","birthName":"Daniel G. Pino","height":"6' (1.83 m)","bio":"Danny Pino was born on April 15, 1974 in Miami, Florida, USA as Daniel G. Pino. He is an actor and writer, known for Cold Case (2003), Law & Order: Special Victims Unit (1999) and The Lost City (2005). He has been married to Lilly Pino Bernal since February 15, 2002. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ1OTY2MDM2NF5BMl5BanBnXkFtZTcwMzA1NjYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0992694","name":"Danny Pino","idIMDB":"nm0992694"},"actorId":"nm0992694","character":"Alberto Mora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Marquez","urlProfile":"http://www.imdb.com/name/nm0549871","urlPhoto":"","biography":{"bio":"Richard Marquez is an actor, known for The Lost City (2005), Assassination Tango (2002) and Steal Big Steal Little (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0549871","name":"Richard Marquez","idIMDB":"nm0549871"},"actorId":"nm0549871","character":"Rega","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franklin Dominguez","urlProfile":"http://www.imdb.com/name/nm0231519","urlPhoto":"","biography":{"dateOfBirth":"5 June 1931","placeOfBirth":" Santiago, Dominican Republic","bio":"Franklin Dominguez was born on June 5, 1931 in Santiago, Dominican Republic. He is an actor and director, known for The Lost City (2005), Lotoman 2.0 (2012) and The Overthrow (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0231519","name":"Franklin Dominguez","idIMDB":"nm0231519"},"actorId":"nm0231519","character":"Lieutenant Dario","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Marquez","urlProfile":"http://www.imdb.com/name/nm0549884","urlPhoto":"","biography":{"dateOfBirth":"14 March 1943","placeOfBirth":" Cuba","bio":"William Marquez was born on March 14, 1943 in Cuba. He is known for his work on The Mask of Zorro (1998), General Hospital (1963) and Crazy Heart (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0549884","name":"William Marquez","idIMDB":"nm0549884"},"actorId":"nm0549884","character":"Rodney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andy Garcia","urlProfile":"http://www.imdb.com/name/nm0000412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3NDA5NTgxNl5BMl5BanBnXkFtZTgwMzU3NDc4NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1956","placeOfBirth":" Havana, Cuba","birthName":"Andrés Arturo García Menéndez","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's most private and guarded leading men, Andy Garcia has created a few iconic characters while at the same time staying true to his acting roots and personal projects. Garcia was born Andrés Arturo García Menéndez on April 12, 1956, in Havana, Cuba, to Amelie Menéndez, a teacher of English, and René García Núñez, an attorney and avocado farmer. Garcia's family was relatively affluent. However, when he was two years old, Fidel Castro came to power, and the family fled to Miami Beach. Forced to work menial jobs for a while, the family started a fragrance company that was eventually worth more than a million dollars. He attended Natilus Junior High School and later at Miami Beach Senior High School. Andy was a popular student in school, a good basketball player and good-looking. He dreamed of playing professional baseball. In his senior year, though, he contracted mononucleosis and hepatitis, and unable to play sports, he turned his attention to acting. He studied acting with Jay W. Jensen. Jensen was a South Florida legend, counting among his numerous students, Brett Ratner, Roy Firestone, Mickey Rourke, and Luther Campbell. Following his positive high school experiences in acting, he continued his drama studies at Florida International University. Soon, he was headed out to Hollywood. His first break came as a gang member on the very first episode of the popular TV series Hill Street Blues (1981). His role as a cocaine kingpin in 8 Million Ways to Die (1986) put him on the radar of Brian De Palma, who was casting for his gangster classic The Untouchables (1987). At first, he envisioned Garcia as Al Capone's sadistic henchman Frank Nitti, but fearing typecasting as a gangster, Garcia campaigned for the role of \"George Stone\", the Italian cop who gets accepted into Eliot Ness' famous band of lawmen. Garcia's next notable role came in Black Rain (1989) by acclaimed director Ridley Scott, as the partner of police detective Michael Douglas. He then co-starred with Richard Gere in Internal Affairs (1990), directed by Mike Figgis. In 1989, Francis Ford Coppola was casting for the highly anticipated third installment of his \"Godfather\" films. The Godfather: Part III (1990) included one of the most sought-after roles in decades, the hot-headed son of \"Sonny Corleone\" and mob protégé of \"Michael Corloene\", \"Vincent Mancini\". A plum role for any young rising star, the role was campaigned for by a host of actors. Val Kilmer, Alec Baldwin, Vincent Spano, Charlie Sheen, and even Robert De Niro (who wanted the role changed to accommodate his age) were all beaten out by the up-and-coming Garcia. His performance was Oscar-nominated as Best Supporting Actor, and secured him international stardom and a place in cinematic history. Now a leading man, he starred in such films as Jennifer 8 (1992) and Hero (1992). He won raves for his role as the husband of Meg Ryan in When a Man Loves a Woman (1994) and gave another charismatic gangster turn in Things to Do in Denver When You're Dead (1995). He then returned in Night Falls on Manhattan (1996), directed by Sidney Lumet, as well as portraying legendary mobster Lucky Luciano in Hoodlum (1997). In perhaps his most mainstream role, he portrayed a cop in the action film Desperate Measures (1998). Garcia then starred in a few lower-profile projects that didn't do much for his career, but things turned around in 2001, with the first of many projects being his role as a cold casino owner in Ocean's Eleven (2001), directed by Steven Soderbergh. Seeing his removal from Cuba as involuntary, Garcia is proud of his heritage which influences his life and work. One such case is his portrayal of renowned Cuban trumpet player Arturo Sandoval in For Love or Country: The Arturo Sandoval Story (2000). He is an extremely private man, and strong believer in old-fashioned chivalry. Married to his wife, Maria Victoria, since 1982, the couple has three daughters. One of the most talented leading men around, Garcia has had a unique career of staying true to his own ideals and thoughts on acting. While some would have used some of the momentum he has acquired at different points in his career to get rich off lightweight projects, Garcia has stayed true to stories and films that aspire to something more. But with a presence and style that never seem old, a respect from directors and film buffs, alike, Andy Garcia will be remembered for a long time in film history.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3NDA5NTgxNl5BMl5BanBnXkFtZTgwMzU3NDc4NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000412","name":"Andy Garcia","idIMDB":"nm0000412"},"actorId":"nm0000412","character":"Fico Fellove","urlCharacter":"http://www.imdb.com/character/ch0024957","main":true},{"actorName":"Nestor Carbonell","urlProfile":"http://www.imdb.com/name/nm0004801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTQ3NDM2NV5BMl5BanBnXkFtZTcwMzQ2MzM4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1967","placeOfBirth":" New York City, New York, USA","birthName":"Néstor Gastón Carbonell","height":"5' 10\" (1.78 m)","bio":"He is most often recognized for his integral role in the series \"Lost\" as Richard Alpert, as well as his turn as Mayor Anthony Garcia opposite Gary Oldman in Christopher Nolan's \"The Dark Knight\". He reprised his role as the Mayor in the box-office hit \"The Dark Knight Rises\". Nestor can be seen starring in Universal's \"Bates Motel\" (2013-2017) as Sheriff Alex Romero, lover to Vera Farmiga's Norma Bates and nemesis to her son Norman. In the final season Nestor directed his third episode, which introduces Rihanna playing the role of Marion Crane from \"Psycho\". On the feature side, he will next be seen in the (2017) Sundance world premier of \"Crown Heights\". He most recently starred with Daniel Radcliffe and Toni Collette in Lion's Gates' release, \"Imperium\" (2016). He has demonstrated his versatility through a variety of film roles including his turn as the emotionally tortured hitman Pasquale Acosta in Joe Carnahan's \"Smokin' Aces\", the socially conscious theater director Moises Kaufman in \"The Laramie Project\", the idealistic revolutionary Luis Fellove in Andy Garcia's \"The Lost City\", the pragmatic and ruthless Mayor Picazo in \"For Greater Glory\", and the womanizing and morally conflicted father in the title role of the Sundance indies, \"Jack the Dog\" and \"Manhood\". Nestor was born in New York City and raised in numerous locales including, Mexico, Venezuela, Florida, Connecticut, the Bahamas and London. He graduated from Harvard University with a degree in English. It was during his time in college that a first-year drama course led to his interest in performing. Upon graduating he moved to New York and starred in the Off Broadway world premier of the two-hander, \"A Silent Thunder\". He continued to work in theater, most notably in Stephen Sondheim's premier of \"The Doctor is Out\" at The Old Globe in San Diego. Nestor currently resides in Los Angeles with his wife, actress Shannon Kenny, and their two sons Rafa and Marco.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTQ3NDM2NV5BMl5BanBnXkFtZTcwMzQ2MzM4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004801","name":"Nestor Carbonell","idIMDB":"nm0004801"},"actorId":"nm0004801","character":"Luis Fellove","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Inés Sastre","urlProfile":"http://www.imdb.com/name/nm0766046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTkwNDUyNF5BMl5BanBnXkFtZTYwOTU4MTM3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1973","placeOfBirth":" Valladolid, Valladolid, Castilla y León, Spain","height":"5' 8\" (1.73 m)","bio":"Ines Sastre was born in Valladolid (Spain). Her career began age 12, when she was selected to appear in a fast-food commercial. This appearance led her to be noticed by the producer Carlos Saura, who chose her to play in \"El Dorado\" with Lambert Wilson (1987). The film made the official selection of the Cannes Film Festival in 1988, this marked the beginning of her international acting career. Ines also achieved international notoriety as a top model and succeeded Isabella Rossellini as the face of Lancome's emblematic Tresor fragrance. In addition to her acting and modeling career, Ines also completed studies in French modern literature at La Sorbonne University. Ines Sastre returned to cinema in Italy to play for two of the most famous Italian directors; Michelangelo Antonioni in \"Beyond the Clouds\" (1996) together with John Malkovitch, Sophie Marceau and Fanny Ardant, and Pupi Avati in \"The Best Man\" (1998). Ines Sastre also made a noticeable return to French cinema starring as Epona, the wife of Vercingetorix, in \"Druids\" (2001) by Jacques Dorfmann, alongside Max von Sidow and Christophe Lambert. That same year Ines shone alongside Guillaume Canet and Andre Dussolier as a manipulative courtesan in \"Vidocq\" by Pitof, were she was reunited with the infamous Gerard Depardieu that she had previously starred with in the TV mini-series \"The Count of Monte-Cristo\" by Josee Dayan. Ines Sastre has also starred in two American productions. She made an appearance in \"Sabrina\" (1996) by Sidney Pollack, with Harrison Ford and was outstanding in the melodramatic \"The Lost City\" by and with Andy Garcia, Bill Murray and Dustin Hoffman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTkwNDUyNF5BMl5BanBnXkFtZTYwOTU4MTM3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0766046","name":"Inés Sastre","idIMDB":"nm0766046"},"actorId":"nm0766046","character":"Aurora Fellove","urlCharacter":"http://www.imdb.com/character/ch0024958","main":true},{"actorName":"Tomas Milian","urlProfile":"http://www.imdb.com/name/nm0587401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y1NDJiZWUtM2MxOS00Nzk0LWI3OGEtNjFkMTQ4YzVjYTJiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1933","placeOfBirth":" Havana, Cuba","birthName":"Tomás Quintín Rodríguez Milián","height":"6' (1.83 m)","bio":"Tomas Milian, an American actor born in Cuba; was trained at the Actors Studio. He appeared in a few plays on Broadway, as well as in a show by Jean Cocteau in Spoleto. Mauro Bolognini noticed him and that was the starting point of a rich cinematographic career in Italy, where he played in all manner of genres. He interpreted a mad psychopath in The Ugly Ones (1966) (aka \"Bounty Killer\"), a role he would then improve and diversify into an impressive gallery of neurotic and sadistic killers, first in \"spaghetti westerns\" (many directed by Sergio Corbucci), and then in violent action and police thrillers (many directed by Umberto Lenzi). His films gradually evolved into action comedies, as he played the recurrent characters of thief \"Er Monnezza\" and cop Nico Giraldi (the latter being originally based on the lead character in Serpico (1973)), two typically Roman characters who enjoyed great popularity in the '70s and '80s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y1NDJiZWUtM2MxOS00Nzk0LWI3OGEtNjFkMTQ4YzVjYTJiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587401","name":"Tomas Milian","idIMDB":"nm0587401"},"actorId":"nm0587401","character":"Don Federico Fellove","urlCharacter":"http://www.imdb.com/character/ch0024959","main":true},{"actorName":"Millie Perkins","urlProfile":"http://www.imdb.com/name/nm0674012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODIwODEzMF5BMl5BanBnXkFtZTcwNjYxNzkwNA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1938","placeOfBirth":" Passaic, New Jersey, USA","bio":"Millie Perkins was born on May 12, 1938 in Passaic, New Jersey, USA. She is an actress, known for The Diary of Anne Frank (1959), At Close Range (1986) and Wall Street (1987). She was previously married to Robert Thom and Dean Stockwell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODIwODEzMF5BMl5BanBnXkFtZTcwNjYxNzkwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0674012","name":"Millie Perkins","idIMDB":"nm0674012"},"actorId":"nm0674012","character":"Doña Cecilia Fellove","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Bradford","urlProfile":"http://www.imdb.com/name/nm0103071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxMzk2MDQ3NF5BMl5BanBnXkFtZTcwNzUxMzYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1934","placeOfBirth":" Conroe, Texas, USA","birthName":"Richard Edwin Bradford Jr.","height":"5' 10\" (1.78 m)","bio":"Richard Bradford was born on November 10, 1934 in Conroe, Texas, USA as Richard Edwin Bradford Jr. He was an actor, known for The Untouchables (1987), Man in a Suitcase (1967) and The Milagro Beanfield War (1988). He was married to Eileen Elliott. He died on March 22, 2016 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxMzk2MDQ3NF5BMl5BanBnXkFtZTcwNzUxMzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103071","name":"Richard Bradford","idIMDB":"nm0103071"},"actorId":"nm0103071","character":"Don Donoso Fellove","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Enrique Murciano","urlProfile":"http://www.imdb.com/name/nm0006663","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDEyODgxM15BMl5BanBnXkFtZTYwMTIxNjIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1973","placeOfBirth":" Miami, Florida, USA","height":"6' 1\" (1.85 m)","bio":"Enrique Murciano was born in Miami, Florida, on July 9, 1973, but spent the first few years of his life in Mexico. He attended Tulane University and Boston Law School, but moved to Los Angeles to pursue his goal of becoming an actor. He brought with him his love of exotic cars and motorcycles. On his first audition, 1997, he landed the role of Alejandro in Speed 2: Cruise Control (1997). The role only involved one line, but it took six months of shooting. His big break came three years later, when a two-day stint on the set of the Academy Award-winning Traffic (2000) turned into several weeks work as the role of DEA agent Ricky, placing him in several pivotal scenes with Luis Guzmán and Don Cheadle. After the short-lived TV series Spyder Games (2001), Enrique landed the role of Sgt. Lorenzo Ruiz in the much-acclaimed Ridley Scott film Black Hawk Down (2001). It was during the shooting of that film that he was introduced to Jerry Bruckheimer, a meeting that led to his role in Without a Trace (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDEyODgxM15BMl5BanBnXkFtZTYwMTIxNjIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006663","name":"Enrique Murciano","nicknames":["Ukelele Boy"],"idIMDB":"nm0006663"},"actorId":"nm0006663","character":"Ricardo Fellove","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dominik García-Lorido","urlProfile":"http://www.imdb.com/name/nm0306572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTA2OTI4N15BMl5BanBnXkFtZTcwMDg3MzI1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1983","placeOfBirth":" USA","birthName":"Dominik Cristina Garcia-Lorido","height":"5' 9\" (1.75 m)","bio":"Dominik García-Lorido was born in Miami, Florida, the daughter of Maria Victoria \"Marivi\" Lorido and actor Andy García. She is the eldest of four children, with sisters Daniella, Alessandra, and brother Andrés. Her parents are both of Cuban descent, and her father was born in Havana. She grew up in Los Angeles and began dancing at the age of three.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTA2OTI4N15BMl5BanBnXkFtZTcwMDg3MzI1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0306572","name":"Dominik García-Lorido","nicknames":["Dom"],"idIMDB":"nm0306572"},"actorId":"nm0306572","character":"Mercedes Fellove","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Rivers","urlProfile":"http://www.imdb.com/name/nm0729582","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2Mjk1OTMyOV5BMl5BanBnXkFtZTcwMjY5NDUyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Victor Rivas","height":"6' 2\" (1.88 m)","bio":"Victor Rivers was born in Sancti Spíritus, Cuba as Victor Rivas. He is an actor, known for The Mask of Zorro (1998), Blood In, Blood Out (1993) and Hulk (2003). He has been married to Mim Eichler Rivas since 1988. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2Mjk1OTMyOV5BMl5BanBnXkFtZTcwMjY5NDUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0729582","name":"Victor Rivers","idIMDB":"nm0729582"},"actorId":"nm0729582","character":"El Indio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amelia Vega","urlProfile":"http://www.imdb.com/name/nm1392123","urlPhoto":"","biography":{"dateOfBirth":"7 November 1984","placeOfBirth":" Santo Domingo, Dominican Republic","birthName":"Amelia Victoria Vega Polanco de Guerra","height":"5' 10\" (1.78 m)","bio":"Amelia Vega was born on November 7, 1984 in Santo Domingo, Dominican Republic as Amelia Victoria Vega Polanco de Guerra. She is an actress and art director, known for The Lost City (2005), Miss Universe Pageant (2003) and Miss Universe 2004 (2004). She has been married to Al Horford since December 24, 2011. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1392123","name":"Amelia Vega","nicknames":["Amélie"],"idIMDB":"nm1392123"},"actorId":"nm1392123","character":"Minerva","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0343996","urlIMDB":"http://www.imdb.com/title/tt0343996","business":{"budget":{"money":"$9,600,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$191,560","country":"USA","day":"30","month":"04","year":"2006","remarks":"18 Screens"},{"money":"€23,567","country":"Netherlands","day":"20","month":"08","year":"2006","remarks":"12 Screens"}],"gross":[{"money":"$2,483,955","country":"USA","day":"20","month":"08","year":"2006","remarks":""},{"money":"$2,479,212","country":"USA","day":"13","month":"08","year":"2006","remarks":""},{"money":"$2,463,147","country":"USA","day":"06","month":"08","year":"2006","remarks":""},{"money":"$2,434,066","country":"USA","day":"30","month":"07","year":"2006","remarks":""},{"money":"$2,388,145","country":"USA","day":"23","month":"07","year":"2006","remarks":""},{"money":"$2,319,835","country":"USA","day":"16","month":"07","year":"2006","remarks":""},{"money":"$2,230,022","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"$2,121,404","country":"USA","day":"02","month":"07","year":"2006","remarks":""},{"money":"$1,931,329","country":"USA","day":"25","month":"06","year":"2006","remarks":""},{"money":"$1,764,879","country":"USA","day":"18","month":"06","year":"2006","remarks":""},{"money":"$1,627,133","country":"USA","day":"11","month":"06","year":"2006","remarks":""},{"money":"$1,443,378","country":"USA","day":"04","month":"06","year":"2006","remarks":""},{"money":"$1,248,653","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$931,375","country":"USA","day":"21","month":"05","year":"2006","remarks":""},{"money":"$689,112","country":"USA","day":"14","month":"05","year":"2006","remarks":""},{"money":"$420,864","country":"USA","day":"07","month":"05","year":"2006","remarks":""},{"money":"$191,560","country":"USA","day":"30","month":"04","year":"2006","remarks":""},{"money":"€41,136","country":"Netherlands","day":"20","month":"08","year":"2006","remarks":""}],"weekendGross":[{"money":"$2,023","country":"USA","day":"20","month":"08","year":"2006","remarks":"3 Screens"},{"money":"$9,335","country":"USA","day":"13","month":"08","year":"2006","remarks":""},{"money":"$18,557","country":"USA","day":"06","month":"08","year":"2006","remarks":"16 Screens"},{"money":"$23,698","country":"USA","day":"30","month":"07","year":"2006","remarks":"21 Screens"},{"money":"$46,112","country":"USA","day":"23","month":"07","year":"2006","remarks":"29 Screens"},{"money":"$61,068","country":"USA","day":"16","month":"07","year":"2006","remarks":"44 Screens"},{"money":"$81,332","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"$108,833","country":"USA","day":"02","month":"07","year":"2006","remarks":"55 Screens"},{"money":"$126,836","country":"USA","day":"25","month":"06","year":"2006","remarks":"56 Screens"},{"money":"$92,110","country":"USA","day":"18","month":"06","year":"2006","remarks":"52 Screens"},{"money":"$141,910","country":"USA","day":"11","month":"06","year":"2006","remarks":"56 Screens"},{"money":"$145,280","country":"USA","day":"04","month":"06","year":"2006","remarks":"49 Screens"},{"money":"$277,443","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$185,155","country":"USA","day":"21","month":"05","year":"2006","remarks":"41 Screens"},{"money":"$202,048","country":"USA","day":"14","month":"05","year":"2006","remarks":"31 Screens"},{"money":"$172,554","country":"USA","day":"07","month":"05","year":"2006","remarks":"24 Screens"},{"money":"$191,560","country":"USA","day":"30","month":"04","year":"2006","remarks":"18 Screens"},{"money":"€23,567","country":"Netherlands","day":"20","month":"08","year":"2006","remarks":"12 Screens"}],"admissions":[{"money":"26,598","country":"Netherlands","day":"31","month":"12","year":"2006","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"26","month":"06","year":"2004","remarks":null},{"money":null,"country":null,"day":"13","month":"08","year":"2004","remarks":null}],"copyrightHolder":"copyright © 2005 Crescent Drive Pictures, LLC (on print)"},"technical":{"runtime":["2 hr 24 min (144 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":["3,992 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm"]},"rating":"6.7","metascore":"47","filmingLocations":[{"location":"Palacio Nacional, Santo Domingo, Dominican Republic"}],"rated":"R","awards":[{"award":"ALMA Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Outstanding Director - Motion Picture","names":[{"name":"Andy Garcia","id":"nm0000412","role":null}]}]}]},{"award":"Imagen Foundation Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won Imagen Award","categories":[{"category":"Best Director","names":[{"name":"Andy Garcia","id":"nm0000412","role":null}]},{"category":"Best Picture","names":[]}]},{"titleAwardOutcome":"Nominated Imagen Award","categories":[{"category":"Best Actor","names":[{"name":"Andy Garcia","id":"nm0000412","role":null}]},{"category":"Best Actress","names":[{"name":"Inés Sastre","id":"nm0766046","role":null}]}]}]}],"votes":"8,533","type":"Movie","companyCreditsSimple":[{"idCompany":"co0127540","name":"Crescent Drive Pictures"},{"idCompany":"co0127539","name":"CineSon Entertainment"},{"idCompany":"co0060306","name":"Lions Gate Films"}],"keywords":{"keywords":["havana cuba","fidel castro","cuba","1950s","cuban flag","tuxedo","wedding anniversary","starts with a murder","violence","torture","rifle","revolution","politics","police","nightclub","jail","interrogation","friend","friendship","flashback","flash forward","father son relationship","family relationships","explosion","documentary footage","dictator","dancing","dancer","cuban revolution","comedian","brother brother relationship","bomb","blood","beating","directed by star","che guevara"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:16:24"}}