{"data":{"movies":[{"title":"The Box","originalTitle":"","year":"2009","releaseDate":"20091106","directors":[{"name":"Richard Kelly","id":"nm0446819"}],"writers":[{"name":"Richard Kelly","id":"nm0446819"},{"name":"Richard Matheson","id":"nm0558577"}],"runtime":"115 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MDA5NjIwM15BMl5BanBnXkFtZTcwNTA2MjY0Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Fantasy","Mystery","Thriller"],"plot":"Norma and Arthur Lewis, a suburban couple with a young child, receive a simple wooden box as a gift, which bears fatal and irrevocable consequences. A mysterious stranger delivers the message that the box promises to bestow upon its owner $1 million with the press of a button. However, pressing this button will simultaneously cause the death of another human being somewhere in the world, someone they don't know. With just 24 hours to have the box in their possession, Norma and Arthur find themselves in the cross-hairs of a startling moral dilemma and must face the true nature of their humanity.","simplePlot":"A small wooden box arrives on the doorstep of a married couple, who know that opening it will grant them a million dollars and kill someone they don't know.","actors":[{"actorName":"Cameron Diaz","urlProfile":"http://www.imdb.com/name/nm0000139","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTI5NzM4MV5BMl5BanBnXkFtZTcwMTI3ODY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1972","placeOfBirth":" San Diego, California, USA","birthName":"Cameron Michelle Diaz","height":"5' 8½\" (1.74 m)","bio":"A tall, strikingly attractive blue-eyed natural blonde, Cameron Diaz was born in 1972 in San Diego, the daughter of a Cuban-American father and an Anglo-German mother. Self described as \"adventurous, independent and a tough kid,\" Cameron left home at 16 and for the next 5 years lived in such varied locales as Japan, Australia, Mexico, Morocco, and Paris. Returning to California at the age of 21, she was working as a model when she auditioned for a big part in The Mask (1994). To her amazement and despite having no previous acting experience, she was cast as the female lead in the film opposite Jim Carrey. Over the next 3 years, she honed her acting skills in such low budget independent films as The Last Supper (1995); Feeling Minnesota (1996); and Head Above Water (1996). She returned to main stream films in My Best Friend's Wedding (1997), in which she held her own against veteran actress Julia Roberts. She earned full fledged star status in 1998 for her performance in the box office smash There's Something About Mary (1998). With her name near the top on virtually every list of Hollyood's sexiest actresses, and firmly established as one of filmdom's hottest properties and most sought after actresses, Cameron Diaz appears to possess everything necessary to become one of the super stars of the new century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTI5NzM4MV5BMl5BanBnXkFtZTcwMTI3ODY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000139","name":"Cameron Diaz","nicknames":["Cami"],"idIMDB":"nm0000139"},"actorId":"nm0000139","character":"Norma Lewis","urlCharacter":"http://www.imdb.com/character/ch0049467","main":true},{"actorName":"James Marsden","urlProfile":"http://www.imdb.com/name/nm0005188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1973","placeOfBirth":" Stillwater, Oklahoma, USA","birthName":"James Paul Marsden","height":"5' 10\" (1.78 m)","bio":"James Paul Marsden, or better known as just James Marsden, was born on September 18, 1973, in Stillwater, Oklahoma, to Kathleen (Scholz) and James Luther Marsden. His father, a distinguished Professor of Animal Sciences & Industry at Kansas State University, and his mother, a nutritionist, divorced when he was nine years old. James grew up with his four other siblings, sisters, Jennifer and Elizabeth, and brothers, Jeff and Robert. He has English, German, and Scottish ancestry. During his teen years, he attended Putnam City North High School which was located in Oklahoma City. After graduating in 1991, he attended Oklahoma State University and studied Broadcast Journalism. While in university, he became a member of the Delta Tau Delta fraternity. While vacationing with his family in Hawaii, he met actor Kirk Cameron, and his actress sister, Candace Cameron Bure. They eventually invited James to visit them in Los Angeles. After studying in Oklahoma State for over a year and appearing in his college production, \"Bye Bye Birdie\", he left school and moved to Los Angeles to pursue his interest in acting. James got his first job on the pilot episode of The Nanny (1993) as Eddie, who was Margaret Sheffield's boyfriend. He then became part of the Canadian television series, Boogies Diner (1994), which aired for one season. After that series ended, he got a brief role as the original Griffin on Fox's Party of Five (1994). His first big break came when he became the lead on the short-lived ABC series, Second Noah (1996). Although the show didn't last long, the young actor received enough exposure from the public and even managed to win the hearts of fellow teenage girls. In 1996, he attended an audition for a movie titled Primal Fear (1996) but unfortunately lost that role to Edward Norton. Two years later, he was offered a lead role in 54 (1998), which he turned down. The role later went to another actor, Ryan Phillippe. James' star power increased when he starred in David Nutter's Comportements troublants (1998), alongside Katie Holmes and Nick Stahl, which had mixed reviews, but mostly positive ones. His role in the television series as Glenn Foy in Ally McBeal (1997), is probably one of his biggest achievement to date. He became one of the main cast members during the first half of season 5, where he showcased his singing abilities. It was in that show where he was able to grab the attention of audiences from different backgrounds. The 5' 10\" star later played Lon Hammon Jr. in the romantic movie, The Notebook (2004), which was based on a novel by Nicholas Sparks of the same name. His movies, Lies & Alibis (2006) and 10th & Wolf (2006) was also released around the world to audiences in the year 2006. One of his most memorable roles to fans is his role as Cyclops in the X-Men (2000) movie franchise. The movie was well accepted by audiences and critics, which eventually made James one of the hottest stars since it was released. He was among the actors who starred in all three of the X-Men movies. James had the honor of working alongside Patrick Stewart, Famke Janssen and Hugh Jackman in the film. However, not many people know that he actually had to wear lifts for most of his scenes in the X-men movies, because his character Cyclops is supposed to be 6\" 3\" compared to a 5' 3\" Wolverine. In reality, he is actually under 6' 0\", shorter than Famke Janssen who plays his love interest, Jean Grey, and even shorter than Hugh Jackman who played Wolverine. In the year 2006, he played Richard White in the highly anticipated movie, Superman Returns (2006), which coincidentally was directed by Bryan Singer, who also directed previous X-Men installments. Although he appeared in X-Men: L'affrontement final (2006), the third installment of the X-Men franchise, many would notice that he in fact had more screen time in 'Superman Returns', as Lois Lane's long awaiting fiancé who had to accept the fact that his fiancée is in love with the man of steel. James earned great reviews from that movie, which led to him getting more movie roles. In 2007, James played Corny Collins in the film Hairspray (2007), an adaption of the Broadway musical based on John Waters movie, Hairspray (1988). He joined a star-studded cast, starring alongside top names such as John Travolta, Queen Latifah and Michelle Pfeiffer. James not only acted in that movie, but also sang two of the film's songs, \"The Nicest Kids In Town\", and \"Hairspray\". Being part of Hairspray catapulted James to a different level of stardom as audiences got to see another side of him. His next role was in the Disney movie, Enchanted (2007), playing Prince Edward, where he acted alongside Amy Adams, Susan Sarandon and Patrick Dempsey. Once again, James had the opportunity to sing in two songs from the movie, \"True Love's Kiss\" and \"That's Amore\". Enchanted (2007) appealed to not only older audiences but also to those who were fans of Disney's network productions. Following his huge success in the years 2006 and 2007, James played the male lead role in the romantic comedy, 27 Dresses (2008), opposite actress Katherine Heigl in 2008. The movie did well at the box office, earning a gross revenue of over $159 million, which exceeded the expectations of crew members especially since it was under a $30 million budget. Marsden played the male lead in the horror film, The Box (2009), based on the 1970 short story \"Button, Button\" by author Richard Matheson. He starred opposite Cameron Diaz in the movie. He co-starred in Accidental Love (2015) (previously Accidental Love (2015), a politically-themed romantic comedy, directed by David O. Russell and filmed in Columbia, South Carolina. Marsden's recent film roles include the sequel comedy Anchorman 2: The Legend Continues (2013), the romantic drama The Best of Me (2014), and the comedy Unfinished Business (2015). James was married to Lisa Linde, an actress known from her role in Days of Our Lives (1965). Lisa is the daughter of legendary country music songwriter Dennis Linde. The couple wed on July 22, 2000 and have a son, Jack Holden Marsden who was born on February 1, 2001, and a daughter, Mary James, who was born on August 10, 2005. They divorced in 2011. James has another son, born in 2012, with model Rose Costa. Many would assume that with all this success achieved by James at this age, he would be somewhat high-headed but James mentioned that despite all the attention he's getting from the public eye, he tries to keep himself as grounded as possible. He even admits that he flies coach instead of first class while traveling with his family. In an interview he mentioned that he believes he has a certain responsibility to let his children know that he isn't special because of what he does, but who he is as a person. With a great humble attitude and a bright future ahead of him, there's definitely more to expect from this Oklahoma native.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005188","name":"James Marsden","nicknames":["Bello Jimmy","J. P."],"idIMDB":"nm0005188"},"actorId":"nm0005188","character":"Arthur Lewis","urlCharacter":"http://www.imdb.com/character/ch0049466","main":true},{"actorName":"Frank Langella","urlProfile":"http://www.imdb.com/name/nm0001449","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDc0NTI3Nl5BMl5BanBnXkFtZTcwMTgzNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1938","placeOfBirth":" Bayonne, New Jersey, USA","birthName":"Frank A. Langella Jr.","height":"6' 3\" (1.91 m)","bio":"Frank Langella was born in Bayonne, New Jersey, to Angelina and Frank A. Langella, a business executive. He is of Italian descent. A stage and screen actor of extreme versatility, Frank Langella won acclaim on the New York stage in \"Seascape\" and followed it up with the title role in the Edward Gorey production of \"Dracula\". He repeated the role for the screen in Dracula (1979) and became an international star. Over the years, he has done occasional films but prefers to concentrate on his first love, the legitimate theatre. His stage performance ranged from Strindberg drama (\"The Father\") to Noël Coward comedy (\"Present Laughter\"). He also appeared in several productions for the New York Shakespeare festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDc0NTI3Nl5BMl5BanBnXkFtZTcwMTgzNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001449","name":"Frank Langella","idIMDB":"nm0001449"},"actorId":"nm0001449","character":"Arlington Steward","urlCharacter":"http://www.imdb.com/character/ch0153301","main":true},{"actorName":"James Rebhorn","urlProfile":"http://www.imdb.com/name/nm0714310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTc4ODE1MF5BMl5BanBnXkFtZTcwMjA5NzY5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1948","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"James Robert Rebhorn","height":"6' 3\" (1.91 m)","bio":"James Robert Rebhorn (September 1, 1948 - March 21, 2014) was an American actor who appeared in over 100 films, television series, and plays. At the time of his death, he had recurring roles in the current series White Collar and Homeland. An early performance was in Butterflies are Free at the Peterborough Players in New Hampshire in 1974. Rebhorn played Peter Latham in Forty Carats at the GasLight Dinner Theatre in Salt Lake City in the 1970s. He was known both for portraying WASP stereotypes, lawyers, politicians, doctors, and military men, as well as portraying individuals with criminal behavior. He has delivered equally notable performances in a variety of other roles, including that of a brutal serial killer on NBC's Law & Order (he would later return to the show in the recurring role of defense attorney Charles Garnett), Ellard Muscatine in Lorenzo's Oil (1992), Fred Waters in Blank Check (1994), Clyde Frost, the father of famed bull rider Lane Frost, in 8 Seconds (1994), Lt. Tyler in White Squall (1996), and a shipping magnate in The Talented Mr. Ripley (1999). One of his best known performances came in the popular 1996 film Independence Day, where he played Secretary of Defense Albert Nimzicki. He acted in Scent of a Woman (1992), and also played an expert witness in My Cousin Vinny (1992). He appeared in Carlito's Way the following year. Rebhorn also played an FBI Agent in the 1994 film Guarding Tess. Rebhorn played several roles on television, including an abusive stepfather, Bradley Raines, on the soap opera Guiding Light from 1983 to 1985, and an abusive father, Henry Lange, on sister soap As The World Turns from 1988 to 1991. An earlier daytime role was as John Brady in Texas from 1981 to 1982. In 1994 he played the role of super villain John McFlemp in the episode \"Farewell, My Little Viking\" of the Nickelodeon series The Adventures of Pete & Pete. In 1998, he played the District Attorney in the two-part series finale of Seinfeld. He also appeared in a supporting roles in The Game, Meet the Parents, and Regarding Henry. In 2004, he appeared in the TV miniseries Reversible Errors. His role in the short-lived and controversial NBC drama The Book of Daniel cast him as the father of the title character. More recently, he appeared in the Showtime series Homeland as Carrie's bipolar father. Rebhorn also appeared as a judge in Baby Mama. In the 2009 movie The Box, Rebhorn portrayed a NASA scientist. He had recurring roles on the USA series White Collar as Special Agent Reese Hughes, and also as Frank Mathison, the father of the protagonist Carrie Mathison, on Homeland. Rebhorn recently co-starred in the Comedy Central sitcom Big Lake. He played Max Kenton's uncle in the 2011 movie Real Steel. He starred as Oren in the miniseries Coma. Rebhorn starred as Gary Pandamiglio in the 2012 Mike Birbiglia comedy Sleepwalk with Me. He co-starred in the 2013 romantic comedy The Perfect Wedding. His stage career included seven Broadway productions, as well as numerous appearances with New York City's Roundabout Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTc4ODE1MF5BMl5BanBnXkFtZTcwMjA5NzY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714310","name":"James Rebhorn","idIMDB":"nm0714310"},"actorId":"nm0714310","character":"Norm Cahill","urlCharacter":"http://www.imdb.com/character/ch0167154","main":true},{"actorName":"Holmes Osborne","urlProfile":"http://www.imdb.com/name/nm0651660","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzA5Nzg0Ml5BMl5BanBnXkFtZTcwNzEzODI2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1947","placeOfBirth":" Kansas City, Missouri, USA","bio":"Holmes Osborne was born on November 7, 1947 in Kansas City, Missouri, USA. He is an actor, known for That Thing You Do! (1996), Affliction (1997) and Donnie Darko (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzA5Nzg0Ml5BMl5BanBnXkFtZTcwNzEzODI2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651660","name":"Holmes Osborne","idIMDB":"nm0651660"},"actorId":"nm0651660","character":"Dick Burns","urlCharacter":"http://www.imdb.com/character/ch0200710","main":true},{"actorName":"Sam Oz Stone","urlProfile":"http://www.imdb.com/name/nm1157948","urlPhoto":"","biography":{"bio":"Sam Oz Stone is an actor, known for The Box (2009), Red Riding Hood (2006) and Dirty Movie (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1157948","name":"Sam Oz Stone","idIMDB":"nm1157948"},"actorId":"nm1157948","character":"Walter Lewis","urlCharacter":"http://www.imdb.com/character/ch0200711","main":true},{"actorName":"Gillian Jacobs","urlProfile":"http://www.imdb.com/name/nm1843026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTc5MTM1OV5BMl5BanBnXkFtZTcwMTU4NDI1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1982","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Gillian McLaren Jacobs","height":"5' 4\" (1.63 m)","bio":"Gillian Jacobs was born on October 19, 1982 in Pittsburgh, Pennsylvania, USA as Gillian McLaren Jacobs. She is an actress, known for Community (2009), The Box (2009) and Don't Think Twice (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTc5MTM1OV5BMl5BanBnXkFtZTcwMTU4NDI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1843026","name":"Gillian Jacobs","nicknames":["Gill"],"idIMDB":"nm1843026"},"actorId":"nm1843026","character":"Dana","urlCharacter":"http://www.imdb.com/character/ch0200712","main":true},{"actorName":"Celia Weston","urlProfile":"http://www.imdb.com/name/nm0922927","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDIyMjE2NV5BMl5BanBnXkFtZTcwODk4NzY5Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1951","placeOfBirth":" Spartanburg, South Carolina, USA","height":"5' 8\" (1.73 m)","bio":"Direct from Spartanburg, South Carolina, this tall, blonde actress may not exude shimmering star potential, but she certainly has earned the respect of stage and film audiences alike for her many touching portrayals of matter-of-fact, down-to-earth Southern folk. For someone who first attracted attention as a hash-slinging replacement for Diane Ladd (herself a replacement for the ever-popular Polly Holliday) in the final, languishing years of the popular CBS sitcom Alice (1976), Celia Weston certainly has evolved into one of the more sought-after character performers of \"Deep South\" film drama. Born December 14, 1951, and raised in South Carolina, Celia, along with her sister, enjoyed creating their own little world of characters, acting out small skits and later began appearing in local plays. She did not, however, meet the unanimous encouragement of her family when the one-time art and psychology major at Salem College in Winston-Salem, North Carolina, decided to do an abrupt about-face and study acting. She earned an Artist Diploma in Drama at the North Carolina School of the Arts before moving to London to continue her training. More than determined, she eventually returned to the States in 1977 and studied with Uta Hagen and Herbert Berghof while slinging hash herself in New York City. In between, there was sporadic regional and off-off-Broadway work along with summer stock. At age 28, Celia made a big leap with her Broadway debut in \"Loose Ends\" (1979) starring Kevin Kline. Following her prime theater role in Edward Albee's \"The Lady from Dubuque\" in 1980 and a small part in Clint Eastwood's film Honky Tonk Freeway (1981), Hollywood showed her the money when she became the new Southern-fried waitress in town alongside Linda Lavin and Beth Howland on the \"Alice\" series. Her character of Jolene was given rather short shrift during the four seasons (1981-1985) she appeared. Although Celia valiantly tried the invest the role with some sass, she was the newcomer and was too often overshadowed by the other two. Following the show's demise, she had a number of lean years before her luck changed again. In 1988, she was handed a couple of featured roles in the movies Stars and Bars (1988) and A New Life (1988). Her penchant for toned-down, unaffected realism was not overlooked. While interspersing theater roles with the sudden upswing of film parts now coming her way, she finally came into her own in both venues in the mid-to-late 1990s. After earning critical applause for her brittle dramatic turn as the backwoods mother of a murdered child in Dead Man Walking (1995), she went on to win an Outer Critics Award and Tony nomination for her Southern matron in Broadway's acclaimed \"The Last Night of Ballyhoo\" (1997). Preferring art-house obscurity to mainstream popularity, Celia has stayed true for the most part with classier, character-driven drama and it has paid off in career dividends. An always interesting presence, her gals can tangle and backbite with the best of them or show true grit and/or extreme emotional fragility at times of unbearable sorrow. Celia has also played a variety of dialects over the years. A gregarious and eccentric turn as a possible mother to a searching Ben Stiller in the wonderful Flirting with Disaster (1996) led to her Civil War wife in Ride with the Devil (1999); her grieving, prejudicial Teutonic mother in Snow Falling on Cedars (1999); the part of Cate Blanchett's haughty aunt in The Talented Mr. Ripley (1999); and the Southern belle-like mental patient in K-Pax (2001). In addition, her Southern roots have complimented such Tennessee Williams' plays as \"Summer and Smoke\" and \"Suddenly Last Summer\" on Broadway. Into the millennium, Celia is still going strong. She has been a vibrant presence in such ensemble films as In the Bedroom (2001), Far from Heaven (2002) and The Village (2004). In 2005, she received one of her best roles in years as the dressed-down Southern matriarch in the obscure independent film Junebug (2005), which premiered at the Sundance Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDIyMjE2NV5BMl5BanBnXkFtZTcwODk4NzY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922927","name":"Celia Weston","idIMDB":"nm0922927"},"actorId":"nm0922927","character":"Lana Burns","urlCharacter":"http://www.imdb.com/character/ch0200713","main":true},{"actorName":"Deborah Rush","urlProfile":"http://www.imdb.com/name/nm0750658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjA5ODgwMV5BMl5BanBnXkFtZTYwNjY3Mzkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1954","placeOfBirth":" Chatham, New Jersey, USA","bio":"This delightful comic redhead from theater, films and TV customarily steals scenes with a mere vacant look or simply by opening her mouth. With her patent quirky demeanor and trademark scratchy voice she is one of those gifted characters that defies description. Deborah Rush was born on April 13, 1954, in Chatham, New Jersey and developed an early interest in making people laugh as a child. Following high school she decided to pursue acting head first, apprenticing with the Playhouse of the Ridiculous comedy troupe for starters. Deborah eventually headed for New York and made her Broadway debut in the Tony-winning musical \"Dance with Me\" (1975) which ran nearly a year. Later in the decade she appeared winningly in a number of New York Shakespeare productions for Joseph Papp including \"The Misanthrope\", \"All's Well That Ends Well\", and as Bianca to Meryl Streep's Katherine and Raul Julia's Petruchio in \"The Taming of the Shrew\". She also understudied Streep's Alice in Papp's \"Alice in Concert\" musical, based on the popular Lewis Carroll character. Film and TV began coming her way in the late 70s, making her movie debut in a bit part in Oliver's Story (1978), the wan remake of the romantic tearjerker Love Story (1970). By her second film, however, she was starting to grab notice even in the smallest of contributions. Who can forget her hilarious scene as the cooey-voiced dental assistant with patient Dudley Moore in Blake Edwards' 10 (1979)? Elsewhere, Deborah's stage performances in A Midsummer Night's Dream (1982) (as Hermia), and in the Streep musical Alice at the Palace (1982) were engagingly recaptured on TV. Deborah remained strongly rooted in the theatre over the years. Other plays that captured her special brand of eccentrics included \"Sister Mary Ignatius Explains It All for You\", \"Maybe I'm Doing It Wrong\", \"Lips Together, Teeth Apart\" and \"The Sisters Rosenzweig\". Sitcoms would have seemed a vital, natural direction for Deborah's brassy talents but, strangely, she seemed to avoid that type of work. In 1983 she returned to Broadway in 1983 and, for her portrayal of Brooke Ashton in the slapstick farce \"Noises Off\", captured a Tony nomination as well as a Drama Desk Award. She returned to Broadway a couple years later to co-star with Rosemary Harris and Campbell Scott in Noël Coward's \"Hay Fever\" (1985). Character stardom proved elusive although Deborah provided amusing secondary finesse for a sprinkling of notable directors over the years including Woody Allen (twice), John Schlesinger, Sidney Lumet, and John G. Avildsen, Frank Perry and in a number of independent films. Still in all, she has that constant habit of grabbing attention wherever she works. On television, she played the recurring role of the Mayor's wife on the comedy series Spin City (1996) and had a regular part on the short-lived but critically-acclaimed series Strangers with Candy (1999). A prequel of sorts was made later with the feature film version of Strangers with Candy (2005). She has also had wonderfully off-kilter roles in The Good Girl (2002) with Jennifer Aniston, and the second \"American Pie\" sequel American Wedding (2003). More recent sightings have included a Broadway return (after a two- decade absence) in the revival of \"Absurd Person Singular\" in 2005; the off-Broadway stage role of Henrietta Iscariot in \"The Last Days of Judas Iscariot\" opposite Sam Rockwell's title role; and standout supporting work in the dramatic film Half Nelson (2006) as Ryan Gosling's wacky mom. Interestingly, the comic-edged Deborah has been married since 1985 to Chip Cronkite (né Walter Leland Cronkite III), son of the iconic news anchor, and is the mother of their two sons: Walter Cronkite IV and Peter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjA5ODgwMV5BMl5BanBnXkFtZTYwNjY3Mzkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0750658","name":"Deborah Rush","idIMDB":"nm0750658"},"actorId":"nm0750658","character":"Clymene Steward","urlCharacter":"http://www.imdb.com/character/ch0176417","main":true},{"actorName":"Lisa K. Wyatt","urlProfile":"http://www.imdb.com/name/nm0943566","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzk5MjE5OV5BMl5BanBnXkFtZTcwMTUxMDYzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Lisa K. Wyatt is an actress and producer, known for The Office (2005), Donnie Darko (2001) and The Crazies (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzk5MjE5OV5BMl5BanBnXkFtZTcwMTUxMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943566","name":"Lisa K. Wyatt","idIMDB":"nm0943566"},"actorId":"nm0943566","character":"Rhonda Martin","urlCharacter":"http://www.imdb.com/character/ch0200714","main":true},{"actorName":"Mark S. Cartier","urlProfile":"http://www.imdb.com/name/nm2440805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE0Mzg5NjEzNl5BMl5BanBnXkFtZTcwMDA3MzE2OA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Mark S. Cartier regularly appears on stage as well as on screens both large and small. Career highlights include working with Mark Ruffalo and Zoe Saldana in Infinitely Polar Bear, with Frank Langella, James Rebhorn and James Marsden in The Box, and with Connie Britton on Friday Night Lights. While he is based in the Boston area, he travels wherever the work takes him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE0Mzg5NjEzNl5BMl5BanBnXkFtZTcwMDA3MzE2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2440805","name":"Mark S. Cartier","idIMDB":"nm2440805"},"actorId":"nm2440805","character":"Martin Teague","urlCharacter":"http://www.imdb.com/character/ch0200715","main":true},{"actorName":"Kevin Robertson","urlProfile":"http://www.imdb.com/name/nm0731925","urlPhoto":"","biography":{"bio":"Kevin Robertson is an actor, known for The Box (2009), Southland Tales (2006) and The Hunley (1999). He has been married to Kim Ikeda since 2006.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0731925","name":"Kevin Robertson","idIMDB":"nm0731925"},"actorId":"nm0731925","character":"Wendell Matheson","urlCharacter":"http://www.imdb.com/character/ch0396740","main":true},{"actorName":"Michele Durrett","urlProfile":"http://www.imdb.com/name/nm2065553","urlPhoto":"","biography":{"bio":"Michele Durrett is an actress and writer, known for The Box (2009), Southland Tales (2006) and Split Decision (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2065553","name":"Michele Durrett","idIMDB":"nm2065553"},"actorId":"nm2065553","character":"Rebecca Matheson","urlCharacter":"http://www.imdb.com/character/ch0200717","main":true},{"actorName":"Ian Kahn","urlProfile":"http://www.imdb.com/name/nm0434845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMyODgxMzMwMF5BMl5BanBnXkFtZTgwMzQ1MTc0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1972","placeOfBirth":" Manhattan, New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Ian Kahn was born on April 21, 1972 in Manhattan, New York City, New York, USA. He is an actor, known for The Box (2009), Bull (2000) and Secrets in the Walls (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMyODgxMzMwMF5BMl5BanBnXkFtZTgwMzQ1MTc0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0434845","name":"Ian Kahn","idIMDB":"nm0434845"},"actorId":"nm0434845","character":"Vick Brenner","urlCharacter":"http://www.imdb.com/character/ch0200718","main":true},{"actorName":"John Magaro","urlProfile":"http://www.imdb.com/name/nm1910274","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MzY0ODM4OV5BMl5BanBnXkFtZTcwODA5NjE0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"John Magaro is an actor, known for Carol (2015), Unbroken (2014) and The Big Short (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MzY0ODM4OV5BMl5BanBnXkFtZTcwODA5NjE0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1910274","name":"John Magaro","idIMDB":"nm1910274"},"actorId":"nm1910274","character":"Charles","urlCharacter":"http://www.imdb.com/character/ch0200719","main":true}],"seasons":[],"idIMDB":"tt0362478","urlIMDB":"http://www.imdb.com/title/tt0362478","business":{"budget":{"money":"$16,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,571,417","country":"USA","day":"08","month":"11","year":"2009","remarks":"2,635 Screens"},{"money":"£474,938","country":"UK","day":"06","month":"12","year":"2009","remarks":"296 Screens"}],"gross":[{"money":"$15,045,676","country":"USA","day":"03","month":"01","year":"2010","remarks":""},{"money":"$14,961,931","country":"USA","day":"20","month":"12","year":"2009","remarks":""},{"money":"$14,882,598","country":"USA","day":"13","month":"12","year":"2009","remarks":""},{"money":"$14,789,615","country":"USA","day":"06","month":"12","year":"2009","remarks":""},{"money":"$14,745,120","country":"USA","day":"29","month":"11","year":"2009","remarks":""},{"money":"$13,179,622","country":"USA","day":"15","month":"11","year":"2009","remarks":""},{"money":"$7,571,417","country":"USA","day":"08","month":"11","year":"2009","remarks":""},{"money":"£1,215,189","country":"UK","day":"20","month":"12","year":"2009","remarks":""},{"money":"£1,011,735","country":"UK","day":"13","month":"12","year":"2009","remarks":""},{"money":"£474,938","country":"UK","day":"06","month":"12","year":"2009","remarks":""}],"weekendGross":[{"money":"$20,397","country":"USA","day":"03","month":"01","year":"2010","remarks":"50 Screens"},{"money":"$40,680","country":"USA","day":"20","month":"12","year":"2009","remarks":"131 Screens"},{"money":"$81,601","country":"USA","day":"13","month":"12","year":"2009","remarks":"203 Screens"},{"money":"$22,155","country":"USA","day":"06","month":"12","year":"2009","remarks":"75 Screens"},{"money":"$95,374","country":"USA","day":"29","month":"11","year":"2009","remarks":"144 Screens"},{"money":"$3,158,368","country":"USA","day":"15","month":"11","year":"2009","remarks":"2,635 Screens"},{"money":"$7,571,417","country":"USA","day":"08","month":"11","year":"2009","remarks":"2,635 Screens"},{"money":"£62,854","country":"UK","day":"20","month":"12","year":"2009","remarks":"148 Screens"},{"money":"£249,707","country":"UK","day":"13","month":"12","year":"2009","remarks":"288 Screens"},{"money":"£474,938","country":"UK","day":"06","month":"12","year":"2009","remarks":"296 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"11","year":"2007","remarks":null},{"money":null,"country":null,"day":"01","month":"02","year":"2008","remarks":null}],"copyrightHolder":"MRC II Distribution Company, LP"},"technical":{"runtime":["1 hr 55 min (115 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Genesis HD Camera, Panavision Primo Lenses"],"laboratory":["Laser Pacific Media Corporation, Los Angeles (CA), USA (digital intermediate)","Technicolor, USA (color)"],"filmLength":["3,151 m (Sweden)","3,184 m (Portugal, 35mm)"],"negativeFormat":["Video (HDTV)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (1080p/24) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"5,6","metascore":"47","filmingLocations":[{"location":"Boston Public Library - 700 Boylston Street, Boston, Massachusetts, USA"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Supporting Actor","names":[{"name":"Frank Langella","id":"nm0001449","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Frank Langella","id":"nm0001449","role":null}]},{"category":"Best Score","names":[{"name":"Win Butler","id":"nm2562869","role":null},{"name":"Régine Chassagne","id":"nm1374751","role":null},{"name":"Owen Pallett","id":"nm2564754","role":null}]},{"category":"Worst Film","names":[]}]}]},{"award":"Visual Effects Society Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Supporting Visual Effects in a Feature Motion Picture","names":[{"name":"Peter 'Beak' Cvijanovic","id":"nm0194141","role":"compositing supervisor"},{"name":"Mark Kolpack","id":"nm0464366","role":"visual effects producer"},{"name":"Olcun Tan","id":"nm0006417","role":"digital effects supervisor"},{"name":"Thomas Tannenberger","id":"nm0849572","role":"visual effects supervisor"}]}]}]}],"votes":"78 389","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0023815","name":"Radar Pictures"},{"idCompany":"co0194736","name":"Media Rights Capital (MRC)"}],"keywords":{"keywords":["moral dilemma","nosebleed","alien","library","supernatural power","box","24 hours","decision","letter","mysterious stranger","gift","death","consequence","virginia","teacher","million dollars","key","december","briefcase of money","suitcase of money","boy","suburb","kiss","reference to johnny carson","television set","national security agency","central intelligence agency","murder by gunshot","violence","snowplow","champagne","startled","viking probes","tuxedo","arthur c clarke's third law","dancing","theatrical play","hundred dollar bill","missing toe","corvette","rain","brushing teeth","back from the dead","newspaper headline","newspaper clipping","sacrifice","bathtub","fake accent","southern accent","envelope","child in peril","limousine","gash in the face","locker room","bus stop","revelation","surrealism","map","ambulance","fire truck","friend","police officer","arrest","firefighter","pay phone","special forces","revolver","machine gun","hit by a truck","lightning","philosophy","research center","alien life form","gateway","wind tunnel","consciousness","science fiction magazine","rocket scientist","homicide","shot to death","suspense","temptation","stage play","monopoly the board game","amputee","physical deformity","mars the planet","toe","classified information","richmond virginia","lingerie slip","wedding rehearsal","wedding reception","teleportation","social experiment","shot through the chest","shot in the heart","schoolteacher","research scientist","regret","push button","prosthetic body part","private school","press conference","no opening credits","money","money problems","langley virginia","invasion","human nature","government agent","experiment","disability","christmas","christmas tree","bridesmaid","advanced technology","writing on a car windshield","wedding","water","theater","test","swimming pool","surveillance","supermarket","struck by lightning","stalking","snow","shot in the chest","scientist","school bus","santa claus","safe","rehearsal dinner","reflection in car mirror","portal","police station","pistol","photograph","mysterious package","murder","mother son relationship","mother daughter relationship","motel","mind control","locked in a room","limp","license plate","kidnapping","kicking in a door","jack daniels","husband wife relationship","husband murders wife","humiliation","human experiment","held at gunpoint","film starts with text","film reel","father son relationship","father in law son in law relationship","employee","driver's license","disfigurement","disfigured face","death of wife","deafness","corpse","cigarette smoking","character says i love you","car crash","burn victim","blindness","basement","babysitter","alien conspiracy","nasa","1970s","based on short story","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:14:26"}}