{"data":{"movies":[{"title":"Songs of the Silly Symphonies","originalTitle":"","year":"2001","releaseDate":"20011204","writers":[{"name":"Leonard Maltin","id":"nm0540795"}],"runtime":"12 min","countries":["USA"],"languages":["English"],"genres":["Documentary","Short"],"simplePlot":"","actors":[{"actorName":"Leonard Maltin","urlProfile":"http://www.imdb.com/name/nm0540795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTAxNDI1OV5BMl5BanBnXkFtZTcwMjUwNzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1950","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"Leonard Maltin is one of the most recognized and respected film critics of our time. He recently completed his 30th season with the long-running television show, Entertainment Tonight (1981). Maltin was born on December 18, 1950 in New York City and grew up in suburban Teaneck, New Jersey. He credits the huge volume of old movies shown on New York television - and access to the City's famous revival theaters, as well as the Museum of Modern Art - with his \"basic training\" in film history. He attended New York University as a journalism major, and quickly became entertainment editor of the campus' daily newspaper. He and a friend published their own home-grown magazine when they were in the fifth grade. This evolved into a mimeographed publication called \"Profile\", which reflected Leonard's growing interest in show business and film history. At the age of 13, he volunteered his services as a writer to two fanzines: \"The 8mm Collector\", of Indiana, Pennsylvania, and \"Film Fan Monthly\", of Vancouver, Canada. Two years later, he assumed responsibility for \"Film Fan Monthly\" and continued publishing it for the next nine years. It was that magazine that inspired an English teacher in his high school to suggest that he meet a friend of hers who was an editor at Signet Books. That meeting led to an offer for him to compile a paperback compendium of capsule movie reviews. The book was published in 1969, when Maltin was 18 and a freshman at NYU. Decades later, he is still best-known for that now-annual paperback reference, \"Leonard Maltin's Movie Guide\". A perennial best-seller, \"The Guide\" has become an indispensable tool for movie lovers and includes over 16,000 film reviews, with ratings and essential facts about each title. In 2005, he introduced a companion volume, \"Leonard Maltin's Classic Movie Guide\", which focuses on movies made before 1965, going back to the silent era. Leonard's other books include \"The Best 151 Movies You've Never Seen\", \"The Disney Films\", \"Of Mice and Magic: A History of American Animated Cartoons\", \"The Great American Broadcast: A Celebration of Radio's Golden Age\", \"The Great Movie Comedians\", \"The Art of the Cinematographer\", \"Selected Short Subjects\" and (as co-author) \"The Little Rascals: The Life and Times of Our Gang\". Leonard has been teaching at the USC School of Cinematic Arts for the last fifteen years. His popular class screens new films prior to their release, followed by a Q&A with the filmmakers. Guests over the years have included Alexander Payne, Judd Apatow, James Franco, David Lynch, Spike Jonze, Charlie Kaufman, Costa-Gavras, Bertrand Tavernier, Anthony Hopkins, Annette Bening, Paul Haggis, Paul Weitz, Mark Ruffalo, Walter Salles, Guillermo del Toro and Jason Segel, to name just a few. In addition to top writers and directors, Maltin welcomes costume and production designers, editors, composers, cinematographers, casting directors, and other creative collaborators, in order to explore all aspects of the filmmaking process. This direct access to top talent has proven to be invaluable in his students' own filmmaking endeavors. Leonard's reviews and signature on-air interviewing style can now be seen on his weekly program, Maltin on Movies (2010), on ReelzChannel, where he has appeared since the channel went on the air. He also previews movies-on-demand on Comcast and appears regularly on \"Turner Classic Movies\". For three years, he co-hosted the weekly syndicated movie review program, \"Hot Ticket\", which was produced by Entertainment Tonight (1981). Leonard is a prolific freelance writer, whose articles have appeared in \"The New York Times\", \"The Los Angeles Times\", \"The London Times\", \"Smithsonian\", \"TV Guide\", \"Esquire\", \"The Village Voice\" and \"American Film\". He has contributed to Oxford University Press' \"American National Biography\", and was the film critic for \"Playboy\" magazine for six years. Additionally, Leonard frequently lectures on film and was a member of the faculty of New York City's \"New School for Social Research\" for nine years. He served as Guest Curator at the \"Museum of Modern Art\" film department in New York on two separate occasions. Leonard created, hosted and co-produced the popular \"Walt Disney Treasures\" DVD series and appeared on Warner Home Video's \"Night at the Movies\" features. He has written a number of television specials, including \"Fantasia: The Creation of a Disney Classic and has hosted, produced and written such video documentaries and compilations as The Making of 'The Quiet Man' (1992), The Making of 'High Noon' (1992), \"Cartoons for Big Kids\", The Lost Stooges (1990), \"Young Duke: The Making of a Movie Star\", Cliffhangers! Adventures from the Thrill Factory (1993) and _Cartoon Madness: The Fantastic Max Fleischer Cartoons (1900)_. In 2006, he was named by the Librarian of Congress to join the Board of Directors of the National Film Preservation Foundation. He also has received awards and citations from the American Society of Cinematographers, Anthology Film Archives, The Society of Cinephiles and the Telluride Film Festival. In 1997, he was made a voting member of the National Film Registry, which selects 25 landmark American films every year. Perhaps the greatest indication of his fame was his appearance in a now-classic episode of the animated series, South Park (1997). He has been married, since 1975, to fellow movie lover Alice Tlusty Maltin. They are the proud parents of Jessie Maltin (aka Jessica Bennett Maltin), who in recent years has become a valued contributor to the annual Movie Guide.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTAxNDI1OV5BMl5BanBnXkFtZTcwMjUwNzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0540795","name":"Leonard Maltin","idIMDB":"nm0540795"},"actorId":"nm0540795","character":"Himself - Interviewer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard M. Sherman","urlProfile":"http://www.imdb.com/name/nm0792556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzgxNzE5MV5BMl5BanBnXkFtZTcwNTg2MTQxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1928","placeOfBirth":" New York City, New York, USA","birthName":"Richard Morton Sherman","bio":"Richard Morton Sherman was born in the spring of 1928 in New York City to Rosa and Al Sherman. Together with his older brother, Robert B. Sherman, the Sherman brothers would follow in their songwriting father's footsteps to form one of the most prolific, lauded and long lasting songwriting partnerships of all time. Richard was an enthusiastic and energetic child and youth, still bearing that trademark trait well into his seventies. Following seven years of frequent cross-country moves, the Shermans finally settled down in Beverly Hills, California in 1937. Throughout Richard's years at Beverly Hills High School and Bard College in upstate New York, he became fascinated with music and studied several instruments including the flute, piccolo and piano. At Bard, Richard majored in music and wrote numerous sonatas and \"art songs\" during his time there but it was Richard's ambition to write the \"Great American Symphony\" which eventually led him to write songs. Within two years of graduating, Richard and his brother Robert began writing songs together on a challenge from their father. In 1957, Richard married Elizabeth Gluck with whom he had three children. In 1958, the Sherman brothers enjoyed their first hit with their song, \"Tall Paul\", sung by Mouseketeer Annette Funicello. The success of this song yielded the attention of Walt Disney, who eventually hired the Sherman brothers on as staff songwriters for Walt Disney Studios. While at Disney, the Sherman brothers wrote what is perhaps their most well-loved song: \"It's a Small World (After All)\" for the New York World's Fair in 1964. Since then, \"Small World\" has become the most translated and performed song on earth. In 1965, the Sherman brothers won 2 Academy Awards for Mary Poppins (1964), which includes the songs \"Feed The Birds\", \"Supercalifragilisticexpialidocious\" and the Oscar winner, \"Chim Chim Cher-ee\". Since Mary Poppins (1964)' motion picture premiere, the Sherman brothers have subsequently earned nine Academy Award nominations, two Grammy Awards, four Grammy Award nominations, and an incredible 23 gold and platinum albums. Robert and Richard worked directly for Walt Disney until his death in 1966. Since leaving the company, the brother songwriting team has worked freelance on scores of motion pictures, television shows, theme park exhibits and stage musicals. Their first non-Disney assignment came with Albert R. Broccoli's motion picture production Chitty Chitty Bang Bang (1968), which garnered the brothers their third Academy Award nomination. In 1973, the Sherman brothers made history by becoming the only Americans, ever, to win First Prize at the Moscow Film Festival for Tom Sawyer (1973). They also authored the screenplay for \"Tom Sawyer\". In 1976, The Slipper and the Rose: The Story of Cinderella (1976), was picked to be the Royal Command Performance of the year, and the event was attended by Her Royal Highness, Queen Elizabeth, the Queen Mother. A modern musical adaptation of the classic Cinderella story, \"Slipper\" also features both songscore and screenplay by the Sherman brothers. That same year, the Sherman brothers received their star on the Hollywood \"Walk of Fame\" directly across from Grauman's Chinese Theater. Their numerous other Disney and Non-Disney top box office film credits include The Jungle Book (1967), Les aristochats (1970), The Parent Trap (1961), Charlotte's Web (1973), The Many Adventures of Winnie the Pooh (1977), Snoopy Come Home (1972), Bedknobs and Broomsticks (1971), and Little Nemo: Adventures in Slumberland (1989). Outside the motion picture realm, their Tony-nominated smash hit, \"Over Here!\" (1974) was the biggest grossing original Broadway musical of that year. The Sherman brothers have also written numerous top selling songs including \"You're Sixteen\", which holds the distinction of reaching Billboard's #1 spot twice; first with Johnny Burnette in 1960 and, then, with Ringo Starr, fourteen years later. Other top-ten hits include \"Pineapple Princess\", \"Let's Get Together\", and more. In 2000, the Sherman brothers wrote the song score for Disney's blockbuster film The Tigger Movie (2000). This film marked the brother's first major motion picture for the Disney company in over 28 years. In 2002, \"Chitty\" hit the London stage and received rave revues. \"Chitty Chitty Bang Bang: The Stage Musical\" is currently the most successful stage show ever produced at the London Palladium. In 2005, a second company will premiere on Broadway (New York City). The Sherman brothers wrote an additional six songs specifically for the new stage productions. In 2003, four Sherman brothers' musicals ranked in the \"Top 10 Favorite Children's Films of All Time\" in a (British) nationwide poll reported by the BBC. The Jungle Book (1967) ranked at #7, Mary Poppins (1964) ranked at #8, Les aristochats (1970) ranked at #9 and Chitty Chitty Bang Bang (1968) topped the list at #1. Richard Sherman resides in Beverly Hills, California with his wife, Elizabeth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzgxNzE5MV5BMl5BanBnXkFtZTcwNTg2MTQxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0792556","name":"Richard M. Sherman","idIMDB":"nm0792556"},"actorId":"nm0792556","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0340369","urlIMDB":"http://www.imdb.com/title/tt0340369","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© Disney Enterprises, Inc."},"technical":{"runtime":["12 min"],"soundMix":null,"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.8","filmingLocations":[],"awards":[],"votes":"29","type":"Video","companyCreditsSimple":[{"idCompany":"co0108380","name":"Buena Vista Home Entertainment (BVHE)"},{"idCompany":"co0072428","name":"Kurtti-Pellerin"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:05:24"}}