{"data":{"movies":[{"title":"Tout... sauf en famille","originalTitle":"Four Christmases","year":"2008","releaseDate":"20081126","directors":[{"name":"Seth Gordon","id":"nm1164861"}],"writers":[{"name":"Matt Allen","id":"nm0020820"},{"name":"Caleb Wilson","id":"nm0933128"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjA0NDAwNF5BMl5BanBnXkFtZTcwOTU4MTM5MQ@@._V1.jpg","countries":["Germany","USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"Brad and Kate have been together three years, in love, having fun, doing all sorts of things together with no intention of marriage or children. Christmas morning, they're on their way to Fiji, having told their two sets of divorced parents that they're off to do charity work. Through a fluke, they have no choice but to visit each of their four idiosyncratic parents. As the day progresses, Brad and Kate remember growing up, each learns more about the other, and Kate realizes that her life may not be as good as it could be. Do they know each other well enough to weather the storms families bring?","simplePlot":"A couple struggles to visit all four of their divorced parents on Christmas.","actors":[{"actorName":"Vince Vaughn","urlProfile":"http://www.imdb.com/name/nm0000681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDA0MzE0MF5BMl5BanBnXkFtZTYwOTUzOTI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1970","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Vincent Anthony Vaughn","height":"6' 5\" (1.96 m)","bio":"Vincent Anthony Vaughn was born on March 28, 1970, in Minneapolis, Minnesota, USA, and was raised in Lake Forest, Illinois. His parents are Vernon Vaughn, a salesman and character actor, and Sharon Vaughn (née Sharon Eileen DePalmo), a real-estate agent and stockbroker. They divorced in 1991. He has two older sisters, Victoria Vaughn and Valeri Vaughn. His recent ancestry includes Lebanese (from his paternal grandmother), Italian (from his maternal grandfather), English, Irish, German, and Scottish. His mother was born in Brantford, Ontario. Vince was interested in theater early on and grabbed a spot in a Chevy commercial. In 1988 he moved to Hollywood. He managed to hit a few spots on television, but his real goal was to make it to the big screen. He made his first credited role in the film Rudy (1993) where he met his friend Jon Favreau, who was writing a script detailing his life as an out-of-work actor. Vince was written into Swingers (1996) by Jon to play the character of \"Trent\". He signed on just as a favor to his buddy, not realizing it would be a career changing role. Though not a commercial success, it was a critical success in which Steven Spielberg saw him and cast him in the big budget sequel The Lost World: Jurassic Park (1997). This role gave Vince the exposure he needed to become a movie star and, for the first time, choose the roles he wanted to take. A Cool, Dry Place (1998) put him as a loving father, Return to Paradise (1998) cast him as a man having to make a life or death decision to save a friend, and Clay Pigeons (1998) cast him as an interesting serial killer. Since then his roles have been primarily in comedies such as Old School (2003), Dodgeball: A True Underdog Story (2004), Wedding Crashers (2005), and Couples Retreat (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDA0MzE0MF5BMl5BanBnXkFtZTYwOTUzOTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000681","name":"Vince Vaughn","nicknames":["Mr Sunshine"],"idIMDB":"nm0000681"},"actorId":"nm0000681","character":"Brad","urlCharacter":"http://www.imdb.com/character/ch0093390","main":true},{"actorName":"Reese Witherspoon","urlProfile":"http://www.imdb.com/name/nm0000702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDcxMDA5Ml5BMl5BanBnXkFtZTgwNDM1NTU5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1976","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Laura Jeanne Reese Witherspoon","height":"5' 1½\" (1.56 m)","bio":"Laura Jeanne Reese Witherspoon was born on March 22, 1976 at Southern Baptist Hospital (now Memorial Medical Center) in New Orleans, Louisiana. She is the second child of Mary Elizabeth \"Betty\" (Reese) and Dr. John Draper Witherspoon, Sr. Her father was a military surgeon specializing in ear, nose and throat. Her mother was a Registered Nurse who later became a Ph.D in pediatric nursing. Reese spent the first four years of her life in Wiesbaden, Germany, where her father served as a lieutenant colonel in the US Army reserves. Shortly after, John moved the family back to the States, settling in Nashville, Tennessee. Reese was introduced to the entertainment industry at a very early age. At age 7, she began modeling. This led to appearances on several local television commercials. At age 11, she placed first in a Ten-State Talent Fair. In 1990, she landed her first major acting role in Robert Mulligan's The Man in the Moon (1991). Her role as a 14-year old tomboy earned her rave reviews. Roles in bigger films such as Jack the Bear (1993) and A Far Off Place (1993) followed shortly after. Following high school graduation in 1994 from Harpeth Hall, a Nashville all girls school, Reese decided to put her acting career on hold and attend Stanford University where she would major in English literature. However, her collegiate plans were shortly dashed when she accepted roles to star in two major motion pictures: Fear (1996) alongside Mark Wahlberg and Freeway (1996) with Kiefer Sutherland. Although neither film was a huge box-office success, they did help to establish Reese as a rising starlet in Hollywood and open the door for bigger and better film roles. Those bigger roles came in movies such as Pleasantville (1998), Election (1999) and Cruel Intentions (1999). Her breakthrough role came as Elle Woods in the 2001 comedy Legally Blonde (2001). The movie was huge box-office smash and established Reese as one of the top female draws in Hollywood. The next year, she scored a follow-up hit with Sweet Home Alabama (2002) which went on to gross over $100 million dollars at the box office. In 2006, she took home the best actress Oscar for her role as June Carter Cash in the Johnny Cash biopic Walk the Line (2005). In the late 2000s and early 2010s, Reese continued to star in more romantic comedies such as Tout... sauf en famille (2008) and How Do You Know (2010). In December 2010, she received a star on the Hollywood Walk of Fame. In the year 2014, she produced both Gone Girl (2014) and Wild (2014) for which she got nominated for best actress Oscar again for her role as Cheryl Strayed Off the screen, she was married to Ryan Phillippe from 1999 to 2007. They met at her 21st birthday party and subsequently worked together in Cruel Intentions (1999). They have two children: a daughter, Ava Elizabeth (born 9 September 1999) and a son, Deacon (born 23 October 2003). In March 2011, Reese remarried talent agent Jim Toth. She gave birth to a second son, Tennessee (born 27 September 2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDcxMDA5Ml5BMl5BanBnXkFtZTgwNDM1NTU5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000702","name":"Reese Witherspoon","idIMDB":"nm0000702"},"actorId":"nm0000702","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Duvall","urlProfile":"http://www.imdb.com/name/nm0000380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1931","placeOfBirth":" San Diego, California, USA","birthName":"Robert Selden Duvall","height":"5' 9½\" (1.77 m)","bio":"Veteran actor and director Robert Selden Duvall was born on January 5, 1931, in San Diego, CA, to Mildred Virginia (Hart), an amateur actress, and William Howard Duvall, a career military officer who later became an admiral. Duvall majored in drama at Principia College (Elsah, IL), then served a two-year hitch in the army after graduating in 1953. He began attending The Neighborhood Playhouse School of the Theatre In New York City on the G.I. Bill in 1955, studying under Sanford Meisner along with Dustin Hoffman, with whom Duvall shared an apartment. Both were close to another struggling young actor named Gene Hackman. Meisner cast Duvall in the play \"The Midnight Caller\" by Horton Foote, a link that would prove critical to his career, as it was Foote who recommended Duvall to play the mentally disabled \"Boo Radley\" in To Kill a Mockingbird (1962). This was his first \"major\" role since his 1956 motion picture debut as an MP was in Somebody Up There Likes Me (1956), starring Paul Newman. Duvall began making a name for himself as a stage actor in New York, winning an Obie Award in 1965 playing incest-minded longshoreman \"Eddie Carbone\" in the off-Broadway revival of Arthur Miller's \"A View from the Bridge\", a production for which his old roommate Hoffman was assistant director. He found steady work in episodic TV and appeared as a modestly billed character actor in films, such as Arthur Penn's The Chase (1966) with Marlon Brando and in Robert Altman's Countdown (1967) and Francis Ford Coppola's The Rain People (1969), in both of which he co-starred with James Caan. He was also memorable as the heavy who is shot by John Wayne at the climax of True Grit (1969) and was the first \"Maj. Frank Burns\", creating the character in Altman's Korean War comedy MASH (1970). He also appeared as the eponymous lead in George Lucas' directorial debut, THX 1138 (1971). It was Francis Ford Coppola, casting The Godfather (1972), who reunited Duvall with Brando and Caan and provided him with his career breakthrough as mob lawyer \"Tom Hagen\". He received the first of his six Academy Award nominations for the role. Thereafter, Duvall had steady work in featured roles in such films as The Godfather: Part II (1974), The Killer Elite (1975), Network (1976), The Seven-Per-Cent Solution (1976) and The Eagle Has Landed (1976). Occasionally this actor's actor got the chance to assay a lead role, most notably in Tomorrow (1972), in which he was brilliant as William Faulkner's inarticulate backwoods farmer. He was less impressive as the lead in Badge 373 (1973), in which he played a character based on real-life NYPD detective Eddie Egan, the same man his old friend Gene Hackman had won an Oscar for playing, in fictionalized form as \"Popeye Doyle\" in The French Connection (1971). It was his appearance as \"Lt. Col. Kilgore\" in another Coppola picture, Apocalypse Now (1979), that solidified Duvall's reputation as a great actor. He got his second Academy Award nomination for the role, and was named by the Guinness Book of World Records as the most versatile actor in the world. Duvall created one of the most memorable characters ever assayed on film, and gave the world the memorable phrase, \"I love the smell of napalm in the morning!\". Subsequently, Duvall proved one of the few established character actors to move from supporting to leading roles, with his Oscar-nominated turns in The Great Santini (1979) and Tender Mercies (1983), the latter of which won him the Academy Award for Best Actor. Now at the summit of his career, Duvall seemed to be afflicted with the fabled \"Oscar curse\" that had overwhelmed the careers of fellow Academy Award winners Luise Rainer, Rod Steiger and Cliff Robertson. He could not find work equal to his talents, either due to his post-Oscar salary demands or a lack of perception in the industry that he truly was leading man material. He did not appear in The Godfather: Part III (1990), as the studio would not give in to his demands for a salary commensurate with that of Al Pacino, who was receiving $5 million to reprise Michael Corleone. His greatest achievement in his immediate post-Oscar period was his triumphant characterization of grizzled Texas Ranger Gus McCrae in the TV mini-series Lonesome Dove (1989), for which he received an Emmy nomination. He received a second Emmy nomination and a Golden Globe for his portrayal of Soviet dictator Joseph Stalin in Stalin (1992), and a third Emmy nomination playing Nazi war criminal Adolf Eichmann in The Man Who Captured Eichmann (1996). The shakeout of his career doldrums was that Duvall eventually settled back into his status as one of the premier character actors in the industry, rivaled only by his old friend Gene Hackman. Duvall, unlike Hackman, also has directed pictures, including the documentary We're Not the Jet Set (1977), Angelo My Love (1983) and Assassination Tango (2002). As a writer-director, Duvall gave himself one of his most memorable roles, that of the preacher on the run from the law in The Apostle (1997), a brilliant performance for which he received his third Best Actor nomination and fifth Oscar nomination overall. The film brought Duvall back to the front ranks of great actors, and was followed by a Best Supporting Actor Oscar nod for A Civil Action (1998). Robert Duvall will long be remembered as one of the great naturalistic American screen actors in the mode of Spencer Tracy and his frequent co-star Marlon Brando. His performances as \"Boo Radley\" in To Kill a Mockingbird (1962), \"Jackson Fentry\" in Tomorrow (1972), \"Tom Hagen\" in the first two \"Godfather\" movies, \"Frank Hackett\" in Network (1976), \"Lt. Col. Kilgore\" in Apocalypse Now (1979), \"Bull Meechum\" in The Great Santini (1979), \"Mac Sledge\" in Tender Mercies (1983), \"Gus McCrae\" in Lonesome Dove (1989) and \"Sonny Dewey\" in The Apostle (1997) rank as some of the finest acting ever put on film. It's a body of work that few actors can equal, let alone surpass.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000380","name":"Robert Duvall","nicknames":["Bob"],"idIMDB":"nm0000380"},"actorId":"nm0000380","character":"Howard","urlCharacter":"http://www.imdb.com/character/ch0169822","main":true},{"actorName":"Sissy Spacek","urlProfile":"http://www.imdb.com/name/nm0000651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwMTU4NTMwMF5BMl5BanBnXkFtZTgwMDMyMTg4MTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1949","placeOfBirth":" Quitman, Texas, USA","birthName":"Mary Elizabeth Spacek","height":"5' 3\" (1.6 m)","bio":"As a kid, Sissy Spacek climbed trees, rode horses, swam, and played in the woods. She was born Mary Elizabeth Spacek on December 25, 1949, in Quitman, Texas, to Virginia Frances (Spilman) and Edwin Arnold Spacek, Sr., a county agricultural agent. Her father's family was of Czech and German origin. Sissy attended Quitman High School and was homecoming queen. After graduating, she embarked on an acting career, gaining interest in the profession through her cousin, actor Rip Torn. Sissy relocated to New York, and through him, enrolled in the New York branch of the Actors Studio. She studied acting at the Lee Strasberg Institute while also pursuing work as a model and singer, appearing in West Village showcases such as the Bitter End for $10 a night. Sissy eventually broke into film and one of her first roles was as Holly in the classic Badlands (1973). The art director on that film was Jack Fisk, with whom she would marry in 1974 and ultimately collaborate on eight films. Sissy followed this landmark film with a star-making and Oscar nominated performance in Carrie (1976), in which she played a humiliated prom queen who goes postal with her telekinesis. Sissy has had an enduring and award winning career in movies and television, which includes an Oscar as Best Actress for Coal Miner's Daughter (1980). The parents of two grown daughters, Sissy and Jack live on a large horse ranch in the foothills of Virginia's Blue Ridge Mountains. Even though she continued to appear in film and television during the late 1980s and 1990s, Sissy devoted most of those years to her family. Then, in 2001, Sissy returned to the big screen in a major way with a powerful performance in In the Bedroom (2001), which not only earned her a sixth Best Actress Oscar nomination, but a win for Best Actress at the Golden Globes, Independent Spirit Awards, and numerous critics association awards. Sissy continues to work steadily as an actress, but in 2012, her credits expanded even further to include a memoir, My Extraordinary Ordinary Life, as well as planning her directorial debut on the in-development film Sweet Tea.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwMTU4NTMwMF5BMl5BanBnXkFtZTgwMDMyMTg4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000651","name":"Sissy Spacek","idIMDB":"nm0000651"},"actorId":"nm0000651","character":"Paula","urlCharacter":"http://www.imdb.com/character/ch0139139","main":true},{"actorName":"Jon Voight","urlProfile":"http://www.imdb.com/name/nm0000685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTE3NDA3M15BMl5BanBnXkFtZTgwMDMyNTM1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1938","placeOfBirth":" Yonkers, New York, USA","birthName":"Jonathan Vincent Voight","height":"6' 2½\" (1.89 m)","bio":"Jon Voight was born on December 29, 1938 in Yonkers, New York, USA as Jonathan Vincent Voight. He is an actor, known for Mission: Impossible (1996), Heat (1995) and Transformers (2007). He was previously married to Marcheline Bertrand and Lauri Peters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTE3NDA3M15BMl5BanBnXkFtZTgwMDMyNTM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000685","name":"Jon Voight","idIMDB":"nm0000685"},"actorId":"nm0000685","character":"Creighton","urlCharacter":"http://www.imdb.com/character/ch0202902","main":true},{"actorName":"Jon Favreau","urlProfile":"http://www.imdb.com/name/nm0269463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgwNDg0MTI1MF5BMl5BanBnXkFtZTcwNzg0MDQzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1966","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Jonathan Kolia Favreau","height":"6' 1\" (1.85 m)","bio":"Initially an indie film favorite, actor Jon Favreau has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director. The amiable, husky-framed actor with the tight, crinkly hair was born in Queens, New York on October 19, 1966, the only child of Madeleine, an elementary school teacher, and Charles Favreau, a special education teacher. His father has French-Canadian, German, and Italian ancestry, and his mother was from a Jewish family. He attended the Bronx High School of Science before furthering his studies at Queens College in 1984. Dropping out just credits away from receiving his degree, Jon moved to Chicago where he focused on comedy and performed at several Chicago improvisational theaters, including the ImprovOlympic and the Improv Institute. He also found a couple of bit parts in films. While there, he earned another bit role in the film, Rudy (1993), and met fellow castmate Vince Vaughn. Their enduring personal friendship would play an instrumental role in furthering both their professional careers within just a few years. Jon broke into TV with a role on the classic series, Seinfeld (1989) (as \"Eric the Clown\"). After filming rudimentary roles in the movies Mrs. Parker and the Vicious Circle (1994), Notes from Underground (1995) and Batman Forever (1995), he decided to do some risk taking by writing himself and friend Vaughn into what would become their breakthrough film. Swingers (1996), which he also co-produced, centers on Jon as a luckless, struggling actor type who is emotionally shattered after losing his girlfriend, but is pushed back into the L.A. social scene via the help of cool, worldly, outgoing actor/buddy Vaughn. These two blueprint roles went on to define the character types of both actors on film. In 1997, Jon appeared favorably on several episodes of the popular TV sitcom, Friends (1994), as \"Pete Becker\", the humdrum but extremely wealthy suitor for Courteney Cox's \"Monica\" character, and also appeared to fine advantage on the Tracey Takes On... (1996) comedy series. He later took on the biopic mini-movie, Rocky Marciano (1999), portraying the prizefighter himself in a highly challenging dramatic role and received excellent reviews. Other engagingly offbeat \"everyman\" films roles came Jon's way -- the ex-athlete in the working class film, Dogtown (1997); a soon-to-be groom whose bachelor party goes horribly awry in the comedy thriller Very Bad Things (1998); a newlywed opposite Famke Janssen in Love & Sex (2000); a wild and crazy linebacker in The Replacements (2000); as Ben Affleck's legal partner in Daredevil (2003); and another down-and-out actor in The Big Empty (2003). He wrote and directed himself and Vaughn as two fellow boxers who involve themselves in criminal activity in Made (2001). Both he and Vaughn produced. He also directed the highly popular Will Ferrell comedy, Elf (2003), in which he had a small part. Jon went on to re-team favorably with his friend, Vince Vaughn, who enjoyed a meteoric rise into the comedy star ranks, in such light-weight features as The Break-Up (2006), Tout... sauf en famille (2008) and Couples Retreat (2009), the last of which he co-wrote with Vaughn. He also made great strides as a producer/director in recent years with the exciting mega-box office action-packed Iron Man (2008), starring Robert Downey Jr. and its sequel, Iron Man 2 (2010). Favreau's marriage to Joya Tillem on November 24, 2000, produced son Max and two daughters, Madeleine and Brighton Rose. Joya is the niece of KGO (AM) lawyer and talk show host, Len Tillem. On the sly, the actor/writer/producer/director enjoys playing on the World Poker Tour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgwNDg0MTI1MF5BMl5BanBnXkFtZTcwNzg0MDQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269463","name":"Jon Favreau","nicknames":["Favs"],"idIMDB":"nm0269463"},"actorId":"nm0269463","character":"Denver","urlCharacter":"http://www.imdb.com/character/ch0112308","main":true},{"actorName":"Mary Steenburgen","urlProfile":"http://www.imdb.com/name/nm0005460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI5OTc0Nl5BMl5BanBnXkFtZTcwNjc5NDMwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1953","placeOfBirth":" Newport, Arkansas, USA","birthName":"Mary Nell Steenburgen","height":"5' 8\" (1.73 m)","bio":"Mary Steenburgen is an Academy Award-winning American actress. She was born February 8, 1953, in Newport, Arkansas, USA. Her mother, Nellie May (Wall) Steenburgen, was a school-board secretary, and her father, Maurice H. Steenburgen, was a freight-train conductor. Her surname comes from distant Dutch ancestry, and her roots also include English, Scottish, and Welsh. Young Steenburgen was fond of arts and literature. Mary grew up tap-dancing her way through talent shows and school functions. She was active in her school drama class. After appearing in a number of high school plays, she enrolled at Hendrix College, a highly progressive Southern School located in Conway, Arkansas. Upon the recommendation of her drama professor, she left college in 1972 and moved to New York to study acting professionally. In the past several years, Mary Steenburgen has emerged as one of the most accomplished and sought-after screen actresses. Ever since Jack Nicholson 'discovered' her and cast her as a sassy adventuress in his rollicking western, Goin' South (1978), her career has skyrocketed and she has won acclaim for exceptional performances in each of her diverse film roles. In Nicholas Meyer's Time After Time (1979), Steenburgen was afforded critical praise for her portrayal of a somewhat dippy but liberated young bank clerk in San Francisco who crosses paths, via time machine, with English author H.G. Wells (played by Malcolm McDowell, who later became her husband. In 1980 she shot to fame with her role as Lynda Dummar in Melvin and Howard (1980) for which she won Oscar for Best Actress in a Supporting Role. More recently, Steenburgen again impressed audiences and critics alike with her stunning performance as the strong-willed turn-of-the-century Mother in Ragtime (1981). Steenburgen is a notable patron of arts. She is also an active supporter of humanitarian causes. She has two children from her previous marriage to actor Malcolm McDowell. Since 1995 she has been married to actor Ted Danson, and the couple is living in Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI5OTc0Nl5BMl5BanBnXkFtZTcwNjc5NDMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005460","name":"Mary Steenburgen","idIMDB":"nm0005460"},"actorId":"nm0005460","character":"Marilyn","urlCharacter":"http://www.imdb.com/character/ch0150939","main":true},{"actorName":"Dwight Yoakam","urlProfile":"http://www.imdb.com/name/nm0948267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODQyMzE5MV5BMl5BanBnXkFtZTcwMjQ3MDUwMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1956","placeOfBirth":" Pikeville, Kentucky, USA","birthName":"Dwight David Yoakam","height":"6' (1.83 m)","bio":"Since the start of his music career, Dwight Yoakam has proven he's more than just another guy with a guitar and a hat. He has risen from hot country star to being one of country music's biggest influences. While doing that, he has also become a critically acclaimed actor. Dwight Yoakam was born in the coal mining community of Pikeville, Kentucky, October 23, 1956. Soon after his birth, his family moved to Columbus, Ohio, where he was raised. As part of the Drama Club in his days at Northland High School in Columbus, he acted in school plays. He played Helen Keller's brother in his sophomore year in the school's production of \"The Miracle Worker.\" He followed that his Junior year playing the lead as Charlie in \"Flowers for Algernon.\" He capped off his high school acting career as Richard Bravo in The \"Demon Seed.\" In 1977, Dwight moved to Nashville to pursue a career in music. At the time, Nashville was moving away from the traditional country sound that he was playing. After a brief time there, he moved to California, which was more receptive to the music he was doing. He hooked up with producer/guitar virtuoso Pete Anderson in 1982. That began a musical relationship that became country music's equivalent to rock's Glimmer Twins (Mick Jagger and Keith Richards). Financial backing to make a high-quality recording came from Dwight's sister and brother-in-law, an insurance check that was meant to fix Dwight's El Camino and money raised from a benefit classical music concert staged by UCLA music professor Dr. Robert Winter. With the EP (extended play) that captured the \"Dwight Yoakam sound.\" In 1984, Dwight released the six-song EP \"Guitars, Cadillacs, Etc., Etc.\" on the independent Oak label, and then hit the road with such artists as Los Lobos and Violent Femmes. Playing traditional country music, Dwight gained a following among not only country fans but punk rockers and rockabilly fans as well. This eclectic fan base brought him to the attention of many record labels. Warner Brothers signed him to its newly revived Reprise Record label in 1985. The EP's title and tracks were kept intact and more songs added to make a full album. At the time, country music was in the waning days of its Urban Cowboy (1980) phase, and fans of country were hungry for something \"new.\" This new sound was a return to a more traditional style that had been abandoned when John Travolta put on a cowboy hat. After establishing himself in the music industry, Dwight set his sights on his second love, acting. In 1991 he appeared as a stuntman/country singer in an episode of P.S.I. Luv U (1991). This became the beginning of his professional acting career. In 1992, he appeared on the big screen for the first time in the Nicolas Cage/Dennis Hopper film Red Rock West (1993). In 1993, Dwight released what is considered his masterpiece, the album \"This Time.\" He supported the album with a tour that lasted over a year and covered the world. In 1994, he received his first Grammy for the album's single, \"Ain't That Lonely Yet.\" In 1996, he co-starred in Billy Bob Thornton's film Sling Blade (1996). His work as the evil Doyle Hargraves left audiences speechless and critics hailing his performance. Dwight was included with the cast who were among the nominees for \"Best Cast\" by the Screen Actors Guild awards. As the 1990s drew to a close, Dwight proved that his music didn't have to suffer as he pursued more ventures into movies. While filming The Newton Boys (1998), he wrote what many consider his most personal album, \"A Long Way Home.\" All the tracks were written solely by Dwight. He began 1999 with a Grammy win for his contribution to the track \"Same Old Train\" from the various artists' album \"Tribute to Tradition.\" He then added two new items to his resume: director and screenwriter. In South of Heaven, West of Hell (2000), he not only starred, he made his directorial debut with a screenplay he authored. Dwight Yoakam continues to prove that he is able to successfully have careers in both film and music, without either profession suffering.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODQyMzE5MV5BMl5BanBnXkFtZTcwMjQ3MDUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0948267","name":"Dwight Yoakam","idIMDB":"nm0948267"},"actorId":"nm0948267","character":"Pastor Phil","urlCharacter":"http://www.imdb.com/character/ch0170243","main":true},{"actorName":"Tim McGraw","urlProfile":"http://www.imdb.com/name/nm0005210","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcyNTkyOTY4OV5BMl5BanBnXkFtZTcwODI2NzQ5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1967","placeOfBirth":" Delhi, Louisiana, USA","birthName":"Samuel Timothy Smith","height":"6' (1.83 m)","bio":"Three-time Grammy Award winner Tim McGraw, the son of former major league reliever Tug McGraw, is a country music superstar who has sold over 40 million albums. Eleven of his album have debuted at No. 1 on the Billboard country album chart and he has had 21 hit No. 1 singles on the Billboard Hot Country 100 chart. He and his wife Faith Hill won Grammy Awards in 2001 and 2006 for their duos \"Let's Make Love\" and \"Like We Never Loved At All\". An aspiring actor, McGraw has appeared in eight movies between 2004 and 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcyNTkyOTY4OV5BMl5BanBnXkFtZTcwODI2NzQ5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005210","name":"Tim McGraw","idIMDB":"nm0005210"},"actorId":"nm0005210","character":"Dallas","urlCharacter":"http://www.imdb.com/character/ch0117509","main":true},{"actorName":"Kristin Chenoweth","urlProfile":"http://www.imdb.com/name/nm0155693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NzEyMTQ5MV5BMl5BanBnXkFtZTcwMzg3NTUyMg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1968","placeOfBirth":" Broken Arrow, Oklahoma, USA","birthName":"Kristi Dawn Chenoweth","height":"4' 11\" (1.5 m)","bio":"Kristin Chenoweth is an American stage, screen and television actress, though, depending on who you ask, Cheno fans may disagree on what her most famous roles are. Since Chenoweth began her career, she has been credited with roles in musicals and plays on and off-Broadway, on various television shows and can be seen in movies on television and the big screen. She has also lent her recognizable voice numerous times to animated features. Chenoweth was born in the small town of Broken Arrow, OK. Soon after her birth, Chenoweth was adopted by Jerry and Junie Chenoweth. She is very open about her adoption and has been known to support various adoption causes and organizations around the U.S. Although Chenoweth knows the backgrounds of her birth parents, she has commented that she has little interest in meeting them. The Chenoweth family includes older brother Mark. Chenoweth graduated from Broken Arrow High School and went on to study Musical Theater at Oklahoma City University. Under the guidance of Florence Birdwell, Chenoweth flourished in stage and vocal performance. She later received her Master's Degree in Opera Performance at OCU. An avid fan of all things Oklahoman, Chenoweth was inducted into the 2010 State Hall of Fame. Fans of Kristin Chenoweth, the stage actress, have seen her stealing performances in Steel Pier, Epic Proportions, and The Apple Tree. In 1999, Chenoweth received the Tony Award for her performance as \"Sally\" in \"You're a Good Man, Charlie Brown\". Chenoweth is well-known as the originator of \"Glinda\" in the 2003 mega-hit musical \"Wicked\". The role, written with Chenoweth in mind, earned her a Tony Award Nomination amongst many other accolades. Chenoweth returned to Broadway in 2010, alongside Sean Hayes in the Broadway revival of \"Promises, Promises\". In January of 2007, Chenoweth became the third musical theater performer in history to have a solo performance at NYC's Metropolitan Opera. She has also performed with various Symphonies around the world. Chenoweth has recorded 3 studio albums. Those who know Kristin best from her various television performances remember her as the quirky, down on love, \"Olive Snook\" on Pushing Daisies (2007). The role won Ms. Chenoweth an Emmy Award in 2009 for Outstanding Supporting Actress in a Comedy Series. The show, ultimately canceled shortly after its 2nd season, is still considered by Kristin to be one of her favorite characters to play. In 2001, Chenoweth starred in the short-lived NBC comedy Kristin (2001). She has also been seen on The West Wing (1999), Ugly Betty (2006) and has a recurring role on Fox's Glee (2009) as the recovering alcoholic has-been, but lovable \"April Rhodes\" . Her appearances on \"Glee\" earned her a 3rd Emmy nomination. Most recently, Ms. Chenoweth had a small part in the 2010 comedy, You Again (2010). She has also had roles in Tout... sauf en famille (2008), Deck the Halls (2006), Running with Scissors (2006) and Stranger Than Fiction (2006). In 2009, Chenoweth took on the challenging role as \"Linda\" in the film, Into Temptation (2009). Ms. Chenoweth is bi-coastal spending a good amount of time in both New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NzEyMTQ5MV5BMl5BanBnXkFtZTcwMzg3NTUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0155693","name":"Kristin Chenoweth","nicknames":["Cheno","The K-Cho","K-Cho"],"idIMDB":"nm0155693"},"actorId":"nm0155693","character":"Courtney","urlCharacter":"http://www.imdb.com/character/ch0134442","main":true},{"actorName":"Katy Mixon","urlProfile":"http://www.imdb.com/name/nm1737500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjEzNDM2Nl5BMl5BanBnXkFtZTgwMzI1NDc3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1981","placeOfBirth":" Pensacola, Florida, USA","birthName":"Katy Elizabeth Mixon","height":"5' 7\" (1.7 m)","bio":"Katy Mixon was born and raised in Pensacola, Florida. She was one of seven children. She graduated from the Carnegie Mellon School of Drama. Mixon's first acting job came in 2001, playing \"Calpurnia\" in the Utah Shakespearean Festival's presentation of Shakespeare's \"Julius Caesar\". Mixon moved to Los Angeles, California, in 2003. In 2005, she starred in the premiere of the interactive theater play, \"American Standard\", at the Los Angeles Edgefest. Mixon has performed at Upright Cabaret. Her first role in a major motion picture was in the 2005 thriller, The Quiet (2005), playing the character, \"Michelle Fell\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjEzNDM2Nl5BMl5BanBnXkFtZTgwMzI1NDc3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1737500","name":"Katy Mixon","idIMDB":"nm1737500"},"actorId":"nm1737500","character":"Susan","urlCharacter":"http://www.imdb.com/character/ch0202903","main":true},{"actorName":"Colleen Camp","urlProfile":"http://www.imdb.com/name/nm0131974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzM2NTgyNV5BMl5BanBnXkFtZTcwNTMxNzcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1953","placeOfBirth":" San Francisco, California, USA","birthName":"Colleen Celeste Camp","height":"5' 2½\" (1.59 m)","bio":"Colleen Camp was born in San Francisco, California. She began working as a juvenile actress at the age of 3 and was eventually 'discovered' while working as a bird trainer at Busch Gardens. She appeared on The Dean Martin Show (1965) and made her film debut in Battle for the Planet of the Apes (1973). She has since gone on to appear in over 100 major motion pictures and television productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzM2NTgyNV5BMl5BanBnXkFtZTcwNTMxNzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0131974","name":"Colleen Camp","idIMDB":"nm0131974"},"actorId":"nm0131974","character":"Aunt Donna","urlCharacter":"http://www.imdb.com/character/ch0202911","main":true},{"actorName":"Jeanette Miller","urlProfile":"http://www.imdb.com/name/nm0588563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODYzNzY4NV5BMl5BanBnXkFtZTcwNDY5MzMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Jeanette Miller is an actress, known for The Truman Show (1998), Legion (2010) and Austin Powers: The Spy Who Shagged Me (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODYzNzY4NV5BMl5BanBnXkFtZTcwNDY5MzMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588563","name":"Jeanette Miller","idIMDB":"nm0588563"},"actorId":"nm0588563","character":"Gram-Gram","urlCharacter":"http://www.imdb.com/character/ch0169823","main":true},{"actorName":"Jack Donner","urlProfile":"http://www.imdb.com/name/nm0232800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTI2ODM5OF5BMl5BanBnXkFtZTYwMjM0ODky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1928","placeOfBirth":" Los Angeles, California, USA","birthName":"Jake Doner","bio":"Widely known and admired as Romulan Subcommander Tal in the original Star Trek (1966), Jack Donner has worked steadily in TV, film and theater since the 1950s. Born and raised in Los Angeles, he did his first professional theater and TV work there before heading for New York during the glory days of TV, appearing in many prestigious early shows like Studio One in Hollywood (1948), and soap operas such as As the World Turns (1956) and Guiding Light (1952). He also did seven seasons of New York regional and stock theater. Returning to L.A., he worked his way up to guest star and co-star status in shows like The Streets of San Francisco (1972), Mannix (1967), Kojak (1973), The Man from U.N.C.L.E. (1964), the aforementioned Star Trek (1966) episode \"The Enterprise Incident\", and eleven episodes (the most by any guest star in any series) of Mission: Impossible (1966). He also founded, with fellow actor Lee Delano, his own theater and drama school. His students included Barry Levinson, Craig T. Nelson, Barbara Parkins, and Don Johnson. Recent TV credits include Baywatch (1989), Buffy the Vampire Slayer (1997), Frasier (1993), Charmed (1998), General Hospital (1963), Chicken Soup for the Soul (1999), Good vs Evil (1999), Malcolm in the Middle (2000) and Roswell (1999), and as a regular in The Privateers (2000). Donner has assayed a wide variety of roles in recent feature films such as Gideon (1998) (with Christopher Lambert and Charlton Heston), and Family Tree (1999) (with Robert Forster). With his deep, resonant voice, silver-white hair and patrician profile, he has recently been compared with Vincent Price for his roles in a run of classy horror flicks, as Afzel the sorcerer in Retro Puppet Master (1999), the mysterious Father Almeida in Stigmata (1999), the manipulative Dr. Bassett in Demon Under Glass (2002), and the obsessed Father Lansing in Exorcism (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTI2ODM5OF5BMl5BanBnXkFtZTYwMjM0ODky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0232800","name":"Jack Donner","idIMDB":"nm0232800"},"actorId":"nm0232800","character":"Grandpa","urlCharacter":"http://www.imdb.com/character/ch0228988","main":true},{"actorName":"Steve Wiebe","urlProfile":"http://www.imdb.com/name/nm2528248","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NjIxMzg1N15BMl5BanBnXkFtZTYwNzkyMDA3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Steve Wiebe is an actor, known for Horrible Bosses (2011), The King of Kong: A Fistful of Quarters (2007) and Tout... sauf en famille (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NjIxMzg1N15BMl5BanBnXkFtZTYwNzkyMDA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2528248","name":"Steve Wiebe","idIMDB":"nm2528248"},"actorId":"nm2528248","character":"Jim","urlCharacter":"http://www.imdb.com/character/ch0202951","main":true}],"seasons":[],"idIMDB":"tt0369436","urlIMDB":"http://www.imdb.com/title/tt0369436","business":{"budget":{"money":"$80,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$31,069,826","country":"USA","day":"30","month":"11","year":"2008","remarks":"3,310 Screens"},{"money":"£2,275,585","country":"UK","day":"30","month":"11","year":"2008","remarks":"434 Screens"},{"money":"AUD 1,806,622","country":"Australia","day":"07","month":"12","year":"2008","remarks":"200 Screens"},{"money":"$9,185","country":"Estonia","day":"21","month":"12","year":"2008","remarks":"3 Screens"},{"money":"€891,972","country":"France","day":"04","month":"01","year":"2009","remarks":"208 Screens"},{"money":"€335,431","country":"Germany","day":"07","month":"12","year":"2008","remarks":"155 Screens"},{"money":"PHP 776,336","country":"Philippines","day":"07","month":"12","year":"2008","remarks":"14 Screens"},{"money":"€50,209","country":"Portugal","day":"07","month":"12","year":"2008","remarks":"16 Screens"},{"money":"SGD 248,559","country":"Singapore","day":"30","month":"11","year":"2008","remarks":"26 Screens"}],"gross":[{"money":"$120,146,040","country":"USA","day":"12","month":"02","year":"2009","remarks":""},{"money":"$120,136,047","country":"USA","day":"08","month":"02","year":"2009","remarks":""},{"money":"$120,073,790","country":"USA","day":"01","month":"02","year":"2009","remarks":""},{"money":"$119,924,307","country":"USA","day":"25","month":"01","year":"2009","remarks":""},{"money":"$119,651,861","country":"USA","day":"18","month":"01","year":"2009","remarks":""},{"money":"$119,209,383","country":"USA","day":"11","month":"01","year":"2009","remarks":""},{"money":"$118,189,834","country":"USA","day":"04","month":"01","year":"2009","remarks":""},{"money":"$111,588,896","country":"USA","day":"28","month":"12","year":"2008","remarks":""},{"money":"$100,110,827","country":"USA","day":"21","month":"12","year":"2008","remarks":""},{"money":"$87,775,974","country":"USA","day":"14","month":"12","year":"2008","remarks":""},{"money":"$69,418,170","country":"USA","day":"07","month":"12","year":"2008","remarks":""},{"money":"$46,054,468","country":"USA","day":"30","month":"11","year":"2008","remarks":""},{"money":"£10,222,998","country":"UK","day":"04","month":"01","year":"2009","remarks":""},{"money":"£9,832,403","country":"UK","day":"28","month":"12","year":"2008","remarks":""},{"money":"£8,517,758","country":"UK","day":"21","month":"12","year":"2008","remarks":""},{"money":"£6,660,435","country":"UK","day":"14","month":"12","year":"2008","remarks":""},{"money":"£4,713,869","country":"UK","day":"07","month":"12","year":"2008","remarks":""},{"money":"£2,275,585","country":"UK","day":"30","month":"11","year":"2008","remarks":""},{"money":"€1,349,132","country":"France","day":"25","month":"01","year":"2009","remarks":""},{"money":"€1,262,250","country":"France","day":"18","month":"01","year":"2009","remarks":""},{"money":"€1,189,770","country":"France","day":"11","month":"01","year":"2009","remarks":""},{"money":"€891,972","country":"France","day":"04","month":"01","year":"2009","remarks":""},{"money":"PHP 636,754","country":"Philippines","day":"21","month":"12","year":"2008","remarks":""},{"money":"PHP 2,003,718","country":"Philippines","day":"14","month":"12","year":"2008","remarks":""},{"money":"PHP 776,336","country":"Philippines","day":"07","month":"12","year":"2008","remarks":""}],"weekendGross":[{"money":"$33,156","country":"USA","day":"08","month":"02","year":"2009","remarks":"87 Screens"},{"money":"$84,577","country":"USA","day":"01","month":"02","year":"2009","remarks":"183 Screens"},{"money":"$208,689","country":"USA","day":"25","month":"01","year":"2009","remarks":"310 Screens"},{"money":"$263,862","country":"USA","day":"18","month":"01","year":"2009","remarks":"362 Screens"},{"money":"$373,436","country":"USA","day":"11","month":"01","year":"2009","remarks":"777 Screens"},{"money":"$2,811,390","country":"USA","day":"04","month":"01","year":"2009","remarks":"2,307 Screens"},{"money":"$4,840,221","country":"USA","day":"28","month":"12","year":"2008","remarks":"2,510 Screens"},{"money":"$7,701,375","country":"USA","day":"21","month":"12","year":"2008","remarks":"3,515 Screens"},{"money":"$13,074,470","country":"USA","day":"14","month":"12","year":"2008","remarks":"3,540 Screens"},{"money":"$16,755,478","country":"USA","day":"07","month":"12","year":"2008","remarks":"3,335 Screens"},{"money":"$31,069,826","country":"USA","day":"30","month":"11","year":"2008","remarks":"3,310 Screens"},{"money":"£96,918","country":"UK","day":"04","month":"01","year":"2009","remarks":"128 Screens"},{"money":"£275,693","country":"UK","day":"28","month":"12","year":"2008","remarks":"300 Screens"},{"money":"£1,064,615","country":"UK","day":"21","month":"12","year":"2008","remarks":"401 Screens"},{"money":"£1,130,188","country":"UK","day":"14","month":"12","year":"2008","remarks":"419 Screens"},{"money":"£1,498,592","country":"UK","day":"07","month":"12","year":"2008","remarks":"435 Screens"},{"money":"£2,275,585","country":"UK","day":"30","month":"11","year":"2008","remarks":"434 Screens"},{"money":"€891,972","country":"France","day":"04","month":"06","year":"2009","remarks":"208 Screens"},{"money":"€1,120","country":"France","day":"25","month":"01","year":"2009","remarks":"8 Screens"},{"money":"€25,857","country":"France","day":"18","month":"01","year":"2009","remarks":"60 Screens"},{"money":"€226,070","country":"France","day":"11","month":"01","year":"2009","remarks":"207 Screens"},{"money":"PHP 2,888,464","country":"Philippines","day":"21","month":"12","year":"2008","remarks":"14 Screens"},{"money":"PHP 1,013,708","country":"Philippines","day":"14","month":"12","year":"2008","remarks":"14 Screens"},{"money":"PHP 776,336","country":"Philippines","day":"07","month":"12","year":"2008","remarks":"14 Screens"}],"admissions":[{"money":"208,652","country":"France","day":"13","month":"01","year":"2009","remarks":""},{"money":"162,239","country":"France","day":"06","month":"01","year":"2009","remarks":""},{"money":"36,781","country":"Greece","day":"28","month":"12","year":"2008","remarks":""},{"money":"32,112","country":"Greece","day":"21","month":"12","year":"2008","remarks":""},{"money":"20,706","country":"Greece","day":"14","month":"12","year":"2008","remarks":""},{"money":"64,879","country":"Netherlands","day":"31","month":"12","year":"2009","remarks":""},{"money":"46,876","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""}],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":"Ott Medien GmbH &amp; Co. KG"},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe (prints)","EFilm (digital intermediate)","FotoKem Laboratory, Burbank (CA), USA (color)","Technicolor (color)"],"filmLength":["2,525 m (Portugal, 35 mm)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm"]},"rating":"5.6","metascore":"41","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"BMI Film & TV Awards 2009","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Alex Wurman","id":"nm0943391","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie Actress","names":[{"name":"Reese Witherspoon","id":"nm0000702","role":null}]}]}]}],"votes":"51,184","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046718","name":"New Line Cinema"},{"idCompany":"co0031181","name":"Spyglass Entertainment"},{"idCompany":"co0180082","name":"Wild West Picture Show Productions"}],"keywords":{"keywords":["christmas","airport","playing a board game","blonde woman","one year later","holiday season","holiday in title","appeared on tv news","caught in a lie","character appears on tv","2000s","vomiting on someone","boyfriend girlfriend conflict","sexual role playing","news broadcast","tv broadcast","tv news","cancelled flight","budweiser","two word title","newborn baby","vomiting","vomiting on another person","vomiting on a shirt","baby vomiting","lying to one's parents","hostile brothers","undressing","three brothers","argument in car","argument between couple","family argument","hospital room","photo album","pastor","news report","tv news reporter","bouncy castle","christmas movie","christmas day","reference to santa claus","exploding tv","reference to john grisham","reference to ricardo montalban","reference to celine dion","camera shot of feet","elvis","elvis presley","satellite television","telephone","older woman younger man relationship","xbox 360","wrestling","telephone call","streaking","streaker","sister sister relationship","satellite tv","satellite dish","pregnancy test","pregnancy scare","nativity play","mother son relationship","mother daughter relationship","mobile phone","large family","husband wife relationship","hawaiian shirt","former best friend","father son relationship","father daughter relationship","family relationships","falling off a roof","ex husband ex wife relationship","dysfunctional family","christmas with family","christmas present","christmas party","christmas gift","cell phone","brother brother relationship","boyfriend girlfriend relationship","airport personnel","airline employee","baby","san francisco california","divorce","title spoken by character","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:56:58"}}