{"data":{"movies":[{"title":"Failure to Launch","originalTitle":"","year":"2006","releaseDate":"20060310","directors":[{"name":"Tom Dey","id":"nm0223359"}],"writers":[{"name":"Tom J. Astle","id":"nm0040022"},{"name":"Matt Ember","id":"nm0256079"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTc2MDQ3NV5BMl5BanBnXkFtZTcwNDUwMjEzMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"At 35, Tripp has an interesting job, a hip car, a passion for sailing, and a great house - trouble is, he lives with his parents. They want him out, so they hire Paula, an \"interventionist,\" who has a formula in these cases: chance encounter, get him to ask her out, involve him in a trauma, meet his friends and get their nod, delay sex, have him teach her something, then launch him. It's worked up to now, but this gets complicated when Tripp thinks she's getting too serious and one of his pals is attracted to Paula's deadpan, semi-alcoholic roommate, who's plagued by a mockingbird. Too many secrets may scrub the launch, and what if Paula really likes him? Who can intervene then?","simplePlot":"A thirty-something, is still living at home until his parents hire an interventionist to help him graduate out of the house. That's when the fun begins.","actors":[{"actorName":"Matthew McConaughey","urlProfile":"http://www.imdb.com/name/nm0000190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1969","placeOfBirth":" Uvalde, Texas, USA","birthName":"Matthew David McConaughey","height":"6' (1.83 m)","bio":"American actor and producer Matthew David McConaughey was born in Uvalde, Texas. His mother, Mary Kathleen (McCabe), is a substitute school teacher originally from New Jersey. His father, James Donald McConaughey, was a Mississippi-born gas station owner who ran an oil pipe supply business. He is of Scottish, Irish, English, German, and Swedish descent. Matthew grew up in Longview, Texas, where he graduated from the local High School (1988). Showing little interest in his father's oil business, which his two brothers later joined, Matthew was longing for a change of scenery, and spent a year in Australia, washing dishes and shoveling chicken manure. Back to the States, he attended the University of Texas in Austin, originally wishing to be a lawyer. But, when he discovered an inspirational Og Mandino book \"The Greatest Salesman in the World\" before one of his final exams, he suddenly knew he had to change his major from law to film. He began his acting career in 1991, appearing in student films and commercials in Texas and directed short films as Chicano Chariots (1992). Once, in his hotel bar in Austin, he met the casting director and producer Don Phillips, who introduced him to director Richard Linklater for his next project. At first, Linklater thought Matthew was too handsome to play the role of a guy chasing high school girls in his coming-of-age drama Dazed and Confused (1993), but cast him after Matthew grew out his hair and mustache. His character was initially in three scenes but the role grew to more than 300 lines as Linklater encouraged him to do some improvisations. In 1995, he starred in Texas Chainsaw Massacre: The Next Generation (1994), playing a mad bloodthirsty sadistic killer, opposite Renée Zellweger. Shortly thereafter, moving to L.A., Matthew became a sensation with his performances in two high-profile 1996 films Lone Star (1996), where he portrayed killing suspected sheriff and in the film adaptation of John Grisham's novel A Time to Kill (1996), where he played an idealistic young lawyer opposite Sandra Bullock and Kevin Spacey. The actor was soon being hailed as one of the industry's hottest young leading man inspiring comparisons to actor Paul Newman. His following performances were Robert Zemeckis' Contact (1997) with Jodie Foster (the film was finished just before the death of the great astronomer and popularizer of space science Carl Sagan) and Steven Spielberg's Amistad (1997), a fact-based 1839 story about the rebellious African slaves. In 1998, he teamed again with Richard Linklater as one of the bank-robbing brothers in The Newton Boys (1998), set in Matthew's birthplace, Uvalde, Texas. During this time, he also wrote, directed and starred in the 20-minute short The Rebel (1998). In 1999, he starred in the comedy Edtv (1999), about the rise of reality television, and in 2000, he headlined Jonathan Mostow's U-571 (2000), portraying officer Lt. Tyler, in a WW II story of the daring mission of American submariners trying to capture the Enigma cipher machine. In the 2000s, he became known for starring in romantic comedies, such as Un mariage trop parfait (2001), opposite Jennifer Lopez, and How to Lose a Guy in 10 Days (2003), in which he co-starred with Kate Hudson. He played Denton Van Zan, an American warrior and dragons hunter in the futuristic thriller Reign of Fire (2002), where he co-starred with Christian Bale. In 2006, he starred in the romantic comedy Failure to Launch (2006), and later as head coach Jack Lengyel in We Are Marshall (2006), along with Matthew Fox. In 2008, he played treasure hunter Benjamin \"Finn\" Finnegan in Fool's Gold (2008), again with Kate Hudson. After playing Connor Mead in Ghosts of Girlfriends Past (2009), co-starring with Jennifer Garner, McConaughey took a two year hiatus to open different opportunities in his career. Since 2010, he has moved away from romantic comedies. That change came in 2011, in his first movie after that pause, when he portrayed criminal defense attorney Mickey Haller in The Lincoln Lawyer (2011), that operates mostly from the back seat of his Lincoln car. After this performance that was considered one of his best until then, Matthew played other iconic characters as district attorney Danny Buck Davidson in Bernie (2011), the wild private detective \"Killer\" Joe Cooper in Killer Joe (2011), Mud in Mud (2012), reporter Ward Jensen in The Paperboy (2012), male stripper club owner Dallas in Magic Mike (2012), starring Channing Tatum. McConaughey's career certainly reached it's prime, when he played HIV carrier Ron Woodroof in the biographical drama Dallas Buyers Club (2013), shot in less than a month. For his portrayal of Ron, Matthew won the Best Actor in the 86th Academy Awards, as well as the Golden Globe Award for Best Actor, among other awards and nominations. The same year, he also appeared in Martin Scorsese's The Wolf of Wall Street (2013). In 2014, he starred in HBO's True Detective (2014), as detective Rustin Cohle, whose job is to investigate with his partner Martin Hart, played by Woody Harrelson, a gruesome murder that happened in his little town in Louisiana. The series was highly acclaimed by critics winning 4 of the 7 categories it was nominated at the 66th Primetime Emmy Awards; he also won a Critics' Choice Award for the role. Later in 2014, Matthew starred in Christopher Nolan's sci-fi film Interstellar (2014), playing Cooper, a former NASA pilot.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000190","name":"Matthew McConaughey","idIMDB":"nm0000190"},"actorId":"nm0000190","character":"Tripp","urlCharacter":"http://www.imdb.com/character/ch0016261","main":true},{"actorName":"Sarah Jessica Parker","urlProfile":"http://www.imdb.com/name/nm0000572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDY0MzMxMV5BMl5BanBnXkFtZTcwMzMxNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1965","placeOfBirth":" Nelsonville, Ohio, USA","height":"5' 3\" (1.6 m)","bio":"Sarah Jessica Parker was born March 25, 1965, in Nelsonville, Ohio, to Barbra Forste (née Keck), a teacher who ran a nursery school, and Stephen Parker, a journalist. Her parents divorced, and her mother later remarried to Paul Forste and had four more children, bringing the total to eight. Sarah now had 3 full siblings and 4 half siblings. Her father was of Eastern European Jewish ancestry, and her mother had German, and some English, roots. Trained in singing and ballet, Sarah was cast in the Broadway production of \"The Innocents\", which prompted her family to relocate to New Jersey. Already a professional performer (she studied at the American Ballet School and the Professional Children's School), Sarah was cast in \"The Sound of Music\" (along with four of her siblings), and landed the lead in the Broadway run of \"Annie\". After a year as the free-spirited orphan, Sarah attended Dwight Morrow High School, while continuing to add more credits to her acting resume. She landed a role in the made-for-TV movie My Body, My Child (1982), before being cast as one of the lead roles in the 1982 sitcom Square Pegs (1982), as high-schooler Patty Green. Once a graduate, Sarah decided to pursue a full-time acting career rather than further her education. Since Square Pegs (1982) did not last more than a year, Sarah moved on to supporting film roles in movies such as Footloose (1984), Firstborn (1984), and the lead role in the teenage film Girls Just Want to Have Fun (1985). Sarah was having lots of fun, although she had yet to land a star-turning role. After more television appearances in series and made-for-TV movies including A Year in the Life (1986), The Room Upstairs (1987) and A Long Way from Home: Dadah Is Death (1988), Sarah finally landed the role of Steve Martin's bubbly lover in the 1991 comedy L.A. Story (1991). More substantial film roles soon followed, starting with a role opposite Nicolas Cage in Honeymoon in Vegas (1992) (which foreshadowed her comedic talent), Hocus Pocus (1993) and Ed Wood (1994). A big Woody Allen fan, she starred opposite the renowned filmmaker in the television movie The Sunshine Boys (1996), and that same year, she landed a starring role in Miami Rhapsody (1995). 1996 was a film intensive year with roles in The First Wives Club (1996), If Lucy Fell (1996), and Mars Attacks! (1996). All the while making a name for herself in film, Sarah was gaining respect as a theater actress, with her lead role as a dog (hard to imagine, but true) in the off-Broadway \"Sylvia\", and her Broadway roles in \"How to Succeed in Business Without Really Trying\" (starring her present husband, Matthew Broderick), and the Tony-Award nominated \"Once Upon a Mattress\". But Sarah's star has shot up since her portrayal of Manhattan sex-columnist Carrie Bradshaw in the HBO series Sex and the City (1998). Sarah's Golden Globe Best Actress victory in 2000 only underscores the fact that she plays the role of Carrie as though it were literally written for her. Sarah has been happily married to fellow actor Matthew Broderick for quite a while now. Before the marriage, she dated Robert Downey Jr. (who she also lived with), and the late John Kennedy Jr. When not serving as lead actress and producer of Sex and the City (1998), Sarah is a member of Hollywood's Women's Political Committee, and is UNICEF's representative for the Performing Arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDY0MzMxMV5BMl5BanBnXkFtZTcwMzMxNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000572","name":"Sarah Jessica Parker","nicknames":["SJP"],"idIMDB":"nm0000572"},"actorId":"nm0000572","character":"Paula","urlCharacter":"http://www.imdb.com/character/ch0016260","main":true},{"actorName":"Zooey Deschanel","urlProfile":"http://www.imdb.com/name/nm0221046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjM2NDE1OF5BMl5BanBnXkFtZTcwMjA2NDU5OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Zooey Claire Deschanel","height":"5' 5\" (1.65 m)","bio":"Zooey Deschanel was born in 1980 into a showbiz family. Her father, Caleb Deschanel, is an Academy Award-nominated cinematographer (perhaps most notably for The Passion of the Christ (2004)) and her mother, Mary Jo Deschanel (née Weir), is an actress who appeared in Twin Peaks (1990). Her paternal grandfather was French, and her other roots include English, German, Scottish, Irish, and Dutch. Driven from an early age to become a successful actress, Zooey got her big break, at age 17, playing a model in the TV sitcom, Veronica's Closet (1997). She got her first film role, the following year, in Mumford (1999), which prompted her to quit university to pursue acting full-time. Mostly thanks to a role in Cameron Crowe's popular biopic, Almost Famous (2000), Zooey's rise to fame has been steadily increasing as the 21st century wears on. Her distinctive acting style found her critical acclaim in 2003, when she was voted Best Actress at the Mar Del Plata Film Festival for her role in David Gordon Green's All the Real Girls (2003). She also gained a Best Female Lead nomination (for All the Real Girls (2003)) at the following year's Independent Spirit Awards, but lost out to Charlize Theron. Zooey has appeared in such films as 500 Days of Summer (2009), Our Idiot Brother (2011), Yes Man (2008) (opposite Jim Carrey), Elf (2003) (opposite Will Farrell), Your Highness (2011), The Happening (2008) (opposite Mark Wahlberg), The Hitchhiker's Guide to the Galaxy (2005) and is the star of the FOX sitcom, New Girl (2011). Zooey is often compared to golden era Hollywood starlets and is also a talented singer. She has said in interviews that she believes her singing ability was pivotal in gaining the role of \"Jovie\" in Elf (2003). She also sang (and acted) in the Disney-produced musical, The Wonderful World of Disney: Once Upon a Mattress (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjM2NDE1OF5BMl5BanBnXkFtZTcwMjA2NDU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0221046","name":"Zooey Deschanel","nicknames":["Zo","Zuzu"],"idIMDB":"nm0221046"},"actorId":"nm0221046","character":"Kit","urlCharacter":"http://www.imdb.com/character/ch0071582","main":true},{"actorName":"Justin Bartha","urlProfile":"http://www.imdb.com/name/nm0058581","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTk4NTk0MV5BMl5BanBnXkFtZTcwODEyNjA1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1978","placeOfBirth":" West Bloomfield, Michigan, USA","birthName":"Justin Lee Bartha","height":"5' 8\" (1.73 m)","bio":"Justin Bartha was born on July 21, 1978 in West Bloomfield, Michigan, USA as Justin Lee Bartha. He is an actor and producer, known for The Hangover (2009), The Hangover Part II (2011) and National Treasure (2004). He has been married to Lia Smith since January 4, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTk4NTk0MV5BMl5BanBnXkFtZTcwODEyNjA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0058581","name":"Justin Bartha","idIMDB":"nm0058581"},"actorId":"nm0058581","character":"Ace","urlCharacter":"http://www.imdb.com/character/ch0053298","main":true},{"actorName":"Bradley Cooper","urlProfile":"http://www.imdb.com/name/nm0177896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1975","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Bradley Charles Cooper","height":"6' 1\" (1.85 m)","bio":"Bradley Charles Cooper was born in Philadelphia, Pennsylvania. His mother, Gloria (Campano), is of Italian descent, and worked for a local NBC station. His father, Charles John \"Charlie\" Cooper, who was of Irish descent, was a stockbroker. He has a sister, Holly. Immediately after Bradley graduated from the Honors English program at Georgetown University in 1997, he moved to New York City to enroll in the Masters of Fine Arts program at the Actors Studio Drama School at New School University. There, he developed his stage work, culminating with his thesis performance as \"John Merrick\" in Bernard Pomerance's \"The Elephant Man\", performed in New York's Circle in the Square. While still in school, Bradley began his professional career, appearing opposite Sarah Jessica Parker in Sex and the City (1998) and in the series, The Beat (2000). His weekends were spent with LEAP (Learning through the Expanded Arts Program), a non-profit organization that teaches acting and movement to inner city school children. The summers took him all across the globe, from kayaking in British Columbia with Orca Whales to ice-climbing in the Peruvian Andes, while hosting Lonely Planet's Treks in a Wild World (2000) for the Discovery Channel. Bradley had to skip his graduation ceremony from the Actor's Studio in order to star in his first feature film, Wet Hot American Summer (2001). After finishing his second feature, Bending All the Rules (2002), his plans to relocate to Los Angeles were delayed when Darren Star hired him to star in the series The $treet (2000). Bradley went on to win the role of young law student Gordon Pinella in the film Changing Lanes (2002), starring Ben Affleck and Samuel L. Jackson, and also played Travis Paterson in My Little Eye (2002). He finally decided that it was time to forgo his other New York projects and move to Los Angeles when he was cast in Alias (2001). After supporting roles in Wedding Crashers (2005), Failure to Launch (2006), The Comebacks (2007), The Rocker (2008), and Yes Man (2008), Cooper broke out with major roles in He's Just Not That Into You (2009), The Hangover (2009), and Valentine's Day (2010). He co-starred in the action film The A-Team (2010) and headlined the thriller Limitless (2011). Cooper received an Academy Award nomination for Best Actor after starring opposite 'Jennifer Lawrence' in David O. Russell's Silver Linings Playbook (2012), as Pat Solatano. He then received two more consecutive Oscar nominations, Best Supporting Actor for playing Richie DiMaso in Russell's American Hustle (2013) (again opposite Lawrence, though their characters shared no significant screen time), and Best Actor for playing Chris Kyle in Clint Eastwood's American Sniper (2014), the highest grossing film of 2014. During this time period, Cooper also reprised his role in The Hangover Part II (2011) and The Hangover III (2013)_, turned in another strong dramatic turn in The Place Beyond the Pines (2012), and voiced Rocket Raccoon in the third highest grossing film of 2014, Guardians of the Galaxy (2014). In 2015, Bradley headlined two comedies, Cameron Crowe's Aloha (2015), set in Hawaii, and John Wells' Burnt (2015), set in London, and will star opposite Jennifer Lawrence again in David O. Russell's Joy (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177896","name":"Bradley Cooper","nicknames":["Coop"],"idIMDB":"nm0177896"},"actorId":"nm0177896","character":"Demo","urlCharacter":"http://www.imdb.com/character/ch0159044","main":true},{"actorName":"Terry Bradshaw","urlProfile":"http://www.imdb.com/name/nm0103537","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzM1MzU4NF5BMl5BanBnXkFtZTYwMzQ0MzM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1948","placeOfBirth":" Shreveport, Louisiana, USA","birthName":"Terry Paxton Bradshaw","height":"6' 3\" (1.91 m)","bio":"Tall, charismatic ex-star quarterback for the NFL's Pittsburgh Steelers football team. During the 1970s, Bradshaw led the Steelers to four Super Bowl wins over six seasons, and was noted Super Bowl MVP on two occasions. After retiring in 1983, he became a key media commentator on NFL football, and has worked for both the CBS and FOX networks. Has cropped up in minor roles in three Burt Reynolds movies, Hooper (1978), Smokey and the Bandit II (1980) and The Cannonball Run (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzM1MzU4NF5BMl5BanBnXkFtZTYwMzQ0MzM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103537","name":"Terry Bradshaw","nicknames":["The Blond Bomber"],"idIMDB":"nm0103537"},"actorId":"nm0103537","character":"Al","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathy Bates","urlProfile":"http://www.imdb.com/name/nm0000870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTM3NjcyMF5BMl5BanBnXkFtZTcwMDI0NTk0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1948","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Kathleen Doyle Bates","height":"5' 3\" (1.6 m)","bio":"Multi-talented Kathleen Doyle Bates was born on June 28, 1948, and raised in Memphis, Tennessee. She is the youngest of three girls born to Bertye Kathleen (Talbot), a homemaker, and Langdon Doyle Bates, a mechanical engineer. Her grandfather was author Finis L. Bates. Kathy has English, as well as Irish, Scottish, and German, ancestry, and one of her ancestors, an Irish emigrant to New Orleans, once served as President Andrew Jackson's doctor. Kathy discovered acting appearing in high school plays and studied drama at Southern Methodist University, graduating in 1969. With her mind firmly set, she moved to New York City in 1970 and paid her dues by working everything from a cash register to taking lunch orders. Things started moving quickly up the ladder after giving a tour-de-force performance alongside Christopher Walken at Buffalo's Studio Arena Theatre in Lanford Wilson's world premiere of \"Lemon Sky\" in 1970, but she also had a foreshadowing of the heartbreak to come after the successful show relocated to New York's off-Broadway Playhouse Theatre without her and Walken wound up winning a Drama Desk award. By the mid-to-late 1970s, Kathy was treading the boards frequently as a rising young actress of the New York and regional theater scene. She appeared in \"Casserole\" and \"A Quality of Mercy\" (both 1975) before earning exceptional reviews for her role of Joanne in \"Vanities\". She took her first Broadway curtain call in 1980's \"Goodbye Fidel,\" which lasted only six performances. She then went directly into replacement mode when she joined the cast of the already-established and highly successful \"Fifth of July\" in 1981. Kathy made a false start in films with Taking Off (1971), in which she was billed as \"Bobo Bates\". She didn't film again until Straight Time (1978), starring Dustin Hoffman, and that part was not substantial enough to cause a stir. Things turned hopeful, however, when Kathy and the rest of the female ensemble were given the chance to play their respective Broadway parts in the film version of Robert Altman's Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean (1982). It was a juicy role for Kathy and film audiences finally started noticing the now 34-year-old. Still and all, it was the New York stage that continued to earn Kathy awards and acclaim. She was pure textbook to any actor studying how to disappear into a role. Her characters ranged from free and life-affirming to downright pitiable. Despite winning a Tony Award nomination and Outer Critic's Circle Award for her stark, touchingly sad portrait of a suicidal daughter in 1983's \"'night, Mother\" and the Obie and Los Angeles Drama Critics Award for her powerhouse job as a romantic misfit in \"Frankie and Johnny in the Claire de Lune,\" Kathy had no box-office pull and was hardly a strong consideration when the roles finally went to film. Kathy Bates was forever losing out when her award-winning stage characters transferred to the screen. First Sissy Spacek took on her potent role as the suicidal Jessie Cates in 'night, Mother (1986), then Michelle Pfeiffer seized the moment to play her dumpy lover character in Frankie and Johnny (1991). It would take Oscar glory to finally rectify the injustice. It was her fanatical turn as the drab, chunky, porcine-looking psychopath Annie Wilkes, who kidnaps her favorite author (James Caan) and subjects him to a series of horrific tortures, that finally turned the tide for her in Hollywood. With the 1990 shocker Misery (1990), based on the popular Stephen King novel, Bates and Caan were pure box office magic. Moreover, Kathy captured the \"Best Actress\" Oscar and Golden Globe award, a first in that genre (horror) for that category. To add to her happiness she married Tony Campisi, also an actor, in 1991. Quality film scripts now started coming her way and the 1990s proved to be a rich and rewarding time for her. First, she and another older \"overnight\" film star, fellow Oscar winner Jessica Tandy, starred together in the modern portion of the beautifully nuanced, flashback period piece Fried Green Tomatoes (1991). She then outdid herself as the detached and depressed housekeeper accused of murdering her abusive husband (David Strathairn) in Dolores Claiborne (1995). Surprisingly, she was left out of the Oscar race for these two excellent performances. Not so, however, for her flashy political advisor Libby Holden in the movie Primary Colors (1998) and her quirky, liberal mom in About Schmidt (2002), receiving \"Best Supporting Actress\" nominations for both. She also turned in a somewhat brief but potent turn as Gertrude Stein in Woody Allen's Midnight in Paris (2011). Kathy has continued to work prolifically on TV as a multiple Emmy winner and nominee. She has also taken to directing a couple of TV-movies on the sly. She was nominated for a DGA award after helming an episode of \"Six Feet Under,\" in which she also had a recurring role. While some of her more recent movie parts have been unworthy of her talents, she has more than made up for it on TV playing everything from cruel-minded caricatures (Little Orphan Annie's Miss Hannigan) to common, decent every day folk in mini-movies. More recently she has done some eye-catching, offbeat turns on regular series such as The Office (2005), Harry's Law (2011) and especially American Horror Story (2011) for which she won an Emmy as Ethel Darling. Divorced from her husband since 1997, Kathy has been the Executive Committee Chair of the Actors Branch of the Academy of Motion Picture Arts and Sciences Board of Governors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTM3NjcyMF5BMl5BanBnXkFtZTcwMDI0NTk0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000870","name":"Kathy Bates","nicknames":["Bobo"],"idIMDB":"nm0000870"},"actorId":"nm0000870","character":"Sue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tyrel Jackson Williams","urlProfile":"http://www.imdb.com/name/nm1822655","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjQyMzc2NV5BMl5BanBnXkFtZTgwOTk3Mjk5ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Tyrel Jackson Williams is an actor, known for Lab Rats (2012), Failure to Launch (2006) and Jack Parker, le Roi des menteurs (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjQyMzc2NV5BMl5BanBnXkFtZTgwOTk3Mjk5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1822655","name":"Tyrel Jackson Williams","idIMDB":"nm1822655"},"actorId":"nm1822655","character":"Jeffrey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katheryn Winnick","urlProfile":"http://www.imdb.com/name/nm0935395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Mjc4MzYyMF5BMl5BanBnXkFtZTgwOTkwMzYyMDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1977","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Katerena Anna Vinitska","height":"5' 6\" (1.68 m)","bio":"Canadian actress Katheryn Winnick stars in the critically acclaimed, Emmy award-winning television series Vikings (2013). produced by MGM and The History Channel. Entertainment Weekly declared that her role as \"Lagertha\" may be the most exciting feminist character on TV.\" Her portrayal of the fierce shield maiden has garnered her several impressive nominations including a nomination for a Critic's Choice Award for Best Supporting Actress in a Drama Series, a Canadian Screen Award nomination for Best Performance by a Lead Dramatic Actress (2014), Best Actress in a Drama Series by the Women's Image Network in both 2014 & 2015 and a Golden Maple Award nomination for Best Actress in a TV Series. In addition to these prestigious nominations, Katheryn won the Serendipity Film's Award of Excellence at the Banff World Media Festival in 2015. Recently, Winnick wrapped production on the highly anticipated adaptation of the Stephen King novel The Dark Tower (2017), starring Academy Award-winner Matthew McConaughey and Golden Globe winner Idris Elba due for release in February 2017. Winnick also stars opposite Gerard Butler in the Warner Brother's feature film Geostorm (2017). Winnick's other credits include roles in such movies as Love & Other Drugs (2010) with Jake Gyllenhaal, Killers (2010) starring Ashton Kutcher, as well as Stand Up Guys (2012) with Al Pacino, Christopher Walken and Alan Arkin. She also starred in the Paul Giamatti comedy drama Cold Souls (2009), which received a best ensemble performance nomination in the 2009 Gotham Independent Film Awards. Off the big screen, Katheryn is no stranger to TV and in addition to Vikings has had numerous television appearances including roles in Person of Interest (2011), House (2004), CSI: Crime Scene Investigation (2000), Law & Order: Criminal Intent (2001), and a notable recurring role on the hit prime time series Bones (2005). In 2015, Winnick was named as the brand ambassador for luxury Swiss watch company Raymond Weil and is the face of their 2016 elegant and feminine Shine Collection. Katheryn proudly endorses the brand of watches, which celebrates both the strength and beauty of the active modern woman worldwide. In addition to acting, Katheryn Winnick is an accomplished martial artist who holds a third-degree black belt in Taekwondo and a second-degree black belt in Karate. By twenty-one she had founded and owned three martial arts schools. After completing her university education at York University, Toronto, Katheryn went on to successfully pursue an acting career in New York and subsequently Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Mjc4MzYyMF5BMl5BanBnXkFtZTgwOTkwMzYyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935395","name":"Katheryn Winnick","idIMDB":"nm0935395"},"actorId":"nm0935395","character":"Melissa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Corddry","urlProfile":"http://www.imdb.com/name/nm1117791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODI5Njk2Nl5BMl5BanBnXkFtZTcwOTY3NTA3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1971","placeOfBirth":" Weymouth, Massachusetts, USA","birthName":"Robert William Corddry","height":"5' 11\" (1.8 m)","bio":"Rob Corddry was born on February 4, 1971 in Weymouth, Massachusetts, USA as Robert William Corddry. He is a writer and actor, known for Hot Tub Time Machine (2010), Childrens Hospital (2008) and Warm Bodies (2013). He has been married to Sandra Corddry since 2002. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODI5Njk2Nl5BMl5BanBnXkFtZTcwOTY3NTA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1117791","name":"Rob Corddry","idIMDB":"nm1117791"},"actorId":"nm1117791","character":"Gun Salesman #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patton Oswalt","urlProfile":"http://www.imdb.com/name/nm0652663","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1OTM4MDg2NzNeQTJeQWpwZ15BbWU3MDk0NDA2MTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1969","placeOfBirth":" Portsmouth, Virginia, USA","height":"5' 3½\" (1.61 m)","bio":"Patton Oswalt has been headlining at comedy clubs all over the United States since 1996, as well as appearing in his own standup specials on Comedy Central and HBO. He was chosen as Entertainment Weekly's \"It\" comedian in 2002. He is a regular on Late Night with Conan O'Brien (1993). His other television credits include appearances on Seinfeld (1989) and NewsRadio (1995). As a writer, Oswalt spent two seasons on MADtv (1995) and has also written for the MTV Music Video Awards. He is currently writing screenplays and has appeared in the feature films Starsky & Hutch (2004), Man on the Moon (1999) and Magnolia (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1OTM4MDg2NzNeQTJeQWpwZ15BbWU3MDk0NDA2MTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0652663","name":"Patton Oswalt","idIMDB":"nm0652663"},"actorId":"nm0652663","character":"Techie Guy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Tobolowsky","urlProfile":"http://www.imdb.com/name/nm0864997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyMTU5NzcyMF5BMl5BanBnXkFtZTcwNDYxNDk3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1951","placeOfBirth":" Dallas, Texas, USA","birthName":"Stephen Harold Tobolowsky","height":"6' 2\" (1.88 m)","bio":"Character actor Stephen Tobolowsky was born on May 30, 1951 in Dallas, Texas. Over the past three decades, Tobolowsky has racked up a lengthy list of roles in movies and television across many different genres. While Tobolowsky initially attended Southern Methodist University in Dallas, Texas with the intention of studying geology, he was quickly drawn in to acting there. He later attended the University of Illinois for one year. Tobolowsky worked primarily in theater during his early career, and wrote and directed a few plays including \"Two Idiots in Hollywood\" and \"True Stories\". His film career took off in the 1980s, though, thanks to roles in The Philadelphia Experiment (1984), Nobody's Fool (1986), Spaceballs (1987), and Mississippi Burning (1988). Since then, Tobolowsky has appeared in many popular movies including Bird on a Wire (1990), Basic Instinct (1992), Groundhog Day (1993), Radioland Murders (1994), Murder in the First (1995), Mr. Magoo (1997), The Insider (1999), Memento (2000), Freaky Friday (2003), Garfield (2004) and Wild Hogs (2007). He has also done a substantial amount of voice work, most recently taking on the role of Uncle Ubb in The Lorax (2012). Tobolowsky has been even more prolific in television over the past few decades. He's appeared on a diverse range of shows including Seinfeld (1989), Mad About You (1992), Chicago Hope (1994), The Practice (1997) and Curb Your Enthusiasm (2000), and has had recurring roles on CSI: Miami (2002), Deadwood (2004), Heroes (2006), Californication (2007) and Glee (2009). Tobolowsky is married to fellow actor Ann Hearn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyMTU5NzcyMF5BMl5BanBnXkFtZTcwNDYxNDk3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0864997","name":"Stephen Tobolowsky","idIMDB":"nm0864997"},"actorId":"nm0864997","character":"Bud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kate McGregor-Stewart","urlProfile":"http://www.imdb.com/name/nm0570033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MTc2MDQ3OV5BMl5BanBnXkFtZTcwMzcxOTEzMQ@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1944","placeOfBirth":" New York City, New York, USA","bio":"Kate McGregor-Stewart was born on October 4, 1944 in New York City, New York, USA. She is known for her work on School of Rock (2003), Father of the Bride (1991) and The Addams Family (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MTc2MDQ3OV5BMl5BanBnXkFtZTcwMzcxOTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570033","name":"Kate McGregor-Stewart","nicknames":["Sandy"],"idIMDB":"nm0570033"},"actorId":"nm0570033","character":"Bev","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Alexi-Malle","urlProfile":"http://www.imdb.com/name/nm0018956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmNjNjRiNGUtNmIyMy00ZTcwLTlkMTAtN2Q3YWViOTFjNjg4XkEyXkFqcGdeQXVyNjA1MDY0NTI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1964","placeOfBirth":" Siena, Tuscany, Italy","birthName":"Juan-Paolo Perre","height":"5' 10\" (1.78 m)","bio":"Born in Siena, Italy and immigrated to the United States from London, England. A true polyglot, fluent in several languages, he is known for an astonishing facility with a variety of accents. A Harriet Hale Wooley Scholar, Alexi-Malle studied in Paris, Moscow and in London at RADA, the Royal Academy of Dramatic Art. He returned to the US in 1995, acting in acclaimed theatrical productions On and Off Broadway: in the Tony Award-winning Broadway musical, \"Titanic\" and Off-Broadway, in the American premiere of the hugely successful New Group Theatre production of \"Goose-Pimples\" by Mike Leigh, directed by Scott Elliott. In the role of 'Mohammad' Alexi-Malle garnered unanimous critical praise. And in addition, nominations as Best Featured Male Performance in both the Drama Desk Awards and the Outer Critics' Circle Awards. As a result, he was invited by director Frank Oz, producer Brian Grazer and Steve Martin to co-star in the Universal Pictures/Imagine Entertainment feature, Bowfinger (1999), written by and starring Steve Martin with Eddie Murphy. He is actively creating and developing film, television and performance projects through his production company 'JP2A2M Worldwide Entertainment', Siena Films and VirtuosoTV as well as the creation of the film and theatre repertory company, Blistering Muses. In addition to acting, he maintains an active career as classical violinist, pianist, singer and conductor. 2014 saw the publication and release of his first book, a collection of poetry entitled, \"A Confederacy of Joy.\" by the Siena Press. Written under his birth name, Juan-Paolo Perre, he was awarded the 2014 Legacy Poetry Prize. The book was recently acquired into the collections of the British Library and the Library of Congress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmNjNjRiNGUtNmIyMy00ZTcwLTlkMTAtN2Q3YWViOTFjNjg4XkEyXkFqcGdeQXVyNjA1MDY0NTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018956","name":"Adam Alexi-Malle","idIMDB":"nm0018956"},"actorId":"nm0018956","character":"Mr. Axelrod","urlCharacter":"http://www.imdb.com/character/ch0168204","main":true},{"actorName":"Gretchen Cleevely","urlProfile":"http://www.imdb.com/name/nm0165932","urlPhoto":"","biography":{"dateOfBirth":"28 July 1975","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Gretchen Cleevely was born on July 28, 1975 in Pittsburgh, Pennsylvania, USA. She is an actress, known for Failure to Launch (2006), Trust the Man (2005) and Le New Yorker (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0165932","name":"Gretchen Cleevely","idIMDB":"nm0165932"},"actorId":"nm0165932","character":"Gretchen the Veterinarian","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0427229","urlIMDB":"http://www.imdb.com/title/tt0427229","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$24,411,322","country":"USA","day":"12","month":"03","year":"2006","remarks":"3,057 Screens"},{"money":"£1,082,855","country":"UK","day":"02","month":"04","year":"2006","remarks":"352 Screens"},{"money":"€129,881","country":"Netherlands","day":"09","month":"04","year":"2006","remarks":"49 Screens"}],"gross":[{"money":"$88,715,192","country":"USA","day":"22","month":"06","year":"2006","remarks":""},{"money":"$88,658,172","country":"USA","day":"18","month":"06","year":"2006","remarks":""},{"money":"$88,509,311","country":"USA","day":"11","month":"06","year":"2006","remarks":""},{"money":"$88,291,093","country":"USA","day":"04","month":"06","year":"2006","remarks":""},{"money":"$88,029,713","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$87,724,422","country":"USA","day":"21","month":"05","year":"2006","remarks":""},{"money":"$87,565,245","country":"USA","day":"14","month":"05","year":"2006","remarks":""},{"money":"$87,208,192","country":"USA","day":"07","month":"05","year":"2006","remarks":""},{"money":"$86,619,959","country":"USA","day":"30","month":"04","year":"2006","remarks":""},{"money":"$85,604,643","country":"USA","day":"23","month":"04","year":"2006","remarks":""},{"money":"$83,179,669","country":"USA","day":"16","month":"04","year":"2006","remarks":""},{"money":"$79,145,215","country":"USA","day":"09","month":"04","year":"2006","remarks":""},{"money":"$73,088,790","country":"USA","day":"02","month":"04","year":"2006","remarks":""},{"money":"$63,537,895","country":"USA","day":"26","month":"03","year":"2006","remarks":""},{"money":"$48,273,823","country":"USA","day":"19","month":"03","year":"2006","remarks":""},{"money":"$24,411,322","country":"USA","day":"12","month":"03","year":"2006","remarks":""},{"money":"£2,657,334","country":"UK","day":"16","month":"04","year":"2006","remarks":""},{"money":"£2,078,256","country":"UK","day":"09","month":"04","year":"2006","remarks":""},{"money":"£1,082,855","country":"UK","day":"02","month":"04","year":"2006","remarks":""},{"money":"€164,114","country":"Netherlands","day":"09","month":"04","year":"2006","remarks":""}],"weekendGross":[{"money":"$78,714","country":"USA","day":"18","month":"06","year":"2006","remarks":"175 Screens"},{"money":"$127,091","country":"USA","day":"11","month":"06","year":"2006","remarks":"217 Screens"},{"money":"$173,503","country":"USA","day":"04","month":"06","year":"2006","remarks":"280 Screens"},{"money":"$270,311","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$83,086","country":"USA","day":"21","month":"05","year":"2006","remarks":"156 Screens"},{"money":"$236,969","country":"USA","day":"14","month":"05","year":"2006","remarks":"283 Screens"},{"money":"$394,101","country":"USA","day":"07","month":"05","year":"2006","remarks":"437 Screens"},{"money":"$600,430","country":"USA","day":"30","month":"04","year":"2006","remarks":"664 Screens"},{"money":"$1,410,982","country":"USA","day":"23","month":"04","year":"2006","remarks":"1,295 Screens"},{"money":"$2,608,433","country":"USA","day":"16","month":"04","year":"2006","remarks":"1,950 Screens"},{"money":"$4,130,869","country":"USA","day":"09","month":"04","year":"2006","remarks":"2,616 Screens"},{"money":"$6,463,434","country":"USA","day":"02","month":"04","year":"2006","remarks":""},{"money":"$10,462,474","country":"USA","day":"26","month":"03","year":"2006","remarks":"3,202 Screens"},{"money":"$15,604,892","country":"USA","day":"19","month":"03","year":"2006","remarks":"3,117 Screens"},{"money":"$24,411,322","country":"USA","day":"12","month":"03","year":"2006","remarks":"3,057 Screens"},{"money":"£206,984","country":"UK","day":"16","month":"04","year":"2006","remarks":"279 Screens"},{"money":"£462,094","country":"UK","day":"09","month":"04","year":"2006","remarks":"353 Screens"},{"money":"£1,082,855","country":"UK","day":"02","month":"04","year":"2006","remarks":"352 Screens"},{"money":"€129,881","country":"Netherlands","day":"09","month":"04","year":"2006","remarks":"49 Screens"}],"admissions":[{"money":"314,014","country":"Brazil","day":"30","month":"04","year":"2006","remarks":""},{"money":"235,041","country":"Brazil","day":"23","month":"04","year":"2006","remarks":""},{"money":"111,726","country":"Brazil","day":"16","month":"04","year":"2006","remarks":""},{"money":"614,021","country":"Germany","day":"09","month":"04","year":"2006","remarks":""},{"money":"179,763","country":"Germany","day":"19","month":"03","year":"2006","remarks":""},{"money":"84,134","country":"Netherlands","day":"31","month":"12","year":"2006","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"05","year":"2005","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)","1 hr 35 min (95 min) (cut) (Philippines)"],"soundMix":["Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)","Technicolor, New York (NY), USA (dailies)"],"filmLength":["2,658 m (Portugal, 35mm)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"5.6","metascore":"47","filmingLocations":[{"location":"Annapolis, Maryland, USA"}],"rated":"PG-13","awards":[{"award":"AARP Movies for Grownups Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Movies for Grownups Award","categories":[{"category":"Best Comedy","names":[]}]}]},{"award":"Kids' Choice Awards, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Female Movie Star","names":[{"name":"Sarah Jessica Parker","id":"nm0000572","role":null}]}]}]},{"award":"People's Choice Awards, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Movie Comedy","names":[]}]}]},{"award":"Teen Choice Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Movies - Choice Chick Flick","names":[]},{"category":"Movies - Choice Actress: Comedy","names":[{"name":"Sarah Jessica Parker","id":"nm0000572","role":null}]}]}]}],"votes":"60,793","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0093765","name":"Scott Rudin Productions"},{"idCompany":"co0221029","name":"Failure to Launch Productions"}],"keywords":{"keywords":["friend","intervention","moving","slacker","secret","mockingbird","cooking","bb gun","rose","dating","shot in the foot","tattoo","chick flick","barbecue","self sufficiency","opposites attract","mother son relationship","commitment","battle of the sexes","exercising","surfing","friendship","adult lives at home","mountain biking","exercise","baseball game","yoga","webcam","door shut in face","shotgun","senior citizen","rock climbing","premarital sex","mountain bike","male nudity","lizard","little boy","japanese restaurant","falling from height","dolphin","dog","cpr","computer programmer","chipmunk","castration","broker","bondage","bird watching","aquarium","sailboat","paintball","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:37:11"}}