{"data":{"movies":[{"title":"Garbo","originalTitle":"","year":"2005","releaseDate":"20050906","directors":[{"name":"Christopher Bird","id":"nm0083361"},{"name":"Kevin Brownlow","id":"nm0002206"}],"writers":[{"name":"Christopher Bird","id":"nm0083361"},{"name":"Kevin Brownlow","id":"nm0002206"}],"runtime":"85 min","countries":["USA"],"languages":["English"],"genres":["Documentary","Biography"],"plot":"An original documentary from Turner Classic Movies, narrated by Julie Christie","simplePlot":"An original documentary from Turner Classic Movies, narrated by Julie Christie","actors":[{"actorName":"Julie Christie","urlProfile":"http://www.imdb.com/name/nm0001046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzIzMTE5MV5BMl5BanBnXkFtZTcwNDc3NDA2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1941","placeOfBirth":" Chabua, Assam Province, British India","birthName":"Julie Frances Christie","height":"5' 3\" (1.6 m)","bio":"Julie Christie, the British movie legend whom Al Pacino called \"the most poetic of all actresses\", was born in Chukua, Assam, India, on April 14, 1941, the daughter of a tea planter, Frank St. John Christie, and his wife, Rosemary (Ramsden), who was a painter. Her family was of English, and some Scottish, origin. The young Christie grew up on her father's tea plantation before being sent to England for her education. Finishing her studies in Paris, where she had moved to improve her French with an eye to possibly becoming a linguist (she is fluent in French and Italian), the teenager became enamored of the freedom of the Continent. She also was smitten by the bohemian life of artists and planned on becoming an artist before she enrolled in London's Central School of Speech Training. She made her debut as a professional in 1957 as a member of the Frinton Repertory of Essex. Christie was not fond of the stage, even though it allowed her to travel, including a professional gig in the United States. Her true métier as an actress was film, and she made her screen debut in the science-fiction television serial A for Andromeda (1961) in 1961. Her first film role was as the unlikely fiancé of Leslie Phillips in the Ealing-like comedy Crooks Anonymous (1962), which was followed up by an ingénue role in another comedy, The Fast Lady (1962). The producers of the \"James Bond\" series were sufficiently intrigued by the young actress to consider her for the role that subsequently went to Ursula Andress in Dr. No (1962), but dropped the idea because she was not busty enough. Christie first worked with the man who would kick her career into high gear, director John Schlesinger, when he choose her as a replacement for the actress originally cast in Billy Liar (1963). Christie's turn in the film as the free-wheeling \"Liz\" was a stunner, and she had her first taste of becoming a symbol if not icon of the new British cinema. Her screen presence was such that the great John Ford cast her as the Irish prostitute, Daisy Battles, in Young Cassidy (1965). Charlton Heston wanted her for his film The War Lord (1965), but the studio refused her salary demands. Although Amercan magazines portrayed Christie as a \"newcomer\" when she made her breakthrough to super-stardom in Schlesinger's seminal Swinging Sixties film Darling (1965), she actually had considerable work under her professional belt and was in the process of a artistic quickening. Schlesinger called on Christie, whom he adored, to play the role of mode \"Diana Scott\" when the casting of Shirley MacLaine fell through. (MacLaine was the sister of the man who would become Christie's long-time paramour in the late 1960s and early 1970s, Warren Beatty, whom some, like actor Rod Steiger, believe she gave up her career for. Her Doctor Zhivago (1965) co-star, Steiger -- a keen student of acting -- regretted that Christie did not give more of herself to her craft). As played by Christie, Diana is an amoral social butterfly who undergoes a metamorphosis from immature sex kitten to jaded socialite. For her complex performance, Christie won raves, including the Best Actress Awards from the Academy of Motion Picture Arts and Sciences and the British Film Academy. She had arrived, especially as she had followed up Darling (1965) with the role of \"Lara\" in two-time Academy Award-winning director David Lean's adaptation of Boris Pasternak's Doctor Zhivago (1965), one of the all-time box-office champs. Christie was now a superstar who commanded a price of $400,000 per picture, a fact ruefully noted in Charlton Heston's diary (his studio had balked at paying her then-fee of $35,000). More interested in film as an art form than in consolidating her movie stardom, Christie followed up Doctor Zhivago (1965) with a dual role in Fahrenheit 451 (1966) for director François Truffaut, a director she admired. The film was hurt by the director's lack of English and by friction between Truffaut and Christie's male co-star Oskar Werner, who had replaced the more-appropriate-for-the-role Terence Stamp. Stamp and Christie had been lovers before she had become famous, and he was unsure he could act with her, due to his own ego problems. On his part, Werner resented the attention the smitten Truffaut gave Christie. Stamp overcame those ego problems to sign on as her co-star in John Schlesinger's adaptation of Thomas Hardy's Far from the Madding Crowd (1967), which also featured two great English actors, Peter Finch and Alan Bates. It is a film that is far better remembered now than when it was received in 1967. The film and her performance as the Hardy heroine \"Bathsheba Everdene\" was lambasted by film critics, many of whom faulted Christie for being too \"mod\" and thus untrue to one of Hardy's classic tales of fate. Some said that her contemporary, Vanessa Redgrave, would have been a better choice as \"Bathsheba\", but while it is true that Redgrave is a very fine actress, she lacked the sex appeal and star quality of Christie, which makes the story of three men in love with one woman more plausible, as a film. Although no one then knew it, the period 1967-68 represented the high-water mark of Christie's career. Fatefully, like the Hardy heroine she had portrayed, she had met the man who transformed her life, undermining her pretensions to a career as a movie star in their seven-year-long love affair, the American actor Warren Beatty. Living his life was always far more important than being a star for Beatty, who viewed the movie star profession as a \"treadmill leading to more treadmills\" and who was wealthy enough after Bonnie and Clyde (1967) to not have to ever work again. Christie and Beatty had visited a working farm during the production of Far from the Madding Crowd (1967) and had been appalled by the industrial exploitation of the animals. Thereafter, animal rights became a very important subject to Christie. They were kindred souls who remain friends four decades after their affair ended in 1974. Christie's last box-office hit in which she was the top-liner was Petulia (1968) for Richard Lester, a film that featured one of co-star George C. Scott's greatest performances, perfectly counter-balanced by Christie's portrayal of an \"arch-kook\" who was emblematic of the '60s. It is one of the major films of the decade, an underrated masterpiece. Despite the presence of the great George C. Scott and the excellent Shirley Knight, the film would not work without Julie Christie. There is frankly no other actress who could have filled the role, bringing that unique presence and the threat of danger that crackled around Christie's electric aura. At this point of her career, she was poised for greatness as a star, greatness as an actress. And she walked away. After meeting Beatty, Julie Christie essentially surrendered any aspirations to screen stardom, or at maintaining herself as a top-drawer working actress (success at the box office being a guarantee of the best parts, even in art films). She turned down They Shoot Horses, Don't They? (1969) and Anne of the Thousand Days (1969), two parts that garnered Oscar nominations for the second choices, Jane Fonda and Geneviève Bujold. After shooting In Search of Gregory (1969), a critical and box office flop, to fulfill her contractual obligations, she spent her time with Beatty in California, renting a beach house at Malibu. She did return to form in Joseph Losey's The Go-Between (1971), a fine picture with a script by the great Harold Pinter, and she won another Oscar nomination as the whore-house proprietor in Robert Altman's minor classic McCabe & Mrs. Miller (1971) that she made with her lover Beatty. However, like Beatty, himself, she did not seek steady work, which can be professional suicide for an actor who wants to maintain a standing in the first rank of movie stars. At the same time, Julie Christie turned down the role of the Russian Empress in Nicholas and Alexandra (1971), another film that won the second-choice (Janet Suzman) a Best Actress Oscar nomination. Two years later, she appeared in his landmark mystery-horror film Don't Look Now (1973), but that likely was as a favor to the director, Nicolas Roeg, who had been her cinematographer on Fahrenheit 451 (1966), Far from the Madding Crowd (1967) and Petulia (1968). In the mid-70s, her affair with Beatty came to an end, but the two remained close friends and worked together in Shampoo (1975) (which she regretted due to its depiction of women) and Heaven Can Wait (1978). Christie was still enough of a star, due to sheer magnetism rather than her own pull at the box-office, to be offered $1 million to play the Jacqueline Kennedy Onassis character in The Greek Tycoon (1978) (a part eventually played by Jacqueline Bisset to no great acclaim). She signed for but was forced to drop out of the lead in Agatha (1979) (which was filled by Vanessa Redgrave) after she broke a wrist roller-skating (a particularly southern Californian fate!). She then signed for the female lead in American Gigolo (1980) when Richard Gere was originally attached to the picture, but dropped out when John Travolta muscled his way into the lead after making twin box-office killings as disco king \"Tony Manero\" in Saturday Night Fever (1977) and greaser \"Danny Zuko\" in Grease (1978). Christie could never have co-starred with such a camp figure of dubious talent. When Travolta himself dropped out and Gere was subbed back in, it was too late for Christe to reconsider, as the part already had been filled by model-actress Lauren Hutton. Finally, the end of the American phase of her movie career was realized when Christie turned down the part of \"Louise Bryant\" in Reds (1981), a part written by Warren Beatty with her in mind, as she felt an American should play the role. (Beatty's latest lover, Diane Keaton, played the part and won a Best Actress Oscar nomination). Still, she remained a part of the film, Beatty's long-gestated labor of love, as it is dedicated to \"Jules\". Julie Christie moved back to the UK and become the UK's answer to Jane Fonda, campaigning for various social and political causes, including animal rights and nuclear disarmament. The parts she did take were primarily driven by her social consciousness, such as appearing in Sally Potter's first feature-length film, The Gold Diggers (1983) which was not a remake of the old Avery Hopwood's old warhorse but a feminist parable made entirely by women who all shared the same pay scale. Roles in The Return of the Soldier (1982) with Alan Bates and Glenda Jackson and Merchant-Ivory's Heat and Dust (1983) seemed to herald a return to form, but Christie -- as befits such a symbol of the freedom and lack of conformity of the '60s -- decided to do it her way. She did not go \"careering\", even though her unique talent and beauty was still very much in demand by filmmakers. At this point, Christie's movie career went into eclipse. Once again, she was particularly choosy about her work, so much so that many came to see her, essentially, as retired. A career renaissance came in the mid-1990s with her turn as \"Gertrude\" in Kenneth Branagh's ambitious if not wholly successful Hamlet (1996). As Christie said at the time, she didn't feel she could turn Branagh down as he was a national treasure. But the best was yet to come: her turn as the faded movie star married to handyman Nick Nolte and romanced by a younger man in Afterglow (1997), which brought her rave notices. She received her third Best Actress Oscar nomination for her performance, and showed up at the awards as radiant and uniquely beautiful as ever. Ever the iconoclast, she was visibly relieved, upon the announcement of the award, to learn that she had lost! Christie lived with left-wing investigative journalist Duncan Campbell (a Manchester Guardian columnist) since 1979, first in Wales, then in Ojai, California, and now in London's East End, before marrying in 2008. In addition to her film work, she has narrated many books-on-tape. In 1995, she made a triumphant return to the stage in a London revival of Harold Pinter's \"Old Times\", which garnered her superb reviews. In the decade since Afterglow (1997), she has worked steadily on film in supporting roles. Christie -- an actress who eschewed vulgar stardom -- proved to be an inspiration to her co-star Sarah Polley who was in No Such Thing (2001) and The Secret Life of Words (2005). Polley says that Christie is uniquely aware of her commodification by the movie industry and the mass media during the 1960s. Not wanting to be reduced to a product, she had rebelled and had assumed control of her life and career. Her attitude makes her one of Polley's heroes, who calls her one of her surrogate mothers. (Polley lost her own mother when she was 11 years old). Polley wrote the screenplay for her adaptation of Alice Munro's short story \"The Bear Went Over the Mountain\" with only one actress in mind: Julie Christie. Polley had first read the short story on a flight back from Iceland, where she had made No Such Thing (2001) with Christie and, as she read, it was Julie whom she pictured as \"Fiona\", the wife of a one-time philandering husband, who has become afflicted with Alzheimer's disease and seeks to save her hubby the pain of looking after her by checking herself into a home. After finishing the screenplay, it took months to get Christie to commit to making the film. Polley then found out why Christie is so reticent about making movies: \"She gives all of herself to what she does. Once she said yes, she was more committed than anybody\". According to David Germain, a cinema journalist who interviewed Christie for the Associated Press, \"Polley and Christie share a desire to do interesting, unusual work, which generally means staying away from Hollywood. The collaboration between the two rebels yielded a small gem of a film. Lions Gate Films was so impressed, it purchased the American distribution rights to the film in 2006, then withheld it until the following year to build up momentum for the awards season. Julie Christie's performance in Loin d'elle (2006) is superb, and already has garnered her the National Board of Review's Best Actress Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzIzMTE5MV5BMl5BanBnXkFtZTcwNDc3NDA2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001046","name":"Julie Christie","nicknames":["Jules"],"idIMDB":"nm0001046"},"actorId":"nm0001046","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greta Garbo","urlProfile":"http://www.imdb.com/name/nm0001256","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU3ODQ0MF5BMl5BanBnXkFtZTgwNzY4NDQ3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1905","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Greta Lovisa Gustafsson","height":"5' 7½\" (1.71 m)","bio":"Greta Garbo was born Greta Lovisa Gustafsson on September 18, 1905, in Stockholm, Sweden, to Anna Lovisa (Johansdotter), who worked at a jam factory, and Karl Alfred Gustafsson, a laborer. She was fourteen when her father died, which left the family destitute. Greta was forced to leave school and go to work in a department store. The store used her as a model in its newspaper ads. She had no film aspirations until she appeared in short advertising film at that same department store while she was still a teenager. Erik A. Petschler, a comedy director, saw the film and gave her a small part in his Luffar-Petter (1922). Encouraged by her own performance, she applied for and won a scholarship to a Swedish drama school. While there she appeared in at least one film, Le chevalier errant (1921). Both were small parts, but it was a start. Finally famed Swedish director Mauritz Stiller pulled her from the drama school for the lead role in The Saga of Gösta Berling (1924). At 18 Greta was on a roll. Following The Joyless Street (1925) both Greta and Stiller were offered contracts with MGM, and her first film for the studio was the American-made Torrent (1926), a silent film in which she didn't have to speak a word of English. After a few more films, including The Temptress (1926), Love (1927) and A Woman of Affairs (1928), Greta starred in Anna Christie (1930) (her first \"talkie\"), which not only gave her a powerful screen presence but also garnered her an Academy Award nomination as Best Actress (she didn't win). Later that year she filmed Romance (1930), which was somewhat of a letdown, but she bounced back in 1931, landing another lead role in Mata Hari (1931), which turned out to be a major hit. Greta continued to give intense performances in whatever was handed her. The next year she was cast in what turned out to be yet another hit, Grand Hotel (1932). However, it was in MGM's Anna Karenina (1935) that she gave what some consider the performance of her life. She was absolutely breathtaking in the role as a woman torn between two lovers and her son. Shortly afterwards, she starred in the historical drama Queen Christina (1933) playing the title character to great acclaim. She earned an Oscar nomination for her role in the romantic drama Camille (1936), again playing the title character. Her career suffered a setback the following year in Conquest (1937), which was a box office disaster. She later made a comeback when she starred in Ninotchka (1939), which showcased her comedic side. It wasn't until two years later she made what was to be her last film, Two-Faced Woman (1941), another comedy. But the film drew controversy and was condemned by the Catholic Church and other groups and was a box office failure, which left Garbo shaken. After World War II Greta, by her own admission, felt that the world had changed perhaps forever and she retired, never again to face the camera. She would work for the rest of her life to perpetuate the Garbo mystique. Her films, she felt, had their proper place in history and would gain in value. She abandoned Hollywood and moved to New York City. She would jet-set with some of the world's best-known personalities such as Aristotle Onassis and others. She spent time gardening and raising flowers and vegetables. In 1954 Greta was given a special Oscar for past unforgettable performances. She even penned her biography in 1990. On April 15, 1990, Greta died of natural causes in New York and with her went the \"Garbo Mystique\". She was 84.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU3ODQ0MF5BMl5BanBnXkFtZTgwNzY4NDQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001256","name":"Greta Garbo","nicknames":["The Face","The Swedish Sphinx","Garbo","La Divina"],"idIMDB":"nm0001256"},"actorId":"nm0001256","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Busch","urlProfile":"http://www.imdb.com/name/nm0123958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzg0NzAzNV5BMl5BanBnXkFtZTcwMjUwOTcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1954","placeOfBirth":" New York City, New York, USA","bio":"Charles Busch is a writer in theater and writer of the film Psycho Beach Party (2000). He is famous for crossdressing in his films he appears in and theatrical presentations he does. Busch got a lot of attention in film and television work playing a prisoner named Nat Ginsberg for two seasons on HBO's Oz (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzg0NzAzNV5BMl5BanBnXkFtZTcwMjUwOTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123958","name":"Charles Busch","idIMDB":"nm0123958"},"actorId":"nm0123958","character":"Himself - Interviewee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Swenson","urlProfile":"http://www.imdb.com/name/nm1071764","urlPhoto":"","biography":{"bio":"Karen Swenson is an actress, known for Garbo (2005), The Damned Don't Cry: The Crawford Formula - Real and Reel (2005) and Joan Crawford: The Ultimate Movie Star (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1071764","name":"Karen Swenson","idIMDB":"nm1071764"},"actorId":"nm1071764","character":"Herself - Interviewee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Karen","urlProfile":"http://www.imdb.com/name/nm0439170","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mzk4ODY5Ml5BMl5BanBnXkFtZTYwMzA1OTU3._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1923","placeOfBirth":" Wilkes Barre, Pennsylvania, USA","birthName":"Jacob Karnofsky","height":"5' 9\" (1.75 m)","bio":"Veteran Broadway, TV and film actor James Karen was encouraged as a young man to take up an acting career by U.S. Congressman Daniel J. Flood, who was an amateur actor himself. In 1947 Karen made his Broadway debut in \"A Streetcar Named Desire\", which led to appearances in over 20 Broadway productions. His television work began in 1948 with the telecast of \"A Christmas Carol\", directed by pioneer television producer / director Fred Coe. Since then he has acted in over 100 television shows, including a stint as as Chief Justice Michael Bancroft on First Monday (2002) for CBS. In 1965 he began his film work in the low-budget sci-fi \"epic\" Frankenstein Meets the Spacemonster (1965) and now has an impressive resume of over 80 movies to his credit. He has also filmed a record-breaking 5,000+ television commercials, most while a spokesperson for the Pathmark Supermarket chain in the northeast US. He has been honored with the \"Saturn Award\" for Lifetime Achievement given by the Academy of Science Fiction, Fantasy and Horror Films. He has also been presented \"The Buster Award\", by The International Buster Keaton Society. This award is given to the person who has demonstrated professional excellence in the tradition of Buster Keaton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mzk4ODY5Ml5BMl5BanBnXkFtZTYwMzA1OTU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0439170","name":"James Karen","nicknames":["Mr. Pathmark","Tinch"],"idIMDB":"nm0439170"},"actorId":"nm0439170","character":"Himself - Interviewee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Paris","urlProfile":"http://www.imdb.com/name/nm0661529","urlPhoto":"","biography":{"dateOfBirth":"6 February 1948","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Barry Paris originally attended Columbia University for film studies and Slavic languages, only becoming a writer later on. He has worked as both a movie and music reviewer for newspapers. He became a highly-acclaimed biographer, focusing first on the older film stars, then turning to stars of the '50s and '60s. His books are \"Louise Brooks\", \"Garbo\", \"Audrey Hepburn\", \"Tony Curtis: The Autobiography\", \"Song of Haiti\" about Dr. Larry Mellon, who started a hospital there and \"Stella Adler on Ibsen, Strindberg, and Chekhov\", which is an edited series of the acting teacher's lectures. He has also written New Yorker profiles on silent film star Lina Basquette and author Marcia Davenport, and an interview with Robert De Niro for American Film. Today, Paris lives in Pittsburgh, Pennsylvania, where he writes movie reviews for the Post-Gazette, works on a book about President Franklin Pierce and prepares another series of Stella Adler's lectures, this time with emphasis on the American Playwrights.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0661529","name":"Barry Paris","idIMDB":"nm0661529"},"actorId":"nm0661529","character":"Himself - Interviewee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gray Reisfield","urlProfile":"http://www.imdb.com/name/nm2063221","urlPhoto":"","biography":{"bio":"Gray Reisfield is married to Donald Reisfield. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2063221","name":"Gray Reisfield","idIMDB":"nm2063221"},"actorId":"nm2063221","character":"Herself - Interviewee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Pickford","urlProfile":"http://www.imdb.com/name/nm0681933","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODkxOTExMl5BMl5BanBnXkFtZTgwMDIzNTQwMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1892","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Gladys Marie Smith","height":"5' 0½\" (1.54 m)","bio":"Mary Pickford was born Gladys Louise Smith in Toronto, Ontario, Canada, to Elsie Charlotte (Hennessy) and John Charles Smith. She was of English and Irish descent. Pickford began in the theater at age seven. Then known as \"Baby Gladys Smith\", she toured with her family in a number of theater companies. In 1907, she adopted a family name Pickford and joined the David Belasco troupe, appearing in the long-running The Warrens of Virginia\". She began in films in 1909 with the 'American Mutoscope & Biograph [us]', working with director D.W. Griffith. For a short time in 1911, to earn more money, she joined the IMP Film Co. under Carl Laemmle. She returned to Biograph in 1912, and, in 1913 joined the Famous Players Film Company under Adolph Zukor. She then joined First National Exhibitor's Circuit in 1918. In 1919 she helped to establish United Artists.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODkxOTExMl5BMl5BanBnXkFtZTgwMDIzNTQwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0681933","name":"Mary Pickford","nicknames":["Baby Gladys","\"The Girl with the Golden Hair\"","\"The Glad Girl\"","America's Sweetheart","Little Mary","Goldielocks","The Girl with the Curls","The Biograph Girl"],"idIMDB":"nm0681933"},"actorId":"nm0681933","character":"Gwendolyn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lars Hanson","urlProfile":"http://www.imdb.com/name/nm0361319","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGQzMTgyNTktMWRhNi00YTJmLWI2YjktMDBjZTA5NjY4YjNjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1886","placeOfBirth":" Gothenburg, Västra Götalands län, Sweden","height":"5' 10\" (1.78 m)","bio":"Lars Hanson was born on July 26, 1886 in Gothenburg, Västra Götalands län, Sweden. He was an actor, known for The Wind (1928), Flesh and the Devil (1926) and The Saga of Gösta Berling (1924). He was married to Karin Molander. He died on April 8, 1965 in Stockholm, Stockholms län, Sweden.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGQzMTgyNTktMWRhNi00YTJmLWI2YjktMDBjZTA5NjY4YjNjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0361319","name":"Lars Hanson","idIMDB":"nm0361319"},"actorId":"nm0361319","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mimi Pollak","urlProfile":"http://www.imdb.com/name/nm0689433","urlPhoto":"","biography":{"dateOfBirth":"9 April 1903","placeOfBirth":" Karlstad, Värmlands län, Sweden","bio":"Mimi Pollak was born on April 9, 1903 in Karlstad, Värmlands län, Sweden. She was an actress and director, known for Autumn Sonata (1978), Summer Interlude (1951) and Agnes Cecilia - En sällsam historia (1991). She was married to Nils Lundell. She died on August 11, 1999 in Stockholm, Stockholms län, Sweden.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0689433","name":"Mimi Pollak","idIMDB":"nm0689433"},"actorId":"nm0689433","character":"Herself - 1993 interview","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Derek Reisfield","urlProfile":"http://www.imdb.com/name/nm2071804","urlPhoto":"","biography":{"urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2071804","name":"Derek Reisfield","idIMDB":"nm2071804"},"actorId":"nm2071804","character":"Himself - Interviewee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mauritz Stiller","urlProfile":"http://www.imdb.com/name/nm0830249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWU4OTFmM2MtMTg1MC00MmI2LTg2N2EtNjVkNmVmYTAxYjhhXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1883","placeOfBirth":" Helsinki, Finland","birthName":"Moshe Stiller","bio":"Moshe \"Mauritz\" Stiller, born July 17, 1883, in Helsinki, Finland, was a director, writer and actor. He began his artistic activity in the theatre, as an actor at 16. Mauritz Stiller portrayed 87 roles from 1899-1916 and directed 16 productions 1911-28. Together with Viktor Sjöström ( director, actor, writer) he was recruited in 1912 as director/actor to the Swedish film industry by Charles Magnusson at AB Svenska Biografteatern. Mauritz Stiller's films was instantly successful. During his first year he directed six feature films. \"Herr Arnes pengar\" (1919), \"Erotikon\" (1920) and \"Gösta Berlings saga\" (1923) are three cornerstones of Swedish film production. In \"Gösta Berlings saga\" Greta Garbo, 18 years old, made her first major role. Greta Garbo and Mauritz Stiller came to be best friends and allies forever. Stiller introduced Garbo to the German audience in 1925, before the two sailed of to the USA to make \"The Temptress\" for Paramount/Irving Thalberg in 1926. Mauritz Stiller directed 51 feature films and appeared as an actor in seven productions from 1912-1927. At 1:05 am Nov 8, 1928, Mauritz Stiller died in Stockholm, after undergoing numerous surgeries, an abscess of a lung ended a great artist's life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWU4OTFmM2MtMTg1MC00MmI2LTg2N2EtNjVkNmVmYTAxYjhhXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0830249","name":"Mauritz Stiller","nicknames":["Mosje"],"idIMDB":"nm0830249"},"actorId":"nm0830249","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Sjöström","urlProfile":"http://www.imdb.com/name/nm0803705","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzk0OTQ2Ml5BMl5BanBnXkFtZTcwNjg5MDI2NQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1879","placeOfBirth":" Silbodal, Värmlands län, Sweden","birthName":"Victor David Sjöström","height":"5' 11\" (1.8 m)","bio":"Victor Sjöström was born on September 20, 1879, and is the undisputed father of Swedish film, ranking as one of the masters of world cinema. His influence lives on in the work of Ingmar Bergman and all those directors, both Swedish and international, influenced by his work and the works of directors whom he himself influenced. As a boy Sjöström was close to his mother, who died during childbirth when he was seven years old. Biographers see this truncated relationship as being essential to the evolution of his dramatic trope of strong-willed, independent women in his films. He was masterful at eliciting sensitive performances from actresses, such as that of Lillian Gish in his American classic The Wind (1928). The teenaged Sjöström loved the theater, but after his education he turned to business, becoming a donut salesman. Fortunately for the future of Swedish cinema, he was a flop as a salesman, and turned to the theater, becoming an actor and then director. The Swedish film company Svenska Bio hired him and fellow stage director Mauritz Stiller to helm pictures, and from 1912-15 he directed 31 films. Only three of them survive (it is estimated that approximately 150,000 films, or 80% of the total silent-era production, has been lost). He directed Ingeborg Holm (1913), considered the first classic of Swedish cinema. Despite the exigencies of working in an industrial art form, most Svenska Bio films of this period are embarrassments in an artistic sense--turgid melodramas, absurd romances and shaggy dog-style comedies--and there is no reason to think that the director didn't helm his share of such fare. Even taking that into account, Sjöström managed to develop a personal style. The reason he became internationally famous (and wooed by Hollywood) was the richness of his films, which were full of psychological subtleties and natural symbolism that was integrated into the works as a whole. He dealt with such major themes as guilt, redemption and the rapidly evolving place of women in society. His 1920 film La charrette fantôme (1921) (a.k.a. \"Thy Soul Shall Bear Witness\") was an internationally acclaimed masterpiece, and Goldwyn Pictures hired him to direct Name the Man (1924) (Goldwayn was folded into Metro-Goldwyn-Mayer in 1924, where he worked until shortly after the advent of sound). Sjöström's name was changed to \"Victor Seastrom\" (a phonetic pronunciation in a country with limited word fonts), and he became a major American director, a pro-to David Lean, who was renowned for balancing artistic expression with a concern for what would play at the box office. His first MGM film was the Lon Chaney melodrama He Who Gets Slapped (1924). It was not only a critical success but a huge hit, getting the new studio off onto a sound footing. He was highly respected by MGM chief Louis B. Mayer and by production head Irving Thalberg, who shared Sjöström's concerns with art that did not exclude profit. Sjöström became one of the most highly paid directors in Hollywood, reaching his peak at the end of the silent era (when the silent film reached its maturation as an art form) with two collaborations with Lillian Gish: The Scarlet Letter (1926) and \"The Wind\" (1926), his last masterpiece. He departed Hollywood for Sweden after A Lady to Love (1930), returning one last time to helm Under the Red Robe (1937) for 20th Century-Fox, and although he made two movies in Sweden in the intervening years, his career as a director basically ended with the sound era. He returned to his first avocation, acting in Swedish films, in the 1930s, '40s and '50s. In his later years he was a mentor to Ingmar Bergman and gave a remarkable performance in Bergman's masterpiece \"Wild Strawberries\" (1957), for which he won the National Board of Review's Best Actor Award. In his professional life he was a workaholic, and in his private life was reticent about his films and his fame and remained intensely devoted to his wife Edith Erastoff and his family. Victor Sjöström died on January 3, 1960, at the age of 80.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzk0OTQ2Ml5BMl5BanBnXkFtZTcwNjg5MDI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0803705","name":"Victor Sjöström","idIMDB":"nm0803705"},"actorId":"nm0803705","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Selznick","urlProfile":"http://www.imdb.com/name/nm0783678","urlPhoto":"","biography":{"dateOfBirth":"18 May 1936","placeOfBirth":" Los Angeles, California, USA","birthName":"Daniel Mayer Selznick","bio":"Daniel Selznick was born on May 18, 1936 in Los Angeles, California, USA as Daniel Mayer Selznick. He is a producer, known for Garbo (2005), Hollywoodism: Jews, Movies and the American Dream (1998) and I'm King Kong!: The Exploits of Merian C. Cooper (2005). He has been married to Susan Warms Dryfoos since 1989.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0783678","name":"Daniel Selznick","idIMDB":"nm0783678"},"actorId":"nm0783678","character":"Himself - Interviewee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Vieira","urlProfile":"http://www.imdb.com/name/nm0896779","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDI0YTI1OTQtMDU3Ni00OThhLWE1OWItYzFhOGI0OGZhMDQ0L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1950","placeOfBirth":" Oakland, California, USA","birthName":"Mark Alan Vieira","bio":"Mark Vieira was born on October 28, 1950 in Oakland, California, USA as Mark Alan Vieira.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDI0YTI1OTQtMDU3Ni00OThhLWE1OWItYzFhOGI0OGZhMDQ0L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0896779","name":"Mark Vieira","idIMDB":"nm0896779"},"actorId":"nm0896779","character":"Himself - Interviewee","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0471003","urlIMDB":"http://www.imdb.com/title/tt0471003","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)","1 hr 25 min (85 min) (UK)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.3","filmingLocations":[],"awards":[],"votes":"226","type":"Movie","companyCreditsSimple":[{"idCompany":"co0011489","name":"Turner Classic Movies (TCM)"}],"keywords":{"keywords":["character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:20:41"}}