{"data":{"movies":[{"title":"Rambo","originalTitle":"","year":"2008","releaseDate":"20080125","directors":[{"name":"Sylvester Stallone","id":"nm0000230"}],"writers":[{"name":"Art Monterastelli","id":"nm0599393"},{"name":"Sylvester Stallone","id":"nm0000230"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5Mjg1MzM4NF5BMl5BanBnXkFtZTcwNTAyNzUzMw@@._V1.jpg","countries":["USA","Germany"],"languages":["English","Burmese","Thai"],"genres":["Action","Thriller","War"],"plot":"Vietnam veteran John Rambo has survived many harrowing ordeals in his lifetime and has since withdrawn into a simple and secluded existence in Thailand, where he spends his time capturing snakes for local entertainers, and chauffeuring locals in his old PT boat. Even though he is looking to avoid trouble, trouble has a way of finding him: a group of Christian human rights missionaries, led by Michael Burnett and Sarah Miller, approach Rambo with the desire to rent his boat to travel up the river to Burma. For over fifty years, Burma has been a war zone. The Karen people of the region, who consist of peasants and farmers, have endured brutally oppressive rule from the murderous Burmese military and have been struggling for survival every single day. After some inner contemplation, Rambo accepts the offer and takes Michael, Sarah, and the rest of the missionaries up the river. When the missionaries finally arrive at the Karen village, they find themselves part of a raid by the sadistic ...","simplePlot":"In Thailand, John Rambo joins a group of missionaries to venture into war-torn Burma, and rescue a group of Christian aid workers who were kidnapped by the ruthless local infantry unit.","actors":[{"actorName":"Sylvester Stallone","urlProfile":"http://www.imdb.com/name/nm0000230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Sylvester Gardenzio Stallone","height":"5' 9½\" (1.77 m)","bio":"This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, Richard Burton or Alec Guinness; however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in New York's gritty Hell's Kitchen, to Jackie Stallone (née Labofish), an astrologer, and Frank Stallone, a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core The Party at Kitty and Stud's (1970), the thriller Klute (1971) and the comedy Bananas (1971). He got a crucial career break alongside fellow young actor Henry Winkler, sharing lead billing in the effectively written teen gang film The Lords of Flatbush (1974). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the Roger Corman-produced Death Race 2000 (1975). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 Muhammad Ali-Chuck Wepner fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. Rocky (1976) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members Talia Shire, Burgess Meredith and Burt Young, and director John G. Avildsen gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star. Stallone followed Rocky (1976) with F.I.S.T. (1978), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and Paradise Alley (1978) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel Rocky II (1979). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films Nighthawks (1981) and Victory (1981) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with Rocky III (1982) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard Mr. T. The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor. The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer David Morrell, and his novel was adapted to the screen with Stallone in the lead role in First Blood (1982), also starring Richard Crenna and Brian Dennehy. The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with Rambo: First Blood Part II (1985), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt Dolph Lundgren in Rocky IV (1985). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by Carl Weathers, at the hands of the unstoppable \"Siberian Express\". Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. Cobra (1986) was a clumsy mess, Over the Top (1987) was equally mediocre, Rambo III (1988) saw Rambo take on the Russians in Afghanistan, and cop buddy film Tango & Cash (1989) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star Kurt Russell. Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in Rocky V (1990) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter Tommy Morrison, the great-nephew of screen legend John Wayne. Sly quickly followed with the lukewarm comedy Oscar (1991), the painfully unfunny Stop! Or My Mom Will Shoot (1992), the futuristic action film Demolition Man (1993), and the comic book-inspired Judge Dredd (1995). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing Cop Land (1997), also starring Robert De Niro and Ray Liotta. It isn't a classic of the genre, but Cop Land (1997) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story Antz (1998), reprised the role made famous by Michael Caine in a terrible remake of Get Carter (2000), climbed back into a race car for Driven (2001), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, Spy Kids 3-D: Game Over (2003). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but Rocky Balboa (2006), and Vietnam veteran Rambo (2008) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand. Love him or loathe him, Sylvester Stallone has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000230","name":"Sylvester Stallone","nicknames":["Sly","Michael","The Italian Stallion","Binky","Sly Stallone"],"idIMDB":"nm0000230"},"actorId":"nm0000230","character":"John Rambo","urlCharacter":"http://www.imdb.com/character/ch0005265","main":true},{"actorName":"Julie Benz","urlProfile":"http://www.imdb.com/name/nm0004748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyNzIyNDYyN15BMl5BanBnXkFtZTgwOTAxMTUyOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1972","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Julie M. Benz","height":"5' 4\" (1.63 m)","bio":"Julie Benz was born in Pittsburgh, Pennsylvania, USA on May 1, 1972. Julie's father is a Pittsburgh surgeon and her mother is a figure ice skater. The family settled in nearby Murrysville, when Julie was two, and she started ice skating at age three. She competed in the 1988 U.S. Championships in junior ice dancing with her partner David Schilling, coming in 13th. Her older brother and sister, Jeffrey and Jennifer, were in the 1987 U.S. Junior Champions in ice dancing and competed internationally. When Julie was 14, she had a bad stress fracture and had to take time off. By 1989, with her figure skating career over, Julie turned to acting and got involved in the local theater where she got a role in the play \"Street Law\". Her first movie role was a small, credited, speaking part in in the Black Cat episode in the Dario Argento/George A. Romero co-direction horror flick, Two Evil Eyes (1990) playing in one scene alongside Harvey Keitel. A year later, she got a role on a TV show called Hi Honey, I'm Home (1991). After graduating from high school, Julie entered New York University to study acting there. After graduation, Julie moved to Los Angeles to further pursue her career and landed some small roles in movies and TV shows including a guest appearance on Married with Children (1987) and in the Aaron Spelling TV pilot Crosstown Traffic (1995). In 1996, Julie auditioned for the role of \"Buffy\" in the series Buffy the Vampire Slayer (1997), but lost out to Sarah Michelle Gellar. However, she was offered a small role as a vampire girl in which she did such a good job that her part was expanded to a few more episodes in playing the vampire \"Darla\". With that, Julie Benz's career had finally taken off. She reprised her role as \"Darla\" in the Buffy spin-off series Angel (1999) for two years and has had several small roles in various film productions. She also had a small, but memorable, role playing a receptionist in the movie As Good as It Gets (1997). Even after her role on Angel (1999) wrapped up, Julie continued to find work on television in playing many guest staring roles in numerous popular TV shows from CSI: Crime Scene Investigation (2000), to Supernatural (2005), to playing the lead and supporting roles in various made-for-TV movies. Most recently, she landed another notable role on the TV-cable series Dexter (2006) playing \"Rita\", a troubled divorcée and lover of the title character played by Michael C. Hall. Benz played a leading role in the tv series No Ordinary Family (2010) playing Stephanie Powell along with actors Michael Chiklis, Kay Panabaker, Jimmy Bennett, Autumn Reeser, Romany Malco, and Stephen Collins.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyNzIyNDYyN15BMl5BanBnXkFtZTgwOTAxMTUyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004748","name":"Julie Benz","idIMDB":"nm0004748"},"actorId":"nm0004748","character":"Sarah","urlCharacter":"http://www.imdb.com/character/ch0050768","main":true},{"actorName":"Matthew Marsden","urlProfile":"http://www.imdb.com/name/nm0550452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MDEzMjM2OV5BMl5BanBnXkFtZTgwNDIxNjc0ODE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1973","placeOfBirth":" West Bromwich, West Midlands, England, UK","height":"6' 4\" (1.93 m)","bio":"British actor/singer/Producer Matthew Marsden began his acting career in the UK and rose to stardom from his role on the long-running ITV series Coronation Street (1960), as Chris Collins. He left the show to pursue a music and acting career in the US and hasn't looked back since. Since moving to the US, Marsden has been working successfully on feature film, television and music. He starred in Ridley Scott's Black Hawk Down (2001) and he was the lead in USA's epic movie Helen of Troy (2003) Marsden's career started in the UK with the series Emmerdale (1972). He soon landed a series regular role on the television series Island (1996) which led to Coronation Street (1960) for which he was voted Top Newcomer at the National Television Awards. He went on to star in the independent drama Shiner (2000), opposite Michael Caine and the film Les soeurs Soleil (1997). In addition, Marsden signed with Columbia Records and recorded the hit single She's Gone, with Destiny's Child, as well as a solo album called Say Who. Marsden studied performing arts at Middlesex University. He was also a member of the acclaimed National Youth Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MDEzMjM2OV5BMl5BanBnXkFtZTgwNDIxNjc0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0550452","name":"Matthew Marsden","idIMDB":"nm0550452"},"actorId":"nm0550452","character":"School Boy","urlCharacter":"http://www.imdb.com/character/ch0056266","main":true},{"actorName":"Graham McTavish","urlProfile":"http://www.imdb.com/name/nm0574615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDUwNTgyOV5BMl5BanBnXkFtZTgwNzk0MzU3MjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1961","placeOfBirth":" Glasgow, Scotland, UK","birthName":"Graham J. McTavish","height":"6' 2\" (1.88 m)","bio":"Graham McTavish is a Scottish television, and film actor best known for his roles as Dougal Mackenzie in the popular TV series \"Outlander\" (2014-16), as Dwalin in the \"The Hobbit\" trilogy for Peter Jackson(2012-14) as well as the Saint of Killers in AMC's series \"Preacher\" based on Garth Ennis and Steve Dillon's cult comic book series (2016 onwards). He also starred alongside Sylvester Stallone in \"Rambo\" (2008) and \"Creed\" (2015), making him the only actor to perform opposite Rocky AND Rambo. He is also known for his roles in numerous other TV shows and movies including \"Red Dwarf\" (1998), \"24\" (2009), \"Rome\" (2004), \"The Finest Hours\" (2015) and \"Colombiana\" (2011). As well as extensive theatre work throughout the UK including The Royal Court, and The Royal National Theatre, he is well known for his voice work on games and animated TV, including \"Uncharted 2, 3, and 4\", \"Call of Duty\", \"Dante's Inferno\", Loki in \"Hulk v Thor\" and \"The Avengers\", \"Teenage Mutant Ninja Turtles\" and \"Kung Fu Panda\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDUwNTgyOV5BMl5BanBnXkFtZTgwNzk0MzU3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574615","name":"Graham McTavish","idIMDB":"nm0574615"},"actorId":"nm0574615","character":"Lewis","urlCharacter":"http://www.imdb.com/character/ch0056272","main":true},{"actorName":"Reynaldo Gallegos","urlProfile":"http://www.imdb.com/name/nm1274545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdmYzhkOTItYWI3Ny00NWU0LWI2ZTEtYzFlYWZjMGJhYzc0L2ltYWdlXkEyXkFqcGdeQXVyMTUwNjc0NTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Reynaldo Gallegos is an actor, known for Logan (2017), American Sniper (2014) and Rambo (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdmYzhkOTItYWI3Ny00NWU0LWI2ZTEtYzFlYWZjMGJhYzc0L2ltYWdlXkEyXkFqcGdeQXVyMTUwNjc0NTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1274545","name":"Reynaldo Gallegos","idIMDB":"nm1274545"},"actorId":"nm1274545","character":"Diaz","urlCharacter":"http://www.imdb.com/character/ch0056273","main":true},{"actorName":"Jake La Botz","urlProfile":"http://www.imdb.com/name/nm0478403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2ZiYjBlYjMtNDZkMi00OTNjLTlkMDgtYTJiMWUyNWI2OWEzL2ltYWdlXkEyXkFqcGdeQXVyNDA4ODg2NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"After dropping out of school at 15, Jake La Botz hit the road, frequenting punk rock shows, hobo camps, and libraries. He found employment as a roofer, boilermaker, graphite factory worker, and obituary writer. In the midst of this he learned how to play guitar. He played on the streets and in the juke joints of New Orleans, Chicago, and the Mississippi Delta, finding kinship with some of the last of the prewar era blues-men: David Honeyboy Edwards, \"Homesick\" James, and \"Maxwell Street\" Jimmy Davis. La Botz has become known for his \"Tattoo Across America Tour,\" where he tours the country performing at tattoo shops and as an actor in films in which he sometimes sings his original songs: Rambo Dir. Sylvester Stallone, Animal Factory Dir. Steve Buscemi, On the Road Dir. Walter Salles Jake has toured extensively in the U.S. and Europe and has opened for Ray Charles, Etta James, Dr. John, Mavis Staples, Buddy Guy, Jr. Wells, Taj Mahal, Buckwheat Zydeco, Tony Joe White, John Hammond, The Blasters and a host of other greats. He recently starred as \"Jake Haynes\" in the feature film The Grace of Jake, and as \"The Shape\" in the new stage musical Ghost Brothers of Darkland County written by Stephen King and John Mellencamp with musical direction by T Bone Burnett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2ZiYjBlYjMtNDZkMi00OTNjLTlkMDgtYTJiMWUyNWI2OWEzL2ltYWdlXkEyXkFqcGdeQXVyNDA4ODg2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0478403","name":"Jake La Botz","idIMDB":"nm0478403"},"actorId":"nm0478403","character":"Reese","urlCharacter":"http://www.imdb.com/character/ch0056274","main":true},{"actorName":"Tim Kang","urlProfile":"http://www.imdb.com/name/nm1085727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzEwODc1MV5BMl5BanBnXkFtZTcwMzQxNDk3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1973","placeOfBirth":" San Francisco, California, USA","birthName":"Yila Timothy Kang","height":"5' 8\" (1.73 m)","bio":"Tim Kang was born on March 16, 1973 in San Francisco, California, USA as Yila Timothy Kang. He is an actor and producer, known for The Mentalist (2008), Rambo (2008) and The Forgotten (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzEwODc1MV5BMl5BanBnXkFtZTcwMzQxNDk3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1085727","name":"Tim Kang","idIMDB":"nm1085727"},"actorId":"nm1085727","character":"En-Joo","urlCharacter":"http://www.imdb.com/character/ch0056275","main":true},{"actorName":"Maung Maung Khin","urlProfile":"http://www.imdb.com/name/nm2678196","urlPhoto":"","biography":{"bio":"Maung Maung Khin is an actor, known for Rambo (2008) and The Lady (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2678196","name":"Maung Maung Khin","idIMDB":"nm2678196"},"actorId":"nm2678196","character":"Tint","urlCharacter":"http://www.imdb.com/character/ch0056277","main":true},{"actorName":"Paul Schulze","urlProfile":"http://www.imdb.com/name/nm0776584","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyODc4MDMyMjVeQTJeQWpwZ15BbWU3MDQ4MDE4MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1962","placeOfBirth":" USA","height":"5' 9\" (1.75 m)","bio":"Paul Schulze was born on June 12, 1962 in the USA. He is an actor, known for Nurse Jackie (2009), Panic Room (2002) and Rambo (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyODc4MDMyMjVeQTJeQWpwZ15BbWU3MDQ4MDE4MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0776584","name":"Paul Schulze","idIMDB":"nm0776584"},"actorId":"nm0776584","character":"Michael Burnett","urlCharacter":"http://www.imdb.com/character/ch0005271","main":true},{"actorName":"Cameron Pearson","urlProfile":"http://www.imdb.com/name/nm0669212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg1MDY1MjE0NF5BMl5BanBnXkFtZTYwNDgwODYy._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Cameron Pearson is an actor and producer, known for Rambo (2008), Man Woman Film (1999) and Crazy Like They Are (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg1MDY1MjE0NF5BMl5BanBnXkFtZTYwNDgwODYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0669212","name":"Cameron Pearson","idIMDB":"nm0669212"},"actorId":"nm0669212","character":"Missionary #4","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Peterson","urlProfile":"http://www.imdb.com/name/nm2880249","urlPhoto":"","biography":{"bio":"Thomas Pettersson - an exceptionally talented comedian from Sweden. Unpredictable, diverse, engaging and an excellent communicator who had the crowd in the palm of his hand. Off stage, a real man's man, very good fun and a tireless worker. Very hard to drink under the table. Tom could do any Monty Python sketch, verbatim, at the drop of a hat and he credited Monty Python as one of his favorites, which had a major influence on him. His experience as one of the pioneers of foreigners performing Thai comedy marks him out as a stand out name on TV with approximately 30 TV shows and 800 live performances on the Thai comedy circuit - as a member of Tongkhon Nanachart Group.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2880249","name":"Thomas Peterson","idIMDB":"nm2880249"},"actorId":"nm2880249","character":"Missionary #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Skarberg","urlProfile":"http://www.imdb.com/name/nm2879107","urlPhoto":"","biography":{"bio":"Tony Skarberg is an actor, known for Rambo (2008) and Skin Trade (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2879107","name":"Tony Skarberg","idIMDB":"nm2879107"},"actorId":"nm2879107","character":"Missionary #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James With","urlProfile":"http://www.imdb.com/name/nm0999139","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmY2NTg4ZmEtOGQwNC00NjA0LTk0YmEtNGIzMGE5NDJjMmQ4L2ltYWdlXkEyXkFqcGdeQXVyNzY0MjUwMA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1967","placeOfBirth":" London, England, UK","birthName":"James R. Wearing Smith","height":"5' 10½\" (1.79 m)","bio":"James With started traveling early... before he was a year old he had travel through most of Europe, and perhaps it is correct to say he's never stopped. Learning to act came naturally and when his parents settled in Perth, Western Australia, it didn't take the young boy long to start dream of escaping again to explore other places. The untimely passing of his father when still in high school was likely the catalyst to pursuing a performance career, against his mother's wishes. Now, as an accomplished actor and producer, presently residing in Asia, James seeks out challenges and carefully chooses his acting engagements. Completing studies at the Western Australian Academy of Performing Arts (WAAPA) and the National Institute of Dramatic Art (NIDA), James has put his diverse wealth of life's experiences into his work as a producer and entertainment specialist, producing & co-producing through his flagship company TRI-US Entertainment. James has worked in the fields of investment banking and finance for international banks and investment firms, having also worked as a licensed securities dealer and financial investment advisor. James has cultivated a strong interest in structuring financial products for entertainment and the arts, focusing on stories with significant humanitarian, geographical and environmental themes. James loves acting and working actively in front of the camera and also relishes the challenges of production and working behind the camera. Sharing life and business with others continually inspires him to work at high professional standards and through the medium of entertainment he is intent on promoting Asia's vast range of locations, cultures and peoples in the global entertainment industry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmY2NTg4ZmEtOGQwNC00NjA0LTk0YmEtNGIzMGE5NDJjMmQ4L2ltYWdlXkEyXkFqcGdeQXVyNzY0MjUwMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0999139","name":"James With","nicknames":["James W. Gunn"],"idIMDB":"nm0999139"},"actorId":"nm0999139","character":"Missionary #5","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kasikorn Niyompattana","urlProfile":"http://www.imdb.com/name/nm2878863","urlPhoto":"","biography":{"bio":"Kasikorn Niyompattana is an actor, known for Rambo (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2878863","name":"Kasikorn Niyompattana","idIMDB":"nm2878863"},"actorId":"nm2878863","character":"Snake Hunter #2","urlCharacter":"http://www.imdb.com/character/ch0136736","main":true},{"actorName":"Shaliew 'Lek' Bamrungbun","urlProfile":"http://www.imdb.com/name/nm2879982","urlPhoto":"","biography":{"bio":"Shaliew 'Lek' Bamrungbun is an actor, known for Rambo (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2879982","name":"Shaliew 'Lek' Bamrungbun","idIMDB":"nm2879982"},"actorId":"nm2879982","character":"Snake Hunter #1","urlCharacter":"http://www.imdb.com/character/ch0136736","main":true}],"seasons":[],"idIMDB":"tt0462499","urlIMDB":"http://www.imdb.com/title/tt0462499","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$18,203,876","country":"USA","day":"27","month":"01","year":"2008","remarks":"2,751 Screens"},{"money":"£1,247,195","country":"UK","day":"24","month":"02","year":"2008","remarks":"300 Screens"},{"money":"BRL 1,261,748","country":"Brazil","day":"02","month":"03","year":"2008","remarks":"191 Screens"},{"money":"$11,997","country":"Estonia","day":"03","month":"02","year":"2008","remarks":"2 Screens"},{"money":"PHP 6,309,454","country":"Philippines","day":"27","month":"01","year":"2008","remarks":"45 Screens"},{"money":"RUR 38,780,834","country":"Russia","day":"27","month":"01","year":"2008","remarks":"417 Screens"}],"gross":[{"money":"$42,754,105","country":"USA","day":"27","month":"03","year":"2008","remarks":""},{"money":"$42,724,402","country":"USA","day":"23","month":"03","year":"2008","remarks":""},{"money":"$42,611,220","country":"USA","day":"16","month":"03","year":"2008","remarks":""},{"money":"$42,470,119","country":"USA","day":"09","month":"03","year":"2008","remarks":""},{"money":"$42,281,425","country":"USA","day":"02","month":"03","year":"2008","remarks":""},{"money":"$41,762,250","country":"USA","day":"24","month":"02","year":"2008","remarks":""},{"money":"$40,587,110","country":"USA","day":"17","month":"02","year":"2008","remarks":""},{"money":"$36,876,490","country":"USA","day":"10","month":"02","year":"2008","remarks":""},{"money":"$29,918,795","country":"USA","day":"03","month":"02","year":"2008","remarks":""},{"money":"$18,203,876","country":"USA","day":"27","month":"01","year":"2008","remarks":""},{"money":"£2,927,437","country":"UK","day":"09","month":"03","year":"2008","remarks":""},{"money":"£2,420,808","country":"UK","day":"02","month":"03","year":"2008","remarks":""},{"money":"£1,247,195","country":"UK","day":"24","month":"02","year":"2008","remarks":""},{"money":"BRL 2,406,857","country":"Brazil","day":"09","month":"03","year":"2008","remarks":""},{"money":"BRL 1,261,748","country":"Brazil","day":"02","month":"03","year":"2008","remarks":""},{"money":"BRL 2,961,900","country":"Bulgaria","day":"16","month":"03","year":"2008","remarks":""},{"money":"NOK 4,084,791","country":"Norway","day":"17","month":"02","year":"2008","remarks":""},{"money":"NOK 3,582,463","country":"Norway","day":"10","month":"02","year":"2008","remarks":""},{"money":"PHP 29,331,036","country":"Philippines","day":"16","month":"03","year":"2008","remarks":""},{"money":"PHP 28,937,790","country":"Philippines","day":"02","month":"03","year":"2008","remarks":""},{"money":"PHP 26,848,627","country":"Philippines","day":"17","month":"02","year":"2008","remarks":""},{"money":"PHP 22,337,739","country":"Philippines","day":"10","month":"02","year":"2008","remarks":""},{"money":"PHP 15,903,481","country":"Philippines","day":"03","month":"02","year":"2008","remarks":""},{"money":"PHP 6,309,454","country":"Philippines","day":"27","month":"01","year":"2008","remarks":""},{"money":"RUR 80,660,064","country":"Russia","day":"17","month":"02","year":"2008","remarks":""},{"money":"RUR 77,898,160","country":"Russia","day":"10","month":"02","year":"2008","remarks":""},{"money":"RUR 67,222,532","country":"Russia","day":"03","month":"02","year":"2008","remarks":""},{"money":"RUR 38,780,834","country":"Russia","day":"27","month":"01","year":"2008","remarks":""}],"weekendGross":[{"money":"$55,348","country":"USA","day":"23","month":"03","year":"2008","remarks":"136 Screens"},{"money":"$104,508","country":"USA","day":"16","month":"03","year":"2008","remarks":"201 Screens"},{"money":"$71,616","country":"USA","day":"09","month":"03","year":"2008","remarks":"163 Screens"},{"money":"$271,407","country":"USA","day":"02","month":"03","year":"2008","remarks":"402 Screens"},{"money":"$654,231","country":"USA","day":"24","month":"02","year":"2008","remarks":"727 Screens"},{"money":"$2,387,342","country":"USA","day":"17","month":"02","year":"2008","remarks":"1,702 Screens"},{"money":"$4,482,012","country":"USA","day":"10","month":"02","year":"2008","remarks":"2,717 Screens"},{"money":"$7,120,649","country":"USA","day":"03","month":"02","year":"2008","remarks":"2,764 Screens"},{"money":"$18,203,876","country":"USA","day":"27","month":"01","year":"2008","remarks":"2,751 Screens"},{"money":"£221,392","country":"UK","day":"09","month":"03","year":"2008","remarks":"241 Screens"},{"money":"£506,321","country":"UK","day":"02","month":"03","year":"2008","remarks":"299 Screens"},{"money":"£1,247,195","country":"UK","day":"24","month":"02","year":"2008","remarks":"300 Screens"},{"money":"BRL 261,105","country":"Brazil","day":"16","month":"03","year":"2008","remarks":"174 Screens"},{"money":"BRL 642,966","country":"Brazil","day":"09","month":"03","year":"2008","remarks":"191 Screens"},{"money":"BRL 1,261,748","country":"Brazil","day":"02","month":"03","year":"2008","remarks":"191 Screens"},{"money":"PHP 6,550","country":"Philippines","day":"16","month":"03","year":"2008","remarks":"1 Screen"},{"money":"PHP 98,320","country":"Philippines","day":"02","month":"03","year":"2008","remarks":"5 Screens"},{"money":"PHP 1,875,297","country":"Philippines","day":"17","month":"02","year":"2008","remarks":"40 Screens"},{"money":"PHP 3,083,200","country":"Philippines","day":"10","month":"02","year":"2008","remarks":"45 Screens"},{"money":"PHP 4,309,300","country":"Philippines","day":"03","month":"02","year":"2008","remarks":"45 Screens"},{"money":"PHP 6,309,454","country":"Philippines","day":"27","month":"01","year":"2008","remarks":"45 Screens"}],"admissions":[{"money":"348,734","country":"Brazil","day":"16","month":"03","year":"2008","remarks":""},{"money":"275,073","country":"Brazil","day":"09","month":"03","year":"2008","remarks":""},{"money":"131,527","country":"Brazil","day":"02","month":"03","year":"2008","remarks":""},{"money":"826,100","country":"France","day":"04","month":"03","year":"2008","remarks":""},{"money":"778,975","country":"France","day":"26","month":"02","year":"2008","remarks":""},{"money":"637,202","country":"France","day":"19","month":"02","year":"2008","remarks":""},{"money":"391,630","country":"France","day":"12","month":"02","year":"2008","remarks":""},{"money":"66,396","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""},{"money":"62,605","country":"Norway","day":"04","month":"04","year":"2008","remarks":""},{"money":"61,455","country":"Norway","day":"22","month":"03","year":"2008","remarks":""},{"money":"58,423","country":"Norway","day":"06","month":"03","year":"2008","remarks":""},{"money":"55,495","country":"Norway","day":"28","month":"02","year":"2008","remarks":""},{"money":"47,940","country":"Norway","day":"17","month":"02","year":"2008","remarks":""},{"money":"36,095","country":"Norway","day":"07","month":"02","year":"2008","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"02","year":"2007","remarks":null},{"money":null,"country":null,"day":"04","month":"05","year":"2007","remarks":null}],"copyrightHolder":"(2007) Equity Pictures Medienfonds GmbH &amp; Co. KG"},"technical":{"runtime":["1 hr 32 min (92 min)","1 hr 39 min (99 min) (extended)","1 hr 20 min (80 min) (FSK 16 rated) (cut) (Germany)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Zeiss Ultra Prime and Angenieux Optimo Lenses","Arricam ST, Zeiss Ultra Prime and Angenieux Optimo Lenses","Arriflex 235, Zeiss Ultra Prime and Angenieux Optimo Lenses","Arriflex 435 Xtreme, Zeiss Ultra Prime and Angenieux Optimo Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Hollywood Intermediate, Burbank (CA), USA (digital intermediate)","Kantana, Bangkok, Thailand (film processing)","Modern VideoFilm, Burbank (CA), USA (dailies: Los Angeles)"],"filmLength":["2,483 m (Sweden)","2,533 m (Portugal, 35mm)"],"negativeFormat":["35 mm (Kodak Vision2 500T 5218)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3513DI)","D-Cinema"]},"rating":"7.1","metascore":"46","filmingLocations":[{"location":"Arizona, USA"}],"rated":"R","awards":[{"award":"Golden Schmoes Awards 2008","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Best Action Sequence of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won Golden Trailer","categories":[{"category":"Most Original Poster","names":[]}]}]}],"votes":"185,850","type":"Movie","companyCreditsSimple":[{"idCompany":"co0173285","name":"Lionsgate"},{"idCompany":"co0150452","name":"Weinstein Company, The"},{"idCompany":"co0002572","name":"Millennium Films"}],"keywords":{"keywords":["rambo","missionary","burma","boat","mercenary","rescue","village","thailand","snake","army","river","burmese army","soldier","rescue mission","military","vietnam veteran","good versus evil","karate","kung fu","graphic violence","extreme violence","f word","machismo","dog tag","civil war","final showdown","final battle","surname as title","terrorism","terrorist","male protagonist","nightmare","dead children","2000s","written and directed by cast member","subtitled scene","rocket launcher","shotgun","silencer","pirate","resistance fighter","rebel","anti hero","war hero","martial arts","booby trap","mixed martial arts","mexican standoff","guerilla warfare","fistfight","disarming someone","river pirates","opening action scene","hand to hand combat","one against many","m 16","ambush","foot chase","hunting knife","jungle warfare","standoff","warrior","compound bow","shot with a bow and arrow","ak 47","combat","gore","anti aircraft gun","gunfight","blonde","tough guy","action hero","hero","evil man","stage performance","king cobra","snake boxing","blood splatter","cult film","blood on camera lens","one word title","sadism","river pirate","pursuit","neck breaking","flashback","chase","one man army","writer director","flamethrower","brutality","wristwatch","walkie talkie","village set on fire","unexploded bomb","stretcher","strangulation","southeast asia","singing","shockwave","rain","military camp","mass grave","mailbox","knife","impaled child","hand grenade","going home","gasoline","full moon","fishing","farm","exploding boat","dog","doctor","ditch","decomposing body","dead dog","compass","cage","anvil","hanging","execution","child burning","blood","bayonet","self mutilation","ripped in half","rapist","mass child killing","male nudity","hit on the head with a rock","gatling gun","death of a child","dark hero","dance","cut to pieces","cut into pieces","crushed head","child in peril","body count","beheading","arm ripped off","amazon","righteous rage","responsibility","kindness","idealism","honor","warlord","stabbing","sniper","shootout","rainstorm","pig","patrol boat","motorboat","land mine","bloodhound","throat slitting","sword","stabbed in the chest","sniper rifle","slaughter","shot to death","shot through the mouth","shot in the shoulder","shot in the head","shot in the chest","shot in the back","severed leg","severed arm","pistol","mine","massacre","machete","knife in the chest","intestines","head blown off","hanged man","genocide","foot blown off","exploding head","eaten alive","dismemberment","child shot in the head","child murder","bow and arrow","beaten to death","attempted rape","severed head","person on fire","explosion","exploding body","directed by star","bomb","violence","torture","pastor","mutilation","murder","machine gun","kidnapping","jungle","hostage","death","burmese soldier","battle","rape","sequel","fourth part","title spoken by character","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:08:48"}}