{"data":{"movies":[{"title":"Kraken: Tentacles of the Deep","originalTitle":"","year":"2006","releaseDate":"20060923","directors":[{"name":"Tibor Takács","id":"nm0847749"},{"name":"John Blush","id":"nm7919195"}],"writers":[{"name":"Abram Cox","id":"nm1117802"},{"name":"Sean Keller","id":"nm1396093"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MjIyMjUzMl5BMl5BanBnXkFtZTcwNTEwNDM0MQ@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Fantasy","Horror","Sci-Fi"],"plot":"Thirty years ago, Ray Reiter witnessed the brutal death of his parents at sea by a strange, octopus-like creature. Now determined to exact revenge, he joins archaeologist Nicole on a perilous high-seas expedition to find a legendary Greek Opal - said to be guarded by the very beast that murdered his family. As they come face to face with the killer Kraken, they must also battle a ruthless crime lord, who will stop at nothing to seize the coveted treasure for himself.","simplePlot":"Thirty years ago, Ray Reiter witnessed the brutal death of his parents at sea by a strange, octopus-like creature. Now determined to exact revenge, he joins archaeologist Nicole on a ... ","actors":[{"actorName":"Charlie O'Connell","urlProfile":"http://www.imdb.com/name/nm0640039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODkxNzg5OF5BMl5BanBnXkFtZTYwNzc4MTM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1975","placeOfBirth":" New York City, New York, USA","birthName":"Charles O'Connell","height":"6' 3½\" (1.92 m)","bio":"Charlie O'Connell was born on April 21, 1975 in New York City, New York, USA as Charles O'Connell. He is an actor, known for Dude, Where's My Car? (2000), Cruel Intentions (1999) and The New Guy (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODkxNzg5OF5BMl5BanBnXkFtZTYwNzc4MTM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0640039","name":"Charlie O'Connell","idIMDB":"nm0640039"},"actorId":"nm0640039","character":"Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Pratt","urlProfile":"http://www.imdb.com/name/nm0695560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMjEwODUwM15BMl5BanBnXkFtZTcwODU1NzU2Nw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1970","placeOfBirth":" Chesley, Ontario, Canada","birthName":"Victoria Ainsle Pratt","height":"5' 6\" (1.68 m)","bio":"She graduated summa cum laude from York University in Toronto and went on to work at the University in its Human Performance Lab, testing such elite professional athletes as the Toronto Maple Leafs and Winnipeg Jets and San Jose Sharks. She was also offered a scholarship to the master's program in physiotherapy at the University of Toronto but declined. She has writen a book on fitness and bodybuilding with one of her former university professors. Robert Kennedy (publisher of MuscleMag - whom she used to write for) convinced her to study acting and she began taking classes at the Actors Network in Toronto. Victoria is a blue belt in Shotokan karate and her favorite form of exercise is kickboxing. Victoria splits her time between Toronto, Los Angeles and New Zealand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMjEwODUwM15BMl5BanBnXkFtZTcwODU1NzU2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0695560","name":"Victoria Pratt","nicknames":["Sarge"],"idIMDB":"nm0695560"},"actorId":"nm0695560","character":"Nicole","urlCharacter":"http://www.imdb.com/character/ch0406363","main":true},{"actorName":"Kristi Angus","urlProfile":"http://www.imdb.com/name/nm0029981","urlPhoto":"","biography":{"dateOfBirth":"21 August 1971","placeOfBirth":" Kelowna, British Columbia, Canada","height":"5' 8\" (1.73 m)","bio":"Kristi Angus was born in Kelowna, British Columbia. She attended Simon Fraser University where she studied biology and psychology. After spending some years in Europe she eventually began taking acting classes in Vancouver, B.C. at the Gastown Actors Studio. She has also studied with David Rotenberg and Michele Lonsdale Smith. She lives in Toronto, Ontario.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0029981","name":"Kristi Angus","idIMDB":"nm0029981"},"actorId":"nm0029981","character":"Jenny","urlCharacter":"http://www.imdb.com/character/ch0112770","main":true},{"actorName":"Cory Monteith","urlProfile":"http://www.imdb.com/name/nm1719342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzI2ODMxNl5BMl5BanBnXkFtZTcwNDA2MjMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1982","placeOfBirth":" Calgary, Alberta, Canada","birthName":"Cory Allan Michael Monteith","height":"6' 3½\" (1.92 m)","bio":"Cory Monteith was born on May 11, 1982 in Calgary, Alberta, Canada as Cory Allan Michael Monteith. He was an actor, known for playing the singing jock Finn on the American TV show Glee (2009) and films such as Bienvenue à Monte Carlo (2011), and Destination finale 3 (2006). He died on July 13, 2013 in Vancouver, British Columbia, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzI2ODMxNl5BMl5BanBnXkFtZTcwNDA2MjMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1719342","name":"Cory Monteith","idIMDB":"nm1719342"},"actorId":"nm1719342","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Scalia","urlProfile":"http://www.imdb.com/name/nm0768815","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTU5Mzk5MV5BMl5BanBnXkFtZTYwMDkwODI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1950","placeOfBirth":" Brooklyn, New York, USA","birthName":"Jack Tomaso Scalia","height":"6' 1\" (1.85 m)","bio":"Actor Jack Scalia, a Brooklyn native, was raised in Brentwood,NY. He graduated from Brentwood High School in 1969. He was an All-American athlete in high school, playing three sports through college, while participating in four triathlons and six marathons. He decided to attempt Hollywood stardom as an actor after an injury ended a pro-baseball career. In 1975, he took advantage of his muscular build and macho good looks by modeling with Armani, later joining the Ford Modeling Agency and signing on as the \"Jordache Jeans Man\". In January 1980, Scalia made the transition into acting, which led to his first film role in the mini-movie, The Star Maker (1981), starring the late Rock Hudson. Scalia got his first taste of series stardom as an unshaven, rough-and-tough detective who joins forces with his slick and debonair father (Hudson again) in the TV series, The Devlin Connection (1982). Though the series had a short life, Scalia received scads of attention. His more popular telefilm credits included I'll Take Manhattan (1987), Vengeances de femmes (1991), Lady Boss (1992) and Casualties of Love: The Long Island Lolita Story (1993), playing infamous tabloid newsmaker Joey Buttafuoco, with Alyssa Milano as his teenage object of desire. Though Scalia never scaled to the heights of a Tom Selleck or Pierce Brosnan with that one smash series, he would headline a near-record eleven TV shows that kept him constantly in the running. In 2001, he joined the cast of All My Children (1970) for a time and won a daytime Emmy nomination in the process. He's also been an active hero and villain in low-budget thrillers, such as L'abîme (1990) (aka \"Endless Descent\"), T-Force (1994), Act of War (1998) and Ground Zero (2000). He then returned from living in Rome, Italy while filming a remake of his American TV series, Tequila and Bonetti (1992). He made his stage debut as the lead in the Pulitzer Prize-nominated play, \"Red River Rats\", in Los Angeles. The tall, dark and hirsutely handsome Scalia has remained a durable \"ladies' man\" and \"man's man\" for decades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTU5Mzk5MV5BMl5BanBnXkFtZTYwMDkwODI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768815","name":"Jack Scalia","idIMDB":"nm0768815"},"actorId":"nm0768815","character":"Maxwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleks Paunovic","urlProfile":"http://www.imdb.com/name/nm0006820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc3NDI1ODIyOF5BMl5BanBnXkFtZTgwNTI0MTk1NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1969","placeOfBirth":" Winnipeg, Manitoba, Canada","height":"6' 5\" (1.96 m)","bio":"Aleks Paunovic was born in Winnipeg, Manitoba to a Croatian mother and Serbian father. The result of this remarkable blend of bloodlines is the 6'5\" ruggedly handsome actor appearing on screens around the world at a rapidly escalating rate. Acting came to Aleks while he was onstage in his hometown playing in a heavy metal band, his livelihood since he was 16. Remarkably the role offered was one completely against type as it was that of Roddy McDowall's butler in the 1994 TV movie 'Heads'. Now bitten with the acting bug, Aleks combined his athleticism from his lifetime of boxing - he claims that he started boxing in the womb as all of the men in his family are boxers - and turned it into a very busy career as a stunt actor. In 2001 Aleks stopped in Vancouver on his way to Los Angeles with an impressive resume and ready to take on Hollywood when the most horrible event in America's recent history struck. 911 changed the way anyone could enter the states and so Aleks found himself a new home and career in busy Vancouver. Since coming to Vancouver Aleks has built an amazing resume with over 100 credits, most of which are lead and recurring roles like the one that he has on this hugely anticipated 4th season of 'Continuum'. Aleks credits three occurrences as the game-changers in his rocketing career: One was when the venerable acting coach Larry Moss called him out in front of 300 actors, telling him that he had massive talent and demanding to see his full range; another was when he respectfully declined an offer for a 4-episode-arc on a highly-rated TV series so that he could finish his run as 'Danny' in the play \"Danny and the Deep Blue Sea\" in a shaky old theatre to sold-out crowds. But the biggest catalyst in Aleks's career was when he fought three rounds of casting throughout all of Los Angeles and Vancouver to win the role of 'Tom', a developmentally disabled man accused of murder in 'Personal Effects' starring Ashton Kutcher, Michelle Pfieffer, and Kathy Bates. Aleks put on 65 pounds to perform the role, which was one of the most challenging and rewarding roles of his career so far. When you meet Aleks, or you watch him perform these difficult roles, you just know that with all of that leading man charisma there's star power in this man, and that you will be seeing a lot more of Aleks Paunovic.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc3NDI1ODIyOF5BMl5BanBnXkFtZTgwNTI0MTk1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006820","name":"Aleks Paunovic","idIMDB":"nm0006820"},"actorId":"nm0006820","character":"Ike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicole McKay","urlProfile":"http://www.imdb.com/name/nm0571034","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDc0MzAxMF5BMl5BanBnXkFtZTcwMTg1NTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1979","placeOfBirth":" North Vancouver, British Columbia, Canada","height":"5' 6\" (1.68 m)","bio":"Nicole McKay was born on September 16, 1979 in North Vancouver, British Columbia, Canada. She is an actress, known for Un long week-end (2005), Barely Legal (2003) and Kraken: Tentacles of the Deep (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDc0MzAxMF5BMl5BanBnXkFtZTcwMTg1NTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571034","name":"Nicole McKay","nicknames":["Nic"],"idIMDB":"nm0571034"},"actorId":"nm0571034","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michal Yannai","urlProfile":"http://www.imdb.com/name/nm0946170","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDM5MDMyMF5BMl5BanBnXkFtZTcwNTUzODkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1972","placeOfBirth":" Israel","bio":"Back in the 1990s, when Israel had only one (cables') kids' channel, Michal Yannai was the host of the main small kids' show. This role entitled her a lifetime typecast of \"queen of the children\", a typecast she hoped to break by appearing some years later in a controversial self reality show that dealt with her alleged true stories of doing drugs and orgies. She eventually broke her contract and refused to let the show on the air, and was promptly sued by the producers. Her second thoughts were allegedly pushed forward by her new businessman husband, Ofer Resles. The couple got divorced two years later, resulting in a bitter alimony war in court. Though appearing in various shows and films, including a short stint in the US, it was a decade later after her initial fame that the attractive blond gained newfound glory. She did so by parodying herself as \"the has been queen of the children\" in the Israeli version of the play \"Avenue Q\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDM5MDMyMF5BMl5BanBnXkFtZTcwNTUzODkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0946170","name":"Michal Yannai","idIMDB":"nm0946170"},"actorId":"nm0946170","character":"Sally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle Tejpar","urlProfile":"http://www.imdb.com/name/nm2328500","urlPhoto":"","biography":{"bio":"Kyle Tejpar is an actor, known for Kraken: Tentacles of the Deep (2006), The Stolen (2012) and Hikaru No Go: New Year Special (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2328500","name":"Kyle Tejpar","idIMDB":"nm2328500"},"actorId":"nm2328500","character":"Young Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Dopud","urlProfile":"http://www.imdb.com/name/nm0233304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTgwOTAwM15BMl5BanBnXkFtZTcwODAwNTM4Mw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1968","placeOfBirth":" Montreal, Quebec, Canada","height":"6' (1.83 m)","bio":"Mike Dopud is a man with presence. As an actor, his screen presence has a far different kind of impact than the kind he used to deliver as a professional athlete -- Both are hard-hitting and memorable. Dopud was born in Montreal, Canada, the second son of a Yugoslavian family. Mike speaks three languages fluently (English, French, and Serbian). Graduating with a degree in Physiology and International Business Administration from Southern Illinois University where he was a four-year letterman, Dopud went on to a pro-football career in the Canadian Football League that was cut short by a knee injury. After rehabilitating his knee, he found himself back on skates playing pro hockey in the Minor Leagues. Plagued by injury, his sports career ended abruptly. It wasn't long after Dopud had his first taste of the film industry on the hit television series The X-Files (1993). \"I was hooked.\" Dopud's talent, rugged good looks, and screen presence has also caught the attention of casting directors. His forty acting credits over the last few years has made this working actor someone to watch for and someone who is hard to miss. In the soon-to-be released King Rising - Au nom du Roi (2007), Dopud plays General Backler. Some of Dopud's other recent film credits include 300 (2006), White Noise (2005), BloodRayne (2005), Rollerball (2002), I Spy (2002), X-Men 2 (2003), I, Robot (2004), and Canada Russia '72 (2006). Dopud has had recurring roles on such shows as Smallville (2001), Battlestar Galactica (2004), Jeff Ltd. (2005), Stargate SG-1 (1997), and Millennium (1996). This fall, Mike can be seen on MTV playing the role of Don Harris on the new series Kaya (2007). His size and professional sports background landed Dopud regular stunt work while he steadily began building his acting resume. His \"day at the office\" in stunt work has included being set on fire, hit by a car, falling off buildings thrown through windows and down stairs, flying through walls, and more fight scenes than Mike Tyson has fought professional bouts. He's duked it out with Dwayne Johnson (Walking Tall (2004)), Jason Statham (Chaos (2005)), Vin Diesel (The Chronicles of Riddick (2004)), Jessica Alba (Dark Angel), Lucy Liu (Ballistic: Ecks vs. Sever (2002)), Jean-Claude Van Damme (Replicant (2001)), and the Charlestown Chiefs in the sequel to the cult classic One More Minute (1979): Slap Shot 2: Breaking the Ice (2002). Most recently Dopud has been nominated for a 2005 Taurus World Stunt Awards for Best High Work in the movie Walking Tall (2004). Dopud is also excited that he has returned to the stage most recently in the original plays: Rockets Red Glare and Of Diners and Buses. And Two Small Bodies. Gingham Dog.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTgwOTAwM15BMl5BanBnXkFtZTcwODAwNTM4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0233304","name":"Mike Dopud","idIMDB":"nm0233304"},"actorId":"nm0233304","character":"David","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emy Aneke","urlProfile":"http://www.imdb.com/name/nm0029342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc1NDU5MjczM15BMl5BanBnXkFtZTgwMzA4OTQ0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Emy Aneke is an actor, known for Star Trek Beyond (2016), X-Men: L'affrontement final (2006) and The Final Cut (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc1NDU5MjczM15BMl5BanBnXkFtZTgwMzA4OTQ0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0029342","name":"Emy Aneke","idIMDB":"nm0029342"},"actorId":"nm0029342","character":"Firefighter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elias Toufexis","urlProfile":"http://www.imdb.com/name/nm1340118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzczMjcwODBeQTJeQWpwZ15BbWU4MDYyOTU1MTAy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1975","placeOfBirth":" Montréal, Québec, Canada","birthName":"Illya George Toufexis","height":"5' 10\" (1.78 m)","bio":"Elias Toufexis has become an actor with a fan base and cult following around the world. He has played dozens of major characters on television in shows like. Bitten, Lost Girl, Alphas, Stargate Atlantis, Smallville, Eureka, Houdini & Doyle and particularly memorable characters on Supernatural and The Expanse Elias has amassed quite a following in the Science Fiction/Fantasy community. But television and film is only half of what Elias is known for. In the video-game world, Elias has played the leading characters in many multi-million dollar projects. The Assassin's Creed Series, The Far Cry Series, The Deus Ex Series, The Splinter Cell Series and dozens more... He does not only voice these characters but completely performs them through Motion/Performance Capture. Playing the leading character of Adam Jensen in The Deus Ex series has brought Elias the most fame. The original sold 4 Million+ units (making more than 280 Million) and now it has spawned sequels and an entire entertainment universe, from multiple games to books to comics, bringing Elias even more attention. He is also the lead character of Takkar in the game Far Cry Primal. Another leading character in an immensely popular franchise. The 6th title of this multi-million dollar series. You can also hear Elias as the voice of Yellow Pages, McDonald's, Lexus Cars and many many more radio and TV voice-over commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzczMjcwODBeQTJeQWpwZ15BbWU4MDYyOTU1MTAy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1340118","name":"Elias Toufexis","idIMDB":"nm1340118"},"actorId":"nm1340118","character":"Keith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christa Campbell","urlProfile":"http://www.imdb.com/name/nm0132300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzYyNTc3MV5BMl5BanBnXkFtZTcwMTM1OTc1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1972","placeOfBirth":" Oakland, California, USA","birthName":"Christa M. Campbell","height":"5' 8\" (1.73 m)","bio":"Christa Campbell made her mark as portraying a young Bettie Page in E! True Hollywood Story (1996). Christa's far-ranging roles in include the movie Day of the Dead (2008) and the action-thriller Hero Wanted (2008) with Cuba Gooding Jr. also Coeurs perdus (2006), co-starring with John Travolta, James Gandolfini and Salma Hayek, and shares the screen with Nicolas Cage in The Wicker Man (2006). She has since starred in the action flick Lies & Illusions (2009) with Christian Slater, and performed in the comedy Finding Bliss (2009) with Leelee Sobieski.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzYyNTc3MV5BMl5BanBnXkFtZTcwMTM1OTc1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0132300","name":"Christa Campbell","nicknames":["xta"],"idIMDB":"nm0132300"},"actorId":"nm0132300","character":"Emily","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Green","urlProfile":"http://www.imdb.com/name/nm0337592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzkzNjkxMTleQTJeQWpwZ15BbWU3MDg0NTc2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1942","placeOfBirth":" Australia","bio":"Alex Green was born on January 19, 1942 in Australia. He is known for his work on X-Men 2 (2003), Romeo + Juliet (1996) and Night at the Museum (2006). He died on July 20, 2010 in British Columbia, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzkzNjkxMTleQTJeQWpwZ15BbWU3MDg0NTc2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0337592","name":"Alex Green","idIMDB":"nm0337592"},"actorId":"nm0337592","character":"Driver Jim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Lazenby","urlProfile":"http://www.imdb.com/name/nm1342807","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzkzMzQ1OV5BMl5BanBnXkFtZTgwNjg0OTk3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Paul Lazenby is known for his work on Deadpool (2016), War for the Planet of the Apes (2017) and The Predator (2018). He was previously married to Marianna Komlos.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzkzMzQ1OV5BMl5BanBnXkFtZTgwNjg0OTk3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1342807","name":"Paul Lazenby","nicknames":["The Mauler"],"idIMDB":"nm1342807"},"actorId":"nm1342807","character":"Cam","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0486099","urlIMDB":"http://www.imdb.com/title/tt0486099","business":{"budget":{"money":"$2,100,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"14","month":"09","year":"2005","remarks":null},{"money":null,"country":null,"day":"04","month":"10","year":"2005","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min) (Canada)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.7","filmingLocations":[{"location":"Britannia Beach, British Columbia, Canada"}],"rated":"R","awards":[],"votes":"976","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0169785","name":"Sci Fi Pictures"},{"idCompany":"co0156827","name":"Pitchblack Pictures"},{"idCompany":"co0024720","name":"Nu Image / Millennium Films"}],"keywords":{"keywords":["kraken","creature feature","scuba","scuba diving","treasure hunter","squid","sea monster","pirate","ocean","monster","giant animal","cigar smoking","archeology","loss of mother","loss of father","artifact","underwater scene","marine archeology","giant squid","explosion","decapitation","blood","bikini","babe scientist"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:51:51"}}