{"data":{"movies":[{"title":"Disturbia","originalTitle":"","year":"2007","releaseDate":"20070413","directors":[{"name":"D.J. Caruso","id":"nm0142286"}],"writers":[{"name":"Christopher Landon","id":"nm0484907"},{"name":"Carl Ellsworth","id":"nm0255296"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTIxOTQ3M15BMl5BanBnXkFtZTcwMjU2NzAzMw@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama","Mystery","Thriller"],"plot":"After his father is killed in a car accident, things unravel for Kale Brecht and he is placed under house-arrest for punching his Spanish teacher. Having nothing better to do, Kale occupies himself by spying on his neighbors. But one night, he witnesses what appears to be a murder going on in Mr. Turner's house. Kale becomes obsessed with uncovering the truth behind these murders but, after a few unsettling run-ins with Mr. Turner, it becomes a matter of life and death. And the ominous question: Who is watching whom?","simplePlot":"A teen living under house arrest becomes convinced his neighbor is a serial killer.","actors":[{"actorName":"Shia LaBeouf","urlProfile":"http://www.imdb.com/name/nm0479471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzODQ3NzczNF5BMl5BanBnXkFtZTgwODQ1NzY1MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Shia Saide LaBeouf","height":"5' 9¼\" (1.76 m)","bio":"Shia Saide LaBeouf was born in Los Angeles, California, to Shayna (Saide) and Jeffrey Craig LaBeouf, and is an only child. His mother is from an Ashkenazi Jewish family, while his father has Cajun (French) ancestry. His parents are divorced. He started his career by doing stand-up comedy around places in his neighborhood, such as coffee clubs. One day, he saw a friend of his acting on Dr. Quinn, Medicine Woman (1993), and wanted to become an actor. Shia and his mother talked it over, and the next day, he started looking for an agent. He searched in the yellow pages, called one up, and did a stand-up routine in front of him. They liked him and signed him, and then he started auditioning. He is well known for playing Louis Stevens on the popular Disney Channel series Even Stevens (2000) and has won a Daytime Emmy Award for his performance. His best known role is as Sam Witwicky, the main protagonist of the first three installments of the Transformers series: Transformers (2007), Transformers: Revenge of the Fallen (2009) and Transformers: Dark of the Moon (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzODQ3NzczNF5BMl5BanBnXkFtZTgwODQ1NzY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0479471","name":"Shia LaBeouf","idIMDB":"nm0479471"},"actorId":"nm0479471","character":"Kale","urlCharacter":"http://www.imdb.com/character/ch0081843","main":true},{"actorName":"Sarah Roemer","urlProfile":"http://www.imdb.com/name/nm2105255","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTQ1MzAxMV5BMl5BanBnXkFtZTcwNDIyOTkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1984","placeOfBirth":" San Diego, California, USA","birthName":"Sarah Christine Roemer","height":"5' 7½\" (1.71 m)","bio":"American actress and model Sarah Roemer starred as the love interest of Shia LaBeouf's character in the thriller Disturbia (2007). She was born in San Diego, California, and began modeling at the age of 15 after she was discovered buying coffee at a local 7-Eleven while attending Horizon Jr/Sr High School. At the age of 17 she moved away from her family to New York. She began her acting career playing Lacey in Takashi Shimizu's The Grudge 2 (2006). She later co-starred with Joseph Cross in Falling Up (2009). She was the leading actress in David R. Ellis' Asylum (2008), Katherine Brooks' Waking Madison (2010) and in Fired Up! (2009). She co-starred with Golden Globe winner Richard Gere and three-time Oscar nominee Joan Allen in Hachi: A Dog's Tale (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTQ1MzAxMV5BMl5BanBnXkFtZTcwNDIyOTkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2105255","name":"Sarah Roemer","idIMDB":"nm2105255"},"actorId":"nm2105255","character":"Ashley","urlCharacter":"http://www.imdb.com/character/ch0091135","main":true},{"actorName":"Carrie-Anne Moss","urlProfile":"http://www.imdb.com/name/nm0005251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjgwNzEwOF5BMl5BanBnXkFtZTcwNTQ0NzI5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1967","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 8½\" (1.74 m)","bio":"Carrie-Anne Moss was born on August 21, 1967, in Vancouver, British Columbia, the youngest of two children of Barbara and Melvyn Moss. At age 20, she moved to Europe to pursue a career in modeling; in Spain she was cast in a regular role in the TV show Dark Justice (1991), which was produced in Barcelona for its first season, and she followed it to the shooting locations in Los Angeles the next year. Later she appeared in numerous commercials and TV series, including Matrix (1993), which coincidentally presaged the movie that would make her famous, as well as Models Inc. (1994) and F/X: The Series (1996). Moss got an unexpected and high-profile breakthrough when she was cast as the character Trinity in The Matrix (1999) opposite Keanu Reeves and Laurence Fishburne. Her imposing, sympathetic, and athletic performance in the alternate-world, science-fiction action film immediately thrust her into the spotlight and brought her roles in a number of mainstream Hollywood films, including mob comedy The Crew (2000), sci-fi thriller Red Planet (2000), and serial killer drama Suspect Zero (2004). Although she also appeared in the subsequent Matrix sequels The Matrix Reloaded (2003) and Matrix Revolutions (2003) (and provided the voices for the video games inspired by the films), Moss cultivated a rich and varied career in independent films. She played an unhappily-married housewife in the Oscar-nominated drama Chocolat (2000), and starred opposite Guy Pearce in Christopher Nolan's backwards-told thriller Memento (2000), for which she won an Independent Spirit Award for Best Supporting Actress. Other notable indie films included The Chumscrubber (2005), Mini's First Time (2006), Snow Cake (2006), and Fireflies in the Garden (2008). Moss later appeared as Shia LaBeouf's mother in the surprise box office hit Disturbia (2007) and co-starred in the direct-to-DVD thriller Unthinkable (2010) before undertaking a successful guest-star run on the NBC action comedy Chuck (2007). Most recently, she returned to the world of alternate realities with the horror film Silent Hill: Revelation 3D (2012). Moss married actor Steven Roy in 1999, and the couple have two sons and a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjgwNzEwOF5BMl5BanBnXkFtZTcwNTQ0NzI5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005251","name":"Carrie-Anne Moss","idIMDB":"nm0005251"},"actorId":"nm0005251","character":"Julie","urlCharacter":"http://www.imdb.com/character/ch0091136","main":true},{"actorName":"David Morse","urlProfile":"http://www.imdb.com/name/nm0001556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjUzOTE1N15BMl5BanBnXkFtZTYwNTU4NDQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1953","placeOfBirth":" Hamilton, Massachusetts, USA","birthName":"David Bowditch Morse","height":"6' 4\" (1.93 m)","bio":"David Morse, a 6' 4\" tall blue-eyed blond who performed on stage for 10 years before breaking into film, became established as a respected supporting, character actor and second lead. He was born the first of four children of Charles, a sales manager, and Jacquelyn Morse, a schoolteacher, on October 11, 1953, in Beverly, Massachusetts. He grew up with three younger sisters. After graduating from high school, Morse studied acting at the William Esper Studio. In 1971, he began his professional acting career appearing in over 30 productions with the Boston Repertory Company from 1971 to 1977. In the late 1970s, Morse continued his stage career with the Circle Repertory Company in New York before moving into television and film. In the late 1990s, he returned to the Off-Broadway stage starring in Paula Vogel's Pulitzer Prize winning drama, \"How I Learned to Drive\" (1997), for which he won the Drama Desk Award and the Obie. Morse made his big screen debut in 1980 co-starring as \"Jerry Maxwell\", a cheerful bartender turned basketball player, opposite John Savage and Diana Scarwid in Inside Moves (1980), written by Barry Levinson and directed by Richard Donner. Although Inside Moves (1980) was nominated for an Oscar, Morse had to wait a few years until his career took off. His big break came in 1982 when he was cast as Dr. Jack \"Boomer\" Morrison, a young doctor who struggles as a single parent after the death of his wife, in St. Elsewhere (1982), a medical drama that ran for six seasons. He co-starred as opposite Jodie Foster and young Jena Malone in the Oscar nominated Sci-Fi drama Contact (1997). In 1999, he appeared in Stephen King's The Green Mile (1999), with Tom Hanks. A year later, he played a supporting role as a kidnapped husband of Meg Ryan in Proof of Life (2000). In 2002, Morse became the first English-speaking actor nominated for the Golden Horse Award, the Chinese equivalent of the Oscars, for his superb performance as FBI expert \"Kevin Richter\" in Double Vision (2002). From 2002 to 2004, Morse had a regular gig starring as \"Mike Olshansky\", an ex-Philadelphia policeman turned cab driver, in the TV series Hack (2002) which ran three seasons and was filmed in Philadelphia, close to his home. In 2006-2007, he has a recurring role on season 3 of an Emmy award-winning medical drama House (2004). David Morse has been married to fellow actress Susan Wheeler Duff since 1982. They have three children, one daughter and twin sons. In 1994, after the the Northridge earthquake destroyed his home in Sherman Oaks, Morse moved from LA to Philadelphia with his family, and resides in his wife's hometown.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjUzOTE1N15BMl5BanBnXkFtZTYwNTU4NDQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001556","name":"David Morse","idIMDB":"nm0001556"},"actorId":"nm0001556","character":"Mr. Turner","urlCharacter":"http://www.imdb.com/character/ch0091137","main":true},{"actorName":"Aaron Yoo","urlProfile":"http://www.imdb.com/name/nm1683094","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzkxMzAwMl5BMl5BanBnXkFtZTgwODQ1MTY3NzE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1979","placeOfBirth":" New Jersey, USA","height":"5' 7½\" (1.71 m)","bio":"Aaron Yoo was born on May 12, 1979 in New Jersey, USA. He is an actor and cinematographer, known for 21 (2008), Disturbia (2007) and Nick and Norah's Infinite Playlist (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzkxMzAwMl5BMl5BanBnXkFtZTgwODQ1MTY3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1683094","name":"Aaron Yoo","idIMDB":"nm1683094"},"actorId":"nm1683094","character":"Ronnie","urlCharacter":"http://www.imdb.com/character/ch0010415","main":true},{"actorName":"Jose Pablo Cantillo","urlProfile":"http://www.imdb.com/name/nm1504678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkyMjMxMV5BMl5BanBnXkFtZTcwODk3NDI2Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1979","placeOfBirth":" Marshfield, Wisconsin, USA","height":"5' 9½\" (1.77 m)","bio":"Jose Pablo Cantillo was born on March 30, 1979 in Marshfield, Wisconsin, USA. He is an actor and producer, known for Crank (2006), Elysium (2013) and Chappie (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkyMjMxMV5BMl5BanBnXkFtZTcwODk3NDI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1504678","name":"Jose Pablo Cantillo","idIMDB":"nm1504678"},"actorId":"nm1504678","character":"Officer Gutierrez","urlCharacter":"http://www.imdb.com/character/ch0054809","main":true},{"actorName":"Matt Craven","urlProfile":"http://www.imdb.com/name/nm0002023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTkyMzk4OF5BMl5BanBnXkFtZTgwMDI4NDAzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1956","placeOfBirth":" Port Colborne, Ontario, Canada","birthName":"Matthew John Crnkovich","height":"5' 10\" (1.78 m)","bio":"Canadian-born actor Matt Craven is among the most sought after character actors of film and television today, starring in such blockbuster critically acclaimed films as the Academy-Award-nominated \"Crimson Tide\" and \"A Few Good Men\" and SAG Award nominated \"X-Men: First Class.\" Craven has starred opposite great Hollywood actors such as Denzel Washington, Gene Hackman, Helen Mirren, Maggie Gyllenhaal, Ethan Hawke, James Gandolfini, and Michael Caine, to name a few, and was recently seen starring in the hit ABC science fiction drama series \"Resurrection\" as Fred Langston, sheriff of Arcadia, Missouri, a town that's turned upside down as deceased loved ones return after death. Craven can also be seen starring in Roland Emmerich's film \"Stonewall,\" which chronicles a young man's political awakening and coming of age leading up to the Stonewall Riots (set for 2015 release) and \"Unless,\" based on the novel of the same name, opposite Academy-Award-nominated Catherine Keener, also set for a 2015 release. Originally from Ontario, Canada, Craven did not catch the acting bug until later in his years. Craven's father died six weeks after his birth, and he ultimately dropped out of high school to help support his mother and family. He found himself working odd jobs such as driving trucks and working maintenance for electrical companies. It wasn't until Craven was about 20 years old that his love for acting sparked when he found an ad in the local newspaper announcing auditions for a local production of Dracula. Craven auditioned, landed the role of Jonathan Harker, and from then on, never looked back. He found his true passion. Craven's first feature film was opposite Bill Murray in \"Meatballs\" as Hardware, one of Tripper Harrison's (Murray) counselors-in-training at Camp North Star, a cut-rate summer camp. This hilarious comedy was the start of Craven's career, especially in the comedy world. During this time, Murray took Craven under his wing and immediately started teaching him the fundamentals of improve and how to create and mold a character. Craven's second major project, the live action short \"Bravery in the Field\" was nominated for an Academy Award. In the following years, Craven moved on to star in three different sitcom pilots opposite the likes of Alan Arkin, Richard Lewis, Annie Potts and Holland Taylor. Moving away from the comedy scene, Craven's first major dramatic break came when he was cast in the drama/horror/mystery cult favorite, \"Jacob's Ladder,\" which follows a haunted Vietnam war veteran as he attempts to discover his past while suffering from a severe case of dissociation. Craven starred as Michael, a chemist in the Army's chemical warfare division where he worked on a drug that was secretly given to the veteran's unit. This critically acclaimed film raised Craven's career to a whole new level, proving his versatility as an actor, and truly gave him a taste of Hollywood stardom. Craven has since starred in massively popular feature films including \"Public Enemies,\" \"Disturbia,\" \"Déjà vu,\" \"The Life of David Gale,\" \"The Statement,\" \"Indian Summer,\" \"K2\" and \"Tin Men.\" On the small screen, Craven has worked exclusively with Graham Yost on HBO's acclaimed award winning series, \"From the Earth to the Moon\", \"The Pacific\", and \"Boomtown.\" Most recently on \"Justified\", he also starred on TNT's \"Nuremberg\" and \"Kingfish: A Story of Huey P. Long\", Steven Spielberg's \"High Incident\" and opposite Jeff Goldblum on NBC's \"Raines\". Truly a man of many talents, Craven has also made a successful impact in theater as well, as his first off-Broadway play was the award winning \"Blue Window,\" which was ultimately picked up and filmed for American Playhouse. He also successfully brought one of his favorite Canadian plays, \"The Crackwalker\" to be produced at The Hudson Guild Theater in New York City, starring himself, a young Joe Mantello (\"Wicked\") and Frances Fisher (\"Titanic\"). Additionally, Craven starred in the critically acclaimed American premiere of the German playwright, Franz Xaver Kroetz's \"The Nest.\" Off the screen, Craven is a strong supporter of \"One Heart Source,\" an organization designed to empower at risk children through education in Africa. He is also an avid golfer and is ranked third by Golf Digest in Hollywood's Top 100 Golfers. He also enjoys gardening, cooking and woodworking, and, most of all, spending time with his wife of over 25 years, Emmy-Award-winning Make Up Artist Sally Sutton, and their two children, Nicholas and Josephine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTkyMzk4OF5BMl5BanBnXkFtZTgwMDI4NDAzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002023","name":"Matt Craven","idIMDB":"nm0002023"},"actorId":"nm0002023","character":"Daniel Brecht","urlCharacter":"http://www.imdb.com/character/ch0028387","main":true},{"actorName":"Viola Davis","urlProfile":"http://www.imdb.com/name/nm0205626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYwMzI0NDY4OF5BMl5BanBnXkFtZTgwOTU4MDk1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1965","placeOfBirth":" Saint Matthews, South Carolina, USA","height":"5' 5\" (1.65 m)","bio":"Actress Viola Davis was born on her grandmother's farm, at the then-Singleton Plantation in St. Matthews, South Carolina. When she was two months old her family moved to Central Falls, Rhode Island, where her father, Dan Davis, worked as a horse groomer and trainer. Her mother, Mary Alice (Logan), a maid and factory worker, was also a civil rights activist. Davis was educated at Central Falls High School, where she developed a love of acting. She studied theater at Rhode Island College, and also attended the prestigious Juilliard School in New York City. Davis made her screen debut with a small role as a nurse in 1996's The Substance of Fire (1996). Guest spots followed in various TV shows and films, and in 2000 she won the role of Nurse Lynnette Peeler in City of Angels (2000). In 2001, Davis appeared on Broadway in the play, 'King Hedley II', for which she was awarded a Tony for Best Featured Actress in a Play. Davis has worked with Steven Soderbergh on three projects - Traffic (2000), Solaris (2002) and Syriana (2005). Other projects include Far from Heaven (2002), Antwone Fisher (2002) and Disturbia (2007). In 2008, she played Mrs. Miller in Doubt (2008), for which she was nominated for a Best Supporting Actress Oscar. In 2011, she won critical acclaim for her starring role as Aibileen Clark in the box-office hit The Help (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYwMzI0NDY4OF5BMl5BanBnXkFtZTgwOTU4MDk1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205626","name":"Viola Davis","idIMDB":"nm0205626"},"actorId":"nm0205626","character":"Detective Parker","urlCharacter":"http://www.imdb.com/character/ch0131148","main":true},{"actorName":"Brandon Caruso","urlProfile":"http://www.imdb.com/name/nm2596831","urlPhoto":"","biography":{"bio":"Brandon Caruso is known for his work on Disturbia (2007), Eagle Eye (2008) and Standing Up (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2596831","name":"Brandon Caruso","idIMDB":"nm2596831"},"actorId":"nm2596831","character":"Greenwood Boy","urlCharacter":"http://www.imdb.com/character/ch0131149","main":true},{"actorName":"Luciano Rauso","urlProfile":"http://www.imdb.com/name/nm2366002","urlPhoto":"","biography":{"dateOfBirth":"28 April 1995","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Luciano Rauso was born on April 28, 1995 in Pittsburgh, Pennsylvania, USA. He is an actor, known for Disturbia (2007), Arthur's Missing Pal (2006) and Small Bits of Happiness (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2366002","name":"Luciano Rauso","idIMDB":"nm2366002"},"actorId":"nm2366002","character":"Greenwood Boy","urlCharacter":"http://www.imdb.com/character/ch0131149","main":true},{"actorName":"Daniel Caruso","urlProfile":"http://www.imdb.com/name/nm2596139","urlPhoto":"","biography":{"bio":"Daniel Caruso is an actor, known for Disturbia (2007), Eagle Eye (2008) and Standing Up (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2596139","name":"Daniel Caruso","idIMDB":"nm2596139"},"actorId":"nm2596139","character":"Greenwood Boy","urlCharacter":"http://www.imdb.com/character/ch0131149","main":true},{"actorName":"Kevin Quinn","urlProfile":"http://www.imdb.com/name/nm1243616","urlPhoto":"","biography":{"bio":"Kevin Quinn is an actor, known for Disturbia (2007), Eagle Eye (2008) and The Salton Sea (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1243616","name":"Kevin Quinn","idIMDB":"nm1243616"},"actorId":"nm1243616","character":"Mr. Carlson","urlCharacter":"http://www.imdb.com/character/ch0010411","main":true},{"actorName":"Elyse Mirto","urlProfile":"http://www.imdb.com/name/nm0592558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMDg3NzM4OV5BMl5BanBnXkFtZTgwMTAzODY2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Elyse Mirto is a Detroit native who trained classically at the Royal National Theatre of Great Britain, She graduated from Western Michigan University with a BFA in Music Theatre Performance. She got her professional start in Chicago at the Goodman Theatre under Tony award winner Robert Falls and went on to star at Chicago Shakespeare Rep. Also in Chicago Elyse originated the role of Sue in Neil LaBute's BASH. She was the 2009 York Innovative Theatre Award winner for Outstanding Actress in a Lead Role for Nat Cassidy's thriller, \"Any Day Now\" and nominated in the same category the following year and made her Off Broadway debut. Numerous LA theatre appearances including at A Noise Within (LA drama circle nominee) Rubicon theatre (Ovation nominee) The Geffen Playhouse, Boston Court and The Mark Taper. She's known as Debbie Foster on TNTs as well as guest starring on several series Studio and independent films. National commercials, voice overs, audio books. She splits her time between New York and Los Angeles. Elyse is domestic partners with the actor Bo Foxworth. She is a Libra with a serious chocolate addiction. A former dancer who still loves to jitterbug and Lindy Hop. Elyse also enjoys art, music, yoga and Go-Karts....and did we mention chocolate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMDg3NzM4OV5BMl5BanBnXkFtZTgwMTAzODY2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0592558","name":"Elyse Mirto","idIMDB":"nm0592558"},"actorId":"nm0592558","character":"Mrs. Carlson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Suzanne Rico","urlProfile":"http://www.imdb.com/name/nm0725648","urlPhoto":"","biography":{"dateOfBirth":"26 January 1965","placeOfBirth":" Santa Clara, California, USA","birthName":"Suzanne T. Rico","height":"5' 8\" (1.73 m)","bio":"Suzanne Rico was born on January 26, 1965 in Santa Clara, California, USA as Suzanne T. Rico. She is an actress, known for Disturbia (2007), The Company Men (2010) and Red Letters (2000). She is married to Ethan. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0725648","name":"Suzanne Rico","idIMDB":"nm0725648"},"actorId":"nm0725648","character":"News Anchor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kent Shocknek","urlProfile":"http://www.imdb.com/name/nm0794688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg4ODUxMzY2MV5BMl5BanBnXkFtZTgwMjcxNzU2NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1956","placeOfBirth":" Berkeley, California, USA","height":"6' 2\" (1.88 m)","bio":"Veteran Los Angeles TV news anchor Kent Shocknek frequently is cast for authentic portrayals of newscasters, reporters, commentators, and similar parts in dramas and comedies. Increasingly, he has been sought out to play authority figures, outside the realm of the broadcasting industry. His breakout role was starring as the male lead in the 2014 short film, \"The 6 O'Clock.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg4ODUxMzY2MV5BMl5BanBnXkFtZTgwMjcxNzU2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0794688","name":"Kent Shocknek","idIMDB":"nm0794688"},"actorId":"nm0794688","character":"News Anchor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0486822","urlIMDB":"http://www.imdb.com/title/tt0486822","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$22,224,982","country":"USA","day":"15","month":"04","year":"2007","remarks":"2,925 Screens"},{"money":"£728,145","country":"UK","day":"16","month":"09","year":"2007","remarks":"400 Screens"},{"money":"BRL 608,708","country":"Brazil","day":"02","month":"09","year":"2007","remarks":"140 Screens"},{"money":"$8,382","country":"Estonia","day":"16","month":"09","year":"2007","remarks":"1 Screen"}],"gross":[{"money":"$80,209,692","country":"USA","day":"02","month":"08","year":"2007","remarks":""},{"money":"$80,050,171","country":"USA","day":"29","month":"07","year":"2007","remarks":""},{"money":"$79,886,463","country":"USA","day":"22","month":"07","year":"2007","remarks":""},{"money":"$79,305,519","country":"USA","day":"08","month":"07","year":"2007","remarks":""},{"money":"$78,801,059","country":"USA","day":"01","month":"07","year":"2007","remarks":""},{"money":"$78,539,639","country":"USA","day":"24","month":"06","year":"2007","remarks":""},{"money":"$78,289,474","country":"USA","day":"17","month":"06","year":"2007","remarks":""},{"money":"$77,768,967","country":"USA","day":"10","month":"06","year":"2007","remarks":""},{"money":"$76,703,481","country":"USA","day":"03","month":"06","year":"2007","remarks":""},{"money":"$74,943,105","country":"USA","day":"27","month":"05","year":"2007","remarks":""},{"money":"$71,379,695","country":"USA","day":"20","month":"05","year":"2007","remarks":""},{"money":"$60,007,779","country":"USA","day":"06","month":"05","year":"2007","remarks":""},{"money":"$52,109,598","country":"USA","day":"29","month":"04","year":"2007","remarks":""},{"money":"$40,205,142","country":"USA","day":"22","month":"04","year":"2007","remarks":""},{"money":"$23,025,000","country":"USA","day":"15","month":"04","year":"2007","remarks":""},{"money":"£1,670,870","country":"UK","day":"30","month":"09","year":"2007","remarks":""},{"money":"£1,385,642","country":"UK","day":"23","month":"09","year":"2007","remarks":""},{"money":"£728,145","country":"UK","day":"16","month":"09","year":"2007","remarks":""},{"money":"$117,760,134","country":"Worldwide","day":"02","month":"08","year":"2007","remarks":""},{"money":"BRL 1,242,863","country":"Brazil","day":"09","month":"09","year":"2007","remarks":""},{"money":"BRL 651,059","country":"Brazil","day":"02","month":"09","year":"2007","remarks":""}],"weekendGross":[{"money":"$80,167","country":"USA","day":"29","month":"07","year":"2007","remarks":"155 Screens"},{"money":"$115,691","country":"USA","day":"22","month":"07","year":"2007","remarks":"190 Screens"},{"money":"$302,010","country":"USA","day":"08","month":"07","year":"2007","remarks":"283 Screens"},{"money":"$199,674","country":"USA","day":"01","month":"07","year":"2007","remarks":"284 Screens"},{"money":"$110,706","country":"USA","day":"24","month":"06","year":"2007","remarks":"187 Screens"},{"money":"$251,249","country":"USA","day":"17","month":"06","year":"2007","remarks":"283 Screens"},{"money":"$523,504","country":"USA","day":"10","month":"06","year":"2007","remarks":"568 Screens"},{"money":"$1,112,533","country":"USA","day":"03","month":"06","year":"2007","remarks":"1,035 Screens"},{"money":"$2,433,028","country":"USA","day":"27","month":"05","year":"2007","remarks":"1,632 Screens"},{"money":"$3,731,349","country":"USA","day":"20","month":"05","year":"2007","remarks":"2,547 Screens"},{"money":"$5,844,363","country":"USA","day":"06","month":"05","year":"2007","remarks":"3,132 Screens"},{"money":"$9,023,835","country":"USA","day":"29","month":"04","year":"2007","remarks":"3,047 Screens"},{"money":"$13,010,778","country":"USA","day":"22","month":"04","year":"2007","remarks":"3,015 Screens"},{"money":"$23,025,000","country":"USA","day":"15","month":"04","year":"2007","remarks":"2,925 Screens"},{"money":"£100,190","country":"UK","day":"30","month":"09","year":"2007","remarks":"170 Screens"},{"money":"£338,232","country":"UK","day":"23","month":"09","year":"2007","remarks":"373 Screens"},{"money":"£728,145","country":"UK","day":"16","month":"09","year":"2007","remarks":"400 Screens"},{"money":"BRL 608,708","country":"Brazil","day":"02","month":"09","year":"2007","remarks":"140 Screens"},{"money":"BRL 361,066","country":"Brazil","day":"09","month":"08","year":"2007","remarks":"140 Screens"}],"admissions":[{"money":"144,616","country":"Brazil","day":"09","month":"09","year":"2007","remarks":""},{"money":"71,093","country":"Brazil","day":"02","month":"09","year":"2007","remarks":""},{"money":"165,220","country":"Germany","day":"30","month":"09","year":"2007","remarks":""},{"money":"86,929","country":"Germany","day":"23","month":"09","year":"2007","remarks":""},{"money":"145,353","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"03","year":"2006","remarks":null},null],"copyrightHolder":"Copyright © MMVII DreamWorks LLC (on print)"},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["DTS-ES","Dolby Digital EX","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Technicolor Digital Intermediates, Los Angeles (CA), USA (digital intermediate)"],"filmLength":["2,864.5 m","2,886 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm"]},"rating":"6.9","metascore":"62","filmingLocations":[{"location":"Benton Crossing, Mono County, California, USA"}],"rated":"PG-13","awards":[{"award":"ASCAP Film and Television Music Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"Geoff Zanelli","id":"nm0952944","role":null}]}]}]},{"award":"Dublin Film Critics Circle Awards 2007","titlesAwards":[{"titleAwardOutcome":"2nd place Breakthrough Award","categories":[{"category":"","names":[{"name":"Shia LaBeouf","id":"nm0479471","role":null},{"name":"Transformers","id":"tt0418279","role":null}]}]}]},{"award":"Empire Awards, UK 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Thriller","names":[]}]}]},{"award":"Golden Schmoes Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Breakthrough Performance of the Year","names":[{"name":"Shia LaBeouf","id":"nm0479471","role":null}]}]}]},{"award":"Kids' Choice Awards, Australia 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie Star","names":[{"name":"Shia LaBeouf","id":"nm0479471","role":null},{"name":"Transformers","id":"tt0418279","role":null}]}]}]},{"award":"MTV Movie Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Kiss","names":[{"name":"Shia LaBeouf","id":"nm0479471","role":null},{"name":"Sarah Roemer","id":"nm2105255","role":null}]}]}]},{"award":"People's Choice Awards, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Movie Drama","names":[]}]}]},{"award":"Teen Choice Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Choice Movie: Horror/Thriller","names":[]},{"category":"Choice Movie Actor: Horror/Thriller","names":[{"name":"Shia LaBeouf","id":"nm0479471","role":null}]},{"category":"Choice Movie: Breakout Male","names":[{"name":"Shia LaBeouf","id":"nm0479471","role":null},{"name":"Transformers","id":"tt0418279","role":null},{"name":"A Guide to Recognizing Your Saints","id":"tt0473488","role":null}]}]}]}],"votes":"192,784","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040938","name":"DreamWorks"},{"idCompany":"co0199880","name":"Cold Spring Pictures"},{"idCompany":"co0118469","name":"Montecito Picture Company, The"}],"keywords":{"keywords":["house arrest","neighbor","binoculars","watching someone","electronic tag","death","arrest","friend","teacher","serial killer","voyeur","spanish","car accident","spanish teacher","murder","teenager","police","video camera","hitchcockian","terror","madman","psychopath","bad guy","psycho","1 year later","twinkies tower","twinkies","itunes","apple macbook pro","apple macbook","reference to itunes","reference to xbox","playing a video game","ipod","xbox","xbox live","psp","xbox 360","fight","punishment","jealousy","peanut butter","burning a shirt","watching porn","missing woman","newspaper","surgical tool","dead deer","dead body","lawn mower","rabbit","longhorn cow skull","skull","rooftop","drinking","teenage boy","swimming","handcuffs","running","bicycle","reading","eating","scissors","lightning","wind","thunder","courtroom","policeman","watching tv","boy","telephone call","classroom","class","student","father son relationship","breaking and entering","reference to youtube","punched in the face","fictional city","barefoot","young love","camera phone","knife","gun","flirting","escape","deer","cellar","bikini","party","missing person","garden","garage","friendship","fishing","duct tape","computer","basement","swimming pool","mother son relationship","lawn mowing","voyeurism","ankle monitor","title spoken by character","toyota camry","lexus gs 300","lexus","ford mustang","one word title","car","woman","assault","boredom","ford","police car","suburb","murder of a police officer","kiss","blood splatter","rampage","killing spree","evil man","villain","psychopathic killer","homicidal maniac","maniac","human monster","slasher","coca cola","bmw x3","jaguar s type","jaguar car","playstation portable","red bull","hershey's syrup","hdtv","dog","love seeking","kidnapping","trial","duel","chocolate","shirt","bunk bed","obscene finger gesture","dent in car fender","laundry","dishwasher","investigation","listening to music","listening to a radio","dancing","dancer","bagel","blood","mover","moving van","stakeout","skeleton","drink","leg injury","writer","porch swing","earphones","book","food","reckless driving","overturned car","felony","felon","hardware store","storm","judge","high school student","father daughter relationship","mother daughter relationship","cousin cousin relationship","subtitled scene","flash forward","violence","teen angst","neck breaking","cell phone","snorricam","wet jeans","telescope","place name in title","carcass","woman in jeopardy","witness","tv host","tv news","suspense","stalking","stabbed in the chest","sociopath","severed head","scar","revenge","police detective","photography","panic","newlywed","long take","impalement","fishing boat","extortion","cocoon","chase","captive","broken leg","black comedy","betrayal","bathroom","stabbed in the leg","secret room","prank","parking garage","paranoia","garden shears","bmw","wig","stabbed to death","shovel","decomposed body","curtain","corpse","closet","butcher knife","broken glass","baseball bat","high school","death of father","ford crown victoria","mercedes benz e klasse","mercedes benz","volkswagen new beetle","ford f150 pickup truck","volvo 850","volvo car","jeep liberty the car","hyundai sonata","honda accord","honda element","ford expedition","chevrolet tahoe","chevrolet","neo noir"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:39:28"}}