{"data":{"movies":[{"title":"The Lather Effect","originalTitle":"","year":"2006","releaseDate":"20060626","directors":[{"name":"Sarah Kelly","id":"nm0446848"}],"writers":[{"name":"Sarah Kelly","id":"nm0446848"},{"name":"Tim Talbott","id":"nm0848003"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDY0MTUyOF5BMl5BanBnXkFtZTcwNDA2NDM3MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"On the eve of selling her mother's house, a thirty-something housewife wakes up to a hangover surrounded by her best friends from high school, who were used to partying in the house in an earlier era, and stirring memories of old teenage games and truths revealed about loves lost.","simplePlot":"On the eve of selling her mother's house, a thirty-something housewife wakes up to a hangover surrounded by her best friends from high school, who were used to partying in the house in an ... ","actors":[{"actorName":"Connie Britton","urlProfile":"http://www.imdb.com/name/nm0110168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODQ2NDIxN15BMl5BanBnXkFtZTcwNTY4ODM2MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1967","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Constance Elaine Womack","height":"5' 8\" (1.73 m)","bio":"Connie Britton began playing country music fading sensation Rayna Jaymes in Nashville (2012) after having wrapped production for the five season long Friday Night Lights (2006) alongside Kyle Chandler. She previously appeared in Universal's Friday Night Lights (2004) -the movie- directed by Peter Berg and also starring Billy Bob Thornton; and Edward Burns' independent feature Looking for Kitty (2004). Britton was born Constance Elaine Womack in Boston, Massachusetts, to Linda Jane (Cochran) and Edgar Allen Womack, Jr., a physicist and energy company executive. She is of Irish, German, and English descent. Britton received accolades for her starring roles in Edward Burns' acclaimed independent films The Brothers McMullen (1995) and No Looking Back (1998). In the former, she captivated moviegoers with her portrayal of \"Molly\", the luminous wife of a cheating husband. This popular low-budget film went on to win the Grand Jury Prize at the Sundance Film Festival. After nearly canceling her audition with director Edward Burns, this last meeting of the day turned into the role that would launch her career. Born in Boston, Massachusetts, Britton moved to Lynchburg, Virginia, at the age of seven with her family, including her fraternal twin sister. She went on to attend Dartmouth College, where she majored in Asian studies and spent a term in Beijing, China. Upon graduation, she moved to New York, where she spent two years at the Neighborhood Playhouse studying with Sanford Meisner, and an additional two years performing in regional theater and off-Broadway productions. She moved to Los Angeles after the success of The Brothers McMullen (1995). She starred in ABC's Lost at Home (2003) opposite Mitch Rouse and Gregory Hines. Her other television credits include The Fighting Fitzgeralds (2001) opposite Brian Dennehy, a recurring role in the highly-acclaimed drama The West Wing (1999) and a starring role in the award-winning comedy Spin City (1996) opposite Michael J. Fox. Additionally, Britton starred in the recent feature films The Next Big Thing (2001) and One Eyed King (2001). In her free time, Britton, who resides in both New York and Los Angeles, enjoys hiking, yoga, and doing volunteer work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODQ2NDIxN15BMl5BanBnXkFtZTcwNTY4ODM2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0110168","name":"Connie Britton","idIMDB":"nm0110168"},"actorId":"nm0110168","character":"Valinda","urlCharacter":"http://www.imdb.com/character/ch0134555","main":true},{"actorName":"Sarah Clarke","urlProfile":"http://www.imdb.com/name/nm1020124","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDA5ODAxNF5BMl5BanBnXkFtZTgwNTE5MTUzNDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1972","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Sarah Lively Clarke","height":"5' 4\" (1.63 m)","bio":"Actress Sarah Clarke was born and raised in Missouri, the middle child of Carolyn and Ernest Clarke, an engineer. She has an older and younger brother. She was educated at John Burroughs School in St. Louis, Missouri, and went on to Indiana University to study Fine Arts and Italian. During Clarke's senior year at university she studied in Bologna, Italy, and it was here she began an interest in acting. When she came back to the USA, Clarke found work as an architectural photographer. The story goes that she got free acting lessons at an arts center, in exchange for taking photos for them. Clarke moved to New York and continued studying acting with various companies, including Circle in the Square Theatre School. Clarke's screen debut came in a Volkswagen television commercial called \"Synchronicity\", which went on to win awards. She worked steadily in TV and film before earning her big break when she was cast as Nina Myers in the smash hit 24 (2001). It was while working on this that Clarke met her future husband, Xander Berkeley. Various roles have followed, notably as Renée, Bella Swan's mother in the hugely successful Twilight (2008) and its sequels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDA5ODAxNF5BMl5BanBnXkFtZTgwNTE5MTUzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1020124","name":"Sarah Clarke","nicknames":["Creathon"],"idIMDB":"nm1020124"},"actorId":"nm1020124","character":"Claire","urlCharacter":"http://www.imdb.com/character/ch0134556","main":true},{"actorName":"Tate Donovan","urlProfile":"http://www.imdb.com/name/nm0004883","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzUxMTMwM15BMl5BanBnXkFtZTcwNDQ1Mzc1MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1963","placeOfBirth":" Tenafly, New Jersey, USA","birthName":"Tate Buckley Donovan","height":"6' (1.83 m)","bio":"Tate Buckley Donovan began making television appearances while still in his teens, most often cast as angst-ridden high schoolers in such made-for-TV films such as Not My Kid (1985) and Nutcracker: Money, Madness & Murder (1987). Donovan was born to a large family in Tenafly, New Jersey, the son of Eileen Frances (McAllister) and John Timothy Donovan, a surgeon. He is of Irish descent. Donovan moved to Los Angeles to be closer to the television industry while he attended college at USC, where he also met several fellow actors who became longtime friends, such as Grant Heslov and George Clooney, with whom he still parties with to this day (he also had a fairly substantial part in their smash film, Good Night, and Good Luck. (2005). Although not quite as active as his friend Clooney in the romantic arena, confirmed bachelor Donovan has been engaged to both film star Sandra Bullock and television icon Jennifer Aniston, and has dated a diverse group of women such as socialite Plum Sikes (2000), stage actress Whitney Allen (2001) and television actress Lauren Graham, whom he met when they both appeared in the play \"Once in a Lifetime\" at the Williamstown Theater Festival in 2002. After graduating from college, Donovan gained prominent notice for his portrayal of the charismatic yet self-centered co-pilot in the ensemble period drama Memphis Belle (1990). Prior to that, Donovan had appeared as the cocky elder camper in SpaceCamp (1986) and as a recovering drug addict in Clean and Sober (1988). His first leading role was in the charming but minor Love Potion No. 9 (1992), costarring Bullock, to whom he became engaged (their relationship ended in 1994). He then appeared in several independent features as sullen, withdrawn types before following up with a role in the Disney family comedy, Holy Matrimony (1994). He returned to Disney for perhaps his highest-profile effort to date, the animated Hercules (1997), for which he provided the voice for the adult version of the title character. His small-screen work has included a Cable ACE-nominated turn in the HBO series Vietnam War Story II (1988) (V). He joined the parade of film stars who turned to sitcoms, heading the cast of Partners (1995) opposite Jon Cryer. When that failed to catch on, he joined with his \"Memphis Belle\" co-stars Eric Stoltz and Reed Diamond to play three brothers in a memorable episode of NBC's Homicide: Life on the Street (1993) and had a recurring role as a client and potential love interest for Calista Flockhart's titular lawyer Ally McBeal (1997). Switching networks, he had a recurring role as a love interest opposite his then-girlfriend Jennifer Aniston in NBC's Friends (1994) and donned clerical garb to play the priest son of a large Irish Catholic family in the short-lived NBC drama Trinity (1998). More recently he has appeared as a guest star in several shows such as The Guardian (2001), as well as Mister Sterling (2003) and in the new show The O.C. (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzUxMTMwM15BMl5BanBnXkFtZTcwNDQ1Mzc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004883","name":"Tate Donovan","idIMDB":"nm0004883"},"actorId":"nm0004883","character":"Will","urlCharacter":"http://www.imdb.com/character/ch0134557","main":true},{"actorName":"Peter Facinelli","urlProfile":"http://www.imdb.com/name/nm0004906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0ZDkwODctM2QxMi00ODJlLWI2ODMtYjc3MjFlZWFjYjY0L2ltYWdlXkEyXkFqcGdeQXVyNzEwNjQwMTY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1973","placeOfBirth":" Queens, New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Peter Facinelli was born in Queens, New York, the youngest child of Bruna (Reich) and Pierino Facinelli, a waiter. His parents are Italian immigrants, originally from Trentino, Northern Italy. He has three sisters. Peter was educated at St. Francis Preparatory School in Fresh Meadows, New York, and went on to attend St. John's University, but left after a year to follow his interest in acting at the Atlantic Theater Company Acting School, also in New York. There Facinelli was taught by such distinguished actors as Academy Award nominees William H. Macy and Felicity Huffman. He made his screen debut in 1995, appearing in Rebecca Miller's Angela (1995) and has worked consistently ever since. Notable projects include The Price of Love (1995), An Unfinished Affair (1996) (where he met his future wife, Jennie Garth), Touch Me (1997) and The Scorpion King (2002). Facinelli has also had re-occurring roles in such TV shows such as Fastlane (2002), Six Feet Under (2001), Damages (2007) and Nurse Jackie (2009). In 2008, he won the role of Dr. Carlisle Cullen in the wildly popular Twilight (2008) and its sequels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0ZDkwODctM2QxMi00ODJlLWI2ODMtYjc3MjFlZWFjYjY0L2ltYWdlXkEyXkFqcGdeQXVyNzEwNjQwMTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004906","name":"Peter Facinelli","idIMDB":"nm0004906"},"actorId":"nm0004906","character":"Danny","urlCharacter":"http://www.imdb.com/character/ch0134558","main":true},{"actorName":"David Herman","urlProfile":"http://www.imdb.com/name/nm0379114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQ2ODY5OV5BMl5BanBnXkFtZTYwMTQxOTgy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1967","placeOfBirth":" New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Comedian David Herman was born on February 20, 1967, in New York, New York. He graduated from LaGuardia High School for the Performing Arts in 1985. He landed a role as one of the eight original cast members on Fox's late night sketch comedy show MADtv (1995). After spending two full seasons on the show, he left, like most of the original cast. In 1997, he began doing voicework on the Fox animated sitcom King of the Hill (1997), where he met writer/director/actor Mike Judge. Judge was so impressed with Herman that he cast him in a supporting role as Michael Bolton in his critically acclaimed, cult classic 1999 comedy, 35 heures, c'est déjà trop (1999). Also in 1999, he began doing voices for the now-canceled Fox animated sitcom Futurama (1999). He currently resides in Los Angeles, California, where he still supplies voices for King of the Hill (1997) and has supporting roles in movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQ2ODY5OV5BMl5BanBnXkFtZTYwMTQxOTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0379114","name":"David Herman","idIMDB":"nm0379114"},"actorId":"nm0379114","character":"Corey","urlCharacter":"http://www.imdb.com/character/ch0134629","main":true},{"actorName":"Caitlin Keats","urlProfile":"http://www.imdb.com/name/nm1021721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzkzMDg3NF5BMl5BanBnXkFtZTYwMDk2NjMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1972","placeOfBirth":" New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"Caitlin Keats was born on September 26, 1972 in New York City, New York, USA. She is an actress, known for Kill Bill: Vol. 2 (2004), Kiss of the Damned (2012) and Close Range (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzkzMDg3NF5BMl5BanBnXkFtZTYwMDk2NjMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1021721","name":"Caitlin Keats","idIMDB":"nm1021721"},"actorId":"nm1021721","character":"Katrina","urlCharacter":"http://www.imdb.com/character/ch0134630","main":true},{"actorName":"William Mapother","urlProfile":"http://www.imdb.com/name/nm0544611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzkyMTgyOF5BMl5BanBnXkFtZTcwODI1MTkzNQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1965","placeOfBirth":" Louisville, Kentucky, USA","birthName":"William Reibert Mapother Jr.","height":"6' 1\" (1.85 m)","bio":"William Mapother was born on April 17, 1965 in Louisville, Kentucky, USA as William Reibert Mapother Jr. He graduated from the University of Notre Dame with a B.A. in English. He is the co-founder of the film finance marketplace Slated. He is known for his work on Lost (2004), In the Bedroom (2001) and Another Earth (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzkyMTgyOF5BMl5BanBnXkFtZTcwODI1MTkzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544611","name":"William Mapother","idIMDB":"nm0544611"},"actorId":"nm0544611","character":"Jack","urlCharacter":"http://www.imdb.com/character/ch0134631","main":true},{"actorName":"Ione Skye","urlProfile":"http://www.imdb.com/name/nm0001746","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTMyMzgxNV5BMl5BanBnXkFtZTgwNjMyOTc1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1970","placeOfBirth":" Hampstead, London, England, UK","birthName":"Ione Skye Leitch","height":"5' 6\" (1.68 m)","bio":"Ione Skye was born on September 4, 1970 in Hampstead, London, England as Ione Skye Leitch. She is an actress and writer, known for Say Anything... (1989), Four Rooms (1995) and Wayne's World (1992). She has been married to Ben Lee since December 29, 2008. They have one child. She was previously married to Adam Horovitz.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTMyMzgxNV5BMl5BanBnXkFtZTgwNjMyOTc1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001746","name":"Ione Skye","nicknames":["Peyote"],"idIMDB":"nm0001746"},"actorId":"nm0001746","character":"Zoey","urlCharacter":"http://www.imdb.com/character/ch0134632","main":true},{"actorName":"Eric Stoltz","urlProfile":"http://www.imdb.com/name/nm0000655","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Njc5MjQyOF5BMl5BanBnXkFtZTYwNzQzNzgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1961","placeOfBirth":" Whittier, California, USA","birthName":"Eric Cameron Stoltz","height":"5' 11\" (1.8 m)","bio":"Eric Cameron Stoltz is a theater-trained actor and producer who has starred in both independent and studio films. He was born on September 30, 1961 in Whittier, California, to Evelyn Vawter, a violinist and schoolteacher, and Jack Stoltz, an elementary school teacher. He has German, English, and Scottish ancestry. Eric was raised in both American Samoa and Santa Barbara, California, where by the age of fourteen, he was earning money by playing piano for the local musical theater productions, including \"Mame\" starring Anthony Edwards, whom he co-starred with as two of Jeff Spicoli's stoner friends in Fast Times at Ridgemont High (1982). The two became friends, and then college roommates when both attended the University of Southern California. Dropping out in his junior year, Eric joined a repertory company that did 10 plays at the Edinburgh Festival in Scotland. Moving to New York in 1981, he studied with Stella Adler and Peggy Feury, and soon appeared in his first film, Fast Times at Ridgemont High (1982). In the 1980s, he garnered attention (and a Golden Globe Nomination) starring as Rocky Dennis in Mask (1985), and in John Hughes' Some Kind of Wonderful (1987). In 1988, he made his Broadway debut in Great Performances: Our Town (1989), for which he was nominated for a Tony Award. In the 1990s, he went back and forth from stage to film, building up an eclectic resume that included studio films (Pulp Fiction (1994), independent films (Sundance Festival Winner The Waterdance (1992), and films that he himself produced (Mr. Jealousy (1997). He also continued to appear on the New York stage both on Broadway (Three Sisters, Two Shakespearean Actors) and off-Broadway (The Importance of Being Ernest, The Glass Menagerie). He continued to work in television as well, doing a recurring role as Helen Hunt's ex on Mad About You (1992), a year on Chicago Hope (1994), and in the television and cable movies Inside (1996) (directed by Arthur Penn), A Killer in the Family (1983) (with Robert Mitchum) and The Passion of Ayn Rand (1999) (with Helen Mirren). Eric Stoltz lives in New Mexico, and has been romantically linked to Ally Sheedy, Jennifer Jason Leigh, Lili Taylor, and Bridget Fonda,. Since 2002 he has concentrated mainly on directing, having done a television movie, several short films, several independent films, and television shows such as Grey's Anatomy (2005), Boston Legal (2004), Nashville (2012), and Glee (2009). In 2014 he became the producing director of the hit CBS show, Madam Secretary (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Njc5MjQyOF5BMl5BanBnXkFtZTYwNzQzNzgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000655","name":"Eric Stoltz","idIMDB":"nm0000655"},"actorId":"nm0000655","character":"Mickey","urlCharacter":"http://www.imdb.com/character/ch0134633","main":true},{"actorName":"Alex Irvine","urlProfile":"http://www.imdb.com/name/nm3040421","urlPhoto":"","biography":{"bio":"Alex Irvine is an actor, known for The Lather Effect (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3040421","name":"Alex Irvine","idIMDB":"nm3040421"},"actorId":"nm3040421","character":"Passed Out Top Gun Guy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Prough","urlProfile":"http://www.imdb.com/name/nm2989286","urlPhoto":"","biography":{"bio":"Steve Prough is an actor, known for The Lather Effect (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2989286","name":"Steve Prough","idIMDB":"nm2989286"},"actorId":"nm2989286","character":"Home Inspector / Passed Out Spicoli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adrienne Salick","urlProfile":"http://www.imdb.com/name/nm2989385","urlPhoto":"","biography":{"bio":"Adrienne Salick is an actress, known for The Lather Effect (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2989385","name":"Adrienne Salick","idIMDB":"nm2989385"},"actorId":"nm2989385","character":"Passed Out Pat Benetar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Heffernan","urlProfile":"http://www.imdb.com/name/nm0373571","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDY2NDI0NV5BMl5BanBnXkFtZTcwMDkyNDQ2OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1968","placeOfBirth":" West Haven, Connecticut, USA","height":"6' 1\" (1.85 m)","bio":"Kevin Heffernan was born on May 25, 1968 in West Haven, Connecticut, USA. He is an actor and writer, known for Super Troopers (2001), Beerfest (2006) and The Slammin' Salmon (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDY2NDI0NV5BMl5BanBnXkFtZTcwMDkyNDQ2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0373571","name":"Kevin Heffernan","idIMDB":"nm0373571"},"actorId":"nm0373571","character":"Pink Panty Dude","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Bishop","urlProfile":"http://www.imdb.com/name/nm0084114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxNjEyMjE4OF5BMl5BanBnXkFtZTcwMjk1NzMzMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1948","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Larry Bishop was born on November 30, 1948 in Philadelphia, Pennsylvania and grew up in New Jersey. He's the son of famous Rat Pack comic Joey Bishop. Larry attended high school in Beverly Hills, California. After graduation Bishop was briefly in an improvisational group whose other members included Rob Reiner, Albert Brooks and Richard Dreyfuss. Larry was hook-handed drummer Abraham in Wild in the Streets (1968). Bishop achieved his enduring cult popularity with his portrayals of scruffy bikers in The Savage Seven (1968), Angel Unchained (1970) and Chrome and Hot Leather (1971). Moreover, Larry did guest spots on such TV shows as The Dukes of Hazzard (1979), Barnaby Jones (1973), Laverne & Shirley (1976), Barney Miller (1974), Kung Fu (1972), Love, American Style (1969) and I Dream of Jeannie (1965). Although he appeared alongside fellow biker movie regular Adam Roarke in the dim-witted comedy How Come Nobody's on Our Side? (1975) and had a sizable supporting role in The Big Fix (1978), Bishop's acting career sadly ran out of gas in the early 80s. Larry bounced backed in the mid 90s by writing the script for the mobster black comedy _Underworld_. He also has a substantial part in this film. Bishop then wrote, directed, co-produced and co-starred in the equally offbeat and uproarious Mad Dog Time (1996). Larry popped up in a cameo as coarse, belligerent strip club owner Larry Gomez in Kill Bill: Vol. 2 (2004). Larry Bishop's most recent picture is Hell Ride (2008), an homage to 60s biker cinema that he not only wrote, directed, and co-produced, but stars in as well.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxNjEyMjE4OF5BMl5BanBnXkFtZTcwMjk1NzMzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0084114","name":"Larry Bishop","idIMDB":"nm0084114"},"actorId":"nm0084114","character":"Dom at the Door","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monica Keena","urlProfile":"http://www.imdb.com/name/nm0444621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODA2OTYwM15BMl5BanBnXkFtZTYwNTIzNDA4._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1979","placeOfBirth":" Brooklyn, New York, USA","birthName":"Monica C. Keena","height":"5' 1½\" (1.56 m)","bio":"Monica Keena was born in New Jersey on May 28, 1979, to Bill and Mary Keena and was little sister to Samantha, the Keenas' first daughter. Growing up, Monica shone in all things arts. Dance, singing, acting, and drawing. At 13, Keena enrolled in the prestigious LaGuardia school for acting and made it. At age 15, she had a small role in her first film, and that was followed by a series of TV movies, such as First Daughter (1999) and the A Promise Kept: The Oksana Baiul Story (1994). Monica starred in her first movie, Ripe (1996), at 16 and considers that her favorite role, as of now. In 1998, she premiered on the WB's Dawson's Creek (1998) as truth-telling \"Abby Morgan\" and later left the show when she \"got bored playing one character\". Today, Monica continues to make movies like Freddy vs. Jason (2003), Man of the House (2005), and Fifty Pills (2006). In her free time, she enjoys skating.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODA2OTYwM15BMl5BanBnXkFtZTYwNTIzNDA4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444621","name":"Monica Keena","nicknames":["Monikers"],"idIMDB":"nm0444621"},"actorId":"nm0444621","character":"Warm Leatherette Babe #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0485927","urlIMDB":"http://www.imdb.com/title/tt0485927","business":{"budget":{"money":"$1,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min) (TV) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.3","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Los Angeles Film Festival 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Filmmaker Award","categories":[{"category":"Best Narrative Feature","names":[{"name":"Sarah Kelly","id":"nm0446848","role":null}]}]}]}],"votes":"605","type":"Movie","companyCreditsSimple":[{"idCompany":"co0166435","name":"Lather Films"},{"idCompany":"co0166480","name":"Rachel Rothman Films"},{"idCompany":"co0015206","name":"Tycoon Entertainment"}],"keywords":{"keywords":["f rated","high school","love","california","rock music","ensemble film","drug humor","hot tub","the past","regret","reunion","nostalgia","party","triple f rated","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:00:44"}}