{"data":{"movies":[{"title":"Children of Wax","originalTitle":"","year":"2007","releaseDate":"20070717","directors":[{"name":"Ivan Nitchev","id":"nm0632970"}],"writers":[{"name":"Steven Cornwall","id":"nm4302796"},{"name":"Menahem Golan","id":"nm0324875"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2UzNWY2ZWUtYWQxYy00Yjk0LWE4NTctZDg3MWVkYmRlZmQzXkEyXkFqcGdeQXVyMTIxMDUyOTI@._V1.jpg","countries":["Bulgaria"],"languages":["English","Turkish","Bulgarian","Turkmen","Persian"],"genres":["Thriller"],"plot":"In Kreuzberg, Berlin, the Turkish gangs of immigrants and the skinheads are permanently fighting against each other and drug trafficking. Meanwhile, a serial-killer is killing children in the neighborhood. The Turkish Commissary Kemal is transferred from Wiesbaden to Kreuzberg, where he was born, and assigned to investigate the murderers. When the Turkish gang accuses the Neo Nazi gang of murdering the Turkish children, they schedule a war in a club. But the leader of the skinheads claims that his gang is not killing the children.","simplePlot":"Turkish and Neo Nazi gangs battle over territory and drug trafficking in Berlin, while a serial killer is on the loose. This action thriller brings several cultures together wanting to dispose of evil and stop the violence.","actors":[{"actorName":"Armand Assante","urlProfile":"http://www.imdb.com/name/nm0000800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU1OGFjNWUtMzkzZS00NWFjLWI4N2YtMmE1M2YwNjliZDEwL2ltYWdlXkEyXkFqcGdeQXVyNjAyMTAwMzk@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1949","placeOfBirth":" New York City, New York, USA","birthName":"Armand Anthony Assante Jr.","height":"5' 10\" (1.78 m)","bio":"Armand Assante is a coarsely handsome American actor who has successfully portrayed a wide range of intriguing characters from numerous ethnic backgrounds, both on screen and in the theater. Armand Anthony Assante, Jr. was born on October 4, 1949 in New York City, to Katherine (Healey), a music teacher and poet, and Armand Anthony Assante, Sr., an artist and painter. His father was of Italian descent and his mother was of Irish ancestry. Assante graduated from Cornwall Central High School and received his dramatic training at the American Academy of Dramatic Arts. His first screen role was as a wedding guest in the minor cult film The Lords of Flatbush (1974) starring Henry Winkler and Sylvester Stallone, then after guest appearances in several soap operas, he was back alongside Sylvester Stallone in Paradise Alley (1978). He played a wealthy Frenchman seducing army recruit Goldie Hawn in Private Benjamin (1980), portrayed literary \"hard boiled\" detective Mike Hammer in I, the Jury (1982) plus, he was excellent as the title role in Belizaire the Cajun (1986). Assante continued on into the 1990s with more strong performances as a drug baron in Q & A (1990) directed by Sidney Lumet, he made a sensational team with Antonio Banderas for the Cuban music spectacular Les mambo kings (1992), he was very impressive in the mob drama Hoffa (1992), and once more he was on screen with Sylvester Stallone in the film adaptation of the futuristic comic book Judge Dredd (1995), and Assante co-starred in the uneven Demi Moore film Striptease (1996). Assante's acting talents remain in strong demand, and he has continued to stay busy on screen with recent appearances in One Eyed King (2001), Citizen Verdict (2003) and Two for the Money (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU1OGFjNWUtMzkzZS00NWFjLWI4N2YtMmE1M2YwNjliZDEwL2ltYWdlXkEyXkFqcGdeQXVyNjAyMTAwMzk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000800","name":"Armand Assante","idIMDB":"nm0000800"},"actorId":"nm0000800","character":"Kemal","urlCharacter":"http://www.imdb.com/character/ch0080744","main":true},{"actorName":"Udo Kier","urlProfile":"http://www.imdb.com/name/nm0001424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1944","placeOfBirth":" Cologne, North Rhine-Westphalia, Germany","birthName":"Udo Kierspe","height":"5' 11\" (1.8 m)","bio":"Udo Kier was born October 14, 1944 in Cologne, Germany, during World War II. His entrance was just as dramatic as some of his roles. On the evening of his birth Udo's mother requested extra time with her new baby. The nurses had gathered all of the other babies and returned them to the nursery when the hospital was bombed. He and his mother were rescued from underneath the rubble. Udo didn't know much about his father. When Udo was 18 he moved to Britain in order to learn the English language. While there he took a few acting courses. He was eventually offered a role by director Michael Sarne as a gigolo in the film Road to Saint Tropez (1966). While the role was small, it was the beginning of his career in films. His first \"hit\" film was Mark of the Devil (1970) (Mark of the Devil). The film was rated \"V\" for violence and ticket buyers were offered vomit bags before the film started. It was banned in 31 countries but spawned two sequels (both without Kier). The film is notorious for its exploitation of sex and violence (the uncut version was remastered and re-released on video in 1997). Kier met director Paul Morrissey on an airplane trip. Morrissey offered him the lead role in the 3-D Flesh for Frankenstein (1973). It was this film, along with its sister film Blood for Dracula (1974), that made Udo a cult figure. Both Morrissey films are also known as Andy Warhol's Frankenstein and Dracula; however, Andy Warhol was not involved in the production or creation of the films. Both were rated X when released. One of Kier's most vivid memories from \"Flesh for Frankenstein\" was the infamous \"internal organ\" scene. Real animal organs were used that were left unrefrigerated on the set for several hours. Udo had to pull the organs out of a prop dummy with his bare hands and hold them up to his face. He has said he will never forget that smell. When this film was finished the cast and crew began immediately filming \"Blood for Dracula\". Udo remembers both of these films fondly and regards \"Dracula\" over \"Frankenstein\" as his favorite of the two (in 1996 both films were released by Criterion on DVD totally uncut). In the 1970s some of Kier's work included The Salzburg Connection (1972), The Story of O (1975) (The Story of O), Spermula (1976) and Trauma (1976) (House on Straw Hill). Much of his work has been dubbed with someone else's voice. In Suspiria (1977) there were some technical difficulties with the sound while his scene was shot. In the 1980s some of his work included Lulu (1980), The Strange Case of Dr. Jekyll and Miss Osbourne (1981) (The Blood of Dr Jekyll), The Island of the Bloody Plantation (1983) (Escape from Blood Plantation) and Seduction: The Cruel Woman (1985) (Seduction: The Cruel Woman). In the 1980s Kier did very little work outside of Europe. In the 1990s he had a lot more visibility in America and his breakthrough role was as Hans in My Own Private Idaho (1991) (the soundtrack includes the song that Udo performs in the film). Even Cowgirls Get the Blues (1993) reunited Kier with his friend Keanu Reeves yet again. Udo was cast as Pamela Anderson's sidekick in Barb Wire (1996) and played Ron Camp in Ace Ventura: Pet Detective (1994) opposite Jim Carrey. In the 1990s some of the films he was in included L'hôpital et ses fantômes (1994), For Love or Money (1993), Breaking the Waves (1996), The Adventures of Pinocchio (1996), Blade (1998) and Armageddon (1998). Over his 30-year career Udo has worked with several brilliant directors: Paul Morrissey, Charles Matton, Dario Argento, Gus Van Sant and Walerian Borowczyk. he continues to work often with Lars von Trier and is the godfather of Van Trier's child as well as a good friend. Von Trier is currently working on a film entitled Dimension which is a project that spans 30 years. Every year the cast and crew (including Udo) meet to shoot footage. The film will show the actors age 30 years without make-up or special effects. Approximately seen years of footage has already been shot. The premiere will take place in 2024! Kier's acting career ranges from art house films (Europa (1991)) to gore fests (Blackest Heart (1990) (German Chainsaw Massacre)) to television commercials. He says he loves horror films and wants to do more of them. He enjoys playing villains, as he feels it is more interesting because evil has no limits. Currently Udo lives in California and spends much of his time working in Europe, where he receives larger roles and more recognition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001424","name":"Udo Kier","idIMDB":"nm0001424"},"actorId":"nm0001424","character":"P.","urlCharacter":"http://www.imdb.com/character/ch0080745","main":true},{"actorName":"Daniel Bernhardt","urlProfile":"http://www.imdb.com/name/nm0076780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyNzAxMTQzOV5BMl5BanBnXkFtZTgwNjA1NzU2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1965","placeOfBirth":" Worblaufen BE, Switzerland","height":"6' 2½\" (1.89 m)","bio":"Daniel Bernhardt was born on the 31st August 1965 in Warblaufen, Bern in Switzerland. After finishing high school, he studied architectural design for four years and graduated in Bern. At the same time he opened a martial arts school with his brother. After completing his studies, Daniel moved to Paris and started to work as model. He worked for such designers as Montana, Mugler, Boss,Cerruti, Versace, Jaene Barnes and was published in the magazines Vogue, Elle, Max, Interview, Cosmopolitan and later, he established himself as a international Top Model. Later, Bernhardt moved to New York where he was cast to co-star with Jean-Claude Van Damme in Bruce Weber's TV spot \"Looking for Kicks\" for Gianni Versace. Producer Marc Di Salle who launched Van Damme's carrier with Bloodsport and Kickboxer, discovered Daniel Bernhardt and cast him to star in the sequel Bloodsport II (1996) which was his debut, opposite such actors as Pat Morita and James Hong, including comic relief big guy Donald Gibb and Taekwondo champion Philip Tan. The same year, a sequel Bloodsport III (1996) was released, again with Morita and James Hong, including John-Rhys Davies, and 9th degree black belt Taekwondo master Hee II Cho. From that point, Daniel began his career as action star on low budget films. His next films were Future War (1997), opposite Robert Z'Dar, Black Sea Raid (1997), True Vengance (1997), with Miles O'Keeffe and Beverly Johnson and Perfect Target (1997) with Robert Englund and Brian Thompson. After these films, Daniel's interest in acting became bigger and he started to study acting in Los Angeles under Harry Mastrogeorge. So, he continued with G2 (1998), again with James Hong, Bloodsport 4: The Dark Kumite (1999), the last one in the series, this time against Brazilian JuJutsu champion Stefanos Miltsakakis. He appeared on TV series \"Mortal Kombat: Conquest\", as Siro, and it was followed by Global Effect (2002) and a mega hit \"Matrix\" sequel Matrix Reloaded (2003), where he appeared as upgraded agent Johnson, where he had an awesome fighting scene with Laurence Fishburne on the large truck, he has worked with other great names in this film, such as Keanu Reeves, Carrie-Anne Moss, Hugo Weaving, Monica Bellucci, Lambert Willson and Jada Pinket Smith. He also lent his voice to agent Johnson in Enter The Matrix video game. The same year he filmed an action independent film, titled The Librarians (2003), where he co-starred with William Forsythe, Burt Reynolds, Erika Eleniak, Andrew Divoff, Amaury Nolasco, Christopher Atkins, Ed Lauter and Matthias Hues (whom he had a fight in the film). He worked on Children of Wax (2005), The Cutter (2005), opposite Chuck Norris and Joana Pacula, Ultimate Champion (2009) and Foodfight! (2009). Bernhardt is married to Lisa Stothard. He became a father to his first daughter, with Lisa, on May 15, 2003, the night after the premiere of The Matrix Reloaded (2003), and said in a TV interview that it is no question what has been more important in his life: The birth of his daughter changed his attitude towards responsibility and love forever.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyNzAxMTQzOV5BMl5BanBnXkFtZTgwNjA1NzU2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0076780","name":"Daniel Bernhardt","idIMDB":"nm0076780"},"actorId":"nm0076780","character":"Murat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hal Ozsan","urlProfile":"http://www.imdb.com/name/nm1230639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MjI0NTI0OV5BMl5BanBnXkFtZTgwOTUyNjk0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1976","placeOfBirth":" Cyprus","birthName":"Halil Ozsan","height":"5' 10\" (1.78 m)","bio":"Hal Ozsan (b. Halil Ozsan) was born in Northern Cyprus and raised in the United Kingdom in the East London suburb of Havering. He was educated at Brentwood School, Essex. His first major recognition came for his role as Todd Carr (the on the final two seasons (2001-2003) of Dawson's Creek (1998) Following \"The Creek\", Ozsan appeared regularly as the playboy fallen angel, Azazel in ABCF's Fallen (2007), and as Cassidy, the double-dealing long lost brother of Kyle Traeger in the final season of Kyle Xy (2009) and as Miles Canon in 90210 (2008) Other notable television performances include a leading role as Joey DiMarco in CBS' critically acclaimed television movie remake of Helter Skelter (2004). Ozsan's first film appearance came playing opposite Al Pacino in a supporting role in S1m0ne (2002). Between 2006-2008, Ozsan took a virtual hiatus from acting to serve full-time, as singer-songwriter for LA based Rock 'n' Roll band, Poets and Pornstars, Signed to an independent record label, they received national radio airplay, a North American tour and prestigious opening slots for Bon Jovi; the re-formed Alice in Chains; Muse and others. Songs written by Ozsan have been featured films and television shows (So You Think You Can Dance, Californication, Little Athens, Undead or Alive.) He currently lives in Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MjI0NTI0OV5BMl5BanBnXkFtZTgwOTUyNjk0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1230639","name":"Hal Ozsan","idIMDB":"nm1230639"},"actorId":"nm1230639","character":"Hakan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shirly Brener","urlProfile":"http://www.imdb.com/name/nm0107197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTIxNzYwMV5BMl5BanBnXkFtZTgwNzQzMzc1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1974","placeOfBirth":" Haifa, Israel","bio":"Shirly Brener was born on September 24, 1974 in Haifa, Israel. She is an actress and producer, known for Righteous Kill (2008), Employee of the Month (2006) and The Grey Zone (2001). She has been married to Bruce Rubenstein since 2004. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTIxNzYwMV5BMl5BanBnXkFtZTgwNzQzMzc1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107197","name":"Shirly Brener","idIMDB":"nm0107197"},"actorId":"nm0107197","character":"Greta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Naum Shopov","urlProfile":"http://www.imdb.com/name/nm2271871","urlPhoto":"","biography":{"bio":"Naum Shopov is an actor, known for The Russian Specialist (2005), Command Performance (2009) and Locusts: The 8th Plague (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2271871","name":"Naum Shopov","idIMDB":"nm2271871"},"actorId":"nm2271871","character":"Mustapha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ioan Lov","urlProfile":"http://www.imdb.com/name/nm1942030","urlPhoto":"","biography":{"height":"6' (1.83 m)","bio":"Ioan Lov is an actor, known for Conan the Barbarian (2011), The Fourth Kind (2009) and Wicked Little Things (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1942030","name":"Ioan Lov","idIMDB":"nm1942030"},"actorId":"nm1942030","character":"Tonino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Cunningham","urlProfile":"http://www.imdb.com/name/nm0192423","urlPhoto":"","biography":{"bio":"Peter Cunningham is known for his work on The Fighter (2010), No Retreat, No Surrender (1986) and La couleur du mensonge (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0192423","name":"Peter Cunningham","idIMDB":"nm0192423"},"actorId":"nm0192423","character":"Blind Joe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ulf Montanus","urlProfile":"http://www.imdb.com/name/nm2165531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzgyNzIzOV5BMl5BanBnXkFtZTcwNzYwNzUzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1961","placeOfBirth":" Düsseldorf, Germany","height":"6' 2½\" (1.89 m)","bio":"When Ulf Montanus was a boy of 14 years, he asked himself, whether he wants to become an actor or an politician later on by profession. After his school final examination and during his 2 years military service, he made his first steps in the acting business. He played a main part in a semi-professional theater group. Later on he got a training in acting, dancing, singing and so on. After that he got a training to become a radio-journalist and an auctioneer. He played in several industrial movies and played his first main part in a television movie at 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzgyNzIzOV5BMl5BanBnXkFtZTcwNzYwNzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2165531","name":"Ulf Montanus","idIMDB":"nm2165531"},"actorId":"nm2165531","character":"Manfred","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Konstantin Semergiev-Koko Taison","urlProfile":"http://www.imdb.com/name/nm2890003","urlPhoto":"","biography":{"bio":"Konstantin Semergiev-Koko Taison is an actor, known for Children of Wax (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2890003","name":"Konstantin Semergiev-Koko Taison","idIMDB":"nm2890003"},"actorId":"nm2890003","character":"Babbles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Assen Blatechki","urlProfile":"http://www.imdb.com/name/nm0087807","urlPhoto":"","biography":{"dateOfBirth":"22 March 1971","placeOfBirth":" Sofia, Bulgaria","height":"5' 10¾\" (1.8 m)","bio":"Assen Blatechky is a Bulgarian artist. He was born on March 22, 1971 in Sofia. An actor is fascinated by painting and sports. Practicing swimming, soccer, rowing, handball. In four consecutive years (from 1989 to 1992) is the champion of Bulgaria, Federation of Traditional Karate. All that remains in the background, because in 1992 applied for and was accepted at the Theatre Academy, where he studied acting at the class of Prof. Stefan Danailov. He graduated in 1996, but still a student attacked theater productions with roles in Measure for Measure, crazy love, Lazaritza, intruders. No lag and screen incarnations. Be photographed in a number of Bulgarian and foreign productions. Bulgarian audience knows from the movies Profits After the end of the world, Mila from Mars, Monkeys in Winter, and the TV series Sea salt. In 2007, the notes and participation in film Ludmil Todorov Seamstresses. Blatechki admired Vasil Mihaylov and argues that this is an actor with an inborn talent.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0087807","name":"Assen Blatechki","idIMDB":"nm0087807"},"actorId":"nm0087807","character":"Eichler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deyan Donkov","urlProfile":"http://www.imdb.com/name/nm1089542","urlPhoto":"","biography":{"bio":"Deyan Donkov was born and raised in Vidin, Bulgaria. He graduated National Academy for Theater and Film Arts - Bulgaria in 1997. He works in the theater but also acts in movies. His first role in movie was in Dunav most (1999) as a barman. He acts in many Bulgarian movies and makes very good characters. In 2002 he won \"Zlatna roza\" (Golden Rose) for his main role in \"Emigranti\" (Immigrants). He also acted in first Bulgarian criminal serial-film \"Pod prikritie\" 2011 (Undercover).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1089542","name":"Deyan Donkov","idIMDB":"nm1089542"},"actorId":"nm1089542","character":"Fritz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lydie Denier","urlProfile":"http://www.imdb.com/name/nm0219106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxODkxMzE1Ml5BMl5BanBnXkFtZTgwODQzODUxMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1964","placeOfBirth":" Saint-Nazaire, Loire-Atlantique, France","height":"5' 7\" (1.7 m)","bio":"Lydie Denier was raised in Martinique and attended school at the Lycee Shoelcher in Fort de France, Martinique. She became a model at 14 years old. Her big break through as an actress was when she played the role of Jane in the TV series Tarzán (1991) from 1991 till 1993. Her TV debut was on General Hospital (1963) back in 1989 playing the role of Yasmine Bernoudi. Lydie is also an accomplished artist. She paints acrylic on canvas and her work has been sold both in Europe and America. She is also a writer and a producer. Her film company is Pathway Pictures in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxODkxMzE1Ml5BMl5BanBnXkFtZTgwODQzODUxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0219106","name":"Lydie Denier","idIMDB":"nm0219106"},"actorId":"nm0219106","character":"Monica","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Baral","urlProfile":"http://www.imdb.com/name/nm0052912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3NDQ0NTcyMV5BMl5BanBnXkFtZTgwNTEyOTcxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1981","placeOfBirth":" Pforzheim, Baden-Württemberg, West Germany","height":"5' 10\" (1.78 m)","bio":"Michael Baral was born in 1981 in Pforzheim, Baden-Württemberg, West Germany. He is an actor and producer, known for A Hologram for the King (2016), SS-GB (2017) and Unknown (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3NDQ0NTcyMV5BMl5BanBnXkFtZTgwNTEyOTcxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0052912","name":"Michael Baral","idIMDB":"nm0052912"},"actorId":"nm0052912","character":"Hans","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valentin Ganev","urlProfile":"http://www.imdb.com/name/nm0304282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkzODk2MTgxOF5BMl5BanBnXkFtZTcwMTI4NjAxNQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1956","placeOfBirth":" Ruse, Bulgaria","height":"5' 9¾\" (1.77 m)","bio":"Valentin Ganev is a Bulgarian theatre and film actor and theatre director. Graduated the All Russian State Institute for Cinematography, Moscow (actor's classes of Sergey Bondarchuk). He is known for his work on Est-Ouest (1999), Icon (2005), Hushove (2006), The Abandoned (2006), The Prince & Me 3: A Royal Honeymoon (2008), The Way Back (2010), J'étais à Nüremberg (2010) etc. Quite active on stage. Since 1996 he is an actor at The National Theatre of Bulgaria.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkzODk2MTgxOF5BMl5BanBnXkFtZTcwMTI4NjAxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0304282","name":"Valentin Ganev","idIMDB":"nm0304282"},"actorId":"nm0304282","character":"Hainrich","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0479880","urlIMDB":"http://www.imdb.com/title/tt0479880","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"25","month":"04","year":"2005","remarks":null},{"money":null,"country":null,"day":"30","month":"05","year":"2005","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.2","filmingLocations":[{"location":"Sofia, Bulgaria"}],"awards":[],"votes":"323","type":"Movie","companyCreditsSimple":[{"idCompany":"co0134195","name":"Cinemascope"},{"idCompany":"co0024720","name":"Nu Image / Millennium Films"}],"keywords":{"keywords":["turkish","skinhead","drugs","cult film","berlin germany","female nudity","wax","waxfigure","shootout","police","murder","kidnapping","gang violence","fight","drug dealer","blind man","arson attack"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:48:19"}}