{"data":{"movies":[{"title":"Underworld: Evolution","originalTitle":"","year":"2006","releaseDate":"20060120","directors":[{"name":"Len Wiseman","id":"nm0936482"}],"writers":[{"name":"Danny McBride","id":"nm0564286"},{"name":"Len Wiseman","id":"nm0936482"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDY1OTQwOV5BMl5BanBnXkFtZTcwNjcxMTIzMw@@._V1.jpg","countries":["USA","Canada","Hungary"],"languages":["English","French","Hungarian"],"genres":["Action","Adventure","Fantasy","Sci-Fi","Thriller"],"plot":"Underworld: Evolution continues the saga of war between the vampires and the Lycans. The film goes back to the beginnings of the ancient feud between the two tribes as Selene, the beautiful vampire heroine, and Michael, the lycan hybrid, try to unlock the secrets of their bloodlines. This will be a modern tale of action, intrigue and forbidden love, which takes them into the battle to end all wars as the immortals must finally face their retribution.","simplePlot":"Picking up directly from the previous film, vampire warrior Selene and the half werewolf Michael hunt for clues to reveal the history of their races and the war between them.","actors":[{"actorName":"Kate Beckinsale","urlProfile":"http://www.imdb.com/name/nm0000295","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1973","placeOfBirth":" Finsbury Park, London, England, UK","birthName":"Kathrin Romany Beckinsale","height":"5' 7\" (1.7 m)","bio":"Kate Beckinsale was born on 26 July 1973 in England, and has resided in London for most of her life. Her mother is Judy Loe, who has appeared in a number of British dramas and sitcoms and continues to work as an actress, predominantly in British television productions. Her father was Richard Beckinsale, born in Nottingham, England. He starred in a number of popular British television comedies during the 1970s, most notably the series Rising Damp (1974), Porridge (1974) and The Lovers (1970). He passed away tragically early in 1979 at the age of 31. Kate attended the private school Godolphin and Latymer School in London for her grade and primary school education. In her teens she twice won the British bookseller W.H. Smith Young Writers' competition - once for three short stories and once for three poems. After a tumultuous adolescence (a bout of anorexia - cured - and a smoking habit which continues to this day), she gradually took up the profession of acting. Her major acting debut came in a TV film about World War II called One Against the Wind (1991), filmed in Luxembourg during the summer of 1991. It first aired on American television that December. Kate began attending Oxford University's New College in the fall of 1991, majoring in French and Russian literature. She had already decided that she wanted to act, but to broaden her horizons she chose university over drama school. While in her first year at Oxford, Kate received her big break in Kenneth Branagh's film adaptation of William Shakespeare's Much Ado About Nothing (1993). Kate worked in three other films while attending Oxford, beginning with a part in the medieval historical drama Royal Deceit (1994), cast as Ethel. The film was shot during the spring of 1993 on location in Denmark, and she filmed her supporting part during New College's Easter break. Later in the summer of that year she played the lead in the contemporary mystery drama Uncovered (1994). Before she went back to school, her third year at university was spent at Oxford's study-abroad program in Paris, France, immersing herself in the French language, Parisian culture and French cigarettes. A year away from the academic community and living on her own in the French capital caused her to re-evaluate the direction of her life. She faced a choice: continue with school or concentrate on her flourishing acting career. After much thought, she chose the acting career. In the spring of 1994 Kate left Oxford, after finishing three years of study. Kate appeared in the BBC/Thames Television satire Cold Comfort Farm (1995), filmed in London and East Sussex during late summer 1994 and which opened to spectacular reviews in the United States, grossing over $5 million during its American run. It was re-released to U.K. theaters in the spring of 1997. Acting on the stage consumed the first part of 1995; she toured in England with the Thelma Holts Theatre Company production of Anton Chekhov's \"The Seagull\". After turning down several mediocre scripts \"and going nearly berserk with boredom\", she waited seven months before another interesting role was offered to her. Her big movie of 1995 was the romance/horror movie Haunted (1995), starring opposite Aidan Quinn and John Gielgud, and filmed in West Sussex. In this film she wanted to play \"an object of desire\", unlike her past performances where her characters were much less the siren and more the worldly innocent. Kate's first film project of 1996 was the British ITV production of Jane Austen's novel Emma (1996). Her last film of 1996 was the comedy Shooting Fish (1997), filmed at Shepperton Studios in London during early fall. She played the part of Georgie, an altruistic con artist. She had a daughter, Lily, in 1999 with actor Michael Sheen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000295","name":"Kate Beckinsale","idIMDB":"nm0000295"},"actorId":"nm0000295","character":"Selene","urlCharacter":"http://www.imdb.com/character/ch0005058","main":true},{"actorName":"Scott Speedman","urlProfile":"http://www.imdb.com/name/nm0005454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTkwMzI3Ml5BMl5BanBnXkFtZTgwNjA5MDgxMjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1975","placeOfBirth":" London, England, UK","birthName":"Robert Scott Speedman","height":"5' 11\" (1.8 m)","bio":"Scott Speedman was born in London, England, to Scottish parents, Mary (Campbell), a primary school teacher, and Roy Speedman, a department store buyer. He grew up in Toronto, Canada. He was an aspiring swimmer and held a record amongst the best for distance freestyle, unfortunately, an accident put that career path on hold forever. He went to Earl Haig High School in Toronto and went to the University of Toronto in 1994 - 1996. On a dare, he went on a show called \"Speakers Corner\" and later went to audition for the role of Robin in Batman Forever (1995). When the part went to Chris O'Donnell, he managed to land an agent. Other movies he has done include Kitchen Party (1997) and Duets (2000) starring Gwyneth Paltrow. The show Felicity (1998) introduced Scott to the world and has formed quite a standing amongst fans. When the show ended in 2002, Scott's movie career took off with his breakthrough role in Underworld (2003) starring Kate Beckinsale and Bill Nighy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTkwMzI3Ml5BMl5BanBnXkFtZTgwNjA5MDgxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005454","name":"Scott Speedman","idIMDB":"nm0005454"},"actorId":"nm0005454","character":"Michael","urlCharacter":"http://www.imdb.com/character/ch0005063","main":true},{"actorName":"Tony Curran","urlProfile":"http://www.imdb.com/name/nm0192889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU2MTU1NDY5M15BMl5BanBnXkFtZTcwMDg3OTkyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1969","placeOfBirth":" Glasgow, Scotland, UK","height":"5' 11\" (1.8 m)","bio":"Tony Curran was born on December 13, 1969 in Glasgow, Scotland. He is known for his work on Gladiator (2000), Underworld: Evolution (2006) and The League of Extraordinary Gentlemen (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU2MTU1NDY5M15BMl5BanBnXkFtZTcwMDg3OTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0192889","name":"Tony Curran","idIMDB":"nm0192889"},"actorId":"nm0192889","character":"Marcus","urlCharacter":"http://www.imdb.com/character/ch0129173","main":true},{"actorName":"Derek Jacobi","urlProfile":"http://www.imdb.com/name/nm0001394","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMDkwNzI2OF5BMl5BanBnXkFtZTcwMDkxODgwMw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1938","placeOfBirth":" Leytonstone, London, England, UK","birthName":"Derek George Jacobi","height":"5' 10\" (1.78 m)","bio":"Preeminent British classical actor of the first post-Olivier generation, Derek Jacobi was knighted in 1994 for his services to the theatre, and, in fact, is only the second to enjoy the honor of holding TWO knighthoods, Danish and English (Olivier was the other). Modest and unassuming in nature, Jacobi's firm place in theatre history centers around his fearless display of his characters' more unappealing aspects, their great flaws, eccentricities and, more often than not, their primal torment. Jacobi was born in Leytonstone, London, England, the only child of Alfred George Jacobi, a department store manager, and Daisy Gertrude (Masters) Jacobi, a secretary. His paternal great-grandfather was German (from Hoxter, Germany). His interest in drama began while quite young. He made his debut at age six in the local library drama group production of \"The Prince and the Swineherd\" in which he appeared as both the title characters. In his teens he attended Leyton County High School and eventually joined the school's drama club (\"The Players of Leyton\"). Derek portrayed Hamlet at the English National Youth Theatre prior to receiving his high school diploma, and earned a scholarship to the University of Cambridge, where he initially studied history before focusing completely on the stage. A standout role as Edward II at Cambridge led to an invite by the Birmingham Repertory in 1960 following college graduation. He made an immediate impression wherein his Henry VIII (both in 1960) just happened to catch the interest of Olivier himself, who took him the talented actor under his wing. Derek became one of the eight founding members of Olivier's National Theatre Company and gradually rose in stature with performances in \"The Royal Hunt of the Sun,\" \"Othello\" (as Cassio) and in \"Hay Fever\", among others. He also made appearances at the Chichester Festival and the Old Vic. It was Olivier who provided Derek his film debut, recreating his stage role of Cassio in Olivier's acclaimed cinematic version of Othello (1965). Olivier subsequently cast Derek in his own filmed presentation of Chekhov's Three Sisters (1970). On TV Derek was in celebrated company playing Don John in Much Ado About Nothing (1967) alongside Maggie Smith and then-husband Robert Stephens; Derek had played the role earlier at the Chichester Festival in 1965. After eight eventful years at the National Theatre, which included such sterling roles as Touchstone in \"As You Like It\", Jacobi left the company in 1971 in order to attract other mediums. He continued his dominance on stage as Ivanov, Richard III, Pericles and Orestes (in \"Electra\"), but his huge breakthrough would occur on TV. Coming into his own with quality support work in Man of Straw (1972), The Strauss Family (1972) and especially the series The Pallisers (1974) in which he played the ineffectual Lord Fawn, Derek's magnificence was presented front and center in the epic BBC series I, Claudius (1976). His stammering, weak-minded Emperor Claudius was considered a work of genius and won, among other honors, the BAFTA award. Although he was accomplished in The Day of the Jackal (1973) and The Odessa File (1974), films would place a distant third throughout his career. Stage and TV, however, would continue to illustrate his classical icon status. Derek took his Hamlet on a successful world tour throughout England, Egypt, Sweden, Australia, Japan and China; in some of the afore-mentioned countries he was the first actor to perform the role in English. TV audiences relished his performances as Richard II (1978) and, of course Hamlet, Prince of Denmark (1980). After making his Broadway bow in \"The Suicide\" in 1980, Derek suffered from an alarming two-year spell of stage fright. He returned, however, and toured as part of the Royal Shakespeare Company (1982-1985) with award-winning results. During this period he collected Broadway's Tony Award for his Benedick in \"Much Ado about Nothing\"; earned the coveted Olivier, Drama League and Helen Hayes awards for his Cyrano de Bergerac; and earned equal acclaim for his Prospero in \"The Tempest\" and Peer Gynt. In 1986, he finally made his West End debut in \"Breaking the Code\" for which he won another Helen Hayes trophy; the play was then brought to Broadway. For the rest of the 80s and 90s, he laid stage claim to such historical figures as Lord Byron, Edmund Kean and Thomas Becket. On TV he found resounding success (and an Emmy nomination) as Adolf Hitler in Inside the Third Reich (1982), and finally took home the coveted Emmy opposite Anthony Hopkins in the WWII drama The Tenth Man (1988). He won a second Emmy in an unlikely fashion by spoofing his classical prowess on an episode of \"Frasier\" (his first guest performance on American TV), in which he played the unsubtle and resoundingly bad Shakespearean actor Jackson Hedley. Kenneth Branagh was greatly influenced by mentor Jacobi and their own association would include Branagh's films Henry V (1989), Dead Again (1991), and Hamlet (1996), the latter playing Claudius to Branagh's Great Dane. Derek also directed Branagh in the actor's Renaissance Theatre Company's production of \"Hamlet\". In the 1990s Derek returned to the Chichester Festival, this time as artistic director, and made a fine showing in the title role of Uncle Vanya (1996). More heralded work of late include profound portrayals of the anguished titular painter in Love Is the Devil: Study for a Portrait of Francis Bacon (1998), the role of Gracchus in the popular, Oscar-winning film Gladiator (2000), and sterling performances in such films as Two Men Went to War (2002), Bye Bye Blackbird (2005), The Riddle (2007), Endgame (2009), The King's Speech (2010), Jail Caesar (2012), and as the King in Cinderella (2015). Continuing to mesmerize on the stage, he has turned in superb performances in \"Uncle Vanya\" (2000), Friedrich Schiller's \"Don Carlos\" (2005), _A Voyage 'Round My Father (2006), \"Twelfth Night\" (2009) and the title role in \"King Lear\" (2010). On the British TV series front, he has commanded more recent attention in the title role of a crusading monk in the mystery series Mystery!: Cadfael (1994), as Lord Pirrie in Titanic: De sang et d'acier (2012), as Alan in Last Tango in Halifax (2012), and as Stuart Bixby in Vicious (2013). He and his life-time companion of three decades, Richard Clifford, filed as domestic partners in England in 2006. Clifford, a fine classical actor and producer in his own right, has shared movie time with Jacobi in Little Dorrit (1987), Henry V (1989), and the TV version of Cyrano de Bergerac (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMDkwNzI2OF5BMl5BanBnXkFtZTcwMDkxODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001394","name":"Derek Jacobi","idIMDB":"nm0001394"},"actorId":"nm0001394","character":"Corvinus","urlCharacter":"http://www.imdb.com/character/ch0129174","main":true},{"actorName":"Bill Nighy","urlProfile":"http://www.imdb.com/name/nm0631490","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NzYwMDAxM15BMl5BanBnXkFtZTgwMzg2ODg2MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1949","placeOfBirth":" Caterham, Surrey, England, UK","birthName":"William Francis Nighy","height":"6' 2\" (1.88 m)","bio":"Bill Nighy is an award-winning British character actor. He was born William Francis Nighy on December 12, 1949 in Caterham, Surrey, England, to Catherine Josephine (Whittaker), a psychiatric nurse from Glasgow, and Alfred Martin Nighy, who was English-born and managed a garage in Croydon. At school, he gained 'O'-levels in English Language and English Literature and enjoyed reading, particularly Ernest Hemingway. On leaving school he wanted to become a journalist but didn't have the required qualifications. He eventually went on to work as a messenger boy for the Field magazine. He stayed in Paris for a while because he wanted to write \"the great novel\", but he only managed to write the title. When he ran out of money, the British consul shipped him home. Nighy wound up training at Guildford School of Dance and Drama in London, and has since then worked consistently in film, television, and on stage. Nighy is perhaps best-known to international audiences for his memorable performance as washed-up pop singer Billy Mack in Love Actually (2003), which won him a BAFTA for best supporting actor. He has also made appearances in major franchises: he played vampire leader Viktor in Underworld (2003), Underworld: Evolution (2006) and Underworld: Rise of the Lycans (2009), did the performance capture and voice for Davy Jones in Pirates of the Caribbean: Dead Man's Chest (2006) and Pirates of the Caribbean: At World's End (2007), and made a brief appearance as Minister of Magic Rufus Scrimgeour in Harry Potter and the Deathly Hallows: Part 1 (2010). Nighy's recent film credits include roles in I Capture the Castle (2003), Shaun of the Dead (2004), The Hitchhiker's Guide to the Galaxy (2005), The Constant Gardener (2005), Notes on a Scandal (2006), Hot Fuzz (2007), Valkyrie (2008) and Pirate Radio (2009). He has also provided voice work for many animated movies in the past few years including Flushed Away (2006), Astro Boy (2009), Rango (2011) and Arthur Christmas (2011). With supporting turns in The Best Exotic Marigold Hotel (2011), La colère des Titans (2012) and Total Recall (2012), 2012 was a busy year for Nighy. There are no signs of slowing down either, as he next appeared in Jack the Giant Slayer (2013), About Time (2013), and I, Frankenstein (2014). Nighy has also had an active career on the small screen, beginning with Agony (1979), and his first widely-recognized role was in 1991 mini-series The Men's Room (1991). He has also made a habit of working on television with Harry Potter director David Yates: projects together include State of Play (2003), The Young Visiters (2003), The Girl in the Café (2005) and Page Eight (2011). Nighy won a Golden Globe for his performance in Gideon's Daughter (2005). Nighy actually began his career on the stage, and has earned acclaim for his work in numerous plays including \"The Vertical Hour,\" \"Pravda\". \"A Map of the World\", Tom Stoppard's Arcadia in 1993, and David Hare's Skylight. He received an Olivier Award nomination for Best Actor for his performance in 2001 play \"Blue/Orange.\" Bill's partner was actress Diana Quick (he asked her to marry him but she said: \"don't ask me again\"; he called her his wife because anything else would have been too difficult). They have a daughter, Mary Nighy, who is studying at university and contemplating an acting career. She has already begun to appear on TV dramas and radio programs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NzYwMDAxM15BMl5BanBnXkFtZTgwMzg2ODg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0631490","name":"Bill Nighy","idIMDB":"nm0631490"},"actorId":"nm0631490","character":"Viktor","urlCharacter":"http://www.imdb.com/character/ch0005059","main":true},{"actorName":"Steven Mackintosh","urlProfile":"http://www.imdb.com/name/nm0533599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNzkxODA5NV5BMl5BanBnXkFtZTcwMjI0MjY2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1967","placeOfBirth":" Cambridge, Cambridgeshire, England, UK","bio":"Steven Mackintosh was born on April 30, 1967 in Cambridge, Cambridgeshire, England. He is an actor, known for Lock, Stock and Two Smoking Barrels (1998), Underworld: Evolution (2006) and Underworld: Rise of the Lycans (2009). He has been married to Lisa Jacobs since 1989. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNzkxODA5NV5BMl5BanBnXkFtZTcwMjI0MjY2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533599","name":"Steven Mackintosh","idIMDB":"nm0533599"},"actorId":"nm0533599","character":"Tanis","urlCharacter":"http://www.imdb.com/character/ch0089117","main":true},{"actorName":"Shane Brolly","urlProfile":"http://www.imdb.com/name/nm0111274","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NTc4NDk3NzBeQTJeQWpwZ15BbWU4MDQxNDc1Mjcx._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1970","placeOfBirth":" Belfast, Northern Ireland, UK","birthName":"Shane R. Brolly","height":"6' 3\" (1.91 m)","bio":"Brolly was born in Belfast, Northern Ireland. The son of Clark Brolly, 1930-2014, a colorful salesman, and Rosemary Brolly, formally Griffin. The third of four siblings, he has two brothers: Clark and Michael 1968-2006, and one sister, Cathy. At age ten, Brolly's father got him into boxing, but his mother, whose brother was a former professional boxer and punched drunk, pulled him from the sport and suggested tennis, as there were courts nearby. Within three years Shane was ranked #3 in N. Ireland and #1 in doubles. At fourteen, a nasty fall out of a four story hotel window at the Portrush Tennis Tournament broke every bone in both his legs and sadly ended his hopes at a career as a tennis player. Growing up in Belfast in a mixed religion home was difficult for the young Brolly. His mother was a Catholic and father a Protestant, a big no-no as there was a sectarian war going on between Protestants and Catholics. Tired of the mindless violence, Shane left Belfast at age fifteen and moved to London with a friend. Broke and nowhere to stay, Shane's first accommodation was a soup kitchen in the West End. Unfortunately, he wasn't old enough to enter and had to sleep on the street the first night. The second night he lied and said he was sixteen and happily took a bunk in the flea infested flop house. After working odd jobs Shane saved enough to come to America; where once again, he had to sleep on the streets as his money only lasted one month at a motel. Park benches, construction sites and abandoned cars were Shane's first glimpse at the American dream, but it was better than the war zone he left behind. Using the Valley College for showering and cheap food Shane ran into some theater students who suggested he sign up for their class. Soon thereafter he was cast as an Irish cop in the play:\"Wait until Dark\" at the college's Horse Shoe Theater. Shane finally left the college and started working in construction, getting his contractor's license, which allowed him no time for the theater. After a five year hiatus he started back at acting, taking classes, studying the Meisner technique. In 1997 Shane landed his first role as Jack in the indie Movie \"Flypaper\" alongside Robert Loggia and Craig Sheffer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NTc4NDk3NzBeQTJeQWpwZ15BbWU4MDQxNDc1Mjcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0111274","name":"Shane Brolly","idIMDB":"nm0111274"},"actorId":"nm0111274","character":"Kraven","urlCharacter":"http://www.imdb.com/character/ch0027871","main":true},{"actorName":"Brian Steele","urlProfile":"http://www.imdb.com/name/nm0824498","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1OTMyOTU1MF5BMl5BanBnXkFtZTcwNjM2NjczNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 7\" (2.01 m)","bio":"As a child, Brian Steele knew only two speeds: full throttle and off. Perpetually hyperactive and adventurous, young Brian constantly pushed boundaries and tested the patience of his parents and teachers. But Brian's boundless energy and ambition had no direction, growing up in small-town Highland, Michigan. But soon a few local Detroit television programs changed all that. Brian discovered \"Monster Week,\" The Ghoul, and Sir Graves Ghastly - fright fest-y shows whose creature-characters he found fascinating. Towering over classmates at an astounding 6'7\", Brian again found himself turning to onscreen icons for inspiration; watching over-the-top physical comedy by the Three Stooges and Laurel and Hardy helped him embrace his physical awkwardness. But lacking an outlet for his energy or any focus on a career, Brian had no direction. In 1985 he moved to the Florida Keys, hoping to discover his dreams there. But after two years working odd jobs like bagging groceries, working at a go-cart track, and on the docks at the local marina, Brian decided to move one more time. With only $700, a duffel bag full of clothes and a 10-speed bicycle, he bought a one-way ticket to Los Angeles. Brian's gamble paid off. L.A. loved him. Universal Studios Theme Park took one look at the awkward 24 year-old and knew exactly what to do with him; they hired him to perform as Frankenstein's monster. When Universal was searching for a man to don the suit for the television version of Harry and the Henderson's, they didn't have to look far. Brian was thrilled to be surrounded with cast mates who helped nurture his talents as an actor. Always patient and supportive with him as he became familiar with his new job responsibilities, the cast of HATH gave Brian the confidence to cultivate his craft. 48 episodes as Harry led to a role on NBC's sci-fi series, Earth 2. Brian learned quickly about the niche in Hollywood for \"creature actors.\" Glued, painted, Velcro-ed, snapped and harnessed into bodysuits and masks, Brian made a name for himself as the man who could bring monsters to life. Since 1997, he has played characters tailor made to scare audiences. That year, The Relic opened the door for Brian to work with Hollywood heavy-hitters. He breathed life into villains in the Underworld Trilogy and Blade: Trinity. He's worked with acclaimed directors Guillermo Del Toro (both Hellboy films) and M. Night Shayamalan (Lady in the Water). He's taken on creatures alongside Adrian Brody, Christian Bale and Tom Sizemore. The menacing bear Anthony Hopkins and Alec Baldwin battle in The Edge? That's Brian Steele. After over 20 years breathing life into characters onscreen, keeping each character fresh and new is easier said than done. But Brian \"enjoy(s) the challenge.\" In 2009, he got the opportunity to portray the T-600, Terminator Salvation's latest incarnation of the Terminator.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1OTMyOTU1MF5BMl5BanBnXkFtZTcwNjM2NjczNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0824498","name":"Brian Steele","nicknames":["CreatureBoy"],"idIMDB":"nm0824498"},"actorId":"nm0824498","character":"William","urlCharacter":"http://www.imdb.com/character/ch0129177","main":true},{"actorName":"Zita Görög","urlProfile":"http://www.imdb.com/name/nm1310121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MTU2MzUxN15BMl5BanBnXkFtZTcwNTEyMTIzMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1979","placeOfBirth":" Nagybátony, Hungary","height":"5' 9\" (1.75 m)","bio":"Zita was born on September 27, 1979 in a small village, Pásztó, in Hungary. She attended a class specializing in drama at the Bródy Imre Grammar School in Budapest. It was during this time that she started photo shoots. Her first job was the Agnes B. fashion-show in Paris with Letitia Casta. As a model, she worked in 24 countries, including the U.S., Italy, and France, and participated in campaigns for Mont Blanc, Benetton, Vodafone, Nivea, Coppertone and Nissan. She was featured in magazines such as Playboy, Cosmopolitan, Elle, FHM, Anna, Brigitte, Glamour, and Vogue. She is the host of the weekly TV show Cinematrix, and Megasztár, the most viewed Hungarian talent show. She has ambitions to strengthen her movie career, and appeared in films like Den Of Lions, Café In The Sky, Underworld, and several Hungarian movies, like Pesti Harlem, Fej vagy írás and Az illúzió csapdájában.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MTU2MzUxN15BMl5BanBnXkFtZTcwNTEyMTIzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1310121","name":"Zita Görög","idIMDB":"nm1310121"},"actorId":"nm1310121","character":"Amelia","urlCharacter":"http://www.imdb.com/character/ch0005066","main":true},{"actorName":"Scott McElroy","urlProfile":"http://www.imdb.com/name/nm0568453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjdhOTY2ZTYtNWNmYy00ZTBlLWIyYzctYWNkNTdlMDExYWNiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"bio":"Scott McElroy is known for his work on Pulp Fiction (1994), Underworld (2003) and Batman Forever (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjdhOTY2ZTYtNWNmYy00ZTBlLWIyYzctYWNkNTdlMDExYWNiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0568453","name":"Scott McElroy","idIMDB":"nm0568453"},"actorId":"nm0568453","character":"Soren","urlCharacter":"http://www.imdb.com/character/ch0129169","main":true},{"actorName":"John Mann","urlProfile":"http://www.imdb.com/name/nm0542821","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGU3ZmEzMTgtMTRkMi00ZTQyLTg4NDQtMGNkZDQ0ZDQ5ZTY5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_UY44_CR20,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1962","placeOfBirth":" Calgary, Alberta, Canada","bio":"John Mann was born on September 18, 1962 in Calgary, Alberta, Canada. He is an actor, known for Underworld: Evolution (2006), The Chronicles of Riddick (2004) and The Tall Man (2012). He is married to Jill Daum. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGU3ZmEzMTgtMTRkMi00ZTQyLTg4NDQtMGNkZDQ0ZDQ5ZTY5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0542821","name":"John Mann","idIMDB":"nm0542821"},"actorId":"nm0542821","character":"Samuel","urlCharacter":"http://www.imdb.com/character/ch0129178","main":true},{"actorName":"Michael Sheen","urlProfile":"http://www.imdb.com/name/nm0790688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjI4NjY2M15BMl5BanBnXkFtZTcwOTgwNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1969","placeOfBirth":" Newport, Gwent, Wales, UK","birthName":"Michael Christopher Sheen","height":"5' 10\" (1.78 m)","bio":"Even though he had burned up the London stage for nearly a decade--and appeared in several films--Michael Sheen was not really \"discovered\" by American audiences until his critically-acclaimed turn as Wolfgang Amadeus Mozart in the 1999 Broadway revival of \"Amadeus\". Sheen was born in Newport, Wales, the only son of Irene (Thomas) and Meyrick Sheen. The charming, curly-haired actor grew up a middle-class boy in the working-class town of Port Talbot, Wales. Although his parents worked in personnel, they shared with their son a deep appreciation for acting, with Meyrick Sheen enjoying some success later in life as a Jack Nicholson impersonator. As a young man, Michael Sheen turned down the opportunity to pursue a possible professional football career, opting to follow in the footsteps of Daniel Day-Lewis and Patrick Stewart by attending the Bristol Old Vic Theatre School instead of university. In his second year, he won the coveted Laurence Olivier Bursary for consistently outstanding performances. While Sheen was still studying, he landed a pivotal role opposite stage legend Vanessa Redgrave in Martin Sherman's \"When She Danced\" (1991). He left school early to make his West End debut and has been dazzling audiences and critics with his intense and passionate performances ever since. Among his most memorable roles were \"Romeo\" in \"Romeo and Juliet\", the title role in Yukio Ninagawa's 1994 Royal Shakespeare Company's staging of \"Peer Gynt\" and \"Jimmy Porter\" both in a 1994 regional staging in a 1999 London revival of \"Look Back in Anger\". A critic from the London Times panned the multimedia production of \"Peer Gynt\", but praised Sheen for his ability to express \"astonishing vitality despite lifeless direction\". Referring to Sheen's performance in \"Look Back in Anger\", Susannah Clapp of The Observer hailed him for his \"luminous quality\" and ability to be goaded and fiery and defensive all at the same time. Sheen also managed to set critics' tongues wagging with a deft performance in the role of \"Henry V\", not a part traditionally given to a slight, boyish-looking actor. One writer raved: \"Sheen, volatile and responsive in an excellent performance, showed us the exhilaration of power and conquest\". In 1993, Sheen joined the troupe \"Cheek By Jowl\" and was nominated for the Ian Charleson Award for his performance in \"Don't Fool with Love\". That same year, he excelled as a mentally unstable man who becomes enmeshed in a kidnapping plot in Mystery!: Gallowglass (1993), a three-part BBC serial that aired in the USA on PBS' \"Mystery!\" in 1995. The actor nabbed his first feature film role in 1994, playing Dr. Jekyll's footman in Mary Reilly (1996) opposite John Malkovich and Julia Roberts, but that film did not make it into theaters until 1996, a year after Sheen's second movie, Othello (1995), was filmed and released. Perhaps his most memorable big screen role at that point, however, was \"Robert Ross\", Oscar Wilde's erstwhile lover, in the 1997 biopic Wilde (1997). He would also be seen in the Brit road film Heartlands (2002) opposite Mark Addy. Hot off the success of \"Amadeus\", Sheen began racking up even more notable big screen credits, starring opposite Heath Ledger, Wes Bentley and Kate Hudson in The Four Feathers (2002) and landing a major role opposite Kate Beckinsale in the action-horror blockbuster Underworld (2003), along with supporting turns in Bright Young Things (2003), Timeline (2003) and as British Prime Minister Tony Blair in director Stephen Frears' film The Queen (2006). Next, Sheen grabbed good notices played a divorce-embattled rock star, stealing scenes from Pierce Brosnan and Julianne Moore in the romantic comedy Une affaire de coeur (2004). Back on the stage, the actor earned raves for his performance as \"Caligula\" in London, for which he won the Evening Standard Award and Critics Circle Award for Best Actor, along with a nomination for the prestigious Laurence Olivier Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjI4NjY2M15BMl5BanBnXkFtZTcwOTgwNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0790688","name":"Michael Sheen","idIMDB":"nm0790688"},"actorId":"nm0790688","character":"Lucian","urlCharacter":"http://www.imdb.com/character/ch0005062","main":true},{"actorName":"Sophia Myles","urlProfile":"http://www.imdb.com/name/nm0617009","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMDI5MDY2Nl5BMl5BanBnXkFtZTcwNjA3ODYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1980","placeOfBirth":" London, England, UK","birthName":"Sophia Jane Myles","height":"5' 6\" (1.68 m)","bio":"Sophia Jane Myles was born on March 18, 1980 in Hammersmith, London, England. She has a younger brother, Oliver. Her parents are Jane and Peter Myles, who is a vicar, a priest in the Anglican Church who is in charge of a parish and receives a salary, but not the tithes of the church. Her mother works in publishing. Sophia lived in Notting Hill until she was 11 and attended Fox Primary School. Her father was later relocated to Isleworth, a suburb west of London. At 16, Sophia starred in a school production of \"Teachers\" written by Kevin Godber. Among those in attendance, Julian Fellowes, the Oscar winning writer of Gosford Park (2001). Sophia was subsequently cast in the BBC production of The Prince and the Pauper (1996). Julian Fellowes worked on the script. Two years after her role in The Prince and the Pauper (1996), Sophia was cast as young \"Saffron\" in the TV mini-series Big Women (1998). In 1999, after recently enrolling in Cambridge University to study philosophy, she got a small part in Mansfield Park (1999) playing \"Susan Price\". Before heading to school, Sophia was cast as \"Agnes Fleming\" in the TV series, Oliver Twist (1999). (The series also starred Keira Knightley). After which, she dropped out to pursue acting. After that, Sophia got a number of small parts in movies and television shows. Most notably, she was cast as Johnny Depp's wife in From Hell (2001). She also starred in The Life and Adventures of Nicholas Nickleby (2001), The Abduction Club (2002), Heartbeat (1992) and Foyle's War (2002); the latter 2 of which are TV series. In 2003, Sophia got a supporting role in Underworld (2003) opposite fellow British beauty, Kate Beckinsale (Pearl Harbor (2001)). Up next, Sophia was cast in the thriller Out of Bounds (2003)) as \"Louise Thompson\", about an awkward young girl in an English boarding school who falls in love with her American art teacher, who is married to the headmistress. Later that same year, Sophia was cast in the big screen version of the English cult hit, Thunderbirds (2004). Though the movie didn't perform as expected, she earned praise for her role as the iconic \"Lady Penelope\". Soon, Sophia began working on Art School Confidential (2006), directed by Terry Zwigoff (Ghost World (2001)) playing an American who is the muse of a student in art school. Afterwards, she returned to her television roots, starring in Colditz (2005) as \"Lizzie Carter\", who is the object of affection and desire for 2 brothers. She then appeared in Agatha Christie's Marple: Sleeping Murder (2006) as a young woman who discovers that, as a child, she witnessed a murder. Sophia was cast in Tristan + Isolde (2006). She played \"Isolde\", the fiery young Irish princess who is promised to an evil man, that she does not love. In 2006, she returned to television starring \"Madame de Pompadour\" in Doctor Who (2005) as the Doctor's love interest.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMDI5MDY2Nl5BMl5BanBnXkFtZTcwNjA3ODYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0617009","name":"Sophia Myles","nicknames":["Soph"],"idIMDB":"nm0617009"},"actorId":"nm0617009","character":"Erika","urlCharacter":"http://www.imdb.com/character/ch0005061","main":true},{"actorName":"Richard Cetrone","urlProfile":"http://www.imdb.com/name/nm0149150","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjEwMTYxMl5BMl5BanBnXkFtZTcwNzA2MDcyNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Richard Cetrone is known for his work on Batman v Superman: Dawn of Justice (2016), Watchmen (2009) and Captain America: Civil War (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjEwMTYxMl5BMl5BanBnXkFtZTcwNzA2MDcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0149150","name":"Richard Cetrone","idIMDB":"nm0149150"},"actorId":"nm0149150","character":"Pierce","urlCharacter":"http://www.imdb.com/character/ch0005068","main":true},{"actorName":"Mike Mukatis","urlProfile":"http://www.imdb.com/name/nm0611470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzM0NDIyMl5BMl5BanBnXkFtZTcwODQyOTgzMQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"bio":"Mike Mukatis is known for his work on 300 (2006), Star Trek (2009) and 24 (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzM0NDIyMl5BMl5BanBnXkFtZTcwODQyOTgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611470","name":"Mike Mukatis","idIMDB":"nm0611470"},"actorId":"nm0611470","character":"Taylor","urlCharacter":"http://www.imdb.com/character/ch0005070","main":true}],"seasons":[],"idIMDB":"tt0401855","urlIMDB":"http://www.imdb.com/title/tt0401855","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$26,857,181","country":"USA","day":"22","month":"01","year":"2006","remarks":"3,207 Screens"},{"money":"£1,146,779","country":"UK","day":"22","month":"01","year":"2006","remarks":"295 Screens"}],"gross":[{"money":"$62,318,875","country":"USA","day":"12","month":"03","year":"2006","remarks":""},{"money":"$62,036,168","country":"USA","day":"05","month":"03","year":"2006","remarks":""},{"money":"$61,425,277","country":"USA","day":"26","month":"02","year":"2006","remarks":""},{"money":"$60,329,183","country":"USA","day":"19","month":"02","year":"2006","remarks":""},{"money":"$57,354,686","country":"USA","day":"12","month":"02","year":"2006","remarks":""},{"money":"$52,950,739","country":"USA","day":"05","month":"02","year":"2006","remarks":""},{"money":"$44,607,264","country":"USA","day":"29","month":"01","year":"2006","remarks":""},{"money":"$26,857,181","country":"USA","day":"22","month":"01","year":"2006","remarks":""},{"money":"£2,875,957","country":"UK","day":"05","month":"02","year":"2006","remarks":""},{"money":"£2,287,246","country":"UK","day":"29","month":"01","year":"2006","remarks":""},{"money":"£1,146,779","country":"UK","day":"22","month":"01","year":"2006","remarks":""},{"money":"$111,340,801","country":"Worldwide","day":"12","month":"03","year":"2006","remarks":""}],"weekendGross":[{"money":"$153,777","country":"USA","day":"12","month":"03","year":"2006","remarks":"216 Screens"},{"money":"$356,523","country":"USA","day":"05","month":"03","year":"2006","remarks":"349 Screens"},{"money":"$713,787","country":"USA","day":"26","month":"02","year":"2006","remarks":"517 Screens"},{"money":"$1,772,957","country":"USA","day":"19","month":"02","year":"2006","remarks":"972 Screens"},{"money":"$2,608,793","country":"USA","day":"12","month":"02","year":"2006","remarks":"1,835 Screens"},{"money":"$5,302,601","country":"USA","day":"05","month":"02","year":"2006","remarks":"2,870 Screens"},{"money":"$11,404,172","country":"USA","day":"29","month":"01","year":"2006","remarks":"3,207 Screens"},{"money":"$26,857,181","country":"USA","day":"22","month":"01","year":"2006","remarks":"3,207 Screens"},{"money":"£268,064","country":"UK","day":"05","month":"02","year":"2006","remarks":"234 Screens"},{"money":"£597,717","country":"UK","day":"29","month":"01","year":"2006","remarks":"296 Screens"},{"money":"£1,146,779","country":"UK","day":"22","month":"01","year":"2006","remarks":"295 Screens"}],"admissions":[{"money":"485,524","country":"Brazil","day":"16","month":"04","year":"2006","remarks":""},{"money":"453,755","country":"Brazil","day":"09","month":"04","year":"2006","remarks":""},{"money":"402,423","country":"Brazil","day":"02","month":"04","year":"2006","remarks":""},{"money":"313,352","country":"Brazil","day":"26","month":"03","year":"2006","remarks":""},{"money":"144,566","country":"Brazil","day":"19","month":"03","year":"2006","remarks":""},{"money":"515,074","country":"Germany","day":"19","month":"03","year":"2006","remarks":""},{"money":"232,015","country":"Germany","day":"05","month":"03","year":"2006","remarks":""}],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[null,null],"copyrightHolder":"2005) Lakeshore Entertainment Group LLC"},"technical":{"runtime":["1 hr 46 min (106 min)","1 hr 42 min (102 min) (cut) (Philippines)"],"soundMix":["SDDS","Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Cooke S4 and Angenieux Optimo Lenses","Arriflex 435, Cooke S4 and Angenieux Optimo Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":["2,907 m (Portugal, 35 mm)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"6,8","metascore":"36","filmingLocations":[{"location":"Britannia Beach, British Columbia, Canada"}],"rated":"R","awards":[{"award":"Fangoria Chainsaw Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Relationship from Hell","names":[{"name":"Kate Beckinsale","id":"nm0000295","role":null},{"name":"Scott Speedman","id":"nm0005454","role":null}]},{"category":"Bloodiest Beatdown","names":[{"name":"Kate Beckinsale","id":"nm0000295","role":null},{"name":"Tony Curran","id":"nm0192889","role":null}]},{"category":"Looks That Kill (Best Makeup FX)","names":[]},{"category":"Dude You Don't Wanna Mess With (Best Hero)","names":[{"name":"Scott Speedman","id":"nm0005454","role":null}]},{"category":"Chick You Don't Wanna Mess With (Best Heroine)","names":[{"name":"Kate Beckinsale","id":"nm0000295","role":null}]}]}]},{"award":"Golden Schmoes Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won Golden Schmoes","categories":[{"category":"Best T&amp;A of the Year","names":[{"name":"Kate Beckinsale","id":"nm0000295","role":null}]}]}]},{"award":"MTV Movie Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Hero","names":[{"name":"Kate Beckinsale","id":"nm0000295","role":null}]}]}]},{"award":"Scream Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won Scream Award","categories":[{"category":"Scream Queen","names":[{"name":"Kate Beckinsale","id":"nm0000295","role":null}]}]}]}],"votes":"165 178","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010568","name":"Screen Gems"},{"idCompany":"co0005323","name":"Lakeshore Entertainment"}],"keywords":{"keywords":["vampire","death","werewolf","forbidden love","feud","evolution","battle","female warrior","female vampire","vampire versus vampire","female hero","cult film","female protagonist","human animal hybrid","male rear nudity","sex scene","female frontal nudity","blood splatter","breasts","female gunfighter","blood on camera lens","vampire versus werewolf","returning character killed off","urban gothic","lovers on the lam","second part","vampire human love","nocturnal","medieval times","goth","fictional war","suit of armor","extreme closeup","eurocopter dauphin","neck breaking","flashback","vampire driving a car","girl in bra and panties","black panties","black bra","black bra and panties","action heroine","latex","latex catsuit","sequel","tomb","threesome","sword","sword fight","stabbed in the neck","stabbed in the leg","stabbed in the head","stabbed in the hand","stabbed in the chest","stabbed in the arm","shot to death","shot through the mouth","shot multiple times","shot in the head","shot in the forehead","shot in the face","shot in the chest","shot in the back","severed head","regeneration","male nudity","machine gun","loss of brother","knife throwing","jaw ripped off","impalement","helicopter crash","head bitten off","hand through chest","gore","gash in the face","gas mask","female nudity","falling from height","explosive","exploding ship","dismemberment","decapitation","cut into pieces","crossbow","cover up","corpse","burnt face","blood","back from the dead","autopsy","helicopter","dark heroine","werewolf legend","transformation","rivalry","lycanthropy","immortality","gothic","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:41:33"}}