{"data":{"movies":[{"title":"Full Grown Men","originalTitle":"","year":"2006","releaseDate":"20060427","directors":[{"name":"David Munro","id":"nm1470996"}],"writers":[{"name":"Xandra Castleton","id":"nm1472140"},{"name":"David Munro","id":"nm1470996"}],"runtime":"78 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTg3MjIwN15BMl5BanBnXkFtZTcwMDMxMDU1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Alby Cutrera yearns for a time when life was carefree and action figures were twelve inches tall. When his wife insults him for being more of a playmate than a father to his young son, Alby heads for safety and tracks down his boyhood pal Elias whose memory of their younger days is considerably less rosy. They set out on a road trip to Diggityland, their favorite place as kids, but simpler times turn complicated as the two friends confront the land mines of their past. Journeying through the Oz of Central Florida, they encounter a cast of wounded roadside romantics - a disgruntled ex-theme park employee, a horny bartending clown, and a delusional mermaid - each one shedding light on the perils of not letting go. Full Grown Men is the bittersweet tale of a man who learns the hard way that the best years of his life may still lie ahead of him.","simplePlot":"A man stuck in the reveries of his youth tracks down the boyhood friend he once tormented, only to find that simpler times were more complicated than he thought.","actors":[{"actorName":"Matt McGrath","urlProfile":"http://www.imdb.com/name/nm0569847","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTM4NTMxN15BMl5BanBnXkFtZTcwMjczMTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1969","placeOfBirth":" New York City, New York, USA","bio":"A chameleon-like actor who effortlessly glides between light comedy (The Broken Hearts Club: A Romantic Comedy (2000)), musical theater (Broadway's \"Cabaret\") and drama (Boys Don't Cry (1999)), Matt McGrath was hilarious as the Italian detective in Stanley Tucci's The Impostors (1998) and memorable as the annoying but adorable boyfriend in The Broken Hearts Club: A Romantic Comedy (2000). He has performed regionally on stages across the country and hones his craft in independent film gems, excelling in ensemble pieces. On the small screen, he turned in a chilling portrayal of real-life convicted killer Chris Pritchard in the TV mini-series, Cruel Doubt (1992), opposite Blythe Danner and Gwyneth Paltrow. He filmed a role in Anthony Minghella's The Talented Mr. Ripley (1999), but unfortunately ended up on the cutting room floor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTM4NTMxN15BMl5BanBnXkFtZTcwMjczMTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569847","name":"Matt McGrath","idIMDB":"nm0569847"},"actorId":"nm0569847","character":"Alby Cutrera","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Judah Friedlander","urlProfile":"http://www.imdb.com/name/nm0295103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzNzkwODIzOV5BMl5BanBnXkFtZTgwNDIyMzM0MDI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1969","placeOfBirth":" Gaithersburg, Maryland, USA","height":"5' 9\" (1.75 m)","bio":"Judah Friedlander was born on March 16, 1969 in Gaithersburg, Maryland, USA. He is an actor, known for 30 Rock (2006), The Wrestler (2008) and Star Wars: The Force Awakens (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzNzkwODIzOV5BMl5BanBnXkFtZTgwNDIyMzM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0295103","name":"Judah Friedlander","idIMDB":"nm0295103"},"actorId":"nm0295103","character":"Elias Guber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Cumming","urlProfile":"http://www.imdb.com/name/nm0001086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjM0NDI5M15BMl5BanBnXkFtZTcwNDg1ODE0Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1965","placeOfBirth":" Aberfeldy, Perthshire, Scotland, UK","height":"5' 10\" (1.78 m)","bio":"Alan Cumming was born on January 27, 1965, in Aberfeldy, Scotland, to Mary (Darling), an insurance company secretary, and Alex Cumming. His family lived nearby in Dunkeld, where his father was a forester for Atholl Estate. The family (including his brother, Tom) moved to Fassfern near Fort William, before moving to the east coast of Scotland in 1969, where Alan's father took up the position of Head Forester of Panmure Estate; it was there that Alan grew up. He went to Monikie Primary School and Carnoustie High School, where he began appearing in plays, and soon after that began working with with the Carnoustie Theatre Club and Carnoustie Musical Society. In 1981 he left high school with 8 'O' Grades and 4 Highers, but because he was too young to enter any university or drama school he worked for just over a year as a sub-editor at D.C. Thomson Publishers in Dundee. There he worked on the launch of a new magazine, \"Tops\", and was also the \"Young Alan\" who answered readers' letters. In September 1982 he began a three-year course at the Royal Scottish Academy of Music and Drama in Glasgow. He graduated in 1985 with a B.A. (Dramatic Studies) and awards for verse speaking and direction. He also had formed a cabaret double act with fellow student Forbes Masson called Victor and Barry, which went on to become hugely successful with tours (including two Perrier Pick of the Fringe seasons in London and a month-long engagement at the Sydney Opera House as part of an Australian tour), records (\"Hear Victor and Barry and Faint\", \"Are We Too Loud?\") and many TV appearances throughout the UK. Before graduating Alan made his professional theater and film debuts in \"Macbeth\" at the Tron Theatre in Glasgow and in Gillies MacKinnon's \"Passing Glory\". After graduating, Alan worked extensively in Scottish theater and television, including a stint on the soap opera High Road (1980) before moving to London when \"Conquest of the South Pole\", a play by German playwright Manfred Karge, transferred from the Traverse Theatre in, Edinburgh to the the Royal Court in London, earning him his first Olivier award nomination for Most Promising Newcomer of 1988. Alan performed with the Royal Shakespeare Company and then the Royal National Theatre, where he starred in \"Accidental Death of an Anarchist\", which he also adapted with director Tim Supple. The production was nominated for Best revival at the 1991 Olivier awards and Alan won for Comedy Performance of the Year. Then his film career began with Ian Sellar's Prague (1992), in which he starred with Sandrine Bonnaire and Bruno Ganz. The film premiered at the 1992 Cannes film festival and went on to win him Best Actor award at the Atlantic Film Festival and a Scottish BAFTA Best Actor nomination. In the same year he made two films for the BBC - Screen Two: The Last Romantics (1992) and Bernard and the Genie (1991), the latter winning him the Top Television Newcomer award at 1992 British Comedy Awards. In the 1992 Olivier awards he was also nominated for Comedy Performance of the Year for \"La Bete\". In 1993 he played Hamlet for the English Touring Theare to great critical acclaim (\"An actor knocking on the door of greatness\" - Daily Mail; ranked first and second--with his performance in \"Cabaret\"--in the Daily Telegraph's performances of the year) and then immediately went on to play the Emcee in Sam Mendes' revival of \"Cabaret\" at the same venue (London's Donmar Warehouse). He received a 1994 Olivier award nomination for Best Actor in a Musical for \"Cabaret\", and for Hamlet he received the 1994 TMA Best Actor award and a Shakespeare Globe award nomination. In 1994 he made his first Hollywood film, Le cercle des amies (1995), and his performance as the oleaginous Sean Walsh along with those in two films released in quick succession (Emma (1996) and GoldenEye (1995)) brought him to the attention of American producers, and he appeared in several Hollywood films, such as Romy and Michele's High School Reunion (1997) and Buddy (1997). He returned to the UK in 1997 to work with Stanley Kubrick and the Spice Girls before returning stateside in 1998 to reprise his role in \"Cabaret\" on Broadway. The show and his portrayal were a sensation, and he received the Tony, Drama Desk, Outer Critics' Circle, Theatre World, FANY, New York Press and New York Public Advocate's awards for his performance. Since then he has alternated between theater and films, and also between smaller independent films and more mainstream fare. His theater work includes 2001's \"Design for Living\" on Broadway and the hugely successful off-Broadway \"Elle\" by Jean Genet, which he adapted and played the lead in 2002. His films have included Julie Taymor's Titus (1999), Urbania (2000), the \"Spy Kids\" trilogy, Josie et les Pussycats (2001), X-Men 2 (2003), Nicholas Nickleby (2002), Son of the Mask (2005) and the Showtime movie musical Reefer Madness: The Movie Musical (2005). He wrote, directed, produced and acted in The Anniversary Party (2001) with Jennifer Jason Leigh, which premiered at the Cannes Film festival in 2002 and went on to win a National Board of Review award and two Independent Spirit award nominations. More recently he has produced the documentary Show People (2004) and the films Sweet Land (2005) and Full Grown Men (2006) (and appears in both) and acted in Gray Matters (2006) opposite Heather Graham and Bam Bam and Celeste (2005) opposite Margaret Cho. In 2006, he returned to Broadway as Macheath in \"The Threepenny Opera\". He has also found the time to write a novel, \"Tommy's Tale\", in 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjM0NDI5M15BMl5BanBnXkFtZTcwNDg1ODE0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001086","name":"Alan Cumming","idIMDB":"nm0001086"},"actorId":"nm0001086","character":"The Hitchhiker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Debbie Harry","urlProfile":"http://www.imdb.com/name/nm0001323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzc5MjIyNV5BMl5BanBnXkFtZTcwMjYyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1945","placeOfBirth":" Miami, Florida, USA","birthName":"Angela Tremble","height":"5' 3\" (1.6 m)","bio":"Deborah Harry was born Angela Tremble on July 1, 1945 in Miami, Florida. At three months, she was adopted by Catherine (Peters) and Richard Smith Harry, and was raised in Hawthorne, New Jersey. In the 1960s, she worked as a Playboy Bunny and hung out at Max's Kansas City, a famous Warhol-inhabited nightspot. Her professional singing career started in 1968 with a folk band called The Wind in the Willows. She sang backup on their first (and only) album. The band broke up shortly after failing to achieve commercial success or critical acclaim. In 1973, she met Chris Stein, who became her longtime boyfriend. They created Blondie in 1974 after they both were in the Stilletoes, a theatrical \"girl group\" band. Blondie struggled for a few years, then went on to be one of the most successful bands of the late 1970s and early 1980s, but the group broke up in 1982. Harry has released five solo albums, acted in several movies and television series and a few commercials (Gloria Vanderbilt Jeans, Sara Lee, Revlon). She has done many benefit shows in support of AIDS charities, a Broadway show (\"Teaneck Tanzi\"), poetry readings, and been one of the most notorious characters in the New York downtown scene. As of 1995, she was doing shows in the United States and Europe with the Jazz Passengers and Elvis Costello, filming two new movies (Heavy (1995) with Liv Tyler and Evan Dando and Drop Dead Rock (1996) with Adam Ant) and topping the dance charts with two newly remixed Blondie singles (\"Rapture\" and \"Atomic\"). Several Blondie tribute albums have been released and a Blondie remix album titled \"Remixed, Remade, Remodeled\" came out in 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzc5MjIyNV5BMl5BanBnXkFtZTcwMjYyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001323","name":"Debbie Harry","idIMDB":"nm0001323"},"actorId":"nm0001323","character":"Beauty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Sedaris","urlProfile":"http://www.imdb.com/name/nm0781238","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyNDE5NDg2OV5BMl5BanBnXkFtZTcwMDc0NDU5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1961","placeOfBirth":" Endicott, New York, USA","birthName":"Amy Louise Sedaris","height":"5' 1½\" (1.56 m)","bio":"Amy Sedaris was born on March 29, 1961 in Endicott, New York, USA as Amy Louise Sedaris. She is an actress and writer, known for Puss in Boots (2011), BoJack Horseman (2014) and Strangers with Candy (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyNDE5NDg2OV5BMl5BanBnXkFtZTcwMDc0NDU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781238","name":"Amy Sedaris","idIMDB":"nm0781238"},"actorId":"nm0781238","character":"Trina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katie Kreisler","urlProfile":"http://www.imdb.com/name/nm1652316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDkzMDAxNF5BMl5BanBnXkFtZTcwNTM5MTgzNw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"bio":"Katie Kreisler is an actress, known for Approaching Union Square (2006), Melinda and Melinda (2004) and Heights (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDkzMDAxNF5BMl5BanBnXkFtZTcwNTM5MTgzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1652316","name":"Katie Kreisler","idIMDB":"nm1652316"},"actorId":"nm1652316","character":"Suzanne Cutrera","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joie Lee","urlProfile":"http://www.imdb.com/name/nm0497578","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTk4MTUzNl5BMl5BanBnXkFtZTcwNDg4Mjg2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1962","placeOfBirth":" Brooklyn, New York City, New York, USA","bio":"Joie Lee was born on June 22, 1962 in Brooklyn, New York City, New York, USA. She is an actress and writer, known for Coffee and Cigarettes (2003), Crooklyn (1994) and Do the Right Thing (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTk4MTUzNl5BMl5BanBnXkFtZTcwNDg4Mjg2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0497578","name":"Joie Lee","idIMDB":"nm0497578"},"actorId":"nm0497578","character":"Annie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Grayson","urlProfile":"http://www.imdb.com/name/nm0337106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDM5NjM3NF5BMl5BanBnXkFtZTcwMDg5MjgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1935","placeOfBirth":" USA","bio":"Jerry Grayson was born on December 9, 1935 in the USA. He was an actor, known for Inside Llewyn Davis (2013), Striptease (1996) and Jugez-moi coupable (2006). He died on March 5, 2013 in New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDM5NjM3NF5BMl5BanBnXkFtZTcwMDg5MjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0337106","name":"Jerry Grayson","idIMDB":"nm0337106"},"actorId":"nm0337106","character":"Mr. Tinsman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benjamin Karpf","urlProfile":"http://www.imdb.com/name/nm2022970","urlPhoto":"","biography":{"bio":"Benjamin Karpf is an actor, known for Full Grown Men (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2022970","name":"Benjamin Karpf","idIMDB":"nm2022970"},"actorId":"nm2022970","character":"Rollie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Fyfe","urlProfile":"http://www.imdb.com/name/nm0299474","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Nzk2MjEzMV5BMl5BanBnXkFtZTgwNzgwNDIyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"birthName":"James Michael Fyfe","bio":"Jim Fyfe was born as James Michael Fyfe. He is an actor and writer, known for Fantômes contre fantômes (1996), Moonlight Mile (2002) and Earth to Kids: A Guide to Products for a Healthy Planet (1990). He was previously married to Leslie Klein.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0Nzk2MjEzMV5BMl5BanBnXkFtZTgwNzgwNDIyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0299474","name":"Jim Fyfe","idIMDB":"nm0299474"},"actorId":"nm0299474","character":"Night Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Ilku","urlProfile":"http://www.imdb.com/name/nm0407756","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODAxODg0MF5BMl5BanBnXkFtZTcwOTA4MjE1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1960","placeOfBirth":" Detroit, Michigan, USA","bio":"David Ilku first appeared in various performances in New York City night clubs. Sharing the stage with the likes of The Beastie Boys and Madonna, he soon got noticed. David has worked in theater projects with the New York Theater Workshop, Drama Dept., and the Culture Project, among others. His film credits include Full Grown Men (2006) (which he co-produced), Risk (1988), Blue Steel (1990), Godass (2000), Night Journey (1996) and Liquid Sky (1982). He also co-wrote and performed with Jennifer Tilly in the short film \"Salvation for Giorgio Armani (1984)\". His TV credits include Spin City (1996), The Cosby Show (1984) and Comedy Central's Premium Blend (1997). David writes and performs his highly acclaimed brand of comedy around the country and the world and is one-third of the comedy trio Unitard and one-half of the comedy duo The Duelling Bankheads. He is also writing and recording music and was an Island Records recording artist in the band, World at a Glance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODAxODg0MF5BMl5BanBnXkFtZTcwOTA4MjE1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0407756","name":"David Ilku","idIMDB":"nm0407756"},"actorId":"nm0407756","character":"Pool Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zully Montero","urlProfile":"http://www.imdb.com/name/nm0599493","urlPhoto":"","biography":{"bio":"Zully Montero was born in Cuba. She is an actress, known for El Rostro de Analía (2008), Cape Fear (1991) and El Super (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0599493","name":"Zully Montero","idIMDB":"nm0599493"},"actorId":"nm0599493","character":"Teya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Donald Badalamenti II","urlProfile":"http://www.imdb.com/name/nm0045924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmI1NmE3NDUtNjc3Yy00YmZlLTliZDgtMjBjMDc4MTkwNzcxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1973","placeOfBirth":" Sarasota, Florida, USA","height":"4' 5\" (1.35 m)","bio":"Born Peter Donald Badalamenti II, in Sarasota Florida, on December 11, 1973. Peter studied acting under the direction of Kathy Laughlin for several years. In 2000 Peter's first notable acting role, Was Fionn MacCumhail in Cremaster 3 (2002). and then Bad Boys II (2003). After a few indie films Peter starred in Dr. Moreau's House of Pain (2004) Then Peter scored big when he found treasure in, Pirates of the Caribbean: Dead Man's Chest (2006) and Pirates of the Caribbean: At World's End (2007), He played Penrod on Davy Jones's, Flying Dutchman Crew. The Flying Dutchman crew helped to win the Oscar for, Best Achievement in Visual Effects. Then Peter was asked to share the starring role with Brad Pitt, in The Curious Case of Benjamin Button (2008), Benjamin 1929-31. The landmark role was accomplished with cutting edge VFX that also won the Oscar For, Best Achievement in Visual Effects. In 2011 Peter made his television appearance in 30 Rock (2006)_Respawn_ The Sitter. Peter continues to push the boundaries of his abilities with his performance in River of Fundament (2014). In 2015 Peter had the honor of shairing the role of Master Splinter in Teenage Mutant Ninja Turtles: Out of the Shadows (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmI1NmE3NDUtNjc3Yy00YmZlLTliZDgtMjBjMDc4MTkwNzcxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045924","name":"Peter Donald Badalamenti II","nicknames":["Donny","The Don"],"idIMDB":"nm0045924"},"actorId":"nm0045924","character":"Bert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lindsay Ryan","urlProfile":"http://www.imdb.com/name/nm3435288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDUxOTg1MF5BMl5BanBnXkFtZTgwMTYyNzgwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Lindsay Ryan is an actress and producer, known for Something Borrowed (2011), Sizemic (2017) and Full Grown Men (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDUxOTg1MF5BMl5BanBnXkFtZTgwMTYyNzgwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3435288","name":"Lindsay Ryan","idIMDB":"nm3435288"},"actorId":"nm3435288","character":"Truck Stop Cashier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Echavarria","urlProfile":"http://www.imdb.com/name/nm2145422","urlPhoto":"","biography":{"bio":"Louis Echavarria is an actor, known for Full Grown Men (2006) and Bachelor Party 2: The Last Temptation (2008). He has been married to Erika Watkins since November 25, 2006.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2145422","name":"Louis Echavarria","idIMDB":"nm2145422"},"actorId":"nm2145422","character":"Truck Stop Father","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0407814","urlIMDB":"http://www.imdb.com/title/tt0407814","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,757","country":"USA","day":"29","month":"06","year":"2008","remarks":"1 Screen"}],"gross":[{"money":"$13,716","country":"USA","day":"03","month":"08","year":"2008","remarks":""},{"money":"$9,073","country":"USA","day":"27","month":"07","year":"2008","remarks":""},{"money":"$3,757","country":"USA","day":"29","month":"06","year":"2008","remarks":""}],"weekendGross":[{"money":"$3,766","country":"USA","day":"03","month":"08","year":"2008","remarks":"2 Screens"},{"money":"$4,178","country":"USA","day":"27","month":"07","year":"2008","remarks":"1 Screen"},{"money":"$3,757","country":"USA","day":"29","month":"06","year":"2008","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 18 min (78 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["Continental Film Laboratories, Miami, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.3","metascore":"47","filmingLocations":[{"location":"Dania, Florida, USA"}],"awards":[],"votes":"304","type":"Movie","companyCreditsSimple":[{"idCompany":"co0112958","name":"Grottofilms"}],"keywords":{"keywords":["mermaid","amusement park","three word title","road movie","toy","spaceman toy","marital discord","man child","innocence"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:40:41"}}