{"data":{"movies":[{"title":"The Equalizer","originalTitle":"","year":"2014","releaseDate":"20140926","directors":[{"name":"Antoine Fuqua","id":"nm0298807"}],"writers":[{"name":"Richard Wenk","id":"nm0921013"},{"name":"Michael Sloan","id":"nm0805994"}],"runtime":"132 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MzE2NTk0NF5BMl5BanBnXkFtZTgwOTM3NTk1MjE@._V1.jpg","countries":["USA"],"languages":["English","Russian","Spanish"],"genres":["Action","Crime","Thriller"],"plot":"In The Equalizer, Denzel Washington plays McCall, a man who believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when McCall meets Teri (Chloë Grace Moretz), a young girl under the control of ultra-violent Russian gangsters, he can't stand idly by - he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.","simplePlot":"A man believes he has put his mysterious past behind him and has dedicated himself to beginning a new, quiet life. But when he meets a young girl under the control of ultra-violent Russian gangsters, he can't stand idly by - he has to help her.","actors":[{"actorName":"Denzel Washington","urlProfile":"http://www.imdb.com/name/nm0000243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1954","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Denzel Hayes Washington Jr.","height":"6' 1\" (1.85 m)","bio":"Denzel Washington is an American actor and filmmaker. He has received three Golden Globe awards, a Tony Award, and two Academy Awards: Best Supporting Actor for the historical war drama film Glory (1989) and Best Actor for his role as a corrupt cop in the crime thriller Training Day (2001). Denzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University, intent on a career in journalism. However, he caught the acting bug while appearing in student drama productions and, upon graduation, he moved to San Francisco and enrolled at the American Conservatory Theater. He left A.C.T. after only one year to seek work as an actor. His first paid acting role was in a summer stock theater stage production in St. Mary's City, Maryland. The play was \"Wings of the Morning\", which is about the founding of the colony of Maryland (now the state of Maryland) and the early days of the Maryland colonial assembly (a legislative body). He played the part of a real historical character, Mathias Da Sousa, although much of the dialogue was created. Afterwards he began to pursue screen roles in earnest. With his acting versatility and powerful sexual presence, he had no difficulty finding work in numerous television productions. He made his first big screen appearance in Carbon Copy (1981) with George Segal. Through the 1980s, he worked in both movies and television and was chosen for the plum role of Dr. Philip Chandler in NBC's hit medical series St. Elsewhere (1982), a role that he would play for six years. In 1989, his film career began to take precedence when he won the Oscar for Best Supporting Actor for his portrayal of Tripp, the runaway slave in Edward Zwick's powerful historical masterpiece Glory (1989). Washington has received much critical acclaim for his film work since the 1990s, including his portrayals of real-life figures such as South African anti-apartheid activist Steve Biko in Cry Freedom (1987), Muslim minister and human rights activist Malcolm X in Malcolm X (1992), boxer Rubin \"Hurricane\" Carter in The Hurricane (1999), football coach Herman Boone in Remember the Titans (2000), poet and educator Melvin B. Tolson in The Great Debaters (2007), and drug kingpin Frank Lucas in American Gangster (2007). Malcolm X and The Hurricane garnered him Oscar nominations for Best Actor, before he finally won that statuette in 2002 for his lead role in Training Day (2001). Through the 1990s, Denzel also co-starred in such big budget productions as The Pelican Brief (1993), Philadelphia (1993), Crimson Tide (1995), The Preacher's Wife (1996), and Courage Under Fire (1996), a role for which he was paid $10 million. He continued to define his onscreen persona as the tough, no-nonsense hero through the 2000s in films like Out of Time (2003), Man on Fire (2004), Inside Man (2006), and The Taking of Pelham 123 (2009). Cerebral and meticulous in his film work, he made his debut as a director with Antwone Fisher (2002); he also directed The Great Debaters (2007) and Fences (2016). In 2010, Washington headlined The Book of Eli (2010), a post-Apocalyptic drama. Later that year, he starred as a veteran railroad engineer in the action film Unstoppable (2010), about an unmanned, half-mile-long runaway freight train carrying dangerous cargo. The film was his fifth and final collaboration with director Tony Scott, following Crimson Tide (1995), Man on Fire (2004), Déjà Vu (2006) and The Taking of Pelham 1 2 3. He has also been a featured actor in the films produced by Jerry Bruckheimer and has been a frequent collaborator of director Spike Lee. In 2012, Washington starred in Flight (2012), for which he was nominated for an Academy Award for Best Actor. He co-starred with Ryan Reynolds in Sécurité rapprochée (2012), and prepared for his role by subjecting himself to a torture session that included waterboarding. In 2013, Washington starred in 2 Guns (2013), alongside Mark Walberg. In 2014, he starred in The Equalizer (2014), an action thriller film directed by Antoine Fuqua and written by Richard Wenk, based on the television series of same name starring Edward Woodward. During this time period, he also took on the role of producer for some of his films, including The Book of Eli and Safe House. In 2016, he was selected as the recipient for the Cecil B. DeMille Lifetime Achievement Award at the 73rd Golden Globe Awards. He lives in Los Angeles, California with his wife, Pauletta Washington, and their four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000243","name":"Denzel Washington","nicknames":["D"],"idIMDB":"nm0000243"},"actorId":"nm0000243","character":"Robert McCall","urlCharacter":"http://www.imdb.com/character/ch0034856","main":true},{"actorName":"Marton Csokas","urlProfile":"http://www.imdb.com/name/nm0190744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTcyNDEyMV5BMl5BanBnXkFtZTgwMjMzMzYyNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1966","placeOfBirth":" Invercargill, New Zealand","height":"6' 1¼\" (1.86 m)","bio":"Marton was born in Invercargill, Aotearoa, to Margaret Christine (Rayner), a nurse, and Márton Csókás, a mechanical engineer. His father is Hungarian and his mother is Australian (of English, Irish, and Danish origin). He inherited some of his talents from his father, a trained opera singer and at one time, a trapeze artist in the Hungarian Circus. His academic training began at Canterbury University, Christchurch, New Zealand, where he commenced a Bachelor of Arts degree, majoring in Art History, and then transferred to, Te Kura Toi Whakaari o Aotearoa/ The New Zealand Drama School, graduating in December, 1989. His first acting role was in Te Whanau a Tuanui Jones by Apairana Taylor at the Taki Rua Theatre in Wellington New Zealand, (1990). He has since had an eclectic career of theatre, television and film. He appeared in the 1994 movie Jack Brown Genius (1996) in which he played the role of Dennis. After starring for 2 years in the New Zealand soap opera Shortland Street (1992), he starred in the 1996 movie Broken English (1996) as Darko. After performing in a great number of theatrical plays, writing his own and co-founding his own theatre company, the Stronghold Theatre, Marton got the role of Tarlus in an episode of Hercules: The Legendary Journeys (1995). After that, he continued working with Renaissance Pictures, playing the roles of Khrafstar and Borias in the 1997-1998 seasons of Xena: Warrior Princess (1995). He continued appearing in many other shows in both NZ and Australia, such as Farscape (1999), BeastMaster, le dernier des survivants (1999), Brigade des mers (1996), Cleopatra 2525 (2000), and more, returning for the role of Borias in three episodes of the 2000-2001 season of Xena: Warrior Princess (1995). He was also in many movies produced in NZ and Australia, such as Hurrah (1998), Cercle intime (2000) and the mini-series The Farm (2001). He is a citizen of the European Union and Hungary, and is a permanent resident of the United States. Most recently, Csokas starred opposite Denzel Washington in Sony's hit film The Equalizer. He played a brutal fixer for the Russian mafia and a formidable villain to Washington's reluctant hero. Csokas appeared in Darren Aronofsky's Noah as well as Robert Rodriguez's Sin City: A Dame to Kill For, a sequel to the 2005 hit film Sin City. Csokas also played the psychiatrist, \"Dr. Kafka,\" in the hit movie sequel, The Amazing Spiderman 2, alongside Andrew Garfield, Emma Stone and Jamie Foxx. Csokas most famously starred as \"Lord Celeborn\" in one of the highest-grossing film series of all time, Peter Jackson's Lord of the Rings trilogy. Some of his other film credits include 2010's The Debt opposite Jessica Chastain and Paul Greengrass' The Bourne Supremacy with Matt Damon. His depth of experience is illustrated in Asylum in which he starred opposite Natasha Richardson and Ian McKellen, as well as the Ridley Scott epic, Kingdom of Heaven, with Jeremy Irons, Brendan Gleeson and Liam Neeson. On the small screen, Csokas recently starred on the History Channel's miniseries Sons of Liberty as well as Discovery Channel's miniseries Klondike with Tim Roth and Sam Shepard. On stage, Csokas continues to work internationally, most recently starring in a production of Lillian Hellman's \"Little Foxes\" at The New York Theatre Workshop by acclaimed director, Ivo van Hove. The play was noted by Time Magazine as one of the \"Top 10 of Everything of 2010.\" The actor has numerous classical credits, including 'Orsino' in Shakespeare's \"Twelfth Night\" at the National Theatre of Great Britain, 'Anthony' in \"Anthony and Cleopatra\" at the Theatre of a New Audience, 'Brutus' in \"Julius Caesar\" and as 'Septimus' in Tom Stoppard's \"Arcadia\" in his birthplace of New Zealand. On the Australian stage, Csokas has appeared as 'George' in \"Who's Afraid of Virginia Woolf,\" directed by Benedict Andrews of the Schaubuhne Theatre in Berlin and in \"Riflemind,\" directed by Phillip Seymour Hoffman at the Sydney Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTcyNDEyMV5BMl5BanBnXkFtZTgwMjMzMzYyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0190744","name":"Marton Csokas","idIMDB":"nm0190744"},"actorId":"nm0190744","character":"Teddy","urlCharacter":"http://www.imdb.com/character/ch0476939","main":true},{"actorName":"Chloë Grace Moretz","urlProfile":"http://www.imdb.com/name/nm1631269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODk0Mzc0Ml5BMl5BanBnXkFtZTgwNDYzMzgzMzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1997","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 4\" (1.63 m)","bio":"Chloë Grace Moretz was born in Atlanta, Georgia, to Teri (Duke), a nurse, and McCoy Lee Moretz, a plastic surgeon. She has four brothers, all older, including actor Trevor Duke-Moretz. Her ancestry is mostly German and English. Chloë's first two appearances were as Violet in two episodes of the series The Guardian (2001). Her first movie role was as Molly in Heart of the Beholder (2005), a story about a family that opened the first video rental store in 1980. This was followed by a small role in Family Plan (2005) as Young Charlie. After that, however, came Chloe's biggest role, and the one that made her famous: The Amityville Horror (2005), the remake of the famous The Amityville Horror (1979). Next she landed a small role in Today You Die (2005) as the Little Girl, and has since appeared in Room 6 (2006) and Big Momma's House 2 (2006). She filmed Wicked Little Things (2006) in Bulgaria, in which she plays Emma Tunney. In 2007 she completed The Third Nail (2007), in which she appeared as Hailey Deonte. In 2010 she appeared as Hit-Girl in director Matthew Vaughn's action film Kick-Ass (2010), based on the comic book series of the same name by Mark Millar and John Romita Jr. Although her role in the violent action film engendered some controversy, she received widespread critical acclaim for her portrayal. Moretz trained with Jackie Chan's stunt crew for three months prior to filming \"Kick-Ass\" and did most of her own stunts in the film. Also that year she played Abby, a 12-year-old vampire, in Let Me In (2010), the UK/US remake of the Swedish film Let the Right One In (2008), which was released on October 1, 2010. She played Ann Sliger in the crime thriller Texas Killing Fields (2011), released on October 14, 2011. Chloe next played Isabelle in Martin Scorsese's Hugo (2011), a film adaptation of \"The Invention of Hugo Cabret\". \"Hugo\", which was nominated for 11 Oscars, co-starred Asa Butterfield, Ben Kingsley, Sacha Baron Cohen and Helen McCrory. Moretz then starred in Hick (2011), an adaptation of the novel by Andrea Portes. She was in Tim Burton's Dark Shadows (2012), based on the iconic TV series Dark Shadows (1966), playing the role of Carolyn Stoddard, a rebellious teenage daughter. In 2013 she reprised her role as Hit-Girl in the sequel Kick-Ass 2 (2013), which received mixed reviews, but once again her performance was highly praised. The same year she also appeared in a short segment in Movie 43 (2013) and played the title character in Carrie (2013), a remake of Carrie (1976), based on a Stephen King story and directed by Kimberly Peirce. In January 2013 Moretz was chosen to play Mia in the film adaptation of Gayle Forman's If I Stay (2014), which was released in August 2014. On January 16, 2014, it was announced Moretz would appear in an off-Broadway show directed by Steven Soderbergh entitled \"The Library\". In 2014 Chloë was in six films: a cameo as a newspaper girl in Muppets Most Wanted (2014), the female lead of prostitute Teri alongside Denzel Washington in The Equalizer (2014) and teenage party girl Annika with Keira Knightley and Sam Rockwell in Laggies (2014). In December she played the role of very young Hollywood actress with a scandalous reputation Jo-Ann Ellis alongside Kristen Stewart and Juliette Binoche in Sils Maria (2014). In April it was announced that Chloë would be playing the lead role of Cassie Sullivan in The 5th Wave (2016), another adaptation similar to The Hunger Games (2012), alongside Nick Robinson and Alex Roe. It was later announced that Chloë would play the lead female role of Digger in the movie adaptation of Sam Munson's novel \"November Criminals\". Moretz's character is the best friend of Addison Schacht, played by Ansel Elgort,","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODk0Mzc0Ml5BMl5BanBnXkFtZTgwNDYzMzgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1631269","name":"Chloë Grace Moretz","nicknames":["Chloë Grace","Chloe the braniac"],"idIMDB":"nm1631269"},"actorId":"nm1631269","character":"Teri","urlCharacter":"http://www.imdb.com/character/ch0402686","main":true},{"actorName":"David Harbour","urlProfile":"http://www.imdb.com/name/nm1092086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDkxMTY2N15BMl5BanBnXkFtZTcwNTcxMjAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1975","placeOfBirth":" New York, USA","height":"6' 2¾\" (1.9 m)","bio":"David Harbour is an American actor who has performed in film, television, and the theater. He is known for his role as CIA agent Gregg Beam in Quantum of Solace (2008), Shep Campbell in Revolutionary Road (2008), Van Hauser in End of Watch (2012) and Dexter Tolliver in Suicide Squad (2016). He also plays Chief Jim Hopper on the Netflix original series, Stranger Things (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDkxMTY2N15BMl5BanBnXkFtZTcwNTcxMjAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1092086","name":"David Harbour","idIMDB":"nm1092086"},"actorId":"nm1092086","character":"Masters","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Haley Bennett","urlProfile":"http://www.imdb.com/name/nm2247245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwOTgzNjM1NV5BMl5BanBnXkFtZTgwNDk4MzM2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1988","placeOfBirth":" Fort Myers, Florida, USA","birthName":"Haley Loraine Keeling","height":"5' 8\" (1.73 m)","bio":"Haley Bennett was born Haley Loraine Keeling in Fort Myers, Florida, to Leilani (Dorsey) Bennett and Ronald Keeling. She was raised in a small town in Ohio, and moved to Los Angeles following high school in 2006. Soon after, Haley was introduced to a small agency, KSA, who sent her on a casting call for the film Music and Lyrics (2007). Haley made her film debut as pop-diva \"Cora Corman,\" opposite Drew Barrymore and Hugh Grant. Since then, she has continued to pursue film, rather than music, but has taken on other musical roles in films such as Shekhar Kapur's Passage (2009) and Outlaw Country (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwOTgzNjM1NV5BMl5BanBnXkFtZTgwNDk4MzM2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2247245","name":"Haley Bennett","nicknames":["Halo","Hales"],"idIMDB":"nm2247245"},"actorId":"nm2247245","character":"Mandy","urlCharacter":"http://www.imdb.com/character/ch0501793","main":true},{"actorName":"Bill Pullman","urlProfile":"http://www.imdb.com/name/nm0000597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mzk2MDEyM15BMl5BanBnXkFtZTgwMTczMDQzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1953","placeOfBirth":" Hornell, New York, USA","birthName":"William James Pullman","height":"6' 1½\" (1.87 m)","bio":"William James Pullman was born in Hornell, New York, one of seven children of Johanna (Blaas), a nurse, and James Pullman, a doctor. He is of Dutch (mother) and English, Northern Irish, and Scottish (father) descent. After high school, Bill went into a building construction program at SUNY Delhi in New York. He transferred to State University of New York College at Oneonta where he received his BA in Theater. He received both his MFA in Theater/Directing and an honorary PHD from University of Massachusetts at Amherst. While teaching Directing at Montana State University in Bozeman, Montana, one of Bill's students was the soon-to-be film director John Dahl, who later cast Mr. Pullman in \"The Last Seduction\". Moving to New York City, he worked with Kathy Bates in the acclaimed stage production of \"Curse of the Starving Class\". However, it was his first work in three strikingly diverse films that brought him to the attention of his audience: \"Ruthless People\" with Danny DeVito and Bette Milder, the Mel Brooks hit \"Spaceballs\" and the Oscar-nominated (and winner for Best Actress Gina Davis) \"The Accidental Tourist\". Still attracted to the art and study of building construction, Bill has designed and/or restored three \"barns\": In Montana, he converted a 1933 barn at his ranch into his family home. In Los Angeles, he built a Truss barn in the style of LA's 1910 fruit storage barns. In western New York State, he restored a '3-bay' barn that sometimes serves as a community center near his hometown of Hornell, New York. Focused more on neighborhoods than show business-based charities and societies, Pullman has defined himself by his work with his local communities. He works to bridge communities of Los Angeles through his board work with Cornerstone Theater. Pullman continues to work with his neighbors who formed \"Concerned Citizens Montana\" to secure a place at the table regarding the national need for a smart grid for energy transmission. He also works with the local university (Alfred University, New York) as well as supports local health services (\"The Pullman Women's Health and Birthing Center\" at St James Hospital, Hornell, NY). Pullman is also an MS Society Ambassador. Based in Los Angeles, New York City and Western Montana, Pullman is married to the dancer, Tamara Hurwitz Pullman, and they have three children, daughter singer/songwriter Maesa Rae, and multi-talented sons Jack and Lewis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mzk2MDEyM15BMl5BanBnXkFtZTgwMTczMDQzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000597","name":"Bill Pullman","idIMDB":"nm0000597"},"actorId":"nm0000597","character":"Brian Plummer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melissa Leo","urlProfile":"http://www.imdb.com/name/nm0502425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDAxOTkyOF5BMl5BanBnXkFtZTcwOTg1MDIzNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1960","placeOfBirth":" New York City, New York, USA","birthName":"Melissa Chessington Leo","height":"5' 4\" (1.63 m)","bio":"Melissa Leo was born on September 14, 1960 in New York City, New York, USA as Melissa Chessington Leo. She is an actress and producer, known for The Fighter (2010), Prisoners (2013) and Snowden (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDAxOTkyOF5BMl5BanBnXkFtZTcwOTg1MDIzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502425","name":"Melissa Leo","idIMDB":"nm0502425"},"actorId":"nm0502425","character":"Susan Plummer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Meunier","urlProfile":"http://www.imdb.com/name/nm1635108","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2ODI5MTI2MV5BMl5BanBnXkFtZTgwMzE2MzkzMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1973","placeOfBirth":" Woodburn, Oregon, USA","height":"6' 0½\" (1.84 m)","bio":"David Meunier was born on February 5, 1973 in Woodburn, Oregon, USA. He is known for his work on The Equalizer (2014), Aquarius (2015) and Justified (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2ODI5MTI2MV5BMl5BanBnXkFtZTgwMzE2MzkzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1635108","name":"David Meunier","idIMDB":"nm1635108"},"actorId":"nm1635108","character":"Slavi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Skourtis","urlProfile":"http://www.imdb.com/name/nm3495787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxNzQyMDEzNl5BMl5BanBnXkFtZTcwNjc1NTQ0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Johnny Skourtis is known for his work on The Equalizer (2014), The Return of King Hippo (2011) and 1-900-Drinking-Buddy (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxNzQyMDEzNl5BMl5BanBnXkFtZTcwNjc1NTQ0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3495787","name":"Johnny Skourtis","idIMDB":"nm3495787"},"actorId":"nm3495787","character":"Ralphie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Veadov","urlProfile":"http://www.imdb.com/name/nm0891514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzUxODI2MF5BMl5BanBnXkFtZTcwMzk3MTMwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1962","placeOfBirth":" Chernovtsy, Ukrainian SSR, USSR [now Chernivtsi, Ukraine]","bio":"Alex Veadov was born on April 15, 1962 in Chernovtsy, Ukrainian SSR, USSR. He is an actor and director, known for The Equalizer (2014), We Own the Night (2007) and Drag Me to Hell (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzUxODI2MF5BMl5BanBnXkFtZTcwMzk3MTMwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0891514","name":"Alex Veadov","idIMDB":"nm0891514"},"actorId":"nm0891514","character":"Tevi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vladimir Kulich","urlProfile":"http://www.imdb.com/name/nm0474520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MmMxMGItNDcwZC00N2RlLWE5NTQtY2JmMjc4OWY3NGVmXkEyXkFqcGdeQXVyNzk1MjI0MA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1956","placeOfBirth":" Prague, Czechoslovakia [now Czech Republic]","height":"6' 5\" (1.96 m)","bio":"Vladimir Kulich was born in Prague and began his training at the State Theatre of Czechoslovakia. During the Soviet occupation his father, an advisor in the military arranged for his escape to Austria by bribing border guards. Arriving in Canada he was scouted by John Ferguson and became a professional hockey player for the New York Rangers farm team, also representing Canada at the 1977 World Sailing Championships. From 1981-1991 He owned a white water rafting company on the Chilliwack River in British Columbia known as 'The Raft Ranch'. He is known for his work in The Equalizer, Vikings, 13th Warrior, Smoking' Aces, Ironclad,The X Files, and as the voice of Ulfric Stormcloak in one of the most successful video games of all time, Skyrim-The Elder Scrolls. He has given memorable performances opposite academy award winners and nominees like Denzel Washington, Christopher Plummer, Max Von Sydow, Paul Giamatti, John Savage and Antonio Banderas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MmMxMGItNDcwZC00N2RlLWE5NTQtY2JmMjc4OWY3NGVmXkEyXkFqcGdeQXVyNzk1MjI0MA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0474520","name":"Vladimir Kulich","idIMDB":"nm0474520"},"actorId":"nm0474520","character":"Vladimir Pushkin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"E. Roger Mitchell","urlProfile":"http://www.imdb.com/name/nm0593301","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NDEwMzQ3NzBeQTJeQWpwZ15BbWU4MDkyNzIwNTkx._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1971","placeOfBirth":"","height":"5' 10\" (1.78 m)","bio":"E. Roger Mitchell is a Miami Florida native. He received a B.A. in English and Drama from Claflin University, class of 1993. Roger was named in the Who's Who Among Americas Colleges and Universities in 1992. He then continued his education at the Alliance Theatre Professional Actor Internship and later earned Master of Fine Arts in Acting from CUNY Brooklyn (City University of New York), class of 1999. Roger is currently performing in the Horizon Theatre World Premiere of \"Sheddin'\" and has most recently been seen in \"Flying West\" at Theatre in the Square, the World Premiere of \"The Green Book\" at Theatrical Outfit, \"Every Tongue Confess\" at Arena Stage, in August Wilson's \"Jitney\", \"Gem of the Ocean\", and \"Cuttin' Up\" at the Alliance Theatre (2007 Tony Award-Best Regional Theatre Company), \"A Confederacy of Dunces\" and Cormac McCarthy's \"The Sunset Limited\" (Suzi Award, Best Lead Actor 2010) at Theatrical Outfit, \"Miss Evers Boys\" and \"Ceremonies In Dark Old Men\" at Kenny Leon's True Colors Theatre, and \"A Cool Drink of Water\" at Horizon Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NDEwMzQ3NzBeQTJeQWpwZ15BbWU4MDkyNzIwNTkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593301","name":"E. Roger Mitchell","nicknames":["E."],"idIMDB":"nm0593301"},"actorId":"nm0593301","character":"Lead Investigator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Wilcox","urlProfile":"http://www.imdb.com/name/nm4437821","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODM1OTA4Nl5BMl5BanBnXkFtZTgwMTk2OTQzMDI@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"James Wilcox is an actor, known for The Equalizer (2014), Sex Tape (2014) and Child Eater (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODM1OTA4Nl5BMl5BanBnXkFtZTgwMTk2OTQzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4437821","name":"James Wilcox","idIMDB":"nm4437821"},"actorId":"nm4437821","character":"Pederson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike O'Dea","urlProfile":"http://www.imdb.com/name/nm2488340","urlPhoto":"","biography":{"dateOfBirth":"9 July 1973","placeOfBirth":" Medford, Massachusetts, USA","height":"5' 8\" (1.73 m)","bio":"Mike O'Dea was born on July 9, 1973 in Medford, Massachusetts, USA. He is an actor and writer, known for The Equalizer (2014), No Signs of Injury and Townies (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2488340","name":"Mike O'Dea","idIMDB":"nm2488340"},"actorId":"nm2488340","character":"Remar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anastasia Sanidopoulos Mousis","urlProfile":"http://www.imdb.com/name/nm4291105","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI4NzI0OTY1NF5BMl5BanBnXkFtZTcwOTMxMzg3OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Anastasia Sanidopoulos Mousis is known for her work on The Equalizer (2014), Patriots Day (2016) and Joy (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI4NzI0OTY1NF5BMl5BanBnXkFtZTcwOTMxMzg3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4291105","name":"Anastasia Sanidopoulos Mousis","idIMDB":"nm4291105"},"actorId":"nm4291105","character":"Jenny","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0455944","urlIMDB":"http://www.imdb.com/title/tt0455944","business":{"budget":{"money":"$55,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$34,137,828","country":"USA","day":"28","month":"09","year":"2014","remarks":"3,236 Screens"},{"money":"HUF 34,878,750","country":"Hungary","day":"28","month":"09","year":"2014","remarks":""}],"gross":[{"money":"$100,454,738","country":"USA","day":"12","month":"12","year":"2014","remarks":""},{"money":"$64,236,992","country":"USA","day":"05","month":"10","year":"2014","remarks":""},{"money":"$34,137,828","country":"USA","day":"28","month":"09","year":"2014","remarks":""},{"money":"$191,254,738","country":"Worldwide","day":"12","month":"12","year":"2014","remarks":""},{"money":"$860,421","country":"Portugal","day":"12","month":"12","year":"2014","remarks":""}],"weekendGross":[{"money":"$18,750,375","country":"USA","day":"05","month":"10","year":"2014","remarks":"3,236 Screens"},{"money":"$34,137,828","country":"USA","day":"28","month":"09","year":"2014","remarks":"3,236 Screens"}],"admissions":[{"money":"253,173","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"06","year":"2013","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["2 hr 12 min (132 min)"],"soundMix":["SDDS","Datasat","Dolby Digital","Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus 4:3, Panavision C-, E-, G-Series and Angenieux Optimo 2S Lenses"],"laboratory":["ColorWorks, Culver City (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["Codex ARRIRAW (2.8K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"7.2","metascore":"57","filmingLocations":[{"location":"Haverhill, Massachusetts, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Thriller Film","names":[]},{"category":"Best Performance by a Younger Actor","names":[{"name":"Chloë Grace Moretz","id":"nm1631269","role":null}]}]}]},{"award":"Black Reel Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Actor, Motion Picture","names":[{"name":"Denzel Washington","id":"nm0000243","role":null}]}]}]},{"award":"Image Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Image Award","categories":[{"category":"Outstanding Directing in a Motion Picture","names":[{"name":"Antoine Fuqua","id":"nm0298807","role":null}]}]},{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Actor in a Motion Picture","names":[{"name":"Denzel Washington","id":"nm0000243","role":null}]},{"category":"Outstanding Writing in a Motion Picture","names":[{"name":"Richard Wenk","id":"nm0921013","role":null}]}]}]},{"award":"People's Choice Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Thriller Movie","names":[]}]}]}],"votes":"247,528","type":"Movie","companyCreditsSimple":[{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0479739","name":"LStar Capital"},{"idCompany":"co0108864","name":"Village Roadshow Pictures"}],"keywords":{"keywords":["mysterious past","gangster","ex soldier","assassin","hanged man","teenage prostitute","vigilante","prostitute","african american protagonist","based on tv series","russian","hit with a fire extinguisher","final showdown","burned alive","mansion","jackhammer","robbery","fbi","money","fbi agent","suspense","foot chase","chase","pharmacy","subjective camera","character's point of view camera shot","business card","call girl","crime scene","manor house","docks","helicopter","construction site","gas station","home invasion","gas","improvised weapon","threatened with a knife","hand to hand combat","fight","e mail","limousine","disguise","assassination attempt","handcuffs","arrest","surveillance","security camera","shower","impersonating a police officer","organized crime","man kills a woman","sociopath","sadism","sadist","black eye","corrupt businessman","oligarch","corruption","police officer","camera phone","loner","mysterious man","ak 47","uzi","assault rifle","machine gun","revolver","silencer","vigilante justice","brutality","gore","blood","violence","death","strangulation","interrogation","torture","shot in the back","shot in the forehead","shot in the head","booby trap","stabbed in the back","impalement","stabbed in the throat","tough guy","exploding body","exploding building","exploding truck","exploding ship","gunfight","shootout","murder of a police officer","disarming someone","corpse","electrocution","threat","hidden camera","strangled to death","explosion","dripping blood","hit on the head with a fire extinguisher","hit with a book","hitman","close up of eyes","slow motion scene","neck breaking","nail gun","hostage","baseball game","beaten to death","stabbed in the head","fistfight","kicked in the face","extortion","punched in the face","police corruption","corrupt cop","investigation","flashback","trap","knife","stabbed in the neck","stabbed in the chest","stabbed in the stomach","shot in the neck","shot to death","shot in the shoulder","shot in the chest","shot in the leg","shot in the throat","security guard","beating","hospital","man slaps a woman","murder","vigilantism","subtitled scene","moscow russia","face slap","teenage girl","diner","bar fight","bar","submachine gun","pistol","hammer","wedding ring","held at gunpoint","armed robbery","hardware store","secret past","boston massachusetts","criminal","russian mafia","intergenerational friendship","wristwatch","film starts with quote","bridge","lens flare","bus","irish american","mixed martial arts","martial arts","restaurant","bookshelf","neo noir","cell phone","warrior","one man army","anti hero","action hero","title at the end","photograph","tattoo","bare chested male","reading a book","no opening credits","store clerk","one against many","bald man","re boot","remake","reflection in eye","black hero","no title at beginning","character repeating someone else's dialogue","african american","two word title","die hard scenario","money laundering","power outage","flash drive","microwave oven","chess","sprinkler system","deception","product placement","laptop","blender","brawl","long take","henchman","enforcer","social decay","detective","f word","sawed off shotgun","blood splatter","trip wire","power drill","stabbed through the chin","warehouse","pimp","drill in the head","barbed wire","arson","police detective","throat slitting","spear","stabbed to death","stabbed in the shoulder"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:16:01"}}