{"data":{"movies":[{"title":"The Triangle","originalTitle":"","year":"2005–","releaseDate":"20051205","writers":[],"runtime":"240 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjAyMDk2MF5BMl5BanBnXkFtZTcwMTIzMzIzMQ@@._V1.jpg","countries":["UK","USA"],"languages":["English","Spanish","Russian"],"genres":["Action","Adventure","Drama","Mystery","Sci-Fi","Thriller"],"plot":"While chasing a whaler, the Greenpeace boat sinks with the vessel, pulled by a mysterious force underwater and only Meeno Paloma survives. Meanwhile, after the disappearance of six ships in the Bermuda Triangle in one year, the millionaire owner of the Mineral Shipping Lines Eric Benerall hires the skeptical journalist of The Observer Howard Thomas; the scientist Bruce Geller; the offshore engineer Emily Patterson and the psychic Stan Lathem to investigate the reasons for the phenomenon in the area. If the team succeeds in their quest for the truth, each one would receive five million dollars. They find a high-tech underwater facility from the Navy, and each one of them has glimpses of alternative reality after their discovery. They conclude that the experiment conducted by the Navy is affecting the electromagnetic balance of the ocean, while trying to find a way to close the dimensional tear opened by the Philadelphia Experiment. But they believe that the procedure actually will open...","simplePlot":"A group of people haunted by their experiences within the Bermuda Triangle band together to confront its truths.","actors":[{"actorName":"Eric Stoltz","urlProfile":"http://www.imdb.com/name/nm0000655","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Njc5MjQyOF5BMl5BanBnXkFtZTYwNzQzNzgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1961","placeOfBirth":" Whittier, California, USA","birthName":"Eric Cameron Stoltz","height":"5' 11\" (1.8 m)","bio":"Eric Cameron Stoltz is a theater-trained actor and producer who has starred in both independent and studio films. He was born on September 30, 1961 in Whittier, California, to Evelyn Vawter, a violinist and schoolteacher, and Jack Stoltz, an elementary school teacher. He has German, English, and Scottish ancestry. Eric was raised in both American Samoa and Santa Barbara, California, where by the age of fourteen, he was earning money by playing piano for the local musical theater productions, including \"Mame\" starring Anthony Edwards, whom he co-starred with as two of Jeff Spicoli's stoner friends in Fast Times at Ridgemont High (1982). The two became friends, and then college roommates when both attended the University of Southern California. Dropping out in his junior year, Eric joined a repertory company that did 10 plays at the Edinburgh Festival in Scotland. Moving to New York in 1981, he studied with Stella Adler and Peggy Feury, and soon appeared in his first film, Fast Times at Ridgemont High (1982). In the 1980s, he garnered attention (and a Golden Globe Nomination) starring as Rocky Dennis in Mask (1985), and in John Hughes' Some Kind of Wonderful (1987). In 1988, he made his Broadway debut in Great Performances: Our Town (1989), for which he was nominated for a Tony Award. In the 1990s, he went back and forth from stage to film, building up an eclectic resume that included studio films (Pulp Fiction (1994), independent films (Sundance Festival Winner The Waterdance (1992), and films that he himself produced (Mr. Jealousy (1997). He also continued to appear on the New York stage both on Broadway (Three Sisters, Two Shakespearean Actors) and off-Broadway (The Importance of Being Ernest, The Glass Menagerie). He continued to work in television as well, doing a recurring role as Helen Hunt's ex on Mad About You (1992), a year on Chicago Hope (1994), and in the television and cable movies Inside (1996) (directed by Arthur Penn), A Killer in the Family (1983) (with Robert Mitchum) and The Passion of Ayn Rand (1999) (with Helen Mirren). Eric Stoltz lives in New Mexico, and has been romantically linked to Ally Sheedy, Jennifer Jason Leigh, Lili Taylor, and Bridget Fonda,. Since 2002 he has concentrated mainly on directing, having done a television movie, several short films, several independent films, and television shows such as Grey's Anatomy (2005), Boston Legal (2004), Nashville (2012), and Glee (2009). In 2014 he became the producing director of the hit CBS show, Madam Secretary (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Njc5MjQyOF5BMl5BanBnXkFtZTYwNzQzNzgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000655","name":"Eric Stoltz","idIMDB":"nm0000655"},"actorId":"nm0000655","character":" Howard Thomas","urlCharacter":"http://www.imdb.com/character/ch0026151","main":true},{"actorName":"Catherine Bell","urlProfile":"http://www.imdb.com/name/nm0004738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTYxMDk0OF5BMl5BanBnXkFtZTYwMjA1MzA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1968","placeOfBirth":" London, England, UK","birthName":"Catherine Lisa Bell","height":"5' 9\" (1.75 m)","bio":"Catherine was born in London, but moved to California with her Iranian mother at age 2. Her mother still acts as her personal assistant. As a child, she acted in various TV adverts. She went to UCLA to study biology, but dropped out to become a model in Japan. She moved back into acting with a Mexican commercial for Amex and then followed that up by being Isabella Rossellini's nude body double in Death Becomes Her (1992), where she also met her future husband, Adam Beason, who was director Robert Zemeckis's assistant. The couple currently live near L.A. with their daughter Gemma.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTYxMDk0OF5BMl5BanBnXkFtZTYwMjA1MzA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004738","name":"Catherine Bell","idIMDB":"nm0004738"},"actorId":"nm0004738","character":" Emily Patterson","urlCharacter":"http://www.imdb.com/character/ch0026152","main":true},{"actorName":"Lou Diamond Phillips","urlProfile":"http://www.imdb.com/name/nm0001617","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NTgwMTQzMl5BMl5BanBnXkFtZTcwMjAzNTM4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1962","placeOfBirth":" Subic Bay Naval Base, Olongapo City, Zambales, Philippines","birthName":"Lou Diamond Upchurch","height":"6' 1\" (1.85 m)","bio":"Lou Diamond Phillips was born on February 17, 1962 in Subic Bay Naval Base, Olongapo City, Zambales, Philippines as Lou Diamond Upchurch. He is an actor, known for Courage Under Fire (1996), La Bamba (1987) and Longmire (2012). He has been married to Yvonne Boismier Phillips since August 16, 2007. They have one child. He was previously married to Kelly Phillips and Julie Cypher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NTgwMTQzMl5BMl5BanBnXkFtZTcwMjAzNTM4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001617","name":"Lou Diamond Phillips","idIMDB":"nm0001617"},"actorId":"nm0001617","character":" Meeno Paloma","urlCharacter":"http://www.imdb.com/character/ch0055152","main":true},{"actorName":"Bruce Davison","urlProfile":"http://www.imdb.com/name/nm0001117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmExMzM3ZmMtYjRmYi00YmRlLTliOGMtYTk2ODcxMjkxMTBmL2ltYWdlXkEyXkFqcGdeQXVyMTQyNjk5Mzc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1946","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 1\" (1.85 m)","bio":"With his blond, clean-cut, Ivy League handsomeness and ready-whipped smile reminiscent of Kennedyesque times, actor Bruce Davison fits the prototype of today's more current crop of fresh-faced, likable blonds such as Brian Kerwin and Aaron Eckhart. While it proved difficult at times for the actor to get past those perfect features and find meatier roles, his talent certainly overcame the \"handicap\". Extremely winning and versatile, the award-worthy actor, now enjoying an over four decade career, has included everything from Shakespeare to Seinfeld. He has also served as a writer, producer and director on an infrequent basis. Born on June 28, 1946, in Philadelphia, Pennsylvanis, the son of Clair, an architect and musician, and Marian (Holman) Davison, a secretary, Bruce's parents divorced when he was just three. He developed a burgeoning interest in acting while majoring in art at Penn State and after accompanying a friend to a college theater audition. Making his professional stage debut in 1966 as Jonathan in \"Oh Dad, Poor Dad, Mama's Hung You in the Closet and I'm Feelin' So Bad\" at the Pennsylvania Festival Theatre, he had made it to Broadway within just a couple of years (1968) in the role of Troilus in \"Tiger at the Gates\" at the Vivian Beaumont Theatre. The year after that he was seen off-Broadway in \"A Home Away from Home\" and appeared at the Lincoln Center in the cast of \"King Lear\". Success in the movies came immediately for the perennially youthful-looking actor after he and a trio of up-and-coming talents (Barbara Hershey [then known as Barbara Seagull], Richard Thomas and Catherine Burns) starred together in the poignant but disturbing coming-of-age film Last Summer (1969). From this he was awarded a starring role opposite Kim Darby in The Strawberry Statement (1970), an offbeat social commentary about 60s college radicalism, and in the cult horror flick Willard (1971) in which he bonded notoriously with a herd of rats. Moving further into the 70s decade, his film load did not increase significantly as expected and the ones he did appear in were no great shakes. With the exception of his co-starring role alongside Burt Lancaster in the well-made cavalry item Ulzana's Raid (1972) and the powerful low-budget Short Eyes (1977) in which he played a child molester, Bruce was surprisingly ill-used or underused. Insignificant as the elder Patrick Dennis in the inferior Lucille Ball musical film version of Mame (1974), he was just as overlooked in such movies as The Jerusalem File (1972), Mother, Jugs & Speed (1976), Grand Jury (1976) and Brass Target (1978). Bruce wisely looked elsewhere for rewarding work and found it on the stage and on the smaller screen. Earning strong theatrical roles in \"The Skin of Our Teeth,\" \"The Little Foxes\" and \"A Life in the Theatre,\" he won the Los Angeles Drama Critics Award for his work in \"Streamers\" in 1977. On TV, he scored in mini-movie productions of Mourning Becomes Electra (1978), Deadman's Curve (1978) (portraying Dean Torrence of the surf-era pop duo Jan and Dean) and, most of all, Summer of My German Soldier (1978) co-starring Kristy McNichol as a German prisoner of war in the American South who falls for a lonely Jewish-American girl. In 1972 Bruce married actress Jess Walton who appeared briefly as a college student in The Strawberry Statement (1970) and later became a daytime soap opera fixture. The marriage was quickly annulled the following year. The 1980s was also dominated by strong theater performances. Bruce took over the role of the severely deformed John Merrick as \"The Elephant Man\" on Broadway; portrayed Clarence in \"Richard III\" at the New York Shakespeare Festival; was directed by Henry Fonda in \"The Caine Mutiny Court Martial\"; played a moving Tom Wingfield opposite Jessica Tandy's Amanda in \"The Glass Menagerie\"; received a second Los Angeles Drama Critics Award for his work in the AIDS play \"The Normal Heart\"; and finished off the decade gathering up fine reviews in the amusing A.R. Gurney period piece \"The Cocktail Hour\". While hardly lacking for work on film (Kiss My Grits (1982), Crimes of Passion (1984), Spies Like Us (1985), and The Ladies Club (1986)), few of them made use of his talents and range. It was not until he was cast in the ground-breaking gay drama Longtime Companion (1989) that his film career revitalized. Giving a quiet, finely nuanced, painfully tender performance as the middle-aged lover and caretaker of a life partner ravaged by AIDS, Bruce managed to stand out amid the strong ensemble cast and earn himself an Oscar nomination for \"Best Supporting Actor\". Although he lost out to the flashier antics of Joe Pesci in the mob drama Goodfellas (1990) that year, Bruce was not overlooked -- copping Golden Globe, Independent Spirit, New York Film Critics and National Society of Film Critics awards. Other gay-themed films also welcomed his presence, including The Cure (1995) and It's My Party (1996). The actor eventually served as a spokesperson for a host of AIDS-related organizations, including Hollywood Supports, and, elsewhere, is active with foundations that help children who are abused. Bruce has been all over the screen since his success in Longtime Companion (1989). Predominantly seen as mature, morally responsible dads and politicians, his genial good looks and likability have on occasion belied a weak or corrupt heart. Bruce married actress Lisa Pelikan in 1986 (well over a decade after his first marriage ended) and they have one son, Ethan, born in 1996. The handsome couple became well known around town and worked frequently together on stage (\"The Downside,\" \"Love Letters,\" \"Breaking the Silence,\" \"To Kill a Mockingbird\") and in TV movies (Color of Justice (1997)). Bruce's more popular films these days have included Six Degrees of Separation (1993) starring Will Smith, the family adventure film Far from Home: The Adventures of Yellow Dog (1995) and the box-office hit X-Men (2000) and its sequel in the role of Senator Kelly. More controversial art-house showcases include Dahmer (2002), as serial killer Jeffrey Dahmer's father, and Hate Crime (2005), as a bigoted, murderous pastor. Bruce has attempted TV series leads in later years. With Harry and the Hendersons (1991), he ably directed a number of the show's episodes. He has also been tapped for recurring parts on The Practice (1997) and The L Word (2004), and is fondly remembered for his comedy episodes on Seinfeld (1989) as an attorney who goes for George's (Jason Alexander) throat when George's fiancée dies inexplicably of toxic poisoning. The actor recently completed a TV series revival of Knight Rider (2008). Divorced from Lisa Pelikan, Bruce is married these days to third wife Michele Correy and has a daughter by her, Sophia, born in 2006. They live in the Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmExMzM3ZmMtYjRmYi00YmRlLTliOGMtYTk2ODcxMjkxMTBmL2ltYWdlXkEyXkFqcGdeQXVyMTQyNjk5Mzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001117","name":"Bruce Davison","idIMDB":"nm0001117"},"actorId":"nm0001117","character":" Stan Lathem","urlCharacter":"http://www.imdb.com/character/ch0258316","main":true},{"actorName":"Michael E. Rodgers","urlProfile":"http://www.imdb.com/name/nm0734751","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MzEwODQ0M15BMl5BanBnXkFtZTcwMDA5MjcyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1969","placeOfBirth":" Whitburn, West Lothian, Scotland, UK","birthName":"Michael Ethan Rodgers","height":"5' 9\" (1.75 m)","bio":"Michael E. Rodgers was born on May 8, 1969 in Whitburn, West Lothian, Scotland as Michael Ethan Rodgers. He is an actor, known for Auto Focus (2002), The Patriot (2000) and Gia (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MzEwODQ0M15BMl5BanBnXkFtZTcwMDA5MjcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0734751","name":"Michael E. Rodgers","idIMDB":"nm0734751"},"actorId":"nm0734751","character":" Bruce Geller","urlCharacter":"http://www.imdb.com/character/ch0258315","main":true},{"actorName":"Sam Neill","urlProfile":"http://www.imdb.com/name/nm0000554","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjY1OTA1NF5BMl5BanBnXkFtZTcwNTcxMTAzNQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1947","placeOfBirth":" Omagh, Co. Tyrone, Northern Ireland, UK","birthName":"Nigel Neill","height":"5' 11¾\" (1.82 m)","bio":"Sam Neill was born in Omagh, Co. Tyrone, Northern Ireland, to army parents, an English-born mother, Priscilla Beatrice (Ingham), and a New Zealand-born father, Dermot Neill. His family moved to the South Island of New Zealand in 1954. He went to boarding schools and then attended the universities at Canterbury and Victoria. He has a BA in English Literature. Following his graduation, he worked with the New Zealand Players and other theater groups. He also was a film director, editor and scriptwriter for the New Zealand National Film Unit for 6 years. Sam Neill is internationally recognised for his contribution to film and television. He is well known for his roles in Steven Spielberg's Jurassic Park and Jane Campion's Academy Award Winning film The Piano. Other film roles include The Daughter, Backtrack opposite Adrian Brody, Deux Ex Machina, F2014, A Long Way Down, The Tomb, The Hunter with Willem Dafoe, Daybreakers, Legend of the Guardians: The Owls Of G'Ahoole, Little Fish opposite Cate Blanchett, Skin, Dean Spanley, Wimbledon, Yes, Perfect Strangers, Dirty Deeds, The Zookeepers, Bicenntial Man opposite Robin Williams, The Horse Whisperer alongside Kristin Scott Thomas, Sleeping Dogs, My Brilliant Career. He received Emmy and Golden Globe nominations for the NBC miniseries Merlin. He also received a Golden Globe nomination for One Against The Wind, and for Reilly: The Ace of Spies. The British Academy of Film and Television honoured Sam's work in Reilly by naming him Best Actor. Sam received an AFI Award for Best Actor for his role in Jessica. Other television includes House of Hancock, Rake, Doctor Zhivago, To the Ends of Earth, The Tudors with Jonathan Rhys Meyers, Cruseo, Alcatraz and recently in Old School opposite Bryan Brown, Peaky Blinders alongside Cillian Murphy, The Dovekeepers for CBS Studios.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjY1OTA1NF5BMl5BanBnXkFtZTcwNTcxMTAzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000554","name":"Sam Neill","idIMDB":"nm0000554"},"actorId":"nm0000554","character":" Eric Benerall","urlCharacter":"http://www.imdb.com/character/ch0090001","main":true},{"actorName":"Lisa Brenner","urlProfile":"http://www.imdb.com/name/nm0004773","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNjYxNzYzNV5BMl5BanBnXkFtZTcwMDcyMDkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1974","placeOfBirth":" Long Island, New York, USA","birthName":"Lisa Dawn Goldstein","height":"5' 4\" (1.63 m)","bio":"Lisa Brenner was born on February 12, 1974 in Long Island, New York, USA as Lisa Dawn Goldstein. She is an actress, known for The Patriot (2000), All My Children (1970) and Another World (1964). She has been married to Dean Devlin since July 4, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNjYxNzYzNV5BMl5BanBnXkFtZTcwMDcyMDkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004773","name":"Lisa Brenner","idIMDB":"nm0004773"},"actorId":"nm0004773","character":" Helen Paloma","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Sloan","urlProfile":"http://www.imdb.com/name/nm0805980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQxNjcyNjc5Nl5BMl5BanBnXkFtZTgwNDgyMDE2NDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"John Sloan is an actor, known for Farmed and Dangerous (2013), Happy Hour (2006) and The Triangle (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQxNjcyNjc5Nl5BMl5BanBnXkFtZTgwNDgyMDE2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0805980","name":"John Sloan","idIMDB":"nm0805980"},"actorId":"nm0805980","character":" Aron Ackerman","urlCharacter":"http://www.imdb.com/character/ch0258314","main":true},{"actorName":"Charles Martin Smith","urlProfile":"http://www.imdb.com/name/nm0001747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMxMDk2M15BMl5BanBnXkFtZTcwMzcxODYzMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1953","placeOfBirth":" Van Nuys, California, USA","height":"5' 5\" (1.65 m)","bio":"Charles Martin Smith is an American film actor, writer, and director. Born in Van Nuys, California, Smith was discovered by a talent agent while acting in a school play, usually a rare occurrence. After a few years of working in film, he landed the role of Terry \"The Toad\" Fields in George Lucas' 1973 film, American Graffiti (1973). The sequel, More American Graffiti (1979), did not have the success of the original, but he gained notice in The Buddy Holly Story (1978), Never Cry Wolf (1983) and the successful Starman (1984). Smith's career continued mainly in supporting roles, but he received good reviews for his work in The Untouchables (1987). While his career was largely unremarkable in the 1990s after appearing in less successful films, such as Speechless (1994) and I Love Trouble (1994), Smith turned in a well-regarded performance in the TV miniseries Larry McMurtry's Streets of Laredo (1995) and a minor role in the big budget Deep Impact (1998). He was also one of the directors of the TV series Space: Above and Beyond (1995), as well as the director of the initial episode (\"Welcome to the Hellmouth\") that launched the hit TV series Buffy the Vampire Slayer (1997). Since the mid-1990s, Smith has increasingly focused on his work behind the camera. He directed the feature film Air Bud (1997) (Disney), and two TV miniseries for Hallmark Entertainment, Roughing It (2002) and Icon (2005). He also wrote and directed the feature film, The Snow Walker (2003), for Lion's Gate Films, based on a story by Farley Mowat (Never Cry Wolf (1983)), which marked a return to the Arctic for Smith. He then wrote and directed the feature film Stone of Destiny (2008), for Infinity Features and Odeon Sky, the true story of four young Scottish students who broke into Westminster Abbey in London to take back a sacred Scottish relic. The film stars Charlie Cox, Kate Mara and Robert Carlyle, and was nominated for Best Picture by the Scottish BAFTAS. He now resides in Canada and continues to add to production, directing, acting, and writing credits in a career that has spanned over 35 years. His next film, Dolphin Tale (2011), for Alcon (The Blind Side (2009)) and Warner Brothers, which he also wrote and directed, stars Harry Connick Jr., Ashley Judd, Morgan Freeman, and Winter, the dolphin, who plays herself in the film. The movie is scheduled to be released Sept. 23, 2011 by WB.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMxMDk2M15BMl5BanBnXkFtZTcwMzcxODYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001747","name":"Charles Martin Smith","idIMDB":"nm0001747"},"actorId":"nm0001747","character":" Captain Jay","urlCharacter":"http://www.imdb.com/character/ch0258313","main":true},{"actorName":"Barrie Ingham","urlProfile":"http://www.imdb.com/name/nm0408813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTU5ODM4MF5BMl5BanBnXkFtZTgwMjQ3MjU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1932","placeOfBirth":" Halifax, Yorkshire, England, UK","birthName":"Barrie Stanton Ingham","height":"6' 1½\" (1.87 m)","bio":"Barrie Ingham was born on February 10, 1932 in Halifax, Yorkshire, England as Barrie Stanton Ingham. He was an actor, known for The Great Mouse Detective (1986), The Day of the Jackal (1973) and Dr. Who and the Daleks (1965). He was married to Tarne Phillips. He died on January 23, 2015 in Palm Beach Gardens, Florida, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTU5ODM4MF5BMl5BanBnXkFtZTgwMjQ3MjU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408813","name":"Barrie Ingham","idIMDB":"nm0408813"},"actorId":"nm0408813","character":" Doug Weist","urlCharacter":"http://www.imdb.com/character/ch0475738","main":true},{"actorName":"Marius Weyers","urlProfile":"http://www.imdb.com/name/nm0923366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3OTg5MzE1MV5BMl5BanBnXkFtZTcwNDIyMDkwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1945","placeOfBirth":" Johannesburg, South Africa","bio":"Marius Weyers was born on February 3, 1945 in Johannesburg, South Africa. He is an actor, known for Blood Diamond (2006), Les dieux sont tombés sur la tête (1980) and Gandhi (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3OTg5MzE1MV5BMl5BanBnXkFtZTcwNDIyMDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0923366","name":"Marius Weyers","idIMDB":"nm0923366"},"actorId":"nm0923366","character":" Karl Sheedy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shannon Esra","urlProfile":"http://www.imdb.com/name/nm1458492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NDYzNTc4MV5BMl5BanBnXkFtZTgwMzA4NDU2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Shannon Esrechowitz","bio":"Shannon Esra was born as Shannon Esrechowitz. She is an actress, known for I Dreamed of Africa (2000), Salaam-E-Ishq (2007) and Number 10 (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NDYzNTc4MV5BMl5BanBnXkFtZTgwMzA4NDU2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1458492","name":"Shannon Esra","idIMDB":"nm1458492"},"actorId":"nm1458492","character":" Sally Thomas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adrienne Pierce","urlProfile":"http://www.imdb.com/name/nm0668875","urlPhoto":"","biography":{"bio":"Adrienne Pierce is an actress, known for American Ninja 3: Blood Hunt (1989), The Bone Snatcher (2003) and Proteus (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0668875","name":"Adrienne Pierce","idIMDB":"nm0668875"},"actorId":"nm0668875","character":" Emily's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robyn Olivia Heaney","urlProfile":"http://www.imdb.com/name/nm2108361","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMDgwNzUwOV5BMl5BanBnXkFtZTcwMzQ0MDYzMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Robyn Olivia Heaney is a South African actress who works in theatre, film and television projects, both locally and internationally. She works comfortably in a variety of accents for international productions and is an accomplished voice artist as well. She is also credited as a writer on IMDB. Alternate names credited fro Robyn Olivia Heaney include Robyn Olivia and Robyn Grimbeek.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMDgwNzUwOV5BMl5BanBnXkFtZTcwMzQ0MDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2108361","name":"Robyn Olivia Heaney","idIMDB":"nm2108361"},"actorId":"nm2108361","character":" Marie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anette Kemp","urlProfile":"http://www.imdb.com/name/nm2199869","urlPhoto":"","biography":{"bio":"Anette Kemp is an actress, known for The Three Investigators and the Secret of Terror Castle (2009) and The Triangle (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2199869","name":"Anette Kemp","idIMDB":"nm2199869"},"actorId":"nm2199869","character":" Traci Thomas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Danford","urlProfile":"http://www.imdb.com/name/nm0199447","urlPhoto":"","biography":{"bio":"Susan Danford is an actress, known for Invictus (2009), Doomsday (2008) and The Salvation (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0199447","name":"Susan Danford","idIMDB":"nm0199447"},"actorId":"nm0199447","character":" Landon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hakeem Kae-Kazim","urlProfile":"http://www.imdb.com/name/nm0434444","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjY3MDA4OV5BMl5BanBnXkFtZTcwNDA1ODU1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1962","placeOfBirth":" Nigeria","bio":"Actor Hakeem Kae-Kazim, classically trained in the UK at the highly regarded Bristol Old Vic and soon after graduation was invited to join the Royal Shakespeare Company. Hakeem's list of impressive credits include Pirates of the Caribbean III, Lost, Cane with Jimmy Smits, Law & Order: SVU with Mariska Hargitay, The Triangle with Sam Neill, The Librarian with Gabrielle Anwar, X-Men: Wolverine with Hugh Jackman, The 4th Kind alongside Milla Jovovich and Darfur with Billy Zane. Hakeem is often recognized for his recurring role as Colonel Dubaku, through which he wowed audiences with his stunning performance in 24's' Season 7, and in the prequel movie Redemption. Hakeem both produced and starred in Black November with Mickey Rourke and Kim Basinger, as well as the award winning film Man on Ground and Last Flight to Abuja. His distinctive voice has also been shared in many popular video games including Halo, Call of Duty and The Bourne Conspiracy. Hakeem is well loved for his TV work, which recently has included many primetime shows including Human Target, Criminal Minds, NCIS, Law and Order, Covert Affairs and Strike Back. Hakeem's latest films Half of a Yellow Sun and A Chance of Rain, are set to be released soon and his role as Mr Scott in Michael Bay's exciting and much awaited new series Black Sails with be premiering in 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjY3MDA4OV5BMl5BanBnXkFtZTcwNDA1ODU1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0434444","name":"Hakeem Kae-Kazim","idIMDB":"nm0434444"},"actorId":"nm0434444","character":" Saunders","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Latter","urlProfile":"http://www.imdb.com/name/nm0490417","urlPhoto":"","biography":{"bio":"Greg Latter is an actor and writer, known for The Color of Freedom (2007), Night Train to Lisbon (2013) and To the Death (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0490417","name":"Greg Latter","idIMDB":"nm0490417"},"actorId":"nm0490417","character":" Osserman","urlCharacter":"http://www.imdb.com/character/ch0258312","main":true},{"actorName":"David Butler","urlProfile":"http://www.imdb.com/name/nm0124880","urlPhoto":"","biography":{"bio":"David Butler is an actor, known for New Jersey Drive (1995), Mrs Mandela (2010) and The Gamechangers (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0124880","name":"David Butler","idIMDB":"nm0124880"},"actorId":"nm0124880","character":" Tolan","urlCharacter":"http://www.imdb.com/character/ch0258304","main":true},{"actorName":"Sean Cameron Michael","urlProfile":"http://www.imdb.com/name/nm0584206","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmMwZmY2ZmQtMjg5MS00YTcyLWE2OTYtZjA2OTdjYWUxYzVhXkEyXkFqcGdeQXVyMTQyOTQ4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1969","placeOfBirth":" Cape Town, South Africa","height":"5' 10\" (1.78 m)","bio":"South African-born veteran actor Sean Cameron Michael started acting professionally at the age of twelve in musical theater. With a career spanning over thirty years, he is today regarded as one of Africa's most successful exports, having performed numerous leading and supporting roles in over eighty television and film productions and has worked with some of the top actors, directors and producers in the world today, including Clint Eastwood, Morgan Freeman, Ryan Reynolds, Matt Damon, Denzel Washington, Meg Ryan, William Hurt and Michael Bay. Theater highlights include the Vita Award-winning On the Open Road and as Father Huddleston in the Naledi award-winning musical-opera, The Mandela Trilogy. He first gained international exposure in Bryan Singer and Dean Devlin's Emmy-winning mini-series The Triangle, as well as Fox's multi-Emmy and Golden Globe nominated feature 24: Redemption (opposite Jon Voight and Kiefer Sutherland). Over 12 million viewers tuned in for the premiere. More recently he worked opposite Games of Thrones' Charles Dance in the Emmy-nominated Strike Back series, as well as Oscar winner William Hurt in BBC Films' Royal Television Society's award-winning The Challenger Disaster. In 2013 he secured the series regular role of Richard Guthrie in Michael Bay's hit pirate adventure series Black Sails for Starz Entertainment. Season 1 garnered 4 Emmy nominations and 2 wins, with Michael being considered for a 2014 Emmy nomination for Outstanding Supporting Actor in a Drama Series. He returned in season 2 which premiered in over 200 countries and was once again considered for an Emmy, as well as a SAG Award. A highlight of 2015 was Michael playing the supporting role of Lester in Zentropa/Universal's western feature The Salvation for director Kristian Levring, alongside Mads Mikkelsen, Jonathan Pryce and Eva Green. He also became a permanent US resident based in Los Angeles and a member of SAG-Aftra. In 2016 he had supporting roles in feature films Dis Koue Kos Skat, Double Echo and American Girl: Lea to the Rescue, while on television he guest starred opposite Gary Sinise in CBS's Criminal Minds: Beyond Borders, Of Kings & Prophets (ABC), as well as the lead baddie role of Shane Copley in Scorpion opposite Robert Patrick on CBS. In February 2017 Michael played the lead role in the sci-fi short film Tears in the Rain which won him the Jury and Audience Best Actor Award at the SciFi Underground Film Festival in Munich, Germany. The actor went on to win Best Performance by an Actor at the Boston SciFi Film Festival for his lead protagonist role of Sam in the indie feature film Last Broken Darkness. Michael recurs on the hit Mark Wahlberg-produced conspiracy drama Shooter (USA) as Russian diplomat Grigory Krukov, opposite Ryan Phillippe and Omar Epps. He will next be seen recurring as Old Man Heart in the grindhouse series Blood Drive on Syfy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmMwZmY2ZmQtMjg5MS00YTcyLWE2OTYtZjA2OTdjYWUxYzVhXkEyXkFqcGdeQXVyMTQyOTQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0584206","name":"Sean Cameron Michael","idIMDB":"nm0584206"},"actorId":"nm0584206","character":" Don Beatty","urlCharacter":"http://www.imdb.com/character/ch0060700","main":true},{"actorName":"Mitchell Obermeyer","urlProfile":"http://www.imdb.com/name/nm2130260","urlPhoto":"","biography":{"bio":"Mitchell Obermeyer is an actor, known for The Triangle (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2130260","name":"Mitchell Obermeyer","idIMDB":"nm2130260"},"actorId":"nm2130260","character":" Ruben Paloma","urlCharacter":"http://www.imdb.com/character/ch0258310","main":true},{"actorName":"Nicholas Bronkhorst","urlProfile":"http://www.imdb.com/name/nm2130110","urlPhoto":"","biography":{"bio":"Nicholas Bronkhorst is an actor, known for The Triangle (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2130110","name":"Nicholas Bronkhorst","idIMDB":"nm2130110"},"actorId":"nm2130110","character":" Dylan Paloma","urlCharacter":"http://www.imdb.com/character/ch0258309","main":true},{"actorName":"Nick Boraine","urlProfile":"http://www.imdb.com/name/nm0095930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NTI1MzI3Nl5BMl5BanBnXkFtZTgwNDI1ODgwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1971","placeOfBirth":"","bio":"Nick Boraine was born on November 14, 1971. He is an actor, known for Homeland (2011), Paradise Stop (2011) and A Snake Gives Birth to a Snake (2014). He is married to Louise Barnes. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NTI1MzI3Nl5BMl5BanBnXkFtZTgwNDI1ODgwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095930","name":"Nick Boraine","idIMDB":"nm0095930"},"actorId":"nm0095930","character":" Reilly","urlCharacter":"http://www.imdb.com/character/ch0475737","main":true},{"actorName":"Clare Marshall","urlProfile":"http://www.imdb.com/name/nm0550815","urlPhoto":"","biography":{"bio":"Clare Marshall is an actress, known for Noodles (2016), Wah-Wah (2005) and Cape of Good Hope (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0550815","name":"Clare Marshall","idIMDB":"nm0550815"},"actorId":"nm0550815","character":"Alice Sheedy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Caprari","urlProfile":"http://www.imdb.com/name/nm0135610","urlPhoto":"","biography":{"bio":"Tony Caprari is an actor, known for Lord of War (2005), 10,000 BC (2008) and The Redemption: Kickboxer 5 (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0135610","name":"Tony Caprari","idIMDB":"nm0135610"},"actorId":"nm0135610","character":" Captain Columbus","urlCharacter":"http://www.imdb.com/character/ch0517701","main":true},{"actorName":"Stephen Jennings","urlProfile":"http://www.imdb.com/name/nm0421252","urlPhoto":"","biography":{"bio":"Stephen Jennings is an actor, known for Starship Troopers 3: Marauder (2008), La couleur de l'amitié (2000) and The Dinosaur Project (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0421252","name":"Stephen Jennings","idIMDB":"nm0421252"},"actorId":"nm0421252","character":" Interrogator #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmie Earl Perry","urlProfile":"http://www.imdb.com/name/nm2228154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjYyNTU5NV5BMl5BanBnXkFtZTgwMDg4NTAzNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1951","placeOfBirth":" Alabama, USA","height":"5' 11\" (1.8 m)","bio":"Jimmie Earl Perry, born in Gordon Alabama, a Piscean on February 28th 1951, is the son of two great parents who raised him in Trenton, New Jersey. Having successfully gone thru his elementary and secondary education, he attended Westminster Choir College in Princeton New Jersey and earned his credentials to teach as he did in the New Jersey Education system for two years. An avid church goer and member of several choirs and vocal groups, Jimmie knew his life would lead him to the stage as a profession. Having performed at this early age with Leonard Bernstein and his \"Chichester Psalms\" at Carnegie Hall, Leopold Stowkowski and the Verdi Requiem, gospel choir/soloist at the St. Paul AME Zion Church in Trenton, his music studies and experiences such as \"Camelot\", How to Succeed in Business Without Really Trying\", led him to New York to pursue his desires further. This led him to be accepted at the American Academy of Dramatic Arts in New York, later joined the AMAS Rep Company with Loretta Lenoire, toured the country in musicals as well as Canada, Cats, Miss Saigon (directed by Nicholas Hytner), \"Dreamgirls\", \"Sallyandtom\" and European tours in such shows as \"Starlight Express\", \"Jesus Christ Superstar as Pilate (directed and choreographed by Baayork Lee), \"Usa Gospel Singers\" (La Scala in Milan). Recorded by Warner International in Sydney, Australia and performed in \"Let My People Come\" for two years there. Currently, Perry is living and working in Stellenbosch South Africa, with a recently released self produced Cd titled \"Power of the Dream\"!! His incredible voice is heard on many voice overs and his exceptional acting ability has led him to principle roles in film and commercials. His impressive work to educate people in the prevention of HIV/AIDS is commendable and should lead him to international recognition by combining his artistic and creative abilities.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjYyNTU5NV5BMl5BanBnXkFtZTgwMDg4NTAzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2228154","name":"Jimmie Earl Perry","idIMDB":"nm2228154"},"actorId":"nm2228154","character":" Interrogator #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Bishop","urlProfile":"http://www.imdb.com/name/nm2134538","urlPhoto":"","biography":{"bio":"Anthony Bishop is an actor, known for District 9 (2009), Chappie (2015) and Starship Troopers 3: Marauder (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2134538","name":"Anthony Bishop","idIMDB":"nm2134538"},"actorId":"nm2134538","character":" Interrogator #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Otto","urlProfile":"http://www.imdb.com/name/nm0653268","urlPhoto":"","biography":{"bio":"Kevin Otto, American Actor, Writer. Born and raised in New Orleans on a belly full of red beans and rice! He has appeared in numerous films as well as guest roles on TV series such as NBC'c Providence, FOX-TV's Angel, and The History Channel's documentary series America, The Story Of Us, as Paul Revere. He is cast to appear in \"Heaven Over Africa\"(2012)","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0653268","name":"Kevin Otto","idIMDB":"nm0653268"},"actorId":"nm0653268","character":" Interrogator #4","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danie Struwig","urlProfile":"http://www.imdb.com/name/nm2000522","urlPhoto":"","biography":{"bio":"Danie Struwig is an actor, known for Lord of War (2005), Skin (2008) and Tshisa (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2000522","name":"Danie Struwig","idIMDB":"nm2000522"},"actorId":"nm2000522","character":" Lookout","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Langley Kirkwood","urlProfile":"http://www.imdb.com/name/nm0456810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjAyMzMwOV5BMl5BanBnXkFtZTgwNTQ0MDk5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1973","placeOfBirth":" England, UK","height":"6' 0¾\" (1.85 m)","bio":"Langley Kirkwood was born in Bromley, Kent, England, UK. His family moved to South Africa when Kirkwood was young. The son of a poet and an art teacher, he was exposed to literature and the arts from an early age and fell in love with acting in his school years. He studied drama at high school and at Johannesburg's Wits University, and started working in theatre immediately thereafter. He made an award-winning debut at Johannesburg's Market Theatre as Billy the Kid and followed that up by award-nominated performances in other theatre productions in both Johannesburg and Cape Town, and winning another award as Biff Loman in Miller's Death of a Salesman. He had two children, Willow and Phoenix with former Calvin Klein model Josie Borain. He lives in Cape Town and works primarily in film and television, but still finds time for theatre and also works as a voice-artist. He is a fitness fanatic and spends much of his free time trail running, cycling and competing in ultra distance races.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjAyMzMwOV5BMl5BanBnXkFtZTgwNTQ0MDk5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0456810","name":"Langley Kirkwood","idIMDB":"nm0456810"},"actorId":"nm0456810","character":" Bill Granger","urlCharacter":"http://www.imdb.com/character/ch0258307","main":true},{"actorName":"Kira Wilkenson","urlProfile":"http://www.imdb.com/name/nm2223429","urlPhoto":"","biography":{"bio":"Kira Wilkenson is an actress, known for Starship Troopers 3: Marauder (2008), The Triangle (2005) and Charlie Jade (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2223429","name":"Kira Wilkenson","idIMDB":"nm2223429"},"actorId":"nm2223429","character":" Cuban Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeremy Crutchley","urlProfile":"http://www.imdb.com/name/nm0190190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmIzNWY3N2YtZTI2ZS00OWZmLTgyYTktZGEzZWNmZjYwNWYxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Jeremy Crutchley is an actor and producer, known for Salem (2014), Lord of War (2005) and Black Sails (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmIzNWY3N2YtZTI2ZS00OWZmLTgyYTktZGEzZWNmZjYwNWYxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0190190","name":"Jeremy Crutchley","idIMDB":"nm0190190"},"actorId":"nm0190190","character":" Balsam","urlCharacter":"http://www.imdb.com/character/ch0258305","main":true},{"actorName":"David Sherwood","urlProfile":"http://www.imdb.com/name/nm0792807","urlPhoto":"","biography":{"bio":"David Sherwood is an actor, known for Diana (2013), Cold Harvest (1999) and Steel Dawn (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0792807","name":"David Sherwood","idIMDB":"nm0792807"},"actorId":"nm0792807","character":" Dr. Brennert","urlCharacter":"http://www.imdb.com/character/ch0517702","main":true},{"actorName":"Brent Palmer","urlProfile":"http://www.imdb.com/name/nm1468397","urlPhoto":"","biography":{"bio":"Brent Palmer is an actor and director, known for Drôles d'oiseaux (2012), Flood (2007) and Mercenary for Justice (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1468397","name":"Brent Palmer","idIMDB":"nm1468397"},"actorId":"nm1468397","character":" Pilot - Weather Seeker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelsey Brown","urlProfile":"http://www.imdb.com/name/nm2109048","urlPhoto":"","biography":{"birthName":"Kelsey Lynne Brown","height":"5' 4\" (1.63 m)","bio":"Kelsey played golf in high school and was the baseball manager. Her favorite color is purple. Her parents divorced when she was five and she has one real sister Kyla. Her mom remarried and had two more kids, Brayton and Jaidyn. Her dad also remarried and has two more children, Mallory and Logan. She is going to be in an upcoming TV show that is based off the book \"This Lullaby\" by Sarah Dessen.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2109048","name":"Kelsey Brown","nicknames":["Klynne"],"idIMDB":"nm2109048"},"actorId":"nm2109048","character":" Young Heather","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[{"yearSeason":2005,"episodes":[{"episode":1,"title":"Episode #1.1","date":"5 Dec. 2005","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1614295","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRiZjE1NjItYTRiMi00YTc3LWI2MDgtZGEwMTZhMGEwOWNkXkEyXkFqcGdeQXVyMTg5Mzk4Nzg@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":2,"title":"Episode #1.2","date":"6 Dec. 2005","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1614296"},{"episode":3,"title":"Episode #1.3","date":"7 Dec. 2005","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1614297"}]},{"yearSeason":2005,"episodes":[{"episode":1,"title":"Episode #1.1","date":"5 Dec. 2005","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1614295","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRiZjE1NjItYTRiMi00YTc3LWI2MDgtZGEwMTZhMGEwOWNkXkEyXkFqcGdeQXVyMTg5Mzk4Nzg@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":2,"title":"Episode #1.2","date":"6 Dec. 2005","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1614296"},{"episode":3,"title":"Episode #1.3","date":"7 Dec. 2005","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1614297"}]}],"idIMDB":"tt0452573","urlIMDB":"http://www.imdb.com/title/tt0452573","business":{"budget":{"money":"$22,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[null,null],"copyrightHolder":"© 2005 Electric Holdings (Triangle), Inc."},"technical":{"runtime":["4 hr (240 min) (6 parts) (Israel)","4 hr (240 min) (3 parts) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.6","filmingLocations":[{"location":"Cape Town, Western Cape, South Africa"}],"awards":[{"award":"Primetime Emmy Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won Primetime Emmy","categories":[{"category":"Outstanding Special Visual Effects for a Miniseries, Movie or a Special","names":[{"name":"Marc Weigert","id":"nm0917846","role":"visual effects supervisor"},{"name":"Volker Engel","id":"nm0257159","role":"visual effects supervisor"},{"name":"Ingo Putze","id":"nm1806973","role":"lead visual effects compositor"},{"name":"Robin Scott Graham","id":"nm1706544","role":"visual effects compositing technical director"},{"name":"Todd Sheridan Perry","id":"nm0675332","role":"senior cg technical director"},{"name":"Conrad Murrey","id":"nm2644343","role":"lead cg animator"},{"name":"Sam Khorshid","id":"nm2673121","role":"cg animator"},{"name":"Paul Graff","id":"nm0333794","role":"visual effects compositor"},{"name":"Ben Grossmann","id":"nm1322973","role":"visual effects compositor"},{"name":"Syfy","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Main Title Design","names":[{"name":"Garson Yu","id":"nm0950490","role":"creative director/designer"},{"name":"Yolanda Santosa","id":"nm2054407","role":"art director/designer"},{"name":"Robert Cribbett","id":"nm0187752","role":"compositor/designer"},{"name":"Nate Homan","id":"nm2675173","role":"animator/designer"}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2006","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Television Presentation","names":[]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Supporting Actor on Television","names":[{"name":"Sam Neill","id":"nm0000554","role":null}]},{"category":"Best Supporting Actress on Television","names":[{"name":"Catherine Bell","id":"nm0004738","role":null}]}]}]},{"award":"Casting Society of America, USA 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Mini Series Casting","names":[{"name":"Janet Gilmore","id":"nm0319536","role":null},{"name":"Megan McConnell","id":"nm0566296","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing in Television Long Form - Music","names":[{"name":"Jason Ruder","id":"nm1720819","role":"music editor"}]}]}]},{"award":"Online Film & Television Association 2005","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Television Award","categories":[{"category":"Best Miniseries","names":[]}]}]}],"votes":"7,455","type":"TV Mini-Series","companyCreditsSimple":[{"idCompany":"co0057712","name":"Bad Hat Harry Productions"},{"idCompany":"co0043107","name":"British Broadcasting Corporation (BBC)"},{"idCompany":"co0003899","name":"Electric Entertainment"}],"keywords":{"keywords":["bermuda triangle","scientist","greenpeace","philadelphia experiment","billionaire","alternate reality","fired from the job","tv mini series","underwater scene","u boat","storm","speedboat","semiautomatic pistol","helicopter crash","florida","decision","child in peril","car off bridge","car in water","artificial leg","wormhole","submarine","son","pizza","pendant","old woman","little girl","kiss","helicopter","cross","corpse","car radio","atlantic ocean","airboat","space time","sinking boat","u.s. secretary of the navy","secret military operation","airplane crash","mother daughter relationship","military facility","loss of brother","government coverup","ex husband ex wife relationship","disaster","babe scientist","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:03:18"}}