{"data":{"movies":[{"title":"Æon Flux","originalTitle":"","year":"2005","releaseDate":"20051202","directors":[{"name":"Karyn Kusama","id":"nm0476201"}],"writers":[{"name":"Phil Hay","id":"nm0006534"},{"name":"Matt Manfredi","id":"nm0542062"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2Mzg0NjA2N15BMl5BanBnXkFtZTcwOTc5NjQzMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi"],"plot":"400 years in the future, set in the year 2415, Aeon Flux is a mysterious assassin. Four centuries after a virus nearly annihilated the human race, leaving only five million survivors in a utopian city called Bregna. Aeon is struggling to destroy the Goodchild regime led by its namesake, Trevor Goodchild, the ruler of Bregna and a descendant of the man who found a cure for the deadly virus. As instructed by the Handler, Aeon is assigned to assassinate Goodchild, but there are deeper secrets to be discovered, and conspiracies to be foiled.","simplePlot":"Aeon Flux is a mysterious assassin working for the Monicans, a group of rebels trying to overthrow the government. When she is sent on a mission to kill the Chairman, a whole new mystery is found.","actors":[{"actorName":"Charlize Theron","urlProfile":"http://www.imdb.com/name/nm0000234","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5Mzc4ODU0Ml5BMl5BanBnXkFtZTcwNjU1NTI0Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1975","placeOfBirth":" Benoni, Transvaal, South Africa","height":"5' 9½\" (1.77 m)","bio":"Charlize Theron was born in Benoni, a city in the greater Johannesburg-area, in South Africa, the only child of Gerda Theron (née Gerda Jacoba Aletta Maritz) and Charles Jacobus Theron. She was raised on a farm outside the city. Theron is of Afrikaner (Dutch, with some French Huguenot and German) descent, and Afrikaner military figure Danie Theron was her great-great-uncle. Theron received an education as a ballet dancer and has danced both the \"Swan Lake\" and \"The Nutcracker\". There was not much for a young actress or dancer to do in South Africa, so she soon traveled to Europe and the United States, where she got job at the Joffrey Ballet in New York. She was also able to work as a photo model. However, an injured knee put a halt to her dancing career. In 1994, her mother bought her a one-way ticket to Los Angeles, and Charlize started visiting all of the agents on Hollywood Boulevard, but without any luck. She went to a bank to cash a check for $500 she received from her mother, and became furious when she learned that the bank would not cash it because it was an out-of-state check. She made a scene and an agent gave her his card, in exchange for learning American English, which she did by watching soap operas on television. Her first role was as a young mother in a park in a B-film in 1995, but it was a non-speaking role with three seconds of screen time. Her next role was as Helga Svelgen in 2 Days in the Valley (1996), which landed her the role of Tina Powers in That Thing You Do! (1996). Since then, she has starred in movies like The Devil's Advocate (1997), Mighty Joe Young (1998), The Cider House Rules (1999), The Legend of Bagger Vance (2000) and The Italian Job (2003). On February 29, 2004, she won her first Academy Award, for her performance in Monster (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5Mzc4ODU0Ml5BMl5BanBnXkFtZTcwNjU1NTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000234","name":"Charlize Theron","nicknames":["Charlie"],"idIMDB":"nm0000234"},"actorId":"nm0000234","character":"Aeon Flux","urlCharacter":"http://www.imdb.com/character/ch0006966","main":true},{"actorName":"Marton Csokas","urlProfile":"http://www.imdb.com/name/nm0190744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTcyNDEyMV5BMl5BanBnXkFtZTgwMjMzMzYyNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1966","placeOfBirth":" Invercargill, New Zealand","height":"6' 1¼\" (1.86 m)","bio":"Marton was born in Invercargill, Aotearoa, to Margaret Christine (Rayner), a nurse, and Márton Csókás, a mechanical engineer. His father is Hungarian and his mother is Australian (of English, Irish, and Danish origin). He inherited some of his talents from his father, a trained opera singer and at one time, a trapeze artist in the Hungarian Circus. His academic training began at Canterbury University, Christchurch, New Zealand, where he commenced a Bachelor of Arts degree, majoring in Art History, and then transferred to, Te Kura Toi Whakaari o Aotearoa/ The New Zealand Drama School, graduating in December, 1989. His first acting role was in Te Whanau a Tuanui Jones by Apairana Taylor at the Taki Rua Theatre in Wellington New Zealand, (1990). He has since had an eclectic career of theatre, television and film. He appeared in the 1994 movie Jack Brown Genius (1996) in which he played the role of Dennis. After starring for 2 years in the New Zealand soap opera Shortland Street (1992), he starred in the 1996 movie Broken English (1996) as Darko. After performing in a great number of theatrical plays, writing his own and co-founding his own theatre company, the Stronghold Theatre, Marton got the role of Tarlus in an episode of Hercules: The Legendary Journeys (1995). After that, he continued working with Renaissance Pictures, playing the roles of Khrafstar and Borias in the 1997-1998 seasons of Xena: Warrior Princess (1995). He continued appearing in many other shows in both NZ and Australia, such as Farscape (1999), BeastMaster, le dernier des survivants (1999), Brigade des mers (1996), Cleopatra 2525 (2000), and more, returning for the role of Borias in three episodes of the 2000-2001 season of Xena: Warrior Princess (1995). He was also in many movies produced in NZ and Australia, such as Hurrah (1998), Cercle intime (2000) and the mini-series The Farm (2001). He is a citizen of the European Union and Hungary, and is a permanent resident of the United States. Most recently, Csokas starred opposite Denzel Washington in Sony's hit film The Equalizer. He played a brutal fixer for the Russian mafia and a formidable villain to Washington's reluctant hero. Csokas appeared in Darren Aronofsky's Noah as well as Robert Rodriguez's Sin City: A Dame to Kill For, a sequel to the 2005 hit film Sin City. Csokas also played the psychiatrist, \"Dr. Kafka,\" in the hit movie sequel, The Amazing Spiderman 2, alongside Andrew Garfield, Emma Stone and Jamie Foxx. Csokas most famously starred as \"Lord Celeborn\" in one of the highest-grossing film series of all time, Peter Jackson's Lord of the Rings trilogy. Some of his other film credits include 2010's The Debt opposite Jessica Chastain and Paul Greengrass' The Bourne Supremacy with Matt Damon. His depth of experience is illustrated in Asylum in which he starred opposite Natasha Richardson and Ian McKellen, as well as the Ridley Scott epic, Kingdom of Heaven, with Jeremy Irons, Brendan Gleeson and Liam Neeson. On the small screen, Csokas recently starred on the History Channel's miniseries Sons of Liberty as well as Discovery Channel's miniseries Klondike with Tim Roth and Sam Shepard. On stage, Csokas continues to work internationally, most recently starring in a production of Lillian Hellman's \"Little Foxes\" at The New York Theatre Workshop by acclaimed director, Ivo van Hove. The play was noted by Time Magazine as one of the \"Top 10 of Everything of 2010.\" The actor has numerous classical credits, including 'Orsino' in Shakespeare's \"Twelfth Night\" at the National Theatre of Great Britain, 'Anthony' in \"Anthony and Cleopatra\" at the Theatre of a New Audience, 'Brutus' in \"Julius Caesar\" and as 'Septimus' in Tom Stoppard's \"Arcadia\" in his birthplace of New Zealand. On the Australian stage, Csokas has appeared as 'George' in \"Who's Afraid of Virginia Woolf,\" directed by Benedict Andrews of the Schaubuhne Theatre in Berlin and in \"Riflemind,\" directed by Phillip Seymour Hoffman at the Sydney Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTcyNDEyMV5BMl5BanBnXkFtZTgwMjMzMzYyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0190744","name":"Marton Csokas","idIMDB":"nm0190744"},"actorId":"nm0190744","character":"Trevor Goodchild","urlCharacter":"http://www.imdb.com/character/ch0006970","main":true},{"actorName":"Jonny Lee Miller","urlProfile":"http://www.imdb.com/name/nm0001538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMjc0NTA2M15BMl5BanBnXkFtZTcwMTA4MzQ2OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1972","placeOfBirth":" Kingston upon Thames, Surrey, England, UK","birthName":"Jonathan Lee Miller","height":"5' 9¾\" (1.77 m)","bio":"Jonny Lee Miller (sometimes credited with an H) was born on November 15, 1972, in Kingston, England, UK, to actors Anna Lee and Alan Miller, and the grandson of actor Bernard Lee. After appearing in many high school plays at his selective state grammar school, Johnny dropped out at 17, to pursue acting full time. Although he was reportedly quiet and shy in high school, he certainly expresses himself well in all his films. His very first popular film was Hackers (1995), alongside Angelina Jolie and Matthew Lillard. Later his co-star Angelina became his wife. They were divorced 4 years later. Interesting fact is that his entire family is well into acting, all the way back to his grandparents. He has a partnership in the production company, Natural Nylon, which also includes Ewan McGregor and Jude Law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMjc0NTA2M15BMl5BanBnXkFtZTcwMTA4MzQ2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001538","name":"Jonny Lee Miller","idIMDB":"nm0001538"},"actorId":"nm0001538","character":"Oren Goodchild","urlCharacter":"http://www.imdb.com/character/ch0049610","main":true},{"actorName":"Sophie Okonedo","urlProfile":"http://www.imdb.com/name/nm0645683","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDI3MzI0N15BMl5BanBnXkFtZTcwMTQzMzM5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1968","placeOfBirth":" London, England, UK","height":"5' 8\" (1.73 m)","bio":"Sophie Okonedo was born on August 11, 1968 in London, England. She is an actress, known for After Earth (2013), Hotel Rwanda (2004) and Ace Ventura: When Nature Calls (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDI3MzI0N15BMl5BanBnXkFtZTcwMTQzMzM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0645683","name":"Sophie Okonedo","idIMDB":"nm0645683"},"actorId":"nm0645683","character":"Sithandra","urlCharacter":"http://www.imdb.com/character/ch0006982","main":true},{"actorName":"Frances McDormand","urlProfile":"http://www.imdb.com/name/nm0000531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzgxNjYzOF5BMl5BanBnXkFtZTgwNTIxMjExNzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1957","placeOfBirth":" Chicago, Illinois, USA","birthName":"Frances Louise McDormand","height":"5' 5\" (1.65 m)","bio":"Frances Louise McDormand was born on June 23, 1957 in Chicago, Illinois. She was adopted by Canadian-born parents Noreen Eloise (Nickleson), a nurse from Ontario, and Vernon Weir McDormand, a minister from Nova Scotia, who raised her in the suburbs of Pittsburgh. She earned her B.A. in Theater from Bethany College in 1979 and her MFA from Yale in 1982. Her career after graduation began onstage, and she has retained her association with the theater throughout her career. She soon obtained prominent roles in movies as well, first starring in Blood Simple. (1984), in which she worked with filmmaker Joel Coen, whom she married that year. She frequently collaborated with Coen and his brother Ethan Coen in their films. McDormand's skilled and versatile acting has been recognized by both the critics and the Academy and, in addition to many critics' awards, she has been nominated for an Academy Award four times - for Mississippi Burning (1988), Fargo (1996) (for which she won the Best Actress Award), Almost Famous (2000) and North Country (2005). Keenly intelligent and possessed of a sharp wit, McDormand is the antithesis of the Hollywood starlet - rather than making every role about Frances McDormand, Frances McDormand dissolves into the characters she plays. Accordingly, she has expressed some reservations about the iconic recognition she has gained from her touching and amusing portrayal of Police Chief Marge Gunderson, the quintessential Minnesota Scandinavian, in Fargo (1996). McDormand and Coen adopted a son, Pedro, who was born in Paraguay, in 1994. They live in Manhattan, New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzgxNjYzOF5BMl5BanBnXkFtZTgwNTIxMjExNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000531","name":"Frances McDormand","nicknames":["Fran"],"idIMDB":"nm0000531"},"actorId":"nm0000531","character":"Handler","urlCharacter":"http://www.imdb.com/character/ch0058082","main":true},{"actorName":"Pete Postlethwaite","urlProfile":"http://www.imdb.com/name/nm0000592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjIxMTQ2NV5BMl5BanBnXkFtZTYwNDQ0NTE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1946","placeOfBirth":" Warrington, Cheshire, England, UK","birthName":"Peter William Postlethwaite","height":"5' 9\" (1.75 m)","bio":"Classically-trained actor Pete Postlethwaite was born Peter William Postlethwaite in 1946 and was a distinguished character actor on stage, TV and film. Growing up in Warrington, Lancashire amid middle-class surroundings, he went to college and while completing his studies developed an interest in theatre, to the chagrin of his family. His father, a laborer, wanted him to find a more secure position in life. A drama teacher initially, he decided to follow his acting instincts full-time and gradually built up an impressive array of classical stage credits via repertory, including the Bristol Old Vic Drama School, and in stints with Liverpool Everyman, Machester Royal Exchange and the Royal Shakespeare Company. By the 80s he was ready to branch out into film and TV, giving a startling performance as a wife abuser in the British film Distant Voices, Still Lives (1988). His highly distinctive features were subsequently put to good use in a number of versatile roles, usually menacing but sometimes humble, and most frequently as working-class types. By 1993 he had crossed over into Hollywood parts and earned his first Oscar nomination for his superb role as Daniel Day-Lewis' father in Au nom du père (1993). Other quality roles came his way with The Usual Suspects (1995), Brassed Off (1996), and Amistad (1997). Television has been a creative and positive venue as well with fine work in Sharpe's Company (1994), Lost for Words (1999) and The Sins (2000). Postlethwaite worked equally both in the UK and abroad, and avoided the public limelight for the most part, living quietly in England. Postlethwaite continued on in films with roles in The Shipping News (2001), The Limit (2004), Dark Water (2005), The Omen (2006), Ghost Son (2007) and Solomon Kane (2009). 2010 was a banner film year for the actor with roles in the popular and/or highly acclaimed films Clash of the Titans (2010), Inception (2010) and The Town (2010). Married and the father of two, Postlewaite died on January 2, 2011, at age 64, following a recurrence of the cancer he had battled two decades earlier.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjIxMTQ2NV5BMl5BanBnXkFtZTYwNDQ0NTE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000592","name":"Pete Postlethwaite","idIMDB":"nm0000592"},"actorId":"nm0000592","character":"Keeper","urlCharacter":"http://www.imdb.com/character/ch0006980","main":true},{"actorName":"Amelia Warner","urlProfile":"http://www.imdb.com/name/nm0912396","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNDQzMjU4NF5BMl5BanBnXkFtZTcwMDM3ODUyMw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1982","placeOfBirth":" Liverpool, Merseyside, England, UK","birthName":"Amelia Catherine Bennett","height":"5' 6\" (1.68 m)","bio":"Amelia Warner was born Amelia Catherine Bennett in Liverpool, England, the only child of English actress Annette Ekblom and Welsh actor Alun Lewis. Her uncle is Welsh actor Hywel Bennett. Relocating to London when she was 4 years old, she studied at the Royal Masonic School for Girls, and then (at 16) the College of Fine Arts. However, her schools did not approve of her taking so much time off for her acting work and so was forced to study for a while at a college in Belsize Park. She was \"discovered\" after she and her friends devised and acted out a play in Covent Garden where she was spotted by an agent and won a place at London Royal Court Theatre's Youth program. Warner had a string of television roles in TV dramas such as Casualty (1986) before making it big with Lorna Doone (2000) and the film Quills (2000), which both came out in the winter of 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNDQzMjU4NF5BMl5BanBnXkFtZTcwMDM3ODUyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912396","name":"Amelia Warner","nicknames":["Millie"],"idIMDB":"nm0912396"},"actorId":"nm0912396","character":"Una Flux","urlCharacter":"http://www.imdb.com/character/ch0006971","main":true},{"actorName":"Caroline Chikezie","urlProfile":"http://www.imdb.com/name/nm0157410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTA0NzMxNF5BMl5BanBnXkFtZTYwMzEzNjgz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1974","placeOfBirth":" London, England, UK","height":"5' 6½\" (1.69 m)","bio":"Caroline Chikezie was born on February 19, 1974 in London, England. She is an actress and producer, known for Æon Flux (2005), Eragon (2006) and The Sweeney (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTA0NzMxNF5BMl5BanBnXkFtZTYwMzEzNjgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0157410","name":"Caroline Chikezie","idIMDB":"nm0157410"},"actorId":"nm0157410","character":"Freya","urlCharacter":"http://www.imdb.com/character/ch0059729","main":true},{"actorName":"Nikolai Kinski","urlProfile":"http://www.imdb.com/name/nm0455895","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE3Mzg0NTk3OV5BMl5BanBnXkFtZTgwMjg3NDI3MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1976","placeOfBirth":" Paris, France","birthName":"Nanhoï Nikolai Kinski","bio":"Nikolai Kinski was born on July 30, 1976 in Paris, France as Nanhoï Nikolai Kinski. He is an actor, known for Æon Flux (2005), Point Break (2015) and Tortilla Soup (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE3Mzg0NTk3OV5BMl5BanBnXkFtZTgwMjg3NDI3MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455895","name":"Nikolai Kinski","idIMDB":"nm0455895"},"actorId":"nm0455895","character":"Claudius","urlCharacter":"http://www.imdb.com/character/ch0129354","main":true},{"actorName":"Paterson Joseph","urlProfile":"http://www.imdb.com/name/nm0430667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzE4OTc4OF5BMl5BanBnXkFtZTcwNDI0NDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1964","placeOfBirth":" London, England, UK","height":"5' 8\" (1.73 m)","bio":"Paterson Joseph was born on June 22, 1964 in London, England. He is known for his work on The Beach (2000), Æon Flux (2005) and Chop Socky Chooks (2007). He is married to Emmanuelle Joseph. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzE4OTc4OF5BMl5BanBnXkFtZTcwNDI0NDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0430667","name":"Paterson Joseph","idIMDB":"nm0430667"},"actorId":"nm0430667","character":"Giroux","urlCharacter":"http://www.imdb.com/character/ch0129355","main":true},{"actorName":"Yangzom Brauen","urlProfile":"http://www.imdb.com/name/nm1062017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTEyMzcwOF5BMl5BanBnXkFtZTcwOTc2Njg5Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1981","placeOfBirth":" Switzerland","height":"5' 8\" (1.73 m)","bio":"Yangzom was born and raised in Bern, the capital of Switzerland. Completing her studies in Europe's prestigious University of Theater and Music in Bern, she started working in independent theater projects in Switzerland and Germany. Shortly thereafter, she was cast and guest-starred in a well-known Swiss sitcom 'Manne Zimmer' for National Swiss Television Network. Yangzom's career would take off establishing her as a well-known actress starring in many Swiss and German TV Shows as well as in movies such as 'Cargo', the first Swiss sci-fi movie and 'Laenger Leben', a Swiss Comedy. She received her Hollywood breakthrough when she won the role of \"Inari\" in the Sci Fi film, Aeon Flux, starring Charlize Theron. She then decided to move to Los Angeles to pursue her acting career in the States. In 2008 she wrote her first book, which became an instant bestseller in Germany and Switzerland 2009-10. 'Across Many Mountains' is a memoir about three generations of Tibetan women: Yangzom's grandmother, her mother and her own story. The book has sold over 500,000 copies in Germany and Switzerland, and was on Europe's Spiegel Bestseller list for over 40 weeks. 'Across Many Mountains' got published in March 2011 in England and Australia with Random House UK. The North American publishers of the book are St.Martin's Press in New York and in France, Press de la cite. The book has been published in 11 languages so far. With her latest short film \"Born in Battle\" about child soldiers she received the well known CICT-UNESCO Enrico Fulchignoni Award as well as the UNESCO Gandhi Medal at the Fribourg Film Festival. \"Born in Battle\" was shown during the UN committee meeting in Geneva with UN Special representative on children and armed conflict. The Short won the audience award at the prestigious Max Ophüls Preis 2016, a leading festival in the European film festival world for new emerging talents.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTEyMzcwOF5BMl5BanBnXkFtZTcwOTc2Njg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1062017","name":"Yangzom Brauen","idIMDB":"nm1062017"},"actorId":"nm1062017","character":"Inari","urlCharacter":"http://www.imdb.com/character/ch0129357","main":true},{"actorName":"Aoibheann O'Hara","urlProfile":"http://www.imdb.com/name/nm2012434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzcyMzUwNV5BMl5BanBnXkFtZTcwOTczNjEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Aoibheann O'Hara is an actress, known for Æon Flux (2005), Fay Grim (2006) and Der Antrag (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzcyMzUwNV5BMl5BanBnXkFtZTcwOTczNjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2012434","name":"Aoibheann O'Hara","idIMDB":"nm2012434"},"actorId":"nm2012434","character":"Scientist","urlCharacter":"http://www.imdb.com/character/ch0217824","main":true},{"actorName":"Thomas Huber","urlProfile":"http://www.imdb.com/name/nm0399411","urlPhoto":"","biography":{"dateOfBirth":"11 July 1963","placeOfBirth":" Munich, Bavaria, West Germany","height":"5' 9¾\" (1.77 m)","bio":"Thomas Huber was born on July 11, 1963 in Munich, Bavaria, West Germany. He is an actor and writer, known for Æon Flux (2005), Grimm Love (2006) and Die Anstalt - Zurück ins Leben (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0399411","name":"Thomas Huber","idIMDB":"nm0399411"},"actorId":"nm0399411","character":"Scientist","urlCharacter":"http://www.imdb.com/character/ch0217824","main":true},{"actorName":"Weijian Liu","urlProfile":"http://www.imdb.com/name/nm0515033","urlPhoto":"","biography":{"dateOfBirth":"26 November 1956","placeOfBirth":" Shanghai, China","height":"5' 10½\" (1.79 m)","bio":"Weijian Liu was born on November 26, 1956 in Shanghai, China. He is an actor, known for Æon Flux (2005), Killer Condom (1996) and Amerika (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0515033","name":"Weijian Liu","idIMDB":"nm0515033"},"actorId":"nm0515033","character":"Scientist","urlCharacter":"http://www.imdb.com/character/ch0217824","main":true},{"actorName":"Maverick Quek","urlProfile":"http://www.imdb.com/name/nm0703058","urlPhoto":"","biography":{"dateOfBirth":"30 December 1963","placeOfBirth":" Singapore","height":"5' 7¾\" (1.72 m)","bio":"Maverick Quek was born on December 30, 1963 in Singapore. He is an actor, known for Æon Flux (2005), Berlin, Berlin (2002) and Soul Kitchen (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0703058","name":"Maverick Quek","idIMDB":"nm0703058"},"actorId":"nm0703058","character":"Chemist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0402022","urlIMDB":"http://www.imdb.com/title/tt0402022","business":{"budget":{"money":"$62,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$12,661,112","country":"USA","day":"04","month":"12","year":"2005","remarks":""},{"money":"£512,426","country":"UK","day":"19","month":"02","year":"2006","remarks":"271 Screens"},{"money":"MYR 688,136","country":"Malaysia","day":"04","month":"12","year":"2005","remarks":"36 Screens"},{"money":"€46,512","country":"Netherlands","day":"26","month":"02","year":"2006","remarks":"10 Screens"},{"money":"RUR 25,878,026","country":"Russia","day":"04","month":"12","year":"2005","remarks":"240 Screens"},{"money":"SGD 349,317","country":"Singapore","day":"04","month":"12","year":"2005","remarks":"26 Screens"},{"money":"THB 8,592,305","country":"Thailand","day":"04","month":"12","year":"2005","remarks":"73 Screens"}],"gross":[{"money":"$25,857,987","country":"USA","day":"05","month":"02","year":"2006","remarks":""},{"money":"$25,778,287","country":"USA","day":"29","month":"01","year":"2006","remarks":""},{"money":"$25,642,277","country":"USA","day":"22","month":"01","year":"2006","remarks":""},{"money":"$25,466,637","country":"USA","day":"15","month":"01","year":"2006","remarks":""},{"money":"$25,204,115","country":"USA","day":"08","month":"01","year":"2006","remarks":""},{"money":"$25,014,475","country":"USA","day":"01","month":"01","year":"2006","remarks":""},{"money":"$24,523,382","country":"USA","day":"25","month":"12","year":"2005","remarks":""},{"money":"$23,215,672","country":"USA","day":"18","month":"12","year":"2005","remarks":""},{"money":"$20,218,288","country":"USA","day":"11","month":"12","year":"2005","remarks":""},{"money":"$12,661,112","country":"USA","day":"04","month":"12","year":"2005","remarks":""},{"money":"£961,020","country":"UK","day":"26","month":"02","year":"2006","remarks":""},{"money":"£512,426","country":"UK","day":"19","month":"02","year":"2006","remarks":""},{"money":"MYR 688,136","country":"Malaysia","day":"04","month":"12","year":"2005","remarks":""},{"money":"€46,512","country":"Netherlands","day":"26","month":"02","year":"2006","remarks":""},{"money":"RUR 60,208,743","country":"Russia","day":"18","month":"12","year":"2005","remarks":""},{"money":"RUR 56,041,895","country":"Russia","day":"11","month":"12","year":"2005","remarks":""},{"money":"RUR 29,444,371","country":"Russia","day":"04","month":"12","year":"2005","remarks":""},{"money":"SGD 349,317","country":"Singapore","day":"04","month":"12","year":"2005","remarks":""}],"weekendGross":[{"money":"$42,114","country":"USA","day":"05","month":"02","year":"2006","remarks":"114 Screens"},{"money":"$91,068","country":"USA","day":"29","month":"01","year":"2006","remarks":"177 Screens"},{"money":"$127,322","country":"USA","day":"22","month":"01","year":"2006","remarks":"227 Screens"},{"money":"$222,037","country":"USA","day":"15","month":"01","year":"2006","remarks":"267 Screens"},{"money":"$104,195","country":"USA","day":"08","month":"01","year":"2006","remarks":""},{"money":"$306,922","country":"USA","day":"01","month":"01","year":"2006","remarks":""},{"money":"$452,813","country":"USA","day":"25","month":"12","year":"2005","remarks":"852 Screens"},{"money":"$1,751,220","country":"USA","day":"18","month":"12","year":"2005","remarks":""},{"money":"$4,561,619","country":"USA","day":"11","month":"12","year":"2005","remarks":""},{"money":"$12,661,112","country":"USA","day":"04","month":"12","year":"2005","remarks":""},{"money":"£184,053","country":"UK","day":"26","month":"02","year":"2006","remarks":"267 Screens"},{"money":"£512,426","country":"UK","day":"19","month":"02","year":"2006","remarks":"271 Screens"},{"money":"MYR 688,136","country":"Malaysia","day":"04","month":"12","year":"2005","remarks":"36 Screens"},{"money":"€46,512","country":"Netherlands","day":"26","month":"02","year":"2006","remarks":"10 Screens"},{"money":"RUR 3,070,379","country":"Russia","day":"18","month":"12","year":"2005","remarks":""},{"money":"RUR 15,748,354","country":"Russia","day":"11","month":"12","year":"2005","remarks":"240 Screens"},{"money":"RUR 25,878,026","country":"Russia","day":"04","month":"12","year":"2005","remarks":"240 Screens"}],"admissions":[{"money":"14,620","country":"Netherlands","day":"31","month":"12","year":"2006","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"08","year":"2004","remarks":null},null],"copyrightHolder":"Paramount Pictures Corporation"},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Cooke S4, Varotal and Angenieux Optimo Lenses","Arricam ST, Cooke S4, Varotal and Angenieux Optimo Lenses","Arriflex 435 ES, Cooke S4, Varotal and Angenieux Optimo Lenses"],"laboratory":["EFilm (digital intermediate)","DeLuxe"],"filmLength":["2,558 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 200T 5217, Vision2 500T 5218)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (also 3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"5.5","metascore":"36","filmingLocations":[{"location":"Germany"}],"rated":"PG-13","awards":[{"award":"Golden Trailer Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Fleece","categories":[{"category":"","names":[]}]},{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Voice Over","names":[]}]}]},{"award":"The Stinkers Bad Movie Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Actress","names":[{"name":"Charlize Theron","id":"nm0000234","role":null}]},{"category":"Worst Supporting Actor","names":[{"name":"Jonny Lee Miller","id":"nm0001538","role":null},{"name":"Mindhunters","id":"tt0297284","role":null}]}]}]}],"votes":"112,806","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0005323","name":"Lakeshore Entertainment"},{"idCompany":"co0092570","name":"Valhalla Motion Pictures"}],"keywords":{"keywords":["future","disease","f rated","female hero","based on cult favorite","female protagonist","25th century","cyberpunk","sabotage","explosion","shootout","title directed by female","fistfight","brawl","hand to hand combat","stylized violence","gun fu","tough girl","one against many","one woman army","dual wield","dystopia","surrealism","women fight","female nudity","terrorist","terrorist plot","terrorist group","terrorism","terror attack","action heroine","wilhelm scream","superheroine","sniper","sniper rifle","sister sister relationship","infertility","husband wife relationship","heroine","cloning","assassination attempt","dark heroine","femme fatale","double agent","counter espionage","secret agent","weapon","martial art","martial arts","spy","spy hero","rifle","pistol","lust","love","handgun","gun","espionage","dictator","cleavage","breasts","based on tv series","based on cartoon","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:34:04"}}