{"data":{"movies":[{"title":"La ferme en folie","originalTitle":"Barnyard","year":"2006","releaseDate":"20060804","directors":[{"name":"Steve Oedekerk","id":"nm0644203"}],"writers":[{"name":"Steve Oedekerk","id":"nm0644203"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDE0ODYyNF5BMl5BanBnXkFtZTcwNjQ3NzAzMQ@@._V1.jpg","countries":["Germany","USA","Netherlands"],"languages":["English"],"genres":["Animation","Comedy","Family"],"plot":"When the farmer's away, all the animals play ... and sing, and dance. Eventually, though, someone has to step in and run things, a responsibility that ends up going to Otis, a carefree cow.","simplePlot":"When the farmer's away, all the animals play ... and sing, and dance. Eventually, though, someone has to step in and run things, a responsibility that ends up going to Otis, a carefree cow.","actors":[{"actorName":"Kevin James","urlProfile":"http://www.imdb.com/name/nm0416673","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTU1ODU4Ml5BMl5BanBnXkFtZTcwNDQ0NTY5NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1965","placeOfBirth":" Stony Brook, New York, USA","birthName":"Kevin George Knipfing","height":"5' 10\" (1.78 m)","bio":"Kevin James was born Kevin George Knipfing on April 26, 1965, in Mineola, New York, to Janet, an office worker, and Joseph Valentine Knipfing, Jr., an insurance agency owner. He has German ancestry. James attended SUNY Cortland where he played fullback on the football team while majoring in sports management. He realized after 3 years that this wasn't the path for him. After returning home, he decided to break up the monotony of the summer, and joined a community theater. During a play in which he had a comedic role, he so enjoyed the crowd reaction, that he joined his brother's (comedian Gary Valentine's) improv group. He began going to clubs with Gary and realized he, too, had the knack for comedy. He has performed stand-up up for about 11 years. It was on the comedy circuit that he met Ray Romano. While Ray was getting a big break with his own sitcom, Kevin was getting recognition on Star Search (1983). After appearing on The Tonight Show with Jay Leno (1992), his big break came at the 1996 \"Just for Laughs\" Montreal Comedy Festival. Afterward, he landed a recurring role on Ray's sitcom, Everybody Loves Raymond (1996). He starred in his own sitcom, The King of Queens (1998), as Doug Heffernan, from 1998 to 2007, and later began a career as a leading film actor, co-starring in Hitch (2005), I Now Pronounce You Chuck & Larry (2007), Grown Ups (2010), and Grown Ups 2 (2013), and headlining Paul Blart: Mall Cop (2009), Zookeeper (2011), Here Comes the Boom (2012), and Paul Blart: Mall Cop 2 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTU1ODU4Ml5BMl5BanBnXkFtZTcwNDQ0NTY5NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0416673","name":"Kevin James","idIMDB":"nm0416673"},"actorId":"nm0416673","character":"Otis the Cow","urlCharacter":"http://www.imdb.com/character/ch0046586","main":true},{"actorName":"Courteney Cox","urlProfile":"http://www.imdb.com/name/nm0001073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4OTczNDExNDNeQTJeQWpwZ15BbWU3MDUyNTIzMTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1964","placeOfBirth":" Birmingham, Alabama, USA","birthName":"Courteney Bass Cox","height":"5' 5\" (1.65 m)","bio":"Courteney Cox was born on June 15th, 1964 in Birmingham, Alabama, into an affluent Southern family. She is the daughter of Courteney (Bass) and Richard Lewis Cox (1930-2001), a businessman. She was the baby of the family with two older sisters (Virginia and Dottie) and an older brother, Richard, Jr. She was raised in an exclusive society town, Mountain Brook, Alabama. Courteney was the archetypal daddy's girl, and therefore was understandably devastated when, in 1974, her parents divorced, and her father moved to Florida. She became a rebellious teen, and did not make things easy for her mother, and new stepfather, New York businessman Hunter Copeland. Now, she is great friends with both. She attended Mountain Brook High School, where she was a cheerleader, tennis player and swimmer. In her final year, she received her first taste of modeling. She appeared in an advert for the store, Parisians. Upon graduation, she left Alabama to study architecture and interior design at Mount Vernon College. After one year she dropped out to a pursue a modeling career in New York, after being signed by the prestigious Ford Modelling Agency. She appeared on the covers of teen magazines such as Tiger Beat and Little Miss, plus numerous romance novels. She then moved on to commercials for Maybeline, Noxema, New York Telephone Company and Tampax. While modeling, she attended acting classes, as her real dream and ambition was to be an actress. In 1984, she landed herself a small part in one episode of As the World Turns (1956) as a young débutante named Bunny. Her first big break, however, was being cast by Brian De Palma in the Bruce Springsteen video \"Dancing in The Dark\". In 1985, she moved to LA to star alongside Dean Paul Martin in Misfits of Science (1985). It was a flop, but a few years later, she was chosen out of thousands of hopefuls to play Michael J. Fox's girlfriend, psychology major Lauren Miller in Family Ties (1982). In 1989, Family Ties (1982) ended, and Cox went through a lean spell in her career, featuring in unmemorable movies such as Mr. Destiny (1990) with Michael Caine. Fortunes changed dramatically for Cox, when in 1994, she starred alongside Jim Carrey in the unexpected hit Ace Ventura: Pet Detective (1994), and a year later she was cast as Monica Geller on the hugely successful sitcom Friends (1994). It was this part that turned her into an international superstar and led to an American Comedy Award nomination. In 1996 Cox starred in Wes Craven's horror/comedy Scream (1996) . This movie grossed over $100 million at the box office, and won Cox rave reviews for her standout performance as the wickedly bitchy and smug TV reporter Gale Weathers. She went on to play this character again in each of the three sequels. Not only did her involvement in this movie lead to critical acclaim, but it also led to her meeting actor husband David Arquette. He played her on-screen love interest Dewey, and life imitated art as the two fell in love for real. Their wedding took place in San Francisco, at the historic Grace Cathedral atop Nob Hill, on June 12th, 1999. Joined by 200 guests, including Cox's film star friends Liam Neeson and Kevin Spacey, the happy couple finally became Mr. and Mrs. Arquette.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4OTczNDExNDNeQTJeQWpwZ15BbWU3MDUyNTIzMTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001073","name":"Courteney Cox","nicknames":["CeCe","Coco"],"idIMDB":"nm0001073"},"actorId":"nm0001073","character":"Daisy the Cow","urlCharacter":"http://www.imdb.com/character/ch0024453","main":true},{"actorName":"Sam Elliott","urlProfile":"http://www.imdb.com/name/nm0000385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTk4NDgzMl5BMl5BanBnXkFtZTYwNjU5Nzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1944","placeOfBirth":" Sacramento, California, USA","birthName":"Samuel Pack Elliott","height":"6' 2\" (1.88 m)","bio":"Tall, thin, wiry Sam Elliott is the classic picture of the American cowboy. Elliott began his acting career on the stage and his film debut was in Butch Cassidy and the Sundance Kid (1969). Although his future wife, Katharine Ross co-starred in the film, the two did not meet until they filmed The Legacy (1978) Together. Over the years there would be few opportunities to act in feature westerns, but it would be television that gave him that opportunity, in The Sacketts (1979), The Shadow Riders (1982) and The Yellow Rose (1983), among others. He would also work in non-westerns, usually as a tough guy, as in Lifeguard (1976) and Road House (1989). In the 1990s, Elliott was back on the western trail, playing everyone from Brig. Gen. John Buford in the film Gettysburg (1993) to Wild Bill Hickok in the made-for-TV movie Buffalo Girls (1995). In 1991 he wrote the screenplay and co-starred with his wife in the made-for-TV western Conagher (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTk4NDgzMl5BMl5BanBnXkFtZTYwNjU5Nzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000385","name":"Sam Elliott","idIMDB":"nm0000385"},"actorId":"nm0000385","character":"Ben the Cow","urlCharacter":"http://www.imdb.com/character/ch0024455","main":true},{"actorName":"Danny Glover","urlProfile":"http://www.imdb.com/name/nm0000418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1946","placeOfBirth":" San Francisco, California, USA","birthName":"Danny Lebern Glover","height":"6' 4\" (1.93 m)","bio":"Actor, producer and humanitarian Danny Glover has been a commanding presence on screen, stage and television for more than 25 years. Glover was born in San Francisco, California, to Carrie (Hunley) and James Glover, postal workers who were also active in civil rights. Glover trained at the Black Actors' Workshop of the American Conservatory Theater. It was his Broadway debut in Fugard's Master Harold...and the Boys, which brought him to national recognition and led director Robert Benton to cast Glover in his first leading role in 1984's Oscar®-nominated Best Picture Places in the Heart. The following year, Glover starred in two more Best Picture nominees: Peter Weir's Witness and Steven Spielberg's The Color Purple. In 1987, Glover partnered with Mel Gibson in the first Lethal Weapon film and went on to star in three hugely successful Lethal Weapon sequels. Glover has also invested his talents in more personal projects, including the award-winning To Sleep With Anger, which he executive produced and for which he won an Independent Spirit Award for Best Actor; Bopha!; Manderlay; Missing in America; and the film version of Athol Fugard's play Boesman and Lena. On the small screen, Glover won an Image Award and a Cable ACE Award and earned an Emmy nomination for his performance in the title role of the HBO movie Mandela. He has also received Emmy nominations for his work in the acclaimed miniseries Lonesome Dove and the telefilm Freedom Song. As a director, he earned a Daytime Emmy nomination for Showtime's Just a Dream. Glover's film credits range from the blockbuster Lethal Weapon franchise to smaller independent features, some of which Glover also produced. He co-starred in the critically acclaimed feature Dreamgirls directed by Bill Condon and in Po' Boy's Game for director Clement Virgo. He appeared in the hit feature Shooter for director Antoine Fuqua, Honeydripper for director John Sayles, and Be Kind, Rewind for director Michel Gondry. Glover has also gained respect for his wide-reaching community activism and philanthropic efforts, with a particular emphasis on advocacy for economic justice, and access to health care and education programs in the United States and Africa. For these efforts, Glover received a 2006 DGA Honor. Internationally, Glover has served as a Goodwill Ambassador for the United Nations Development Program from 1998-2004, focusing on issues of poverty, disease, and economic development in Africa, Latin America, and the Caribbean, and serves as UNICEF Ambassador. In 2005, Glover co-founded Louverture Films dedicated to the development and production of films of historical relevance, social purpose, commercial value and artistic integrity. The New York based company has a slate of progressive features and documentaries including Trouble the Water, which won the Grand Jury Prize at the 2008 Sundance Film Festival, Africa Unite, award winning feature Bamako, and most recent projects Uncle Boonmee Who Can Recall His Past Lives, and The Disappearance of McKinley Nolan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000418","name":"Danny Glover","idIMDB":"nm0000418"},"actorId":"nm0000418","character":"Miles the Mule","urlCharacter":"http://www.imdb.com/character/ch0106092","main":true},{"actorName":"Wanda Sykes","urlProfile":"http://www.imdb.com/name/nm0843100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTUxNzYyNV5BMl5BanBnXkFtZTcwNzgyNjQ3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1964","placeOfBirth":" Portsmouth, Virginia, USA","birthName":"Wanda Y'vette Sykes","height":"5' 2\" (1.57 m)","bio":"Wanda Sykes has been called one of the funniest stand-up comics by her peers and ranks among Entertainment Weekly's 25 Funniest People in America. Her smart-witted stand-up has sent her career in many different areas. She was recently seen in Comedy Central's Wanda Does It (2004), where she tried various non-showbiz jobs. Her first book, \"Yeah I Said It,\" published by Simon and Schuster, hit bookstores in September 2004, which is a hilarious collection of essays touching on life, family, and current events. In 2003, she was seen on Fox's Wanda at Large (2003), in which she wrote, produced, and starred. She also has a one-hour Comedy Central special called Wanda Sykes: Tongue Untied (2003). In addition, she can be seen on HBO's Curb Your Enthusiasm (2000) or heard on Comedy Central's Crank Yankers (2002) as the voice of Gladys Murphy. Wanda was born in Portsmouth, Virginia, and raised in Maryland, the daughter of Marion Louise (Peoples), a banker, and Harry Ellsworth Sykes, a US Army colonel. She graduated with a Bachelor of Science degree from Hampton University. Her stand-up career began at a Coors Light Super talent Showcase in Washington, DC, where she performed for the first time in front of a live audience. She spent 5 years as part of the HBO's critically acclaimed The Chris Rock Show (1997). As a performer and writer on the show, she was nominated for three Primetime Emmy Awards and in 1999 won the Emmy for Outstanding Writing for a Variety, Music, or Comedy Special. In 2001, she won the American Comedy Award for Outstanding Female Stand-Up Comic. She won a second Emmy in 2002 for her work on Inside the NFL (1977). In 2003, Wanda earned a Comedy Central Commie Award for Funniest TV Actress. Other writing credits include the 1999 MTV Video Music Awards (1999), The MTV Movie Awards, The 74th Annual Academy Awards (2002), The Keenen Ivory Wayans Show (1997), and Wanda at Large (2003). She also appeared in the feature films Pootie Tang (2001), Nutty Professor II: The Klumps (2000), Les pieds sur terre (2001), and Sa mère ou moi! (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTUxNzYyNV5BMl5BanBnXkFtZTcwNzgyNjQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0843100","name":"Wanda Sykes","idIMDB":"nm0843100"},"actorId":"nm0843100","character":"Bessy the Cow","urlCharacter":"http://www.imdb.com/character/ch0024458","main":true},{"actorName":"Andie MacDowell","urlProfile":"http://www.imdb.com/name/nm0000510","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc1NTc4Nzk2Nl5BMl5BanBnXkFtZTcwNjMwMzg5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1958","placeOfBirth":" Gaffney, South Carolina, USA","birthName":"Rosalie Anderson MacDowell","height":"5' 8\" (1.73 m)","bio":"Andie MacDowell was born Rosalie Anderson MacDowell on April 21, 1958 in Gaffney, South Carolina, to Pauline Johnston (Oswald), a music teacher, and Marion St. Pierre MacDowell, a lumber executive. She was enrolled at Winthrop College located in Rock Hill, South Carolina. Initially discovered by a rep from Wilhelmina Models while on a trip to Los Angeles. Later signed on with Elite Model Management in New York City in 1978. Made debut film appearance in Greystoke: The Legend of Tarzan, Lord of the Apes (1984). Went on to study method acting at the Actors Studio. Had commercial success with performances in Harold Ramis's Groundhog Day (1993) and Mike Newell's Four Weddings and a Funeral (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc1NTc4Nzk2Nl5BMl5BanBnXkFtZTcwNjMwMzg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000510","name":"Andie MacDowell","idIMDB":"nm0000510"},"actorId":"nm0000510","character":"Etta the Hen","urlCharacter":"http://www.imdb.com/character/ch0024457","main":true},{"actorName":"David Koechner","urlProfile":"http://www.imdb.com/name/nm0462712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODM1MjExNV5BMl5BanBnXkFtZTgwMzY2ODg2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1962","placeOfBirth":" Tipton, Missouri, USA","birthName":"David Michael Koechner","height":"6' 2½\" (1.89 m)","bio":"Actor, writer and producer David Michael Koechner was born in Tipton, Missouri, to Margaret Ann (Downey) and Cecil Stephen Koechner, who ran a turkey coop manufacturing business. He is of German, Irish, and English ancestry. An alumnus of Chicago's Second City Theater, Koechner got his first break as a cast member on \"Saturday Night Live\" and since has become an instantly recognizable face appearing in more than 120 films and television shows. He is best known for his roles as Todd Packer on \"The Office\" and Champ Kind from \"Anchorman\" and \"Anchorman 2: The Legend Continues.\" Koechner received rave reviews for his role in the dark, twisted and film festival award-winning thriller \"Cheap Thrills.\" He is also writing and producing a variety show pilot for NBC. Additional notable film credits include \"Waiting,\" \"Out Cold,\" \"Talladega Nights,\" \"Get Smart,\" \"Extract,\" \"Thank You for Smoking\" and \"A Haunted House.\" When not filming, Koechner performs live stand-up comedy across the country and creates original content videos for his YouTube channel, Full On Koechner. He resides in Los Angeles, Calif. with his wife and five children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODM1MjExNV5BMl5BanBnXkFtZTgwMzY2ODg2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0462712","name":"David Koechner","idIMDB":"nm0462712"},"actorId":"nm0462712","character":"Dag the Coyote","urlCharacter":"http://www.imdb.com/character/ch0024456","main":true},{"actorName":"Jeffrey Garcia","urlProfile":"http://www.imdb.com/name/nm0305261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNDg2MTk3OF5BMl5BanBnXkFtZTcwODY2MzkwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1977","placeOfBirth":" La Puente, California, USA","bio":"Jeffrey Garcia was born on May 3, 1977 in La Puente, California, USA. He is an actor and writer, known for Happy Feet (2006), The Adventures of Jimmy Neutron: Boy Genius (2002) and Happy Feet 2 (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNDg2MTk3OF5BMl5BanBnXkFtZTcwODY2MzkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0305261","name":"Jeffrey Garcia","idIMDB":"nm0305261"},"actorId":"nm0305261","character":"Pip the Mouse","urlCharacter":"http://www.imdb.com/character/ch0024461","main":true},{"actorName":"Cam Clarke","urlProfile":"http://www.imdb.com/name/nm0164682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA0MjY3MTkxMV5BMl5BanBnXkFtZTcwMDM3NDQwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1957","placeOfBirth":" Los Angeles, California, USA","birthName":"Cameron Arthur Clarke","height":"6' (1.83 m)","bio":"Cam Clarke was born on November 6, 1957 in Los Angeles, California, USA as Cameron Arthur Clarke. He is known for his work on Big Hero 6 (2014), Teenage Mutant Ninja Turtles (1987) and Masters of the Universe vs. the Snake Men (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA0MjY3MTkxMV5BMl5BanBnXkFtZTcwMDM3NDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0164682","name":"Cam Clarke","idIMDB":"nm0164682"},"actorId":"nm0164682","character":"Freddy the Ferret","urlCharacter":"http://www.imdb.com/character/ch0106094","main":true},{"actorName":"Rob Paulsen","urlProfile":"http://www.imdb.com/name/nm0667326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzODc1MTk4MzheQTJeQWpwZ15BbWU3MDY4NjU1MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1956","placeOfBirth":" Detroit, Michigan, USA","birthName":"Robert Fredrick Paulsen III","height":"5' 10½\" (1.79 m)","bio":"Rob Paulsen was born on March 11, 1956 in Detroit, Michigan, USA as Robert Fredrick Paulsen III. He is an actor, known for Animaniacs (1993), Teenage Mutant Ninja Turtles (2012) and The Mask (1995). He is married to Parrish Todd. They have one child. He was previously married to Carol Anne Schnarr.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzODc1MTk4MzheQTJeQWpwZ15BbWU3MDY4NjU1MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0667326","name":"Rob Paulsen","idIMDB":"nm0667326"},"actorId":"nm0667326","character":"Peck the Rooster / Gopher","urlCharacter":"http://www.imdb.com/character/ch0080776","main":true},{"actorName":"Tino Insana","urlProfile":"http://www.imdb.com/name/nm0409361","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NzE5ODk3NV5BMl5BanBnXkFtZTcwODIzMzExOA@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1948","placeOfBirth":" Chicago, Illinois, USA","bio":"Tino Insana was born on February 15, 1948 in Chicago, Illinois, USA. He is known for his work on ¡Three Amigos! (1986), La ferme en folie (2006) and Neighbors (1981). He has been married to Dana Moller since June 21, 1975.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NzE5ODk3NV5BMl5BanBnXkFtZTcwODIzMzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0409361","name":"Tino Insana","idIMDB":"nm0409361"},"actorId":"nm0409361","character":"Pig the Pig","urlCharacter":"http://www.imdb.com/character/ch0024463","main":true},{"actorName":"Dom Irrera","urlProfile":"http://www.imdb.com/name/nm0410101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzODEyNzg3M15BMl5BanBnXkFtZTcwNzAwMzExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1948","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Domenick Jack Irrera","height":"5' 9\" (1.75 m)","bio":"Dom Irrera was born on November 18, 1948 in Philadelphia, Pennsylvania, USA as Domenick Jack Irrera. He is an actor and writer, known for The Big Lebowski (1998), La ferme en folie (2006) and Hollywood Shuffle (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzODEyNzg3M15BMl5BanBnXkFtZTcwNzAwMzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0410101","name":"Dom Irrera","idIMDB":"nm0410101"},"actorId":"nm0410101","character":"Duke the Dog","urlCharacter":"http://www.imdb.com/character/ch0449635","main":true},{"actorName":"S. Scott Bullock","urlProfile":"http://www.imdb.com/name/nm0120180","urlPhoto":"","biography":{"dateOfBirth":"7 May 1956","placeOfBirth":" Santa Monica, California, USA","birthName":"Stuart Scott Bullock","bio":"S. Scott Bullock was born on May 7, 1956 in Santa Monica, California, USA as Stuart Scott Bullock. He is an actor, known for The Ant Bully (2006), La ferme en folie (2006) and Mass Effect (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0120180","name":"S. Scott Bullock","idIMDB":"nm0120180"},"actorId":"nm0120180","character":"Eddy the Cow","urlCharacter":"http://www.imdb.com/character/ch0269827","main":true},{"actorName":"John DiMaggio","urlProfile":"http://www.imdb.com/name/nm0224007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODA3OTE2N15BMl5BanBnXkFtZTgwMTc1MzQzMTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1968","placeOfBirth":" North Plainfield, New Jersey, USA","birthName":"John William DiMaggio","height":"6' 3½\" (1.92 m)","bio":"John DiMaggio was born on September 4, 1968 in North Plainfield, New Jersey, USA as John William DiMaggio. He is an actor, known for Adventure Time (2010), Futurama (1999) and Princess Mononoke (1997). He has been married to Kate Miller since October 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODA3OTE2N15BMl5BanBnXkFtZTgwMTc1MzQzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0224007","name":"John DiMaggio","idIMDB":"nm0224007"},"actorId":"nm0224007","character":"Bud the Cow / Officer O'Hanlon","urlCharacter":"http://www.imdb.com/character/ch0449669","main":true},{"actorName":"Maurice LaMarche","urlProfile":"http://www.imdb.com/name/nm0005606","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDQ5MTA4MF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1958","placeOfBirth":" Toronto, Ontario, Canada","height":"6' (1.83 m)","bio":"Maurice LaMarche was born on March 30, 1958 in Toronto, Ontario, Canada. He is an actor, known for Futurama (1999), Pinky and the Brain (1995) and Zootopia (2016). He has been married to Robin Eisenman since May 19, 1991. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDQ5MTA4MF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005606","name":"Maurice LaMarche","nicknames":["Moe"],"idIMDB":"nm0005606"},"actorId":"nm0005606","character":"Igg the Cow","urlCharacter":"http://www.imdb.com/character/ch0269830","main":true}],"seasons":[],"idIMDB":"tt0414853","urlIMDB":"http://www.imdb.com/title/tt0414853","business":{"budget":{"money":"$51,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$15,820,864","country":"USA","day":"06","month":"08","year":"2006","remarks":"3,311 Screens"},{"money":"£1,022,890","country":"UK","day":"22","month":"10","year":"2006","remarks":"444 Screens"},{"money":"€63,901","country":"Netherlands","day":"18","month":"02","year":"2007","remarks":"72 Screens"}],"gross":[{"money":"$72,601,713","country":"USA","day":"29","month":"10","year":"2006","remarks":""},{"money":"$72,394,888","country":"USA","day":"22","month":"10","year":"2006","remarks":""},{"money":"$72,106,304","country":"USA","day":"15","month":"10","year":"2006","remarks":""},{"money":"$71,713,703","country":"USA","day":"08","month":"10","year":"2006","remarks":""},{"money":"$71,269,476","country":"USA","day":"01","month":"10","year":"2006","remarks":""},{"money":"$70,706,226","country":"USA","day":"24","month":"09","year":"2006","remarks":""},{"money":"$69,131,901","country":"USA","day":"17","month":"09","year":"2006","remarks":""},{"money":"$67,014,342","country":"USA","day":"10","month":"09","year":"2006","remarks":""},{"money":"$63,777,644","country":"USA","day":"03","month":"09","year":"2006","remarks":""},{"money":"$54,930,100","country":"USA","day":"27","month":"08","year":"2006","remarks":""},{"money":"$46,088,273","country":"USA","day":"20","month":"08","year":"2006","remarks":""},{"money":"$33,717,980","country":"USA","day":"13","month":"08","year":"2006","remarks":""},{"money":"$15,820,864","country":"USA","day":"06","month":"08","year":"2006","remarks":""},{"money":"£4,477,314","country":"UK","day":"26","month":"11","year":"2006","remarks":""},{"money":"£4,366,343","country":"UK","day":"19","month":"11","year":"2006","remarks":""},{"money":"£4,063,100","country":"UK","day":"12","month":"11","year":"2006","remarks":""},{"money":"£3,664,087","country":"UK","day":"05","month":"11","year":"2006","remarks":""},{"money":"£2,986,025","country":"UK","day":"29","month":"10","year":"2006","remarks":""},{"money":"£1,022,890","country":"UK","day":"22","month":"10","year":"2006","remarks":""},{"money":"$650,597","country":"Australia","day":"24","month":"09","year":"2006","remarks":""},{"money":"€86,751","country":"Netherlands","day":"18","month":"02","year":"2007","remarks":""},{"money":"$39,234 (New","country":"Zealand","day":"24","month":"09","year":"2006","remarks":""},{"money":"$244,272","country":"Singapore","day":"24","month":"09","year":"2006","remarks":""},{"money":"$241,813","country":"Singapore","day":"17","month":"09","year":"2006","remarks":""}],"weekendGross":[{"money":"$158,157","country":"USA","day":"29","month":"10","year":"2006","remarks":"341 Screens"},{"money":"$207,567","country":"USA","day":"22","month":"10","year":"2006","remarks":"341 Screens"},{"money":"$258,892","country":"USA","day":"15","month":"10","year":"2006","remarks":"392 Screens"},{"money":"$357,980","country":"USA","day":"08","month":"10","year":"2006","remarks":"523 Screens"},{"money":"$382,898","country":"USA","day":"01","month":"10","year":"2006","remarks":"816 Screens"},{"money":"$1,303,545","country":"USA","day":"24","month":"09","year":"2006","remarks":"1,205 Screens"},{"money":"$1,652,321","country":"USA","day":"17","month":"09","year":"2006","remarks":"1,818 Screens"},{"money":"$2,715,092","country":"USA","day":"10","month":"09","year":"2006","remarks":"2,506 Screens"},{"money":"$6,588,882","country":"USA","day":"03","month":"09","year":"2006","remarks":"2,907 Screens"},{"money":"$5,652,932","country":"USA","day":"27","month":"08","year":"2006","remarks":"2,003 Screens"},{"money":"$7,581,622","country":"USA","day":"20","month":"08","year":"2006","remarks":"3,227 Screens"},{"money":"$9,701,882","country":"USA","day":"13","month":"08","year":"2006","remarks":"3 Screens"},{"money":"$15,820,864","country":"USA","day":"06","month":"08","year":"2006","remarks":"3,311 Screens"},{"money":"£84,089","country":"UK","day":"26","month":"11","year":"2006","remarks":"271 Screens"},{"money":"£271,732","country":"UK","day":"19","month":"11","year":"2006","remarks":"383 Screens"},{"money":"£355,048","country":"UK","day":"12","month":"11","year":"2006","remarks":"404 Screens"},{"money":"£355,612","country":"UK","day":"05","month":"11","year":"2006","remarks":"433 Screens"},{"money":"£743,162","country":"UK","day":"29","month":"10","year":"2006","remarks":"446 Screens"},{"money":"£1,022,890","country":"UK","day":"22","month":"10","year":"2006","remarks":"444 Screens"},{"money":"€63,901","country":"Netherlands","day":"18","month":"02","year":"2007","remarks":"72 Screens"}],"admissions":[{"money":"260,950","country":"Brazil","day":"19","month":"11","year":"2006","remarks":""},{"money":"332,885","country":"Germany","day":"29","month":"10","year":"2006","remarks":""},{"money":"104,329","country":"Germany","day":"08","month":"10","year":"2006","remarks":""},{"money":"148,574","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"10","year":"2004","remarks":null},null],"copyrightHolder":"KUMAR Mobiliengesellschaft mbH &amp; Co. Projekt Nr. 2 KG"},"technical":{"runtime":["1 hr 30 min (90 min) (USA)","1 hr 30 min (90 min) (Argentina)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":["2,477 m (Portugal, 35 mm)"],"negativeFormat":["Digital"],"cinematographicProcess":["Digital"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"5.6","metascore":"42","filmingLocations":[],"rated":"PG","awards":[{"award":"Casting Society of America, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Animated Voice-Over Feature Casting","names":[{"name":"Sarah Noonan","id":"nm0634745","role":null},{"name":"Meredith Layne","id":"nm0006746","role":"additional casting"}]}]}]},{"award":"The Stinkers Bad Movie Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Animated Film","names":[]},{"category":"Worst Movie Title","names":[]}]}]}],"votes":"22,143","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0004265","name":"Nickelodeon Movies"},{"idCompany":"co0179988","name":"Kumar Mobiliengesellschaft mbH & Co. Projekt Nr. 2 KG"}],"keywords":{"keywords":["farmer","cow","cgi animation","howl","howling at the moon","vegetarian","vegan","surrealism","rural setting","cell phone","joyride","golf","udder","star gazing","pregnancy","prankster","pig","mule","mechanical bull","mailman","loss of father","junkyard","hoedown","hen","helicopter","full moon","dog","country music","coming of age","car chase","calf","billiards","barn","banjo player","maturity","father son relationship","coyote","cow tipping","talking animal","farm","computer animation","cgi film","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:24:07"}}