{"data":{"movies":[{"title":"The Heartbreak Kid","originalTitle":"","year":"2007","releaseDate":"20071005","directors":[{"name":"Bobby Farrelly","id":"nm0268370"},{"name":"Peter Farrelly","id":"nm0268380"}],"writers":[{"name":"Scot Armstrong","id":"nm0035905"},{"name":"Leslie Dixon","id":"nm0228908"}],"runtime":"116 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTM2NTE2NF5BMl5BanBnXkFtZTcwOTI5MDUzMw@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Comedy","Romance"],"plot":"Eddie is forty, owns a sporting-goods store, and is still single. After watching his ex-fiancée walk down the aisle, he meets Lila, an environmental researcher, who seems too good to be true. Pressured by his father and best friend, Eddie pops the question and marries Lila after only 6 weeks. However, as he almost instantly discovers, his new bride is a nightmare with more baggage than he can handle. She's immature, foolish, a monster in bed, owes a tremendous amount of money to various sources, and as it turns out, is only a volunteer and doesn't actually have a job. While on their honeymoon in Cabo, Eddie meets Miranda, a down-to-earth lacrosse coach who is visiting with her family. Sparks fly, and Eddie falls for her. Now comes the tricky part of breaking off his marriage to crazy Lila, all while keeping the truth from Miranda about why he's in Cabo in the first place...","simplePlot":"A newly wed man who believes he's just gotten hitched to the perfect woman encounters another lady on his honeymoon.","actors":[{"actorName":"Ben Stiller","urlProfile":"http://www.imdb.com/name/nm0001774","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc4NDc3NDkzMl5BMl5BanBnXkFtZTcwMTAyNTQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1965","placeOfBirth":" New York City, New York, USA","birthName":"Benjamin Edward Meara Stiller","height":"5' 7\" (1.7 m)","bio":"Benjamin Edward Meara Stiller was born on November 30, 1965, in New York City, New York, to legendary comedians Jerry Stiller and Anne Meara. His father is of Austrian Jewish and Polish Jewish descent, and his mother was of Irish ancestry (she converted to Judaism). It's not surprising that Ben has followed in his family's footsteps: his parents made no real effort to keep their son away from the Hollywood lifestyle and he grew up among the stars, wondering just why his parents were so popular. At a young age, he and his sister Amy Stiller would perform plays at home, wearing Amy's tights to perform Shakespeare. Ben also picked up an interest in being on the other side of the camera and, at age 10, began shooting films on his Super 8 camera. The plots were always simple: someone would pick on the shy, awkward Stiller...and then he would always get his revenge. This desire for revenge on the popular, good-looking people may have motivated his teen-angst opus Reality Bites (1994) later in his career. He both directed and performed in the film, which costarred Winona Ryder and Ethan Hawke. Before he even got his start in Hollywood, Ben put in several consistently solid years in the theater. After dropping out of UCLA, he performed in the Tony Award winner, \"The House of Blue Leaves\". While working on the play, Stiller shot a short spoof of The Color of Money (1986) starring him (in the Tom Cruise role) and his American Playhouse: The House of Blue Leaves (1987) costar John Mahoney (in the Paul Newman role). The short film was so funny that Lorne Michaels purchased it and aired it on Saturday Night Live (1975). This led to Ben spending a year on the show in 1989. Ben made his big screen debut in Steven Spielberg's Empire of the Sun (1987) in 1987. Demonstrating early on the multifaceted tone his career would take, he soon stepped behind the camera to direct Back to Brooklyn for MTV. The network was impressed and gave Stiller his own show, The Ben Stiller Show (1992). He recruited fellow offbeat comedians Janeane Garofalo and Andy Dick and created a bitingly satirical show. MTV ended up passing on it, but it was picked up by Fox. Unfortunately, the show was a ratings miss. Stiller was soon out of work, although he did have the satisfaction of picking up an Emmy for the show after its cancellation. For a while, Ben had to settle for guest appearance work. While he was doing this, he saved up his cash and in the end was able to scrape enough together to make Reality Bites (1994), now a cult classic which is looked upon favorably by the generation it depicted. Ben continued to work steadily for a time, particularly in independent productions where he was more at ease. However, he never quite managed to catch a big break. His first big budget directing job was Jim Carrey's The Cable Guy (1996). Although many critics were impressed, Jim Carrey's fans were not. In 1998, There's Something About Mary (1998) had propelled Ben into the mainstream spotlight. With his wince-inducing turn in the Farrelly brothers' gross-out film, Ben really \"struck a nerve\" with mainstream America. Ben has starred in such hit movies as Keeping the Faith (2000) and Meet the Parents (2000). Ben excels at cerebral comedy, but he knows how to get down and lowbrow when he needs to, making him one of America's most popular performers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc4NDc3NDkzMl5BMl5BanBnXkFtZTcwMTAyNTQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001774","name":"Ben Stiller","idIMDB":"nm0001774"},"actorId":"nm0001774","character":"Eddie","urlCharacter":"http://www.imdb.com/character/ch0119282","main":true},{"actorName":"Malin Akerman","urlProfile":"http://www.imdb.com/name/nm0015196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODAwMjIwOV5BMl5BanBnXkFtZTcwMzI2NDA2OA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1978","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Malin Maria Åkerman","height":"5' 8\" (1.73 m)","bio":"Malin was born in Stockholm, Sweden and raised in Toronto, Canada. Her mother, Pia (Sundström), is a model and aerobics instructor, and her father, Magnus Åkerman, is an insurance broker. They moved to Toronto when she was age 2. At age 5, she began appearing in TV commercials. Her parents divorced when she was 6 and her father returned to Sweden. At age 17, she won the Canadian title of Ford Supermodel. This enabled her to spend 3 years as a catwalk model in Europe. She decided to become a child psychologist and enrolled in York University but she was offered a guest role in Invasion planète Terre (1997) so she turned her attention back to acting. She moved to Los Angeles in 2001 and won roles in both TV and film. Her breakthrough role came when she was cast as Silk Spectre II in Watchmen (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODAwMjIwOV5BMl5BanBnXkFtZTcwMzI2NDA2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015196","name":"Malin Akerman","idIMDB":"nm0015196"},"actorId":"nm0015196","character":"Lila","urlCharacter":"http://www.imdb.com/character/ch0029891","main":true},{"actorName":"Michelle Monaghan","urlProfile":"http://www.imdb.com/name/nm1157358","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEwYTdjNjYtZDk4NC00YzFmLTlkZTQtNTQyZTg3YmIxYWIxL2ltYWdlXkEyXkFqcGdeQXVyNzg5MzIyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1976","placeOfBirth":" Winthrop, Iowa, USA","birthName":"Michelle Lynn Monaghan","height":"5' 7\" (1.7 m)","bio":"Michelle Lynn Monaghan was born on March 23, 1976, in Winthrop, Iowa. She is the youngest of three children and the only daughter of Sharon (Hamel), who ran a day care center, and Robert L. Monaghan, a factory worker and farmer. She is of mostly Irish and German descent. After graduating from high school in Iowa, she studied journalism for three years at Chicago's Columbia College. In order to pay for college, she took a job as a model. In 1999, she quit college and moved to New York to work full-time as a fashion model. She traveled the world doing stints on the runways in Milan, Singapore, Tokyo, and Hong Kong, and also enjoyed appearances in a of number magazines and catalogs. In 2000, she made her TV debut in two episodes of Young Americans (2000), then appeared in Law & Order: Special Victims Unit (1999). She made her big screen debut with a small role of Henrietta in Perfume (2001). Monaghan shot to fame in 2002 when she co-starred as Kimberly Woods for one season on the TV series Boston Public (2000). After appearances in several supporting roles, she starred opposite Robert Downey Jr. and Val Kilmer in the black comedy Kiss Kiss Bang Bang (2005). Later in 2005, Monaghan was filming in China, Italy, and the United States on Mission: Impossible III (2006), as the female lead opposite Tom Cruise. In August of 2005, in Sydney, Australia, Michelle Monaghan married her long-time sweetheart, Peter White, a New York based graphic designer, who she met at a Manhattan party five years earlier.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEwYTdjNjYtZDk4NC00YzFmLTlkZTQtNTQyZTg3YmIxYWIxL2ltYWdlXkEyXkFqcGdeQXVyNzg5MzIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1157358","name":"Michelle Monaghan","idIMDB":"nm1157358"},"actorId":"nm1157358","character":"Miranda","urlCharacter":"http://www.imdb.com/character/ch0028802","main":true},{"actorName":"Jerry Stiller","urlProfile":"http://www.imdb.com/name/nm0005467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjA1NzgzNV5BMl5BanBnXkFtZTYwODY4ODQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1927","placeOfBirth":" New York City, New York, USA","birthName":"Gerald Isaac Stiller","height":"5' 4\" (1.63 m)","bio":"As the short, hypertensive male counterpart of the stellar husband-and-wife comedy team \"Stiller & Meara\", Jerry Stiller and wife Anne Meara were on top of the comedy game in the 1960s, a steady and hilarious presence on television variety, notably The Ed Sullivan Show (1948), on which they appeared 36 times. Decades later, his career was revitalized in the role of the raucous, gasket-blowing Frank Costanza on the sitcom classic Seinfeld (1989). Jerry Stiller was born in the Unity Hospital in Brooklyn, New York City, New York, to Bella (Citron) and William Stiller, a bus driver. His paternal grandparents were Jewish immigrants from Galicia, and his mother was a Polish Jewish immigrant, from Frampol. Stiller was, in the beginning, a drama major at the University of Syracuse. Though he had played rather uneducated, blue-collar sorts for most of his career, he received a Bachelor of Science in Speech and Drama before making his 1951 acting debut on stage with Burgess Meredith in \"The Silver Whistle\". While a member of the improvisational team The Compass Players (the company later evolved into the well-known Second City troupe), he met Anne. They married in 1954 and began touring together on the national club circuit while giving new and inventive meaning to the term spousal comedy. After well over a decade of fame together, they decided to pursue individual successes and both found it. A Broadway favorite in such shows as \"Hurlyburly\", \"The Ritz\" (he later recreated his role on film), \"The Golden Apple\", \"Three Men on a Horse\", \"What's Wrong with This Picture\" and \"The Three Sisters\", Stiller even appeared with Kevin Kline and Blythe Danner as Dogberry in William Shakespeare's \"Much Ado About Nothing\" in 1988. Musicals were not out of his range, either, as he created the role of Launce in \"Two Gentlemen of Verona\" and co-starred as Nathan Detroit in a production of \"Guys and Dolls\". Although he kept afloat on television as a 1970s regular on The Paul Lynde Show (1972) and Joe and Sons (1975), he had some rocky years and Anne's pilot fizzled when they reunited for a possible \"Stiller & Meara\" sitcom. Then came eight seasons as Frank Costanza and his character star was reborn. Nominated for a 1997 Emmy Award and the recipient of the 1998 American Comedy Award, Stiller found back-to-back sitcom hits with The King of Queens (1998) as the irascible Arthur Spooner. He has also appeared in a number of his successful son, Ben Stiller's, comedy pictures including Heavy Weights (1995) and Zoolander (2001). Daughter Amy Stiller is also a thriving actress. He and Anne have written, performed and produced award-winning radio commercials together for such products as Blue Nun Wine, United Van Lines and Amalgamated Bank, among others. His autobiography \"Married to Laughter\" came out in 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjA1NzgzNV5BMl5BanBnXkFtZTYwODY4ODQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005467","name":"Jerry Stiller","idIMDB":"nm0005467"},"actorId":"nm0005467","character":"Doc","urlCharacter":"http://www.imdb.com/character/ch0029892","main":true},{"actorName":"Rob Corddry","urlProfile":"http://www.imdb.com/name/nm1117791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODI5Njk2Nl5BMl5BanBnXkFtZTcwOTY3NTA3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1971","placeOfBirth":" Weymouth, Massachusetts, USA","birthName":"Robert William Corddry","height":"5' 11\" (1.8 m)","bio":"Rob Corddry was born on February 4, 1971 in Weymouth, Massachusetts, USA as Robert William Corddry. He is a writer and actor, known for Hot Tub Time Machine (2010), Childrens Hospital (2008) and Warm Bodies (2013). He has been married to Sandra Corddry since 2002. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODI5Njk2Nl5BMl5BanBnXkFtZTcwOTY3NTA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1117791","name":"Rob Corddry","idIMDB":"nm1117791"},"actorId":"nm1117791","character":"Mac","urlCharacter":"http://www.imdb.com/character/ch0142011","main":true},{"actorName":"Carlos Mencia","urlProfile":"http://www.imdb.com/name/nm0578788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTM1MDEzN15BMl5BanBnXkFtZTcwOTcyOTkwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1967","placeOfBirth":" San Pedro Sula, Honduras","birthName":"Ned Arnel Mencia","height":"5' 8\" (1.73 m)","bio":"Carlos Mencia is undoubtedly one of today's most popular entertainers and comics. Whether it is man-on-the-street interviews, studio comedy, commercial parodies, nationwide sold-out tours, or films, Mencia demonstrates an extraordinary ability to connect with a wide and diverse audience. Mencia comes from a humble background, born in San Pedro Sula, Honduras, the 17th of 18 children. His parents sent him to the United States when he was about three months old, where he was raised in Maravilla Projects in Los Angeles, California by his aunt and uncle. In his early teens, Mencia moved back to Honduras because his family wanted him to avoid the destructive gang culture of East Los Angeles. When Mencia later returned to Los Angeles, he showed such educational prowess that he was immediately promoted to the tenth grade. Soon after, he successfully graduated from Garfield High School. Mencia began his career doing stand-up on amateur night at the comedy club, Laugh Factory. He later showcased at The Comedy Store and became a regular, performing nightly. After he found success on the L.A comedy circuit, Mencia was named \"International Comedy Grand Champion\" from Buscando Estrellas (the Latino version of Star Search). This led to appearances on \"In Living Color,\" \"The Arsenio Hall Show,\" \"Moesha\" and \"An Evening at the Improv.\" In 1994, he hosted the HBO comedy series \"Loco Slam\" and in 1998 he hosted \"Funny is Funny!\" on Galavision. Mencia released a comedy album in 2000 called \"Take a Joke, America\" that showcased his brand of humor. Mencia continued his journey up the comedy ladder by headlining \"The Three Amigos\" tour with Freddy Soto and Pablo Francisco in 2002, which sold out in record time around the United States. He was also featured in the independent films, \"Outta Time\" and \"29 Palms\" and starred in guest spots on \"The Shield\" and \"The Bernie Mac Show,\" among others. In 2002, he received a CableACE Award nomination for Best Stand-Up Comedy Special for his HBO special. That same year, Mencia was featured on \"Comedy Central Presents.\" Mencia remained busy and after the success of his solo dvd, \"Carlos Mencia: Not For The Easily Offended,\" \"Mind of Mencia\" went into development. The show was an instant hit and after the first season, Comedy Central signed Mencia back for his own original stand-up special, \"Carlos Mencia: No Strings Attached.\" The special was the first Comedy Central Stand-up Special DVD to achieve Platinum sales status. \"Mind of Mencia\" debuted on Comedy Central in early 2005. It became one of the strongest shows in the network's history, averaging about 1.5 million total viewers. \"Mind of Mencia\" was executive produced by Carlos Mencia and Robert Morton (\"Late Night with David Letterman\"). In the summer of 2007, Mencia starred opposite Ben Stiller and Michelle Monaghan in the Farrelly Brothers' hit feature film, THE HEARTBREAK KID (DreamWorks). In the fall of that year Mencia headlined a nationwide comedy tour titled \"Carlos Mencia Live Presented by Bud Light.\" The highly anticipated tour brought Mencia face-to-face with his fans from September 2007 through December 2007. Shortly thereafter, Mencia taped a new comedy special for Comedy Central, \"Carlos Mencia: Performance Enhanced,\" that aired in May 2008. Since 2007, every holiday season Mencia has embarked on a USO Tour to the Persian Gulf to entertain the troops serving overseas. For his 2008 trip, Mencia visited Kuwait to host \"Operation MySpace,\" an exclusive concert for American Troops in the Middle East alongside Jessica Simpson and The Pussycat Dolls. The special aired on FX in April 2008. Mencia's 2009 USO tour had stops in Turkey, Kirkuk, Baghdad, Qatar, Afghanistan, and many other countries. In July 2008, Mencia began his tour, \"At Close Range\" at Red Rock Amphitheatre in Colorado. The tour was sponsored by Bud Light and co-promoted by Icon Entertainment and Live Nation. Larger than all of his previous tours, Mencia performed in 80 cities across the country. In the summer of 2009, he kicked off a nationwide comedy tour entitled \"The Administration of Laughter\" which brought him to excited audiences all around the country. Mencia starred in the family comedy OUR FAMILY WEDDING (FOX Searchlight) alongside America Ferrara and Forrest Whitaker. The film was released to theatres nationwide on March 12th, 2010. In the last couple years, Mencia chose to go back to his comedic roots, performing at a number of comedy stores throughout the country - allowing him to share his newest material with smaller and more intimate audiences. In addition to touring, Mencia is continuously writing material for television pilots and upcoming comedy specials. Carlos Mencia presently lives in Los Angeles with his wife and their son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTM1MDEzN15BMl5BanBnXkFtZTcwOTcyOTkwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0578788","name":"Carlos Mencia","nicknames":["The Punisher"],"idIMDB":"nm0578788"},"actorId":"nm0578788","character":"Tito","urlCharacter":"http://www.imdb.com/character/ch0119283","main":true},{"actorName":"Scott Wilson","urlProfile":"http://www.imdb.com/name/nm0934113","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjA2MDA4NF5BMl5BanBnXkFtZTgwNDM4MzMzNDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1942","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 10¾\" (1.8 m)","bio":"One chillingly infamous screen role for Scott Wilson in 1967 set the tone for an actor who went on to prove himself an invaluable character player for the past five decades. The Georgia-born native (Atlanta born and raised) was awarded a basketball scholarship following high school at Georgia's Southern Tech University to study architecture. Instead, Wilson hitchhiked to Los Angeles on a whim and hooked up one day with an actor he met in a bar who took him to one of his auditions. Allowed to audition himself by chance, Wilson lost the part but was absolutely hooked. Working an assortment of menial jobs, he studied for nearly five years while gaining experience in such local theater productions as \"The Importance of Being Earnest.\" Scott's fledgling career took off big time after being discovered by director Norman Jewison who cast him as a murder suspect in In the Heat of the Night (1967) starring Sidney Poitier and \"Best Actor\" Oscar winner Rod Steiger. If that weren't a sufficient beginning, Wilson immediately followed this with the co-lead role of murderer Richard Hickok in the stark and disturbing In Cold Blood (1967), a superlative adaptation of Truman Capote best-selling docu-novel. It didn't hurt that Scott himself had a startling resemblance to the real-life killer. Partnering up with Robert Blake as two ex-cons who are eventually executed for the senseless, brutal slaughter of an entire Kansas farm family, the critically acclaimed film put both men squarely on the movie map. Although a serious contender, out-and-out stardom did not come about for the quietly handsome, slightly forlorn-looking actor. Major roles in major pictures, however, did. Among Scott's early film work were Castle Keep (1969) and The Gypsy Moths (1969), both starring Burt Lancaster; The Grissom Gang (1971); Lolly-Madonna XXX (1973) (again with Steiger); The New Centurions (1972); The Great Gatsby (1974), in which he earned raves as the garage owner who shoots Robert Redford's title character to death in Gatsby's backyard swimming pool; The Ninth Configuration (1980), for which he received a Golden Globe nomination; The Right Stuff (1983); the Venice Film Festival winner L'année du soleil calme (1984) [A Year of the Quiet Sun]; Malone (1987) and Johnny Handsome (1989). TV also showed off Scott's dark, controlled intensity and wide range in later years, appearing in guest spots on such popular dramas as \"The X-Files\" and \"The Twilight Zone,\" and in a recurring role as Marg Helgenberger's unscrupulous mobster father in \"CSI.\" In minimovies Scott played everything from Elvis's father in Elvis and the Colonel: The Untold Story (1993) to a Wyoming governor in The Jack Bull (1999). Hardly one of Hollywood's flashiest good ol' boys, the taciturn, unassuming actor has preferred to remain discrete and let his performances do the talking. His output has been minimal compared with other character stars, but he has remained in the quality ranks nevertheless, mixing his standard penchant for darker movies with such family-oriented films as Shiloh (1996) and its 2006 sequel. Supporting the newer \"young guns\" these days, he appeared with Vince Vaughn in Clay Pigeons (1998) and Ryan Phillippe in The Way of the Gun (2000), and ended up one of serial killer Charlize Theron's victims in Monster (2003). Other strong showings on the big screen have included a lead part as a rockabilly star in Don't Let Go (2002) and his down-home patriarch in the superb ensemble art film Junebug (2005), a breakout hit with Academy voters. More recently, Scott has gained a following sporting a full grey beard and ponytailed as grizzled farm owner Hershel Greene in the cable series The Walking Dead: Webisodes (2011). Wilson resides in Los Angeles along with his wife of nearly four decades, Heavenly, an attorney and accomplished artist and writer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjA2MDA4NF5BMl5BanBnXkFtZTgwNDM4MzMzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934113","name":"Scott Wilson","idIMDB":"nm0934113"},"actorId":"nm0934113","character":"Boo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Polly Holliday","urlProfile":"http://www.imdb.com/name/nm0391072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDIwOTU0MF5BMl5BanBnXkFtZTcwMjAwMTExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1937","placeOfBirth":" Jasper, Alabama, USA","birthName":"Polly Dean Holliday","height":"5' 8\" (1.73 m)","bio":"The normally erudite, soft-spoken and well-mannered Alabama-born actress Polly Holliday had accumulated quite an extensive theater background by the time she hit it big on 70s TV as the brash, uninhibited, gum-cracking waitress Florence Jean Castleberry (Flo for short) on the popular sitcom Alice (1976). As a long and respected member of the Asolo Repertory Company in Sarasota, Florida, Polly had toiled long and hard to disguise her Southern twang while building up a sturdy classical reputation. At the same time, she taught music in the city's elementary schools. When she won the role of Flo in 1976, however, she let all four burners out as the scene-stealing Southern-baked hash-slinger who delightfully redefined trailer park trash. The two-time Golden Globe winner and Emmy-nominated actress hit it so big with fans (she introduced the catch phrase, \"Kiss mah grits!\" to the American vernacular) that she earned her own spin-off, aptly titled Flo (1980). The show barely lasted one season despite another Emmy-nomination for her. Polly lost major clout after the show's cancellation and, to avoid typecasting, she stayed out of the television limelight while appearing in regional theater. She won renewed respect and critical notice for her Amanda Wingfield in The Glass Menagerie, her Tony-nominated turn as Big Mama in Cat on a Hot Tin Roof, and for her part as the lonely small-town schoolteacher in Picnic in 1994. From time to time she has taken on flashy roles in both comic and dramatic films, such as the old crank who meets a freakish end in Gremlins (1984), and on TV wherein she briefly replaced Eileen Brennan in the series Private Benjamin (1981) after Ms. Brennan's near-fatal car accident in 1982. Though Polly never recaptured the dazzling success of her Alice (1976) years, she has continued at a healthy pace -- primarily in guest spots where she plays wise and opinionated mothers and grandmothers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDIwOTU0MF5BMl5BanBnXkFtZTcwMjAwMTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0391072","name":"Polly Holliday","idIMDB":"nm0391072"},"actorId":"nm0391072","character":"Beryl","urlCharacter":"http://www.imdb.com/character/ch0142016","main":true},{"actorName":"Danny McBride","urlProfile":"http://www.imdb.com/name/nm1144419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTM0ODI4NF5BMl5BanBnXkFtZTcwNzg3MjY0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1976","placeOfBirth":" Statesboro, Georgia, USA","birthName":"Daniel Richard McBride","height":"5' 10\" (1.78 m)","bio":"Danny McBride was born on December 29, 1976 in Statesboro, Georgia, USA as Daniel Richard McBride. He is an actor and writer, known for Your Highness (2011), Pineapple Express (2008) and This Is the End (2013). He has been married to Gia Ruiz since October 9, 2010. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTM0ODI4NF5BMl5BanBnXkFtZTcwNzg3MjY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1144419","name":"Danny McBride","idIMDB":"nm1144419"},"actorId":"nm1144419","character":"Martin","urlCharacter":"http://www.imdb.com/character/ch0142017","main":true},{"actorName":"Roy Jenkins","urlProfile":"http://www.imdb.com/name/nm0420963","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDY2MTM1OF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 8\" (2.03 m)","bio":"Roy Jenkins is a writer and actor, known for Late Night with Conan O'Brien (1993), All Broken Up (2009) and The Heartbreak Kid (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDY2MTM1OF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0420963","name":"Roy Jenkins","idIMDB":"nm0420963"},"actorId":"nm0420963","character":"Buzz","urlCharacter":"http://www.imdb.com/character/ch0142018","main":true},{"actorName":"Stephanie Courtney","urlProfile":"http://www.imdb.com/name/nm0183960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTU3MjM5N15BMl5BanBnXkFtZTcwMDI2NjYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1970","placeOfBirth":" Stony Point, New York, USA","height":"5' 8\" (1.73 m)","bio":"Stephanie Courtney is main company member of the famed Groundlings Theater in Los Angeles, regularly performing in their sketch and improv shows. She hails from Stony Point, New York. After graduating from the Neighborhood Playhouse in New York City, she started doing stand up, which brought her to Los Angeles. She's been invited to perform her stand up at the Aspen Comedy Festival twice. She also performed in Aspen in \"Those Courtney Girls\", a show she co-wrote with her sister, Jennifer, and in the Mr. Show Tour, \"Hooray for America\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTU3MjM5N15BMl5BanBnXkFtZTcwMDI2NjYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0183960","name":"Stephanie Courtney","idIMDB":"nm0183960"},"actorId":"nm0183960","character":"Gayla","urlCharacter":"http://www.imdb.com/character/ch0142019","main":true},{"actorName":"Amy Sloan","urlProfile":"http://www.imdb.com/name/nm0805930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTU3Nzk4N15BMl5BanBnXkFtZTgwMDgwMDcxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1978","placeOfBirth":" Whitehorse, Yukon, Canada","bio":"Amy Sloan was born on May 12, 1978 in Whitehorse, Yukon, Canada. She is known for her work on Aviator (2004), Gothika (2003) and The Day After Tomorrow (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTU3Nzk4N15BMl5BanBnXkFtZTgwMDgwMDcxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0805930","name":"Amy Sloan","idIMDB":"nm0805930"},"actorId":"nm0805930","character":"Deborah","urlCharacter":"http://www.imdb.com/character/ch0142020","main":true},{"actorName":"Jerry Sherman","urlProfile":"http://www.imdb.com/name/nm0792477","urlPhoto":"","biography":{"birthName":"Sherman Axelrod","bio":"Jerry Sherman was born as Sherman Axelrod. He was an actor, known for The Heartbreak Kid (2007), Get Smart (2008) and The Center of the World (2001). He was married to Marilyn. He died on September 17, 2008.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0792477","name":"Jerry Sherman","idIMDB":"nm0792477"},"actorId":"nm0792477","character":"Grandpa Anderson","urlCharacter":"http://www.imdb.com/character/ch0142021","main":true},{"actorName":"Lauren Bowles","urlProfile":"http://www.imdb.com/name/nm0101242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTg5ODc2NF5BMl5BanBnXkFtZTgwMDc1NTcwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Lauren Bowles was born in Washington, District of Columbia, USA. She is an actress and writer, known for True Blood (2008), Hall Pass (2011) and The Heartbreak Kid (2007). She has been married to Patrick Fischler since May 27, 2005. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTg5ODc2NF5BMl5BanBnXkFtZTgwMDc1NTcwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0101242","name":"Lauren Bowles","idIMDB":"nm0101242"},"actorId":"nm0101242","character":"Tammy","urlCharacter":"http://www.imdb.com/character/ch0142022","main":true},{"actorName":"Nicholas Kromka","urlProfile":"http://www.imdb.com/name/nm2137771","urlPhoto":"","biography":{"bio":"Nicholas Kromka is an actor, known for The Heartbreak Kid (2007) and Loverboy (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2137771","name":"Nicholas Kromka","idIMDB":"nm2137771"},"actorId":"nm2137771","character":"12 Year Old Twin","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0408839","urlIMDB":"http://www.imdb.com/title/tt0408839","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$14,022,105","country":"USA","day":"07","month":"10","year":"2007","remarks":"3,229 Screens"},{"money":"£1,236,288","country":"UK","day":"07","month":"10","year":"2007","remarks":"409 Screens"},{"money":"BRL 1,237,900","country":"Brazil","day":"11","month":"11","year":"2007","remarks":"115 Screens"},{"money":"$32,156","country":"Estonia","day":"18","month":"11","year":"2007","remarks":"3 Screens"}],"gross":[{"money":"$36,771,343","country":"USA","day":"02","month":"12","year":"2007","remarks":""},{"money":"$36,701,648","country":"USA","day":"24","month":"11","year":"2007","remarks":""},{"money":"$36,590,219","country":"USA","day":"18","month":"11","year":"2007","remarks":""},{"money":"$36,198,567","country":"USA","day":"04","month":"11","year":"2007","remarks":""},{"money":"$32,025,396","country":"USA","day":"21","month":"10","year":"2007","remarks":""},{"money":"$25,856,010","country":"USA","day":"14","month":"10","year":"2007","remarks":""},{"money":"$14,022,105","country":"USA","day":"07","month":"10","year":"2007","remarks":""},{"money":"£4,375,595","country":"UK","day":"28","month":"10","year":"2007","remarks":""},{"money":"£3,675,895","country":"UK","day":"21","month":"10","year":"2007","remarks":""},{"money":"£2,779,053","country":"UK","day":"14","month":"10","year":"2007","remarks":""},{"money":"£1,236,288","country":"UK","day":"07","month":"10","year":"2007","remarks":""},{"money":"BRL 1,237,900","country":"Brazil","day":"11","month":"11","year":"2007","remarks":""},{"money":"RUR 141,621,969","country":"Russia","day":"21","month":"10","year":"2007","remarks":""},{"money":"RUR 119,268,604","country":"Russia","day":"14","month":"10","year":"2007","remarks":""},{"money":"RUR 57,691,418","country":"Russia","day":"07","month":"10","year":"2007","remarks":""}],"weekendGross":[{"money":"$41,795","country":"USA","day":"02","month":"12","year":"2007","remarks":"129 Screens"},{"money":"$79,213","country":"USA","day":"24","month":"11","year":"2007","remarks":"189 Screens"},{"money":"$49,558","country":"USA","day":"18","month":"11","year":"2007","remarks":"84 Screens"},{"money":"$441,566","country":"USA","day":"04","month":"11","year":"2007","remarks":"631 Screens"},{"money":"$3,814,636","country":"USA","day":"21","month":"10","year":"2007","remarks":"2,782 Screens"},{"money":"$7,280,450","country":"USA","day":"14","month":"10","year":"2007","remarks":"3,233 Screens"},{"money":"$14,022,105","country":"USA","day":"07","month":"10","year":"2007","remarks":"3,229 Screens"},{"money":"£344,921","country":"UK","day":"28","month":"10","year":"2007","remarks":"307 Screens"},{"money":"£458,346","country":"UK","day":"21","month":"10","year":"2007","remarks":"346 Screens"},{"money":"£856,501","country":"UK","day":"14","month":"10","year":"2007","remarks":"409 Screens"},{"money":"£1,236,288","country":"UK","day":"07","month":"10","year":"2007","remarks":"409 Screens"},{"money":"BRL 1,237,900","country":"Brazil","day":"11","month":"11","year":"2007","remarks":"115 Screens"}],"admissions":[{"money":"129,032","country":"Brazil","day":"11","month":"11","year":"2007","remarks":""},{"money":"1,165,652","country":"Germany","day":"09","month":"12","year":"2007","remarks":""},{"money":"1,111,741","country":"Germany","day":"02","month":"12","year":"2007","remarks":""},{"money":"1,029,166","country":"Germany","day":"25","month":"11","year":"2007","remarks":""},{"money":"869,832","country":"Germany","day":"18","month":"11","year":"2007","remarks":""},{"money":"655,094","country":"Germany","day":"11","month":"11","year":"2007","remarks":""},{"money":"355,798","country":"Germany","day":"04","month":"11","year":"2007","remarks":""},{"money":"137,317","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"25","month":"09","year":"2006","remarks":null},null],"copyrightHolder":"Copyright © MMVII by DreamWorks LLC All Rights Reserved. (on print)"},"technical":{"runtime":["1 hr 56 min (116 min)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT","Arricam ST"],"laboratory":["DeLuxe, USA","Technicolor Digital Intermediates (digital intermediate)"],"filmLength":["3,173 m (Sweden)","3,201 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.8","metascore":"46","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"R","awards":[{"award":"Women Film Critics Circle Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won WFCC Award","categories":[{"category":"Most Offensive Male Character","names":[]}]}]}],"votes":"74,192","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040938","name":"DreamWorks"},{"idCompany":"co0023815","name":"Radar Pictures"},{"idCompany":"co0022730","name":"Davis Entertainment"}],"keywords":{"keywords":["marriage","dysfunctional marriage","sporting goods store","humorous sex scene","comedic sex scene","cowgirl sex position","talking dirty during sex","talking dirty","loud sex","bare breasts","topless female nudity","topless woman","nudity","topless","breast","woman moaning from pleasure","woman moaning","moaning","moaning woman","nipples","nipple","bikini","blonde","jacuzzi","white panties","leg spreading","lust","fondling","coitus","copulation","sex in bed","female removes her dress","female removes her clothes","girl in panties","female full frontal nudity","female rear nudity","breasts","scantily clad female","cleavage","sexual pleasure","sexual encounter","sexual arousal","san francisco california","cabo san lucas mexico","no panties","female pubic hair","deviated septum","nightie","spooning","spooning sexual position","cowboy sex position","female flatulence","singing in a car","real life father and son playing father and son","fake female frontal nudity","frat pack","pornographic video","thrown from a train","pornography","jumping into water","border crossing","bicycle accident","marriage annulment","remake","woman on top","shallow","nose","kama sutra","acrobatic sex","zoophilia","vcr tape","urination","surprise after end credits","sunburn","sex show","scene during end credits","pubic hair","panties","jellyfish","homophobia","gigantic breasts","gay stereotype","female nudity","female frontal nudity","dirty talk","deranged woman","deception","cocaine addict","bestiality","baseball bat","bare butt","animal penis","rough sex","flatulence","wedding","wedding reception","wedding gift","trust","true love","toilet","suspicion","stupidity","speed dating","sex","self confidence","secret","scatological humor","redemption","premarital sex","old flame","newlywed","marriage proposal","infidelity","hobby","guilt","future in laws","friendship","flirting","farce","engagement","eavesdropping","drunkenness","drugs","drug humor","divorce","dating","dance","confession","compassion","cheating on one's girlfriend","cheating on one's boyfriend","celibacy","best man","apology","advice","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:12:40"}}