{"data":{"movies":[{"title":"Pulse","originalTitle":"","year":"2006","releaseDate":"20060811","directors":[{"name":"Jim Sonzero","id":"nm0814517"}],"writers":[{"name":"Wes Craven","id":"nm0000127"},{"name":"Ray Wright","id":"nm1242522"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyOTg5MjY1OF5BMl5BanBnXkFtZTcwNTM1ODYzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Sci-Fi"],"plot":"The hacker Josh invades the computer of Douglas Ziegler, who is developing a powerful wireless signal, and accidentally releases a mysterious force that takes the will to live of human beings, generating a suicide epidemic and increasing the force. His girlfriend and student of psychology, Mattie, sees each one of their common friends die and the destruction of the modern world, and together with her new acquaintance Dexter, they try to plan a virus developed by Josh in the network to shutdown the system and save mankind.","simplePlot":"When their computer hacker friend accidentally channels a mysterious wireless signal, a group of co-eds rally to stop a terrifying evil from taking over the world.","actors":[{"actorName":"Kristen Bell","urlProfile":"http://www.imdb.com/name/nm0068338","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjkzOTIxMV5BMl5BanBnXkFtZTgwNzM3MTkzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1980","placeOfBirth":" Huntington Woods, Michigan, USA","birthName":"Kristen Anne Bell","height":"5' 1\" (1.55 m)","bio":"Kristen Anne Bell (born 1980) is an American actress and singer. She was born and raised in Huntington Woods, Michigan, and is the daughter of Lorelei (Frygier), a nurse, and Tom Bell, a television news director. Her ancestry is Polish (mother) and German, English, Irish, and Scottish (father). Kristen found her talent in entertainment at an early age. In 1992, she went to her first audition and won a role in Raggedy Ann and Andy. Bell's mother established her with an agent before she was 13, and she was cast in newspaper advertisements and television commercials. At this time, she also began private acting lessons. Bell had an uncredited role in the film Polish Wedding (1998) in 1998. Bell attended Shrine Catholic High School, where she took part in drama and music club. She won the starring role of Dorothy in her high school's production of The Wizard of Oz. After graduation Bell moved to New York City to attend prestigious Tisch School of the Arts, where she studied musical theater. In 2001, Bell left university to play the role of Becky in Tom Sawyer. That same year, she made her first credited debut in Pootie Tang (2001), but her scene was cut and her appearance exists only in the credit sequence. In 2002, Bell appeared in the Broadway revival of The Crucible with Liam Neeson and Angela Bettis. She then moved to Los Angeles, California, and appeared in a handful television shows as a special guest, finding trouble gaining a recurring role in a television series. In 2004, Bell appeared in the Lifetime's television film, Gracie's Choice, which received high ratings. At the age 24, Bell won the title role in Veronica Mars (2004), which started broadcasting in the fall of 2004, created by Rob Thomas. Bell starred as a seventeen-year-old detective, which put her alongside actors Enrico Colantoni who played her father, Percy Daggs III, Jason Dohring and Ryan Hansen. This series received very positive reviews, and Bell received much attention for her performance. Bell and the cast of Veronica Mars were nominated for two Teen Choice Awards. In 2005, Bell starred in Reefer Madness: The Movie Musical (2005) in the role of Mary Lane. Reefer Madness debuted on the Showtime network on April 16, 2005. The following year, Bell won the Saturn Award for 'Best Actress on Television' for her performance in Veronica Mars. In 2013, Bell voiced the main character, Princess Anna of Arendelle, in the Walt Disney Pictures animated movie, Frozen (2013), which received the 'best animated feature' award at the 86th Academy Awards. She performed the songs: 'For the First Time in Forever', 'Love is an Open Door', 'Do You Want to Build a Snowman', and 'For the First Time in Forever (Reprise)'. Frozen (2013), which was released on November 22, 2013, was hugely successful worldwide. On March 13, 2013, it was confirmed that a Veronica Mars (2014) movie would finally be coming to fruition. Bell and creator, Rob Thomas, launched a fund raising campaign to produce the film through Kickstarter and attained the $2 million goal in few hours. The movie was released on March 14, 2014. Bell married Dax Shepard in October, 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjkzOTIxMV5BMl5BanBnXkFtZTgwNzM3MTkzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068338","name":"Kristen Bell","nicknames":["K-Bell","Annie","KB","Bellie"],"idIMDB":"nm0068338"},"actorId":"nm0068338","character":"Mattie","urlCharacter":"http://www.imdb.com/character/ch0016705","main":true},{"actorName":"Ian Somerhalder","urlProfile":"http://www.imdb.com/name/nm0813812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NDAyOTQ0N15BMl5BanBnXkFtZTgwNzM4NDI1OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1978","placeOfBirth":" Covington, Louisiana, USA","birthName":"Ian Joseph Somerhalder","height":"5' 9¾\" (1.77 m)","bio":"Ian Somerhalder was born and raised in the small southern town of Covington, Louisiana. His mother, Edna (née Israel), is a massage therapist, and his father, Robert Somerhalder, is a building contractor. He has Cajun (French), English, and Scots-Irish ancestry. Boating, swimming, fishing and training horses filled much of his recreational time growing up, as did the school drama club and performing with the local theater group. With his mother's encouragement, at age 10, he began a modeling career that took him to New York each summer. By junior high, he opted to put modeling on the back burner and focus more on sports and school. A few years later, when the opportunity to model in Europe arose, Somerhalder grabbed it, embarking on an enriching path of work, travel and study that took him to cities, including Paris, Milan and London. At 17, he began studying acting in New York and, by 19, had committed himself to the craft, working with preeminent acting coach William Esper. His fate was sealed while working as an extra in a club scene in the feature film, Black & White (1999). A talent manager visiting a client on the set spotted Somerhalder in a crowd scene of 400 and immediately signed him for representation. He was cast later for the drama Changing Hearts (2002) directed by Martin Guigui. Happy to be anchored in New York, Somerhalder spends much of his time studying acting, writing and practicing yoga. His recreational interests include water and snow skiing and horseback riding.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NDAyOTQ0N15BMl5BanBnXkFtZTgwNzM4NDI1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0813812","name":"Ian Somerhalder","nicknames":["Smolderholder"],"idIMDB":"nm0813812"},"actorId":"nm0813812","character":"Dexter","urlCharacter":"http://www.imdb.com/character/ch0016706","main":true},{"actorName":"Christina Milian","urlProfile":"http://www.imdb.com/name/nm0587396","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDM0NzM3N15BMl5BanBnXkFtZTcwNzAyNjI5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1981","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Christine Flores","height":"5' 2\" (1.57 m)","bio":"Christine Flores (born September 26, 1981), better known as Christina Milian is an American singer, songwriter and actress. At the age of 19, Milian signed a contract with Def Jam. In 2001, Milian released her self-titled debut album, which featured the singles \"AM to PM\" and \"When You Look at Me\"; \"AM to PM\" charted within the Top 40 of the U.S. Billboard Hot 100 and both peaked in the top three on the UK Singles Chart. In 2004, Milian released her second studio album It's About Time, which provided her first major U.S. hit, \"Dip It Low\", which reached number five on the U.S. Billboard chart. \"Whatever U Want\" was released as the album's second single. Both singles charted within the Top 10 of the UK chart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDM0NzM3N15BMl5BanBnXkFtZTcwNzAyNjI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587396","name":"Christina Milian","idIMDB":"nm0587396"},"actorId":"nm0587396","character":"Isabelle Fuentes","urlCharacter":"http://www.imdb.com/character/ch0056890","main":true},{"actorName":"Rick Gonzalez","urlProfile":"http://www.imdb.com/name/nm0327779","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMzM4ODg4NF5BMl5BanBnXkFtZTgwNjg2ODA2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1979","placeOfBirth":" New York City, New York, USA","birthName":"Rick Gonzalez","height":"5' 8\" (1.73 m)","bio":"Rick Gonzalez was born on June 30th 1979 in New York City and raised in the Bushwick section of Brooklyn. He attended the \"Fame\" High School of performing arts where he studied Acting. Graduating in 1997 to pursue a career, Rick briefly worked in New York and later moved to Los Angeles to continue work. After two years of being in LA, Rick landed a role in the Disney film The Rookie (2002) opposite Dennis Quaid. Rick is now currently working on other projects set to be due out in the near future.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMzM4ODg4NF5BMl5BanBnXkFtZTgwNjg2ODA2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0327779","name":"Rick Gonzalez","idIMDB":"nm0327779"},"actorId":"nm0327779","character":"Stone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Tucker","urlProfile":"http://www.imdb.com/name/nm0006958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTk0MDc5Ml5BMl5BanBnXkFtZTcwMDcwMzA2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1982","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Jonathan Moss Tucker","height":"5' 10\" (1.78 m)","bio":"Jonathan is a film and television actor born in Boston, Massachusetts, May 31, 1982. While still in third grade, he was a part of a ballet production of \"The Nutcracker.\" After High School he earned admittance to Columbia University in New York City, but instead elected to pursue his acting career. His first credited appearances were in The Night Before Christmas (1994) (original title \"Botte di Natale\" and a.k.a. \"The Troublemakers\"), as Moses Junior and Two If by Sea (1996), as Todd.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTk0MDc5Ml5BMl5BanBnXkFtZTcwMDcwMzA2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006958","name":"Jonathan Tucker","nicknames":["Tuck","Moss"],"idIMDB":"nm0006958"},"actorId":"nm0006958","character":"Josh","urlCharacter":"http://www.imdb.com/character/ch0222442","main":true},{"actorName":"Samm Levine","urlProfile":"http://www.imdb.com/name/nm0505949","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc0YzZiYmUtODEyMC00MzYzLTliNmYtYzIzYmU1ZmM3Y2JlL2ltYWdlXkEyXkFqcGdeQXVyMDMwMTExMA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1982","placeOfBirth":" Chicago, Illinois, USA","birthName":"Samuel Franklin Levine","height":"5' 4\" (1.63 m)","bio":"Samm Levine's first breakout role was as a member of the \"geek\" half of the short lived cult hit, Freaks and Geeks (1999). The following year, he rejoined \"Freaks and Geeks\" producer, Judd Apatow, for another widely praised coming of age series, Undeclared (2001). That same year, Samm made his feature debut in the raucous teen spoof, Not Another Teen Movie (2001). Since then, he has appeared in over 60 films and television shows, including the Oscar winning Quentin Tarantino epic, Inglourious Basterds (2009), and in many memorable roles on beloved programs such as Entourage (2004), Modern Family (2009), NCIS (2003) and How I Met Your Mother (2005). In addition to his growing catalog of television appearances, Samm is also known for roles in many cult features, including the Broken Lizard comedy, Club Dread (2004), the sci-fi thriller, Pulse (2006), and acclaimed indie comedies, Drones (2010) and IFC's Made for Each Other (2009) Samm has also served as co-host and producer to Kevin Pollak's renowned celebrity talk show, Kevin Pollak's Chat Show (2009), since its inception in 2009 - a role he came into after his interview as a guest on the first episode.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc0YzZiYmUtODEyMC00MzYzLTliNmYtYzIzYmU1ZmM3Y2JlL2ltYWdlXkEyXkFqcGdeQXVyMDMwMTExMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0505949","name":"Samm Levine","idIMDB":"nm0505949"},"actorId":"nm0505949","character":"Tim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Octavia Spencer","urlProfile":"http://www.imdb.com/name/nm0818055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjcwMjcxNl5BMl5BanBnXkFtZTcwMjkwODg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1970","placeOfBirth":" Montgomery, Alabama, USA","birthName":"Octavia Lenora Spencer","height":"5' 2\" (1.57 m)","bio":"Spencer is a native of Montgomery, Alabama, which she claims is the proverbial buckle of the Bible belt. She's the sixth of seven siblings and holds a BS in Liberal Arts from Auburn University. A \"closet\" lover of acting, this practical Alabamian knew that she'd someday work in the film industry, but never dreamed it would be in front of the camera. In 1995, acclaimed director Joel Schumacher changed all that by giving her a small part opposite Sandra Bullock in the hit film A Time to Kill, and Spencer was on her way. In 1996, she teamed up with Bullock again in Bullock's directorial debut of Making Sandwiches, a short film that premiered at the 1997 Sundance Film Festival. Spencer made her stage debut in Los Angeles and originated the role of \"LaSonia\" (pronounced lasagna) in famed writer/director Del Shore's, The Trials and Tribulations of a Trailer Trash Housewife, starring opposite veteran actors Beth Grant, Dale Dickey and David Steen (2003). The play garnered Spencer and her fellow cast mates critical acclaim and a bevy of awards. Since then, Spencer has continued to see success as an actor in both film and television, working alongside Hollywood's elite. In February 2009, she was lauded by Los Angeles Times publication: The Envelope, for her brief but memorable performance in the Will Smith drama Seven Pounds.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjcwMjcxNl5BMl5BanBnXkFtZTcwMjkwODg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818055","name":"Octavia Spencer","idIMDB":"nm0818055"},"actorId":"nm0818055","character":"Landlady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Rifkin","urlProfile":"http://www.imdb.com/name/nm0726492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjY4MzkyMV5BMl5BanBnXkFtZTcwNDg3MDA3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1939","placeOfBirth":" New York City, New York, USA","birthName":"Saul M. Rifkin","height":"5' 9\" (1.75 m)","bio":"Ron Rifkin was born on October 31, 1939 in New York City, New York, USA as Saul M. Rifkin. He is known for his work on Alias (2001), L.A. Confidential (1997) and Négociateur (1998). He has been married to Iva Rifkin since 1966.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNjY4MzkyMV5BMl5BanBnXkFtZTcwNDg3MDA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0726492","name":"Ron Rifkin","idIMDB":"nm0726492"},"actorId":"nm0726492","character":"Dr. Waterson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Gatt","urlProfile":"http://www.imdb.com/name/nm1395532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODY5MjkyNl5BMl5BanBnXkFtZTcwMzMyNzEwMg@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1974","placeOfBirth":" Notting Hill, London, England, UK","height":"6' 1\" (1.85 m)","bio":"Born and raised in London. Gatt first got the acting bug when his Maltese parents took him to see Star Wars at the age of 8 and he decided to be Han Solo when he was older. He began his professional training at Sylvia Young Theater School and then followed that with a 3 year acting and music theater course at the Mountview Academy of Theater Arts, graduating with a degree. He has a brief stint in the British Royal Marines. He quickly found work in the West End, starring in productions including \"Miss Saigon\" and \"Jesus Christ Superstar.\" After moving to the U.S., he immediately booked a lead role in the thriller feature, \"Pulse,\" opposite Kristen Bell. Gatt is perhaps best known as the motion capture performer and likeness for 'Kratos' from the acclaimed \"God Of War\" video game franchise as well as the voice of 'Lord Scourge' in the hugely popular \"Star Wars: The Old Republic.\" He most recently (2011) appeared as the Frost Giant villain, 'Grundroth' in Marvel's box-office smash \"THOR,\" and will next been seen portraying humanoid Starfleet 'Science Officer 0718' in the highly anticipated sequel, \"Star Trek Into Darkness\" from J.J. Abrams. Additionally, Gatt's notable television guest star credits include NBC's \"Chuck,\" Fox's \"Breaking In,\" Adult Swim's \"Eagleheart,\" David E. Kelley's \"Wonder Woman\" pilot for NBC and a fan-favorite recurring arc on Cinemax's new (2012) hit series, \"Banshee.\" He resides in Los Angeles. Gatt has a condition called alopecia universalis which made all of his hair fall out at the age of 14.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODY5MjkyNl5BMl5BanBnXkFtZTcwMzMyNzEwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1395532","name":"Joseph Gatt","idIMDB":"nm1395532"},"actorId":"nm1395532","character":"Dark Figure","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kel O'Neill","urlProfile":"http://www.imdb.com/name/nm0642221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzY2NzQyOV5BMl5BanBnXkFtZTcwNjM3MTkzMQ@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Kel O'Neill is an actor and director, known for Domino (2005), Pulse (2006) and Easier with Practice (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzY2NzQyOV5BMl5BanBnXkFtZTcwNjM3MTkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0642221","name":"Kel O'Neill","idIMDB":"nm0642221"},"actorId":"nm0642221","character":"Douglas Zieglar","urlCharacter":"http://www.imdb.com/character/ch0222443","main":true},{"actorName":"Zach Grenier","urlProfile":"http://www.imdb.com/name/nm0340260","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3MzQxMDAxN15BMl5BanBnXkFtZTgwODMwNTk5ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1954","placeOfBirth":" Englewood, New Jersey, USA","birthName":"James Hampton Grenier","height":"5' 9\" (1.75 m)","bio":"Zach Grenier was born on February 12, 1954 in Englewood, New Jersey, USA as James Hampton Grenier. He is an actor, known for Fight Club (1999), The Good Wife (2009) and Deadwood (2004). He is married to Lynn Bailey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3MzQxMDAxN15BMl5BanBnXkFtZTgwODMwNTk5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340260","name":"Zach Grenier","idIMDB":"nm0340260"},"actorId":"nm0340260","character":"Professor Cardiff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Riki Lindhome","urlProfile":"http://www.imdb.com/name/nm1641251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNzM1NTkxOTleQTJeQWpwZ15BbWU3MDUwNDU2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1979","placeOfBirth":" Coudersport, Pennsylvania, USA","birthName":"Erika Joan Lindhome","height":"5' 9\" (1.75 m)","bio":"Riki Lindhome was born in Coudersport, Pennsylvania but grew up primarily in Portville, New York (near Buffalo). Her first break came when Tim Robbins cast her in his hit play, \"Embedded\", which played at the Public Theater in New York City, Riverside Studios in London and The Actor's Gang Theater in Los Angeles. Shortly after, Clint Eastwood cast her in her first film role, as \"Mardell Fitzgerald\" in Million Dollar Baby (2004). She also wrote and directed the award-winning short, Life Is Short (2006). Since then, she has found work in film, TV and commercials and performs in the LA-based comedy duo, Garfunkel & Oates, with Kate Micucci.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNzM1NTkxOTleQTJeQWpwZ15BbWU3MDUwNDU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1641251","name":"Riki Lindhome","nicknames":["Garfunkel"],"idIMDB":"nm1641251"},"actorId":"nm1641251","character":"Janelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Burke","urlProfile":"http://www.imdb.com/name/nm0992221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDc3NzkzNF5BMl5BanBnXkFtZTgwMjAyODgyMjE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"John Burke was born in Atlanta, Georgia, USA. He is an actor, known for The Amazing Spider-Man (2012), Sicario (2015) and R.I.P.D. (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDc3NzkzNF5BMl5BanBnXkFtZTgwMjAyODgyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0992221","name":"John Burke","idIMDB":"nm0992221"},"actorId":"nm0992221","character":"Newscaster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike J. Regan","urlProfile":"http://www.imdb.com/name/nm0716450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzk5MDA5M15BMl5BanBnXkFtZTYwODUzNDk2._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1969","placeOfBirth":" San Diego, California, USA","birthName":"Michael Jay Regan","bio":"Mike J. Regan was born on March 29, 1969 in San Diego, California, USA as Michael Jay Regan. He is known for his work on Drive Angry (2011), Blade (1998) and How the Grinch Stole Christmas (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzk5MDA5M15BMl5BanBnXkFtZTYwODUzNDk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0716450","name":"Mike J. Regan","nicknames":["The Machine"],"idIMDB":"nm0716450"},"actorId":"nm0716450","character":"Phantom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Tom","urlProfile":"http://www.imdb.com/name/nm0003493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjY2MzEwNV5BMl5BanBnXkFtZTcwNjQzNzQ3Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1953","placeOfBirth":" Houston, Texas, USA","height":"6' 2\" (1.88 m)","bio":"Steve Tom was born on September 20, 1953 in Houston, Texas, USA. He is an actor, known for Major Crimes (2012), Dumb and Dumber To (2014) and Funny or Die Presents... (2010). He was previously married to Elaine Mudrick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjY2MzEwNV5BMl5BanBnXkFtZTcwNjQzNzQ3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003493","name":"Steve Tom","idIMDB":"nm0003493"},"actorId":"nm0003493","character":"Male Newscaster #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0454919","urlIMDB":"http://www.imdb.com/title/tt0454919","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,203,822","country":"USA","day":"13","month":"08","year":"2006","remarks":""}],"gross":[{"money":"$20,259,297","country":"USA","day":"08","month":"10","year":"2006","remarks":""},{"money":"$20,230,986","country":"USA","day":"01","month":"10","year":"2006","remarks":""},{"money":"$20,152,152","country":"USA","day":"24","month":"09","year":"2006","remarks":""},{"money":"$19,950,417","country":"USA","day":"17","month":"09","year":"2006","remarks":""},{"money":"$19,703,256","country":"USA","day":"10","month":"09","year":"2006","remarks":""},{"money":"$19,271,985","country":"USA","day":"03","month":"09","year":"2006","remarks":""},{"money":"$17,838,695","country":"USA","day":"27","month":"08","year":"2006","remarks":""},{"money":"$14,695,988","country":"USA","day":"20","month":"08","year":"2006","remarks":""},{"money":"$8,203,822","country":"USA","day":"13","month":"08","year":"2006","remarks":""}],"weekendGross":[{"money":"$15,157","country":"USA","day":"08","month":"10","year":"2006","remarks":"39 Screens"},{"money":"$47,813","country":"USA","day":"01","month":"10","year":"2006","remarks":"104 Screens"},{"money":"$133,612","country":"USA","day":"24","month":"09","year":"2006","remarks":"220 Screens"},{"money":"$109,941","country":"USA","day":"17","month":"09","year":"2006","remarks":"193 Screens"},{"money":"$277,825","country":"USA","day":"10","month":"09","year":"2006","remarks":"367 Screens"},{"money":"$789,161","country":"USA","day":"03","month":"09","year":"2006","remarks":"787 Screens"},{"money":"$1,610,097","country":"USA","day":"27","month":"08","year":"2006","remarks":"1,608 Screens"},{"money":"$3,519,889","country":"USA","day":"20","month":"08","year":"2006","remarks":"2,323 Screens"},{"money":"$8,203,822","country":"USA","day":"13","month":"08","year":"2006","remarks":""}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"06","month":"06","year":"2005","remarks":null},null],"copyrightHolder":"The Weinstein Company"},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Abis Studio, Bucharest, Romania (dailies)","FotoKem Laboratory, Burbank (CA), USA (dailies)","Technicolor, Hollywood (CA), USA (release prints)"],"filmLength":["2,370 m (Portugal, 35 mm)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Super 35"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"4.7","metascore":"27","filmingLocations":[{"location":"Castel Film Studios, Bucharest, Romania"}],"rated":"PG-13","awards":[{"award":"Golden Trailer Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Horror","names":[]}]}]}],"votes":"25,546","type":"Movie","companyCreditsSimple":[{"idCompany":"co0150452","name":"Weinstein Company, The"},{"idCompany":"co0037852","name":"Distant Horizon"},{"idCompany":"co0038165","name":"Neo Art & Logic"}],"keywords":{"keywords":["technology","computer","computer hacker","e mail","cell phone","virus","suicide","psychology","epidemic","parasite","2000s","teen horror","teen movie","key","maggot","cockroach","goth","locker room","impalement","portal","near death experience","escape","survival","false accusation","computer cracker","reverse footage","elevator","screaming","psychological thriller","jumping from height","car radio","pizza","beer","alarm clock","coffee","end of the world","apocalypse","black bra","stealing a car","helicopter","airplane","airplane crash","exploding airplane","bathtub","paranoia","fear","fantasy sequence","surrealism","suspense","answering machine","filmed killing","video recording","open ended","one word title","flashback","landlady","mechanic","power outage","hallucination","subjective camera","character's point of view camera shot","mass death","decomposing body","supernatural","soul harvesting","demon","evil spirit","ghost","laundromat","psychiatrist","security guard","death of boyfriend","security camera","interracial friendship","ohio","race against time","computer virus","surveillance","media coverage","no cell phone signal","news report","diner","social commentary","bar","key above door","blinking lights","surreal video","555 phone number","instruction","poster","washing laundry","laundry room","cell phone tower","video surveillance","peep hole","psychotherapy","loufa","bubble bath","time lapse photography","riding bus","personal computer","lesion","scream","color red","climbing through a transom","volkswagen beetle","call for help","sucking life out","hanged by the neck","some scenes in sepia","plastic curtain","overhead camera shot","startled","walking alone at night","uh 60 blackhawk helicopter","tube table lamp","transom","stairwell","specter","some scenes in black and white","running for your life","reboot computer","psychology class","plead for help","person seen only in mirror","pencil in hair","nightmare","newscast","map of united states","looking at self in mirror","life force sucked out","library","handgun","guilt","flash drive","fire","elevator stuck between floors","eerie image","duct tape","disintegration","conquest","the color red","car crash","bounced check","book bag","behavior change","attacked by an alien","applying mascara","apply lipstick","alien invasion","television news","stalking","restroom","red duct tape","metal detector","laundry","eye","bus","bead curtain","bath","horror movie remake","remake of asian film","high jump","falling from height","text messaging","tape","professor","internet","instant messaging","hanging","death","dead","college","college student","college campus","campus","boyfriend girlfriend relationship","apartment","remake","remake of japanese film","death of friend","title spoken by character","surprise ending","dripping faucet"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:13:43"}}