{"data":{"movies":[{"title":"The Notorious Bettie Page","originalTitle":"","year":"2005","releaseDate":"20060505","directors":[{"name":"Mary Harron","id":"nm0366004"}],"writers":[{"name":"Mary Harron","id":"nm0366004"},{"name":"Guinevere Turner","id":"nm0877587"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDcwNzQyNV5BMl5BanBnXkFtZTcwNTgwNTIzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama"],"plot":"Portrait of an American innocent. In 1955, Bettie Page (1923-2008 ) waits to testify before a Senate subcommittee investigating the effects of pornographic material on American adolescents and juveniles. In flashbacks, we see her childhood in Tennessee, a brief marriage, a gang rape, and her going to New York City in 1949. There she takes acting lessons, models for photos, and acts in short films for adults, earning the nickname, \"The Pin-Up Queen of the Universe.\" We see her relationship with merchants Irving and Paula Klaw, photographers John Willie and Bunny Yeager, boyfriends, and the public. Through it all, she is wholesome, sporting, and forthright - Eve before the fall.","simplePlot":"The life of , a 1950s pin-up model and one of the first sex icons in America, who became the target of a Senate investigation due to her risqué bondage photos.","actors":[{"actorName":"Gretchen Mol","urlProfile":"http://www.imdb.com/name/nm0001543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODU1Njg1MV5BMl5BanBnXkFtZTcwODcwODQzMQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1972","placeOfBirth":" Deep River, Connecticut, USA","height":"5' 6\" (1.68 m)","bio":"Gretchen Mol was born November 8, 1972, in Deep River, Connecticut, the daughter of a school principal and his artist wife. Deep River is a small community located on the Chester Bowles Highway (Rt. 9), nine miles northwest of Old Saybrook (home of the legendary Katharine Hepburn), within commuting distance of New York City. The young Gretchen was bit by the acting bug and participated in high school theatrics, then moved to the Big Apple as a teenager to study acting and musical theater at the American Musical and Dramatic Academy and at the William Esper Studio. Although only 5'6\" tall--too short for a traditional modeling career--her unique beauty brought her modeling jobs as she pursued her dream of becoming a professional actress. She began appearing in magazines in 1994, meanwhile working at such time-honored Manhattan jobs as restaurant hat-check girl. It was while working that gig she was discovered by a talent agent. The agent landed her her first acting job, a TV commercial for Coca-Cola. She continued to hone her acting skills in summer stock, appearing in such productions as \"Bus Stop\", \"No Exit\" and \"Godspell\". The 23-year-old Gretchen made her film debut in Spike Lee's Girl 6 (1996), a small role that came to her, as luck would have it, after she had gone for an audition for the soap opera Guiding Light (1952). Her career began to take off, and she appeared in small parts, mostly \"girlfriend\" roles, in such films as Rounders (1998) starring 'Matt Damon' (qav) and in Woody Allen's Celebrity (1998), opposite Kenneth Branagh and Leonardo DiCaprio. Gretchen was touted as the \"Next Big Thing\" after appearing on the cover of the September 1998 issue of \"Vanity Fair\". Her most memorable role up to that time was as a mobster's moll in the minor cult classic Donnie Brasco (1997), which was mostly remembered for cinematic turns by Al Pacino, Johnny Depp and Anne Heche. Nonetheless, her beauty and presence led \"Vanity Fair\" to hype the beautiful blonde, heralding the arrival of a major new star. She seemed poised to move up to featured roles. but the announcement turned out to be premature. Brunette Angelina Jolie proved to be Hollywood's Next \"It\" girl. During the seven years that followed the \"Vanity Fair\" cover story, Mol continued to appear in films and on the stage, including the part of Jennie in the London and New York productions of Neil LaBute's \"The Shape of Things\" in 2001 (she also appeared in the film version, The Shape of Things (2003)). The good reviews she got proved that she was not just another pretty face. In 2004 she displayed her singing and dancing chops by playing Roxie Hart in the Broadway production of \"Chicago.\" She worked steadily, appearing in another small role in Woody Allen's Sweet and Lowdown (1999), and eventually won the lead in David E. Kelley TV series Girls Club (2002). The series bombed, however, and was canceled after only two episodes. Nevertheless, the intervening period allowed her to develop as an actress. In 2004 the blonde beauty finally had the role that proved to be her acting breakthrough: brunette 1950s \"stag queen\" Bettie Page in The Notorious Bettie Page (2005). Many brunettes have gone blonde, but Mol--the blonde who went brunette--rocked the screen with her presence. Her embodiment of the legendary Page garnered excellent reviews and propelled the flick into art house hit status. Mol married film director Tod Williams on June 1, 2004, and they became parents a little over three years later, when a son, Ptolemy John Williams, was born on October 10, 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODU1Njg1MV5BMl5BanBnXkFtZTcwODcwODQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001543","name":"Gretchen Mol","idIMDB":"nm0001543"},"actorId":"nm0001543","character":"Bettie Page","urlCharacter":"http://www.imdb.com/character/ch0026794","main":true},{"actorName":"Chris Bauer","urlProfile":"http://www.imdb.com/name/nm0061777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTA3NzY0MF5BMl5BanBnXkFtZTgwNTMwNDU3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1966","placeOfBirth":" Los Angeles, California, USA","birthName":"Mark Christopher Bauer","height":"6' 0½\" (1.84 m)","bio":"Chris Bauer was born on October 28, 1966 in Los Angeles, California, USA as Mark Christopher Bauer. He is an actor, known for True Blood (2008), The Wire (2002) and Survivor's Remorse (2014). He has been married to Laura Bauer since May 12, 1997. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTA3NzY0MF5BMl5BanBnXkFtZTgwNTMwNDU3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0061777","name":"Chris Bauer","idIMDB":"nm0061777"},"actorId":"nm0061777","character":"Irving Klaw","urlCharacter":"http://www.imdb.com/character/ch0411799","main":true},{"actorName":"Jared Harris","urlProfile":"http://www.imdb.com/name/nm0364813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ3MDYwM15BMl5BanBnXkFtZTcwNTE5MjQ1Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1961","placeOfBirth":" London, England, UK","birthName":"Jared Francis Harris","height":"5' 11¾\" (1.82 m)","bio":"Jared Francis Harris was born in London, England. He is the son of Irish actor Richard Harris and Welsh actress Elizabeth Harris (Elizabeth Rees), and brother of Damian Harris and Jamie Harris. Despite his lineage, Jared showed little interest in becoming an actor, until he was cast in a college production while attending North Carolina's Duke University (USA), where he studied drama and literature, in the early 1980s. After graduation, Jared returned to the UK where he attended Central School of Speech and Drama, along such future stars as Jason Isaacs and James Nesbitt. After graduation, Jared joined the Royal Shakespeare Company, performing in Mark Rylance's Hamlet, Romeo & Juliet, the Silent Woman and A Clockwork Orange. In 1989, he had his screen debut in The Rachel Papers (1989). In 1990, while on vacation in New York, Jared auditioned for the role of Hotspur in Henry IV part 1, which he played at the New York Shakespeare Festival. Still in New York, Jared appeared in the off-Broadway play Ecstasy, for which he won an Obie Award in 1992. In 1996, he won recognition by playing famous pop artist Andy Warhol in I Shot Andy Warhol (1996). After that success, Jared has gone on to many independent films, with a few titles being: Natural Born Killers (1994), Smoke (1995), Happiness (1998), Comment tuer le chien de son voisin (2000), Igby Goes Down (2002), B. Monkey (1998), Shadow Magic (2000) and VH1's Two of Us (2000) where he portrayed John Lennon. He has also starred in blockbusters movies, including: The Last of the Mohicans (1992), Mr. Deeds (2002), Resident Evil: Apocalypse (2004), The Curious Case of Benjamin Button (2008), Sherlock Holmes: A Game of Shadows (2011), Lincoln (2012). And has created memorable characters on such popular TV shows as: The Riches (2007), Fringe (2008), Mad Men (2007). Jared is married to Allegra Riggio, a well-known lighting designer and TV host.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ3MDYwM15BMl5BanBnXkFtZTcwNTE5MjQ1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364813","name":"Jared Harris","nicknames":["Hot Buns"],"idIMDB":"nm0364813"},"actorId":"nm0364813","character":"John Willie","urlCharacter":"http://www.imdb.com/character/ch0481608","main":true},{"actorName":"Sarah Paulson","urlProfile":"http://www.imdb.com/name/nm0005299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTA3NjM4MV5BMl5BanBnXkFtZTcwNjk1NTAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1974","placeOfBirth":" Tampa, Florida, USA","birthName":"Sarah Catharine Paulson","height":"5' 6\" (1.68 m)","bio":"Sarah Paulson was born on December 17, 1974 in Tampa, Florida, to Catharine Gordon (Dolcater) and Douglas Lyle Paulson II. She spent most of her early years in New York and Maine, before settling in Manhattan to attend the American Academy of Dramatic Arts and the High School for Performing Arts. Although she made her Broadway debut in \"The Sisters Rosensweig\" and performed in the off-Broadway \"Talking Pictures\", she debuted on the small screen in late 1994 in a guest shot on NBC's Law & Order (1990), then, in the following spring, landed her first TV-movie role in CBS' Friends at Last (1995) and finally became a TV series regular by fall 1995. Best known for her amazing performance in CBS' supernatural drama American Gothic (1995) as the benevolent spiritual guide to her young brother, she was also a regular on the WB series Jack & Jill (1999) as \"Elisa Cronkite\", the former girlfriend of David \"Jill\" Jillefsky (Ivan Sergei) as well as the main character in the TV series Leap of Faith (2002), \"Faith Wardwell\", and as \"Audrey\" in the TV movie Metropolis (2000). She was also part of the cast of Shaughnessy (1996), The Long Way Home (1998) (as \"Leanne Bossert\") and Path to War (2002) as Luci Baines Johnson, as well as making notable appearances in Touched by an Angel (1994) playing \"Zoe\" in Touched by an Angel: Manhunt (2001), 20 October 2001, and Cracker: Mind Over Murder (1997) playing \"Nina\" in Cracker: Mind Over Murder: True Romance: Part 1 (1997), 18 September 1997. Sarah has now played in movies with such stars as Mel Gibson in the romantic comedy What Women Want (2000) (as \"Annie\", Gibson's secretary), Diane Keaton in the romantic drama The Other Sister (1999) (as \"Heather Tate\", Keaton's lesbian eldest daughter), Jamie Foxx in Held Up (1999) (as \"Mary\", a developmentally disabled young woman with an unfaithful boyfriend) and David Hyde Pierce in the romantic comedy Down with Love (2003) (as \"Vicky Hiller\", Pierce's crush). She also had two major roles in the comedy Bug (2002) and the drama, Levitation (1997), where she starred as a pregnant teenager who searches for her biological mother, with the help of a guardian angel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTA3NjM4MV5BMl5BanBnXkFtZTcwNjk1NTAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005299","name":"Sarah Paulson","idIMDB":"nm0005299"},"actorId":"nm0005299","character":"Bunny Yeager","urlCharacter":"http://www.imdb.com/character/ch0183386","main":true},{"actorName":"Cara Seymour","urlProfile":"http://www.imdb.com/name/nm0786806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjE3Njg3N15BMl5BanBnXkFtZTYwMTE1NTE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Cara Seymour was born in Essex, England. She is an actress, known for An Education (2009), American Psycho (2000) and Gangs of New York (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjE3Njg3N15BMl5BanBnXkFtZTYwMTE1NTE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0786806","name":"Cara Seymour","idIMDB":"nm0786806"},"actorId":"nm0786806","character":"Maxie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Strathairn","urlProfile":"http://www.imdb.com/name/nm0000657","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MjI5MDg2MF5BMl5BanBnXkFtZTcwNjgwNDM3NQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1949","placeOfBirth":" San Francisco, California, USA","birthName":"David Russell Strathairn","height":"5' 11½\" (1.82 m)","bio":"David Russell Strathairn was born on January 26, 1949 in San Francisco, California. He is the son of Mary Frances (Frazier), a nurse, and Thomas Scott Strathairn, Jr., a physician. He has two siblings, Tom and Anne. His ancestry includes English, Scottish, Irish, Portuguese, Native Hawaiian, and one sixteenth Chinese (the latter three from his paternal grandmother). Strathairn attended Williams College, where he demonstrated great interest in the theater, and first befriended John Sayles, with whom he would later frequently collaborate. Strathairn graduated college and traveled to Florida to visit with his grandfather, but the grandfather passed away while Strathairn was en route. Strathairn, finding himself freshly-arrived and without friends in Florida, decided instead to join the Ringling Brothers Clown College and subsequently worked as a clown for six months in a traveling circus. Relocating to New York State, he spent several years hitchhiking across America to work in local theaters during the summers. During one of these summers Strathairn reunited with Sayles, and this eventually resulted in his role in the highly regarded Return of the Secaucus Seven (1979), Sayle's directorial debut. Thereafter Strathairn developed an extensive resume of supporting roles, which became increasingly substantial as his stature in the industry grew; notable films include Lovesick (1983), Silkwood (1983), L.A. Confidential (1997), and A Map of the World (1999). Sayles frequently casts Strathairn, whose performances can be seen in Sayles' The Brother from Another Planet (1984), Matewan (1987), Eight Men Out (1988), City of Hope (1991), and Passion Fish (1992). Perhaps most notable of his collaborations with Sayles is his superb performance co-starring with Mary Elizabeth Mastrantonio in Limbo (1999). After a string of successful supporting roles in the early 2000s, Strathairn found himself thrust into the role of leading man with his performance as Edward R. Murrow in George Clooney's Good Night, and Good Luck. (2005) Taking on the role of the iconic newsman in the black-and-white drama, Strathairn garnered numerous award mentions including an Academy Award nomination for Best Actor. Following the success of that film, Strathairn traveled easily between low-budget independent films - The Notorious Bettie Page (2005), The Sensation of Sight (2006), My Blueberry Nights (2007), and Howl (2010) among them - and big-budget Hollywood productions, including We Are Marshall (2006), The Spiderwick Chronicles (2008), both The Bourne Ultimatum (2007) and The Bourne Legacy (2012), and Steven Spielberg's biopic Lincoln (2012), in which he plays Secretary of State William Seward. Strathairn has also worked extensively in television, and first became familiar to television viewers as the title character's boss in the series The Days and Nights of Molly Dodd (1987). In addition to narration work for many PBS shows, Strathairn has appeared in the TV series Big Apple (2001), The Sopranos (1999), Monk (2002), and heads the cast of the science-fiction series Alphas (2011). His work in television films has brought him an Emmy Award for Temple Grandin (2010) and an Emmy nominations for Hemingway & Gellhorn (2012). Strathairn married Logan Goodman in 1980, and the couple have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MjI5MDg2MF5BMl5BanBnXkFtZTcwNjgwNDM3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000657","name":"David Strathairn","idIMDB":"nm0000657"},"actorId":"nm0000657","character":"Estes Kefauver","urlCharacter":"http://www.imdb.com/character/ch0166397","main":true},{"actorName":"Lili Taylor","urlProfile":"http://www.imdb.com/name/nm0000666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNzAyMzA1ODZeQTJeQWpwZ15BbWU4MDAzNDQxNjkx._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1967","placeOfBirth":" Glencoe, Illinois, USA","birthName":"Lili Anne Taylor","height":"5' 2\" (1.57 m)","bio":"Lili Taylor is a well-known and successful American actress. She acts in film, TV and stage. She was born in Glencoe, Illinois, to Marie (Lecour) and George Park Taylor, an artist and hardware store operator. Lili graduated from New Trier High School in 1985. Then, she attended the Theatre School at DePaul University and the Piven Theatre Workshop. Lili first earned fame for acting in the 1988 movie, Mystic Pizza (1988), which co-starred Julia Roberts. Then, she acted in a number of successful movies, including Dogfight (1991) and Short Cuts (1993). But, she was more highly recognized for appearing in the 1996 film, I Shot Andy Warhol (1996), for which she was nominated for several awards. Lili's notable works for television include the TV series, Six Feet Under (2001), and in the television movies, Anne Frank (2001) and Live from Baghdad (2002). In 2009, she played \"Sheriff Lillian Holley\" in the movie, Public Enemies (2009). The movie co-starred Johnny Depp, with whom Lili also appeared in the 1993 movie, Arizona Dream (1993). Lili is also a successful stage actress. She has appeared in a number of plays staged on Broadway, including \"The Three Sisters\" (1997). Lili Taylor continues to act in stage, TV and film. She is married to Nick Flynn and they have a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNzAyMzA1ODZeQTJeQWpwZ15BbWU4MDAzNDQxNjkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000666","name":"Lili Taylor","idIMDB":"nm0000666"},"actorId":"nm0000666","character":"Paula Klaw","urlCharacter":"http://www.imdb.com/character/ch0434633","main":true},{"actorName":"John Cullum","urlProfile":"http://www.imdb.com/name/nm0191633","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDk5ODA5MV5BMl5BanBnXkFtZTYwNDI4OTky._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1930","placeOfBirth":" Knoxville, Tennessee, USA","bio":"John Cullum was born on March 2, 1930 in Knoxville, Tennessee, USA. He is an actor, known for Northern Exposure (1990), One Life to Live (1968) and Before We Go (2014). He has been married to Emily Frankel since May 5, 1959. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDk5ODA5MV5BMl5BanBnXkFtZTYwNDI4OTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191633","name":"John Cullum","idIMDB":"nm0191633"},"actorId":"nm0191633","character":"Preacher in Nashville","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt McGrath","urlProfile":"http://www.imdb.com/name/nm0569847","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTM4NTMxN15BMl5BanBnXkFtZTcwMjczMTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1969","placeOfBirth":" New York City, New York, USA","bio":"A chameleon-like actor who effortlessly glides between light comedy (The Broken Hearts Club: A Romantic Comedy (2000)), musical theater (Broadway's \"Cabaret\") and drama (Boys Don't Cry (1999)), Matt McGrath was hilarious as the Italian detective in Stanley Tucci's The Impostors (1998) and memorable as the annoying but adorable boyfriend in The Broken Hearts Club: A Romantic Comedy (2000). He has performed regionally on stages across the country and hones his craft in independent film gems, excelling in ensemble pieces. On the small screen, he turned in a chilling portrayal of real-life convicted killer Chris Pritchard in the TV mini-series, Cruel Doubt (1992), opposite Blythe Danner and Gwyneth Paltrow. He filmed a role in Anthony Minghella's The Talented Mr. Ripley (1999), but unfortunately ended up on the cutting room floor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTM4NTMxN15BMl5BanBnXkFtZTcwMjczMTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569847","name":"Matt McGrath","idIMDB":"nm0569847"},"actorId":"nm0569847","character":"Nervous Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Austin Pendleton","urlProfile":"http://www.imdb.com/name/nm0671721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzY4NjY1MzNeQTJeQWpwZ15BbWU3MDIzNjIzNjI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1940","placeOfBirth":" Warren, Ohio, USA","bio":"Actor Austin Pendleton was born March 27, 1940 in Warren, Ohio to Frances and Thorn Pendleton. He graduated from Yale University. He later became an ensemble member of the Steppenwolf Theater in Chicago, and acted in several of the theater's productions. His first film appearance in Petulia (1968), a minor and uncredited role. Since, he has made over 100 appearances in television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzY4NjY1MzNeQTJeQWpwZ15BbWU3MDIzNjIzNjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671721","name":"Austin Pendleton","idIMDB":"nm0671721"},"actorId":"nm0671721","character":"Teacher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Reedus","urlProfile":"http://www.imdb.com/name/nm0005342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODE4NTgzMl5BMl5BanBnXkFtZTcwODI0MjAwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1969","placeOfBirth":" Hollywood, Florida, USA","birthName":"Norman Mark Reedus","height":"5' 10\" (1.78 m)","bio":"Norman Reedus was born in Hollywood, Florida, to Marianne (Yarber), a teacher, and Norman Reedus. He is of Italian (from his paternal grandmother), English, Scottish, and Irish descent. Norman's first film was in Guillermo del Toro's 1997 horror thriller Mimic (1997), where he played the character Jeremy. He has also played roles in the films \"Floating\", Six Ways to Sunday (1997), Deuces Wild (2002), Blade II (2002), \"Gossip\", 8 mm (1999), American Gangster (2007), Hero Wanted (2008) and Moscow Chill. In 2005 he had a bit-part in Christian Alvart's Antibodies (2005) as a German policeman. In 2008 he starred in _Red Canyon_. Norman is perhaps best known for playing the role of Murphy MacManus in the 1999 movie The Boondock Saints (1999) opposite Sean Patrick Flanery and Willem Dafoe. He also starred opposite Flanery in the 2009 sequel The Boondock Saints II: All Saints Day (2009). He appeared at the 2012 Comic-Con in San Diego. As of 2010 he stars as Daryl Dixon in the AMC television series The Walking Dead (2010). The character was not originally in the comic book series of the same name, but was created specifically for Reedus after his audition for the character of Merle Dixon. The Walking Dead comic creator Robert Kirkman has stated he feels \"absolutely blessed [Reedus] has honored the show with his presence, and the way he has come in and taken over that role and defined Daryl Dixon. A lot of Norman's portrayal of the character in the first season inspired all the writers to do what we did with him in the second season. We love writing him and end up doing cool stuff with him.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODE4NTgzMl5BMl5BanBnXkFtZTcwODI0MjAwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005342","name":"Norman Reedus","idIMDB":"nm0005342"},"actorId":"nm0005342","character":"Billy Neal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dallas Roberts","urlProfile":"http://www.imdb.com/name/nm1316767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIzMjQzN15BMl5BanBnXkFtZTcwOTk4NTc2OQ@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1970","placeOfBirth":" Houston, Texas, USA","birthName":"Dallas Mark Roberts","height":"5' 10½\" (1.79 m)","bio":"A native of Houston, Texas, Roberts, who attended Juilliard, has lived in New York City for 14 years. He was nominated for a Drama Desk Award for his role in the Off-Broadway play, \"Nocturne,\" by Adam Rapp. He is married to Christine Jones, who is the Set Designer for Spring Awakening and a professor at NYU. They have two sons, one of whom is named Ever Reverend Jones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIzMjQzN15BMl5BanBnXkFtZTcwOTk4NTc2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1316767","name":"Dallas Roberts","idIMDB":"nm1316767"},"actorId":"nm1316767","character":"Scotty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Slezak","urlProfile":"http://www.imdb.com/name/nm0805789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDc0MzM0MF5BMl5BanBnXkFtZTcwMTY5NTU2OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1957","placeOfBirth":" Youngstown, Ohio, USA","birthName":"Victor Michael Szelazek","bio":"A staple of American stage, screen, and television for over 30 years, Victor Slezak hails from Youngstown, Ohio. Victor's earliest influences in entertainment came through the screen of Jack and Sam's Warner Brothers Theater, where his mother was a box office girl. So, too, was the black and white TV set in his parents' living room an early influence. He cites seeing Montgomery Clift in _Freud_, James Dean in Rebel Without a Cause (1955), and George C. Scott in the old East Side/West Side (1963) series as performances that piqued his earliest interest. The Franciscan nuns at Saint Stanislaus Grade School taught in the Jesuit mode, placing heavy weight on the correct use of language and oratory skill. Theatre was used as a teaching tool. At an early age, Victor's acting in, directing, and writing plays stemming from the Bible became a normal part of his daily routine and education. His talent and efforts gained recognition when he was asked to join a select handful of students in reading the Book of Genesis aloud to their church congregation. Toward the end of high school, after being selected and appearing in leads in the school plays, Victor's guidance counselor pulled him out of class to announce good news: he'd been awarded a scholarship to study acting at Ohio State. Victor turned it down. The summer before, Victor had spent 10 weeks as an apprentice at the Lakewood Musical Playhouse. There was another force and first love begging for his attention. From an early age he spent his free time making drawings in pencil and ink. He couldn't see himself pursuing acting as a career after seeing those amazing performers drawing their 75 dollar a week paycheck and no job after the ten weeks. So, at the ripe old age of 17, he moved to New York City to become a visual artist. He was on the fast track to become an advertising art director when a friend who worked as a scenic designer from that summer of stock called from out of the blue and asked Victor if he'd like to paint scenery for the venerable Chautauqua Opera Company in western New York state. Victor arranged for a brief leave of absence from the advertising firm. A life in the theatre had called to him by a most circuitous route. Victor never went back to the ad firm. When his work at Chautauqua ended, he landed a job stage managing variety acts - a country/western band, a juggler, and a magician - at the Cedar Point Amusement Park in Sandusky, Ohio. In an era before Amazon or Barnes and Noble existed, he began to hunt for books on acting. Victor's first introduction to Uta Hagen was in his Speech and Drama class where he heard a recording of \"Who's Afraid of Virginia Woolf\". His first professional jobs came from regional theatre, roles like Rodolfo in A View from the Bridge at the Berkshire Theatre Festival and several stints at Hartford Stage, including Eben in Desire Under the Elms playing opposite Frances Fisher; Whit in Of Mice and Men with fellow Youngstowner Ed O'Neill, and Algernon in The Importance of Being Ernest with Mary Louise Parker. Exceptional material and the chance to work with great artists kept Victor in New York when so many of his peers moved west to pursue Los Angeles. Stage jobs in the city soon beckoned. Victor's performance as Lachlen in The Hasty Heart at Mirror Repertory off-Broadway led to his being cast opposite Geraldine Page at the same venue in a Ibsen's Ghosts, directed by Austin Pendleton. Television jobs followed including a recurring role on ABC's \"Guiding Light\". Broadway beckoned in 1993. Victor played John Cleary in Frank Gilroy's Any Given Day (the precursor to The Subject was Roses) alongside Sada Thompson at the Longacre Theatre, following that playing Dr. Sugar in Tennessee Williams' Suddenly Last Summer at Circle in the Square with Elizabeth Ashley, JFK in Jackie: An American Life with Margaret Colin at the Belasco, Mr. Robinson in The Graduate with Kathleen Turner at the Plymouth Theatre, and John the Baptist in Salome with Al Pacino at the Barrymore Theatre. Film roles began to pop up as well: The Devil's Own (1997) directed by Alan J. Pakula with Harrison Ford and Brad Pitt; The Bridges of Madison County (1995) with Meryl Streep, directed by Clint Eastwood. After Uta Hagen's death in 2004, Victor received phone calls from HB Studios asking him to consider teaching. Harkening to a need to give back to the school and the craft that had nurtured him, he eventually agreed to work a class into his schedule \"I went to teach my first class and found that the Studio had put me in the same room where I'd first met Uta.\" Today, Victor serves on the Board of the HB Playwrights Foundation, a position he's held since 2009 and makes time each year to be a part of their CORE program. He is also a member of the Actor's Studio and The Ensemble Studio Theater. He is known throughout the industry for the research he brings to playing roles of particular power and complexity (Enrico Brulard, the totalitarian chef on HBO's _Treme_; the Deputy Director of CIA in John Singleton's feature Abduction; Jamie Tyrone in Eugene O'Neill's Moon for the Misbegotten at the Pittsburgh Public Theatre; Mike Wallace in the Broadway-bound musical Superfly, directed by Bill T. Jones). Victor still approaches his roles with a painter's eye.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDc0MzM0MF5BMl5BanBnXkFtZTcwMTY5NTU2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0805789","name":"Victor Slezak","idIMDB":"nm0805789"},"actorId":"nm0805789","character":"Minister in Miami","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tara Subkoff","urlProfile":"http://www.imdb.com/name/nm0836964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDQwMTc1OF5BMl5BanBnXkFtZTYwNDM5Nzg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1972","placeOfBirth":" Westport, Connecticut, USA","birthName":"Tara Lyn Subkoff","height":"5' 2\" (1.57 m)","bio":"Tara Subkoff was born on December 10, 1972 in Westport, Connecticut, USA as Tara Lyn Subkoff. She is an actress and producer, known for As Good as It Gets (1997), The Cell (2000) and All Over Me (1997). She has been married to Urs Fischer since October 24, 2014. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDQwMTc1OF5BMl5BanBnXkFtZTYwNDM5Nzg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0836964","name":"Tara Subkoff","idIMDB":"nm0836964"},"actorId":"nm0836964","character":"June","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Carroll","urlProfile":"http://www.imdb.com/name/nm0140887","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNDgyMjg1OF5BMl5BanBnXkFtZTgwNTc2Nzc0NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Kevin Carroll is an actor, known for Being John Malkovich (1999), Paid in Full (2002) and Margaret (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNDgyMjg1OF5BMl5BanBnXkFtZTgwNTc2Nzc0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0140887","name":"Kevin Carroll","idIMDB":"nm0140887"},"actorId":"nm0140887","character":"Jerry Tibbs","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0404802","urlIMDB":"http://www.imdb.com/title/tt0404802","business":{"budget":null,"openingWeekend":[{"money":"$143,131","country":"USA","day":"16","month":"04","year":"2006","remarks":"20 Screens"}],"gross":[{"money":"$1,410,778","country":"USA","day":"25","month":"06","year":"2006","remarks":""},{"money":"$1,398,734","country":"USA","day":"18","month":"06","year":"2006","remarks":""},{"money":"$1,374,990","country":"USA","day":"11","month":"06","year":"2006","remarks":""},{"money":"$1,326,232","country":"USA","day":"04","month":"06","year":"2006","remarks":""},{"money":"$1,248,582","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$1,126,195","country":"USA","day":"21","month":"05","year":"2006","remarks":""},{"money":"$1,002,219","country":"USA","day":"14","month":"05","year":"2006","remarks":""},{"money":"$823,586","country":"USA","day":"07","month":"05","year":"2006","remarks":""},{"money":"$622,702","country":"USA","day":"30","month":"04","year":"2006","remarks":""},{"money":"$391,514","country":"USA","day":"23","month":"04","year":"2006","remarks":""},{"money":"$143,131","country":"USA","day":"16","month":"04","year":"2006","remarks":""}],"weekendGross":[{"money":"$5,309","country":"USA","day":"25","month":"06","year":"2006","remarks":"18 Screens"},{"money":"$10,115","country":"USA","day":"18","month":"06","year":"2006","remarks":"31 Screens"},{"money":"$22,394","country":"USA","day":"11","month":"06","year":"2006","remarks":"50 Screens"},{"money":"$50,507","country":"USA","day":"04","month":"06","year":"2006","remarks":"63 Screens"},{"money":"$80,515","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$65,077","country":"USA","day":"21","month":"05","year":"2006","remarks":"63 Screens"},{"money":"$109,325","country":"USA","day":"14","month":"05","year":"2006","remarks":"67 Screens"},{"money":"$132,402","country":"USA","day":"07","month":"05","year":"2006","remarks":"73 Screens"},{"money":"$156,760","country":"USA","day":"30","month":"04","year":"2006","remarks":"66 Screens"},{"money":"$186,309","country":"USA","day":"23","month":"04","year":"2006","remarks":"52 Screens"},{"money":"$143,131","country":"USA","day":"16","month":"04","year":"2006","remarks":"20 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min) (USA)","1 hr 40 min (100 min) (Toronto International) (Canada)"],"soundMix":["Dolby Digital"],"color":["Black and White","Color"],"aspectRatio":["1.85 : 1"],"camera":["Arricam LT, Cooke S4 Lenses","Arricam ST, Cooke S4 Lenses","Bolex Camera"],"laboratory":["DuArt Film Laboratories Inc., New York, USA"],"filmLength":null,"negativeFormat":["16 mm (Eastman Double-X 7222)","35 mm (Eastman Plus-X 5231, EXR 100T 5248)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm (partial blow-up) (Kodak Vision 2383)"]},"rating":"6.6","metascore":"64","filmingLocations":[{"location":"New York, USA"}],"rated":"R","awards":[{"award":"Alliance of Women Film Journalists 2006","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Special Mention Award","categories":[{"category":"Best Depiction of Nudity or Sexuality","names":[]}]}]},{"award":"Golden Trailer Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Most Original","names":[]}]}]},{"award":"Satellite Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Actress in a Motion Picture, Drama","names":[{"name":"Gretchen Mol","id":"nm0001543","role":null}]}]}]}],"votes":"9,184","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005861","name":"HBO Films"},{"idCompany":"co0030755","name":"Killer Films"},{"idCompany":"co0037310","name":"John Wells Productions"}],"keywords":{"keywords":["bondage","1950s","senate","pin up","investigation","model","senate subcommittee","photographer","new york city","acting","flashback","acting lesson","rape","pornography","icon","gang rape","pin up girl","f rated","born again christian","female pubic hair","female protagonist","female frontal nudity","female nudity","child molestation","abusive father","sin","religion","nashville tennessee","beauty pageant","beach","sexual awakening","sexual abuse","photography","censorship","testifying before congress","fetish","christianity","bare butt","1940s","1930s","city","sex","marriage","triple f rated","breasts","female full frontal nudity","nude photo shoot","street","8mm film","burning a photograph","church service","playboy centerfold","playboy model","notoriety","morality","ball gag","microphone","news photographer","late night","beer drinking","wine drinking","alcohol","off screen rape","rape victim","woman in underwear","saying grace","family dinner","female rear nudity","pubic hair","photo session","bound at the wrists","film projector","woman in trunk","bound and gagged","outdoor photography","shoe fetish","fetishism","foot fetish","bondage ropes","thigh boots","photographing naked woman","posing for photograph","amateur photographer","nude photography","erotic photography","large format camera","medium format camera","female photographer","handheld camera","film camera","kissing while having sex","fellatio","title directed by female","cheesecake","brooklyn new york city","manhattan new york city","whip","wedding","wedding ring","vanderbilt university","upside down image","u.s. soldier","u.s. army","typing","typewriter","theatre marquee","teenage girl","tears","teacher","swimsuit","sunbathing","stiletto heels","stained glass window","spanking","song","sister sister relationship","singing","singer","sermon","secretarial school","s&m","riding crop","revival meeting","restaurant","receptionist","race relations","prologue","prayer","pots and pans","porno shop","police","policeman","picnic","photograph","photo shoot","park","oral sex","nudity","nudist","newsreel footage","naivety","movie projector","mother son relationship","mother daughter relationship","montage","modeling","minister","military enlistment","miami beach","merry go round","magazine cover","letter","lawyer","hypocrisy","hymn","high heels","hair styling","food","flagellation","filmmaking","filmmaker","film director","fight","father daughter relationship","family relationships","family abandonment","face slap","date","dancing","dancer","crying","croquet","costume","controversy","coney island","compact","communism","coffee","cigarette smoking","christmas","christian","choir","child abuse","cha cha","central park manhattan new york city","carousel","camera","cafe","bus","bus stop","brother sister relationship","boots","boardwalk","billboard","bible","bench","beaver","beauty contest","bar","audition","actress","actor","acting teacher","acting class","nostalgia","irreverence","prejudice","screen test","friend","courtroom","church","showbiz","sexuality","pop culture","dream girl","domestic violence","acting school","rise and fall","magazine","innocence lost","friendship","16mm film","black and white segues into color","black & white to color","reference to playboy magazine","pornography filmmaking","reference to tarzan","reference to stanislavsky","reference to marilyn monroe","reference to jesus christ","african american","film within a film","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:09:04"}}