{"data":{"movies":[{"title":"Nim's Island","originalTitle":"","year":"2008","releaseDate":"20080404","directors":[{"name":"Jennifer Flackett","id":"nm0280814"},{"name":"Mark Levin","id":"nm0505662"}],"writers":[{"name":"Joseph Kwong","id":"nm0477279"},{"name":"Paula Mazur","id":"nm0563394"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0OTk0NjIwMDleQTJeQWpwZ15BbWU3MDg3NjM0NTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy","Family","Fantasy"],"plot":"Nim Rusoe is a girl who joins her father, a scientist, when he does research on marine life on an island. It's just the two of them but she spends her time making friends with all the animals she encounters, chatting on the computer and reading the adventure books of Alex Rover. When her father goes to do some research but when a storm strikes the island he doesn't come back, she gets worried and frightened. She then e-mails Alex Rover hoping that he will come but what she doesn't know is that Alex Rover is a woman who is agoraphobic and germaphobic. But her creation comes to life and eggs her to go. Unfortunately she has never gone anywhere before and is denied her necessities like her sanitary gel by the customs officer at the airport. In the meantime, Nim tries to be strong while waiting for Alex to arrive.","simplePlot":"A young girl inhabits an isolated island with her scientist father and communicates with a reclusive author of the novel she's reading.","actors":[{"actorName":"Abigail Breslin","urlProfile":"http://www.imdb.com/name/nm1113550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU5MTA5MzYzOF5BMl5BanBnXkFtZTcwODc4OTIxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1996","placeOfBirth":" New York City, New York, USA","birthName":"Abigail Kathleen Breslin","height":"5' 1\" (1.55 m)","bio":"Academy Award-nominated actress Abigail Breslin is one of the most sought-after actors of her generation. Her unique and charismatic talents have contributed to her versatile roles in both comedy and drama. Most recently, Breslin starred in the first season of the horror-comedy series, \"Scream Queens\" opposite Emma Roberts, Lea Michele and Jamie Lee Curtis. Next, Breslin will star in the coveted role of \"Baby\" in ABC/Lionsgate's recreation of the pop-culture classic, \"Dirty Dancing.\" On the big screen, Breslin was most recently seen in the Lionsgate film \"Maggie\" opposite Arnold Schwarzenegger. The film follows a teenage girl (Breslin) from a small town in the Midwest, who becomes infected by a disease that slowly turns her into a zombie. The film premiered at the 2015 Tribeca Film Festival in New York and was released on May 8, 2015. In October of 2015, Harper Collins published Breslin's first book \"This May Sound Crazy\". The book is based on her popular Tumblr \"Mixtapes & Winter Coats,\" in which she writes honest, funny and emotional observations on her daily life as a young adult. Breslin was seen in The Weinstein Company film \"August: Osage County\" opposite Meryl Streep, Ewan McGregor, Julia Roberts, Sam Shepard, Dermot Mulroney and Juliette Lewis. She starred in the coveted role of 'Jean Fordham' the daughter of Julia Roberts' and Ewan McGregor's characters. Most widely recognized for her role in the critically-acclaimed \"Little Miss Sunshine,\" the irreverent, antic comedy which created a sensation at the 2006 Sundance Film Festival, Breslin played the role of 'Olive,' an ambitious young girl who is obsessed with winning a beauty pageant. For her performance, she received a Best Actress Award from the Tokyo International Film Festival and was nominated for an Academy Award, SAG and BAFTA Best Supporting Actress awards. In addition, she was honored as ShoWest's \"Female Star of Tomorrow\" in 2008, and made her Broadway debut in 2010 in \"The Miracle Worker.\" Other film credits include \"Enders Game,\" \"Haunter,\" \"The Call,\" \"Rango,\" \"Janie Jones,\" \"Zombieland,\" \"My Sister's Keeper,\" \"New Year's Eve,\" \"Raising Helen, \"The Ultimate Gift,\" \"Santa Claus 3,\" \"No Reservations,\" \"Definitely Maybe,\" \"Nim's Island,\" \"Kit Kittredge: An American Girl\" and M. Night Shyamalan's 2012 film \"Signs\" opposite Mel Gibson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU5MTA5MzYzOF5BMl5BanBnXkFtZTcwODc4OTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1113550","name":"Abigail Breslin","nicknames":["Abbie"],"idIMDB":"nm1113550"},"actorId":"nm1113550","character":"Nim Rusoe","urlCharacter":"http://www.imdb.com/character/ch0059627","main":true},{"actorName":"Jodie Foster","urlProfile":"http://www.imdb.com/name/nm0000149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjgyOTQwNF5BMl5BanBnXkFtZTcwMDczMzEwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1962","placeOfBirth":" Los Angeles, California, USA","birthName":"Alicia Christian Foster","height":"5' 3\" (1.6 m)","bio":"Alicia Christian Foster was born in Los Angeles on November 19, 1962. She is the daughter of Evelyn Ella \"Brandy\" (Almond) and Lucius Fisher Foster III, an Air Force lieutenant colonel and later real estate broker. Brandy had filed for divorce in 1959 after having three children with Lucius, but the exes had a brief re-encounter in 1962 which resulted in Alicia's birth. Her older siblings nicknamed her \"Jodie\", a name she has used in her profession. She started her career at the age of two and made commercials for four years before making her debut as an actress in the TV series Mayberry R.F.D. (1968), on which her brother, Buddy Foster, was a regular. She stayed very busy as a child actress, working on television programs such as The Doris Day Show (1968), Adam-12 (1968), The Courtship of Eddie's Father (1969), The Partridge Family (1970), Bonanza (1959), and Gunsmoke (1955). In movies, her roles included playing Raquel Welch's daughter in Kansas City Bomber (1972) and a delinquent tomboy in Alice Doesn't Live Here Anymore (1974). Jodie first drew attention from critics with her appearance in Martin Scorsese's Taxi Driver (1976) alongside Robert De Niro and Harvey Keitel, where she played a prostitute at the tender age of 12 (she was 13 when the movie premiered) and received her first Oscar nomination as Best Supporting Actress. She went on to have a very successful career in her early teens with leading roles in the Disney films Freaky Friday (1976) with Barbara Harris and Candleshoe (1977) opposite veteran film legends David Niven and Helen Hayes. The last film she made during this era was the coming-of-age drama Foxes (1980), before enrolling at Yale University. During her freshman year at Yale, she was attached to a worldwide scandal when a crazed and obsessed fan named John Hinckley shot President Ronald Reagan to impress her. Jodie graduated from Yale in 1985 with a degree in literature. She resumed her acting career and sought a breakthrough role that would return her to stardom. After appearing in a few obscure movies with limited release, Jodie landed an audition for Les accusés (1988) and was cast in the part of Sarah Tobias, a waitress who is gang-raped in a bar during a night of partying and teams up with a lawyer played by Kelly McGillis to prosecute the attackers. This performance earned her an Academy Award for Best Actress, but despite the Oscar win, Jodie still hadn't re-established herself as a bankable star. Her next film, Catchfire (1990), went straight to video, and she had to campaign hard to get her next good role. In 1991, she starred as Clarice Starling, an FBI trainee assisting in a hunt for a serial killer in The Silence of the Lambs (1991) with Anthony Hopkins, Scott Glenn, Ted Levine, and Brooke Smith. The film was a blockbuster hit, winning Jodie her second Academy Award for Best Actress and establishing her as an international movie star at the age of 28. With the wealth and fame to do anything she wanted, Jodie turned to directing. She made her directorial debut with Little Man Tate (1991), which was followed by Home for the Holidays (1995). These movies were critically acclaimed but did not do well at the box office, and she proved to be a far more successful actress than she was a director. 1994 was a huge triumph for her acting career. She first played a sexy con artist in the successful western comedy Maverick (1994) with Mel Gibson and James Garner. Then, she played title role in Nell (1994), co-starring Liam Neeson and Natasha Richardson. For her compelling performance as a wild, backwoods hermit who speaks an invented language and must return to civilization, Jodie was nominated for another Academy Award and won a Screen Actors Guild Award as Best Actress. Although she was working far less frequently as an adult than she did as a child, the films she turned out were commercially successful and critically acclaimed. Her next big screen role was in the science fiction drama Contact (1997) opposite Matthew McConaughey. She played a scientist who receives signals from space aliens. The film was a huge hit and brought her a Golden Globe nomination. She starred in the non-musical remake of The King and I (1956) entitled Anna and the King (1999), which was only modestly received in the U.S. but was very successful overseas. Three years after that she headlined the thriller Panic Room (2002), which co-starred Kristen Stewart, Forest Whitaker, Dwight Yoakam, and Jared Leto. The film was a smash box-office hit and gave Jodie a $30 million opening weekend, the biggest of her career yet. She then appeared in two low-profile projects: the independent film The Dangerous Lives of Altar Boys (2002) and the foreign film A Very Long Engagement (2004). She returned to making Hollywood mainstream films, first with Flightplan (2005), in which she played a woman whose daughter disappears on an airplane that she designed. Once again Jodie proved herself to be a box-office draw, and the film was a worldwide hit. The following year she starred in another hit, the bank heist thriller Inside Man (2006) with Denzel Washington and Clive Owen. Jodie was on a roll. Her next film was the revenge thriller The Brave One (2007), which once again opened at #1 at the box office and earned her another Golden Globe nomination for Best Actress. Following this succession of thrillers that all had her playing tough women, Jodie returned to the comedy genre in Nim's Island (2008) with Gerard Butler and Abigail Breslin. She will reunite with Mel Gibson in the upcoming movie The Beaver (2011), which is scheduled for general release in 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjgyOTQwNF5BMl5BanBnXkFtZTcwMDczMzEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000149","name":"Jodie Foster","nicknames":["Jodie F"],"idIMDB":"nm0000149"},"actorId":"nm0000149","character":"Alexandra Rover","urlCharacter":"http://www.imdb.com/character/ch0065998","main":true},{"actorName":"Gerard Butler","urlProfile":"http://www.imdb.com/name/nm0124930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1969","placeOfBirth":" Paisley, Scotland, UK","birthName":"Gerard James Butler","height":"6' 2\" (1.88 m)","bio":"Gerard James Butler was born in Paisley, Scotland, to Margaret and Edward Butler, a bookmaker. His family is of Irish origin. Gerard spent some of his very early childhood in Montreal, Quebec, but was mostly raised, along with his older brother and sister, in his hometown of Paisley. His parents divorced when he was a child, and he and his siblings were raised primarily by their mother, who later remarried. He had no contact with his father between the ages of two and 16 years old, after which time they became close. His father passed away when Gerard was in his early 20s. Butler went on to attend Glasgow University, where he studied to be a lawyer/solicitor. He was president of the school's law society thanks to his outgoing personality and great social skills. His acting career began when he was approached in a London coffee shop by actor Steven Berkoff, who later appeared alongside Butler in Attila (2001), who gave him a role in a stage production of \"Coriolanus\". After that, Butler decided to give up law for acting. He was cast as Ewan McGregor's character \"Renton\" in the stage adaptation of Trainspotting. His film debut was as Billy Connolly's younger brother in Mrs Brown (1997). While filming the movie in Scotland, he was enjoying a picnic with his mother near the River Tay when they heard the shouts of a young boy, who had been swimming with a friend, who was in some trouble. Butler jumped in and saved the young boy from drowning. He received a Certificate of Bravery from the Royal Humane Society. He felt he only did what anyone in the situation would have done. His film career continued with small roles, first in the \"James Bond\" movie, Tomorrow Never Dies (1997), and then Russell Mulcahy's Tale of the Mummy (1998). In 2000, Butler was cast in two breakthrough roles, the first being \"Attila the Hun\" in the USA Network mini-series, Attila (2001). The film's producers wanted a known actor to play the part but kept coming back to Butler's screen tests and decided he was their man. He had to lose the thick Scottish accent, but managed well. Around the time \"Attila\" was being filmed, casting was in progress for Wes Craven's new take on the \"Dracula\" legacy. Also wanting a known name, Butler wasn't much of a consideration, but his unending tenacity drove him to hounding the producers. Eventually, he sent them a clip of his portrayal of \"Attila\". Evidently, they saw something because Dracula 2000 (2000) was cast in the form of Butler. Attila's producers, thinking that his big-screen role might help with their own film's ratings, finished shooting a little early so he could get to work on Dracula 2000 (2000). Following these two roles, Butler developed quite a fan base, an Internet site and began appearing on lists everywhere. Since then, he has appeared in Reign of Fire (2002) as \"Creedy\" and Lara Croft Tomb Raider: The Cradle of Life (2003) as \"Terry Sheridan\", alongside Angelina Jolie. The role that garnered him the most attention from both moviegoers and movie makers, alike, was that of \"Andre Marek\" in the big-screen adaptation of Michael Crichton's novel, Timeline (2003). Butler played an archaeologist who was sent back in time with a team of students to rescue a colleague. Last year, he appeared in Andrew Lloyd Webber's musical, The Phantom of the Opera (2004), playing the title character in the successful adaptation of the stage musical. It was a role that brought him much international attention. Other projects include Dear Frankie (2004), The Game of Their Lives (2005) and Beowulf, la légende viking (2005). In 2007, he starred as Spartan \"King Leonidas\" in the Warner Bros. production 300 (2006), based on the Frank Miller graphic novel, and Shattered (2007), co-starring Pierce Brosnan and Maria Bello, which aired on network TV under the title, \"Shattered\". He most recently starred in P.S. I Love You (2007), with Academy Award-winner Hilary Swank. In 2007, he appeared in Nim's Island (2008) and RocknRolla (2008), and completed the new Mark Neveldine / Brian Taylor film, Gamer (2009). His next films included The Ugly Truth (2009), co-starring Katherine Heigl, which began filming in April 2008, The Bounty Hunter (2010), How to Train Your Dragon (2010), Chasing Mavericks (2012) and Olympus Has Fallen (2013). Butler is also a relative of rising animator and film director Mark Flood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0124930","name":"Gerard Butler","nicknames":["Gerry"],"idIMDB":"nm0124930"},"actorId":"nm0124930","character":"Jack Rusoe / Alex Rover","urlCharacter":"http://www.imdb.com/character/ch0070891","main":true},{"actorName":"Michael Carman","urlProfile":"http://www.imdb.com/name/nm0138327","urlPhoto":"","biography":{"height":"5' 11\" (1.8 m)","bio":"Michael Carman is an actor and writer, known for Nim's Island (2008), Killer Elite (2011) and Hercules Returns (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0138327","name":"Michael Carman","idIMDB":"nm0138327"},"actorId":"nm0138327","character":"Captain","urlCharacter":"http://www.imdb.com/character/ch0458156","main":true},{"actorName":"Mark Brady","urlProfile":"http://www.imdb.com/name/nm0103675","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTE5MjMzNl5BMl5BanBnXkFtZTgwNjgzNDc1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mark Brady is an actor, known for Nim's Island (2008), The Legend of Drunken Master (1994) and Twinkle Twinkle (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTE5MjMzNl5BMl5BanBnXkFtZTgwNjgzNDc1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103675","name":"Mark Brady","idIMDB":"nm0103675"},"actorId":"nm0103675","character":"Purser","urlCharacter":"http://www.imdb.com/character/ch0458157","main":true},{"actorName":"Anthony Simcoe","urlProfile":"http://www.imdb.com/name/nm0799402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTA4Nzc5OF5BMl5BanBnXkFtZTcwMjQwMDEwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1969","placeOfBirth":"","height":"6' 5\" (1.96 m)","bio":"Anthony Simcoe was born on June 7, 1969. He is an actor, known for Farscape (1999), Farscape: The Peacekeeper Wars (2004) and Une maison de rêve (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTA4Nzc5OF5BMl5BanBnXkFtZTcwMjQwMDEwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0799402","name":"Anthony Simcoe","idIMDB":"nm0799402"},"actorId":"nm0799402","character":"First Mate","urlCharacter":"http://www.imdb.com/character/ch0458158","main":true},{"actorName":"Christopher James Baker","urlProfile":"http://www.imdb.com/name/nm0048336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNjcwOTMwMl5BMl5BanBnXkFtZTcwNTcwODI2OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Christopher James Baker is an actor and writer, known for True Detective (2014), Sanctum (2011) and The Condemned (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNjcwOTMwMl5BMl5BanBnXkFtZTcwNTcwODI2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048336","name":"Christopher James Baker","idIMDB":"nm0048336"},"actorId":"nm0048336","character":"Ensign","urlCharacter":"http://www.imdb.com/character/ch0458159","main":true},{"actorName":"Maddison Joyce","urlProfile":"http://www.imdb.com/name/nm2786226","urlPhoto":"","biography":{"dateOfBirth":"12 March 1992","placeOfBirth":" Australia","bio":"Maddison Joyce was born on March 12, 1992 in Australia. He is known for his work on Nim's Island (2008) and Sleeping Lions (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2786226","name":"Maddison Joyce","nicknames":["Maddi"],"idIMDB":"nm2786226"},"actorId":"nm2786226","character":"Edmund","urlCharacter":"http://www.imdb.com/character/ch0011787","main":true},{"actorName":"Peter Callan","urlProfile":"http://www.imdb.com/name/nm0130290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDE3Mzk0MF5BMl5BanBnXkFtZTcwMTM1MzkyOQ@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Peter Callan is an actor, known for Ghost Rider (2007), Dark City (1998) and Son of the Mask (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDE3Mzk0MF5BMl5BanBnXkFtZTcwMTM1MzkyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0130290","name":"Peter Callan","idIMDB":"nm0130290"},"actorId":"nm0130290","character":"Edmund's Father","urlCharacter":"http://www.imdb.com/character/ch0458160","main":true},{"actorName":"Rhonda Doyle","urlProfile":"http://www.imdb.com/name/nm1036455","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTgyMDgxM15BMl5BanBnXkFtZTcwMjA4NzIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Rhonda Doyle is an actress, known for Nim's Island (2008), Halloween d'enfer (2001) and Misery Guts (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTgyMDgxM15BMl5BanBnXkFtZTcwMjA4NzIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1036455","name":"Rhonda Doyle","idIMDB":"nm1036455"},"actorId":"nm1036455","character":"Shirley - Edmund's mother","urlCharacter":"http://www.imdb.com/character/ch0458161","main":true},{"actorName":"Russell Butler","urlProfile":"http://www.imdb.com/name/nm2961755","urlPhoto":"","biography":{"bio":"Russell Butler is an actor, known for Nim's Island (2008) and Real Scary Stories (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2961755","name":"Russell Butler","idIMDB":"nm2961755"},"actorId":"nm2961755","character":"Old Fisherman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colin Gibson","urlProfile":"http://www.imdb.com/name/nm0316904","urlPhoto":"","biography":{"bio":"Colin Gibson is a production designer and art director, known for Mad Max: Fury Road (2015), Babe, le cochon devenu berger (1995) and Priscilla, folle du désert (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0316904","name":"Colin Gibson","idIMDB":"nm0316904"},"actorId":"nm0316904","character":"Cruise Director","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan Probets","urlProfile":"http://www.imdb.com/name/nm2159255","urlPhoto":"","biography":{"bio":"Bryan Probets is an actor, known for Gatsby le magnifique (2013), Triangle (2009) and The Proposition (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2159255","name":"Bryan Probets","idIMDB":"nm2159255"},"actorId":"nm2159255","character":"Australian Tourist #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Nason","urlProfile":"http://www.imdb.com/name/nm0621887","urlPhoto":"","biography":{"bio":"Andrew Nason is an actor, known for Nim's Island (2008), Swimming Upstream (2003) and Reef 'n' Beef (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0621887","name":"Andrew Nason","idIMDB":"nm0621887"},"actorId":"nm0621887","character":"Australian Tourist #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Thorsen","urlProfile":"http://www.imdb.com/name/nm2354190","urlPhoto":"","biography":{"bio":"Dorothy Thorsen is an actress, known for Nim's Island (2008), Charge Over You (2010) and My Little Pony Australia: Grandma/Grandpa Unboxing (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2354190","name":"Dorothy Thorsen","idIMDB":"nm2354190"},"actorId":"nm2354190","character":"Blue-Haired Woman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0410377","urlIMDB":"http://www.imdb.com/title/tt0410377","business":{"budget":{"money":"$37,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,210,579","country":"USA","day":"06","month":"04","year":"2008","remarks":"3,513 Screens"},{"money":"£820,218","country":"UK","day":"04","month":"05","year":"2008","remarks":"393 Screens"},{"money":"BRL 228,748","country":"Brazil","day":"20","month":"07","year":"2008","remarks":"80 Screens"},{"money":"PHP 3,362,837","country":"Philippines","day":"13","month":"04","year":"2008","remarks":"18 Screens"}],"gross":[{"money":"$48,002,678","country":"USA","day":"17","month":"08","year":"2008","remarks":""},{"money":"$47,990,973","country":"USA","day":"10","month":"08","year":"2008","remarks":""},{"money":"$47,963,887","country":"USA","day":"03","month":"08","year":"2008","remarks":""},{"money":"$47,912,652","country":"USA","day":"27","month":"07","year":"2008","remarks":""},{"money":"$47,825,500","country":"USA","day":"20","month":"07","year":"2008","remarks":""},{"money":"$47,663,403","country":"USA","day":"13","month":"07","year":"2008","remarks":""},{"money":"$47,454,625","country":"USA","day":"06","month":"07","year":"2008","remarks":""},{"money":"$47,211,224","country":"USA","day":"29","month":"06","year":"2008","remarks":""},{"money":"$46,970,329","country":"USA","day":"22","month":"06","year":"2008","remarks":""},{"money":"$46,694,283","country":"USA","day":"15","month":"06","year":"2008","remarks":""},{"money":"$46,417,751","country":"USA","day":"08","month":"06","year":"2008","remarks":""},{"money":"$46,109,150","country":"USA","day":"01","month":"06","year":"2008","remarks":""},{"money":"$45,794,492","country":"USA","day":"25","month":"05","year":"2008","remarks":""},{"money":"$45,256,360","country":"USA","day":"18","month":"05","year":"2008","remarks":""},{"money":"$44,395,857","country":"USA","day":"11","month":"05","year":"2008","remarks":""},{"money":"$42,471,660","country":"USA","day":"04","month":"05","year":"2008","remarks":""},{"money":"$38,977,518","country":"USA","day":"27","month":"04","year":"2008","remarks":""},{"money":"$32,894,115","country":"USA","day":"20","month":"04","year":"2008","remarks":""},{"money":"$25,391,566","country":"USA","day":"13","month":"04","year":"2008","remarks":""},{"money":"$13,210,579","country":"USA","day":"06","month":"04","year":"2008","remarks":""},{"money":"£3,791,094","country":"UK","day":"22","month":"06","year":"2008","remarks":""},{"money":"£3,687,887","country":"UK","day":"15","month":"06","year":"2008","remarks":""},{"money":"£3,608,632","country":"UK","day":"08","month":"06","year":"2008","remarks":""},{"money":"£3,441,174","country":"UK","day":"01","month":"06","year":"2008","remarks":""},{"money":"£2,481,509","country":"UK","day":"25","month":"05","year":"2008","remarks":""},{"money":"£2,129,808","country":"UK","day":"18","month":"05","year":"2008","remarks":""},{"money":"£1,611,318","country":"UK","day":"11","month":"05","year":"2008","remarks":""},{"money":"£820,218","country":"UK","day":"04","month":"05","year":"2008","remarks":""},{"money":"$100,074,624","country":"Worldwide","day":"25","month":"02","year":"2009","remarks":""},{"money":"BRL 749,881","country":"Brazil","day":"03","month":"08","year":"2008","remarks":""},{"money":"BRL 622,684","country":"Brazil","day":"27","month":"07","year":"2008","remarks":""},{"money":"BRL 228,748","country":"Brazil","day":"20","month":"07","year":"2008","remarks":""},{"money":"PHP 6,587,726","country":"Philippines","day":"27","month":"04","year":"2008","remarks":""},{"money":"PHP 5,966,604","country":"Philippines","day":"20","month":"04","year":"2008","remarks":""},{"money":"PHP 3,362,837","country":"Philippines","day":"13","month":"04","year":"2008","remarks":""}],"weekendGross":[{"money":"$3,276","country":"USA","day":"17","month":"08","year":"2008","remarks":"17 Screens"},{"money":"$10,790","country":"USA","day":"10","month":"08","year":"2008","remarks":"29 Screens"},{"money":"$17,534","country":"USA","day":"03","month":"08","year":"2008","remarks":"39 Screens"},{"money":"$31,077","country":"USA","day":"27","month":"07","year":"2008","remarks":"74 Screens"},{"money":"$74,945","country":"USA","day":"20","month":"07","year":"2008","remarks":"127 Screens"},{"money":"$91,781","country":"USA","day":"13","month":"07","year":"2008","remarks":"161 Screens"},{"money":"$154,568","country":"USA","day":"06","month":"07","year":"2008","remarks":"191 Screens"},{"money":"$114,650","country":"USA","day":"29","month":"06","year":"2008","remarks":"213 Screens"},{"money":"$150,881","country":"USA","day":"22","month":"06","year":"2008","remarks":"250 Screens"},{"money":"$165,442","country":"USA","day":"15","month":"06","year":"2008","remarks":"277 Screens"},{"money":"$192,400","country":"USA","day":"08","month":"06","year":"2008","remarks":"289 Screens"},{"money":"$230,671","country":"USA","day":"01","month":"06","year":"2008","remarks":"350 Screens"},{"money":"$397,290","country":"USA","day":"25","month":"05","year":"2008","remarks":"426 Screens"},{"money":"$588,856","country":"USA","day":"18","month":"05","year":"2008","remarks":"894 Screens"},{"money":"$1,463,622","country":"USA","day":"11","month":"05","year":"2008","remarks":"1,601 Screens"},{"money":"$2,677,543","country":"USA","day":"04","month":"05","year":"2008","remarks":"2,478 Screens"},{"money":"$4,548,792","country":"USA","day":"27","month":"04","year":"2008","remarks":"2,977 Screens"},{"money":"$5,687,072","country":"USA","day":"20","month":"04","year":"2008","remarks":"3,277 Screens"},{"money":"$9,111,667","country":"USA","day":"13","month":"04","year":"2008","remarks":"3,518 Screens"},{"money":"$13,210,579","country":"USA","day":"06","month":"04","year":"2008","remarks":"3,513 Screens"},{"money":"£93,032","country":"UK","day":"22","month":"06","year":"2008","remarks":"205 Screens"},{"money":"£67,161","country":"UK","day":"15","month":"06","year":"2008","remarks":"268 Screens"},{"money":"£99,538","country":"UK","day":"08","month":"06","year":"2008","remarks":"344 Screens"},{"money":"£280,160","country":"UK","day":"01","month":"06","year":"2008","remarks":"365 Screens"},{"money":"£294,201","country":"UK","day":"25","month":"05","year":"2008","remarks":"390 Screens"},{"money":"£450,375","country":"UK","day":"18","month":"05","year":"2008","remarks":"386 Screens"},{"money":"£317,505","country":"UK","day":"11","month":"05","year":"2008","remarks":"390 Screens"},{"money":"£820,218","country":"UK","day":"04","month":"05","year":"2008","remarks":"393 Screens"},{"money":"BRL 28,846","country":"Brazil","day":"03","month":"08","year":"2008","remarks":"35 Screens"},{"money":"BRL 101,237","country":"Brazil","day":"27","month":"07","year":"2008","remarks":"80 Screens"},{"money":"BRL 228,748","country":"Brazil","day":"20","month":"07","year":"2008","remarks":"80 Screens"},{"money":"PHP 151,548","country":"Philippines","day":"27","month":"04","year":"2008","remarks":"12 Screens"},{"money":"PHP 1,566,148","country":"Philippines","day":"20","month":"04","year":"2008","remarks":"18 Screens"},{"money":"PHP 3,362,837","country":"Philippines","day":"13","month":"04","year":"2008","remarks":"18 Screens"}],"admissions":[{"money":"104,755","country":"Brazil","day":"03","month":"08","year":"2008","remarks":""},{"money":"83,790","country":"Brazil","day":"27","month":"07","year":"2008","remarks":""},{"money":"25,934","country":"Brazil","day":"20","month":"07","year":"2008","remarks":""},{"money":"19,439","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Selkie Productions LLC"},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby","DTS","SDDS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["EFilm (digital intermediate)"],"filmLength":["2,620 m (Sweden)","2,644 m (Portugal, 35 mm)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.0","metascore":"55","filmingLocations":[{"location":"Bowen, Queensland, Australia"}],"rated":"PG","awards":[{"award":"KIDS FIRST! Film Festival 2008","titlesAwards":[{"titleAwardOutcome":"Won KIDS FIRST! Best Award","categories":[{"category":"Feature Film, Ages 8-12","names":[{"name":"Twentieth Century-Fox Home Entertainment","id":null,"role":null}]}]}]},{"award":"Satellite Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Youth DVD","names":[]}]}]},{"award":"Teen Choice Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actress: Action Adventure","names":[{"name":"Abigail Breslin","id":"nm1113550","role":null}]}]}]},{"award":"Visual Effects Society Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Supporting Visual Effects in a Feature Motion Picture","names":[{"name":"Camille Cellucci","id":"nm0148167","role":null},{"name":"Scott Gordon","id":"nm0330593","role":null},{"name":"Fred Pienkos","id":"nm1266760","role":null},{"name":"James Straus","id":"nm0833766","role":null}]}]}]}],"votes":"28,993","type":"Movie","companyCreditsSimple":[{"idCompany":"co0073388","name":"Walden Media"}],"keywords":{"keywords":["island","girl","author","reading","scientist","hero","book","courage","oceanographer","loss of mother","novel","storm","boat","lost","egg","cell phone","fear","fight","tourist","sea","sea lion","pelican","airport","south pacific","lizard","helicopter","e mail","computer","airplane","f rated","fast motion scene","water","slow motion scene","absurdism","american abroad","camera","crater","rock climbing","misunderstanding","wet jeans","wet t shirt","nightmare","actor playing multiple roles","torch","can opener","treehouse","hiding in a tree","exploration","tug of war","subjective camera","character's point of view camera shot","coming of age","sea turtle","ash","husband wife relationship","mother son relationship","father son relationship","farce","slapstick comedy","fish tank","windsurfing","near death experience","satellite phone","letter","newspaper clipping","full moon","quest","radio","animated credits","sailor","ship captain","internet","metal detector","golden gate bridge","escape","aerial shot","spyglass","microscope","plankton","evacuation","reverse footage","fish out of water","child in peril","paranoia","danger","panic","security guard","hurricane","air hostess","australian","jungle","helicopter pilot","fantasy sequence","animated sequence","volcanic eruption","boatman","single parent","montage","electrocution","barbecue","pinata","woods","sextant","map","flood","lightning","scottish accent","heavy rain","man versus nature","rescue","tropical storm","race against time","ocean","bravery","presumed dead","palm tree","fan","tween girl","queensland","rowboat","photograph","dancing","dancer","passport","survivor","imaginary friend","flashlight","machete","flashback","shark","spear fishing","fishing","starfish","fish","hallucination","swimming","climbing a tree","buccaneer","taxi driver","tidal wave","ship","dead mother","tears","crying","mountain climbing","mountain","bathtub","bath","lava","telephone","telephone call","editor","answering machine","rain","home movie","mother daughter relationship","storytelling","memory","tropical island","tropics","alternate world","picoplankton","protozoa","national geographic magazine","security checkpoint","call for help","supply ship","missing person","dragon lizard","obsessive compulsive disorder","arachnophobia","fear of spiders","fear of the outdoors","invasion","lost at sea","pig on a spit","roasted pig","video camera","catapult","boy","wading in water","hula dancer","fire","cooking","eating","food","game playing","belching","flatulence","port a potty","obesity","vomiting","progresso soup","island resort","water pump","sinking boat","mealworm","worm","soccer","turtle","coconut","seal the animal","sailing","captive","capture","power outage","hand over heart","lantern","tool belt","tools","flossing one's teeth","tree","treadmill","role model","surrogate mother","woman girl relationship","calling parent by first name","family relationships","satellite telephone","lifting someone into the air","voice over narration","surrealism","closing credits sequence","child's point of view","homeschooling","writer","taxi","survival","seagull","pirate","animated scene","novelist","human animal relationship","female writer","desolate island","whale","underwater scene","telescope","suitcase","storm at sea","spider","soup","solar power","single father","satellite dish","san francisco california","sailboat","rooftop","rescue from drowning","rainstorm","product placement","overboard","motorboat","monsoon","marine biologist","lifeboat","leg injury","forest","falling from height","desert","cruise ship","cliff","chase","campfire","camel","bonfire","boat accident","bed","american expatriate","agoraphobia","volcano","travel","shipwreck","recluse","isolation","hand sanitizer","father daughter relationship","beach","aloneness","based on novel","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:09:02"}}