{"data":{"movies":[{"title":"Crank","originalTitle":"","year":"2006","releaseDate":"20060901","directors":[{"name":"Mark Neveldine","id":"nm0004410"},{"name":"Brian Taylor","id":"nm0962729"}],"writers":[{"name":"Mark Neveldine","id":"nm0004410"},{"name":"Brian Taylor","id":"nm0962729"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg0NjAxNDY4MV5BMl5BanBnXkFtZTcwODA5MjMzMw@@._V1.jpg","countries":["USA"],"languages":["English","Spanish","Korean"],"genres":["Action","Crime","Thriller"],"plot":"When the hit-man Chev Chelios is poisoned by the criminal Verona, his friend and doctor Miles advises him that he must keep his adrenaline levels elevated to stay alive. Chev meets his girlfriend Eve and together they look for Verona to kill him.","simplePlot":"Professional assassin Chev Chelios learns his rival has injected him with a poison that will kill him if his heart rate drops.","actors":[{"actorName":"Jason Statham","urlProfile":"http://www.imdb.com/name/nm0005458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk2MDkwOV5BMl5BanBnXkFtZTcwMDAxODQwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1967","placeOfBirth":" Shirebrook, Derbyshire, England, UK","height":"5' 10\" (1.78 m)","bio":"Jason Statham was born in Shirebrook, Derbyshire, to Eileen (Yates), a dancer, and Barry Statham, a street merchant and lounge singer. Statham has done quite a lot in a short time. He has been a Diver on the British National Diving Team and finished 12th in the World Championships in 1992. He has also been a fashion model, black market salesman and finally of course, actor. He got the audition for his debut role as Bacon in Lock, Stock and Two Smoking Barrels (1998) through French Connection, for whom he was modeling. They became a major investor in the film and introduced Jason to Guy Ritchie, who invited him to audition for a part in the film by challenging him to impersonate an illegal street vendor and convince him to purchase fake jewelery. Jason must have been doing something right because after the success of Lock, Stock and Two Smoking Barrels (1998) he teamed up again with Guy Ritchie for Snatch (2000), with co-stars including Brad Pitt, Dennis Farina and Benicio Del Toro. After Snatch (2000) came Turn It Up (2000) with US music star Ja Rule, followed by a supporting actor role in the Sci-Fi film Ghosts of Mars (2001), Jet Li's The One (2001) and another screen partnership with Vinnie Jones in Mean Machine (2001) under Guy Ritchie's and Matthew Vaughn's SKA Films. Finally in 2002 he was cast as the lead role of Frank Martin in Le transporteur (2002). Jason is also in the summer 2003 blockbuster remake of The Italian Job (1969), The Italian Job (2003), playing Handsome Rob.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk2MDkwOV5BMl5BanBnXkFtZTcwMDAxODQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005458","name":"Jason Statham","nicknames":["Jay","The Stath"],"idIMDB":"nm0005458"},"actorId":"nm0005458","character":"Chev Chelios","urlCharacter":"http://www.imdb.com/character/ch0010165","main":true},{"actorName":"Amy Smart","urlProfile":"http://www.imdb.com/name/nm0005442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2Njc4NDA2N15BMl5BanBnXkFtZTcwOTQ1NDUwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1976","placeOfBirth":" Topanga Canyon, California, USA","birthName":"Amy Lysle Smart","height":"5' 6\" (1.68 m)","bio":"Amy Smart was born in Topanga Canyon, California, to Judy, who worked at a museum, and John Boden Smart, a salesman. She has German, English, and Irish ancestry. Smart was a relatively new arrival when she first gained notice for her supporting roles in the 1999 hit teen films Varsity Blues (1999) and Outside Providence (1999). With her blonde, carefree California girl good looks, the Los Angeles native got her start in TV-movies and made her feature debut in Stephen Kay's The Last Time I Committed Suicide (1997) screened at 1997's Sundance Film Festival alongside Keanu Reeves. She was briefly seen in Paul Verhoeven's big-budget sci-fi actioner Starship Troopers (1997) with actor Casper Van Dien and had an impressive turn in the vastly different, quirkily independent How to Make the Cruelest Month (1998). In the latter, she played Dot, the graceful golden girl who seduces the one-time boyfriend of her sister, the troubled protagonist Bell (Clea DuVall). The by-the-numbers horror film Campfire Tales (1997) followed in 1997, along with the topically chilling but clumsily executed internet stalker thriller, Dee Snider's Strangeland (1998), written, produced and starring the titular Twisted Sister frontman as a deranged torturer who meets his victims in web chatrooms. Amy reached her widest audience with a co-starring role opposite James Van Der Beek in Brian Robbins' surprise box office hit \"Varsity Blues (1999)\". The actress played Jules Harbor, a girl who longs for life beyond her small town's high school football-obsessed culture but who, as sister of the injured star quarterback (Paul Walker) and girlfriend of his idealistic replacement (Van Der Beek), is tied to it. Her next role was that of Shawn Hatosy's upper-class love interest in Michael Corrente's poignant 1970s era comedy \"Outside Providence (1999)\". Based on Peter Farrelly's novel, the film followed a working-class teenaged boy (Hatosy) sent by his abrasive but loving father (Alec Baldwin) to a tony prep school after running into trouble at home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2Njc4NDA2N15BMl5BanBnXkFtZTcwOTQ1NDUwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005442","name":"Amy Smart","idIMDB":"nm0005442"},"actorId":"nm0005442","character":"Eve","urlCharacter":"http://www.imdb.com/character/ch0010166","main":true},{"actorName":"Jose Pablo Cantillo","urlProfile":"http://www.imdb.com/name/nm1504678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkyMjMxMV5BMl5BanBnXkFtZTcwODk3NDI2Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1979","placeOfBirth":" Marshfield, Wisconsin, USA","height":"5' 9½\" (1.77 m)","bio":"Jose Pablo Cantillo was born on March 30, 1979 in Marshfield, Wisconsin, USA. He is an actor and producer, known for Crank (2006), Elysium (2013) and Chappie (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkyMjMxMV5BMl5BanBnXkFtZTcwODk3NDI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1504678","name":"Jose Pablo Cantillo","idIMDB":"nm1504678"},"actorId":"nm1504678","character":"Verona","urlCharacter":"http://www.imdb.com/character/ch0038980","main":true},{"actorName":"Efren Ramirez","urlProfile":"http://www.imdb.com/name/nm0708293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2FiNjJmZDEtNDBmMS00YjA5LWI2MjctYzM5MDAwNDM2MjU5L2ltYWdlXkEyXkFqcGdeQXVyNDI5NjUwMA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1973","placeOfBirth":" Los Angeles, California, USA","height":"5' 7\" (1.7 m)","bio":"Efren Ramirez has been working as a professional actor for many years. Initially, his career consisted of guest star appearances on television, as he appeared in diverse roles on \"E.R.\", \"AMERICAN DAD\", \"JUDGING AMY\", \"THE DISTRICT\", \"MAD TV\", and \"SCRUBS.\" However, it was his memorable portrayal of \"PEDRO\" in the feature film \"NAPOLEON DYNAMITE\" that dramatically launched what has become a hugely prolific acting career with an unusually diverse series of performances in Film, Television, Drama, Comedy...every imaginable medium and genre. In the years since that film was released, Efren Ramirez has appeared in scores of films and television shows, including leading roles in the HBO film \"WALKOUT\"; with Edward James Olmos, \"EMPLOYEE OF THE MONTH\"; opposite Dane Cook and Dax Shepard, \"CRANK\" and CRANK HIGH VOLTAGE; opposite Jason Statham, (playing his own twin brother in the sequel.) He also appeared in \"GAMER\" with Gerard Butler, \"WHEN IN ROME\" with Kristen Bell, \"CROSSING THE HEART\" opposite Kris Kristofferson, \"HOUSE OF MY FATHER\" opposite Will Ferrell, and HBO's EASTBOUND AND DOWN\" with Danny McBride. Most recently, you can expect to see him in FOX's Television hit \"THE GRINDER\" with Rob Lowe and the animated series \"BORDERTOWN\" with Hank Azaria and Alex Bernstein, HULU's \"DEADBEAT\" with Tyler Labine, and the film \"MIDDLESCHOOL: THE WORST YEARS OF MY LIFE\" based on the James Patterson best seller. Efren Ramirez currently resides in Los Angeles and New York. When he isn't filming, he is spinning records as a guest D.J. in clubs all across the country. He has published his first book DIRECT YOUR OWN LIFE. Efren recently returned from a USO TOUR visiting our troops in Bahrain, UAE, Dubai, and Africa. He frequently speaks to students at high schools and universities and is very involved with charitable organizations.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2FiNjJmZDEtNDBmMS00YjA5LWI2MjctYzM5MDAwNDM2MjU5L2ltYWdlXkEyXkFqcGdeQXVyNDI5NjUwMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0708293","name":"Efren Ramirez","idIMDB":"nm0708293"},"actorId":"nm0708293","character":"Kaylo","urlCharacter":"http://www.imdb.com/character/ch0010168","main":true},{"actorName":"Dwight Yoakam","urlProfile":"http://www.imdb.com/name/nm0948267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODQyMzE5MV5BMl5BanBnXkFtZTcwMjQ3MDUwMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1956","placeOfBirth":" Pikeville, Kentucky, USA","birthName":"Dwight David Yoakam","height":"6' (1.83 m)","bio":"Since the start of his music career, Dwight Yoakam has proven he's more than just another guy with a guitar and a hat. He has risen from hot country star to being one of country music's biggest influences. While doing that, he has also become a critically acclaimed actor. Dwight Yoakam was born in the coal mining community of Pikeville, Kentucky, October 23, 1956. Soon after his birth, his family moved to Columbus, Ohio, where he was raised. As part of the Drama Club in his days at Northland High School in Columbus, he acted in school plays. He played Helen Keller's brother in his sophomore year in the school's production of \"The Miracle Worker.\" He followed that his Junior year playing the lead as Charlie in \"Flowers for Algernon.\" He capped off his high school acting career as Richard Bravo in The \"Demon Seed.\" In 1977, Dwight moved to Nashville to pursue a career in music. At the time, Nashville was moving away from the traditional country sound that he was playing. After a brief time there, he moved to California, which was more receptive to the music he was doing. He hooked up with producer/guitar virtuoso Pete Anderson in 1982. That began a musical relationship that became country music's equivalent to rock's Glimmer Twins (Mick Jagger and Keith Richards). Financial backing to make a high-quality recording came from Dwight's sister and brother-in-law, an insurance check that was meant to fix Dwight's El Camino and money raised from a benefit classical music concert staged by UCLA music professor Dr. Robert Winter. With the EP (extended play) that captured the \"Dwight Yoakam sound.\" In 1984, Dwight released the six-song EP \"Guitars, Cadillacs, Etc., Etc.\" on the independent Oak label, and then hit the road with such artists as Los Lobos and Violent Femmes. Playing traditional country music, Dwight gained a following among not only country fans but punk rockers and rockabilly fans as well. This eclectic fan base brought him to the attention of many record labels. Warner Brothers signed him to its newly revived Reprise Record label in 1985. The EP's title and tracks were kept intact and more songs added to make a full album. At the time, country music was in the waning days of its Urban Cowboy (1980) phase, and fans of country were hungry for something \"new.\" This new sound was a return to a more traditional style that had been abandoned when John Travolta put on a cowboy hat. After establishing himself in the music industry, Dwight set his sights on his second love, acting. In 1991 he appeared as a stuntman/country singer in an episode of P.S.I. Luv U (1991). This became the beginning of his professional acting career. In 1992, he appeared on the big screen for the first time in the Nicolas Cage/Dennis Hopper film Red Rock West (1993). In 1993, Dwight released what is considered his masterpiece, the album \"This Time.\" He supported the album with a tour that lasted over a year and covered the world. In 1994, he received his first Grammy for the album's single, \"Ain't That Lonely Yet.\" In 1996, he co-starred in Billy Bob Thornton's film Sling Blade (1996). His work as the evil Doyle Hargraves left audiences speechless and critics hailing his performance. Dwight was included with the cast who were among the nominees for \"Best Cast\" by the Screen Actors Guild awards. As the 1990s drew to a close, Dwight proved that his music didn't have to suffer as he pursued more ventures into movies. While filming The Newton Boys (1998), he wrote what many consider his most personal album, \"A Long Way Home.\" All the tracks were written solely by Dwight. He began 1999 with a Grammy win for his contribution to the track \"Same Old Train\" from the various artists' album \"Tribute to Tradition.\" He then added two new items to his resume: director and screenwriter. In South of Heaven, West of Hell (2000), he not only starred, he made his directorial debut with a screenplay he authored. Dwight Yoakam continues to prove that he is able to successfully have careers in both film and music, without either profession suffering.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODQyMzE5MV5BMl5BanBnXkFtZTcwMjQ3MDUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0948267","name":"Dwight Yoakam","idIMDB":"nm0948267"},"actorId":"nm0948267","character":"Doc Miles","urlCharacter":"http://www.imdb.com/character/ch0010167","main":true},{"actorName":"Carlos Sanz","urlProfile":"http://www.imdb.com/name/nm0764430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjYwMDA0NF5BMl5BanBnXkFtZTgwMTA1MjU3MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Carlos Sanz has worked with such notable film directors as Ron Howard, Andrew Davis and Alan Rudolf. He takes a stellar turn as the dandy mob boss Manuel Garza in the soon to be released roaring comedy Beer for My Horses starring Toby Keith, Rodney Carrington and Willie Nelson. He can be seen in the upcoming Lifetime movie Detention staring alongside Penolope Ann Miller. This fall Carlos will be seen as a street wise LA Detective in The Take along with John Leguizamo, Tyrese Gibson and Rosie Perez. In the recent hit Crank staring Jason Statham he played the lead character of Carlito. He can also be seen taking a comedic bent like his brother Horatio Sanz in the comedy Dishdogz where he does an homage to Harold Ramis. His numerous television projects include: The Shield playing Det. Carlos Zamora who goes head to head with Vic Mackey played by Michael Chiklis, Criminal Minds, 24, Close to Home, Las Vegas, and as recurring undercover cop Det. Ray Olivo on NYPD Blue. He did a stint of two seasons on the NBC daytime drama Another World where he played the handsome, womanizing, mysterious and slightly dangerous Dr. Victor Rodriguez. An accomplished theater artist he has worked around the world including the Arena Stage, Washington DC, in the two person play about Georgia O'Keefe and her much younger companion; Goodman Theater working with fantastic director Joanne Akalitis and the always cool Don Cheadle; South Coast Rep with Pulitzer Prize winning playwright Nelo Cruz; Royal Shakespeare Company in London, Thalia Theater in Hamburg and Bobigny MC93 in Paris with Peters Sellers directing The Merchant of Venice alongside Philip Seymour Hoffman; The Rubicon Theatre Co as Starbuck in The Rainmaker opposite Stephanie Zimbalist, San Diego Rep, LAByrinth NYC, Lincoln Center Salon, The Organic Theater Co. in Chicago as a company member and Latino Chicago Theater Company where he was an artistic associate. He is also a writer, director, an accomplished photographer and a graduate of the University of Illinois at Chicago, where he studied Mathematics and Philosophy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjYwMDA0NF5BMl5BanBnXkFtZTgwMTA1MjU3MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0764430","name":"Carlos Sanz","idIMDB":"nm0764430"},"actorId":"nm0764430","character":"Carlito","urlCharacter":"http://www.imdb.com/character/ch0038981","main":true},{"actorName":"Reno Wilson","urlProfile":"http://www.imdb.com/name/nm0934008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTM0Mzc2Ml5BMl5BanBnXkFtZTcwOTcwNDI1Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1969","placeOfBirth":" USA","birthName":"Roy Wilson","height":"6' 1\" (1.85 m)","bio":"Reno Wilson was born on January 20, 1969 in the USA as Roy Wilson. He is an actor and producer, known for Mike & Molly (2010), Crank (2006) and Crank: High Voltage (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTM0Mzc2Ml5BMl5BanBnXkFtZTcwOTcwNDI1Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934008","name":"Reno Wilson","idIMDB":"nm0934008"},"actorId":"nm0934008","character":"Orlando","urlCharacter":"http://www.imdb.com/character/ch0010169","main":true},{"actorName":"Edi Gathegi","urlProfile":"http://www.imdb.com/name/nm1346230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA3MDgwOTk1Ml5BMl5BanBnXkFtZTgwODQ3MDA4OTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1979","placeOfBirth":" Nairobi, Kenya","birthName":"Edi Mue Gathegi","height":"6' 1\" (1.85 m)","bio":"Edi Gathegi was born on March 10, 1979 in Nairobi, Kenya as Edi Mue Gathegi. He is an actor and producer, known for X-Men: First Class (2011), Gone Baby Gone (2007) and Criminal Activities (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA3MDgwOTk1Ml5BMl5BanBnXkFtZTgwODQ3MDA4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1346230","name":"Edi Gathegi","nicknames":["Ed Lo","Edi G"],"idIMDB":"nm1346230"},"actorId":"nm1346230","character":"Haitian Cabbie","urlCharacter":"http://www.imdb.com/character/ch0061739","main":true},{"actorName":"Glenn Howerton","urlProfile":"http://www.imdb.com/name/nm1097351","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NDUzODY4MF5BMl5BanBnXkFtZTcwNDc0NzUyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1976","placeOfBirth":" Japan","birthName":"Glenn Franklin Howerton III","height":"5' 10\" (1.78 m)","bio":"Glenn Howerton was born on April 13, 1976 in Japan as Glenn Franklin Howerton III. He is an actor and writer, known for It's Always Sunny in Philadelphia (2005), Crank (2006) and Serenity (2005). He has been married to Jill Latiano since September 8, 2009. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NDUzODY4MF5BMl5BanBnXkFtZTcwNDc0NzUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1097351","name":"Glenn Howerton","idIMDB":"nm1097351"},"actorId":"nm1097351","character":"Doctor","urlCharacter":"http://www.imdb.com/character/ch0127786","main":true},{"actorName":"Jay Xcala","urlProfile":"http://www.imdb.com/name/nm2361782","urlPhoto":"","biography":{"bio":"Jay Xcala is an actor, known for Crank (2006), Crank: High Voltage (2009) and Trucker (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2361782","name":"Jay Xcala","idIMDB":"nm2361782"},"actorId":"nm2361782","character":"Alex","urlCharacter":"http://www.imdb.com/character/ch0061741","main":true},{"actorName":"Keone Young","urlProfile":"http://www.imdb.com/name/nm0949775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDA4NDc1NF5BMl5BanBnXkFtZTcwNDkwNTYwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1947","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Keone Joseph Young","bio":"Keone Young was born on September 6, 1947 in Honolulu, Hawaii, USA as Keone Joseph Young. He is an actor, known for Men in Black 3 (2012), Crank (2006) and Crank: High Voltage (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDA4NDc1NF5BMl5BanBnXkFtZTcwNDkwNTYwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0949775","name":"Keone Young","idIMDB":"nm0949775"},"actorId":"nm0949775","character":"Don Kim","urlCharacter":"http://www.imdb.com/character/ch0061740","main":true},{"actorName":"Valarie Rae Miller","urlProfile":"http://www.imdb.com/name/nm0589474","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ1MDY4Mzk5MV5BMl5BanBnXkFtZTgwNDE0MDcwMTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1974","placeOfBirth":" Fort Worth, Texas, USA","height":"5' 5\" (1.65 m)","bio":"Valarie Rae Miller was born on April 16, 1974 in Fort Worth, Texas, USA. She is an actress, known for Crank (2006), La La Land (2016) and Dark Angel (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ1MDY4Mzk5MV5BMl5BanBnXkFtZTgwNDE0MDcwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0589474","name":"Valarie Rae Miller","idIMDB":"nm0589474"},"actorId":"nm0589474","character":"Chocolate","urlCharacter":"http://www.imdb.com/character/ch0061742","main":true},{"actorName":"Yousuf Azami","urlProfile":"http://www.imdb.com/name/nm2366674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmFmNDhjMGYtOWU3NC00ODI0LWI0ZDctZGU5NzY4ZGY0ZjY2XkEyXkFqcGdeQXVyMTA2MzkxNTc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Yousuf Azami is an actor, known for Lone Survivor (2013), Brothers (2009) and Crank (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmFmNDhjMGYtOWU3NC00ODI0LWI0ZDctZGU5NzY4ZGY0ZjY2XkEyXkFqcGdeQXVyMTA2MzkxNTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2366674","name":"Yousuf Azami","idIMDB":"nm2366674"},"actorId":"nm2366674","character":"Arab Cabbie","urlCharacter":"http://www.imdb.com/character/ch0061746","main":true},{"actorName":"Laurent Schwaar","urlProfile":"http://www.imdb.com/name/nm0776963","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTM2ZmFiNzYtZDU0Yy00ZGY5LThiODgtYTY4NGUzMzIzMmI3XkEyXkFqcGdeQXVyMDM0MTk0OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Laurent Schwaar is an actor, known for Crank (2006), Autumn in New York (2000) and The Next Best Thing (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTM2ZmFiNzYtZDU0Yy00ZGY5LThiODgtYTY4NGUzMzIzMmI3XkEyXkFqcGdeQXVyMDM0MTk0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0776963","name":"Laurent Schwaar","idIMDB":"nm0776963"},"actorId":"nm0776963","character":"Man in Garage","urlCharacter":"http://www.imdb.com/character/ch0061747","main":true},{"actorName":"David Brown","urlProfile":"http://www.imdb.com/name/nm1369461","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk0Nzk4Mjk2Nl5BMl5BanBnXkFtZTgwNDQ0MTkwMjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"David Brown is an actor and producer, known for Inside Man (2006), Friends and Romans (2014) and Entourage (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk0Nzk4Mjk2Nl5BMl5BanBnXkFtZTgwNDQ0MTkwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1369461","name":"David Brown","idIMDB":"nm1369461"},"actorId":"nm1369461","character":"Sin City Brother","urlCharacter":"http://www.imdb.com/character/ch0061745","main":true}],"seasons":[],"idIMDB":"tt0479884","urlIMDB":"http://www.imdb.com/title/tt0479884","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$12,896,635","country":"USA","day":"03","month":"09","year":"2006","remarks":"2,515 Screens"},{"money":"£450,141","country":"UK","day":"03","month":"09","year":"2006","remarks":"263 Screens"}],"gross":[{"money":"$27,829,874","country":"USA","day":"15","month":"10","year":"2006","remarks":""},{"money":"$27,771,239","country":"USA","day":"08","month":"10","year":"2006","remarks":""},{"money":"$27,500,463","country":"USA","day":"01","month":"10","year":"2006","remarks":""},{"money":"$26,650,843","country":"USA","day":"24","month":"09","year":"2006","remarks":""},{"money":"$24,393,847","country":"USA","day":"17","month":"09","year":"2006","remarks":""},{"money":"$19,962,812","country":"USA","day":"10","month":"09","year":"2006","remarks":""},{"money":"$12,896,635","country":"USA","day":"03","month":"09","year":"2006","remarks":""},{"money":"£1,279,643","country":"UK","day":"17","month":"09","year":"2006","remarks":""},{"money":"£450,141","country":"UK","day":"03","month":"09","year":"2006","remarks":""}],"weekendGross":[{"money":"$20,948","country":"USA","day":"15","month":"10","year":"2006","remarks":"36 Screens"},{"money":"$118,599","country":"USA","day":"08","month":"10","year":"2006","remarks":"164 Screens"},{"money":"$427,784","country":"USA","day":"01","month":"10","year":"2006","remarks":"420 Screens"},{"money":"$1,227,145","country":"USA","day":"24","month":"09","year":"2006","remarks":"1,228 Screens"},{"money":"$2,680,225","country":"USA","day":"17","month":"09","year":"2006","remarks":"2,177 Screens"},{"money":"$4,904,308","country":"USA","day":"10","month":"09","year":"2006","remarks":"2,515 Screens"},{"money":"$12,896,635","country":"USA","day":"03","month":"09","year":"2006","remarks":"2,515 Screens"},{"money":"£123,594","country":"UK","day":"17","month":"09","year":"2006","remarks":"151 Screens"},{"money":"£450,141","country":"UK","day":"03","month":"09","year":"2006","remarks":"263 Screens"}],"admissions":[{"money":"223,430","country":"Germany","day":"01","month":"10","year":"2006","remarks":""},{"money":"108,439","country":"Germany","day":"24","month":"09","year":"2006","remarks":""},{"money":"6,768","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"10","year":"2005","remarks":null},null],"copyrightHolder":"Lakeshore Entertainment Group LLC and Lions Gate Films Inc."},"technical":{"runtime":["1 hr 28 min (88 min)","1 hr 33 min (93 min) (director's cut)"],"soundMix":["SDDS","Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["1.78 : 1 (DVD/Blu-ray release)","1.85 : 1 (theatrical ratio)"],"camera":["Canon XL-2","Sony CineAlta HDC-F950, Zeiss DigiPrime and DigiZoom Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA","Laser Pacific Media Corporation, Los Angeles (CA), USA (digital intermediate)"],"filmLength":["2,398 m (Portugal, 35 mm)"],"negativeFormat":["Video (HDTV)","Video (NTSC)"],"cinematographicProcess":["DV (480p/24)","HDCAM SR (1080p/24)"],"printedFilmFormat":["35 mm (spherical) (Fuji Eterna-CP 3513DI)"]},"rating":"7,0","metascore":"57","filmingLocations":[{"location":"Reno, Nevada, USA"}],"rated":"R","awards":[{"award":"Golden Schmoes Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Most Underrated Movie of the Year","names":[]},{"category":"Trippiest Movie of the Year","names":[]}]}]},{"award":"Women Film Critics Circle Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won WFCC Award","categories":[{"category":"Most Offensive Male Character","names":[{"name":"Jason Statham","id":"nm0005458","role":null}]}]}]},{"award":"World Stunt Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won Taurus Award","categories":[{"category":"Best Specialty Stunt","names":[{"name":"Michael Nicely","id":"nm2196435","role":null},{"name":"Sean Graham","id":"nm0334302","role":null}]}]}]}],"votes":"203 515","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005323","name":"Lakeshore Entertainment"},{"idCompany":"co0060306","name":"Lions Gate Films"},{"idCompany":"co0029540","name":"Radical Media"}],"keywords":{"keywords":["cult film","heart","poison","assassin","doctor","revenge","non stop action","bare breasts","public sex","public nudity","loud sex","woman moaning from pleasure","moaning woman","woman moaning","moaning","erection","machismo","2000s","absurdism","camera shot from inside human body","blood splatter","dark comedy","breaking the fourth wall","die hard scenario","voyeurism","voyeur","homoerotic","female female kiss","lesbian kiss","oral sex","outdoor sex","girl in panties","sexual attraction","sexual desire","lust","leg spreading","fondling","nipples visible through clothing","scantily clad female","cleavage","brawl","female frontal nudity","breasts","upskirt","white panties","panties","body landing on a car","transvestite","gay character","character can see subtitle","chinatown los angeles","underwater scene","neck breaking","cell phone","methamphetamine","one day","victim searches for killer","pill","number","last job","drug abuse","bull","damsel in distress","triad","street gang","drug dealer","rear entry sex","organized crime","los angeles california","cigar smoking","trashcan","tour bus","tea","taxi","tattoo","syringe","swat","sunglasses","spanking","skyline","shaved head","sculpture","scaffold","rolling pin","restaurant","product placement","policeman","picket fence","pharmacy","pharmacist","parakeet","orchid","newscaster","necklace","motorcycle","motorcycle stunt","modern art","microwave oven","lawn jockey","kitchen","jet","hotel","hospital gown","helicopter landing pad","handgun","gurney","goatee","fire escape","finger gun","falling from a helicopter","epinephrine","duct tape","daylight saving time","clothes ripping","car chase","burn","beard","bamboo","intravenous","google earth","sweatshop","suicide","shopping mall","security camera","retirement","pigeon","penthouse apartment","hanging","hallucination","gang war","emergency room","elevator","chinese restaurant","shooting","energy drink","body part","blow job","racial slur","gay slur","snorting cocaine","female nudity","gore","silencer","shot to death","shot in the head","shot in the forehead","shootout","sex in public","severed finger","pistol","motorcycle accident","male nudity","machine gun","head butt","grenade","fellatio","exploding body","death","cocaine","car accident","blood","killing an animal","swimming pool","suffocation","shot in the hand","shot in the chest","sewing machine","severed hand","motorcycle crash","motorcycle cop","meat cleaver","hypodermic","hospital","helicopter","falling from height","dvd","defibrillation","bathroom","answering machine","hitman","surprise ending","directorial debut","first part","copulation","coitus","tough guy","hand to hand combat","fistfight","mixed martial arts","one word title","reference to houdini","one man army","gangsta grip","first person perspective","part computer animated","change of heart","black comedy","anti hero","surprise after end credits","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:47:52"}}