{"data":{"movies":[{"title":"The Last Legion","originalTitle":"","year":"2007","releaseDate":"20070817","directors":[{"name":"Doug Lefler","id":"nm0498991"}],"writers":[{"name":"Jez Butterworth","id":"nm0125336"},{"name":"Tom Butterworth","id":"nm0125358"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTkwODU0OF5BMl5BanBnXkFtZTcwMjMyOTA1MQ@@._V1.jpg","countries":["UK","Italy","France","Tunisia"],"languages":["English"],"genres":["Action","Adventure","Fantasy","War"],"plot":"Circa 460 A.D. Mira was born in a warrior-family in Kerala, India, was well versed in martial arts and self-defense, so much so that she was recruited by the Spanish royalty and re-located to Constantinople. From there she was instructed to assist Roman Commander Aurelius to plan the escape of 12-year old Romulus Augustus Caesar from a prison in Capri after his parents had been killed by the leader of the Alliance in turmoil-stricken Rome that has seen the deaths of five emperors in five years. Mira, Aurelius, and a Priest, Ambrosinius, along with a handful of loyal soldiers were successful in the escape plan and deliver Romulus to Roman Senator Nestor. What the crew do not realize is that their task is not over yet, for Nestor is all set to betray Romulus, leaving them with no alternative but to flee to Britannia, where they will be forced to confront a seemingly invincible Vortygn, whose main aim is to obtain a powerful sword that was meant for defense and defeat, and also ensure ...","simplePlot":"As the Roman empire crumbles, young Romulus Augustus flees the city and embarks on a perilous voyage to Britain to track down a legion of supporters.","actors":[{"actorName":"Colin Firth","urlProfile":"http://www.imdb.com/name/nm0000147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDMwMTI4MF5BMl5BanBnXkFtZTcwMzE2MzQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1960","placeOfBirth":" Grayshott, Hampshire, England, UK","birthName":"Colin Andrew Firth","height":"6' 1½\" (1.87 m)","bio":"Colin Andrew Firth was born into an academic family in Grayshott, Hampshire, England. His mother, Shirley Jean (Rolles), was a comparative religion lecturer at the Open University, and his father, David Norman Lewis Firth, lectured on history at Winchester University College (formerly King Alfred's College) in Winchester, and worked on education for the Nigerian government. His grandparents were missionaries. His siblings Katie Firth and Jonathan Firth are also actors. Firth's first acting experience came in infant's school when he played \"Jack Frost\" in a Christmas pantomime. Three of his four grandparents were Methodist missionaries and he spent his early childhood in Nigeria, returning to England at age five where he entered a comprehensive school in Winchester. He spent two years at the Drama Centre London in Chalk Farm where he was \"discovered\" while playing \"Hamlet\" during his final term. His first professional role was as \"Bennet\" in the West End production of \"Another Country\". From this performance, he was chosen to play the character of \"Judd\" in the movie of the play. He went on to play a variety of character parts in both film and television. For his portrayal of \"Robert Lawrence\" in the 1989 TV production Tumbledown (1988), he received the Royal Television Society Best Actor award and also a BAFTA nomination. He also received a BAFTA nomination for \"Mr. Darcy\" in the 1995 TV version of Pride and Prejudice (1995). In 2011, he won the Oscar for Best Actor for his commanding leading role, playing British King George VI in The King's Speech (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDMwMTI4MF5BMl5BanBnXkFtZTcwMzE2MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000147","name":"Colin Firth","idIMDB":"nm0000147"},"actorId":"nm0000147","character":"Aurelius","urlCharacter":"http://www.imdb.com/character/ch0025483","main":true},{"actorName":"Ben Kingsley","urlProfile":"http://www.imdb.com/name/nm0001426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1943","placeOfBirth":" Scarborough, Yorkshire, England, UK","birthName":"Krishna Bhanji","height":"5' 8\" (1.73 m)","bio":"Ben Kingsley was born Krishna Bhanji on December 31, 1943 in Scarborough, Yorkshire, England. His father, Rahimtulla Harji Bhanji, was a Kenyan-born medical doctor, of Gujarati Indian descent, and his mother, Anna Lyna Mary (Goodman), was an English actress. Ben began to act in stage plays during the 1960s. He soon became a successful stage actor, and also began to have roles in films and television. His birth name was Krishna Bhanji, but he changed his name to \"Ben Kingsley\" soon after gaining fame as a stage actor, fearing that a foreign name could hamper his acting career. Kingsley first earned international fame for his performance in the drama movie Gandhi (1982). His performance as Mohandas K. Gandhi earned him international fame. He won many awards - including an Academy Award for Best Actor. He also won Golden Globe, BAFTA and London Film Critics' Circle Awards. After acting in Gandhi (1982), Ben was recognized as one of the finest British actors. After his international fame for appearing in Gandhi (1982), Kingsley appeared in many other famous movies. His success as an actor continued. His performance as Itzhak Stern in the drama movie Schindler's List (1993) earned him a BAFTA nomination. Schindler's List (1993) won seven Academy Awards, including Best Picture. During the late 1990s, Kingsley acted in many successful movies. He played Sweeney Todd in the television movie The Tale of Sweeney Todd (1997). For his performance in this movie, he was nominated for the Screen Actors' Guild Award. His other notable role was as Otto Frank in the television movie Anne Frank (2001), for which he won a Screen Actors' Guild Award. In 2002, Kingsley was appointed Knight Bachelor of the Order of the British Empire in the Queen's New Years Honours for his services to drama. In 2013, he received the BAFTA Los Angeles Britannia Award for Worldwide Contribution to Filmed Entertainment. That same year, he also received the Fellowship Award at the Asian Awards in London, England. Ben Kingsley currently resides in Spelsbury, Oxfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001426","name":"Ben Kingsley","idIMDB":"nm0001426"},"actorId":"nm0001426","character":"Ambrosinus / Merlin","urlCharacter":"http://www.imdb.com/character/ch0025484","main":true},{"actorName":"Aishwarya Rai Bachchan","urlProfile":"http://www.imdb.com/name/nm0706787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjEyODkzN15BMl5BanBnXkFtZTcwODkxMTY1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1973","placeOfBirth":" Mangalore, Karnataka, India","birthName":"Aishwarya Krishnaraj Rai","height":"5' 7\" (1.7 m)","bio":"Born into a traditional south Indian family, Aishwarya started modeling at a young age. This green-blue-eyed beauty appeared in advertisements for many prestigious firms; the ones that brought her into the limelight were the garden sari and the Pepsi ad. Crowned Miss India 1994 runner-up, she was a hot favorite in the run for miss world title, which she won, her beauty and charm made her India's darling. Ash stormed into the Indian movie industry, where she has proven herself a brilliant & genuine actress. Her performance in Iruvar (1997) was critically acclaimed, and she won the Screen best female debutant award for her role in ...Aur Pyaar Ho Gaya (1997). She was adored in movies like Taal (1999), Hum Dil De Chuke Sanam (1999), Devdas (2002), her item number in 'Bunty & Bubbly' had sent waves of rhythm across the nation. With her successful Bollywood movies and prestigious Hollywood projects lined up for release it is impossible to ignore this Indian diva in international scenes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjEyODkzN15BMl5BanBnXkFtZTcwODkxMTY1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0706787","name":"Aishwarya Rai Bachchan","nicknames":["Ash","Gullu"],"idIMDB":"nm0706787"},"actorId":"nm0706787","character":"Mira","urlCharacter":"http://www.imdb.com/character/ch0059506","main":true},{"actorName":"Peter Mullan","urlProfile":"http://www.imdb.com/name/nm0611932","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NDUxMjIzNzVeQTJeQWpwZ15BbWU2MDU0MTk3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1959","placeOfBirth":" Peterhead, Scotland, UK","height":"5' 8\" (1.73 m)","bio":"He was interested in directing films at the age of 19 and he made several shorts. As he wasn't admitted to the National Film School, he decided to dedicate himself to acting, and made his debut in the theatre in 1988 before moving to cinema and television. Fame came with the parts he played in such films as Riff-Raff (1991) by Ken Loach, Braveheart (1995) by Mel Gibson and Trainspotting (1996) by Danny Boyle, but above all when he won for best leading actor at the Cannes Film Festival in 1998 for My Name Is Joe (1998), once again by Loach. The Magdalene Sisters (2002) is the second feature-length film he has directed. He also directed a few episodes of the BBC TV series, Cardiac Arrest (1994), which earned him a best director nomination from the Royal Television Society.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NDUxMjIzNzVeQTJeQWpwZ15BbWU2MDU0MTk3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611932","name":"Peter Mullan","idIMDB":"nm0611932"},"actorId":"nm0611932","character":"Odoacer","urlCharacter":"http://www.imdb.com/character/ch0087275","main":true},{"actorName":"Kevin McKidd","urlProfile":"http://www.imdb.com/name/nm0571727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUxNTQ3OV5BMl5BanBnXkFtZTcwOTg4Mjc5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1973","placeOfBirth":" Elgin, Moray, Scotland, UK","height":"5' 11\" (1.8 m)","bio":"Kevin McKidd was born and raised in Elgin, Scotland, the son of Kathleen, a secretary, and Neil McKidd, a plumber. He was a member of the Moray Youth Theatre, before going on to study Engineering at the University of Edinburgh. While at the university, Kevin became involved with Bedlam Theatre, the university's student theatre company. At this point, Kevin decided to give up on engineering and dropped out of the university to pursue acting full-time. In 1994, he landed the leading role in the stageplay, \"The Silver Darlings\", produced by Robert Carlyle's Rain Dog Theatre Company. It was only a matter of time before Kevin made his screen debut as the vicious gangleader, \"Malky Johnson\", in Gillies MacKinnon's Small Faces (1996). His next role was as the tragic, gentle giant, \"Tommy\", in Trainspotting (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUxNTQ3OV5BMl5BanBnXkFtZTcwOTg4Mjc5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571727","name":"Kevin McKidd","idIMDB":"nm0571727"},"actorId":"nm0571727","character":"Wulfila","urlCharacter":"http://www.imdb.com/character/ch0252615","main":true},{"actorName":"John Hannah","urlProfile":"http://www.imdb.com/name/nm0001314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Nzk0NjA5OV5BMl5BanBnXkFtZTcwNjM2NDA4MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1962","placeOfBirth":" East Kilbride, Scotland, UK","birthName":"John David Hannah","height":"5' 10\" (1.78 m)","bio":"John Hannah is the youngest child of his family, having two older sisters. Before he decided on a career as an actor, John was an apprentice electrician for four years. He gave up his work as an electrician after being accepted to the Royal Scottish Academy of Music and Drama in Glasgow. After years of struggling, he finally got his 'big break' when he was cast as Matthew in Four Weddings and a Funeral (1994). He currently lives in London with his wife Joanna Roth and their two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Nzk0NjA5OV5BMl5BanBnXkFtZTcwNjM2NDA4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001314","name":"John Hannah","idIMDB":"nm0001314"},"actorId":"nm0001314","character":"Nestor","urlCharacter":"http://www.imdb.com/character/ch0457902","main":true},{"actorName":"Iain Glen","urlProfile":"http://www.imdb.com/name/nm0322513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NzU2NjI2MF5BMl5BanBnXkFtZTcwMzI1OTQ3Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1961","placeOfBirth":" Edinburgh, Scotland, UK","height":"6' 1\" (1.85 m)","bio":"Iain Glen is a Scottish actor, he was born on June 24, 1961 in Edinburgh, Scotland. He was educated at the Edinburgh Academy, an independent school for boys (now co-educational), followed by the University of Aberdeen. He graduated from the Royal Academy of Dramatic Art, where he was the winner of the Bancroft Gold Medal. He has appeared onstage as \"Macbeth\" (Tron Theatre), \"Henry V\" (Royal Shakespeare Company), starred in \"Martin Guerre\" and in \"The Blue Room\" with Nicole Kidman. He also received much acclaim for his role in \"Silent Scream\". He and his wife, Susannah Harker (House of Cards (1990), Pride and Prejudice (1995), Ultraviolet (1998)) have a son, Finlay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NzU2NjI2MF5BMl5BanBnXkFtZTcwMzI1OTQ3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322513","name":"Iain Glen","idIMDB":"nm0322513"},"actorId":"nm0322513","character":"Orestes","urlCharacter":"http://www.imdb.com/character/ch0176037","main":true},{"actorName":"Thomas Brodie-Sangster","urlProfile":"http://www.imdb.com/name/nm1032473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTUyMzY0OV5BMl5BanBnXkFtZTcwMTEyMTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1990","placeOfBirth":" London, England, UK","birthName":"Thomas Brodie Sangster","height":"5' 10½\" (1.79 m)","bio":"Thomas Brodie-Sangster was born on May 16, 1990 in London, England as Thomas Brodie Sangster. He is an actor and producer, known for Phineas and Ferb (2007), The Maze Runner (2014) and Maze Runner: The Scorch Trials (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTUyMzY0OV5BMl5BanBnXkFtZTcwMTEyMTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1032473","name":"Thomas Brodie-Sangster","idIMDB":"nm1032473"},"actorId":"nm1032473","character":"Romulus Augustus","urlCharacter":"http://www.imdb.com/character/ch0087274","main":true},{"actorName":"Rupert Friend","urlProfile":"http://www.imdb.com/name/nm1670029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDExNDE5Ml5BMl5BanBnXkFtZTgwMjUwNjA0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1981","placeOfBirth":" Oxfordshire, England, UK","birthName":"Rupert William Anthony Friend","height":"6' 1\" (1.85 m)","bio":"Rupert Friend was born on October 1, 1981 in Oxfordshire, England as Rupert William Anthony Friend. He is an actor and writer, known for Homeland (2011), The Young Victoria (2009) and Pride & Prejudice (2005). He has been married to Aimee Mullins since May 1, 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDExNDE5Ml5BMl5BanBnXkFtZTgwMjUwNjA0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1670029","name":"Rupert Friend","idIMDB":"nm1670029"},"actorId":"nm1670029","character":"Demetrius","urlCharacter":"http://www.imdb.com/character/ch0457901","main":true},{"actorName":"Nonso Anozie","urlProfile":"http://www.imdb.com/name/nm1996829","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTQwODY0MF5BMl5BanBnXkFtZTgwNjA3NTc1MDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1979","placeOfBirth":" London, England, UK","height":"6' 6\" (1.98 m)","bio":"Nonso Anozie was born on May 28, 1979 in London, England. He is an actor, known for The Grey (2011), Cinderella (2015) and Atonement (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTQwODY0MF5BMl5BanBnXkFtZTgwNjA3NTc1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1996829","name":"Nonso Anozie","idIMDB":"nm1996829"},"actorId":"nm1996829","character":"Batiatus","urlCharacter":"http://www.imdb.com/character/ch0457900","main":true},{"actorName":"Owen Teale","urlProfile":"http://www.imdb.com/name/nm0853583","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDU2NDE0Nl5BMl5BanBnXkFtZTcwMjgzMzczMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1961","placeOfBirth":" Swansea, West Glamorgan, Wales, UK","birthName":"Owen Nigel Courtney Teale","height":"6' 2\" (1.88 m)","bio":"Owen Teale trained at the Guildford School of Acting. He was married to actress Dilys Watling and they had one son before their divorce in the mid 1990s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDU2NDE0Nl5BMl5BanBnXkFtZTcwMjgzMzczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853583","name":"Owen Teale","idIMDB":"nm0853583"},"actorId":"nm0853583","character":"Vatrenus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Siddig","urlProfile":"http://www.imdb.com/name/nm0796502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjYwMTA3MV5BMl5BanBnXkFtZTcwNDQxODYzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1965","placeOfBirth":" Sudan","birthName":"Siddig El Tahir El Fadil El Siddig Abderahman Mohammed Ahmed Abdel Karim El Mahdi","height":"5' 11¾\" (1.82 m)","bio":"Born in Sudan, Siddig was raised in Britain and attended the London Academy of Music and Dramatic Arts (LAMDA) where he studied acting and theater. Immediately after leaving LAMDA, Sid did a season of theater in Manchester, in addition to performing in various shows in pubs and small theaters. Later, Siddig worked as a director in a small theater in London. \"I was in a situation where I pretty much had a theater company at my disposal and a theater at my disposal and could do anything I liked...as long as I did it for nothing. Which is sort of a step before charging and not being able to do what you like. I was at a point where I could have just gone on and become a director in London, as a trainee at the Royal Shakespeare Company or something like that, and ended up being a bona fide director. It was quite a big struggle because for a year and a half, which is the time I spent directing immediately after I left acting school, you just have no money so you're just living on welfare and you're trying to make it. . .\" During this time of financial struggle Sid was offered the part of Emir Feisal in Great Performances: A Dangerous Man: Lawrence After Arabia (1992), the sequel to Lawrence of Arabia (1962). Sid co-starred with Ralph Fiennes who played T. E. Lawrence. Siddig's performance in Great Performances: A Dangerous Man: Lawrence After Arabia (1992) brought him to the attention of Rick Berman who was creating the new series Star Trek: Deep Space Nine (1993). Originally brought in to audition for the role of Captain Benjamin Sisko, Berman decided Siddig was too young for the role and cast him as Dr. Julian Bashir instead. The part had to be slightly rewritten for Siddig as the original \"bible\" had called for an Hispanic male to play the part, named Julian Amoros, although Berman reports that no other actors were considered for the role. During his time on Star Trek: Deep Space Nine (1993), Siddig and co-star Nana Visitor had a son (Django) and were married in 1997. They divorced in 2001, although they remain friends. After a successful seven-year run on television, Siddig began working in feature films, quickly accumulating roles in movies such as Vertical Limit (2000), Reign of Fire (2002), Kingdom of Heaven (2005), and the critically acclaimed Syriana (2005). Early 2005 saw Siddig return to the stage opposite Kim Cattrall in the West End production of \"Whose Life Is It Anyway?\" Following a controversial guest turn on MI-5 (2002), the title role in Hannibal (2006) in 2006 and a recurring role on 24 (2001) in 2007 brought Siddig back to the small screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjYwMTA3MV5BMl5BanBnXkFtZTcwNDQxODYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0796502","name":"Alexander Siddig","nicknames":["Sid"],"idIMDB":"nm0796502"},"actorId":"nm0796502","character":"Theodorus Andronikos","urlCharacter":"http://www.imdb.com/character/ch0098170","main":true},{"actorName":"Robert Pugh","urlProfile":"http://www.imdb.com/name/nm0700059","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzZiNjZiMGItNTQ2Yi00MGU3LWFjMTktNzlmNDFlYzA3MjY3XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1950","placeOfBirth":" Aberdare, Glamorgan, Wales, UK","bio":"Robert Pugh grew up in a village called the Tynte, a small mining village set just outside Pontypridd, where Tom Jones was raised. The Tynte is a few miles in between Aberdare and Pontypridd about twenty miles north of Cardiff. He attended the Rose Buford acting school, from which he graduated in 1976.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzZiNjZiMGItNTQ2Yi00MGU3LWFjMTktNzlmNDFlYzA3MjY3XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700059","name":"Robert Pugh","idIMDB":"nm0700059"},"actorId":"nm0700059","character":"Kustennin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Cosmo","urlProfile":"http://www.imdb.com/name/nm0181920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4MDUzMzgyNl5BMl5BanBnXkFtZTcwNjgwNDcyMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1948","placeOfBirth":" Clydebank, West Dunbartonshire, Scotland, UK","height":"6' 2\" (1.88 m)","bio":"James Cosmo was born on May 24, 1948 in Clydebank, West Dunbartonshire, Scotland. He is an actor, known for Braveheart (1995), Trainspotting (1996) and The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). He has been married to Annie Harris since May 24, 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4MDUzMzgyNl5BMl5BanBnXkFtZTcwNjgwNDcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0181920","name":"James Cosmo","idIMDB":"nm0181920"},"actorId":"nm0181920","character":"Hrothgar","urlCharacter":"http://www.imdb.com/character/ch0035803","main":true},{"actorName":"Harry Van Gorkum","urlProfile":"http://www.imdb.com/name/nm0002246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTA0MzE4OF5BMl5BanBnXkFtZTcwMTI3NzAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"London-born, classically-trained actor Harry Van Gorkum holds an impressive career in all aspects of acting, including stage theater, film and television. After attending Lancaster University, Harry went on to act in theater, participating in stage productions throughout England, with an appearance in the award-winning Being At Home With Claude. On moving to America, Harry began to add to his acting resume with guest appearances on various television series including Seinfeld, Friends, Just Shoot Me, CSI, Jag, and perhaps most notably in The Nanny as a recurring character who was Fran Drescher's love interest. On film, Harry has appeared in Batman & Robin (1997), Gone In Sixty Seconds (2000) with Nicolas Cage and Escape Under Pressure (2000) with Rob Lowe. He also appeared with seasoned action stars Steven Seagal in The Foreigner (2003), with Bruce Willis in Tears of the Sun (2003) and Sylvester Stallone in Avenging Angelo (2002). Harry also brought his comic skills to the screen in Pink Panther 2 (2009) and was recurring on the final season of 24 (2010), playing the British Foreign Minister Louis Dalton. He has can also be seen in the top ten grossing film of 2010 Karate Kid, and two Disney shows I'm in the Band (2011) and Wizards of Waverly Place (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTA0MzE4OF5BMl5BanBnXkFtZTcwMTI3NzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002246","name":"Harry Van Gorkum","idIMDB":"nm0002246"},"actorId":"nm0002246","character":"Vortgyn","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0462396","urlIMDB":"http://www.imdb.com/title/tt0462396","business":{"budget":{"money":"$35,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$2,746,312","country":"USA","day":"19","month":"08","year":"2007","remarks":"2,002 Screens"},{"money":"£125,540","country":"UK","day":"21","month":"10","year":"2007","remarks":"204 Screens"}],"gross":[{"money":"$5,920,150","country":"USA","day":"21","month":"10","year":"2007","remarks":""},{"money":"$5,900,836","country":"USA","day":"07","month":"10","year":"2007","remarks":""},{"money":"$5,897,174","country":"USA","day":"30","month":"09","year":"2007","remarks":""},{"money":"$5,886,201","country":"USA","day":"23","month":"09","year":"2007","remarks":""},{"money":"$5,867,105","country":"USA","day":"16","month":"09","year":"2007","remarks":""},{"money":"$5,834,794","country":"USA","day":"09","month":"09","year":"2007","remarks":""},{"money":"$5,754,782","country":"USA","day":"02","month":"09","year":"2007","remarks":""},{"money":"$5,039,752","country":"USA","day":"26","month":"08","year":"2007","remarks":""},{"money":"$2,746,312","country":"USA","day":"19","month":"08","year":"2007","remarks":""},{"money":"£335,838","country":"UK","day":"28","month":"10","year":"2007","remarks":""},{"money":"£125,540","country":"UK","day":"21","month":"10","year":"2007","remarks":""},{"money":"$25,303,038","country":"Worldwide","day":"26","month":"08","year":"2012","remarks":""},{"money":"$3,426,524","country":"Russia","day":"03","month":"06","year":"2007","remarks":""},{"money":"$3,310,937","country":"Russia","day":"06","month":"05","year":"2007","remarks":""},{"money":"$1,639,149","country":"Russia","day":"22","month":"04","year":"2007","remarks":""}],"weekendGross":[{"money":"$18,470","country":"USA","day":"21","month":"10","year":"2007","remarks":"65 Screens"},{"money":"$896","country":"USA","day":"07","month":"10","year":"2007","remarks":"6 Screens"},{"money":"$5,844","country":"USA","day":"30","month":"09","year":"2007","remarks":"14 Screens"},{"money":"$11,849","country":"USA","day":"23","month":"09","year":"2007","remarks":"23 Screens"},{"money":"$15,599","country":"USA","day":"16","month":"09","year":"2007","remarks":"36 Screens"},{"money":"$39,110","country":"USA","day":"09","month":"09","year":"2007","remarks":"83 Screens"},{"money":"$184,008","country":"USA","day":"02","month":"09","year":"2007","remarks":"252 Screens"},{"money":"$901,294","country":"USA","day":"26","month":"08","year":"2007","remarks":"1,935 Screens"},{"money":"$2,746,312","country":"USA","day":"19","month":"08","year":"2007","remarks":"2,002 Screens"},{"money":"£80,724","country":"UK","day":"28","month":"10","year":"2007","remarks":"200 Screens"},{"money":"£125,540","country":"UK","day":"21","month":"10","year":"2007","remarks":"204 Screens"}],"admissions":[{"money":"42,496","country":"Germany","day":"02","month":"09","year":"2007","remarks":""},{"money":"23,600","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"08","year":"2005","remarks":null},{"money":null,"country":null,"day":"11","month":"11","year":"2005","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Cooke S4 Lenses","Arricam ST, Cooke S4 Lenses"],"laboratory":["Laboratoires LTC, Paris, France"],"filmLength":["2,748 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 200T 5217, Vision2 500T 5218)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.4","metascore":"37","filmingLocations":[{"location":"Cerveny Castle, Pezinok, Slovakia"}],"rated":"PG-13","awards":[{"award":"World Stunt Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Taurus Award","categories":[{"category":"Best Action in a Foreign Language Film","names":[{"name":"Steve Griffin","id":"nm0341363","role":null},{"name":"Lubomir Misak","id":"nm0592652","role":null},{"name":"Monika Fiserova","id":"nm0279249","role":null}]}]}]},{"award":"Young Artist Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in an International Feature Film - Leading Young Performer","names":[{"name":"Thomas Brodie-Sangster","id":"nm1032473","role":null}]}]}]}],"votes":"30,345","type":"Movie","companyCreditsSimple":[{"idCompany":"co0014380","name":"Dino De Laurentiis Company"},{"idCompany":"co0120901","name":"Quinta Communications"},{"idCompany":"co0136728","name":"Ingenious Film Partners"}],"keywords":{"keywords":["roman legion","5th century","capri","soldier","boy","emperor","britain","sword","roman empire","roman britain","sword and shield","armor","steel helmet","helmet","sword and sorcery","sword and fantasy","swashbuckler","king arthur","hand to hand combat","combat","battlefield","paris france","naples italy","arthurian legend","mountain","wall","sword in stone","throat slitting","scar","murder of family","mask","loss of parents","impalement","female warrior","excalibur","dead children","coronation","child ruler","child murder","battle","capri italy","sword and sandal","ravenna italy","birth of a nation","barbarian","child in peril","ancient rome","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:16:42"}}