{"data":{"movies":[{"title":"Baby","originalTitle":"","year":"2007","releaseDate":"2007","directors":[{"name":"Juwan Chung","id":"nm1707805"}],"writers":[{"name":"Felix Chan","id":"nm1692002"},{"name":"Juwan Chung","id":"nm1707805"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjM3NDk1OF5BMl5BanBnXkFtZTcwNzYxMjk5MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"plot":"A tragic tale of an Asian youth's gang life in South East Los Angeles, set during the mid 80's to the early 90s.","simplePlot":"A tragic tale of an Asian youth's gang life in South East Los Angeles, set during the mid 80's to the early 90s.","actors":[{"actorName":"David Huynh","urlProfile":"http://www.imdb.com/name/nm1092107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0MzQzMDI0OF5BMl5BanBnXkFtZTgwOTM2MTQzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1983","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"David Cam-Tuan Huynh","height":"5' 6\" (1.68 m)","bio":"David Huynh won a Special Jury Prize at the 2007 Los Angeles Asian Pacific Film Festival for Outstanding Newcomer Award and Best Emerging Actor for his performance in Juwan Chung's Baby (2007), which also won a Special Jury Award for Best Feature Length Film at that year's Festival. Huynh has also Starred in Byron Q.'s film, Bang Bang (2011), which won a Special Jury Award for Best First Feature, Narrative, at the 2011 Los Angeles Asian Pacific Film Festival. David has appeared on TV shows such as ER (1994), Cold Case (2003) and Without a Trace (2002). In 2008, he starred in Mark Tran's film All About Dad (2009) (Winner of the Cinequest Film Festival Audience Award for Best Feature) as a Biology major who quits his studies to pursue a career in filmmaking. Huynh has appeared on stage at Sacred Fools Theater Company, The Kirk Douglas Theater, starred as \"Neil\" in the East West Players Production of Prince Gomolvilas' play adaptation of Scott Heim's Mysterious Skin (2004), for which he was named \"Best Actor in A Play\" at the 20th Annual Ticket Holder Awards of 2010 and as a Best Featured Performance on Theater Critic Don Grigware's \"The Best in Los Angeles Theater 2010\", and starred at The Colony Theater as \"Vuthy\" in Michael Golamco's play Year Zero.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0MzQzMDI0OF5BMl5BanBnXkFtZTgwOTM2MTQzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1092107","name":"David Huynh","nicknames":["Dave"],"idIMDB":"nm1092107"},"actorId":"nm1092107","character":"Baby","urlCharacter":"http://www.imdb.com/character/ch0296695","main":true},{"actorName":"Feodor Chin","urlProfile":"http://www.imdb.com/name/nm1216120","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMjAzOTEzN15BMl5BanBnXkFtZTcwODI2ODk5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1974","placeOfBirth":" San Francisco, California, USA","birthName":"Feodor B. Chin","bio":"Feodor Chin was born on August 18, 1974 in San Francisco, California, USA as Feodor B. Chin. He is an actor and writer, known for Overwatch (2016), Lopez (2016) and New Girl (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMjAzOTEzN15BMl5BanBnXkFtZTcwODI2ODk5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1216120","name":"Feodor Chin","idIMDB":"nm1216120"},"actorId":"nm1216120","character":"Benny","urlCharacter":"http://www.imdb.com/character/ch0296698","main":true},{"actorName":"Kenneth Choi","urlProfile":"http://www.imdb.com/name/nm0158846","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU0NTgwNzA4OF5BMl5BanBnXkFtZTcwMTExMzk5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1971","placeOfBirth":" Chicago, Illinois, USA","height":"5' 7\" (1.7 m)","bio":"Growing up in the suburbs of Chicago, Choi dreamed of becoming an actor. Against his family's wishes, Choi left college to pursue that dream. He literally ran away from home, cutting all ties with his family for 5 years to train and study before moving to Los Angeles. His dream became a reality as he landed guest appearances in 6 television series during his first year including \"The West Wing\" and \"Roswell\". Choi gained recognition as both a comedic and dramatic actor with memorable guest turns on hit sitcoms \"The King of Queens\", \"Reba\", \"According to Jim\" and recurring roles in critically successful dramas such as \"House\" and \"24\". In 2008, Choi landed a starring role in the ABC Family series \"Samurai Girl\" opposite Jamie Chung, as well as recurring arcs in 2009 with Starz's \"Crash\" and Fox's \"Glee\", and in 2010 with TNT's \"Hawthorne\" and FX's critically-acclaimed \"Sons Of Anarchy\" playing Henry Lin. In 2004, Choi was cast in Steven Spielberg's \"The Terminal\". This sparked a surge in Choi's film career as he completed more than a dozen films through 2012 working with acclaimed writer/director David Ayer in \"Street Kings\" and \"Harsh Times\", and high profile roles in Lionsgate's \"War\" opposite Jason Statham, \"Red Dawn\" opposite Chris Hemsworth and Jeffrey Dean Morgan and his supporting lead role in the Marvel blockbuster, \"Captain America: The First Avenger\" playing Howling Commando Jim Morita. Choi gained 25 pounds to play the tough but hilarious Chester Ming alongside Leonardo DiCaprio and Jonah Hill in Martin Scorsese's Oscar-nominated, \"The Wolf Of Wall Street\". Along with his many film achievements, Choi has starred in several television shows including \"Ironside\" and \"Allegiance\" both for NBC Universal. Most notably, Choi inhabited the role of Judge Lance Ito for FX's highly-acclaimed Emmy-winning, Golden Globe-winning \"The People v. OJ Simpson: American Crime Story\" for Ryan Murphy. Choi has several feature films coming out in 2017 including, \"Spider-Man: Homecoming\" with Tom Holland, \"Bright\" with Will Smith, and \"American Express\" with Joel Edgerton. Also in 2017, he recurs on the television shows, \"The Last Man On Earth\" for FOX, \"Counterpart\" for Starz, and a leading role on NBC's \"Untitled Kourtney Kang Project\". Author: Fifteen Minutes","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU0NTgwNzA4OF5BMl5BanBnXkFtZTcwMTExMzk5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0158846","name":"Kenneth Choi","idIMDB":"nm0158846"},"actorId":"nm0158846","character":"Mike","urlCharacter":"http://www.imdb.com/character/ch0296700","main":true},{"actorName":"Shannon Dang","urlProfile":"http://www.imdb.com/name/nm0199473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNzAzNmUtYjBlZC00M2E1LTgzMjYtNjZhNjNjZWY4ZDJhL2ltYWdlXkEyXkFqcGdeQXVyMjczMjQ0MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Shannon Dang is an actress, known for East Los High (2013), Major Crimes (2012) and The Gene Generation (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNzAzNmUtYjBlZC00M2E1LTgzMjYtNjZhNjNjZWY4ZDJhL2ltYWdlXkEyXkFqcGdeQXVyMjczMjQ0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199473","name":"Shannon Dang","idIMDB":"nm0199473"},"actorId":"nm0199473","character":"Young Sammy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aljarreau Galang","urlProfile":"http://www.imdb.com/name/nm1965715","urlPhoto":"","biography":{"bio":"Aljarreau Galang is an actor, known for Baby (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1965715","name":"Aljarreau Galang","idIMDB":"nm1965715"},"actorId":"nm1965715","character":"Robbie","urlCharacter":"http://www.imdb.com/character/ch0296701","main":true},{"actorName":"Kenzo Lee","urlProfile":"http://www.imdb.com/name/nm1655038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI1NTk0NzA2N15BMl5BanBnXkFtZTgwODUwNjcwNDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1980","placeOfBirth":" Oakland, California, USA","height":"5' 5½\" (1.66 m)","bio":"Kenzo Lee is an American actor. He has been seen in How I Met Your Mother (2005), Happy Endings (2011), Extant (2014), A Leading Man (2013), and Baby (2007). He was born and raised in Oakland, California. He graduated from UC San Diego and the British American Drama Academy. He has been seen in numerous national commercials. His first college teacher was Ricardo Chavira from Desperate Housewives. He participated in the CBS Multicultural Comedy Showcase. His Internet credits include Aperture R&D (2013) and The Online Gamer (2009)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI1NTk0NzA2N15BMl5BanBnXkFtZTgwODUwNjcwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1655038","name":"Kenzo Lee","idIMDB":"nm1655038"},"actorId":"nm1655038","character":"Roy","urlCharacter":"http://www.imdb.com/character/ch0296704","main":true},{"actorName":"Tzi Ma","urlProfile":"http://www.imdb.com/name/nm0002245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWQ3OGJlMjgtNWFlNS00YzM4LWIzNzMtYTM1MzFkY2EyYTUxL2ltYWdlXkEyXkFqcGdeQXVyMjQ0ODU3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"An endlessly imaginative and compelling actor, Tzi Ma has created a score of memorable film, television and stage characters. From his recent roles as Hinh, a deadly efficient assassin and nationalist spy masquerading as Michael Caine's ever-invaluable assistant in The Quiet American (2002) to his hilarious, lit-cigarette-swallowing take as The General in Joel Coen and Ethan Coen's The Ladykillers (2004), Ma always delivers the unexpected. So far, 2005 is offering Ma even more opportunities to brand his indelible stamp on widely diverse projects. This year will see him in a slate of shows, including a multi-episode cliffhanger for the critically acclaimed hit series 24 (2001); the inspirational Lions Gate family drama Akeelah and the Bee (2006); Nick Cassavetes' Alpha Dog (2006); the indie experimental film by new filmmaker Juwan Chung, Baby (2003), in which Ma will also function as associate producer; an episode of JAG (1995) that aired in the spring, and the indie movie Red Doors (2005), which premiered at the Fourth Annual Tribeca Film Festival and won for best narrative feature made in New York. Red Doors (2005) is the work of writer/director Georgia Lee, who served as director Martin Scorsese's apprentice on the set of Gangs of New York (2002) in Rome. She approached Ma to play the part of vulnerable, emotionally bankrupt father Ed Wong, who is desperately trying to mask his incessant suicidal compulsions from his three grown daughters. On the pulse-accelerating season closer for 24 (2001), Ma is the main protagonist, the relentless head of security for the Chinese consulate in Los Angeles. Shedding his diplomatic correctness to go eyeball to eyeball against Kiefer Sutherland's Agent Jack Bauer, Ma's character engages in a searing, deadly duel of wit, intimidation and lies. In Baby (2003) and Akeelah and the Bee (2006), starring Laurence Fishburne and Angela Bassett, Ma again interprets fatherhood, first as an intensely competitive \"sports dad\" driving his small son to win at any cost, then as an alcoholic who sees his son embracing a similar path of failure and waste. It was a personal invitation from director Cassavetes that led to Ma's cameo in Alpha Dog (2006), based on the headline-grabbing activities of Jesse James Hollywood, an alleged drug dealer accused of masterminding a kidnap-murder. Tzi Ma was born in Hong Kong and raised in New York City. Surrounded by music, diverse cultures, and an eclectic lifestyle, he defied tradition to study classical theater and dance. Drive and versatility resulted in steady stage and film work and since that time he has appeared in such television series as The Practice (1997), JAG (1995), The Bernie Mac Show (2001), Chicago Hope (1994), Millennium (1996), Jake 2.0 (2003), Martial Law (1998), ER (1994), Law & Order (1990), Boomtown (2002), as the star of the series Yellowthread Street (1990), and in the popular recurring role of Det. Harold Ng on NYPD Blue (1993). His numerous feature films include Rush Hour (1998), Golden Gate (1998), Dante's Peak (1997), Rapid Fire (1992), Chain Reaction (1996), and the acclaimed indie feature Catfish in Black Bean Sauce (1999). On stage, he garnered critical and popular acclaim with his starring role of \"Master Wang/Sammy Fong\" in the revised version of \"Flower Drum Song\" by David Henry Hwang, at the Mark Taper Forum in Los Angeles. Ma also appeared in two plays written especially for him, \"The Dance and The Railroad,\" by Tony award-winning playwright Hwang (M. Butterfly) and \"In Perpetuity Throughout The Universe\" by Eric Ellis Overmyer (executive producer of Law & Order (1990)). Ma has received numerous awards and nominations for his work, including the Cine Golden Eagle Award for Best Actor in \"The Dance and The Railroad\"; an Ace Award nomination for Best Supporting Actor in The Forgotten (2004), a TV film directed by James Keach; a Dramalogue Best\"Choreographer/Best Director Award for \"The Dance and The Railroad\"; and a Garland Award nomination for Best Actor, as well as a Los Angeles City Council Citation, for \"Flower Drum Song.\" Ma maintains homes in New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWQ3OGJlMjgtNWFlNS00YzM4LWIzNzMtYTM1MzFkY2EyYTUxL2ltYWdlXkEyXkFqcGdeQXVyMjQ0ODU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002245","name":"Tzi Ma","idIMDB":"nm0002245"},"actorId":"nm0002245","character":"Pops","urlCharacter":"http://www.imdb.com/character/ch0296696","main":true},{"actorName":"Ron Yuan","urlProfile":"http://www.imdb.com/name/nm0950620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjE5MzkyOF5BMl5BanBnXkFtZTcwNDY4Mzg3OQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1973","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Winston Yuan","bio":"Ron Yuan becomes new series regular on the hit Netflix/ The Weinstein Company's \"Marco Polo\" created by John Fusco. Yuan Will play Prince Nayan, a fiery eyed descendant of Genghis Khan. Nayan is a converted Christian that rules all of Manchuria and whose closely watched actions will affect Kublai's control of Asia. Yuan has been a force in front of and behind camera. Hollywood's secret weapon. Yuan is filming Roland Emmerich's Independence Day sequel (IDR) playing Yeong, the main weapons engineer. Before that, Yuan was on the \"The Accountant\" with Ben Affleck,JK Simmons and Anna Kendrick playing a reluctant Silat Master for \"Warrior\" director Gavin O'Connor. You can also see Yuan on Jon Bokenkamp's hit show \"The Blacklist\" as mysterious Blacklister Quon Zhang. Yuan was also seen in the final season of \"Sons of Anarchy\" as the intense and unpredictable Ryu Tom. Yuan cameos in Martin Scorsese's \"Revenge of the Green Dragons\" directed by Andrew Lau (Infernal Affairs) and Andrew Loo, playing the feared leader of the notorious BTK. Yuan played hard-nosed Lt. Peter Kang in the short lived CBS series \"Golden Boy\" from Nicholas Wootton and Greg Berlanti. Yuan also had recent cameo special guest appearances on\"Castle\" and \"Justified\". Yuan joins Francesca Eastwood and Annie Q in \"Cardinal X\" produced by Richard Bosner (Fruitvale Station) and Cassian Elwes in a semi- autobiographical film from first time director Angie Wang based on a college freshman in the 1980's who becomes an expert manufacturer and dealer of ecstasy. Yuan also played the iconic Japanese character Scorpion for Warner Bros' secret Mortal Kombat X \"Generations\" Yuan designed the fight sequences as well as going behind camera as Action Director for Steve Chasman/ Jason Statham's \"Wild Card\" scripted by William Goldman and directed by Simon West. Yuan just finished designing and directing the action on the popular Taiwanese/ Chinese/ International action franchise \"PiZi Ying Xiong 2\"(Black&White 2) shot all in Taiwan. In the past, Yuan was cast in a leading role on HBO pilot \"All Signs of Death\" opposite Ben Whishaw, directed by Alan Ball (True Blood). Yuan recently had character arcs on FOX's \"Touch\" opposite Keifer Sutherland created by Tim Kring (Heroes), NBC's \"Awake\" opposite Jason Issacs and FOX pilot \"Exit Strategy\" with Ethan Hawke directed by Antoine Fuqua (Training Day). Yuan also had memorable turns on hit series and films (Prison Break, CSI:NY, 24, Burn Notice, NCIS:LA, Pushing Daisies, Entourage, Art of War, Fast and Furious, Cradle 2 the Grave, Blood and Bone, Red Dawn) as well as being the voice behind major gaming campaigns (Call of Duty-Black Ops 2, Halo, Star War's Old Republic, Resident Evil, World of Warcraft, Medal of Honor, Army of Two, Guild Wars 2, Deus Ex, Drake's Uncharted, and many more). Yuan's MiniFlix Films with Sony Television (SPE) co-produced three edgy graphic novel stylized films(Three Bullets, Tea and Remembrance, Lollipops) in which Yuan wrote, produced and directed. Yuan's award winning work in short film and features has premiered in over 30 festivals worldwide (including Toronto, Sundance, Tribeca, Greece, Egypt, Beijing, Macao, Newport, Texas, Seattle, Kansas City, Los Angeles and Comic Con). In development are Yuan's \"Wind and Water\" \"Unspoken\" \"Cold\" and twisted post-apocalyptic martial arts western \"Forgotten 8\" in which the latter pairs Alex Tse(Watchmen) as producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjE5MzkyOF5BMl5BanBnXkFtZTcwNDY4Mzg3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950620","name":"Ron Yuan","idIMDB":"nm0950620"},"actorId":"nm0950620","character":"Tommy","urlCharacter":"http://www.imdb.com/character/ch0296711","main":true},{"actorName":"Christina Ahn","urlProfile":"http://www.imdb.com/name/nm1828130","urlPhoto":"","biography":{"bio":"Christina Ahn is an actress, known for Confessions of a Late Bloomer (2005), Rise: Blood Hunter (2007) and Baby (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1828130","name":"Christina Ahn","idIMDB":"nm1828130"},"actorId":"nm1828130","character":"Sammy","urlCharacter":"http://www.imdb.com/character/ch0296697","main":true},{"actorName":"Dana Lee","urlProfile":"http://www.imdb.com/name/nm0497086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzU5NDM5N15BMl5BanBnXkFtZTcwNjMwNDAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Dana Lee was born in a village outside of Guanzhou (Canton) China. His family immigrated to the U.S. when he was seven and settled in Houston, Texas. As one of a handful of Chinese-Americans living in segregated Houston, Dana was exposed to both the White and Black communities from an early age. His father had a grocery store in the fifth ward, a Black neighborhood, and their home was located in Denver Harbor, a poor White section of town. Growing up shy all of his childhood, Dana took acting classes at Stephen F. Austin High School to overcome it. He immediately fell in love with acting and eventually became an all-city actor. To this day, Dana has never forgotten what his high school acting coach, Mr. Jerry Long, told him: \"A good actor can transcend race, ethnicity, and color.\" Immediately after graduating from high school, Dana made a beeline to Los Angeles. But, because of his parent's disapproval of acting, it was not until many years later that he went headlong into the \"biz.\" In the intervening years, Dana joined the Marine Corps Reserve and got his Bachelor's Degree in Business Administration. Dana credits Jerry Thorpe with giving him his entry into SAG with a role on \"Kung Fu\" and Stephen J. Cannell for giving him a career in TV, appearing in many of Cannell's shows. He is also grateful to Sylvester Stallone for the opportunity to work with him in \"Rambo: First Blood, Part II.\" In addition to his prolific film and TV career, Dana has also been active on stage. He has performed at such prestigious venues as The Public Theatre in New York City, The Kennedy Center in Washington, D.C., and The Doolittle and The Mark Taper Forum in Los Angeles. He has acted in classics by Shakespeare, Ibsen, and Chekhov and in modern plays by Miller, Albee, and Shepard. For many years, Dana was a major driving force at East-West Players, America's most renowned Asian-American theatre. Among his most memorable stage works was playing George to Nancy Kwan's Martha in The Singapore Repertory Theatre's production of \"Who's Afraid of Virginia Woolf?\" and Dr. Rank to Shabana Azmi's Nora, in \"Nora,\" Ingmar Bergman's translation/adaptation of Ibsen's \"A Doll's House,\" also at SRT. Dana is a distinguished theatre director, too, having won many awards for directing. Dana is married to his college sweetheart, Michele. They have two beautiful daughters. Their eldest, Jennifer, is a physical therapist, and the youngest, Danielle is graduating with a Master's Degree in production design from AFI. In 2002, Dana won the Award of Excellence at the Big Bear Lake International Film Festival. He was also recognized for his acting achievements by the Chinese-American Society of Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzU5NDM5N15BMl5BanBnXkFtZTcwNjMwNDAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0497086","name":"Dana Lee","idIMDB":"nm0497086"},"actorId":"nm0497086","character":"Mr. Han","urlCharacter":"http://www.imdb.com/character/ch0296699","main":true},{"actorName":"Janet Linn","urlProfile":"http://www.imdb.com/name/nm1939450","urlPhoto":"","biography":{"bio":"Janet Linn is known for her work on Baby (2007), Myeongwol (2009) and Fobman 2 (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1939450","name":"Janet Linn","idIMDB":"nm1939450"},"actorId":"nm1939450","character":"Arianna","urlCharacter":"http://www.imdb.com/character/ch0296709","main":true},{"actorName":"Ryan Andres","urlProfile":"http://www.imdb.com/name/nm1938128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2Mjk0NzE5OV5BMl5BanBnXkFtZTcwMDk1MzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1993","placeOfBirth":" Redwood City, California, USA","birthName":"Ryan Nicolas Andres","height":"4' 3\" (1.3 m)","bio":"Ryan Nicolas Andres is a aspiring Artist, Actor, Model, Dancer, Writer. He started working when he was 7 years old by doing print work, commercials and performing at private functions. He did the voice over pilot for the hit show \"Avatar\" on Nickelodeon. He made his acting and singing debut as an Original Broadway cast member of La Boheme directed by Baz Luhrmann. At the age of 9, he broke into the Broadway circuit with over 300 performances. He continued on tour with the production from August 2002 to March 2004. He had the opportunity to perform at the Tony Awards as a nominee. On 15th November 2004, he received an Ovation Award in Los Angeles for his hard work in Theater. His music and acting are his passions in life. After breaking into Broadway, he made his way to the big screens. On Feb 2005, Ryan landed a role In a new film called \"Baby\". He also did a short DVD film called \"Angel\" and sings the theme song to the movie. He is currently working on a Short Film Indie called \"Saguaro\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2Mjk0NzE5OV5BMl5BanBnXkFtZTcwMDk1MzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1938128","name":"Ryan Andres","nicknames":["Ryu"],"idIMDB":"nm1938128"},"actorId":"nm1938128","character":"Young Baby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mack Wei","urlProfile":"http://www.imdb.com/name/nm1936632","urlPhoto":"","biography":{"bio":"Mack Wei is known for his work on Baby (2007), Thoughts Afar in Moonlight (2014) and Click... a 'Nam War Flick (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1936632","name":"Mack Wei","idIMDB":"nm1936632"},"actorId":"nm1936632","character":"Blackfish","urlCharacter":"http://www.imdb.com/character/ch0296712","main":true},{"actorName":"Peter Cho","urlProfile":"http://www.imdb.com/name/nm1808262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MzEzMjA1N15BMl5BanBnXkFtZTcwMTUwNDEzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Peter Cho is an actor, known for Baby (2007), Ghost Recon 2 (2004) and Monk (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MzEzMjA1N15BMl5BanBnXkFtZTcwMTUwNDEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1808262","name":"Peter Cho","idIMDB":"nm1808262"},"actorId":"nm1808262","character":"Fat Petey","urlCharacter":"http://www.imdb.com/character/ch0296705","main":true},{"actorName":"Richard Chiu","urlProfile":"http://www.imdb.com/name/nm1939926","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIxNDgyMzE0OF5BMl5BanBnXkFtZTgwMTI4MDU3MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Richard is an actor and musician, born in Los Angeles and raised in Toronto. He is the oldest of two brothers. His father is an engineer, mother is an accountant and his brother Winston Torr is a professional artist based in Berlin, Germany. With hopes to become a software programmer, his parents noticed his affinity with the arts. After struggling with this for years, they finally gave in and decided to fully support his decision. Richard worked as professional musician, producing albums and composing for films. He decided to make the transition into acting after Mara Santino (agent/manager) approached him and convinced Richard that acting is what he should be doing. He was so glad she was right. You can see Richard on the upcoming episode of CSI: Cyber on CBS, premiering March 25th.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIxNDgyMzE0OF5BMl5BanBnXkFtZTgwMTI4MDU3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1939926","name":"Richard Chiu","idIMDB":"nm1939926"},"actorId":"nm1939926","character":"Pretty Boy","urlCharacter":"http://www.imdb.com/character/ch0296708","main":true}],"seasons":[],"idIMDB":"tt0457286","urlIMDB":"http://www.imdb.com/title/tt0457286","business":{"budget":{"money":"$400,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.8","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"awards":[{"award":"VC FilmFest - Los Angeles Asian Pacific Film Festival 2007","titlesAwards":[{"titleAwardOutcome":"Won Special Jury Prize","categories":[{"category":"Outstanding Newcomer","names":[{"name":"David Huynh","id":"nm1092107","role":null}]},{"category":"Narrative Feature","names":[{"name":"Juwan Chung","id":"nm1707805","role":null}]}]}]}],"votes":"362","type":"Movie","companyCreditsSimple":[{"idCompany":"co0133402","name":"Affiliated Entertainment"}],"keywords":{"keywords":["character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:28:22"}}