{"data":{"movies":[{"title":"Demon Hunter","originalTitle":"","year":"2005","releaseDate":"20050601","directors":[{"name":"Scott Ziehl","id":"nm0956169"}],"writers":[{"name":"Mitch Gould","id":"nm0332451"}],"runtime":"78 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDMzODg4N15BMl5BanBnXkFtZTcwOTM3NzEzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"After resolving a situation of exorcism, the half-breed demon hunter Jake Greyman reports to Cardinal White and they realize that the demon Asmodeus is impregnating many mortals trying to raise offspring. Cardinal White calls Sister Sarah Ryan to assist Jake in his hunting for Asmodeus and his women. Meanwhile, Asmodeus sends the delicious and sexy Succubus to seduce Jake. A battle between good and evil is in course.","simplePlot":"After resolving a situation of exorcism, the half-breed demon hunter Jake Greyman reports to Cardinal White and they realize that the demon Asmodeus is impregnating many mortals trying to ... ","actors":[{"actorName":"Robert Alonzo","urlProfile":"http://www.imdb.com/name/nm0022315","urlPhoto":"","biography":{"dateOfBirth":"4 August 1970","placeOfBirth":" Manila, Philippines","height":"5' 11\" (1.8 m)","bio":"Robert Alonzo was born on August 4, 1970 in Manila, Philippines. He is known for his work on Deadpool (2016), Star Trek (2009) and Oblivion (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0022315","name":"Robert Alonzo","idIMDB":"nm0022315"},"actorId":"nm0022315","character":"Guard #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harlan Baird","urlProfile":"http://www.imdb.com/name/nm1193786","urlPhoto":"","biography":{"bio":"Harlan Baird is known for his work on Demon Hunter (2005), No Rest for the Wicked (1998) and Choke (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1193786","name":"Harlan Baird","idIMDB":"nm1193786"},"actorId":"nm1193786","character":"Dying Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Bassett","urlProfile":"http://www.imdb.com/name/nm0060248","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTE1NTE1OV5BMl5BanBnXkFtZTcwMTMzOTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1935","placeOfBirth":" Evanston, Illinois, USA","birthName":"William Henry Bassett","bio":"William Bassett was born on December 28, 1935 in Evanston, Illinois, USA as William Henry Bassett. He is an actor, known for House of 1000 Corpses (2003), General Hospital (1963) and The Karate Kid (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTE1NTE1OV5BMl5BanBnXkFtZTcwMTMzOTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0060248","name":"William Bassett","idIMDB":"nm0060248"},"actorId":"nm0060248","character":"Cardinal White","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terrence Beasor","urlProfile":"http://www.imdb.com/name/nm0064065","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ2ODQ0MDYxNF5BMl5BanBnXkFtZTcwNzI1NTQzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1935","placeOfBirth":" Omaha, Nebraska, USA","bio":"Terrence is a graduate of the Pasadena Playhouse ('57), and was their \"Man of the Year\", in 2011. He earned his Equity card in a production of \"The Dybbuk\", directed by Morris Ankrum, on the Playhouse's Main Stage('62). He moved to NYC in 1965, and met his actress/wife, Muriel Minot in 1968 doing back-to-back shows at ELT. They moved to Boston where he subsequently got an MFA in Theatre from Brandeis University ('76), after which he and Muriel moved to LA. Here he fostered a career in Film/TV/commercials (most recently appearing as \"Grandpa\" in a Kraft \"Mac n' Cheese\" campaign), and voice-over work, including being 1/4th the voice of the Borg on all the Star Trek series (as well as ADR/looping on over 450 projects). He is proud to STILL be a \"working actor\", and a member of all the acting unions! He and Muriel have been married since December 1968.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ2ODQ0MDYxNF5BMl5BanBnXkFtZTcwNzI1NTQzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064065","name":"Terrence Beasor","idIMDB":"nm0064065"},"actorId":"nm0064065","character":"Bishop Desapio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sophia Crawford","urlProfile":"http://www.imdb.com/name/nm0186962","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MzQ2NjQ3NV5BMl5BanBnXkFtZTgwNTc3ODYyODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1966","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Sophia Matilda Crawford","height":"5' 4\" (1.63 m)","bio":"Sophia Crawford was born in Hammersmith, London, and is one of Triplets. She left England in 1986 and took an incredible journey on a bus overland from London to India. After spending some time in India and Nepal, Sophia headed to Thailand, where she began her movie career. At first she was an editorial model and an extra in American productions such as: Kickboxer (1989) and Around the World in 80 Days (2004). After working with several crews from Hong Kong, Sophia decided it was time to make a move and try her luck in Hong Kong cinema. She went around to the various studios looking for work. Her first role was Chu dao gui jing (1990) (New Kids in Town). The director had asked her if she could fight. Thinking this would be easy, she said yes and was consequently killed off because she was so terrible. Humiliated, yet determined, Sophia had found her niche. For the next five years, she studied Martial Arts and stunts with some of the top names in the business. She co-starred in more than thirty movies and became the first Western woman to join an Asian Stunt team. Sophia moved to the United States in 1993 and has appeared in hundreds of movies and television shows. Including; Mighty Morphin Power Rangers (1993) and WMAC Masters (1995). She was Sarah Michelle Gellar's stunt double on Buffy the Vampire Slayer (1997) for four years and has helped numerous actors with her Martial arts prowess. She is currently President of the United Stuntwomen's Association.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MzQ2NjQ3NV5BMl5BanBnXkFtZTgwNTc3ODYyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186962","name":"Sophia Crawford","idIMDB":"nm0186962"},"actorId":"nm0186962","character":"Hooker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tania Deighton","urlProfile":"http://www.imdb.com/name/nm0215053","urlPhoto":"","biography":{"height":"5' 11\" (1.8 m)","bio":"Tania Deighton is an actress, known for Something's Gotta Give (2003), Uptown Girls (2003) and Job No. 5 (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0215053","name":"Tania Deighton","idIMDB":"nm0215053"},"actorId":"nm0215053","character":"Succubus","urlCharacter":"http://www.imdb.com/character/ch0177724","main":true},{"actorName":"Billy Drago","urlProfile":"http://www.imdb.com/name/nm0236711","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkwNDEzOTYxNF5BMl5BanBnXkFtZTcwNjgxNDY3NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1945","placeOfBirth":" Hugoton, Kansas, USA","birthName":"Billy Eugene Burrows","height":"5' 10½\" (1.79 m)","bio":"Drago is well-known for his villainous parts (leading or supporting), and he is renowned for his rugged yet scary looks and evil smile. He was born William Eugene Burrows in Hugoton, Kansas. He became interested in acting and took his mother's maiden name 'Drago' as a stage name. At first he worked as a stuntman in Kansas, and then went to University of Kansas. After graduating he worked as a radio host before joining an acting crew that led him to New York. He began his acting career at the end of 1970s. After appearing in multiple TV series as a guest actor, he appeared in some low budget films such as: Windwalker (1980), Vamp (1986), Hunter's Blood (1986), Freeway (1988), Dark Before Dawn (1988), China White (1989), True Blood (1989), Martial Law II: Undercover (1991), Lady Dragon 2 (1993) and Cyborg 2: Glass Shadow (1993). Perhaps, he was mostly recognized in three action films, all staring Chuck Norris, Invasion U.S.A. (1985), Hero and the Terror (1988) and perhaps most famous in Delta Force 2: The Colombian Connection (1990), where Drago played memorable drug lord Ramon Cota. He also appeared as a guest actor in Walker, Texas Ranger (1993) also starring Chuck Norris. Some of his other well-known appearances were in: Mad Dog Time (1996), Tremors 4: The Legend Begins (2004) and The Hills Have Eyes (2006) remake, as the leader of mutated nomads. He also did an extensive work on TV, and his most popular guest-starring roles were as: Charmed (1998) TV series, as Barbas, the demon. Drago is a dedicated actor and has produced an instructional acting video with his late wife Silvana Gallardo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkwNDEzOTYxNF5BMl5BanBnXkFtZTcwNjgxNDY3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236711","name":"Billy Drago","idIMDB":"nm0236711"},"actorId":"nm0236711","character":"Asmodeus","urlCharacter":"http://www.imdb.com/character/ch0081178","main":true},{"actorName":"Sean Patrick Flanery","urlProfile":"http://www.imdb.com/name/nm0001218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3NjA5MDcwNV5BMl5BanBnXkFtZTgwNjYyNTQ5MzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1965","placeOfBirth":" Lake Charles, Louisiana, USA","height":"5' 11\" (1.8 m)","bio":"Sean Patrick Flanery was born in Lake Charles, La. and raised in a small town outside of Houston, Texas. While attending the University of St. Thomas in Houston, he saw a beautiful girl leaving a building on campus every Monday and decided to drop an English class and sign up for \"whatever the hell they were teaching in that building\". The building was the University's theater department, and the class was acting. Through his theater studies, he penned a piece of children's theater and decided afterwards to pack up his car and head to Los Angeles with the hopes of actually producing the play. Somewhere in the process, an agent approached him and requested to represent him commercially. His first paid role in Hollywood was a Kellog's Corn Pops commercial starring alongside none other than Paul Walker. Shortly after a string of national commercials, the same agent then began representing him for TV/film roles. He very quickly landed the title role in George Lucas' \"The Young Indiana Jones Chronicles\" after shooting 2 films for the Mickey Mouse Club called \"Just Perfect\" and \"My Life As A Babysitter\". Since then, Flanery has been in numerous films and TV shows every year, including \"Powder\", \"The Dead Zone\", \"SAW3D\", \"Suicide Kings\", and the runaway cult hit \"The Boondock Saints\", and most recently, the TV show \"Powers\" for Sony, which is scheduled to be released in early 2015. Flanery is also noted for winning the Toyota celebrity race of Long Beach two years in a row, the first as an amateur, and the second after being invited back to compete as a pro. He won after qualifying on the pole both times. Off camera, Flanery is a high ranking martial artist having earned his black belt in Brazilian Jiu Jitsu from the Renzo Gracie lineage on May 4th of 2008. He owns his own BJJ academy called Hollywood Brazilian Jiu Jitsu in West Hollywood, Ca. where he trains regularly when his film schedule allows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3NjA5MDcwNV5BMl5BanBnXkFtZTgwNjYyNTQ5MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001218","name":"Sean Patrick Flanery","idIMDB":"nm0001218"},"actorId":"nm0001218","character":"Jake Greyman","urlCharacter":"http://www.imdb.com/character/ch0081179","main":true},{"actorName":"Bertha Holguin","urlProfile":"http://www.imdb.com/name/nm1779343","urlPhoto":"","biography":{"bio":"Bertha Holguin is an actress, known for Demon Hunter (2005), Curb Your Enthusiasm (2000) and Will & Grace (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1779343","name":"Bertha Holguin","idIMDB":"nm1779343"},"actorId":"nm1779343","character":"Anna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Howerton","urlProfile":"http://www.imdb.com/name/nm0398112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzMzNjk4NF5BMl5BanBnXkFtZTgwMzM3MDUyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1938","placeOfBirth":" Cuero, Texas, USA","birthName":"Charles Cabaness Howerton III","height":"6' 1\" (1.85 m)","bio":"Charles Howerton was born in Cuero, Texas, in 1938, son of a Naval officer. At age ten he enjoyed exploring abandoned Japanese machine gun nests on Guam, at 12 sailing dinghies in Coronado bay amid navy ships, at 14 trekking in the Florida Everglades, and at 16 caught in the middle of a revolution to oust Juan Domingo Perón in Buenos Aires, Argentina. He gathered clams and chased rheas near the Straits of Magellan, hunted and fished in the pristine forests and streams of the north and south of Argentina, visited Macchu Picchu in Peru, and played 2nd base on a city championship softball team. He was in the senior class play at the American school in Buenos Aires, his first taste of acting. At the University of North Carolina, Charles was Chief Announcer and co-production Manager of WUNC-FM, where he wrote, directed and performed in radio dramas for the NAEB and appeared on the Playmakers stage. He also caught a winning pass in intramural football and wrote plays and short stories, many of which have been published. He graduated with a B.A. in Communications in 1960. During the summers, He worked as a YMCA tennis counselor in Connecticut, on a surveying crew in Johnsville, PA, as a top-40 disc jockey at WKVA in Lewistown, Pennsylvania, and as a cub reporter on his home town newspaper, The Cuero Record, in Texas. He then attended the Graduate School of Theatre at the University of Texas, where he majored in Playwriting, but also acted in productions with guest stars Rip Torn and Barbara Barrie, and in leading roles at the Austin Civic Theatre. Charles married his college sweetheart, Jeri Lynn Mooney (aka Susan Howard) and went west to Los Angeles in 1962, working in theatre with old-time actors Frank Faylen, Percy Helton,E.J. André, Lyle Bettger and Alan Mowbray at the Masquers Club. He wrote dialogue and narration for independent features. He and Susan divorced in 1966. They have one daughter, Lynn Howerton, and grandchildren Daniel and Noelle. Charles re-married, in 1967, to actress Linda Gary. In 1970, after working in TV and commercials, they vacationed in Europe, found film work in Rome, Italy, learned Italian and stayed four years, working in films and commercials, and doing foreign to English dubbing in Italy, Spain and Germany. Charles attended the Cannes Film Festival in '72 as a journalist for the Texas Press Association, and interviewed Gregory Peck, Groucho Marx and Alfred Hitchcock. They returned to L.A. in 1974 with new daughter Alexis Howerton, and Charles was hired to go on the road with Eve Arden in \"Under Papa's Picture\". After the birth of another daughter, Dana Howerton, Charles became the volunteer drama coach for the Gifted and Talented Program at their elementary school, for which he wrote and directed (with Linda) an original play, \"Flashpants and the Magic Ring\", a musical comedy, later selected for production by the Boston Children's Professional Theatre. Charles and his family made a tradition of vacationing in distant and exotic parts of the world -- with an itinerary of nature trips and museums, river rafting and camel rides, para-sailing and scuba diving and sampling the local cuisine, staying in local inns, never breaking the tradition no matter how many \"jobs\" Charles and Linda had to miss. After Linda's death in 1995, Charles re-married again in 1996, to singer Jeanne Page. He continues to perform in film and television and on stage, and to publish poetry and short stories.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzMzNjk4NF5BMl5BanBnXkFtZTgwMzM3MDUyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0398112","name":"Charles Howerton","nicknames":["Chuck"],"idIMDB":"nm0398112"},"actorId":"nm0398112","character":"Inquisitor #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lea Moreno","urlProfile":"http://www.imdb.com/name/nm0604057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyMDY3MDMwMl5BMl5BanBnXkFtZTgwNDgwMzA4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1977","placeOfBirth":"","birthName":"Lea Moreno","height":"5' 3\" (1.6 m)","bio":"Actress Lea Moreno got her start in community theater in Orange County. She studied at South Coast Repertory for ten years before landing her first screen roles shortly after graduating from high school. In 1995, her tenth and eleventh auditions landed her guest roles on the ABC sitcoms \"Home Improvement\" and \"Step by Step\". The following year, she made her TV-movie debut co-starring alongside Jonathan Brandis, Ariana Richards and Christopher Noth in the ABC movie \"Born Free: A New Adventure\". Moreno and Brandis played city kids who move with their businessman father to Africa, where they endeavor to return a captured lion to the wild. That same year she made her feature acting debut in a similar setting, the safari-set Tarzan retread \"Jungle Boy\" (a 1998 US direct-to-video release). More TV work followed for Moreno, who guest starred on series including \"Promised Land\" and \"Walker, Texas Ranger\" (both CBS) and a recurring on \"Clueless\" (UPN) playing the snobby cheerleader Brittany. Additionally, she was featured as the daughter of a breast cancer survivor (Mary McDonnell) whose health is once again in jeopardy in \"Two Voices\", Lifetime's 1997 fact-based account of the class-action suit that rocked the silicone breast implant industry. Moreno followed up this supporting role with a starring turn as the leader of a group of heroic children navigating a post-apocalyptic lost world battling an evil-doer (Tim Curry) in Showtime's sci-fi original \"Doom Runners\" (also 1997). From 1998 to 1999, Moreno starred on the UPN hour-long drama \"Legacy\" as Alice Logan, a conscientious young teenager who takes over as the Logan's maternal force following her mother's untimely death. Moreno performed well in the role, winning over audiences as she portrayed Alice's shortcomings as well as her grace and indomitable spirit. Following the cancellation of the 19th Century American Reconstruction era serial, Moreno had a memorable lead guest role as a teenager meeting her father for the first time on a special two-hour Thanksgiving episode of NBC's hit drama \"Providence\" (1999). The following year the young actress returned to series television on The WB's quirky mid-season replacement sitcom \"Brutally Normal\" from the producers of \"Popular.\" Here she took on the role of Anna Pricova, a smart and passionate high school student who was dealing with the ever ready trials of teenage life and the messes caused by her two troublesome best friends (Eddie Kaye Thomas and Mike Damus). In 2000 Moreno landed the lead in an NBC pilot titled \"Just Married\", written by Jack Burditt of \"30 Rock\" and \"Just Shoot Me\" fame. She starred opposite Chris Evans (\"Captain America\" and \"The Avengers\") in this comedy about the trials and tribulations of getting married at a young age. The pilot did not go to series but NBC liked Moreno enough to ask her to join the cast of \"D.A.G.\" playing Camilla Whitman, daughter of the President of the United States and First Lady. This multi-camera comedy, with an outstanding ensemble cast (David Alan Grier, Delta Burke, Lauren Tom, Paul F. Tompkins) only lasted one season but was a bright spot for Moreno as she held her own with some of TV comedies funniest, playing a sassy and smart, overly protected first daughter. In 2003 Moreno landed supporting roles in two independent films. \"Last Stand\" and \"Demon Hunter.\" The next few years followed with more supporting roles in independents as well as a lead guest star on the popular series \"CSI Miami.\" Moreno played Kim/Demon leader of a gang of gamers that will stop at nothing to get what they want. In 2007 she starred in another popular series \"Monk.\" In 2010 and 2011 Moreno and her husband Chris Young (Max Headroom, Great Outdoors, PCU) produced \"Dead of Nowhere\", a 3D feature film presentation starring Balthazar Getty and Lin Shaye. 2013 and 2014 saw a welcome change in Moreno's career, back to back roles playing a young mother. She co-starred in a feature film, \"Sins of Our Youth\", playing a young mom upset by the loss of her son to gun violence and then a guest star on the long running CBS hit, CSI: Crime Scene Investigation, playing Karen Lewis, a wealthy, troubled young mother in rehab. Lea resides in Los Angeles with her husband and their two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyMDY3MDMwMl5BMl5BanBnXkFtZTgwNDgwMzA4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604057","name":"Lea Moreno","idIMDB":"nm0604057"},"actorId":"nm0604057","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Nguyen","urlProfile":"http://www.imdb.com/name/nm1248798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjA4ODg2N15BMl5BanBnXkFtZTcwODA4OTYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1974","placeOfBirth":" Binh Duong, Vietnam","height":"5' 10\" (1.78 m)","bio":"Johnny left Vietnam at the age of 8, uncertain of what destination lied ahead. As a boy, he already loved Hong Kong cinema. Johnny would soon start training in martial arts and now has over 18 years of experience in Kung Fu, Tai Chi and Japanese Aikido. Johnny is now also an expert in Wushu, which he does for over 10 years. Johnny has won a gold medal from Pan America Form and Sword. However, having many skills, hobbies and interests, Johnny is mainly known here for his martial arts skills and acting. Now he has had a big breakthrough as an actor in Cradle 2 the Grave, next to Jet Li and Mark Dacascos. Johnny is an accomplished stuntman. Johnny is getting more popular as an actor and stuntman who has now shown his skills and may be one of the next stars on screen. Recently, Johnny was seen in XMA, Mike Chat's Extreme Martial Arts, performing with weapons, fights and acrobatics. Getting more and more lead roles, Johnny also stars opposites the new legendary action star Tony Jaa and is also asked as a stunt coordinator.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjA4ODg2N15BMl5BanBnXkFtZTcwODA4OTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1248798","name":"Johnny Nguyen","idIMDB":"nm1248798"},"actorId":"nm1248798","character":"Guard #5","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Nickens","urlProfile":"http://www.imdb.com/name/nm1325035","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODgxNzYzMF5BMl5BanBnXkFtZTYwOTk3Njky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Gary Nickens is an actor, known for The Island (2005), Bad Boys II (2003) and Demon Hunter (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODgxNzYzMF5BMl5BanBnXkFtZTYwOTk3Njky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1325035","name":"Gary Nickens","idIMDB":"nm1325035"},"actorId":"nm1325035","character":"Hell's Angel","urlCharacter":"http://www.imdb.com/character/ch0295112","main":true},{"actorName":"Eddie Perez","urlProfile":"http://www.imdb.com/name/nm0673472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3NDQ4ODU1NV5BMl5BanBnXkFtZTgwMjk1NTMxMDI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Eddie Perez born in New York, a city where you can stay indoors all day and watch the world pass you by, or get up and participate with all it has to offer. Eddie Perez chose the latter. An active kid, who spent his summers with family in Puerto Rico, Eddie achieved the honor of Eagle Scout at the age of thirteen. He continued his athleticism in high school where he played most sports and boxed in the golden gloves. While attending Long Island University in New York (where Eddie graduated with a degree in education, a minor in biology and athletic training accredited hours), he found work as a doorman at New York City hot spots such as Heartbreaks, The Fun House and The Underground, to name a few. Working these nightclubs, Eddie met many celebrities. He was known for being level headed, smart and in great physical shape. He was asked to leave New York by Mickey Rourke after finishing college and head to Los Angeles where he trained Mickey and Anthony Michael Hall. While training Hall, Eddie met the band Duran Duran, who was very much in their prime at the time. Eddie began working for the band as both their personal trainer and bodyguard. Eddie worked his way up to Head of Security and then was hired as the Head of Security for Pink Floyd as well. Between both acts, Eddie was able to go on seven plus world tours. His travels allowed him to train in Israel, South Africa, and the United States in VIP protection programs. Once he finished up the touring, and doing bodyguard work for a variety of stars such as Sylvester Stallone and Sandra Bullock, Eddie decided he wanted to pursue his true passion. During his time off from work Eddie studied acting with Peter Flood, stunts with Paul Stater as well as any other classes available to help better his craft. As with everything else he attempted, Eddie's reputation preceded him and he began to find work as a stunt coordinator and stuntman. He has stunt coordinated & 2nd Unit Directed films such as: Blade & Shoot'em Up. On television he has stunt coordinated Shameless for 5 seasons. As a performer he can currently be seen in Sicario & DeadPool . Most recently he directed a multiple award winning short \"The Test Of Time\" which he sold to shorts TV. Eddie's goal is to help put the scripted vision on film in the most practical and safe manner with out compromising creativity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3NDQ4ODU1NV5BMl5BanBnXkFtZTgwMjk1NTMxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0673472","name":"Eddie Perez","idIMDB":"nm0673472"},"actorId":"nm0673472","character":"Big Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colleen Porch","urlProfile":"http://www.imdb.com/name/nm1312500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0OTA0OTk5MF5BMl5BanBnXkFtZTcwNTk1MzEzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 9½\" (1.77 m)","bio":"Colleen Porch is an actress, known for Transformers (2007), Baby Blues (2008) and Starship Troopers 2: Hero of the Federation (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0OTA0OTk5MF5BMl5BanBnXkFtZTcwNTk1MzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1312500","name":"Colleen Porch","idIMDB":"nm1312500"},"actorId":"nm1312500","character":"Sister Sarah Ryan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0435631","urlIMDB":"http://www.imdb.com/title/tt0435631","business":{"budget":{"money":"$1,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 18 min (78 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.3","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"995","type":"Movie","companyCreditsSimple":[{"idCompany":"co0138241","name":"Demon Hunter Productions Inc."}],"keywords":{"keywords":["demon","demon hunter","succubus","half breed","exorcism","good guys win","bittersweet ending","pregnant woman","superhero","antihero","disillusionment","half demon","paladin","halfling","slow motion","wings","voice over narration","transformation","topless female nudity","supernatural power","strangulation","stabbed in the chest","soul","face slap","shot to death","shot in the chest","sex with a demon","sex standing up","sex in cemetery","punched in the face","punched in the stomach","prostitute","priest","premarital sex","pistol","nun","nosebleed","murdered priest","man punching a woman","lust","low budget film","los angeles california","limousine","lifted by the throat","knocked out","knife","kicked in the stomach","kicking in a door","impregnation","horns","hollywood california","heart ripped out","heart in hand","head butt","hanged man","gore","good versus evil","glowing eyes","foot chase","fellatio","drawing","demonic possession","demon spawn","dark alley","crucifix","coughing blood","corpse","cigarette smoking","church","cemetery","cell phone","cardinal the priest","business card","broken arm","blood","biker","belief","bare chested male","abandoned hotel","murder","lesbian kiss","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:32:32"}}