{"data":{"movies":[{"title":"Caffeine","originalTitle":"","year":"2006","releaseDate":"20070316","directors":[{"name":"John Cosgrove","id":"nm0181836"}],"writers":[{"name":"Dean Craig","id":"nm1918877"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODIyMTIyOF5BMl5BanBnXkFtZTcwMjEwODE0MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"A fanciful battle of the sexes ensues when the relationships of the staff and patrons of a quirky London café are unexpectedly turned upside down by sudden revelations of terribly embarrassing secrets having to do with their sexual misadventures.","simplePlot":"A fanciful battle of the sexes ensues when the relationships of the staff and patrons of a quirky London café are unexpectedly turned upside down by sudden revelations of terribly ... ","actors":[{"actorName":"Marsha Thomason","urlProfile":"http://www.imdb.com/name/nm0859720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMTYxNjQwM15BMl5BanBnXkFtZTcwODEzOTQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1976","placeOfBirth":" Manchester, England, UK","birthName":"Marsha Lisa Thomason","height":"5' 8\" (1.73 m)","bio":"Marsha Thomason was born and raised in Manchester, England. Her love for acting began after watching the musical \"Bugsy Malone\". Soon after, aged 12, she joined Oldham Theatre Workshop, where she performed many diverse stage plays, including \"Our Day Out\" by Willy Russell and \"Peace\" by Aristophanes. What began as a hobby soon helped her achieve her first professional acting job at the age of 14, when she starred in 8:15 from Manchester (1990) (BBC 1). Marsha took \"A\" levels in English Language, Media Studies and Theatre Studies before studying for her BA in English at Manchester Metropolitan University. While at university, Marsha won the role of Janice Lafferty in Prime Suspect 5: Errors of Judgement (1996) alongside Helen Mirren, and later the same year she appeared in Brazen Hussies (1996) with Julie Walters and Robert Lindsay. Many parts followed, including Sally in the BBC's popular series Pie in the Sky (1994). Aged 20, Marsha moved to London's Notting Hill to take the role of Shazza Pearce in Playing the Field (1998), in which she played a beer-swilling, drug-taking soccer player. This was a role close to her heart as a life-long Manchester City supporter. After the first season of the show Marsha also starred as Nurse Jacqui Richards in Where the Heart Is (1997). She appeared in both programs simultaneously for three years. At this point she was spotted by Red Productions and appeared in Love in the 21st Century (1999), a series of six adult morality tales. Marsha fulfilled a lifelong dream of starring in London's West End when she made her professional stage debut in \"Breath Boom\" at the Royal Court Theatre. The play was also the debut of Marsha's American accent, as her character was a 15-year-old prostitute from New York whose dream of acceptance was to belong to a girl gang. Marsha's first foray into feature film was the Working Title production Long Time Dead (2002), a British horror film also starring Lukas Haas and Alec Newman. Her career then took her to America where she has continued to work in films, with roles as diverse as Victoria in Black Knight (2001) starring Martin Lawrence, and Brandy in Miramax's My Baby's Daddy (2004). She returned to England for the independent feature Pure (2002), directed by Gillies MacKinnon. Considered her most ambitious role to date, Marsha played Vicki, a Cockney heroin-addicted prostitute. While still in England, Marsha returned to Red Productions for the first series of the critically acclaimed Burn It (2003). In 2002 Marsha was awarded Best Actress in Film at the BFM awards. She recently appeared in the Disney feature The Haunted Mansion (2003) in which she starred opposite Eddie Murphy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMTYxNjQwM15BMl5BanBnXkFtZTcwODEzOTQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859720","name":"Marsha Thomason","idIMDB":"nm0859720"},"actorId":"nm0859720","character":"Rachel","urlCharacter":"http://www.imdb.com/character/ch0056986","main":true},{"actorName":"Mena Suvari","urlProfile":"http://www.imdb.com/name/nm0002546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzEyMDM5MV5BMl5BanBnXkFtZTgwNTY0MjkxMDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1979","placeOfBirth":" Newport, Rhode Island, USA","birthName":"Mena Alexandra Suvari","height":"5' 4\" (1.63 m)","bio":"Mena Alexandra Süvari was born in Newport, Rhode Island to Candice (Thompson), a nurse, and Ando Süvari, a psychiatrist. Her father was Estonian and her mother is of Greek, English, and German descent. Mena was raised in a Rhode Island home that was built in 1870 and had early aspirations of becoming an archaeologist before moving to Charleston, SC where she then attended a nationwide modeling competition that landed her a contract with Wilhelmina Models. She later moved out to Los Angeles under their children's theatrical division WeeWillys, which began her acting career. Her film debut was made working with director Gregg Araki in the cult-classic Nowhere (1997) which was soon followed up by the blockbuster American Pie (1999), for which she did her own singing, and the five-time Oscar-awarded American Beauty (1999) directed by Sam Mendes, in which she was nominated for a BAFTA Award as Best Supporting Actress. People Weekly magazine titled an article about her, \"All-American Girl\" (1999), and she was declared as the most \"patriotic\" artist of 2000 by Entertainment Weekly magazine. In 2001, as part of the blockbuster franchise, she added American Pie 2 (2001) to that list, and then more than a decade later with American Reunion (2012). She reunited with Jason Biggs in Amy Heckerling's romantic comedy Loser (2000) and then continued to showcase her range in ability to costar with John Leguizamo in Jonas Åkerlund's cult-classic Spun (2002) and then alongside Jennifer Aniston in Rob Reiner's Rumor Has It (2005) and Tony Scott's Domino (2005). Mena was named #69 on the Maxim magazine \"Hot 100 of 2005\" list, was ranked #73 on the Maxim magazine \"Hot 100 of 2007\" list, and #52 on the Maxim magazine \"Hot 100 of 2008\" list. Mena rounded out her creative pursuits by playing the iconic Black Dahlia in Ryan Murphy's television series American Horror Story (2011) and continued working in the medium by following up with an arc in the hit series Chicago Fire (2013), as well as leading the Amazon pilot Hysteria (2014) and WeTv's mini-series South of Hell (2015), executive produced by both Eli Roth and Jason Blum for Blumhouse Productions. Mena is set to star opposite Alicia Silverstone for John Wells and TV Land's American Woman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzEyMDM5MV5BMl5BanBnXkFtZTgwNTY0MjkxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002546","name":"Mena Suvari","idIMDB":"nm0002546"},"actorId":"nm0002546","character":"Vanessa","urlCharacter":"http://www.imdb.com/character/ch0056985","main":true},{"actorName":"Callum Blue","urlProfile":"http://www.imdb.com/name/nm0089485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjAyOTkxNl5BMl5BanBnXkFtZTYwMTA2MDM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1977","placeOfBirth":" London, England, UK","birthName":"Daniel James Callum Blue","height":"6' 1\" (1.85 m)","bio":"Callum Blue, born in London, England, has enjoyed a steady career in film and TV. Best known for his role as Mason in the hit Showtime series, Dead Like Me (2003), he has also achieved other hits with Related (2005) and The Princess Diaries 2: Royal Engagement (2004), co-starring Anne Hathaway. He received his theatrical training at Mountview in London. He currently resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjAyOTkxNl5BMl5BanBnXkFtZTYwMTA2MDM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089485","name":"Callum Blue","idIMDB":"nm0089485"},"actorId":"nm0089485","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Pellegrino","urlProfile":"http://www.imdb.com/name/nm0671032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDc0Mjg4N15BMl5BanBnXkFtZTcwOTMyNTUyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1965","placeOfBirth":" Los Angeles, California, USA","birthName":"Mark Ross Pellegrino","height":"6' 1\" (1.85 m)","bio":"Mark Pellegrino was born on April 9, 1965 in Los Angeles, California, USA as Mark Ross Pellegrino. He is an actor and producer, known for The Big Lebowski (1998), National Treasure (2004) and The Number 23 (2007). He has been married to Tracy Pellegrino since October 30, 2008. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDc0Mjg4N15BMl5BanBnXkFtZTcwOTMyNTUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671032","name":"Mark Pellegrino","idIMDB":"nm0671032"},"actorId":"nm0671032","character":"Tom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roz Witt","urlProfile":"http://www.imdb.com/name/nm0936895","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5ODQ2NDgyNF5BMl5BanBnXkFtZTcwMjAzMzQzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Roz Witt is an actress, known for Tank Girl (1995), Caffeine (2006) and The Wind Fisherman (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5ODQ2NDgyNF5BMl5BanBnXkFtZTcwMjAzMzQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936895","name":"Roz Witt","idIMDB":"nm0936895"},"actorId":"nm0936895","character":"Lucy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Lee Potts","urlProfile":"http://www.imdb.com/name/nm0498517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM5NjU1MDExOF5BMl5BanBnXkFtZTgwMTQwMTkxOTE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1979","placeOfBirth":" Bradford, West Yorkshire, England, UK","birthName":"Andrew Lee Potts","height":"5' 10\" (1.78 m)","bio":"Andrew was born on 29 October 1979 in Bradford, West Yorkshire, England, UK to dad Alan and mum Susan. He has a sister, Sarah-Jane, who is also an actor. He studied at Leeds Performing Arts School and started out in musical theatre. He is now a veteran TV actor and has been in a catalogue of all that is best in British television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM5NjU1MDExOF5BMl5BanBnXkFtZTgwMTQwMTkxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0498517","name":"Andrew Lee Potts","nicknames":["Pottsy"],"idIMDB":"nm0498517"},"actorId":"nm0498517","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Vogel","urlProfile":"http://www.imdb.com/name/nm1036181","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDIzMTExOV5BMl5BanBnXkFtZTcwNzk1NjEzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1979","placeOfBirth":" Abington, Pennsylvania, USA","birthName":"Michael James Vogel","height":"5' 9\" (1.75 m)","bio":"Mike Vogel was born on July 17, 1979 in Abington, Pennsylvania, USA as Michael James Vogel. He is an actor and producer, known for Cloverfield (2008), The Help (2011) and Blue Valentine (2010). He has been married to Courtney Vogel since January 4, 2003. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDIzMTExOV5BMl5BanBnXkFtZTcwNzk1NjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1036181","name":"Mike Vogel","idIMDB":"nm1036181"},"actorId":"nm1036181","character":"Danny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Breckin Meyer","urlProfile":"http://www.imdb.com/name/nm0005227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NDY0ODg4M15BMl5BanBnXkFtZTgwNDI4NzQ1MDI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 1974","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Breckin Erin Meyer","height":"5' 5½\" (1.66 m)","bio":"Breckin Meyer was born in Minneapolis, Minnesota, to Dorothy Ann (Vial), a travel agent, and Christopher William Meyer, a management consultant. His ancestry includes German, English, and Irish. He went to grade school with Drew Barrymore and attended Beverly Hills High School with Joshua John Miller and Branden Williams. It was Barrymore who introduced Breckin to her agent, after which he started doing commercials and the game show Child's Play (1982). After being accepted to California State University at Northridge, Breckin decided to put school on hold and pursue acting. He has always wanted to be a kindergarten teacher and may still do that in the future. Breckin was the drummer in the Streetwalking Cheetahs with his brother, Frank, which recorded a demo in 1995. He was the lead vocal on two songs, \"Carnival\" and \"Dave\". During 1995-1996, the band played about 10 gigs around Los Angeles. The Streetwalking Cheetahs' second album, \"Overdrive\" and their new album, \"Live on KXLU\", feature songs written when Breckin was still in the band. These songs include \"None of Your Business\", \"All I Want\", \"Peppermint\", \"Thought that Crosses My Mind\" and \"Turn Me Down\". After the Streetwalking Cheetahs, he started his own band, Bellyroom, with Seth Green and Alexander Martin, Dean Martin's grandson. They played a few gigs around Los Angeles in 1996. Breckin's friends include Ryan Phillippe, Josh Holland (USA High (1997)) and Seth Green. His best friend is Ryan Phillippe, with whom he starred in 54 (1998). Breckin was married to Deborah Kaplan, who wrote and directed Can't Hardly Wait (1998), in which Breckin had a cameo. Breckin's hobbies include playing drums, video games and sometimes sports. He's a big fan of Sean Penn, Robert De Niro, Al Pacino and Richard Dreyfuss.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NDY0ODg4M15BMl5BanBnXkFtZTgwNDI4NzQ1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005227","name":"Breckin Meyer","idIMDB":"nm0005227"},"actorId":"nm0005227","character":"Dylan","urlCharacter":"http://www.imdb.com/character/ch0164865","main":true},{"actorName":"Sonya Walger","urlProfile":"http://www.imdb.com/name/nm0907427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzMzMDU2MF5BMl5BanBnXkFtZTcwMzI5MDk2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1974","placeOfBirth":" London, England, UK","height":"5' 7\" (1.7 m)","bio":"Sonya Walger was born on June 6, 1974 in London, England. She is an actress, known for The Librarian: Quest for the Spear (2004), Her Evil Twin (2014) and 48 heures chrono (2012). She has been married to Davey Holmes since July 2009. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzMzMDU2MF5BMl5BanBnXkFtZTcwMzI5MDk2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907427","name":"Sonya Walger","idIMDB":"nm0907427"},"actorId":"nm0907427","character":"Gloria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Orlando Seale","urlProfile":"http://www.imdb.com/name/nm0780539","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4Nzg5MTUyMl5BMl5BanBnXkFtZTgwNTk0MDE5OTE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1973","placeOfBirth":" London, England, UK","bio":"Born in London, Orlando Seale's career has taken him all over the world. In his native England, Orlando attended Oxford University, earning advanced degree's in Both English and French literature. He also performed many critically acclaimed lead roles in classic Oxford productions, including \"Macbeth\" in Macbeth, \"Caliban\" in The Tempest, and \"Demetrius\" in the Russian touring production of A Midsummer Night's Dream - and in recognition of his unique talent, Orlando was awarded the coveted Cuppers Prize for best actor at Oxford. Orlando continued his acting training at the esteemed Ecole Philippe Gaulier in London and the Conservatoire National Superieure D'Art Dramatique in Paris before going on to tour Europe and North America with the prestigious Royal Shakespeare Company for three years; where he played \"Silvio\" in The Servant To Two Masters at the RSC's flagship theater in Stratford-on-Avon as well as at their more avant garde Young Vic theater in London. Orlando also starred as \"Orpheus\" in the West End production of Eurydice, performed in Brazil alongside \"Theater of the Oppressed\" creator Augusto Boal, and traveled throughout England and Europe as the leader and principal performer of his own cutting edge Improv Company. Orlando's first foray into feature films came when Kenneth Branagh handpicked Orlando to serve as his acting understudy in the critically acclaimed and academy award nominated film adaption of Hamlet. Roles in Sleepy Hollow, Pride & Prejudice and Hysteria quickly followed, with Orlando winning high praise from critics and fans alike for his portrayal of Def Leppard lead singer Joe Elliott. He was also a series regular on Britons top rated television series. Orlando regularly travels back and forth between Los Angeles and London; He also speaks fluent French and has mastered a wide variety of dialects including a perfect American accent. Orlando also gives back to the artistic community by teaching youth acting classes and is working on recording his 2nd album with his band, following the critical success of their 1st album, with music reminiscent of The Talking heads and Bowie and a mesmerizing and original sound that takes one on an intimate and epic journey that is at once both melancholic and euphoric.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4Nzg5MTUyMl5BMl5BanBnXkFtZTgwNTk0MDE5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0780539","name":"Orlando Seale","idIMDB":"nm0780539"},"actorId":"nm0780539","character":"Mark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian J. Watson","urlProfile":"http://www.imdb.com/name/nm2158278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjYwNDYxM15BMl5BanBnXkFtZTcwNDc0MjYzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Brian J. Watson is an actor, known for Caffeine (2006), Bad Ass (2010) and Las Vegas Story (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjYwNDYxM15BMl5BanBnXkFtZTcwNDc0MjYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2158278","name":"Brian J. Watson","idIMDB":"nm2158278"},"actorId":"nm2158278","character":"Porn Star","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katherine Heigl","urlProfile":"http://www.imdb.com/name/nm0001337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NDEwMjA1MV5BMl5BanBnXkFtZTcwMzQxMDI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1978","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Katherine Marie Heigl","height":"5' 9\" (1.75 m)","bio":"Katherine Marie Heigl was born on November 24, 1978 in Washington, D.C., to Nancy Heigl (née Engelhardt), a personnel manager, and Paul Heigl, an accountant and executive. Her father is of German/Swiss-German and Irish descent, and her mother is of German ancestry. A short time after her birth, the family moved to New Canaan, Connecticut, where Katherine was to spend the majority of her childhood; the youngest member of her family, Katherine--or \"Katie\" as she is nicknamed--has two elder siblings, John and Meg. Tragically, her older brother Jason died in 1986 of brain injuries suffered in a car accident, after being thrown from the back of a pickup truck. When doctors determined he was brain-dead, the family made the difficult decision to donate his organs. Not only did this painful chapter give Katherine a greater perspective and appreciation for life, but it motivated her to use her celebrity to promote the importance of organ donation. Katherine was first thrust into the limelight as a child model. An aunt, visiting the family in New Canaan, took a number of photographs of Katherine, then aged nine, in a series of poses to advertise a hair care product she had invented. Upon returning to New York, with permission from Katherine's parents, she sent the photos to a number of modeling agencies. Within a few weeks, Katherine had been signed to Wilhelmina, a renowned international modeling agency. Almost immediately, she made her debut in a magazine advertisement and soon followed this with an inaugural television appearance in a national commercial for Cheerios breakfast cereal. Following a number of commercials and modeling assignments for Sears and Lord & Taylor, she made her big-screen debut in That Night (1992), which starred Juliette Lewis and C. Thomas Howell. It was then that she realized that acting rather than modeling was her passion. In 1993, Katherine appeared in Steven Soderbergh's critically-acclaimed Depression-era drama, King of the Hill (1993), before landing her first leading role as a rebellious teenager, alongside Gérard Depardieu, in My father, ce héros (1994). During this time, Katherine continued to attend New Canaan High School, balancing her academic studies with work on films and modeling, which she undertook during holidays, vacations and weekends. In 1995, she played \"Sarah Ryback\", the niece of Steven Seagal's character, in Under Siege 2: Dark Territory (1995), which was her \"debut\" in the action film genre. Acting was now becoming a stronger focus for Katherine, although she still modeled extensively, appearing regularly in magazines such as \"Seventeen\". Television appearances on The Tonight Show with Jay Leno (1992) and Late Night with Conan O'Brien (1993) soon followed, before she took the lead role in Disney's Wish Upon a Star (1996) in 1996. It was also during that year that Katherine's parents divorced and, following her graduation from high school in 1997, she moved with her mother into a four-bedroom house in Los Angeles' Malibu Canyon area. This enabled her to focus upon acting with the guidance and support of her mother, who now managed her career. In 1997, Katherine portrayed \"Taffy Entwhistle\", Rita Hayworth's stand-in, in Stand-ins (1997) and was also cast as the beauteous \"Princess Ilene\" in the European production, Prince Valiant (1997). She then made her made-for-TV movie debut, co-starring with Peter Fonda in a re-working of the classic Shakespearean play, The Tempest (1998), updated with an American Civil War theme. In this film, she played \"Miranda Prosper\", a young woman torn between her love for both her father and a Union soldier. Bug Buster (1998) and La fiancée de Chucky (1998) represented a venture into the horror genre for Katherine. While both films could be described as rather tongue-in-cheek despite their gory emphases, La fiancée de Chucky (1998) was the better received, both critically and commercially. In 1999, Katherine decided to branch out into series television when she accepted the role of the haughty, yet vulnerable, \"Isabel Evans\", on Roswell (1999), a show that blended teen angst with sci-fi drama. Though she had never planned to embark on a career in television, the role of Isabel, a teenager with a secret life, was an offer she found impossible to refuse. In the series, Isabel, her brother Max (Jason Behr) and their friend Michael (Brendan Fehr) are aliens passing as humans in Roswell, New Mexico, as they desperately try to hide the truth from government agencies, the people of Roswell and even their own adopted families. To publicize her role on the show, Katherine graced the covers of magazines such as \"TV Guide\", \"Maxim\" and \"Teen\" and was interviewed on Later (1994) and The Late Late Show with Craig Kilborn (1999). Along with her mother Nancy, she also appeared in an episode of the Sci-Fi TV talk show, Crossing Over with John Edward (1999), during which she spoke with John Edward, a psychic medium, about her late brother, Jason. During the three years Roswell (1999) was in production, Katherine found time to work on several movies. 100 Girls (2000), an independent film released in 2001, is the story of a college freshman who meets the girl of his dreams in an elevator during a blackout, and spends the rest of the movie trying to find her again. Her cameo role is that of Arlene, the competitive tomboy. The second film, Valentine (2001), a horror film starring David Boreanaz and Denise Richards, appeared in U.S. theaters on February 2, 2001. In this movie, which is based upon the 1996 novel by Tom Savage, Katherine plays \"Shelley\", a medical student who meets a sudden demise. In the spring of 2001, Katherine accepted a role in NBC's Critical Assembly (2002), a two-hour original television thriller. Katherine and Kerr Smith (Dawson's Creek (1998)) co-starred as brilliant and politically concerned college students who build a nuclear device to illustrate the need for a change in national priorities, but are betrayed by a fellow student when the bomb ends up in the hands of a terrorist. Unfortunately, the telefilm, directed by Eric Laneuville, written by Tom Vaughan, and based on the best-seller \"The Seventh Power\" by James Mills, was shelved when its storyline was deemed too close for comfort to the events of September 11, 2001. It was eventually broadcast in 2003. Since the cancellation of Roswell (1999) in the spring of 2002, Katherine has been busy with various projects, including an appearance on UPN's update of the classic television series, La treizième dimension (2002). That episode, entitled La treizième dimension: Cradle of Darkness (2002), aired on October 2, 2002, and featured Katherine in the role of a woman who goes back in time to stop one of the most notorious murders in history. In addition, she completed a movie, Descendant (2003), a psychological thriller inspired by Edgar Allan Poe's \"The Fall of the House of Usher\". She has also starred as \"Romy\" in ABC/Touchstone's two-hour telepic, Romy and Michele: In the Beginning (2005), a prequel to the 1997 feature, Romy and Michele's High School Reunion (1997). During the summer of 2002, Katherine made a major decision in the direction of her career when she signed on for representation in all areas with the William Morris Agency, one of the biggest and most prestigious agencies in the entertainment industry. She is now being represented by Norman Aladjem at Paradigm Agency and being managed by Nancy Heigl and Stephanie Simon and Jason Newman at Untitled Entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NDEwMjA1MV5BMl5BanBnXkFtZTcwMzQxMDI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001337","name":"Katherine Heigl","nicknames":["Katie"],"idIMDB":"nm0001337"},"actorId":"nm0001337","character":"Laura","urlCharacter":"http://www.imdb.com/character/ch0164864","main":true},{"actorName":"Daz Crawford","urlProfile":"http://www.imdb.com/name/nm0186743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2M1NDZmYjYtMDQxMS00MDdlLWE5Y2EtMjI4MDkzZmFiY2Y2L2ltYWdlXkEyXkFqcGdeQXVyMTAyOTgzMA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1968","placeOfBirth":" Liverpool, England, UK","birthName":"Daren Vinson Crawford","height":"6' 5\" (1.95 m)","bio":"Daz was born in Liverpool, England. Having a disrupted childhood and broken family Daz turned something negative in his young life to a positive and successful career in sports. He joined the Royal Air Force and through his training he learned teamed work and sportsmanship. Crawford traveled extensively in the Royal Air Force including the Falkland Islands, Germany and the Desert Storm Campaign. He became successful playing National League Basketball (UK) and becoming ranked 10th in the world as an amateur boxer. He was then invited to join the Seoul Olympic Team representing England. Daz later found his father and began a personal and challenging journey reuniting with his father. After the death of his father he returned to London and started a modeling career. As an extra in film he got the acting bug and took part in drama workshops challenging his emotions and found a new Daz Crawford. He studied at the \"Madder Market Theatre\" in Norwich England and then onto the \"Actors Centre\" in London and currently studying at the \"LA Actors Centre\" the \"Meisner Technique\". Daz has done numerous commercial campaigns including Farberge, cast as UK Gladiator (Diesel) for television with producer of Amercian Idol Ken Warick. With a household name Crawford was cast in the James Bond Film \"The World Is Not Enough\". Some other credits include \"Attila The Hun\" for USA Network, and major role in Wesley Snipe's Blade 2. continuing to work in the UK as requested Daz loves the art and channels his positive force into charity work for the under privileged children guiding them off the streets and into sports and theater art.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2M1NDZmYjYtMDQxMS00MDdlLWE5Y2EtMjI4MDkzZmFiY2Y2L2ltYWdlXkEyXkFqcGdeQXVyMTAyOTgzMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186743","name":"Daz Crawford","idIMDB":"nm0186743"},"actorId":"nm0186743","character":"Steve","urlCharacter":"http://www.imdb.com/character/ch0110492","main":true},{"actorName":"Andrew Ableson","urlProfile":"http://www.imdb.com/name/nm0008813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTcwODM2OV5BMl5BanBnXkFtZTgwOTI0OTMxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ableson, son of legendary crooner Frankie Vaughan, began his career on the London stage in sell-out productions of \"The Ecstasy\", \"Bent\", and \"A Midsummer Nights' Dream\", at the Globe Theatre, as well as starring in award-winning productions of musicals such as \"Sweet Charity\" and \"Godspell\" coming from the prestigious Edinburgh festival. He began his career on the London stage in sell-out productions of \"The Ecstasy\", \"Bent\", and \"A Midsummer Nights' Dream\", at the Globe Theatre, as well as starring in award -winning productions of musicals such as \"Sweet Charity\" \"Oklahoma\" and \"Godspell\" premiering at the prestigious International Edinburgh Festival. After two seasons on the UK sitcom \"Second Thoughts\", as well as numerous commercial appearances, Ableson, son of beloved British crooning legend Frankie Vaughan, re-located to the US in 1995, landing roles immediately in \"Nash Bridges\" and the feature film \"Boyfriends\" (1996), ironically returning to the UK for his role as Owen, the films' bad-boy. In 2000 The West coast premieres of Mark Ravenhills' ground-breaking play \"Shopping & Fucking\", both in Los Angeles and San Francisco, won Ableson many awards for his starring role as Mark, the needy, love-hungry heroin addict. He further built on that reputation one year later, starring as legendary theatre critic Kenneth Tynan, in another multi-award-winning L.A. premiere, Austin Pendleton's' Pulitzer-nominated \"Orsons' Shadow\". \"Torn\" an acclaimed nightly-improvised play, and the multi award-winning smash musical, \"The Beastly Bombing\", \"End Days\", \"Smoke Lilies & Jade\" and \"Haywire!\" were other west coast premieres, further solidifying his theatrical reputation. Amongst many other TV and film credits since then, Ableson has the lead role in the surreal comedy \"By The Soles Of Our Feet\", and recently shot the features \"Dirty Girl\" co-starring Mila Jojovich & William H Macy, \"Caffeine\" co-starring Katherine Heigl & Mena Suvari, \"The Gymnast\" a recent festival hit, \"New Suit\", as well as playing all the waiters and chefs in Robert Zemekis' \"The Polar Express\" alongside Tom Hanks. Voice credits include \"Ug\" in Dreamwork's \"How To Train Your Dragon 2\", the evil 'Valmont' in two seasons of \"The Jackie Chan Adventures\", as well as initial voicing of Gnomeo, in Disneys' \"Gnomeo & Juliet\", \"Pirates of the Caribbean 2, Dead Man's Chest\", \"Speed Racer\" \"Pirates Of The Caribbean 4, On Stranger Tides\" \"Get Smart\" not to mention numerous video games, and TV ads. Commercial credits include an Emmy-award winning spot for NFL Fox, international campaigns for Xelebri communications, working with David Fincher, National spots for Mini, Wendy's, Cars.com, Arby's, Jack In The Box, Ford, Microsoft, Audi, Lexus, and the award-winning Cingular Star Wars ad with Chewbacca... He continues to live, work, and sing, whenever he is allowed, in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTcwODM2OV5BMl5BanBnXkFtZTgwOTI0OTMxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0008813","name":"Andrew Ableson","idIMDB":"nm0008813"},"actorId":"nm0008813","character":"John","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Dymond","urlProfile":"http://www.imdb.com/name/nm0245925","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDM3MjAwOF5BMl5BanBnXkFtZTcwNDI1NDcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1974","placeOfBirth":" Wimbledon, England, UK","height":"6' 2½\" (1.89 m)","bio":"Mark Dymond began his professional on-screen acting career in 1997. Born in Wimbledon, London, England in 1974, Dymond's career includes a fair balance of film and television works. His first major film project was in the James Bond franchise titled Die Another Day (2002) as the courier Van Bierk, whose identity promptly gets borrowed by Pierce Brosnan's James Bond. While most of the early 2000's saw Mark Dymond in mostly modest roles of a more standing-by or supporting nature, 2005 lent him the opportunity for a breakthrough from that stream of casting. In 2005, Mark Dymond was the lead for the adventure/fantasy sequel Donjons & dragons - La puissance suprême (2005), sharing the screen with Bruce Payne reprising his villainous role of Damodar and Clemency Burton-Hill as Dymond's on-screen wife. Along with Clemency Burton-Hill and several other cast and crew members, he also appeared in the video documentary titled Rolling the Dice: Adapting the Game to the Screen (2006) sharing his enthusiasm and experience of portraying a hero from a popular game franchise. Going into the mid to late 2000's, Mark Dymond had a recurring role as Dr. Lorcan O'Brien during the last three seasons of the UK-produced drama series The Clinic (2003). He also shared the screen with martial arts movie star Jean-Claude Van Damme in the action movie Until Death (2007). More recent projects included work in the Sci-Fi creature film Rage of the Yeti (2011) and a 2012 film short titled The Living and the Dying (2012). This film short is the first project for which Mark Dymond has written, produced and starred in.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDM3MjAwOF5BMl5BanBnXkFtZTcwNDI1NDcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0245925","name":"Mark Dymond","idIMDB":"nm0245925"},"actorId":"nm0245925","character":"David","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0460732","urlIMDB":"http://www.imdb.com/title/tt0460732","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min) (Argentina)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["FotoKem Laboratory, Burbank (CA), USA (as FotoKem)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","metascore":"23","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"2,397","type":"Movie","companyCreditsSimple":[{"idCompany":"co0153575","name":"Steaming Hot Coffee LLC"}],"keywords":{"keywords":["masturbation","marijuana","drug abuse","boyfriend girlfriend relationship","boyfriend boyfriend relationship","waiter","toilet","shotgun","restaurant","kitchen","grandmother","gay","flirting","customer","book reading"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:23:11"}}