{"data":{"movies":[{"title":"For One Night","originalTitle":"","year":"2006","releaseDate":"20060206","directors":[{"name":"Ernest R. Dickerson","id":"nm0225416"}],"writers":[{"name":"Denitria Harris-Lawrence","id":"nm1241675"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTY2NTI5N15BMl5BanBnXkFtZTgwMzA2MDA2MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"Their town always had two proms, one for the whites and one for the blacks. When both proms wanted the same DJ, Brianna McCallister suggested combining the proms, which would also mean more money for decorations. However, her idea shook the town up, especially after a white student was let off for the same offense that a black student was suspended for. Can the town overcome racial tensions and finally combine the two proms?","simplePlot":"Their town always had two proms, one for the whites and one for the blacks. When both proms wanted the same DJ, Brianna McCallister suggested combining the proms, which would also mean more... ","actors":[{"actorName":"Raven-Symoné","urlProfile":"http://www.imdb.com/name/nm0712368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzM4NTA0Nl5BMl5BanBnXkFtZTcwNzMyOTgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1985","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Raven-Symoné Christina Pearman","height":"5' 2\" (1.57 m)","bio":"Raven-Symoné Pearman was born in Atlanta, Georgia, to Lydia (Gaulden) and Christopher Pearman. At a young age, she moved to New York. While there Raven signed with the Ford Modeling Agency. They sent her out on a audition for a movie called Ghost Dad (1990), which also starred the legendary Bill Cosby. She was deemed too young for the role since was only 3 years old, but Cosby could see she had talent. They asked Raven to come back to read lines, and she did so well that she got a starring role as Olivia on the last three seasons of The Cosby Show (1984). After the show finished its run, she decided to try something new like singing. In 1993, she became the youngest person ever to sign with MCA Records. She also went back to acting with a starring role in Hangin' with Mr. Cooper (1992), alongside Mark Curry and a small role in the TV mini-series Queen (1993). After another small role in the feature film The Little Rascals (1994) and the role of Goldilocks in the TV series Happily Ever After: Fairy Tales for Every Child (1995), \"Hangin' with Mr. Cooper\" ended. Raven's singing career was doing well and she landed a role in Doctor Dolittle (1998) alongside Eddie Murphy and a made-for-TV movie called Zenon: Girl of the 21st Century (1999). She also starred in Dr. Dolittle 2 (2001), but she was not available to do Zenon: The Zequel (2001). However, the Walt Disney Company, which made the Zenon movies, wanted her back to do a pilot for a new Disney TV show called \"Absolutely Psychic,\" in which she would be a supporting character. She impressed them so much that they changed the show's premise to be about her and the show's name was changed to That's So Raven (2003). After the show was a hit she did the made-for-TV movie Les Cheetah Girls (2003) and recorded a new album. A movie based on \"That's So Raven\" may be in the works.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzM4NTA0Nl5BMl5BanBnXkFtZTcwNzMyOTgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712368","name":"Raven-Symoné","nicknames":["Rae","Rave"],"idIMDB":"nm0712368"},"actorId":"nm0712368","character":"Brianna McCallister","urlCharacter":"http://www.imdb.com/character/ch0393961","main":true},{"actorName":"Aisha Tyler","urlProfile":"http://www.imdb.com/name/nm0878768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzQ2MzMxNV5BMl5BanBnXkFtZTgwNDE4OTUyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1970","placeOfBirth":" San Francisco, California, USA","birthName":"Aisha Naomi Tyler","height":"6' (1.83 m)","bio":"Aisha Tyler born September 18, 1970 is an American talk show host, actress, comedian, author, producer, writer, and director. She is known for portraying Andrea Marino in the first season of Ghost Whisperer, voicing Lana Kane in Archer, and portraying Mother Nature in the Santa Clause film series, as well as recurring roles in CSI: Crime Scene Investigation, Talk Soup.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzQ2MzMxNV5BMl5BanBnXkFtZTgwNDE4OTUyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0878768","name":"Aisha Tyler","idIMDB":"nm0878768"},"actorId":"nm0878768","character":"Desiree Howard","urlCharacter":"http://www.imdb.com/character/ch0393962","main":true},{"actorName":"Sam Jones III","urlProfile":"http://www.imdb.com/name/nm0427389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDcxODUzM15BMl5BanBnXkFtZTcwNTkwMDgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1983","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Samuel L. Jones III","height":"5' 8\" (1.73 m)","bio":"Sam Jones III was born on April 29, 1983 in Boston, Massachusetts, USA as Samuel L. Jones III. He is an actor, known for Smallville (2001), Glory Road (2006) and Home of the Brave (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDcxODUzM15BMl5BanBnXkFtZTcwNTkwMDgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0427389","name":"Sam Jones III","idIMDB":"nm0427389"},"actorId":"nm0427389","character":"Brandon Williams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Grubbs","urlProfile":"http://www.imdb.com/name/nm0344196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1949","placeOfBirth":" Amory, Mississippi, USA","birthName":"Jon Gary Grubbs","height":"6' 4\" (1.93 m)","bio":"Gary and his wife Glenda, moved to Los Angeles in 1977 for Gary to pursue a writing career. He went on an open call as an actor, got the part, and now two hundred parts later Gary is still acting. Gary and Glenda now have a home in Mississippi and an apartment in Los Angeles and Gary works both the southern and L.A. markets. In the last few years Gary has devoted much of his time to writing and has successfully sold two pilot scripts to CBS, two screenplays and had his first full length equity play, \"As The Crow Flies,\" receive it's world premier. The production was both a creative and financial success and received many positive reviews. Currently he has a project in development at Warner Horizon. In 2008 Gary can be seen in \"In The Electric Mist\" with Tommie Lee Jones,\" \"Deal\" with Burt Reynolds, \"Good Intentions\" with Elaine Hendrix, \"Major Movie Star\" with Jessica Simpson, and \"My Mom's New Boyfriend\" with Meg Ryan and Antonio Banderas. Gary has worked as an actor for some of the most distinguished film directors of our time in a number of motion pictures, including \"JFK\" (Oliver Stone), \"Silkwood\" (Mike Nichols), \"Nadine\" (Robert Benton), \"Honkytonk Man\" (Clint Eastwood), and \"The Border\" (Tony Richardson). Other feature credits include \"X-Files The Movie,\" \"Doubletake,\" and \"Astronaut's Wife\". On television, Grubbs made a name for himself by portraying attorneys in two of the highest rated programs in television history, \"The Burning Bed\" and \"Fatal Vision\". He has also starred in numerous Movies-of-the-Week and Mini-series, including \"Canal Street Brothel,\" \"For One Night\" \"Foxfire,\" and many others. Gary's recent series and episodic work includes appearances on ER, Angel, NCIS, K-ville, Will & Grace and The O.C. Gary and Glenda have a daughter Molly who is employed at Team One Advertising in Los Angeles, and their son Logan is a grad student at The University of Southern Mississippi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0344196","name":"Gary Grubbs","idIMDB":"nm0344196"},"actorId":"nm0344196","character":"Mr. Thornton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Ragsdale","urlProfile":"http://www.imdb.com/name/nm0706619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjE3MTAzMV5BMl5BanBnXkFtZTcwNTM2MzI3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1961","placeOfBirth":" El Dorado, Arkansas, USA","birthName":"Robert William Ragsdale","bio":"Dark, wavy-haired, boyishly earnest, Williams Ragsdale graduated from Hendrix College in Conway, Arkansas studying religion and humanities before deciding to buckle down and become an actor. The acting bug began to tempt the handsome young actor while appearing in a few college plays and musicals on the sly. His parents actually gave him a graduation present in the form of tuition for the Drama Studio London's American school at Berkeley, California. His first taste of success came on stage playing Eugene, Neil Simon's autobiographical protagonist, in both \"Biloxi Blues\" and \"Broadway Bound.\" Reminding one easily of a young Jack Lemmon, Ragsdale's appeal came in a cute, accessible package and he clinched this likable image after being cast in the hugely successful teen horror flick Fright Night (1985) as a typical high school student convinced that vampires are living next door. Other less notable entries, including the sequel Fright Night Part 2 (1988) and Mannequin: On the Move (1991), came his way as a result. Since then, TV has been his medium of choice, with the cult series favorite \"Herman's Head\" adding to his momentum, not to mention brief runs in such series as _American Pie_, Brother's Keeper (1998) and \"Grosse Point\" (2000). He recently married.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjE3MTAzMV5BMl5BanBnXkFtZTcwNTM2MzI3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0706619","name":"William Ragsdale","idIMDB":"nm0706619"},"actorId":"nm0706619","character":"Earl Randall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Lewis","urlProfile":"http://www.imdb.com/name/nm0507314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0NTczMTYxMF5BMl5BanBnXkFtZTcwODU4OTEwNg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1971","placeOfBirth":" Newport Beach, California, USA","height":"6' 2\" (1.88 m)","bio":"A top fashion model turned actor, Jason Lewis is from Southern California. As a teenager, he was determined to get out and see the world. He had to work hard in order to do so, working for a plumbing contractor, and 55 hours a week as a waiter in a restaurant. In June of 1993, when finally he had enough money collected, he went to Paris at the suggestion of a model scout who thought he would do great in the modeling industry. Jason did a little modeling and was soon on his way to Milan, where he was adored by the fashion industry there. Towards the end of 1993, he landed a GUESS? campaign and his career boosted increasingly. He began landing campaigns with Tommy Hilfiger, Boss (photographed by Richard Avedon), Byblos, and Ray Ban. He also continued working many major fashion shows in Milan, New York, and Paris. In 1996, Jason was nominated for Male Model of the Year at the VH1 Fashion Music Awards. Besides all the runway shows, he has been featured alone in an 11-page editorial in the February 1996 issue of GQ. He was also one of the stars of NBC TV's High Sierra Search and Rescue (1995), a visually stunning seven part series about mountain rescue set in the High Sierras. Following this early success, he has studied with three private acting coaches for what he hopes will be a future in film. He had done a guest stint on Beverly Hills, 90210 (1990), and was a recent addition to the cast of Sex and the City (1998). Once living in New York as a high profile model, Jason followed an incredible modeling schedule. However, his interest in acting limits his modeling assignments to just fashion editorials and ad campaigns (no longer runways). His loyal fans still remember him in the pages of GQ and Esquire in 2002, and the winter 2002 Gap campaign. He is signed to Wilhelmina Models, Inc. Some of his best friends are also major male models, such as Alex Lundqvist (who was also Jason's roommate), and Mark Vanderloo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0NTczMTYxMF5BMl5BanBnXkFtZTcwODU4OTEwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507314","name":"Jason Lewis","idIMDB":"nm0507314"},"actorId":"nm0507314","character":"Mark Manning","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Sylvester","urlProfile":"http://www.imdb.com/name/nm0843221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQzNjExNF5BMl5BanBnXkFtZTgwMzc2OTcyODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1949","placeOfBirth":" New Orleans, Louisiana, USA","height":"6' 4\" (1.93 m)","bio":"Harold Sylvester was born on February 10, 1949 in New Orleans, Louisiana, USA. He is an actor and producer, known for An Officer and a Gentleman (1982), Innerspace (1987) and Married with Children (1987). He has been married to Kathleen since 1970. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQzNjExNF5BMl5BanBnXkFtZTgwMzc2OTcyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0843221","name":"Harold Sylvester","idIMDB":"nm0843221"},"actorId":"nm0843221","character":"Mr. Howard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donna Duplantier","urlProfile":"http://www.imdb.com/name/nm1251245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2ODExNDgyMF5BMl5BanBnXkFtZTgwMjUxNDE1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Is a New Orleans native. Her family's history in the city has been traced back as far as the 1800s. Her father was one of the first African American geologists at Texaco oil and her mother was a nurse for over 30 years throughout the metropolitan city. She graduated from George Mason University with a BA in theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2ODExNDgyMF5BMl5BanBnXkFtZTgwMjUxNDE1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1251245","name":"Donna Duplantier","idIMDB":"nm1251245"},"actorId":"nm1251245","character":"Aunt Marlene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan Pringle","urlProfile":"http://www.imdb.com/name/nm0697824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MzIyMTg5OF5BMl5BanBnXkFtZTgwNDUzODc5MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1945","placeOfBirth":" New York City, New York, USA","bio":"Joan Pringle was born on June 2, 1945 in New York City, New York, USA. She is an actress and writer, known for General Hospital (1963), The White Shadow (1978) and Péché originel (2001). She is married to Vernon L. Bolling. She was previously married to Teddy Wilson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MzIyMTg5OF5BMl5BanBnXkFtZTgwNDUzODc5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0697824","name":"Joan Pringle","idIMDB":"nm0697824"},"actorId":"nm0697824","character":"Mrs. Edna Howard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rhoda Griffis","urlProfile":"http://www.imdb.com/name/nm0341421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTc4ODU1MF5BMl5BanBnXkFtZTgwMzkyMjQ4NTE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1965","placeOfBirth":" Raleigh, North Carolina, USA","height":"5' 7\" (1.7 m)","bio":"Rhoda holds a BFA from the North Carolina School of the Arts. Acting onstage since the age of 7, she still \"charges her batteries\" in the theatre where she has conquered such roles as Lady MacBeth, Lady Anne and has appeared in Angels in America, Proof, Intimate Apparel, Collected Stories, Dinner with Friends and Dark at the Top of the Stairs to name a few. She enjoys every aspect of her career including film and television. Her popular character she played was Jacqueline Kennedy in Love Field (1992). She worked alongside with her good friend Emmy Rossum in Songcatcher (2000), as the wife of the coal company head (Steve Boles), Clementine McFarland. Her favorite role is the General's vixen wife, Lenore Baker, on the Lifetime series Army Wives (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTc4ODU1MF5BMl5BanBnXkFtZTgwMzkyMjQ4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341421","name":"Rhoda Griffis","idIMDB":"nm0341421"},"actorId":"nm0341421","character":"Ginny Stephens","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daina Gozan","urlProfile":"http://www.imdb.com/name/nm2071292","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzUzMDUyOV5BMl5BanBnXkFtZTcwMTkzNDMzMQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"A conservatory trained performer, Daina has studied at some of the nation's leading performing arts schools including the California Institute of the Arts, and The Sanford Meisner Center in Los Angeles. After shooting several independent features, Daina recently got her big break playing the role of Sela in For One Night on Lifetime, where she starred opposite Raven Simone and Aisha Tyler.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzUzMDUyOV5BMl5BanBnXkFtZTcwMTkzNDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2071292","name":"Daina Gozan","idIMDB":"nm2071292"},"actorId":"nm2071292","character":"Sela Moody","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mills Allison","urlProfile":"http://www.imdb.com/name/nm1794240","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzM1NTE1Ml5BMl5BanBnXkFtZTcwNTAzMTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Mills Allison is an actor and writer, known for Prom Queen (2007), Toogoodoo (2011) and For One Night (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzM1NTE1Ml5BMl5BanBnXkFtZTcwNTAzMTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1794240","name":"Mills Allison","idIMDB":"nm1794240"},"actorId":"nm1794240","character":"Ely Hardy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caroline Jahna","urlProfile":"http://www.imdb.com/name/nm2146878","urlPhoto":"","biography":{"height":"5' 5¾\" (1.67 m)","bio":"Caroline Jahna is an actress, known for The Initiation of Sarah (2006), For One Night (2006) and The Arrangement (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2146878","name":"Caroline Jahna","idIMDB":"nm2146878"},"actorId":"nm2146878","character":"Carla Thornton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Aaron Smith","urlProfile":"http://www.imdb.com/name/nm0808584","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTg4NjM0MV5BMl5BanBnXkFtZTYwMjgyNDAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"James Aaron Smith","height":"6' (1.83 m)","bio":"James Aaron Smith's road to Hollywood spans across the country beginning in the south where his remarkable talent was discovered in his hometown at the University of New Orleans. Before attending UNO James' career goals were nowhere near focused on acting or movie production, as he was comfortable with his communications major and working part time at UPS. James caught the acting bug while taking an acting elective at UNO. He quickly embraced acting and the entire process of movie production and knew that he had a natural talent to perform. After that semester James signed up with a local non-union talent agency. On his third audition ever James booked a principal part on a Volkswagon \"Jetta\" commercial where he meet the owner of a SAG franchised talent agency located in Los Angeles. The owner was extremely interested in James and encouraged him to make the journey to Hollywood. Armed with drive, determination, a little cash, a terrible head shot, SAG eligibility and college transfer papers James packed up and followed his heart to Hollywood. Since moving to Hollywood James has displayed his acting skill for TV, feature film and commercials executives, landing guest star roles on TV shows such as \"The District\", \"The Division\", \"Memphis Beat\" and a recurring role on the sitcom \"One On One\" where he played the school motor mouth \"Lewis.\" James' on camera success didn't stop there. It only paved the way for his film debut playing the charming Darius \"Zion\" Webb in \"A Night in Compton\" in which stared along side Tiny Lester. Months later James was cast as Herman Carr supporting Josh Lucas, Jon Voit and Derek Luke in Jerry Bruckheimer's film \"Glory Road\" a true story portraying the racial struggles of the 1966 Texas Western NCAA men's basketball team. Along with film and TV success James has managed to keep his face in the public eye by being cast in over 25 national commercials for companies such as KFC, Coors Lite, Bud Lite, Honda, Verizon, Adidas and Volkswagon. Now possessing a bachelor's degree in Journalism from Cal State Northridge, a strong acting resume and more drive than a Ferrari James is prepared for a promising career on screen and in movie production. Great actors, directors and producers such as Robert DeNiro, Denzel Washington, Sylvestor Stallone and rap moguls Jay Z and Sean \"P.Diddy\" Combs have influenced him. A perfectionist with a real love for living life to the fullest and accepting challenges James can be found searching for new challenges expanding his talents.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTg4NjM0MV5BMl5BanBnXkFtZTYwMjgyNDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0808584","name":"James Aaron Smith","nicknames":["J. Smith"],"idIMDB":"nm0808584"},"actorId":"nm0808584","character":"Myron Dawson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Herthum","urlProfile":"http://www.imdb.com/name/nm0381043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1Mzg4NjA5OV5BMl5BanBnXkFtZTgwNjA5NTUzMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1956","placeOfBirth":" Baton Rouge, Louisiana, USA","bio":"Louis Herthum is a native of Baton Rouge, Louisiana. There, he started his career in the entertainment field as an actor in 1978 and in 1982, he moved to Los Angeles. Over the next decade, he appeared in over thirty productions in the Los Angeles area, winning critical acclaim for his work in two original plays, Snatch A Falling Star and The Only Thing, both written by the late Craig Alpaugh. Both plays went on to be published by The Dramatic Publishing Company. In 1991, Louis joined the cast of the long running hit CBS television series, Murder, She Wrote (1984), starring Angela Lansbury. There, he played the role of Deputy Andy Broom for the final five seasons of the show. At the end of his stint on Murder, She Wrote (1984), Louis turned his attentions to film production. He continues to act and produce today.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1Mzg4NjA5OV5BMl5BanBnXkFtZTgwNjA5NTUzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0381043","name":"Louis Herthum","idIMDB":"nm0381043"},"actorId":"nm0381043","character":"Sheriff Taylor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0463996","urlIMDB":"http://www.imdb.com/title/tt0463996","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.9","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"awards":[{"award":"Image Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Actress in a Television Movie, Mini-Series or Dramatic Special","names":[{"name":"Aisha Tyler","id":"nm0878768","role":null}]}]}]}],"votes":"336","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0135798","name":"VZS Productions"}],"keywords":{"keywords":["racial tension","white male black female relationship","vandalism","reporter","principal","mother daughter relationship","father daughter relationship","earring","brick","new orleans louisiana","family relationships","teenager","southern accent","social commentary","small town","school","reunion","racist","racism","race relations","party","journalist","journalism","high school","graduation","generation gap","friendship","dating","dance","corruption","coming of age","african american","racial segregation","high school prom","interracial kiss","based on true story"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:33:26"}}