{"data":{"movies":[{"title":"Tannhäuser","originalTitle":"","year":"1913","releaseDate":"19130715","directors":[{"name":"Lucius Henderson","id":"nm0376529"}],"writers":[{"name":"Richard Wagner","id":"nm0003471"}],"runtime":"40 min","countries":["USA"],"languages":[],"genres":["Short","Drama"],"simplePlot":"","actors":[{"actorName":"James Cruze","urlProfile":"http://www.imdb.com/name/nm0190516","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MzhlZTgtNjViNi00MjhlLTk4YjAtM2EwY2M5OTVjZDhmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1884","placeOfBirth":" Ogden, Utah, USA","birthName":"Jens Vera Cruz Bosen","bio":"Coming from a Mormon family in Utah, James Cruze was reportedly part Ute Indian. He worked as a fisherman to pay his way through drama school. Among his former wives were actresses Betty Compson (also from Utah) and Marguerite Snow. He was also married to Alberta McCoy (died on July 7, 1960), who is interred in the Columbarium at Hollywood Forever Cemetery (unmarked). Many of the films Cruze directed in the 1920s and 1930s have been lost. He directed a large variety of films, from Roscoe 'Fatty' Arbuckle slapstick two-reelers to suspense thrillers to big-budget epics. In 1929 he appeared before a grand jury in Los Angeles that was investigating an accident on one of his films in which one man was killed and others were injured, one of many run-ins Cruze had with the law. He used the name Cruze on screen, but in real life remained James Bosen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MzhlZTgtNjViNi00MjhlLTk4YjAtM2EwY2M5OTVjZDhmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0190516","name":"James Cruze","nicknames":["Jimmy"],"idIMDB":"nm0190516"},"actorId":"nm0190516","character":"Tannhäuser","urlCharacter":"http://www.imdb.com/character/ch0524695","main":true},{"actorName":"Marguerite Snow","urlProfile":"http://www.imdb.com/name/nm0811293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmZlODhlNjEtYWE5MC00ZDJkLWE4MTUtNGE4NTE2ZTE3ZjgwXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1889","placeOfBirth":" Salt Lake City, Utah, USA","bio":"Although Marguerite Snow was born in Salt Lake City, her father--a comedian in vaudeville minstrel shows--traveled extensively, so she grew up all over the country. When her father died, she and her mother settled in Denver, Colorado. Marguerite took drama lessons with the intentions of becoming a stage actress, and made her stage debut in 1906. She was soon playing on Broadway, and after that joined a touring stock company. Her entry into films was somewhat accidental. One day in 1911 a girlfriend was playing in a film being made by the Thanhouser Co., and Marguerite went along to satisfy her curiosity as to how films were made. The studio head saw her and convinced her to appear in the film also. She found that she enjoyed film work, and soon quit the stage to concentrate on films exclusively. After appearing in scores of two-reelers for Thanhouser and Kinemacolor, among other companies, she married actor (later director) James Cruze in 1913. In 1915 she journeyed to Hollywood, and appeared in many productions for Metro, both full-length features and serials. She and Cruze divorced in 1923. Two years later she married comedian Neely Edwards, and retired from the business.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmZlODhlNjEtYWE5MC00ZDJkLWE4MTUtNGE4NTE2ZTE3ZjgwXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0811293","name":"Marguerite Snow","idIMDB":"nm0811293"},"actorId":"nm0811293","character":"Princess Elisabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Florence La Badie","urlProfile":"http://www.imdb.com/name/nm0478359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmNzlhYWItNWJiZi00ZjczLTg5ODEtMGNhMGUzYzFkNTkwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1888","placeOfBirth":" New York City, New York, USA","birthName":"Florence Russ","bio":"Early information on Florence La Badie is sketchy. She is thought to have been born in New York City in 1888, and was either taken away from or given up for adoption by her birth mother. Florence was adopted by a married couple named LaBadie, who legally gave the child their last name. Her adoptive father, Joseph LaBadie, is believed to have been an attorney in Canada, and the family spent time in Montreal, where Florence grew up. She was educated in both Montreal and New York, and after graduation from high school she worked as a model for well-known illustrator (and, later, film director) Penrhyn Stanlaws. She took up a career on the stage, first appearing there in 1908. She signed up with director Chauncey Olcott's theatrical company, and went on the road with them. In 1909 she went with a friend, Mary Pickford, to the American Biograph film studio in New York to watch Pickford at work in In the Window Recess (1909), and Pickford got her a bit part in the picture. La Badie didn't make any films for a year after that, though, at which time she signed a contract with Biograph. In 1911 she left Biograph for Thanhouser. She met with great success in Thanhouser's pictures, and was gradually promoted to lead roles, working there from 1911-1917 (making her the player who worked at Thanhouser the longest). She became the best-known of all of Thanhouser's players and was wildly popular in fan magazines and trade journals. Although she was engaged twice (to actor Val Hush and writer Daniel Carson Goodman), she never married. She was the \"companion\" of film mogul Marcus Loew for several years. On August 28, 1917, while driving a car near Ossining, New York, with her fiancé Daniel Goodman, the car's brakes failed and it plunged down an embankment at high speed, rolling over when it hit the bottom. Goodman escaped with relatively minor injuries, but she was thrown from the car and incurred a compound fracture of the pelvis. She was taken to a hospital in Ossining, where her conditioned worsened. She died of septicemia (infection) on August 28. She was 29 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmNzlhYWItNWJiZi00ZjczLTg5ODEtMGNhMGUzYzFkNTkwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0478359","name":"Florence La Badie","idIMDB":"nm0478359"},"actorId":"nm0478359","character":"Venus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Russell","urlProfile":"http://www.imdb.com/name/nm0751510","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVmOGJmN2MtYzhjMy00OThmLWIwZDctZGQ5NTg4ZWJjMDBkXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1884","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"William Lerche","height":"6' 2\" (1.88 m)","bio":"Silent-film star William Russell was born in the Bronx, New York, in the late 1880s (various sources give it as 1884, 1886 and 1889). His mother, Clara, was a highly regarded stage actress. Russell studied law at Fordham University (and, some sources say, Harvard University). He started a law practice in Pittsburgh, Pennsylvania, but it wasn't particularly successful. He tried a variety of other jobs--including bookmaker and boxing instructor--before deciding to give the stage a shot. He had actually been a fairly successful child actor on the stage, and after re-entering the profession as an adult, he found himself acting with Ethel Barrymore in \"Cousin Kate\" on Broadway. Russell kept busy as a stage actor, appearing with many of the top stars of the day, including Chauncey Olcott and Catherine Countiss. He toured the country in various stock productions. His film career began at Biograph in 1910 with \"The Roman Slave\", directed by D.W. Griffith. He stayed almost a year at Biograph, although he was used mostly in small parts. In 1910 he left Biograph for Thanhouser. There he became a star, and Thanhouser put him in quite a few of its productions. His brother Albert Russell also appeared in several of his films. In 1913 Russell left Thanhouser to return to Biograph, but later that year he again left Biograph to go back to Thanhouser. He finally left Thanhouser and worked for a variety of studios, both major and minor, over the next several years. In 1917 he married actress Charlotte Burton, but it ended in divorce four years later. From 1916-20 he worked for American Film Co., appearing in The Torch Bearer (1916), The Strength of Donald McKenzie (1916) and The Man Who Would Not Die (1916), among others. In 1919 he formed his own production company, William Russell Productions, and produced and appeared in This Hero Stuff (1919), directed by Henry King. He freelanced at studios as varied as Fox Films and Victor. In the 1920s he decided to move to Hollywood after having spent much of his life in New York City. He married actress Helen Ferguson, and that marriage lasted until his death in Beverly Hills, California, on February 18, 1929, from pneumonia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVmOGJmN2MtYzhjMy00OThmLWIwZDctZGQ5NTg4ZWJjMDBkXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751510","name":"William Russell","idIMDB":"nm0751510"},"actorId":"nm0751510","character":"Wolfram","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Burton Law","urlProfile":"http://www.imdb.com/name/nm0492302","urlPhoto":"","biography":{"dateOfBirth":"22 October 1877","placeOfBirth":" Ouray, Colorado, USA","birthName":"Burton C. Law","bio":"Burton Law was born on October 22, 1877 in Ouray, Colorado, USA as Burton C. Law. He was an actor and writer, known for The Sea Lily (1916), The Tell Tale Clue (1917) and Circumstantial Guilt (1916). He died on November 2, 1963 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0492302","name":"Burton Law","idIMDB":"nm0492302"},"actorId":"nm0492302","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0464694","urlIMDB":"http://www.imdb.com/title/tt0464694","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["40 min"],"soundMix":["Silent"],"color":["Black and White (tinted)"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["900 m (3 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.4","filmingLocations":[],"awards":[],"votes":"16","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021391","name":"Thanhouser Film Corporation"}],"keywords":{"keywords":["based on opera"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:38:56"}}