{"data":{"movies":[{"title":"Norbit","originalTitle":"","year":"2007","releaseDate":"20070209","directors":[{"name":"Brian Robbins","id":"nm0005367"}],"writers":[{"name":"Eddie Murphy","id":"nm0000552"},{"name":"Charlie Murphy","id":"nm0614151"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDE4MjgyNV5BMl5BanBnXkFtZTcwMTQwODc0MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Norbit is a normal person, who after being adopted by Mr. Wong, ends up being married to the very large, Rasputia. Norbit's childhood love, Kate Thomas arrives back in town to buy the orphanage. Norbit sees this as his chance to get back together with Kate, until he discovers that she is in fact engaged to Deion Hughes. Norbit isn't going to lay this to rest, whilst he tries to survive life with Rasputia, and it looks like Deion also has something he would like to keep secret.","simplePlot":"A mild-mannered guy, who is married to a monstrous woman, meets the woman of his dreams, and schemes to find a way to be with her.","actors":[{"actorName":"Eddie Murphy","urlProfile":"http://www.imdb.com/name/nm0000552","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQzODAwNF5BMl5BanBnXkFtZTYwMzUzNTk3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1961","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Edward Regan Murphy","height":"5' 9\" (1.75 m)","bio":"Edward Regan Murphy was born April 3, 1961 in Brooklyn, New York, to Lillian, a telephone operator, and Charles Edward Murphy, a transit police officer who was also an amateur comedian and actor. After his father died, his mother married Vernon Lynch, a foreman at a Breyer's Ice Cream plant. His siblings are Charlie Murphy and Vernon Lynch, Jr. Eddie had aspirations of being in show business since he was a child. A bright kid growing up in the streets of New York, Murphy spent a great deal of time on impressions and comedy stand-up routines rather than academics. His sense of humor and wit made him a stand out amongst his classmates at Roosevelt Junior-Senior High School. By the time he was fifteen, Murphy worked as a stand-up comic on the lower part of New York, wooing audiences with his dead-on impressions of celebrities and outlooks on life. In the early 1980s, at the age of 19, Murphy was offered a contract for the Not-Ready-For-Prime-Time Players of Saturday Night Live (1975), where Murphy exercised his comedic abilities in impersonating African American figures and originating some of the shows most memorable characters: Velvet Jones, Mr. Robinson, and a disgruntled and angry Gumby. Murphy made his feature film debut in 48 Hrs. (1982), alongside Nick Nolte. The two's comedic and antagonistic chemistry, alongside Murphy's believable performance as a streetwise convict aiding a bitter, aging cop, won over critics and audiences. The next year, Murphy went two for two, with another hit, pairing him with John Landis, who later became a frequent collaborator with Murphy in Coming to America (1988) and Beverly Hills Cop III (1994). Beverly Hills Cop (1984) was the film that made Murphy a box-office superstar and most notably made him a celebrity worldwide, and it remains one of the all-time biggest domestic blockbusters in motion-picture history. Murphy's performance as a young Detroit cop in pursuit of his friend's murderers earned him a third consecutive Golden Globe nomination. Axel Foley became one of Murphy's signature characters. On top of his game, Murphy was unfazed by his success, that is until his box office appeal and choices in scripts resulted into a spotty mix of hits and misses into the late 1980s and early 1990s. Films like The Golden Child (1986) and Beverly Hills Cop II (1987) were critically panned but were still massive draws at the box office. In 1989, Murphy, coming off another hit, Coming to America (1988), found failure with his directorial debut, Harlem Nights (1989). Another 48 Hrs. (1990) and his turn as a hopeless romantic in Boomerang (1992) did little to resuscitate his career. However, his remake of Jerry Lewis's The Nutty Professor (1996) brought Murphy's drawing power back into fruition. From there, Murphy rebounded with occasional hits and misses but has long proven himself as a skilled comedic actor with applaudable range pertaining to characterizations and mannerisms. Though he has grown up a lot since his fast-lane rise as a superstar in the 1980s, Murphy has lived the Hollywood lifestyle with controversy, criticism, scandal, and the admiration of millions worldwide for his talents. As Murphy had matured throughout the years, learning many lessons about the Hollywood game in the process, he settled down with more family-oriented humor with Doctor Dolittle (1998), Mulan (1998), Bowfinger (1999), and the animated smash Shrek (2001), in a supporting role that showcased Murphy's comedic personality and charm. Throughout the 2000s, he further starred in the hits The Haunted Mansion (2003), Shrek 2 (2004), Dreamgirls (2006) (for which he was nominated for a Best Supporting Actor Oscar), Norbit (2007), Shrek the Third (2007), and Shrek Forever After (2010). Murphy was married to Nicole Mitchell Murphy from 1993 to 2006. Murphy has eight children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQzODAwNF5BMl5BanBnXkFtZTYwMzUzNTk3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000552","name":"Eddie Murphy","nicknames":["Ed","Murph"],"idIMDB":"nm0000552"},"actorId":"nm0000552","character":"Norbit / Rasputia / Mr. Wong","urlCharacter":"http://www.imdb.com/character/ch0038699","main":true},{"actorName":"Thandie Newton","urlProfile":"http://www.imdb.com/name/nm0628601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MjAzMTI1M15BMl5BanBnXkFtZTgwMzI5NTEwNjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1972","placeOfBirth":" London, England, UK","birthName":"Thandiwe Melanie Newton","height":"5' 3\" (1.6 m)","bio":"Thandie Newton was born in London. She is the daughter of a Zimbabwean mother, Nyasha, a health-care worker from the Shona tribe, and Nick Newton, a British father who worked as a lab technician. She lived in Zambia until political unrest caused her family to move back to the UK. She then lived in Cornwall in the southwest of Britain until the age of 11. At that time she enrolled in London's Art Educational School, where she studied modern dance. However, a back injury forced her to quit dancing. This led to her auditioning for films and receiving her first role in John Duigan's Flirting (1991). She then moved to Los Angeles, California, to pursue acting and her then-boyfriend. Her British accent limited the amount of work she was getting, and she returned to Britain, where she went to Cambridge University to study, eventually receiving a degree in anthropology. Between semesters, she continued her acting and became noticed and in-demand for future film roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MjAzMTI1M15BMl5BanBnXkFtZTgwMzI5NTEwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0628601","name":"Thandie Newton","idIMDB":"nm0628601"},"actorId":"nm0628601","character":"Kate Thomas","urlCharacter":"http://www.imdb.com/character/ch0015821","main":true},{"actorName":"Terry Crews","urlProfile":"http://www.imdb.com/name/nm0187719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1968","placeOfBirth":" Flint, Michigan, USA","birthName":"Terrence Alan Crews","height":"6' 3¼\" (1.91 m)","bio":"Terry Crews was born in Flint, Michigan, to Patricia and Terry Crews, Sr. He earned an Art Excellence Scholarship to attend Western Michigan University and also earned a full-ride athletic scholarship to play football. Crews was an All-Conference defensive end, and was a major contributor on the 1988 MAC champion WMU Broncos. His college success was rewarded in 1991, when he was drafted by the NFL's Los Angeles Rams. Crews played six years in the NFL, with stints at the L.A. Rams, San Diego Chargers , Rhein Fire (NFL Europe-Germany), Washington Redskins and Philadelphia Eagles. While in the NFL, used his art talent by painting a line of NFL licensed lithographs for Sierra Sun Editions. In 1996, Crews co-wrote and co-produced the independent feature film, \"Young Boys Incorporated\" (1996). Crews retired from the NFL in 1997 and moved to Los Angeles to pursue an acting career. Crews' first break came in 1999, when he auditioned for the extreme sports show called Battle Dome (1999), with other actor-athletes from around the country. Crews was chosen to be a series regular, known as the urban warrior, \"T-Money\". In 2000, Crews made his big screen debut in The 6th Day (2000). Since then, he has landed roles in Au service de Sara (2002), Friday After Next (2002), Deliver Us from Eva (2003), Malibu's Most Wanted (2003), Starsky & Hutch (2004), Soul Plane (2004), White Chicks (2004), and the Mike Judge film, Idiocracy (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187719","name":"Terry Crews","idIMDB":"nm0187719"},"actorId":"nm0187719","character":"Big Jack Latimore","urlCharacter":"http://www.imdb.com/character/ch0015823","main":true},{"actorName":"Clifton Powell","urlProfile":"http://www.imdb.com/name/nm0694066","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MjAzNDUzMF5BMl5BanBnXkFtZTYwNTkwMzY0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1956","placeOfBirth":" Washington, District of Columbia, USA","bio":"Clifton Powell was born on March 16, 1956 in Washington, District of Columbia, USA. He is an actor and producer, known for Ray (2004), Norbit (2007) and Grand Theft Auto: San Andreas (2004). He is married to Kimberly.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MjAzNDUzMF5BMl5BanBnXkFtZTYwNTkwMzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0694066","name":"Clifton Powell","idIMDB":"nm0694066"},"actorId":"nm0694066","character":"Earl Latimore","urlCharacter":"http://www.imdb.com/character/ch0259901","main":true},{"actorName":"Lester Speight","urlProfile":"http://www.imdb.com/name/nm0711529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTA2ODUxMl5BMl5BanBnXkFtZTcwMzg2NzUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1963","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Lester Speight","height":"6' 5½\" (1.97 m)","bio":"Lester Speight is a film and television actor best known for his portrayal of Terry Tate: Office Linebacker in a series of Reebok commercials that first aired during Super Bowl XXXVII in 2003. The spots feature Speight, a former All-American Football player himself, as a linebacker charged with the no-holds barred enforcement of office policies. The commercials achieved much critical acclaim and were ranked the most watched of the Super Bowl by The Hollywood Reporter. The popular character recently made a return appearance in a series of ads campaign in support of voting. Amongst the Office Linebacker's new tackles included former Vice Presidential candidate Sarah Palin. As determined and hardworking on screen as a linebacker is on the field, Speight has appeared with such stars as Eddie Murphy, Damon Wayans, Anthony Anderson, and even Optimus Prime. His television work includes a recurring role on the ABC series \"My Wife and Kids,\" as well as guest starring appearance on \"Prison Break,\" \"Bones,\" and \"Cold Case.\" On the silver screen he has appeared in hit films such as \"Transformers: Dark of the Moon,\" \"Norbit,\" and \"Harold and Kumar Escape From Guantanamo Bay.\" Aside from Terry Tate however, Speight is probably most recognized by fans of the Gears of War video game series for the XBOX 360. Speight won the G-Phoria award for Best Voiceover in 2007 by the G4 Network for his performance as Augustus Cole (AKA Cole Train), a character that was modeled after Speight and includes subtle allusions to the Office Linebacker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTA2ODUxMl5BMl5BanBnXkFtZTcwMzg2NzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711529","name":"Lester Speight","nicknames":["The Mighty Rasta","Rasta"],"idIMDB":"nm0711529"},"actorId":"nm0711529","character":"Blue Latimore","urlCharacter":"http://www.imdb.com/character/ch0259901","main":true},{"actorName":"Cuba Gooding Jr.","urlProfile":"http://www.imdb.com/name/nm0000421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzk4NjQ2Ml5BMl5BanBnXkFtZTYwNzc3ODI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1968","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Cuba M. Gooding Junior","height":"5' 10\" (1.78 m)","bio":"Cuba Gooding Jr. was born on January 2, 1968, in The Bronx, New York. His mother, Shirley (Sullivan), was a backup singer for The Sweethearts. His father, Cuba Gooding, was the lead vocalist for the R&B group The Main Ingredient, which had a hit with the song \"Everybody Plays The Fool\". His paternal grandfather was from Barbados. Cuba's father moved the family to Los Angeles in 1972, only to leave them a few years later. Despite this setback, Cuba was able to maintain a positive outlook and overachieved throughout school. He attended four different high schools and was elected class president in three of them. While at high school, Cuba met and fell in love with Sara Kapfer, whom he later lived with for seven years before tying the knot in March 1994. Following high school, Cuba studied Japanese martial arts for three years before turning his focus toward acting. Early on, he landed guest starring roles on shows like Hill Street Blues (1981) and MacGyver (1985). His first major role was in the 1991 box office surprise Boyz n the Hood (1991). He followed this success with supporting roles in major films like A Few Good Men (1992), Lightning Jack (1994) and Outbreak (1995). In 1996, Cuba was cast as an arrogant but loyal football player in the Tom Cruise-Cameron Crowe film Jerry Maguire (1996). The film became a huge box office smash and earned Cuba an Academy Award for Best Supporting Actor. His \"Show Me The Money\" line in the movie became a nationwide catchphrase. The role elevated him to superstar status, as many of Hollywood's top producers began to \"show him the money\" to appear in their films. Since Jerry Maguire (1996), Cuba has managed to keep busy with a wide range of roles alongside many of Hollywood's biggest stars. Most recently, he won critical support for his portrayal of a mentally handicapped man in the heartwarming film Radio (2003), another movie about football. In 2002, he was given a star on the Hollywood Walk of Fame. He resides in Studio City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzk4NjQ2Ml5BMl5BanBnXkFtZTYwNzc3ODI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000421","name":"Cuba Gooding Jr.","idIMDB":"nm0000421"},"actorId":"nm0000421","character":"Deion Hughes","urlCharacter":"http://www.imdb.com/character/ch0015822","main":true},{"actorName":"Eddie Griffin","urlProfile":"http://www.imdb.com/name/nm0341176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTQwNjkxNl5BMl5BanBnXkFtZTgwMzAxODkzMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1968","placeOfBirth":" Kansas City, Missouri, USA","height":"5' 7\" (1.7 m)","bio":"Eddie Griffin was born on July 15, 1968 in Kansas City, Missouri, USA. He is known for his work on Malcolm & Eddie (1996), Undercover Brother (2002) and Deuce Bigalow: Male Gigolo (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTQwNjkxNl5BMl5BanBnXkFtZTgwMzAxODkzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341176","name":"Eddie Griffin","idIMDB":"nm0341176"},"actorId":"nm0341176","character":"Pope Sweet Jesus","urlCharacter":"http://www.imdb.com/character/ch0015824","main":true},{"actorName":"Katt Williams","urlProfile":"http://www.imdb.com/name/nm1139343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzA3ODQxOF5BMl5BanBnXkFtZTcwOTYwNjcyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1973","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Katt Micah Williams","height":"5' 7\" (1.7 m)","bio":"Multi-talented actor/comedian Katt Williams was born in Cincinnati and raised in Dayton, Ohio. He currently resides in Los Angeles, California, where he is simultaneously working on several projects on camera and behind the scenes for your viewing pleasure in the near future. Throughout his journey he has used his comedy as a tool to travel the country and has accumulated a massive fan base in the process. You may find him coming to your area soon, as he is currently on a multi-city comedy tour, touring with some of the hottest comedians to date.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzA3ODQxOF5BMl5BanBnXkFtZTcwOTYwNjcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1139343","name":"Katt Williams","idIMDB":"nm1139343"},"actorId":"nm1139343","character":"Lord Have Mercy","urlCharacter":"http://www.imdb.com/character/ch0050236","main":true},{"actorName":"Floyd Levine","urlProfile":"http://www.imdb.com/name/nm0505801","urlPhoto":"","biography":{"dateOfBirth":"23 February 1932","placeOfBirth":" New York, New York, USA","bio":"Floyd Levine was born on February 23, 1932 in New York, New York, USA. He is an actor, known for The Hangover (2009), Dog Day Afternoon (1975) and Norbit (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0505801","name":"Floyd Levine","idIMDB":"nm0505801"},"actorId":"nm0505801","character":"Abe the Tailor","urlCharacter":"http://www.imdb.com/character/ch0285677","main":true},{"actorName":"Anthony Russell","urlProfile":"http://www.imdb.com/name/nm0751001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzUxMzQzN15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Anthony Russell has parlayed an extensive talent for music into an acting career that includes stage, film and television productions. As a child, Russell played harmonica, ukulele, guitar, trombone and piano. He worked his way through college playing and singing in a show band. After graduating Montclair State College with a major in trombone and a minor in piano, his band was booked as a Las Vegas lounge act in many of the major hotels. Russell even worked in the Atlantic City 500 Club where Dean Martin and Jerry Lewis first got together as a team. Encouraged by his best friend who recognized his talents, Russell journeyed to New York to study acting at HB Studios and eventually earned a coveted membership in the acclaimed Actors Studio. He appeared in four of the group's stage productions, and was also in the cast of \"Lamppost Reunion\" which won the best ensemble acting award at the Court Theater in Hollywood. Russell's other Theatrical appearances include, \"A Streetcar Named Desire\", \"Guys & Dolls\", \"One Flew Over the Cuckoo's Nest\" & \"Two Gentelman of Verona\". Russell also pursued stand-up comedy, and made appearances in many of the famed U.S. comedy clubs such as The Comedy Store, The Improv in Hollywood, The Ice House, and The Comedy Magic in Hermosa Beach. He also made comedic appearances on \"The Merv Griffin Show\", \"The Dinah Shore Show\", \"Norm Crosby's Comedy Shop\", \"Madam's Place\", \"Make Me Laugh\", and \"The John Davidson Show\" to name a few. He's opened for Las Vegas stars such as Frankie Avalon, Julie London, Roger Miller, Joe Williams, Tony Martins and Lou Rawls. Russell's film credits include \"Bugsy\" with Warren Beatty, \"Casino\" with Robert De Niro and Joe Pesci, \"Ed Wood\" with Johnny Depp and Martin Landau, \"Out Of Justice\" with Steven Segal, \"Suddenly\" with Kirstie Alley, \"Living out Loud\" with Holly Hunter and Danny De Vito, and \"Winchell\" with Stanley Tucci. On television, he was a recurring character on \"The Fanelli Boys\" and guest starred on \"NYPD Blue\", \"Becker\", \"Home Improvement\", \"Mad About You\", \"Roseanne\", \"The George Carlin Show\", \"The Profiler\", \"Reba\", \"The John Larroquette Show\", \"Diagnosis Murder\", \"Silk Stalkings\", \"Night Court\", \"Sabrina, the Teenage Witch\", \"Family Law\" and \"Arliss.\" Russell continues to play piano everyday, loving the classic composers of American music, particularly The Gershwins, Rodgers and Hammerstein, Rodgers and Hart, Cole Porter, Jerome Kern, and Frank Leosser. Russell's also has a jazz band where he sings, plays, does stand-up and has wail of a time. Russell's other passions include watching old movies, walking with his beloved dog Angelo, learning old songs, and appreciating natural beauty. When time allows, he continues to work regularly at The Riviera Hotel in Las Vegas as a stand-up comedian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzUxMzQzN15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751001","name":"Anthony Russell","idIMDB":"nm0751001"},"actorId":"nm0751001","character":"Giovanni","urlCharacter":"http://www.imdb.com/character/ch0285678","main":true},{"actorName":"Pat Crawford Brown","urlProfile":"http://www.imdb.com/name/nm0114390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNjgwMDE3Ml5BMl5BanBnXkFtZTcwNzAwMDAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1929","placeOfBirth":" New York City, New York, USA","bio":"Pat Crawford Brown was born on June 29, 1929 in New York City, New York, USA. She is an actress, known for Stuck on You (2003), Daredevil (2003) and Sister Act (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNjgwMDE3Ml5BMl5BanBnXkFtZTcwNzAwMDAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114390","name":"Pat Crawford Brown","idIMDB":"nm0114390"},"actorId":"nm0114390","character":"Mrs. Henderson","urlCharacter":"http://www.imdb.com/character/ch0259902","main":true},{"actorName":"Jeanette Miller","urlProfile":"http://www.imdb.com/name/nm0588563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODYzNzY4NV5BMl5BanBnXkFtZTcwNDY5MzMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Jeanette Miller is an actress, known for The Truman Show (1998), Austin Powers: The Spy Who Shagged Me (1999) and Legion (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODYzNzY4NV5BMl5BanBnXkFtZTcwNDY5MzMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588563","name":"Jeanette Miller","idIMDB":"nm0588563"},"actorId":"nm0588563","character":"Mrs. Coleman","urlCharacter":"http://www.imdb.com/character/ch0285680","main":true},{"actorName":"Michael Colyar","urlProfile":"http://www.imdb.com/name/nm0173485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjY5MTA1N15BMl5BanBnXkFtZTgwMTc2NDAyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"A native of Chicago, Michael Colyar made his mark as \"The King of Venice Beach.\" For nine years, he performed five shows a day, leaving a positive imprint on the crowd with his thought-provoking humor. As his hard work begun paying off and with his comedic star on the rise, he was honored by the city of Venice by placing his shoe and hand prints as well as his money grabber in cement of the new Venice Boardwalk. Colyar gained national attention after capturing the Grand Prize Comedy championship and $100,000 on the popular television show \"Star Search.\" He donated half of his winnings to homeless charities in the Los Angeles area. And continues to give back to this day. As \"The Original Host\" of \"BET Live From LA\", his point blank delivery and razor-sharp insight deeply connected to its over 55 million viewers coast to coast. Over the past 15 years, he has built his television & film career working with such luminaries as John Singleton, Eddie Murphy, Bernie Mac & Oprah Winfrey. In 2011, he was the voice of Buford the frog in Disney's 1st Black animated film \"The Princess and the Frog.\" He is also a voice on the \"Cleveland Show.\" Encouraged by motivational speaker Les Brown, Colyar has began his own \"Motivational Speaking\"...telling his incredible story of struggle and triumph to his audiences around the world while writing his soon to be released book \"Michael Goes Motivational.\" As well as Poetry Book for Adult Children \"Miss Innocent Goes To Kool Skool and Other Silly Stuff.\" In 2012, his passion project \"A Funny Thing Happened on the Way to the White House, I Knocked on the Door and a Black Man Answered\" will be released. It is a cutting edge documentary Mr. Colyar created, stars and produced about the historical importance, current success and the irrefutable cause for re-election of the President Obama administration.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjY5MTA1N15BMl5BanBnXkFtZTgwMTc2NDAyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0173485","name":"Michael Colyar","idIMDB":"nm0173485"},"actorId":"nm0173485","character":"Morris the Barber","urlCharacter":"http://www.imdb.com/character/ch0285727","main":true},{"actorName":"Marlon Wayans","urlProfile":"http://www.imdb.com/name/nm0005541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMDU2NDYyNTheQTJeQWpwZ15BbWU3MDYxNDYzMzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1972","placeOfBirth":" New York City, New York, USA","birthName":"Marlon L. Wayans","height":"6' 0½\" (1.84 m)","bio":"Marlon Wayans was born on July 23, 1972 in New York City, New York, USA as Marlon L. Wayans. He is an actor and writer, known for White Chicks (2004), Scary Movie 2 (2001) and Scary Movie (2000). He is married to Angelica Zackary. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMDU2NDYyNTheQTJeQWpwZ15BbWU3MDYxNDYzMzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005541","name":"Marlon Wayans","idIMDB":"nm0005541"},"actorId":"nm0005541","character":"Buster","urlCharacter":"http://www.imdb.com/character/ch0285733","main":true},{"actorName":"Alexis Rhee","urlProfile":"http://www.imdb.com/name/nm0722224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjY2OTU0MF5BMl5BanBnXkFtZTgwODMzMzkzNDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Alexis Rhee is an actress and director, known for Collision (2004), Norbit (2007) and Ray Donovan (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjY2OTU0MF5BMl5BanBnXkFtZTgwODMzMzkzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0722224","name":"Alexis Rhee","idIMDB":"nm0722224"},"actorId":"nm0722224","character":"Mrs. Ling Ling Wong","urlCharacter":"http://www.imdb.com/character/ch0285738","main":true}],"seasons":[],"idIMDB":"tt0477051","urlIMDB":"http://www.imdb.com/title/tt0477051","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$34,195,434","country":"USA","day":"11","month":"02","year":"2007","remarks":"3,136 Screens"},{"money":"£1,962,913","country":"UK","day":"11","month":"03","year":"2007","remarks":"368 Screens"},{"money":"$20,298","country":"Estonia","day":"22","month":"04","year":"2007","remarks":"2 Screens"},{"money":"€503,127","country":"Netherlands","day":"18","month":"03","year":"2007","remarks":"84 Screens"}],"gross":[{"money":"$95,323,496","country":"USA","day":"29","month":"04","year":"2007","remarks":""},{"money":"$95,102,566","country":"USA","day":"22","month":"04","year":"2007","remarks":""},{"money":"$94,570,382","country":"USA","day":"01","month":"04","year":"2007","remarks":""},{"money":"$92,438,806","country":"USA","day":"18","month":"03","year":"2007","remarks":""},{"money":"$88,295,349","country":"USA","day":"11","month":"03","year":"2007","remarks":""},{"money":"$82,905,396","country":"USA","day":"04","month":"03","year":"2007","remarks":""},{"money":"$74,763,394","country":"USA","day":"25","month":"02","year":"2007","remarks":""},{"money":"$62,011,840","country":"USA","day":"18","month":"02","year":"2007","remarks":""},{"money":"$34,195,434","country":"USA","day":"11","month":"02","year":"2007","remarks":""},{"money":"£5,538,186","country":"UK","day":"08","month":"04","year":"2007","remarks":""},{"money":"£5,120,072","country":"UK","day":"01","month":"04","year":"2007","remarks":""},{"money":"£3,597,096","country":"UK","day":"18","month":"03","year":"2007","remarks":""},{"money":"£1,962,913","country":"UK","day":"11","month":"03","year":"2007","remarks":""},{"money":"€546,434","country":"Netherlands","day":"18","month":"03","year":"2007","remarks":""}],"weekendGross":[{"money":"$170,972","country":"USA","day":"29","month":"04","year":"2007","remarks":"220 Screens"},{"money":"$201,685","country":"USA","day":"22","month":"04","year":"2007","remarks":"225 Screens"},{"money":"$293,733","country":"USA","day":"01","month":"04","year":"2007","remarks":"412 Screens"},{"money":"$2,766,593","country":"USA","day":"18","month":"03","year":"2007","remarks":"2,016 Screens"},{"money":"$4,278,099","country":"USA","day":"11","month":"03","year":"2007","remarks":""},{"money":"$6,398,696","country":"USA","day":"04","month":"03","year":"2007","remarks":""},{"money":"$9,825,021","country":"USA","day":"25","month":"02","year":"2007","remarks":"3,145 Screens"},{"money":"$19,929,662","country":"USA","day":"18","month":"02","year":"2007","remarks":"3,138 Screens"},{"money":"$34,195,434","country":"USA","day":"11","month":"02","year":"2007","remarks":"3,136 Screens"},{"money":"£114,847","country":"UK","day":"08","month":"04","year":"2007","remarks":"238 Screens"},{"money":"£294,819","country":"UK","day":"01","month":"04","year":"2007","remarks":"324 Screens"},{"money":"£1,069,030","country":"UK","day":"18","month":"03","year":"2007","remarks":"371 Screens"},{"money":"£1,962,913","country":"UK","day":"11","month":"03","year":"2007","remarks":"368 Screens"},{"money":"€503,127","country":"Netherlands","day":"18","month":"03","year":"2007","remarks":"84 Screens"}],"admissions":[{"money":"794,537","country":"Germany","day":"01","month":"04","year":"2007","remarks":""},{"money":"281,077","country":"Germany","day":"11","month":"03","year":"2007","remarks":""},{"money":"213,257","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"DreamWorks LLC"},"technical":{"runtime":["1 hr 42 min (102 min) (USA)","1 hr 41 min (101 min) (Philippines)","1 hr 43 min (103 min) (Argentina)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,818 m (Portugal, 35 mm)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.0","metascore":"27","filmingLocations":[{"location":"Agoura, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Achievement in Makeup","names":[{"name":"Rick Baker","id":"nm0000711","role":null},{"name":"Kazuhiro Tsuji","id":"nm0875308","role":null}]}]}]},{"award":"Alliance of Women Film Journalists 2007","titlesAwards":[{"titleAwardOutcome":"Won EDA Special Mention Award","categories":[{"category":"Hall of Shame","names":[]}]}]},{"award":"BET Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actor","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null},{"name":"Dreamgirls","id":"tt0443489","role":null}]}]}]},{"award":"Golden Schmoes Awards 2007","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Worst Movie of the Year","names":[]}]}]},{"award":"Kids' Choice Awards, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Male Movie Star","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null}]}]}]},{"award":"Oklahoma Film Critics Circle Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won OFCC Award","categories":[{"category":"Obviously Worst Film","names":[]}]}]},{"award":"Razzie Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Razzie Award","categories":[{"category":"Worst Actor of the Decade","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null},{"name":"The Adventures of Pluto Nash","id":"tt0180052","role":null},{"name":"I Spy","id":"tt0297181","role":null},{"name":"Imagine That","id":"tt0780567","role":null},{"name":"Meet Dave","id":"tt0765476","role":null},{"name":"Showtime","id":"tt0284490","role":null}]}]}]},{"award":"Razzie Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null}]},{"category":"Worst Supporting Actress","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null}]},{"category":"Worst Supporting Actor","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null}]}]},{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Picture","names":[]},{"category":"Worst Actor","names":[{"name":"Cuba Gooding Jr.","id":"nm0000421","role":null},{"name":"Daddy Day Camp","id":"tt0462244","role":null}]},{"category":"Worst Screen Couple","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null}]},{"category":"Worst Director","names":[{"name":"Brian Robbins","id":"nm0005367","role":null}]},{"category":"Worst Screenplay","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null},{"name":"Charlie Murphy","id":"nm0614151","role":null},{"name":"Jay Scherick","id":"nm0771065","role":null},{"name":"David Ronn","id":"nm0740115","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won WFCC Award","categories":[{"category":"Most Offensive Male Character","names":[]},{"category":"Hall of Shame","names":[{"name":"Eddie Murphy","id":"nm0000552","role":null}]}]}]}],"votes":"55,306","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040938","name":"DreamWorks"},{"idCompany":"co0022730","name":"Davis Entertainment"},{"idCompany":"co0099647","name":"Tollin/Robbins Productions"}],"keywords":{"keywords":["woman","orphan","obnoxiousness","woman played by man","urine","family conflict","thinness","forename as title","one word title","man with glasses","anti semitism","misogyny","buxom","cross dressing","black american","2000s","blooper reel","bully comeuppance","wimp turns tough","wimp","wife tries to murder husband","regression","procurer","scatological humor","chased down a street","cellulite","childhood crush","characters from different time periods","drug reference","wedding cake","street gangster","street prostitution","water park","toilet","chinese stereotype","bicycle accident","bathtub","bubble butt","fat insult","fat child","washing a car","sliding","making fun of fat people","black caricature","black prostitute","sulphuric acid","african american","female flatulence","black villainess","submissive husband","stripper pole","bikini","lovely lady","dog hit by a car","large lady","large wife small husband","large buttocks","morbid obesity","evil woman","faked pregnancy","talking dog","gospel singing","turnstile","baby left on a doorstep","wetting oneself","pimping","big butt humor","big booty","chinaman","smut","woman hitting man","big belly","harpoon","bikini wax","fart joke","sitting on a toilet","child abandonment","restaurant","overweight","overbearing wife","love triangle","gold digger","dream girl","domestic violence","dog","courage","childhood sweetheart","hall","wedding ceremony gone awry","whaler","weight","puppet","lollipop","chinese","fat suit","wilhelm scream","water slide","pressure","pimp","forced marriage","obesity","actor playing multiple roles","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:18:34"}}