{"data":{"movies":[{"title":"Surveillance","originalTitle":"","year":"2008","releaseDate":"20080730","directors":[{"name":"Jennifer Lynch","id":"nm0528337"}],"writers":[{"name":"Kent Harper","id":"nm1092088"},{"name":"Jennifer Lynch","id":"nm0528337"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmU2YzJhZTctNmZmNS00OGNlLWIzODctMmYxMTQ1MzRmYjZkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA","Germany","Canada"],"languages":["English"],"genres":["Crime","Drama","Horror","Mystery","Thriller"],"plot":"Grisly murders occur in a small town. Two FBI agents arrive, set up their cameras in three interview rooms, and set up interviews of three survivors: a girl of about nine, a foul-mouthed cop with a bandaged hand, and a young woman of about 20 who uses drugs. Each tells their story as the male FBI agent listens and watches from a separate room: the girl draws for and talks to the female agent, the local chief interviews the injured cop, and two officers interview the young woman. As they tell their stories, some of which are inaccurate and self-serving, we see what actually happened the day before. Can the agents or anyone else put the pieces together?","simplePlot":"Two FBI agents attempt to clarify the murders occurring in a desolate region. They approach the witnesses of the latest incident with the help of the local police. All of them hide something and all have wildly different stories to tell.","actors":[{"actorName":"Caroline Aaron","urlProfile":"http://www.imdb.com/name/nm0000715","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkyNTYxOF5BMl5BanBnXkFtZTcwNjE1OTI0Mw@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1952","placeOfBirth":" Richmond, Virginia, USA","birthName":"Caroline Sidney Abady","bio":"Caroline Aaron was born August 7, 1952 in Richmond, Virgnia. She attended American University in Washington, D.C., and studied performing arts. She made her debut film appearance in Robert Altman's Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean (1982). Since her debut in film, Caroline has made several appearances in both television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkyNTYxOF5BMl5BanBnXkFtZTcwNjE1OTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000715","name":"Caroline Aaron","idIMDB":"nm0000715"},"actorId":"nm0000715","character":"Janet","urlCharacter":"http://www.imdb.com/character/ch0457767","main":true},{"actorName":"Hugh Dillon","urlProfile":"http://www.imdb.com/name/nm0227003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTc3YzIzMmYtYmE4Zi00MTk5LWExYzQtZjI3ZDMwNGQyMGU0L2ltYWdlXkEyXkFqcGdeQXVyNTMwMzQ3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1963","placeOfBirth":" Kingston, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Combining acting with a distinguished career as a singer songwriter, Hugh Dillon earned notoriety as the lead singer in the multi-platinum punk rock band, the Headstones. It was early on in the band's success when Hugh caught the attention of legendary filmmaker Bruce McDonald (Highway 61, Roadkill). Bruce cast Hugh in Dance Me Outside in 1994. Next came his critically acclaimed lead performance as Joe Dick, in McDonald's 1996 feature film, Hard Core Logo. Quentin Tarantino saw it at the South by Southwest Film Festival in Austin, TX and decided on the spot to distribute the movie through his company Rolling Thunder, bringing international attention to the indie classic and its lead actor. In 2004, Debra Granik (Winter's Bone) cast Hugh to star opposite Vera Farmiga (The Departed, Up in the Air) in the Sundance Film Festival award-winning movie, Down To The Bone. Hugh's ability to capture honest and realistic portrayals of complicated characters has been his calling card. In 2007, the Gemini/CSA winning actor scored the lead role as Mike Sweeney in the dark and twisted serial Durham County (The Movie Network), which lead to his breakout role as Ed Lane in CBS and CTV's Flashpoint, which aired its fifth season in late 2012. In early 2013, Dillon joined the cast of AMC's The Killing, as Francis Becker, going head to head with Peter Sarsgaard. He simultaneously portrayed a mysterious CEO on the second season of Showcase's sensational sci-fi police drama Continuum (Syfy US and UK). In 2014, Hugh joined the cast of the DirecTV series Things You Shouldn't Say Past Midnight, based on the play by Peter Ackerman. He followed that up with CBC's wartime drama X Company, based upon the real events of Canadian spy school Camp X during World War II, airing on CBC. Following a celebrated return to the stage with the Headstones, 2012 saw Dillon back in the studio, recording their first album in 10 years, Love + Fury. Their single longwaytoneverland skyrocketed to #1 on Active Rock Radio. The album debuted at #7 in its first week, the band's first Top 10 release. Feeding off of their passionate fans, the band quickly went to work on their latest album One In The Chamber Music, released late 2014 on Universal Music and via crowd-funding platform PledgeMusic. Their latest offering is a compilation of new tracks and re-worked favorites from their catalogue, scoring them 301% of their PledgeMusic funding goal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTc3YzIzMmYtYmE4Zi00MTk5LWExYzQtZjI3ZDMwNGQyMGU0L2ltYWdlXkEyXkFqcGdeQXVyNTMwMzQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0227003","name":"Hugh Dillon","idIMDB":"nm0227003"},"actorId":"nm0227003","character":"Dad","urlCharacter":"http://www.imdb.com/character/ch0457766","main":true},{"actorName":"David Gane","urlProfile":"http://www.imdb.com/name/nm3590146","urlPhoto":"","biography":{"bio":"David Gane is an actor, known for Surveillance (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3590146","name":"David Gane","idIMDB":"nm3590146"},"actorId":"nm3590146","character":"Grocery Man","urlCharacter":"http://www.imdb.com/character/ch0457765","main":true},{"actorName":"Gill Gayle","urlProfile":"http://www.imdb.com/name/nm0310887","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzI4MjA2MV5BMl5BanBnXkFtZTgwNDM4NjgyMTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"Thomas Gill Gayle IV","height":"5' 8\" (1.73 m)","bio":"Gill Gayle was born as Thomas Gill Gayle IV. He is known for his work on Shut Yer Dirty Little Mouth (2001), Surveillance (2008) and Deadwood (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzI4MjA2MV5BMl5BanBnXkFtZTgwNDM4NjgyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0310887","name":"Gill Gayle","idIMDB":"nm0310887"},"actorId":"nm0310887","character":"Officer Degrasso","urlCharacter":"http://www.imdb.com/character/ch0457764","main":true},{"actorName":"Kent Harper","urlProfile":"http://www.imdb.com/name/nm1092088","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTEwMDUwM15BMl5BanBnXkFtZTgwNTk1NTI2OTE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Kent Harper is an American Actor, Writer, Director, Producer with multiple award nominations and wins that grew up in Newport Beach, California. He started his journey in the film industry in 1994. He began to work on films in every position as he assisted in each department to further his knowledge in every aspect. After accumulating experience in all areas he went on to assist producers personally to further his expertise. In the midst of this Mr. Harper began his intense study of acting to expand his passion for acting. He studied for six years in a multitude of acting techniques and styles to perfect his art and apply it to his overall knowledge of his serious career. His studies included, \"Stanislavsky\", \"Strasberg\", \"Uta Hagen\", Improvisation and accents/dialects, which he then started to apply to film as he began to act in short films and features. Kent then began to write screenplays to further push his skill forward. Mr. Harper presently presides over his production company, \"Film Star Pictures\", which he established in 1995. He has relationships with a multitude of significant studios, producers and agencies. He has recently acted in multiple features, 16 short films and a pilot. He's written sixteen screenplays and numerous short films. Harper then acted in and produced three short films including, \"Kung-fu Cowboys, \"Some of an Equation,\" (Earning him a nomination for \"Best Actor,\" at Action on Film Festival) \"You Always Stalk the Ones you love\" Starring James Franco and Scott Caan,\" and \"Handicap City\" which he produced with Jennifer Lynch (\"Surveillance\")... In 2006 Kent produced the feature film \"Statistics\" which he acted in as one of the lead roles which earned him \"Best Performance\" at the \"Silver Lake International Film Festival.\" The film also won the \"Audience Award and was nominated and won awards at ten different festivals around the world. It was just released on DVD in December \"08. Shortly after at the end of '07. Kent and his company Film Star Pictures went on to produced \"Paper Dolls\" and acted in one of the supporting roles. Kent Harper and Film Star Pictures went on in 2008 to produce the multiple award winning film,\"Surveillance\" with acclaimed director David Lynch, (\"Elephant Man\",\"Twin Peaks\", Blue Velvet.\") \"Surveillance\" is a twisted psychological crime thriller with an unpredictable twist. He also co-wrote the film with Jennifer Lynch(\"Boxing Helena\") Kent acted in a lead roll in the picture with Bill Pullman, Julia Ormond, French Stewert, and Michael Ironside. The film was screened at the 2008 Cannes Film Festival and won \"Best Picture\" at the \"Sitges International Film Festival in Spain among awards at other festivals. It has distribution and is being released in theaters all over the UK. In March of '09. It was released in theaters in the U.S. in 2009 through Magnet. Presently, Harper is about to direct, a screenplay he penned, \"A Blast of Sunlight Explodes,\" which he's also producing, as well as starring in as the main lead. The film is based upon his actual experiences in his quest for the meaning of life. Melding quantum physics and spirituality. Kent Harper then is set to direct 3 other projects that he wrote starting with, \"Karma,\" \"The Descendants of Filth\" and \"Lost in Utopia\" which he also will produce and act in as well... Harper is currently in the midst of producing 10 more films in development including the twisted horror film, \"The Script\", \"Man Against Man\", \"Whispers of the Damned\", among others...","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTEwMDUwM15BMl5BanBnXkFtZTgwNTk1NTI2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1092088","name":"Kent Harper","idIMDB":"nm1092088"},"actorId":"nm1092088","character":"Officer Jack Bennett","urlCharacter":"http://www.imdb.com/character/ch0457763","main":true},{"actorName":"Michael Ironside","urlProfile":"http://www.imdb.com/name/nm0000461","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NTg3MDYyM15BMl5BanBnXkFtZTgwMDk0ODc3ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1950","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Frederick Reginald Ironside","height":"5' 9½\" (1.77 m)","bio":"Michael Ironside has made a strong and indelible impression with his often incredibly intense and explosive portrayals of fearsome villains throughout the years. He was born as Frederick Reginald Ironside on February 12, 1950 in Toronto, Ontario, Canada. Ironside was a successful arm wrestler in his teenage years. His initial ambition was to be a writer. At age fifteen, Michael wrote a play called \"The Shelter\" that won first prize in a Canada-wide university contest; He used the prize money to mount a production of this play. Ironside attended the Ontario College of Art, took acting lessons from Janine Manatis, and studied for three years at the Canadian National Film Board. Ironside worked in construction as a roofer prior to embarking on an acting career. Ironside first began acting in movies in the late 1970s. He received plenty of recognition with his frightening turn as deadly and powerful psychic Darryl Revok in David Cronenberg's Scanners (1981). He was likewise very chilling as vicious misogynistic psychopath Colt Hawker in the underrated Terreur à l'hôpital central (1982). Other memorable film roles include weary Detective Roersch in the sadly forgotten thriller Cross Country (1983), the crazed Overdog in the immensely enjoyable Spacehunter: Adventures in the Forbidden Zone (1983), the hard-nosed Jester in the blockbuster smash Top Gun (1986), ramrod Major Paul Hackett in Extreme Prejudice (1987), loner Vietnam veteran \"Ben\" in Nowhere to Hide (1987), the ferocious Lem Johnson in Watchers (1988), and lethal immortal General Katana in Highlander II: The Quickening (1991). Moreover, Ironside has appeared in two highly entertaining science fiction features for Paul Verhoeven: At his savage best as the evil Richter in Total Recall (1990) and typically excellent as the rugged Lieutenant Jean Rasczak in Starship Troopers (1997). Ironside showed a more tender and thoughtful side with his lovely and touching performance as a hardened convict who befriends a disabled man in the poignant indie drama gem Chaindance (1991); he also co-wrote the script and served as an executive producer for this beautiful sleeper. Michael was terrific as tough mercenary Ham Tyler on the epic miniseries V (1984), its follow up V: The Final Battle (1984), and subsequent short-lived spin-off series. Ironside also had a recurring role on the television series SeaQuest 2032 (1993). Among the television series he has done guest spots on are The A-Team (1983), Hill Street Blues (1981), The New Mike Hammer (1984), Deadly Nightmares (1983), Tales from the Crypt (1989), Superman (1996), Walker, Texas Ranger (1993), Au-delà du réel - l'aventure continue (1995), ER (1994), Smallville (2001), ER (1994), Desperate Housewives (2004), Justice League (2001) and Masters of Horror (2005). More recently, Ironside garnered a slew of plaudits and a Gemini Award nomination for his outstanding portrayal of shrewd biker gang leader Bob Durelle in the acclaimed Canadian miniseries The Last Chapter II: The War Continues (2003). In addition to his substantial film and television work, Ironside has also lent his distinctive deep voice to TV commercials and video games.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NTg3MDYyM15BMl5BanBnXkFtZTgwMDk0ODc3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000461","name":"Michael Ironside","idIMDB":"nm0000461"},"actorId":"nm0000461","character":"Captain Billings","urlCharacter":"http://www.imdb.com/character/ch0081607","main":true},{"actorName":"Pell James","urlProfile":"http://www.imdb.com/name/nm1169819","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDE4NTgzN15BMl5BanBnXkFtZTYwOTA3MTc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1977","placeOfBirth":" Virginia, USA","height":"5' 4\" (1.63 m)","bio":"Pell James was born on April 30, 1977 in Virginia, USA. She is an actress and producer, known for Zodiac (2007), The Lincoln Lawyer (2011) and Undiscovered (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDE4NTgzN15BMl5BanBnXkFtZTYwOTA3MTc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1169819","name":"Pell James","idIMDB":"nm1169819"},"actorId":"nm1169819","character":"Bobbi Prescott","urlCharacter":"http://www.imdb.com/character/ch0457762","main":true},{"actorName":"Daryl Haney","urlProfile":"http://www.imdb.com/name/nm0353038","urlPhoto":"","biography":{"dateOfBirth":"21 June 1963","placeOfBirth":" Charlottesville, Virginia, USA","height":"6' 2\" (1.88 m)","bio":"Daryl Haney was born on June 21, 1963 in Charlottesville, Virginia, USA. He is a writer and actor, known for Friday the 13th Part VII: The New Blood (1988), Mockingbird Don't Sing (2001) and Life Among the Cannibals (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0353038","name":"Daryl Haney","nicknames":["Duke"],"idIMDB":"nm0353038"},"actorId":"nm0353038","character":"Drug Dealer","urlCharacter":"http://www.imdb.com/character/ch0457760","main":true},{"actorName":"Shannon Jardine","urlProfile":"http://www.imdb.com/name/nm1266084","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2NTg2MDY3Ml5BMl5BanBnXkFtZTgwODY0OTcxNjE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"bio":"Shannon Jardine is an actress and producer, known for Surveillance (2008), Chained (2012) and Walled In (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2NTg2MDY3Ml5BMl5BanBnXkFtZTgwODY0OTcxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1266084","name":"Shannon Jardine","idIMDB":"nm1266084"},"actorId":"nm1266084","character":"Elaine Meyer","urlCharacter":"http://www.imdb.com/character/ch0457759","main":true},{"actorName":"Angela Lamarsh","urlProfile":"http://www.imdb.com/name/nm3590440","urlPhoto":"","biography":{"bio":"Angela Lamarsh is an actress, known for Surveillance (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3590440","name":"Angela Lamarsh","idIMDB":"nm3590440"},"actorId":"nm3590440","character":"Maid","urlCharacter":"http://www.imdb.com/character/ch0457758","main":true},{"actorName":"Gerald Lenton-Young","urlProfile":"http://www.imdb.com/name/nm0502278","urlPhoto":"","biography":{"bio":"Gerald Lenton-Young is known for his work on Surveillance (2008), Skipped Parts (2000) and Try to Remember (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0502278","name":"Gerald Lenton-Young","idIMDB":"nm0502278"},"actorId":"nm0502278","character":"Coroner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Miles","urlProfile":"http://www.imdb.com/name/nm1751416","urlPhoto":"","biography":{"bio":"Jennifer Miles is an actress, known for Surveillance (2008), I'll Be Seeing You (2004) and Mon plus beau souhait (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1751416","name":"Jennifer Miles","idIMDB":"nm1751416"},"actorId":"nm1751416","character":"TV Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mac Miller","urlProfile":"http://www.imdb.com/name/nm2632524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ4MDMzMjI2N15BMl5BanBnXkFtZTgwNjE4MjUxMzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Mac Miller is an actor, known for Surveillance (2008), This Girl's Life (2003) and Lit Horror 90 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ4MDMzMjI2N15BMl5BanBnXkFtZTgwNjE4MjUxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2632524","name":"Mac Miller","idIMDB":"nm2632524"},"actorId":"nm2632524","character":"Johnny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlie Newmark","urlProfile":"http://www.imdb.com/name/nm0628331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1ODUwODc5NV5BMl5BanBnXkFtZTgwMDczOTM5OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Charlie Newmark grew up in New Jersey and began acting professionally after he was cast to play Will in the feature film Lord of the Flies. Following the films release Charlie went on to do a string of national commercials and was lucky to be able to work with the great Phil Hartman (I), who gave Charlie great advice about the industry and the importance of his education. Whereas most child actors would love to catch a success streak like this and run with it, Charlie all but dropped out of the race to attend boarding school in Massachusetts. Nevertheless on summer break from his studies, he was cast as Spencer Jones in the ABC television pilot, Miss Jones starring opposite Christine Ebersole. After completing the pilot and studying theatre at boarding school, Charlie pursued his degree in business and once again was pulled back in front of the camera when he was cast opposite Chloë Sevigny by Steve Buscemi for Steve's directorial debut film Trees Lounge. After filming was complete Director Frank Oz cast him in the movie In & Out with Kevin Kline. Charlie then went on to study acting with William Esper at his New York studio. After completing class he packed up and moved to Hollywood. Not long after he arrived in Los Angeles he met with Fran Drescher who cast him in her new MTV pilot Daytrippers starring Dawn Wells and Burke Roberts. It was here that he teamed up with writer/director Roberts and decided to try his hand at producing. With his background and education in business, Charlie executive produced his first film, Handicap City which screened in the Shorts Corner at Cannes Film Festival in 2006. Handicap City quickly gained cult and fine art credibility all over the world. From hundreds of screenings all around the U.S. to well received and critically acclaimed presentations at fine art galleries and festivals including Mama Showroom (Art Rotterdam) The Horse Hospital (London), 8mm (Berlin), and many more. With the success and momentum of their first film, Newmark and Roberts followed up with the equally successful Insult to Injury which is now subtitled in four different languages and in 2007 completed a 10 city European tour. Both of these films are still being screened in galleries throughout Germany, France, London and Barcelona and continue to screen in The U.S. as well. While navigating the ropes of production and between traveling with his films, Newmark studied acting at the renowned William Alderson Studios. In 2008 Charlie went in front of the camera once again. He began early in the year by acting in a few shorts and was soon cast in Jennifer Lynch new film 'Surveillance' starring Bill Pullman, Julia Ormond, and Pell James which premiered in 2008 at Cannes Film Festival. Charlie splits his time between Los Angeles and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1ODUwODc5NV5BMl5BanBnXkFtZTgwMDczOTM5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0628331","name":"Charlie Newmark","idIMDB":"nm0628331"},"actorId":"nm0628331","character":"Officer Wright","urlCharacter":"http://www.imdb.com/character/ch0088718","main":true},{"actorName":"Julia Ormond","urlProfile":"http://www.imdb.com/name/nm0000566","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjU1NzQ2OF5BMl5BanBnXkFtZTgwNzYxODgzMTI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1965","placeOfBirth":" Epsom, Surrey, England, UK","birthName":"Julia Karin Ormond","height":"5' 7½\" (1.71 m)","bio":"The dark and classically beautiful British actress Julia Ormond was born into privileged surroundings as the daughter of a well-to-do laboratory technician. Her parents divorced when she was young; she was the second of five children. She attended Cranleigh, a private school, and showed interest in theatrics way back then. Her grandparents were artists, and she initially intended to be one herself, but after one year of art school, she renewed her dedication to acting and transferred to Webber-Douglas Academy of Dramatic Art, where she graduated in 1988. She subsequently appeared in the play \"Wuthering Heights\" as Catherine, where she met her Heathcliff both onstage and in real life, actor Rory Edwards. In 1989 she won the London Drama Critic's Award for her performance in \"Faith, Hope and Charity\" as \"best newcomer.\" Her marriage to actor Edwards, who also appeared with her in the TV-movie Young Catherine (1991), in which she played Catherine the Great, dissipated in 1994. In the meantime she slowly built up her reputation as a fine actress with the films The Baby of Mâcon (1993) and Captives (1994), but Hollywood finally took notice with her lauded support role in Legends of the Fall (1994) opposite Brad Pitt. As a result of this, she was practically handed Audrey Hepburn's role in the revival of Sabrina (1995), stealing the picture from co-star Harrison Ford. She has since continued to glow in such international pictures as Smilla's Sense of Snow (1997), Le barbier de Sibérie (1998) [The Barber of Siberia] and Resistance (2003), and in such TV mini-series showcases as Iron Jawed Angels (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjU1NzQ2OF5BMl5BanBnXkFtZTgwNzYxODgzMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000566","name":"Julia Ormond","idIMDB":"nm0000566"},"actorId":"nm0000566","character":"Elizabeth Anderson","urlCharacter":"http://www.imdb.com/character/ch0080576","main":true}],"seasons":[],"idIMDB":"tt0409345","urlIMDB":"http://www.imdb.com/title/tt0409345","business":{"budget":{"money":"$3,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,590","country":"USA","day":"28","month":"06","year":"2009","remarks":"2 Screens"},{"money":"£125,885","country":"UK","day":"08","month":"03","year":"2009","remarks":"182 Screens"}],"gross":[{"money":"$27,349","country":"USA","day":"22","month":"09","year":"2013","remarks":""},{"money":"$25,352","country":"USA","day":"26","month":"07","year":"2009","remarks":""},{"money":"$20,017","country":"USA","day":"19","month":"07","year":"2009","remarks":""},{"money":"$14,352","country":"USA","day":"12","month":"07","year":"2009","remarks":""},{"money":"$11,045","country":"USA","day":"05","month":"07","year":"2009","remarks":""},{"money":"$4,590","country":"USA","day":"28","month":"06","year":"2009","remarks":""},{"money":"£125,885","country":"UK","day":"08","month":"03","year":"2009","remarks":""},{"money":"$1,115,493","country":"worldwide","day":"22","month":"09","year":"2013","remarks":""}],"weekendGross":[{"money":"$3,426","country":"USA","day":"26","month":"07","year":"2009","remarks":"2 Screens"},{"money":"$4,583","country":"USA","day":"19","month":"07","year":"2009","remarks":"1 Screen"},{"money":"$1,406","country":"USA","day":"12","month":"07","year":"2009","remarks":"2 Screens"},{"money":"$3,503","country":"USA","day":"05","month":"07","year":"2009","remarks":"3 Screens"},{"money":"$4,590","country":"USA","day":"28","month":"06","year":"2009","remarks":"2 Screens"},{"money":"£125,885","country":"UK","day":"08","month":"03","year":"2009","remarks":"182 Screens"}],"admissions":[{"money":"371","country":"Netherlands","day":"31","month":"12","year":"2009","remarks":""}],"productionDates":{"money":null,"country":null,"day":"05","month":"02","year":"2007","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"23","month":"04","year":"2007","remarks":null},null],"copyrightHolder":"(2007) See Film Inc."},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Cité Lab, Canada (film laboratory)","Vision Globale, Montreal, Canada (post-production)"],"filmLength":["2,680 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.4","metascore":"31","filmingLocations":[{"location":"Canada Saskatchewan Production Studios, Regina, Saskatchewan, Canada"}],"rated":"R","awards":[{"award":"Chicago International Film Festival 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Gold Hugo","categories":[{"category":"After Dark Competition","names":[{"name":"Jennifer Lynch","id":"nm0528337","role":"director"}]}]}]},{"award":"Fangoria Chainsaw Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"French Stewart","id":"nm0829390","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Ryan Simpkins","id":"nm1364532","role":null}]},{"category":"Best Screenplay","names":[{"name":"Jennifer Lynch","id":"nm0528337","role":null},{"name":"Kent Harper","id":"nm1092088","role":null}]}]}]},{"award":"New York City Horror Film Festival 2008","titlesAwards":[{"titleAwardOutcome":"Won Best Actress","categories":[{"category":"","names":[{"name":"Ryan Simpkins","id":"nm1364532","role":null}]}]},{"titleAwardOutcome":"Won Best Director","categories":[{"category":"","names":[{"name":"Jennifer Lynch","id":"nm0528337","role":null}]}]}]},{"award":"Sitges - Catalonian International Film Festival 2008","titlesAwards":[{"titleAwardOutcome":"Won Best Film","categories":[{"category":"","names":[{"name":"Jennifer Lynch","id":"nm0528337","role":null}]}]}]}],"votes":"15,175","type":"Movie","companyCreditsSimple":[{"idCompany":"co0183386","name":"Lago Film"},{"idCompany":"co0237815","name":"See Film"},{"idCompany":"co0131046","name":"Film Star Pictures"}],"keywords":{"keywords":["video surveillance","interview","fbi agent","police","murder","motel","bandaged hand","gore","serial killer","police station","f rated","vomiting","blood splatter","title directed by female","nebraska","polaroid camera","shot in the arm","shot in the stomach","strangled with a belt","knocked out","shot in the head","shot to death","cigarette smoking","photograph","death of stepfather","police officer shot","crushed by a car","finger gun","van","portable television","mother son relationship","mother daughter relationship","gun in mouth","face slap","woman slaps a man","abuse of power","urination","character repeating someone else's dialogue","drawing","held at gunpoint","sniper rifle","news report","home invasion","family vacation","lying","deception","bloody footprint","pistol","nonlinear timeline","impersonating a police officer","reference to jeffrey dahmer","slow motion scene","corpse","police captain","written by director","scene during opening credits","bare chested male","masked woman","child witness","crime scene photograph","screaming in fear","running for your life","lesbian kiss","masked man","flat tire","target shooting","corrupt cop","cocaine","video camera","flashback","crime investigation","hyperrealism","death of brother","characters killed one by one","witness","shooting out tire","psychopath","police officer killed","murder of family","maniac","interrogation","insanity","drug use","drug overdose","drug addict","death by strangulation","crushed to death","car crash","blood","one word title","violence","sadist","sadism","dumb cop","death","torture","singing in a car","shot in the chest","child in peril","female fbi agent","accidental killing","death of friend","death of mother","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:57:28"}}