{"data":{"movies":[{"title":"Lucky Number Slevin","originalTitle":"","year":"2006","releaseDate":"20060407","directors":[{"name":"Paul McGuigan","id":"nm0006476"}],"writers":[{"name":"Jason Smilovic","id":"nm1429512"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjczMWI1YWMtYTZjOS00ZDc5LWE2MWItMTY3ZGUxNzFkNjJmL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1.jpg","countries":["Germany","USA"],"languages":["English"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"In an airport waiting room, a man in a wheelchair tells a stranger a story about a fixed horse race in 1979 that resulted in a family's deaths. In Manhattan, two bookies and the son of a Mob boss die. A young man just out of the shower answers the door to a neighbor woman and explains that he's visiting, has had a bad week, including being mugged, and doesn't know where his pal, who lives there, is. The neighbor is chatty; she's a coroner. Two thugs arrive and, believing the visitor to be the guy who lives there, take him to see the boss with the dead son, who tells him to kill the son of his Mob rival. Mistaken identity? What connects the threads? Cops are watching.","simplePlot":"A case of mistaken identity lands Slevin into the middle of a war being plotted by two of the city's most rival crime bosses: The Rabbi and The Boss. Slevin is under constant surveillance by relentless Detective Brikowski as well as the infamous assassin Goodkat and finds himself having to hatch his own ingenious plot to get them before they get him.","actors":[{"actorName":"Josh Hartnett","urlProfile":"http://www.imdb.com/name/nm0001326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjg0Mzc1OV5BMl5BanBnXkFtZTcwODI3MzA2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1978","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Joshua Daniel Hartnett","height":"6' 3\" (1.91 m)","bio":"Joshua Daniel Hartnett was born in Saint Paul, Minnesota, to Wendy Anne (Kronstedt) and Daniel Thomas Hartnett, a building manager. His father is of Irish and German descent, and his mother is of Swedish and Norwegian ancestry. Hartnett graduated from South High School in Minneapolis in June of 1996, then attended SUNY Purchase in New York. By April of 1997, he was offered the role of Michael Fitzgerald in the short-lived American television series Cracker: Mind Over Murder (1997). Josh started off doing small plays and national commercials, but broke into the big-screen movie business with his starring roles in Halloween H20: 20 Years Later (1998), The Faculty (1998), and Pearl Harbor (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjg0Mzc1OV5BMl5BanBnXkFtZTcwODI3MzA2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001326","name":"Josh Hartnett","idIMDB":"nm0001326"},"actorId":"nm0001326","character":"Slevin Kelevra","urlCharacter":"http://www.imdb.com/character/ch0305826","main":true},{"actorName":"Bruce Willis","urlProfile":"http://www.imdb.com/name/nm0000246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Idar-Oberstein, West Germany","birthName":"Walter Bruce Willis","height":"6' (1.83 m)","bio":"Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts. Walter Bruce Willis was born on March 19, 1955, in Idar-Oberstein, West Germany, to a German mother, Marlene K. (from Kassel), and an American father, David Andrew Willis (from Carneys Point, New Jersey), who were then living on a United States military base. His family moved to the U.S. shortly after he was born, and he was raised in Penns Grove, New Jersey, where his mother worked at a bank and his father was a welder and factory worker. Willis picked up an interest for the dramatic arts in high school, and was allegedly \"discovered\" whilst working in a café in New York City and then appeared in a couple of off-Broadway productions. While bartending one night, he was seen by a casting director who liked his personality and needed a bartender for a small movie role. After countless auditions, Willis contributed minor film appearances, usually uncredited, before landing the role of private eye \"David Addison\" alongside sultry Cybill Shepherd in the hit romantic comedy television series Moonlighting (1985). The series firmly established Bruce Willis as a hot new talent, and his sarcastic and wisecracking P.I. was in effect a dry run for the role of hard-boiled NYC detective \"John McClane\" in the monster hit Die Hard (1988). This superbly paced action film balanced laconic humor and wholesale destruction as Willis' character single handedly battles a gang of ruthless international thieves in a Los Angeles skyscraper. Willis reprized the role of tough guy cop \"John McClane\" in the eagerly anticipated sequel Die Hard 2 (1990) set at snowbound Washington's Dulles International Airport as a group of renegade Special Forces soldiers seek to repatriate a corrupt South American general. Excellent box office returns demanded a further sequel Die Hard with a Vengeance (1995) this time also starring Samuel L. Jackson as a cynical Harlem shopowner unwittingly thrust into assisting McClane during a terrorist bombing campaign on a sweltering day in NYC. Willis found time out from all the action mayhem to provide the voice of \"Mikey\" the baby in the very popular family comedies Look Who's Talking (1989), and its sequel Look Who's Talking Too (1990) also starring John Travolta and Kirstie Alley. Over the next decade, Willis starred in some very successful films, some very offbeat films and some unfortunate box office flops. The Bonfire of the Vanities (1990) and Hudson Hawk (1991) were both large scale financial disasters that were savaged by the critics, and both are arguably best left off the CVs of all the actors involved, however Willis was still popular with movie audiences and selling plenty of theatre tickets with the hyperviolent The Last Boy Scout (1991), the darkly humored Death Becomes Her (1992) and the mediocre police thriller Striking Distance (1993). During the 1990s, Willis also appeared in several independent and low budget productions that won him new fans and praise from the critics for his intriguing performances working with some very diverse film directors. He appeared in the oddly appealing North (1994), as a cagey prizefighter in the Quentin Tarantino directed mega-hit Pulp Fiction (1994), the Terry Gilliam directed apocalyptic thriller Twelve Monkeys (1995), the Luc Besson directed sci-fi opus The Fifth Element (1997) and the M. Night Shyamalan directed spine-tingling epic The Sixth Sense (1999). Willis next starred in the gangster comedy The Whole Nine Yards (2000), worked again with \"hot\" director M. Night Shyamalan in the less gripping Unbreakable (2000), and in two military dramas, Hart's War (2002) and Tears of the Sun (2003) that both failed to really fire with movie audiences or critics alike. However, Willis bounced back into the spotlight in the critically applauded Frank Miller graphic novel turned movie Sin City (2005), the voice of \"RJ\" the scheming raccoon in the animated hit Over the Hedge (2006) and \"Die Hard\" fans rejoiced to see \"John McClane\" return to the big screen in the high tech Live Free or Die Hard (2007) aka \"Die Hard 4.0\". Willis was married to actress Demi Moore for approximately thirteen years and they share custody to their three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000246","name":"Bruce Willis","nicknames":["Bruno"],"idIMDB":"nm0000246"},"actorId":"nm0000246","character":"Mr. Goodkat","urlCharacter":"http://www.imdb.com/character/ch0006948","main":true},{"actorName":"Lucy Liu","urlProfile":"http://www.imdb.com/name/nm0005154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxODE0MjI5Ml5BMl5BanBnXkFtZTcwMjkxMzMzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1968","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Lucy Alexis Liu","height":"5' 3\" (1.6 m)","bio":"Born to immigrants in Queens, New York, Lucy Liu has always tried to balance an interest in her cultural heritage with a desire to move beyond a strictly Asian-American experience. Lucy's mother, Cecilia, a biochemist, is from Beijing, and her father, Tom Liu, a civil engineer, is from Shanghai. Once relegated to \"ethnic\" parts, the energetic actress is finally earning her stripes as an across-the-board leading lady. Liu graduated from Stuyvesant High School in 1986 and enrolled in New York University; discouraged by the \"dark and sarcastic\" atmosphere of NYU, however, she transferred to the University of Michigan after her freshman year. She graduated from UM with a degree in Chinese Language and Culture, managing to squeeze in some additional training in dance, voice, fine arts, and acting. During her senior year, Liu auditioned for a small part in a production of Alice in Wonderland and walked away with the lead; encouraged by the experience, she decided to take the plunge into professional acting. She moved to Los Angeles and split her time between auditions and food service day jobs, eventually scoring a guest appearance as a waitress on Beverly Hills, 90210 (1990). That performance led to more walk-on parts in shows like NYPD Blue (1993), ER (1994), and The X-Files (1993). In 1996, she was cast as an ambitious college student on Rhea Perlman's ephemeral sitcom Pearl (1996). Liu first appeared on the big screen as an ex-girlfriend in Jerry Maguire (1996) (she had previously filmed a scene in the indie Bang (1995), but it was shelved for two years). She then waded through a series of supporting parts in small films before landing her big break on Ally McBeal (1997). Liu initially auditioned for the role of Nelle Porter, which went to Portia de Rossi, but writer-producer David E. Kelley was so impressed with her that he promised to write a part for her in an upcoming episode. The part turned out to be that of growling, ill-tempered lawyer Ling Woo, which Liu filled with such aplomb that she was signed on as a regular cast member. The \"Ally\" win gave Liu's film career a much-needed boost--in 1999, she was cast as a dominatrix in the Mel Gibson action flick Payback (1999), and as a hitchhiker in the ill-received boxing saga Play It to the Bone (1999). The next year brought even larger roles: first as the kidnapped Princess Pei Pei in Jackie Chan's western Shanghai Noon (2000), then as one-third of the comely crime-fighting trio in Charlie's Angels (2000). When she's not hissing at clients or throwing well-coiffed punches, Liu keeps busy with an eclectic mix of off-screen hobbies. She practices the martial art of Kali-Eskrima-Silat (knife-and-stick fighting), skis, rock climbs, rides horses, and plays the accordion. In 1993 she exhibited a collection of multimedia art pieces at the Cast Iron Gallery in SoHo (New York), after which she won a grant to study and create art in China. Her hectic schedule doesn't leave much time for romantic intrigue, but Liu says she prefers to keep that side of her life uncluttered.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxODE0MjI5Ml5BMl5BanBnXkFtZTcwMjkxMzMzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005154","name":"Lucy Liu","idIMDB":"nm0005154"},"actorId":"nm0005154","character":"Lindsey","urlCharacter":"http://www.imdb.com/character/ch0006951","main":true},{"actorName":"Morgan Freeman","urlProfile":"http://www.imdb.com/name/nm0000151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDMyMzI2OF5BMl5BanBnXkFtZTcwMzM2OTk1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1937","placeOfBirth":" Memphis, Tennessee, USA","height":"6' 2\" (1.88 m)","bio":"With an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born on June 1, 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended Los Angeles City College before serving several years in the US Air Force as a mechanic between 1955 and 1959. His first dramatic arts exposure was on the stage including appearing in an all-African American production of the exuberant musical Hello, Dolly!. Throughout the 1970s, he continued his work on stage, winning Drama Desk and Clarence Derwent Awards and receiving a Tony Award nomination for his performance in The Mighty Gents in 1978. In 1980, he won two Obie Awards, for his portrayal of Shakespearean anti-hero Coriolanus at the New York Shakespeare Festival and for his work in Mother Courage and Her Children. Freeman won another Obie in 1984 for his performance as The Messenger in the acclaimed Brooklyn Academy of Music production of Lee Breuer's The Gospel at Colonus and, in 1985, won the Drama-Logue Award for the same role. In 1987, Freeman created the role of Hoke Coleburn in Alfred Uhry's Pulitzer Prize-winning play Driving Miss Daisy, which brought him his fourth Obie Award. In 1990, Freeman starred as Petruchio in the New York Shakespeare Festival's The Taming of the Shrew, opposite Tracey Ullman. Returning to the Broadway stage in 2008, Freeman starred with Frances McDormand and Peter Gallagher in Clifford Odets' drama The Country Girl, directed by Mike Nichols. Freeman first appeared on TV screens as several characters including \"Easy Reader\", \"Mel Mounds\" and \"Count Dracula\" on the Children's Television Workshop (now Sesame Workshop) show The Electric Company (1971). He then moved into feature film with another children's adventure, Who Says I Can't Ride a Rainbow! (1971). Next, there was a small role in the thriller Blade (1973); then he played Casca in Julius Caesar (1979) and the title role in Coriolanus (1979). Regular work was coming in for the talented Freeman and he appeared in the prison dramas Attica (1980) and Brubaker (1980), Eyewitness (1981), and portrayed the final 24 hours of slain Malcolm X in Death of a Prophet (1981). For most of the 1980s, Freeman continued to contribute decent enough performances in films that fluctuated in their quality. However, he really stood out, scoring an Oscar nomination as a merciless hoodlum in Street Smart (1987) and, then, he dazzled audiences and pulled a second Oscar nomination in the film version of Driving Miss Daisy (1989) opposite Jessica Tandy. The same year, Freeman teamed up with youthful Matthew Broderick and fiery Denzel Washington in the epic Civil War drama Glory (1989) about freed slaves being recruited to form the first all-African American fighting brigade. His star continued to rise, and the 1990s kicked off strongly with roles in The Bonfire of the Vanities (1990), Robin Hood: Prince of Thieves (1991), and La puissance de l'ange (1992). Freeman's next role was as gunman Ned Logan, wooed out of retirement by friend William Munny to avenge several prostitutes in the wild west town of Big Whiskey in Clint Eastwood's de-mythologized western Unforgiven (1992). The film was a sh and scored an acting Oscar for Gene Hackman, a directing Oscar for Eastwood, and the Oscar for best picture. In 1993, Freeman made his directorial debut on Bopha! (1993) and soon after formed his production company, Revelations Entertainment. More strong scripts came in, and Freeman was back behind bars depicting a knowledgeable inmate (and obtaining his third Oscar nomination), befriending falsely accused banker Tim Robbins in The Shawshank Redemption (1994). He was then back out hunting a religious serial killer in Se7en (1995), starred alongside Keanu Reeves in Chain Reaction (1996), and was pursuing another serial murderer in Kiss the Girls (1997). Further praise followed for his role in the slave tale of Amistad (1997), he was a worried US President facing Armageddon from above in Deep Impact (1998), appeared in Neil LaBute's black comedy Nurse Betty (2000), and reprised his role as Alex Cross in Along Came a Spider (2001). Now highly popular, he was much in demand with cinema audiences, and he co-starred in the terrorist drama The Sum of All Fears (2002), was a military officer in the Stephen King-inspired Dreamcatcher (2003), gave divine guidance as God to Jim Carrey in Bruce Almighty (2003), and played a minor role in the comedy The Big Bounce (2004). 2005 was a huge year for Freeman. First, he he teamed up with good friend Clint Eastwood to appear in the drama, Million Dollar Baby (2004). Freeman's on-screen performance is simply world-class as ex-prize fighter Eddie \"Scrap Iron\" Dupris, who works in a run-down boxing gym alongside grizzled trainer Frankie Dunn, as the two work together to hone the skills of never-say-die female boxer Hilary Swank. Freeman received his fourth Oscar nomination and, finally, impressed the Academy's judges enough to win the Best Supporting Actor Oscar for his performance. He also narrated Steven Spielberg's War of the Worlds (2005) and appeared in Batman Begins (2005) as Lucius Fox, a valuable ally of Christian Bale's Bruce Wayne/Batman for director Christopher Nolan. Freeman would reprise his role in the two sequels of the record-breaking, genre-redefining trilogy. Roles in tentpoles and indies followed; highlights include his role as a crime boss in Lucky Number Slevin (2006), a second go-round as God in Evan Almighty (2007) with Steve Carell taking over for Jim Carrey, and a supporting role in Ben Affleck's directorial debut, Gone Baby Gone (2007). He co-starred with Jack Nicholson in the breakout hit The Bucket List (2007) in 2007, and followed that up with another box-office success, Wanted (2008), then segued into the second Batman film, The Dark Knight (2008). In 2009, he reunited with Eastwood to star in the director's true-life drama Invictus (2009), on which Freeman also served as an executive producer. For his portrayal of Nelson Mandela in the film, Freeman garnered Oscar, Golden Globe and Critics' Choice Award nominations, and won the National Board of Review Award for Best Actor. Recently, Freeman appeared in RED (2010), a surprise box-office hit; he narrated the Conan the Barbarian (2011) remake, starred in Rob Reiner's The Magic of Belle Isle (2012); and capped the Batman trilogy with The Dark Knight Rises (2012). Freeman has several films upcoming, including the thriller Now You See Me (2013), under the direction of Louis Leterrier, and the science fiction actioner Oblivion (2013), in which he stars with Tom Cruise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDMyMzI2OF5BMl5BanBnXkFtZTcwMzM2OTk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000151","name":"Morgan Freeman","idIMDB":"nm0000151"},"actorId":"nm0000151","character":"The Boss","urlCharacter":"http://www.imdb.com/character/ch0006949","main":true},{"actorName":"Ben Kingsley","urlProfile":"http://www.imdb.com/name/nm0001426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1943","placeOfBirth":" Scarborough, Yorkshire, England, UK","birthName":"Krishna Bhanji","height":"5' 8\" (1.73 m)","bio":"Ben Kingsley was born Krishna Bhanji on December 31, 1943 in Scarborough, Yorkshire, England. His father, Rahimtulla Harji Bhanji, was a Kenyan-born medical doctor, of Gujarati Indian descent, and his mother, Anna Lyna Mary (Goodman), was an English actress. Ben began to act in stage plays during the 1960s. He soon became a successful stage actor, and also began to have roles in films and television. His birth name was Krishna Bhanji, but he changed his name to \"Ben Kingsley\" soon after gaining fame as a stage actor, fearing that a foreign name could hamper his acting career. Kingsley first earned international fame for his performance in the drama movie Gandhi (1982). His performance as Mohandas K. Gandhi earned him international fame. He won many awards - including an Academy Award for Best Actor. He also won Golden Globe, BAFTA and London Film Critics' Circle Awards. After acting in Gandhi (1982), Ben was recognized as one of the finest British actors. After his international fame for appearing in Gandhi (1982), Kingsley appeared in many other famous movies. His success as an actor continued. His performance as Itzhak Stern in the drama movie Schindler's List (1993) earned him a BAFTA nomination. Schindler's List (1993) won seven Academy Awards, including Best Picture. During the late 1990s, Kingsley acted in many successful movies. He played Sweeney Todd in the television movie The Tale of Sweeney Todd (1997). For his performance in this movie, he was nominated for the Screen Actors' Guild Award. His other notable role was as Otto Frank in the television movie Anne Frank (2001), for which he won a Screen Actors' Guild Award. In 2002, Kingsley was appointed Knight Bachelor of the Order of the British Empire in the Queen's New Years Honours for his services to drama. In 2013, he received the BAFTA Los Angeles Britannia Award for Worldwide Contribution to Filmed Entertainment. That same year, he also received the Fellowship Award at the Asian Awards in London, England. Ben Kingsley currently resides in Spelsbury, Oxfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001426","name":"Ben Kingsley","idIMDB":"nm0001426"},"actorId":"nm0001426","character":"The Rabbi","urlCharacter":"http://www.imdb.com/character/ch0006952","main":true},{"actorName":"Michael Rubenfeld","urlProfile":"http://www.imdb.com/name/nm1032371","urlPhoto":"","biography":{"dateOfBirth":"1979","placeOfBirth":" Winnipeg, Manitoba, Canada","bio":"Michael Rubenfeld was born in Winnipeg, Manitoba and lived there until he was 16. He then moved to Toronto after high school. Michael attended the National Theatre School of Canada and graduated three years later. He is now living in Toronto, Ontario.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1032371","name":"Michael Rubenfeld","idIMDB":"nm1032371"},"actorId":"nm1032371","character":"Yitzchok","urlCharacter":"http://www.imdb.com/character/ch0061726","main":true},{"actorName":"Peter Outerbridge","urlProfile":"http://www.imdb.com/name/nm0653660","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODI5Mjk1MV5BMl5BanBnXkFtZTcwMjE0ODgwMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1966","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Outerbridge, together with two older sisters and two older brothers, grew up in Toronto, Ontario. While his father practiced law, his mother studied piano at the Royal Conservatory of Music. He comes from a family of artists, as his uncle (though not by blood) was opera singer Jon Vickers, and his cousin Billy is a regular at Stratford. In Outerbridge's own words, with his father being a trial lawyer, there were a lot of theatrics on his paternal side as well. Outerbridge began his acting career after high school, when he enrolled at the University of Victoria to study acting. After graduating in 1988 with a Bachelor of Fine Arts, he co-founded the theatre group Way Off Broadway and toured Canada with them for four years. In the early 90's, he started out in television, and his early credits include shows such as 21 Jump Street or The Commish. First feature films include Paris, France and Cool Runnings. His talent was recognized early on, when roles in Marine Life or Chasing Cain earned him award nominations such as Genie or Gemini Awards, and more roles in TV shows, movies and features films followed. He has worked steadily ever since, on a large variety of projects. His most notable roles include young student Matt in the critically acclaimed movie Kissed, who falls in love with a necrophiliac. Also of note is his performance playing the transsexual Judy in Better Than Chocolate, or his downright creepy portrayal of sexual assailant Theodore Gray in the thriller The Rendering. Ever since the early 90's, Outerbridge has been a steady presence not only on the silver screen but also on TV. Among many others, he played three different characters on the science fiction show The Outer Limits, had a recurring role in season three of Chris Carter's mystery spin-off Millennium, played the lead in three feature-length episodes of the 2004 version of The Murdoch Mysteries, and scored his biggest lead role to date in the same year, when he was cast as headstrong scientist David Sandström in The Movie Network's ReGenesis. The science-themed show successfully aired for four years and has been broadcast internationally in over 20 countries. ReGenesis has been nominated for several Gemini awards over the years. As more recent projects go, Outerbridge has portrayed one of Canada's political founding fathers George Brown in the TV period piece John A.: Birth of a Country, which earned him the 2013 Canadian Screen Award in the category 'Best Performance by an Actor in a Featured Supporting Role in a Dramatic Program or Series'. He's had a recurring role in The CW's modern spy reboot Nikita, and starred as special guest star on Global TV's World War II period drama Bomb Girls. If you keep an eye out, you will also be able to catch his occasional guest spots on shows such as Suits and The Listener, and the upcoming Dark Rising: Warrior of Worlds. In 2000, Peter Outerbridge married Canadian actress Tammy Isbell, with whom he has co-starred on more than one occasion, among them The Murdoch Mysteries (2004) and ReGenesis (2004). It is said the two of them met in 1994 while shooting an episode of Au-delà du réel - l'aventure continue (1995) together, in which they fittingly played a young couple. In 2004, twins Thomas and Samuel were born. Outerbridge and his family live in Toronto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODI5Mjk1MV5BMl5BanBnXkFtZTcwMjE0ODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0653660","name":"Peter Outerbridge","idIMDB":"nm0653660"},"actorId":"nm0653660","character":"Dumbrowski","urlCharacter":"http://www.imdb.com/character/ch0175190","main":true},{"actorName":"Stanley Tucci","urlProfile":"http://www.imdb.com/name/nm0001804","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzE4MjAzMV5BMl5BanBnXkFtZTcwMjA2MTMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1960","placeOfBirth":" Peekskill, New York, USA","height":"5' 8\" (1.73 m)","bio":"Actor Stanley Tucci was born on November 11, 1960, in Peekskill, New York. He is the son of Joan (Tropiano), a writer, and Stanley Tucci, an art teacher. His family is Italian-American, with origins in Calabria. Tucci took an interest in acting while in high school, and went on to attend the State University of New York's Conservatory of Theater Arts in Purchase. He began his professional career on the stage, making his Broadway debut in 1982, and then made his film debut in Prizzi's Honor (1985). In 2009, Tucci received his first Academy Award nomination for his turn as a child murderer in The Lovely Bones (2009). He also received a BAFTA nomination and a Golden Globe nomination for the same role. Other than The Lovely Bones, Tucci has recently had noteworthy supporting turns in a broad range of movies including Lucky Number Slevin (2006), The Devil Wears Prada (2006) and Captain America: The First Avenger (2011). Tucci reached his widest audience yet when he played Caesar Flickerman in box office sensation The Hunger Games (2012). While maintaining an active career in movies, Tucci received major accolades for some work in television. He won an Emmy and a Golden Globe for his role in TV movie Winchell (1998), an Emmy for a guest turn on Monk (2002), and a Golden Globe for his role in HBO movie Conspiracy (2001). Tucci has also had an extensive career behind the camera. His directorial efforts include Big Night (1996), The Impostors (1998), Joe Gould's Secret (2000) and Blind Date (2007), and he did credited work on all of those screenplays with the exception of Joe Gould's Secret (2000). Tucci has three children with Kate Tucci, who passed away in 2009. Tucci married Felicity Blunt in August 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzE4MjAzMV5BMl5BanBnXkFtZTcwMjA2MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001804","name":"Stanley Tucci","idIMDB":"nm0001804"},"actorId":"nm0001804","character":"Brikowski","urlCharacter":"http://www.imdb.com/character/ch0006953","main":true},{"actorName":"Kevin Chamberlin","urlProfile":"http://www.imdb.com/name/nm0150255","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NDY4NzYyNF5BMl5BanBnXkFtZTcwNzMyMzA4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1963","placeOfBirth":" Baltimore, Maryland, USA","height":"5' 10\" (1.78 m)","bio":"Kevin Chamberlin is one of the few Broadway actors who has been nominated for the Tony Award in three out of four acting categories. Best Actor in a Play (Dirty Blonde), Best Actor in a Musical (Seussical) and Best Featured Actor in a Musical (The Addams Family). He also received Drama Desk nominations for these roles. His film debut was in 1995, playing Charlie - the bomb diffuser in \"Die Hard With A Vengeance\". Kevin plays \"Bertram\" on Disney Channel's hit series, \"Jessie\". He was born in 1963 and grew up in Moorestown, New Jersey. He holds a BFA in Acting from Rutgers University's Mason Gross School of the Arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NDY4NzYyNF5BMl5BanBnXkFtZTcwNzMyMzA4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0150255","name":"Kevin Chamberlin","idIMDB":"nm0150255"},"actorId":"nm0150255","character":"Marty","urlCharacter":"http://www.imdb.com/character/ch0061727","main":true},{"actorName":"Dorian Missick","urlProfile":"http://www.imdb.com/name/nm0592923","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAwMDE3NjA3OV5BMl5BanBnXkFtZTgwMDA0OTk5ODE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1976","placeOfBirth":" East Orange, New Jersey, USA","bio":"Dorian Missick was born on January 15, 1976 in East Orange, New Jersey, USA. He is an actor and producer, known for Southland (2009), Lucky Number Slevin (2006) and Big Words (2013). He has been married to Simone Missick since February 19, 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAwMDE3NjA3OV5BMl5BanBnXkFtZTgwMDA0OTk5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0592923","name":"Dorian Missick","idIMDB":"nm0592923"},"actorId":"nm0592923","character":"Elvis","urlCharacter":"http://www.imdb.com/character/ch0061728","main":true},{"actorName":"Mykelti Williamson","urlProfile":"http://www.imdb.com/name/nm0932112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MDY1NzU4Ml5BMl5BanBnXkFtZTcwMzYyNDUyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1957","placeOfBirth":" Saint Louis, Missouri, USA","birthName":"Michael T. Williamson","height":"6' 2\" (1.88 m)","bio":"Perhaps best remembered for his touching performance as \"Bubba\" opposite Tom Hanks in the Academy Award-winning Forrest Gump (1994), Mykelti Williamson is one of the most sought-after actors in Hollywood, who has been steadily honing his craft since he first began acting professionally at the age of 18. This past fall Williamson starred as Lt. Philip Gerard, the hardnosed detective determined to recapture escaped convict Dr. Richard Kimble (Tim Daly) in CBS' update of the classic 1960's action series The Fugitive (2000). The son of an Air Force Staff Sergeant (father) and certified public accountant (mother), Williamson was born in St. Louis, MO, and began performing on the stage at the age of 9. Like many youngsters, he was enamored with the concept of television, and thought that the images he was seeing on the small screen were reality. It wasn't until his mother put him in a church play that he realized that what the people on the small screen were doing was performing. He was instantly hooked. At the age of 15, Williamson and his family settled in Los Angeles. A superb athlete, he excelled at both football and basketball, but the acting bug led him to quit sports and dance with the cheerleading squad, much to the chagrin of his coaches. Following graduation, Williamson began acting professionally, making appearances on television shows such as Starsky and Hutch (1975), Hill Street Blues (1981) and China Beach (1988), among others. He made his film debut in the Walter Hill-directed feature Streets of Fire (1984), opposite Diane Lane, Michael Paré and Willem Dafoe. He would subsequently appear in the feature The First Power (1990) with Lou Diamond Phillips, Miracle Mile (1988) with Anthony Edwards and Mare Winningham, Number One with a Bullet (1987), Wildcats (1986) and Free Willy (1993). Following his critically acclaimed performance in Forrest Gump (1994), Williamson starred in Forest Whitaker's Waiting to Exhale (1995); partnered with Al Pacino in Michael Mann's Heat (1995); Sauvez Willy 2 (1995), and starred alongside Nicolas Cage in Con Air (1997). Williamson was also seen in Mike Nichols' political drama Primary Colors (1998) (a cameo appearance which he did as a personal favor to Nichols and John Travolta) and Three Kings (1999), opposite George Clooney, Mark Wahlberg and Ice Cube. In 1996 Williamson returned to television when he starred opposite Delroy Lindo and Blair Underwood in the critically acclaimed HBO telefilm Soul of the Game (1996) and received rave reviews for his stirring portrayal of legendary Negro League baseball legend Josh Gibson. Williamson also starred in Buffalo Soldiers (1997) for TNT and 12 Angry Men (1997) for Showtime, as well as starring in the cable network's series The Hoop Life (1999). On stage Williamson starred with Samuel L. Jackson, D.B. Sweeney, Ellis Williams, Matt McGrath and Richard Reilly in Clark Gregg's (\"What Lies Beneath\") 1995's ensemble drama \"Distant Fires\", which earned the cast a prestigious L.A. Theatre Award. An avid sports fan and devoted family man, Williamson enjoys restoring classic cars and rodeoing in his free time. He currently lives in Los Angeles with his wife and two of his three daughters. Named by his grandfather for 'Spirit' or 'Silent Friend' in the language of Blackfeet Indians, Mykelti Williamson has quietly built a reputation in Hollywood as one of the most consistently proven actors in the business, delivering stirring and honest performances that always capture audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MDY1NzU4Ml5BMl5BanBnXkFtZTcwMzYyNDUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932112","name":"Mykelti Williamson","idIMDB":"nm0932112"},"actorId":"nm0932112","character":"Sloe","urlCharacter":"http://www.imdb.com/character/ch0006954","main":true},{"actorName":"Scott Gibson","urlProfile":"http://www.imdb.com/name/nm0317181","urlPhoto":"","biography":{"birthName":"Scott Andrew Gibson","height":"6' 1\" (1.85 m)","bio":"Scott Gibson was born as Scott Andrew Gibson. He is an actor, known for Lucky Number Slevin (2006), Breach (2007) and The Skulls (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0317181","name":"Scott Gibson","idIMDB":"nm0317181"},"actorId":"nm0317181","character":"Max","urlCharacter":"http://www.imdb.com/character/ch0061729","main":true},{"actorName":"Daniel Kash","urlProfile":"http://www.imdb.com/name/nm0440511","urlPhoto":"","biography":{"dateOfBirth":"25 April 1959","placeOfBirth":" Montréal, Québec, Canada","birthName":"Daniel Joshua Kash","height":"5' 10½\" (1.79 m)","bio":"Daniel Kash was born on April 25, 1959 in Montréal, Québec, Canada as Daniel Joshua Kash. He is an actor and director, known for Aliens (1986), Mama (2013) and Lucky Number Slevin (2006). He has been married to Hayley Tyson since 1988.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0440511","name":"Daniel Kash","idIMDB":"nm0440511"},"actorId":"nm0440511","character":"Bodyguard #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dmitry Chepovetsky","urlProfile":"http://www.imdb.com/name/nm0155726","urlPhoto":"","biography":{"dateOfBirth":"1970","placeOfBirth":" Lvov, Ukrainian SSR, USSR [now Lviv, Ukraine]","bio":"Dmitry Chepovetsky was born in 1970 in Lvov, Ukrainian SSR, USSR. He is an actor, known for Lucky Number Slevin (2006), RED (2010) and Mission: Impossible - Ghost Protocol (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0155726","name":"Dmitry Chepovetsky","idIMDB":"nm0155726"},"actorId":"nm0155726","character":"Bodyguard #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Jaeger","urlProfile":"http://www.imdb.com/name/nm0415382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwMjAwNjEyMF5BMl5BanBnXkFtZTgwMDI4MzkwMTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1977","placeOfBirth":" Perrysburg, Ohio, USA","birthName":"Samuel Heath Jaeger","height":"6' (1.83 m)","bio":"Sam Jaeger began his professional career in New York, while still attending Otterbein College in Ohio, landing a guest-starring role on Law & Order (1990). He also spent several seasons doing theater in NY before making the move to Los Angeles. Once in LA, he landed parts in two feature films, Traffic (2000) and Behind Enemy Lines (2001). After those standout roles, he won the powerful role, opposite Bruce Willis and Colin Farrell in MGM's Hart's War (2002). In the years following, Jaeger has built an impressive television resume, including roles in such hits as ER (1994), CSI: Crime Scene Investigation (2000), The West Wing (1999), NYPD Blue (1993), Scrubs (2001), That's Life (2000) and Girls Club (2002). Jaeger's credits include the A&E biopic, The Riverman (2004), opposite Cary Elwes and Bruce Greenwood, and the Indy hit, Lucky Number Slevin (2006), opposite Bruce Willis and Josh Hartnett, which was seen at Sundance Film Festival in 2006 and opened nationally to critical acclaim. He was seen in the romantic comedy, Catch and Release (2006), also starring Jennifer Garner and Kevin Smith. Written and directed by Susannah Grant, writer of Erin Brockovich (2000) and In Her Shoes (2005), the film opened in January 2007. In addition to his film and small screen credits, Jaeger has also co-written and co-produced two short films. The first, \"Quiz Bowl\", caught the eye of actress Kate Bosworth (Superman Returns (2006)), who later agreed to star in his next short, Advantage Hart (2003). \"Advantage Hart\" had its premiere at The Hollywood Film Festival. Jaeger's directorial debut, the short Untold (2009), is a period piece set in his home state of Ohio. Samuel Heath Jaeger was born in Perrysburg, to LeAnne (Graening) and Charles Jaeger. His mother is of German descent, and his father is of German, English, and Scots-Irish ancestry. Jaeger resides, with his wife, Amber Jaeger, in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwMjAwNjEyMF5BMl5BanBnXkFtZTgwMDI4MzkwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0415382","name":"Sam Jaeger","idIMDB":"nm0415382"},"actorId":"nm0415382","character":"Nick Fisher","urlCharacter":"http://www.imdb.com/character/ch0006955","main":true}],"seasons":[],"idIMDB":"tt0425210","urlIMDB":"http://www.imdb.com/title/tt0425210","business":{"budget":{"money":"$27,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,031,921","country":"USA","day":"09","month":"04","year":"2006","remarks":"1,984 Screens"},{"money":"£1,074,550","country":"UK","day":"26","month":"02","year":"2006","remarks":"314 Screens"},{"money":"€92,911","country":"Netherlands","day":"23","month":"04","year":"2006","remarks":"40 Screens"},{"money":"€720,956","country":"Spain","day":"09","month":"04","year":"2006","remarks":""}],"gross":[{"money":"$22,494,487","country":"USA","day":"16","month":"07","year":"2006","remarks":""},{"money":"$22,491,138","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"$22,486,499","country":"USA","day":"02","month":"07","year":"2006","remarks":""},{"money":"$22,475,828","country":"USA","day":"25","month":"06","year":"2006","remarks":""},{"money":"$22,461,267","country":"USA","day":"18","month":"06","year":"2006","remarks":""},{"money":"$22,438,650","country":"USA","day":"11","month":"06","year":"2006","remarks":""},{"money":"$22,401,770","country":"USA","day":"04","month":"06","year":"2006","remarks":""},{"money":"$22,348,069","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$22,209,233","country":"USA","day":"21","month":"05","year":"2006","remarks":""},{"money":"$21,988,290","country":"USA","day":"14","month":"05","year":"2006","remarks":""},{"money":"$21,588,013","country":"USA","day":"07","month":"05","year":"2006","remarks":""},{"money":"$20,752,033","country":"USA","day":"30","month":"04","year":"2006","remarks":""},{"money":"$18,674,953","country":"USA","day":"23","month":"04","year":"2006","remarks":""},{"money":"$14,297,147","country":"USA","day":"16","month":"04","year":"2006","remarks":""},{"money":"$7,031,921","country":"USA","day":"09","month":"04","year":"2006","remarks":""},{"money":"£4,437,104","country":"UK","day":"26","month":"03","year":"2006","remarks":""},{"money":"£4,117,844","country":"UK","day":"19","month":"03","year":"2006","remarks":""},{"money":"£3,493,154","country":"UK","day":"12","month":"03","year":"2006","remarks":""},{"money":"£2,509,322","country":"UK","day":"05","month":"03","year":"2006","remarks":""},{"money":"£1,074,550","country":"UK","day":"26","month":"02","year":"2006","remarks":""},{"money":"€122,826","country":"Netherlands","day":"23","month":"04","year":"2006","remarks":""}],"weekendGross":[{"money":"$1,402","country":"USA","day":"16","month":"07","year":"2006","remarks":"5 Screens"},{"money":"$2,495","country":"USA","day":"09","month":"07","year":"2006","remarks":""},{"money":"$4,389","country":"USA","day":"02","month":"07","year":"2006","remarks":"8 Screens"},{"money":"$5,881","country":"USA","day":"25","month":"06","year":"2006","remarks":"14 Screens"},{"money":"$11,729","country":"USA","day":"18","month":"06","year":"2006","remarks":"24 Screens"},{"money":"$21,754","country":"USA","day":"11","month":"06","year":"2006","remarks":"35 Screens"},{"money":"$30,399","country":"USA","day":"04","month":"06","year":"2006","remarks":"65 Screens"},{"money":"$72,641","country":"USA","day":"28","month":"05","year":"2006","remarks":""},{"money":"$124,665","country":"USA","day":"21","month":"05","year":"2006","remarks":"221 Screens"},{"money":"$182,961","country":"USA","day":"14","month":"05","year":"2006","remarks":"224 Screens"},{"money":"$406,253","country":"USA","day":"07","month":"05","year":"2006","remarks":"490 Screens"},{"money":"$1,117,900","country":"USA","day":"30","month":"04","year":"2006","remarks":"724 Screens"},{"money":"$2,475,903","country":"USA","day":"23","month":"04","year":"2006","remarks":"1,735 Screens"},{"money":"$4,752,800","country":"USA","day":"16","month":"04","year":"2006","remarks":"1,989 Screens"},{"money":"$7,031,921","country":"USA","day":"09","month":"04","year":"2006","remarks":"1,984 Screens"},{"money":"£121,595","country":"UK","day":"26","month":"03","year":"2006","remarks":"168 Screens"},{"money":"£320,900","country":"UK","day":"19","month":"03","year":"2006","remarks":"246 Screens"},{"money":"£570,076","country":"UK","day":"12","month":"03","year":"2006","remarks":"302 Screens"},{"money":"£806,388","country":"UK","day":"05","month":"03","year":"2006","remarks":"314 Screens"},{"money":"£1,074,550","country":"UK","day":"26","month":"02","year":"2006","remarks":"314 Screens"},{"money":"€92,911","country":"Netherlands","day":"23","month":"04","year":"2006","remarks":"40 Screens"}],"admissions":[{"money":"295,976","country":"Brazil","day":"01","month":"10","year":"2006","remarks":""},{"money":"221,452","country":"Brazil","day":"24","month":"09","year":"2006","remarks":""},{"money":"102,369","country":"Brazil","day":"17","month":"09","year":"2006","remarks":""},{"money":"299,872","country":"France","day":"01","month":"08","year":"2006","remarks":""},{"money":"70,871","country":"Netherlands","day":"31","month":"12","year":"2006","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"07","month":"12","year":"2004","remarks":null},null],"copyrightHolder":"Copyright © 2005 Film &amp; Entertainment VIP Medienfonds 4 GmbH &amp; Co. KG (on print)"},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Millennium XL, Panavision Primo Lenses","Panavision Panaflex Millennium, Panavision Primo Lenses"],"laboratory":["Technicolor (dailies) (prints)"],"filmLength":["3,036 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 200T 5217, Vision2 500T 5218, Fuji Super F-250T 8552, Super F-250D 8562)"],"cinematographicProcess":["Super 35 (3-perf) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)"]},"rating":"7.8","metascore":"53","filmingLocations":[{"location":"Abingdon Square Park, Manhattan, New York City, New York, USA"}],"rated":"R","awards":[{"award":"Directors Guild of Canada 2006","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Craft Award","categories":[{"category":"Outstanding Sound Editing - Feature Film","names":[{"name":"Kevin Banks","id":"nm0052193","role":null},{"name":"Lee de Lang","id":"nm0209508","role":null},{"name":"Jill Purdy","id":"nm0700829","role":null},{"name":"Nathan Robitaille","id":"nm0733255","role":null}]}]}]},{"award":"Golden Schmoes Awards 2006","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Most Underrated Movie of the Year","names":[]}]}]},{"award":"Jupiter Award 2008","titlesAwards":[{"titleAwardOutcome":"Won Jupiter Award","categories":[{"category":"Best DVD Release","names":[]}]}]},{"award":"Milano International Film Festival Awards (MIFF Awards) 2006","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Best Film","names":[{"name":"Paul McGuigan","id":"nm0006476","role":null}]}]},{"titleAwardOutcome":"Won Best Actor","categories":[{"category":"","names":[{"name":"Josh Hartnett","id":"nm0001326","role":null}]}]},{"titleAwardOutcome":"Won Best Editing","categories":[{"category":"","names":[{"name":"Andrew Hulme","id":"nm0401528","role":null}]}]},{"titleAwardOutcome":"Won Best Film","categories":[{"category":"","names":[{"name":"Paul McGuigan","id":"nm0006476","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing for Music in a Feature Film","names":[{"name":"Kevin Banks","id":"nm0052193","role":"music editor"},{"name":"Arthur Pingrey","id":"nm2138630","role":"music editor"}]},{"category":"Best Sound Editing for Sound Effects and Foley in a Foreign Film","names":[{"name":"Paula Fairfield","id":"nm0265584","role":"supervising sound editor/sound designer"},{"name":"Jill Purdy","id":"nm0700829","role":"supervising adr/dialogue editor"},{"name":"Carla Murray","id":"nm0614873","role":"sound designer/sound effects editor"},{"name":"Nathan Robitaille","id":"nm0733255","role":"sound effects editor"},{"name":"Lee de Lang","id":"nm0209508","role":"sound effects editor"},{"name":"Steve Baine","id":"nm0047768","role":"foley artist"}]}]}]}],"votes":"270,597","type":"Movie","companyCreditsSimple":[{"idCompany":"co0150452","name":"Weinstein Company, The"},{"idCompany":"co0094902","name":"Ascendant Pictures"},{"idCompany":"co0063593","name":"FilmEngine"}],"keywords":{"keywords":["mistaken identity","death","coroner","love","gay son","revenge","morgue","assassin","female frontal nudity","blood splatter","breasts","burnt corpse","police detective","murder of detective","tied to a chair","scene during opening credits","horse track","fixed horserace","flashback","murdered in broad daylight","asking for a date","dinner date","female coroner","faking a death","police brutality","revenge murder","father murdered","murder of father","shot in a car","shot in the back of one's head","sex on first date","reference to alfred hitchcock","reference to roger moore","reference to timothy dalton","reference to james bond","star of david","bookmaker","gambling debt","horse racing","killed in an elevator","finger gun","stabbed in the eye","father son relationship","sex","neck breaking","bed","bare chested male","towel","male rear nudity","gay character","father figure","bomb","beating","bare butt","rear entry sex","male nudity","bag over head","cult film","jewish mafia","organized crime","hitman","gambling","crime boss","shot multiple times","big con","interracial relationship","violence","shootout","loss of family","homosexual","exploding building","corrupt cop","choke to death","black comedy","female nudity","intentionally misspelled title","chess","neo noir","racial slur","racial comment","homophobic overtones","gay slur","ethnic slur","suffocation","stabbed in the neck","sniper","silencer","shotgun","shot to death","shot in the head","shot in the forehead","shot in the chest","shot in the back","robbery","punched in the face","premarital sex","police officer killed","poison","murder","morgue attendant","machine gun","loss of son","loss of parents","loss of mother","loss of father","gun","faked death","explosion","deception","corpse","child in peril","caught having sex","burnt body","broken nose","blood","character name in title","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:21:30"}}