{"data":{"movies":[{"title":"Bart Got a Room","originalTitle":"","year":"2008","releaseDate":"20080425","directors":[{"name":"Brian Hecker","id":"nm0373033"}],"writers":[{"name":"Brian Hecker","id":"nm0373033"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDA1NDEwMV5BMl5BanBnXkFtZTcwOTU4MzIzMg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Danny Stein is a high-school senior and class vice president; he's in charge of the prom, along with Camille, his best friend for years. Everyone including Camille and her parents assumes that Danny will ask her to the prom, but he wants something less platonic and more romantic - more memorable. His choices include the sophomore cheerleader he drives to school, a friend of a friend, and a quiet Chinese girl in his classes. With his parents' help (they're going through a divorce), he gets the tickets, rents a tux, reserves a limo, and, over his mother's objections, gets a room at the prom-site hotel. This, everyone believes, is the way to establish memories. Will anything work out?","simplePlot":"While Danny's father and mother independently search for love, Danny is on his own desperate quest to find a prom date. Danny's search becomes progressively more pathetic once he and his family learn that Bart, the school's biggest dweeb, not only secured a date for the prom, but got a hotel room as well.","actors":[{"actorName":"Steven Kaplan","urlProfile":"http://www.imdb.com/name/nm1790460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzQ4NDYyMl5BMl5BanBnXkFtZTcwMTU1NzM2Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1988","placeOfBirth":" Stamford, Connecticut, USA","height":"5' 9\" (1.75 m)","bio":"Steven Kaplan was born on August 30, 1988 in Stamford, Connecticut, USA. He is an actor, known for Bart Got a Room (2008), Flutter Kick (2005) and The Rewrite (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzQ4NDYyMl5BMl5BanBnXkFtZTcwMTU1NzM2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1790460","name":"Steven Kaplan","idIMDB":"nm1790460"},"actorId":"nm1790460","character":"Danny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William H. Macy","urlProfile":"http://www.imdb.com/name/nm0000513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTk5MTAzNV5BMl5BanBnXkFtZTcwNTk0MzMyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1950","placeOfBirth":" Miami, Florida, USA","birthName":"William Hall Macy Jr.","height":"5' 8\" (1.73 m)","bio":"William H. Macy was born on March 13, 1950 in Miami, Florida, USA as William Hall Macy Jr. He is an actor and writer, known for Fargo (1996), Shameless (2011) and Jurassic Park III (2001). He has been married to Felicity Huffman since September 6, 1997. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTk5MTAzNV5BMl5BanBnXkFtZTcwNTk0MzMyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000513","name":"William H. Macy","nicknames":["Bill"],"idIMDB":"nm0000513"},"actorId":"nm0000513","character":"Ernie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cheryl Hines","urlProfile":"http://www.imdb.com/name/nm0385644","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NTQ0MTQyNF5BMl5BanBnXkFtZTcwMDU5MTQyNg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1965","placeOfBirth":" Miami Beach, Florida, USA","birthName":"Cheryl Ruth Hines","height":"5' 5\" (1.65 m)","bio":"Cheryl Ruth Hines was born on September 21, 1965 in Miami Beach, Florida, to Rosemary (Graham) and James Hines, and grew up in Tallahassee, Florida. She went to West Virginia University, Florida State University and graduated from the University of Central Florida. She studied theater and television production, but it was not until she moved to Los Angeles and studied at the Groundlings Theater that she felt she had really learned anything about comedy. Her first teacher there was Lisa Kudrow. She learned to improvise and write comedy sketches. This experience helped her prepare for the role of Larry David's wife on HBO's Curb Your Enthusiasm (2000). The dialogue on the situation comedy is improvised, so she feels right at home. She still performs at the Groundlings Theater when she has a chance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NTQ0MTQyNF5BMl5BanBnXkFtZTcwMDU5MTQyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385644","name":"Cheryl Hines","idIMDB":"nm0385644"},"actorId":"nm0385644","character":"Beth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alia Shawkat","urlProfile":"http://www.imdb.com/name/nm0790057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTQ3NjY3MV5BMl5BanBnXkFtZTcwNzY1MzY1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1989","placeOfBirth":" Riverside, California, USA","birthName":"Alia Martine Shawkat","height":"5' 5\" (1.65 m)","bio":"Alia Shawkat was born in Riverside, California, to Dina Burke and actor Tony Shawkat. Her maternal grandfather, Paul Burke, was also an actor. Her father is from Baghdad, Iraq, and her mother has Irish, Italian, and Norwegian ancestry. Success arrived early for Alia. Her career began at the young age of 11 when she landed a role on the ABC Family series State of Grace (2001). She later starred as \"Maeby Funke\" on Fox's Emmy-award winning Arrested Development (2003) where she portrayed a rebellious and mischievous member of a dysfunctional Orange County family trying to adjust to their loss of wealth. Alia was introduced to show business by appearing in a Calvin Klein catalog, which immediately attracted the attention of commercial and theatrical agents in Hollywood. She soon landed a role opposite George Clooney in Three Kings (1999). This was followed by a supporting lead in the Ron Perlman' movie The Trial of Old Drum (2000). But it was State of Grace (2001) that catapulted her into the forefront of young actresses. She has also had guest-starring roles on JAG (1995), Without a Trace (2002), Boomtown (2002) and Presidio Med (2002) and she recently starred opposite Martin Lawrence in Rebound (2005). At 16 years old, when she was not filming, Alia attended a private school near her home in Rancho Mirage where she was able to continue her studies in English, Physics, Math, Geography and Drama. Her ambition is eventually to attend Yale University studying International Relations. In her free time, Alia enjoys horseback riding, ice-skating and dancing. She is an accomplished pianist and speaks several languages. She splits her time between her home and Rancho Mirage and Los Angeles where she resides with her parents and her two brothers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTQ3NjY3MV5BMl5BanBnXkFtZTcwNzY1MzY1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0790057","name":"Alia Shawkat","nicknames":["Allie"],"idIMDB":"nm0790057"},"actorId":"nm0790057","character":"Camille","urlCharacter":"http://www.imdb.com/character/ch0141555","main":true},{"actorName":"Ashley Benson","urlProfile":"http://www.imdb.com/name/nm1667364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDY1NDk5MV5BMl5BanBnXkFtZTgwNTMxNzIyOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1989","placeOfBirth":" Long Beach, California, USA","birthName":"Ashley Victoria Benson","height":"5' 5\" (1.65 m)","bio":"Ashley Victoria Benson was born on December 18, 1989 in Anaheim Hills, California, to Shannon (Harte) and Jeff Benson. She has Irish, English, and German ancestry. She has been dancing competitively since she was 2 with hip hop, jazz, ballet, tap and lyrical. She has been singing since she was about 5 and she hopes to pursue that, along with her acting. Ashley started modeling at the age of 5 for dance catalogs. Ashley was then pursued by The Ford Modeling Agency at the age of 8. She worked steadily in print and is still with the Agency. At the age of 10, she wanted to pursue acting. Ashley went on to do 35 commercials, and then on to theatrical roles. Acting was now Ashley's passion. Ashley put all her focus into acting, which left little time for modeling and dancing, anymore. Ashley's most recent role is \"Hanna Marin\" on ABC Family's Pretty Little Liars (2010). Ashley also had a cameo in Romeo Miller (aka Lil Romeo) and Solange Knowles's music video for the song \"True Love\". She did a photo shoot with Britney Spears for Vogue Magazine. She is in NLT's music video, \"That Girl\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDY1NDk5MV5BMl5BanBnXkFtZTgwNTMxNzIyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1667364","name":"Ashley Benson","nicknames":["Ash","AshBenzo","Benzo"],"idIMDB":"nm1667364"},"actorId":"nm1667364","character":"Alice","urlCharacter":"http://www.imdb.com/character/ch0141556","main":true},{"actorName":"Brandon Hardesty","urlProfile":"http://www.imdb.com/name/nm2799927","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxOTY1ODExN15BMl5BanBnXkFtZTgwMzU1ODYzMDI@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1987","placeOfBirth":" Baltimore, Maryland, USA","height":"6' (1.83 m)","bio":"Brandon Hardesty was born in Baltimore, MD on April 13th, 1987. He attended Baltimore Lutheran School and in his 6th year he was asked by his English teacher to be in the school play. He performed in two plays: The Crucible and George Washington Slept Here. After graduating, he attended Stevenson University and Towson University, majoring in film. In 2006, when YouTube first gained popularity, Hardesty made videos in his parents' basement. The videos depicted Hardesty reenacting his favorite scenes from movies. They quickly grew in popularity, and in 2007, Hardesty had one of his videos featured in a Geico commercial. In late 2007, Hardesty was contacted by a film producer who had seen one of his videos. He asked him to audition for an independent film: Bart Got A Room, starring William H. Macy and Cheryl Hines. Hardesty got the part, and subsequently got representation. In early 2008, Hardesty made five consecutive appearances on Jimmy Kimmel Live featuring his own reenactments of the five Best Picture nominees that year. After that, stayed on the east coast and worked in a grocery store until he got a lead role in American Pie Presents: The Book Of Love, as well as a supporting role in Bucky Larson: Born To Be A Star. Hardesty has lived bicoastally in Los Angeles, CA and Baltimore, MD ever since. He continues to make YouTube videos, but his focus has mostly been on auditioning for roles in feature films and television shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxOTY1ODExN15BMl5BanBnXkFtZTgwMzU1ODYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2799927","name":"Brandon Hardesty","idIMDB":"nm2799927"},"actorId":"nm2799927","character":"Craig","urlCharacter":"http://www.imdb.com/character/ch0141566","main":true},{"actorName":"Kate Micucci","urlProfile":"http://www.imdb.com/name/nm2177528","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDkxNjE1NV5BMl5BanBnXkFtZTgwNjQ3MzUwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1980","placeOfBirth":" New Jersey, USA","height":"5' 2\" (1.57 m)","bio":"Kate was born in New Jersey and spent most of her school years in Pennsylvania. As a kid she focused on playing outside in the woods and playing classical piano. In college she majored in art, focusing on painting and making puppets. She received an A.A. in Fine Arts from Keystone College. After a small stint watering banana and pineapple plants in Hawaii, Kate decided to go to Loyola Marymount University in Los Angeles where she made more puppets and received a B.A. in Studio Art. Since 2008 Kate has resided in Los Angeles, where she has a steady gig building sandcastles. She also works as an actor and can be found around town playing the ukulele.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDkxNjE1NV5BMl5BanBnXkFtZTgwNjQ3MzUwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2177528","name":"Kate Micucci","nicknames":["Oates"],"idIMDB":"nm2177528"},"actorId":"nm2177528","character":"Abby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Polito","urlProfile":"http://www.imdb.com/name/nm0689237","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjcwMjYzNF5BMl5BanBnXkFtZTYwNTczOTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1950","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"John Polito","height":"5' 8\" (1.73 m)","bio":"A veteran of nearly 100 films, Jon Polito is most recognized for his work with The Coen brothers, as well as his many television appearances as a series regular and guest star. Notable motion picture roles include: Millers Crossing, Barton Fink, The Man Who Wasn't There, The Crow, Blankman, and The Freshman with Marlon Brando, and Big Eyes. Directors he has worked with include; Russel Mulcahy, Clint Eastwood, John McNaughton, Tom Hanks, Andrew Bergman, Michael Apted, Ridley Scott, and Tim Burton amongst others. On television, he starred as a series regular on Crime Story, Ohara, Hearts are Wild, The Chronical, and the critically acclaimed Homicide, Life on the Street. Notable guest star roles include the befuddled landlord Sylvio on Seinfeld, his only role as a woman - Rhonda, on The Chris Isaak Show, Danny Devito's brother Frank on It's Always Sunny in Philadelphia,, and Earl Chambers on Modern Family. He starred on Broadway with Faye Dunaway in The Curse Of An Aching Heart, and with Dustin Hoffman in the 1985 Tony award winning revival of Death Of A Salesman, which he also filmed for CBS. He received the Best Actor OBIE award for Off Broadway theatre in 1980. Other awards include the 2001 TELLY for animation voice over in The Dancing Pumpkin which was directed by his brother Jack Polito, The New York Independent Festival Award for Excellence in Acting, and the 2005 Cinequest Maverick Award for his lifetime body of work in Film and Television. In 2012 Jon received the Best Actor Award for the short film Anti-Muse from the Hollywood Reel Independent Film Festival. He credits his success to three people; his mentor Dominic Garvey, his only acting teacher Irene Baird, and to the late, great director, and friend, Paul Bettis. In addition, his inspiration to this day is New York theatre artist, Theodora Skipitares, who taught him film and design in university, and who has since never been far away from his life. She is 'Art' surviving.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjcwMjYzNF5BMl5BanBnXkFtZTYwNTczOTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0689237","name":"Jon Polito","idIMDB":"nm0689237"},"actorId":"nm0689237","character":"Bob","urlCharacter":"http://www.imdb.com/character/ch0092716","main":true},{"actorName":"Jennifer Tilly","urlProfile":"http://www.imdb.com/name/nm0000236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1958","placeOfBirth":" Harbor City, California, USA","birthName":"Jennifer Ellen Chan","height":"5' 7\" (1.7 m)","bio":"An actress who always attracts audiences' attention, Jennifer Tilly is by turns funny, sexy, compassionate, compelling and often all at once. Her breakthrough movie role tapped into all of those qualities failing singer Blanche \"Monica\" Moran in Steve Kloves' The Fabulous Baker Boys (1989) opposite brothers Jeff Bridges and Beau Bridges. A few years later, Jennifer earned an Academy Award nomination for her portrayal of the aspiring but hopelessly untalented actress Olive Neal in Woody Allen's Bullets Over Broadway (1994). She has become well-known to filmgoers for both major studio and independent films. In Tom Shadyac's blockbuster Liar Liar (1997), she kept pace with Jim Carrey. Her steamy performance opposite Gina Gershon helped make Lana Wachowski's and Lilly Wachowski's Bound (1996) a breakout indie success at the Sundance Film Festival and then in theatrical release. It also expanded Jennifer's already significant gay and lesbian following. She successfully cultivated another fan base with the revitalization of the \"Child's Play\" horror comedy franchise. For Ronny Yu's La fiancée de Chucky (1998), the filmmakers turned to Jennifer to create the character who would spark the series in a new direction. She met the challenge and established a new horror icon in Tiffany. This Halloween, in Rogue Pictures' all-new Le fils de Chucky (2004), written and directed by series creator Don Mancini, Jennifer again takes the popular series to the next level; she stars as Tiffany and as herself, the deadly doll's favorite actress, who soon becomes an unwitting hostess in more ways than one. Jennifer's pitch-perfect voiceover work as Tiffany is not the only instance of her being able to incarnate a character from the vocal chords out. Families know her distinctive cadences from the recent Disney hits Home on the Range (2004) (in which Jennifer voiced a new-age bovine), directed by Will Finn and John Sanford; The Haunted Mansion (2003) (in which Jennifer acted from the neck up only), directed by Rob Minkoff; and the Pixar blockbuster Monsters, Inc. (2001) (voicing Mike's love interest Celia), directed by Pete Docter, David Silverman and Lee Unkrich. She began her acting career as a teenager, putting herself through the theater program at Stephens College in Missouri by winning writing competitions. She then headed to Los Angeles, California. While she continued to act on the stage (earning a Dramalogue Award for her performance in \"Vanities\"), movies and television immediately came calling for the actress with the unique voice and visage. Over the years, Jennifer has made memorable appearances on some of television's best series, including Hill Street Blues (1981) (in a recurring dramatic role), Cheers (1982), Moonlighting (1985), It's Garry Shandling's Show. (1986) and Frasier (1993). In addition, she has been a favored guest on a number of talk shows, from The Tonight Show Starring Johnny Carson (1962) to The Arsenio Hall Show (1989) to (currently) The Tonight Show with Jay Leno (1992). Those interview segments have encouraged viewers to expect the unexpected from her interplay with the host and the studio audience. Her many films over a two-decade span include Neil Jordan's High Spirits (1988), Oliver Stone's The Doors (1991), Richard Benjamin's Made in America (1993), Roger Donaldson's The Getaway (1994), Joe Pytka's Let It Ride (1989), P.J. Castellaneta's Relax... It's Just Sex (1998), Michael Radford's Dancing at the Blue Iguana (2000), Peter Bogdanovich's The Cat's Meow (2001) (in which she played Louella Parsons). Jennifer Tilly has also continued to act on the stage. She won a Theater World Award for her performance in off-Broadway's \"One Shoe Off\" and starred on Broadway in the 2001 revival of \"The Women\" (which was later taped for, and broadcast on, PBS).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000236","name":"Jennifer Tilly","nicknames":["The Unabombshell","Jenny"],"idIMDB":"nm0000236"},"actorId":"nm0000236","character":"Melinda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dinah Manoff","urlProfile":"http://www.imdb.com/name/nm0001503","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTg2OTA4NF5BMl5BanBnXkFtZTcwNjQzNDg5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1956","placeOfBirth":" New York City, New York, USA","birthName":"Dinah Beth Manoff","height":"5' 4\" (1.63 m)","bio":"Dinah Manoff was born in New York City, New York, to screenwriter Arnold Manoff and actress, director, and writer Lee Grant. She began her professional career in the PBS production of \"The Great Cherub Knitwear Strike\". After subsequent guest appearances on various television series, she received a Tony Award in 1980 for her performance in the Broadway production of Neil Simon's \"I Ought To Be In Pictures\", a role she reprised in the film version, starring opposite Walter Matthau. Additional theater credits include Broadway's \"Leader of the Pack\", \"Alfred and Victoria\", \"Kingdom on Earth\" and the Los Angeles stage production of \"Love Letters\", opposite Patrick Cassidy. On television, Manoff was a regular on Witt-Thomas-Harris' Soap (1977) and also appeared in the television movies The Cover Girl and the Cop (1989) (aka \"Beauty & Denise\"), Raid on Entebbe (1976), For Ladies Only (1981), The Seduction of Gina (1984), A Matter of Sex (1984), Flight 90: Disaster on the Potomac (1984), the miniseries Celebrity (1984) and the NBC movie-of-the-week Babies (1990), with Lindsay Wagner. Manoff's feature film credits include Ordinary People (1980), Grease (1978), Bloodhounds of Broadway (1989), Child's Play (1988), _Backfire (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTg2OTA4NF5BMl5BanBnXkFtZTcwNjQzNDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001503","name":"Dinah Manoff","idIMDB":"nm0001503"},"actorId":"nm0001503","character":"Mrs. Goodson","urlCharacter":"http://www.imdb.com/character/ch0141564","main":true},{"actorName":"Michael Mantell","urlProfile":"http://www.imdb.com/name/nm0544067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjQxNzk3N15BMl5BanBnXkFtZTgwNDkzNzkxODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Michael Mantell is an actor, known for Ocean's Thirteen (2007), The Ides of March (2011) and Secretary (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjQxNzk3N15BMl5BanBnXkFtZTgwNDkzNzkxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544067","name":"Michael Mantell","idIMDB":"nm0544067"},"actorId":"nm0544067","character":"Dr. Goodson","urlCharacter":"http://www.imdb.com/character/ch0141565","main":true},{"actorName":"Chad Jamian","urlProfile":"http://www.imdb.com/name/nm2701263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzI1MDI4Ml5BMl5BanBnXkFtZTgwOTczNzYzNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1984","placeOfBirth":" Hollywood, Florida, USA","height":"5' 9\" (1.75 m)","bio":"Chad Jamian Williams is an actor and writer from South Florida. After starring in dozens of national TV campaigns, he's landed guest and recurring roles in top shows such as 90210, Bones, Desperate Housewives, 2 Broke Girls, and It's Always Sunny in Philadelphia. Chad also portrayed \"Bart\", in Brian Hecker's indie comedy, \"Bart Got a Room\", starring Cheryl Hines and William H. Macy. This Tribeca Film Festival hit was Chad's first feature film role and was shot in his home town.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzI1MDI4Ml5BMl5BanBnXkFtZTgwOTczNzYzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2701263","name":"Chad Jamian","idIMDB":"nm2701263"},"actorId":"nm2701263","character":"Bart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bambi la Fleur","urlProfile":"http://www.imdb.com/name/nm5084287","urlPhoto":"","biography":{"bio":"Bambi la Fleur is an actress, known for Bart Got a Room (2008) and Murder in Miami (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5084287","name":"Bambi la Fleur","idIMDB":"nm5084287"},"actorId":"nm5084287","character":"Destiny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Azouz","urlProfile":"http://www.imdb.com/name/nm5269416","urlPhoto":"","biography":{"dateOfBirth":"1 May 1918","placeOfBirth":" New Jersey, USA","bio":"Sam Azouz was born to parents Rika (later, Rebecca) Zaraya and Isaac Azouz, Sephardic immigrants from Salonica, Greece. He was the fifth of six children (Solomon, Safira [Sophie], Gentille [Jean], Clara [Claire], Simuel [Sam], and Y'uda [Louis]). He was married to Sarah Horowitz, who passed away in 1991. His small part in Bart Got a Room originated when his long-time girlfriend, Edith's, piano student mentioned her son needed to cast the part, for which she thought Sam would be perfect.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5269416","name":"Sam Azouz","idIMDB":"nm5269416"},"actorId":"nm5269416","character":"Uncle Walter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betty Knowles","urlProfile":"http://www.imdb.com/name/nm3390831","urlPhoto":"","biography":{"bio":"Betty Knowles is an actress, known for Bart Got a Room (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3390831","name":"Betty Knowles","idIMDB":"nm3390831"},"actorId":"nm3390831","character":"Aunt Rose","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0472050","urlIMDB":"http://www.imdb.com/title/tt0472050","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$32,764","country":"USA","day":"05","month":"04","year":"2009","remarks":"11 Screens"}],"gross":[{"money":"$53,760","country":"USA","day":"19","month":"04","year":"2009","remarks":""},{"money":"$49,766","country":"USA","day":"12","month":"04","year":"2009","remarks":""},{"money":"$32,764","country":"USA","day":"05","month":"04","year":"2009","remarks":""}],"weekendGross":[{"money":"$625","country":"USA","day":"19","month":"04","year":"2009","remarks":"1 Screen"},{"money":"$7,572","country":"USA","day":"12","month":"04","year":"2009","remarks":"4 Screens"},{"money":"$32,764","country":"USA","day":"05","month":"04","year":"2009","remarks":"11 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Bart Got a Room, LLC"},"technical":{"runtime":["1 hr 20 min (80 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex 16 SR3 Advanced"],"laboratory":["Cineworks Digital Studios, Miami (FL), USA"],"filmLength":null,"negativeFormat":["16 mm"],"cinematographicProcess":["Super 16"],"printedFilmFormat":null},"rating":"5.7","metascore":"57","filmingLocations":[{"location":"Hollywood, Florida, USA"}],"rated":"R","awards":[{"award":"Ft. Lauderdale International Film Festival 2008","titlesAwards":[{"titleAwardOutcome":"Won International Film Guide Award","categories":[{"category":"","names":[{"name":"Brian Hecker","id":"nm0373033","role":null}]}]}]}],"votes":"3,844","type":"Movie","companyCreditsSimple":[{"idCompany":"co0092056","name":"Basra Entertainment"},{"idCompany":"co0113146","name":"Plum Pictures"},{"idCompany":"co0053881","name":"SHRINK Media Inc."}],"keywords":{"keywords":["prom","best friend","masturbation","voice over narration","teenage boy","teen angst","swimming pool","school dance","restroom","prom dress","nerd","limousine","hooker","high school dance","happy ending","divorced parents","dancing","bar mitzvah","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:03:57"}}