{"data":{"movies":[{"title":"Wilderness","originalTitle":"","year":"2006","releaseDate":"20070314","directors":[{"name":"Michael J. Bassett","id":"nm1068186"}],"writers":[{"name":"Dario Poloni","id":"nm0689785"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjkyNjU4OV5BMl5BanBnXkFtZTcwNzk4NTU0MQ@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Horror"],"plot":"In a juvenile detention center, the inmate Dave commits suicide after being abused with his friend Lindsay by the sociopath bullies Steve and Lewis under the indifference of the other cell-mates. The governor sends them to an uninhabited island to improve their relationships and characters under the command of the tough monitor Jed. They meet another camping with female delinquents under the command of veteran soldier Louise and they camp in another area. However, when they are attacked by a pack of dogs and a mysterious man with a cross-bow wearing camouflage, they join forces fighting to survive under the leadership of Callum.","simplePlot":"Juvenile delinquents gets sent to a small British island after a fellow prisoners death, where they have to fight for survival.","actors":[{"actorName":"Sean Pertwee","urlProfile":"http://www.imdb.com/name/nm0675730","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDcwNjkxMV5BMl5BanBnXkFtZTgwNTM5MzcwMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1964","placeOfBirth":" London, England, UK","height":"6' (1.83 m)","bio":"Sean Pertwee was born into a theatrical dynasty of actors. After training at the Bristol Old Vic Theatre School, Sean began his acting career with the Royal Shakespeare Company, most notably starring in Titus Andronicus directed by Deborah Warner. After touring for three years, Sean continued his classical training by playing Julius Caesar for the BBC and Macbeth for Michael Bogdanov's production for C4 films. Since then, he has become instantly recognizable for both his film and television work. On film, Sean began on the Joe Orton's biopic Prick Up Your Ears (1987), then went on to appear in Paul W.S. Anderson's Shopping (1994), playing opposite Jude Law. Followed by performances in Event Horizon (1997), Soldier (1998), Doomsday (2008), Love, Honor and Obey (2000), and the lead role in Neil Marshall's Dog Soldiers (2002). Other notable film credits include Screen Two: Deadly Voyage (1996); Wild Bill (2011); Blue Juice (1995), in which Sean played opposite Catherine Zeta-Jones and Ewan McGregor; and Formula 51 (2001) with Samuel L. Jackson and Robert Carlyle. Most recently, Sean played opposite Steve Coogan in Alan Partridge (2013). Sean's extensive TV work saw him recently play the iconic role of Lestrade in the CBS show Elementary (2012) with Jonny Lee Miller as Sherlock Holmes. He has also starred in The Musketeers (2014), Agatha Christie's Poirot (1989), the award-winning Luther (2010), and had a recurring role in the hugely popular Cold Feet (1997) with 'James Nesbitt' (I)_. Sean's other TV credits include Skins (2007), Bodyguards (1996), Jo (2013) with 'Jean Reno', Chancer (1990), The Young Indiana Jones Chronicles (1992), Clarissa (1991) with Sean Bean, and Camelot (2011) with Joseph Fiennes and Eva Green. Sean is set to appear as Alfred Pennyworth the unflappable butler, in the new Warner Bros. series Gotham (2014), which follows the story behind Commissioner James Gordon's rise to prominence in Gotham City in the years before Batman's arrival. Sean is a popular voiceover artist and can frequently be heard voicing documentaries, animated films, commercials, TV series, and video games, including Fable, Killzone, and Assassin's Creed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDcwNjkxMV5BMl5BanBnXkFtZTgwNTM5MzcwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0675730","name":"Sean Pertwee","idIMDB":"nm0675730"},"actorId":"nm0675730","character":"Jed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Reid","urlProfile":"http://www.imdb.com/name/nm0717157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMzMwMzA2Nl5BMl5BanBnXkFtZTcwOTA1NTcxOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Alex Reid was born in Penzance, Cornwall, England. She is an actress, known for The Descent (2005), Wilderness (2006) and Arachnid (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMzMwMzA2Nl5BMl5BanBnXkFtZTcwOTA1NTcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0717157","name":"Alex Reid","idIMDB":"nm0717157"},"actorId":"nm0717157","character":"Louise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Toby Kebbell","urlProfile":"http://www.imdb.com/name/nm1527905","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDc5MDg0NV5BMl5BanBnXkFtZTcwNjIwNzkzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1982","placeOfBirth":" Pontefract, Yorkshire, England, UK","height":"6' 2\" (1.88 m)","bio":"Toby Kebbell was born in 1982 in Pontefract, Yorkshire. He then moved to Nottinghamshire, where he grew up. Aged 17 he joined the Central Television Workshop in Nottingham. Toby's breakthrough came when Shane Meadows saw him at the Central Television Workshop and cast him in the role of Anthony in the film Dead Man's Shoes opposite Paddy Considine. He only had three days to prepare for the film but his sensitive, moving portrayal of a youngster with learning difficulties saw him earn a nomination for the Most Promising Newcomer Award at the British Independent Film Awards. It was followed by appearances in Oliver Stone's Alexander and Match Point, which Woody Allen cast him in without audition after watching him in Dead Man's Shoes. Kebbell's most critically acclaimed role came in the 2007 biopic of Ian Curtis, Control. He played Rob Gretton, the manager of Joy Division under direction by Anton Corbijn, and won the Best Supporting Actor Award at the British Independent Film Awards, beating off challenges by Cate Blanchett, Colin Firth and Control co-star Samantha Morton. He was also nominated for the London Critics' Circle Best Supporting Actor Award alongside Albert Finney and Tom Wilkinson. In 2008 Toby played the title role in Guy Ritchie's RocknRolla, with Tom Wilkinson, Gerard Butler, Thandie Newton and Mark Strong. He provided the standout performance as the crack-addicted musician, Johnny Quid. Kebbell lost 1 and a half stones in a matter of a few weeks to play the emaciated rocker. The Sun subsequently awarded Toby their 2008 Best Actor nod for the performance and noted he was \"a star of the future\". Kebbell has finished filming for Cheri, directed by Stephen Frears and to be released in 2009, in which he takes a small role alongside Michelle Pfeiffer. He is filming in Morocco and London with Jake Gyllenhall and Sir Ben Kingsley for the new Jerry Bruckheimer epic Prince of Persia: Sands of Time. His TV work includes playing the lead 'Paul' in a heart-wrenching episode of Jimmy McGovern's BAFTA winning BBC series The Street, and a modern retelling of Macbeth alongside James McAvoy. Toby's theatre credits include spells at the Almeida in David Hare's rework of Maxim Gorky's \"Enemies\" Directed by Michael Attenborough. And at the Playhouse, under David Grindleys direction of R.C. Sherriff's classic, \"Journey's End\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDc5MDg0NV5BMl5BanBnXkFtZTcwNjIwNzkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1527905","name":"Toby Kebbell","idIMDB":"nm1527905"},"actorId":"nm1527905","character":"Callum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Wight","urlProfile":"http://www.imdb.com/name/nm1643154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0OTk2Njc2MF5BMl5BanBnXkFtZTcwODIyNDYwNQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1980","placeOfBirth":" Romford, Essex, England, UK","birthName":"Stephen Gray","bio":"Stephen Wight was born on February 27, 1980 in Romford, Essex, England as Stephen Gray. He is an actor, known for Wilderness (2006), Fingersmith (2005) and Highlander: The Source (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0OTk2Njc2MF5BMl5BanBnXkFtZTcwODIyNDYwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1643154","name":"Stephen Wight","idIMDB":"nm1643154"},"actorId":"nm1643154","character":"Steve","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luke Neal","urlProfile":"http://www.imdb.com/name/nm1739987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMDc3Njc1NV5BMl5BanBnXkFtZTgwODA5MDE0NjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Luke Neal is an actor, known for Jupiter Ascending (2015), Halo: Nightfall (2014) and SS-GB (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMDc3Njc1NV5BMl5BanBnXkFtZTgwODA5MDE0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1739987","name":"Luke Neal","idIMDB":"nm1739987"},"actorId":"nm1739987","character":"Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben McKay","urlProfile":"http://www.imdb.com/name/nm1544444","urlPhoto":"","biography":{"bio":"Ben McKay is an actor, known for Hot Fuzz (2007), Kidulthood (2006) and Wilderness (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1544444","name":"Ben McKay","idIMDB":"nm1544444"},"actorId":"nm1544444","character":"Lindsay","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lenora Crichlow","urlProfile":"http://www.imdb.com/name/nm1564072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyOTQ1MjcwNV5BMl5BanBnXkFtZTcwMzQ5NTg1NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1985","placeOfBirth":" Westminster, London, England, UK","birthName":"Lenora Isabella Crichlow","height":"5' 5½\" (1.66 m)","bio":"Lenora Crichlow was born on January 4, 1985 in Westminster, London, England as Lenora Isabella Crichlow. She is an actress, known for Being Human (2008), Fast Girls (2012) and Sugar Rush (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyOTQ1MjcwNV5BMl5BanBnXkFtZTcwMzQ5NTg1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1564072","name":"Lenora Crichlow","nicknames":["Lea"],"idIMDB":"nm1564072"},"actorId":"nm1564072","character":"Mandy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karly Greene","urlProfile":"http://www.imdb.com/name/nm1838002","urlPhoto":"","biography":{"dateOfBirth":"24 September 1987","placeOfBirth":" Belfast, Northern Ireland, UK","birthName":"Karly Rose Greene","height":"5' 5\" (1.65 m)","bio":"Born Karly Rose Greene in Belfast, Northern Ireland, on September 24th, 1987 to Stephen and Amanda Greene. She has two younger sisters, Louise and Lauren, who were more academically focused. Raised in Newtownabbey, she attended Monkstown Community School until the age of 16. Her stage credits include Sandy in the hit musical Grease and after this role, she joined Dealer's Agency, in Belfast where she was encouraged to attend a Summer Drama School with Centre Stage, run by Roma Tomelty and Colin Carnegie were she continued to enjoy theatre acting. At 15, she landed her first major role as Katie in the Oscar-nominated Everything in This Country Must (2004), a short film directed by Gary McKendry and based on the short story written by Colum McCann. Before this, the actress only worked on advertisements, and Billboards.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1838002","name":"Karly Greene","idIMDB":"nm1838002"},"actorId":"nm1838002","character":"Jo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Deacon","urlProfile":"http://www.imdb.com/name/nm0212563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY3MjQ1Njg3OV5BMl5BanBnXkFtZTcwMTYyODM0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1983","placeOfBirth":" London, England, UK","height":"5' 5\" (1.65 m)","bio":"Adam Deacon is an actor and rapper from Hackney, East London. His father is from Morocco, and walked out on the family when Adam was just 2 years old. At the age of 12 Deacon began to act and trained at the Anna Scher Theatre. His early career included work with Y Touring Theatre Company, with whom he appeared in a number of tours including Cracked by Nicola Baldwin. Deacon co-starred in West 10 LDN, a Kidulthood-like TV program made by Noel Clarke. He has also starred as 'Bones' in an MTV show called Dubplate Drama. His next role was in 4.3.2.1, a heist movie, released in June 2010 which also starred Tamsin Egerton, Emma Roberts and Noel Clarke, who directed the film. Recently Adam co-wrote, co-directed and played the lead role in Anuvahood, which was released on March 18 2011. The film is described as, \"A pulls-no-punches, coming-of-age story, centering on one directionless hopeless 'shotter', who finds his true worth in the face of urban adversity.\" Adam has featured in various music videos including; Bashy's \"Who wants to be a millionaire\" and Chipmunk's Chip Diddy Chip. He is also a musician and musical performer most noted for his two tracks on the soundtrack to Adulthood. The tracks are: 'Adamhood' and 'On It 08'","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY3MjQ1Njg3OV5BMl5BanBnXkFtZTcwMTYyODM0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0212563","name":"Adam Deacon","idIMDB":"nm0212563"},"actorId":"nm0212563","character":"Blue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richie Campbell","urlProfile":"http://www.imdb.com/name/nm1951953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MjczMDYwOF5BMl5BanBnXkFtZTcwMTcwMzY4OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Richie Campbell is an actor and assistant director, known for Alien: Isolation (2014), The Firm (2009) and Wilderness (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MjczMDYwOF5BMl5BanBnXkFtZTcwMTcwMzY4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1951953","name":"Richie Campbell","idIMDB":"nm1951953"},"actorId":"nm1951953","character":"Jethro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Don","urlProfile":"http://www.imdb.com/name/nm1651043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMDQzMTA1MF5BMl5BanBnXkFtZTYwNDcyNDA4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Stephen Don grew up in County Down, Northern Ireland. He worked in London as an actor and appeared in the award-winning West End play, The Weir. Returning to his home in 2000, Stephen carved out a successful career as a character actor on TV and in film. In 2005, he played the revenge-driven father in Michael J. Bassett's Wilderness. He followed this up with a key scene opposite Julie Walters in a biopic of Mo Mowlam for TV and, in 2010, he joined the cast of Game of Thrones as the malignant Stiv. As well as acting, Stephen has been carving out a career on the other side of the camera. In 2008, he set up a film production company: Silver Sombrero Pictures Ltd. In 2009, he wrote and produced his first short for the company -Grand Mal -with funding from Northern Ireland Screen. Thus far, Stephen has produced 3 shorts and they have been screened at festivals in Europe and the USA. In 2012, Stephen wrote, produced & directed his first feature film -Faraway. This was shown at the Belfast Film Festival in April 2013 and subsequently at the Polish Cultural Week in April 2014. Faraway is an Art House Thriller in three languages (Chinese, Polish, and English), shot on an unbelievably small budget. With 3 new projects in various stages of development, Stephen is gearing up to make the leap up from micro budget to bigger budget in the coming years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMDQzMTA1MF5BMl5BanBnXkFtZTYwNDcyNDA4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1651043","name":"Stephen Don","idIMDB":"nm1651043"},"actorId":"nm1651043","character":"Dave's Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Travers","urlProfile":"http://www.imdb.com/name/nm1290740","urlPhoto":"","biography":{"dateOfBirth":"31 January 1989","placeOfBirth":" Belfast, Northern Ireland, UK","height":"5' 8\" (1.73 m)","bio":"In 2005-6 John played James in 48 Angels, Marion Comer's unusual feature where Michael O'Dwyer (of the Irish Times) commented on John's great screen presence. Wilderness was the horror genre film where he played the vital role of Davy, & now he can be seen as Young Quinlan (Pete Postlethwaite is the older version) in Lord Attenborough's feature Closing the Ring. John has just returned from Germany where he worked with Colin Bateman & Roy Marsden on his feature in development, Mohamed Maguire, schooled by John Irvin et al for Moonstone. Out in 2008 was his next feature film lead role, Colin in Macdara Vallely's Peacefire. It's up with his best work. Earlier John had been named Best Actor at the Cherbourg Film Festival after the showing there on Friday 10th October 2003 of Aisling Walsh's incredible Song for a Raggy Boy. The film also won the audience award at this Normandy Film festival specialising in the best British and Irish recent releases. John attended press conferences with Iain Glen and Aidan Quinn at the Edinburgh and Cork Film Festivals, telling of his performance as Liam Mercier (lead boy). The feature sold by Lola Films for Subotica Entertainment played Sundance, Seattle, Tribeca, Newport Beach, Los Angeles, Karlovy Vary, Cork, Ghent, Lyubyana, Bergen, Gothenberg, Copenhagen, Birmingham, Edinburgh and Salerno festivals to brilliant effect, picking up eighteen awards and bringing massive praise to John. Its NI premiere was in the Belfast Festival on March 29th 2004 and then it played nationally from Friday April 9th. Dorothy Macgabhann cast it. The movie had played in the republic of Ireland from October 2003 and many territories worldwide thereafter. Late 2005 John played James in 48 Angels directed by Marion Comer. This feature was produced by Robert Medema and John McDonnell for Reflected Light Pictures. John also played a boy called John in the pilot for Oranges are Blue, the Lab-Ky-Mo film to be shot here next year for Kalm Boy Films, and Colin in the original pilot for Peacefire. He made appearances in Man about Dog, the Treasure Films shoot of Pearse Elliott's script directed by Paddy Breathnach and Pearse's own film, The Mighty Celt opposite Robert Carlyle. He also played the boy in the Oscar-nominated short film Everything in This Country Must, directed by Gary McKendry. He was also in the Irish feature 5 Day Shelter, out in 2009, produced by Villi Ragnarsson. Michael was a character he improvised for the HARP Inclusion Education DVD produced by Morrow, & he also made a Youth Justice Conference DVD for Inferno, and an anti-knife attack cinema campaign for SpotOn & Genesis, an Adidas campaign for MJZ opposite several footballers including Jermaine Defoe, Del Piero, Djibril Cisse, Ashley Cole and David Trezeguet, shot in St. Albans by Fredrik Bond; also a Dublin anti-litter campaign and an Invest NI ad. He was photographed as a paperboy and with brother Mark en famille for 2 BT photo campaigns produced by A.V. Browne. Not bad for a great young lad who was a boxer, not an actor 9 years ago. From the New Lodge in Belfast, John was born the middle of 3 children (Fiona is older and Mark is younger) to mum & dad Kate & John (Bap), and attended St. Patrick's college Belfast (as had Martin McCann earlier). His birthdate was 31st January 1989. Another astounding piece of work by this able performer has been an NSPCC radio campaign featuring John, again as a troubled kid, this time suicidal. The campaign got widely noticed and aided children in difficulty by offering them a chance to help themselves through a website. Much more to come from this pleasant, intelligent, very real young man, so un-actorish that his great skill barely shows, such is his unerring intuition & handle on what is real, painful & vulnerable about youth. In theatre he has been in work for Belfast companies Replay, Tinderbox, Jigsaw and C21, for directors Mick Duke, Anna Newell, Peter Quigley and Paul Kennedy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1290740","name":"John Travers","idIMDB":"nm1290740"},"actorId":"nm1290740","character":"Dave","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Shane","urlProfile":"http://www.imdb.com/name/nm0788036","urlPhoto":"","biography":{"bio":"George Shane was born in Belfast, Northern Ireland. He was an actor, known for Resurrection Man (1998), Divorcing Jack (1998) and Closing the Ring (2007). He died on March 9, 2016 in Derry, Northern Ireland.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0788036","name":"George Shane","idIMDB":"nm0788036"},"actorId":"nm0788036","character":"Governor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gordon Fulton","urlProfile":"http://www.imdb.com/name/nm1101680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzMzMjE3OF5BMl5BanBnXkFtZTgwMzc1MjAxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9¾\" (1.77 m)","bio":"Gordon Fulton was born in Bangor, County Down, Northern Ireland. He was an actor, known for Wilderness (2006), Flying Saucer Rock'n'Roll (1998) and Sunset Heights (1999). He died on September 25, 2016 in Derry, Northern Ireland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzMzMjE3OF5BMl5BanBnXkFtZTgwMzc1MjAxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1101680","name":"Gordon Fulton","idIMDB":"nm1101680"},"actorId":"nm1101680","character":"Boat's Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Rea","urlProfile":"http://www.imdb.com/name/nm2698545","urlPhoto":"","biography":{"bio":"John Rea is an actor, known for Wilderness (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2698545","name":"John Rea","idIMDB":"nm2698545"},"actorId":"nm2698545","character":"Counsellor John","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0465670","urlIMDB":"http://www.imdb.com/title/tt0465670","business":{"budget":{"money":"£3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"£24,463","country":"UK","day":"03","month":"09","year":"2006","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2005/\">2005</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","filmingLocations":[],"rated":"R","awards":[],"votes":"8,014","type":"Movie","companyCreditsSimple":[{"idCompany":"co0049085","name":"Momentum Pictures"},{"idCompany":"co0136252","name":"Baker Street"},{"idCompany":"co0103777","name":"Ecosse Films"}],"keywords":{"keywords":["island","bully","juvenile detention","prisoner","survival","suicide","death","camouflage","dog","juvenile delinquent","bare chested male bondage","urinating on someone","british horror","one word title","swastika tattoo","nazi","murder","human prey","coast","beach","obscene finger gesture","bear trap","booby trap","gasoline","stabbed with an arrow","killed with an arrow","head butt","person on fire","hanging upside down","eating a dog","campfire","knife","survival knife","killing a dog","death of dog","animal trap","boyfriend girlfriend relationship","finger bitten off","german shepherd","handcuffs","cabin","tent","urination","campsite","falling off a cliff","pushed off a cliff","falling from height","bullying","ex soldier","loss of son","criminal","forest","crossbow","teenage girl","teenage boy","teenager","locked in a closet","prison guard","convict","manhunt","stabbed in the stomach","wilderness","scottish highlands","violence","government conspiracy","woods","wild dog","torso cut in half","survival horror","stabbed in the throat","stabbed in the chest","stabbed in the back","split head","slasher","shot through the mouth","shot in the leg","shot in the head","shot in the face","shot in the eye","shot in the chest","shot in the arm","sex","sex crime","severed head","severed finger","severed arm","revenge","prison","intestines","head blown off","gore","drowning","dismemberment","crushed head","brutality","boat","blood","attempted rape","arrow","animal attack","death of son","camping"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:25:04"}}