{"data":{"movies":[{"title":"The Messengers","originalTitle":"","year":"2007","releaseDate":"20070202","directors":[{"name":"Danny Pang","id":"nm0659380"},{"name":"Oxide Chun Pang","id":"nm0161152"}],"writers":[{"name":"Mark Wheaton","id":"nm1187126"},{"name":"Todd Farmer","id":"nm0267805"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMjMzMTMwOF5BMl5BanBnXkFtZTcwNDA4MDIzMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"It's been six years since the Rollins family just up and left and now the troubled Solomon family has come from Chicago, to rebuild their lives following their sons hospitalization due to their daughter's drunk driving accident. But as they start to settle in something odd and strange begins to occur to their son. Could something supernatural be at work, and did the previous family just leave...or are they still here? Trapped in the only place they've ever known? And what did cause their deaths? Most of all...is this 'killer' still very much alive?","simplePlot":"An ominous darkness invades a seemingly serene sunflower farm in North Dakota, and the Solomon family is torn apart by suspicion, mayhem and murder.","actors":[{"actorName":"Kristen Stewart","urlProfile":"http://www.imdb.com/name/nm0829576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjUyOTY0Ml5BMl5BanBnXkFtZTcwNjI2MjA2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1990","placeOfBirth":" Los Angeles, California, USA","birthName":"Kristen Jaymes Stewart","height":"5' 5\" (1.65 m)","bio":"Though most famous for her role as Isabella \"Bella\" Swan in The Twilight (2008) Saga, Kristen Stewart has been a working actor since her early years in Los Angeles, California, where she was born. Her parents, John Stewart and Jules Stewart, both work in film and television. Her mother is Australian. The family includes three boys, her older brother Cameron Stewart and two adopted brothers Dana and Taylor. After a talent scout caught her grade school performance in a Christmas play at the age of eight, she appeared on television in a few small roles. Her first significant role came when she was cast as Sam Jennings in The Safety of Objects (2001). Soon after that, she starred alongside Jodie Foster in the hit drama, Panic Room (2002) and was nominated for a Young Artist Award. Praised for her Panic Room performance, she went on to join the cast of Cold Creek Manor (2003) as the daughter of Dennis Quaid and Sharon Stone. Though the film did not do well at the box office, she received another nomination for a Young Artist Award. After appearing in a handful of movies and a Showtime movie called Speak (2004), Stewart was cast in the role of a teenage singer living in a commune in Sean Penn's Into the Wild (2007), a critically acclaimed biopic. A third Young Artist Award nomination resulted in a win for this role. She also appeared in Mary Stuart Masterson's The Cake Eaters (2007) that same year. Just 17, Stewart took on the starring role in Twilight (2008) which was based on a series of the same name written by Stephenie Meyer, the novel already had a huge following and the film opened to fans anxious to see the vampire romance brought to life. Awarded the MTV Movie Award for Best Female Performance, Stewart's turn as Bella continued in the sequels The Twilight Saga: New Moon (2009) and The Twilight Saga: Eclipse (2010). The final installments of the series start filming in late 2010. Despite her stratospheric launch into stardom with the Twilight films, she stayed true to her roots by working on a number of indie projects, including Adventureland (2009) (filmed prior to the Twilight series) and Welcome to the Rileys (2010). And she took on the daunting task of playing hard rocker Joan Jett in Floria Sigismondi's The Runaways (2010) alongside Dakota Fanning. Stewart received praise for her acting and musical performances and later won the 2010 BAFTA Rising Star Award and best actress at the Milan International Film Festival for Welcome to the Rileys (2010). Stewart starred in several other movies filmed between the Twilight Saga installments including the #1 summer box office hit, Snow White and the Huntsman (2012), and the Cannes selection Sur la route (2012) A few of Stewart's following projects are: Sundance drama Camp X-Ray (2014), Cannes selection Sils Maria (2014) for which she won a César award, and the Lionsgate distributed action comedy, American Ultra (2015), starring the Adventureland (2009) duo. Stewart continues to live in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjUyOTY0Ml5BMl5BanBnXkFtZTcwNjI2MjA2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829576","name":"Kristen Stewart","nicknames":["Kris","KStew","Stew"],"idIMDB":"nm0829576"},"actorId":"nm0829576","character":"Jess","urlCharacter":"http://www.imdb.com/character/ch0062655","main":true},{"actorName":"Dylan McDermott","urlProfile":"http://www.imdb.com/name/nm0001518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjY2NzU4OF5BMl5BanBnXkFtZTcwODg2NDc4Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1961","placeOfBirth":" Waterbury, Connecticut, USA","birthName":"Mark Anthony McDermott","height":"6' (1.83 m)","bio":"A Golden Globe winner and Emmy nominee, Dylan McDermott has proved his talent in film, television and theater. He was born Mark Anthony McDermott in Waterbury, Connecticut, to Diane (Marino) and Richard McDermott. Diane was 15 and Richard was 17 when Dylan was born. Richard earned money by hustling pool. Dylan is of Italian (from his maternal grandfather), Irish, English and French descent. During Dylan's early years, his parents separated. In 1967, when Dylan was five, his mother was murdered by her live-in boyfriend. The murder was initially ruled an accidental shooting occurring while her boyfriend cleaned his gun, but police reopened the case in 2012 and revealed evidence showing it was impossible for her death to be have been accidental. Dylan and his sister Robin, who was then six months old, were taken in by their grandmother, Avis (Rogers) Marino. When Dylan was 15, his father met and married playwright/activist Eve Ensler. Eve adopted Dylan. Eve encouraged him to go to acting school and Fordham University in New York City. He met his now ex-wife, Shiva Rose, at a coffee shop in Venice, California, on the same day he got a big acting break by being cast in the film In the Line of Fire (1993) with Clint Eastwood. As a result of his connection with Eastwood, Dylan attended a dinner honoring Clint. There, he met Jeffrey Kramer, a man who used to frequent a bar where Dylan had earlier worked. Kramer was, at that time, the president of David E. Kelley Productions. He asked Dylan to meet David E. Kelley for a then-upcoming series about lawyers, The Practice (1997), and the rest was history. Another mentor of Dylan is Joanne Woodward, who discovered him while he was doing workshops at the Neighborhood Playhouse. The series earned him a Golden Globe in 1999 and nominations in 2000 and 2001, as well as an Emmy nomination in 1999. His film credits include The Pang Brother's The Messengers (2007); Wonderland (2003); Home for the Holidays (1995); Steel Magnolias (1989); Hamburger Hill (1987); Miracle on 34th Street (1994); In the Line of Fire (1993) and Burning Palms (2010). McDermott's television credits include the Jerry Bruckheimer-produced TNT drama, Dark Blue (2009); and TNT's dramatic limited series, The Grid (2004), opposite Julianna Margulies. In 2008, McDermott starred in Nicky Silver's \"Three Changes\" at Playwrights Horizons. Starring opposite Maura Tierney, the play follows an uncomfortably married Upper West Side couple. Additionally, in September 2006, McDermott was on stage in Eve Ensler's new play, \"The Treatment\". Ensler's play explored the relationship between a traumatized former military interrogator (McDermott) and his psychologist Colonel, who is assigned to give him routine treatment. The play opened the Impact Festival 2006, a New York City-wide arts festival as part of the Culture Project. McDermott was nominated for a Drama League Award for his performance. McDermott appeared on television in the first season of Ryan Murphy and Brad Falchuk's FX drama, American Horror Story (2011), opposite Connie Britton and Jessica Lange. McDermott co-starred in Jay Roach's comedy, The Campaign (2012), opposite Will Ferrell and Zach Galifianakis. McDermott played \"Tim Wattley\", a political consultant who runs the campaign of a candidate from North Carolina. The Warner Bros. film was released on August 10, 2012. That year, McDermott was also seen in the indie coming-of-age drama, The Perks of Being a Wallflower (2012), alongside Logan Lerman (playing Lerman's character's father), Emma Watson, Paul Rudd, Ezra Miller and Mae Whitman. In 2013, McDermott had a supporting role in Antoine Fuqua's Olympus Has Fallen (2013), alongside Aaron Eckhart and Gerard Butler. The film followed a former Secret Service agent who becomes America's only hope when the President is taken hostage by terrorists. McDermott's additional theatre credits include Neil Simon's production of \"Biloxi Blues\" on Broadway and \"Golden Boy\", directed by Joanne Woodward at the Williamstown Theater Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjY2NzU4OF5BMl5BanBnXkFtZTcwODg2NDc4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001518","name":"Dylan McDermott","idIMDB":"nm0001518"},"actorId":"nm0001518","character":"Roy","urlCharacter":"http://www.imdb.com/character/ch0020756","main":true},{"actorName":"Penelope Ann Miller","urlProfile":"http://www.imdb.com/name/nm0000542","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDc3MDA4M15BMl5BanBnXkFtZTgwNzYzNDcyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1964","placeOfBirth":" Los Angeles, California, USA","birthName":"Penelope Andrea Miller","height":"5' 7\" (1.7 m)","bio":"Penelope Ann Miller is the middle of three daughters born to Mark Miller, known as the father on Please Don't Eat the Daisies (1965) and later a writer and filmmaker, who wrote A Walk in the Clouds (1995), and Beatrice Miller (Beatrice Ammidown), who worked for Diana Vreeland as a fashion editor for \"Harper's Bazaar\". She graduated from high school in L.A. and moved to New York at 18, where she studied theater/acting at HB Studios under Herbert Berghof. Two years later, Miller got her big break on Broadway, when she originated the role of \"Daisy Hanningan\" in Neil Simon's Tony Award-winning play, \"Biloxi Blues\". Later, she would reprise her role in Universal's film version, directed by Mike Nichols. In 1988, she starred in Great Performances: Our Town (1989), with Eric Stoltz and Spalding Gray, and was nominated for a Tony award for her performance as \"Emily\". Her career most recently includes the 2012 Academy award Best Picture winner, The Artist (2011), co-starring opposite Best Actor winner, Jean Dujardin, directed by Michel Hazanavicius, who also won Best Director that year and was released by The Weinstein Co. Penelope has shared the screen with some of the most notable and renowned leading men and directors in Hollywood and around the world. This impressive list includes Al Pacino and Sean Penn in director Brian De Palma's Carlito's Way (1993), for which she received a Golden Globe nomination; Marlon Brando and Matthew Broderick in The Freshman (1990), directed by Andrew Bergman; Robert De Niro and Robin Williams in Penny Marshall's Awakenings (1990); Robert Downey Jr. in Sir Richard Attenborough's Chaplin (1992); The Shadow (1994) with Alec Baldwin; Danny DeVito and Gregory Peck in Norman Jewison's Other People's Money (1991); Matthew Broderick and Christopher Walken in Mike Nichols' Biloxi Blues (1988); and Arnold Schwarzenegger in Ivan Reitman's Kindergarten Cop (1990) and she starred in Rob Reiner's, film Flipped (2010), for which he wrote and directed for Warner Bros. She was last seen in ABC's hot new show, Mistresses (2013) (2013/14), and in the critically-acclaimed, Men of a Certain Age (2009), opposite Ray Romano (2009/10/2011). Miller's credits also include Sony Pictures' box office hit, The Messengers (2007), which opened #1. The supernatural thriller was produced by Sam Raimi. Miller starred opposite Kristen Stewart, John Corbett and Dylan McDermott. She also starred in Think Films' slapstick comedy, Funny Money (2006), opposite Chevy Chase, in which her performance was compared to Lucille Ball and Carole Lombard in their heydays. Miller was named \"Star of Tomorrow\" by the Motion Picture Bookers Club and \"Most Promising Actress\" by the Chicago Film Critics Association. She received a special jury award for Best Performance at the Hollywood Film Festival for her role in the independent feature, Rhapsody in Bloom (1998), and a Tony Award nomination for her portrayal of \"Emily\" in Broadway's Tony-winning revival of \"Our Town\". Miller's television credits include Rocky Marciano (1999), opposite Jon Favreau and George C. Scott; The Last Don (1997), opposite Joe Mantegna; Mary Kay Letourneau: All American Girl (2000), for which she won critical acclaim, and Rudy: The Rudy Giuliani Story (2003), opposite James Woods. Miller lives in Los Angeles with her husband and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDc3MDA4M15BMl5BanBnXkFtZTgwNzYzNDcyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000542","name":"Penelope Ann Miller","idIMDB":"nm0000542"},"actorId":"nm0000542","character":"Denise","urlCharacter":"http://www.imdb.com/character/ch0020757","main":true},{"actorName":"John Corbett","urlProfile":"http://www.imdb.com/name/nm0179173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Nzg1MjY2M15BMl5BanBnXkFtZTcwMTU5MTQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1961","placeOfBirth":" Wheeling, West Virginia, USA","birthName":"John Joseph Corbett Junior","height":"6' 5\" (1.96 m)","bio":"John Corbett was born on May 9, 1961 in Wheeling, West Virginia, USA as John Joseph Corbett Junior. He is an actor, known for Northern Exposure (1990), Raising Helen (2004) and Volcano (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Nzg1MjY2M15BMl5BanBnXkFtZTcwMTU5MTQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0179173","name":"John Corbett","idIMDB":"nm0179173"},"actorId":"nm0179173","character":"Burwell","urlCharacter":"http://www.imdb.com/character/ch0109946","main":true},{"actorName":"Evan Turner","urlProfile":"http://www.imdb.com/name/nm2174133","urlPhoto":"","biography":{"bio":"Evan Turner is an actor, known for The Messengers (2007) and She's the Man (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2174133","name":"Evan Turner","idIMDB":"nm2174133"},"actorId":"nm2174133","character":"Ben","urlCharacter":"http://www.imdb.com/character/ch0054777","main":true},{"actorName":"Theodore Turner","urlProfile":"http://www.imdb.com/name/nm2512135","urlPhoto":"","biography":{"bio":"Theodore Turner is an actor, known for The Messengers (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2512135","name":"Theodore Turner","idIMDB":"nm2512135"},"actorId":"nm2512135","character":"Ben","urlCharacter":"http://www.imdb.com/character/ch0054777","main":true},{"actorName":"William B. Davis","urlProfile":"http://www.imdb.com/name/nm0205657","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MDgyMzYyNl5BMl5BanBnXkFtZTcwNDg5ODY4OQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1938","placeOfBirth":" Toronto, Ontario, Canada","birthName":"William Bruce Davis","height":"6' 2½\" (1.89 m)","bio":"William B. Davis was born on January 13, 1938 in Toronto, Ontario, Canada as William Bruce Davis. He is an actor and director, known for The X Files (1998), The X-Files (1993) and The Tall Man (2012). He has been married to Emmanuelle Herpin since 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MDgyMzYyNl5BMl5BanBnXkFtZTcwNDg5ODY4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205657","name":"William B. Davis","nicknames":["Bill"],"idIMDB":"nm0205657"},"actorId":"nm0205657","character":"Colby Price","urlCharacter":"http://www.imdb.com/character/ch0020755","main":true},{"actorName":"Brent Briscoe","urlProfile":"http://www.imdb.com/name/nm0109785","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExOTMwMTE4MF5BMl5BanBnXkFtZTcwMzc0ODEzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1961","placeOfBirth":" Moberly, Missouri, USA","height":"5' 9\" (1.75 m)","bio":"After graduating from the University of Missouri, Brent Briscoe began his career as an apprentice at The Burt Reynolds Jupiter Theatre in 1985. Thereafter, he spent several years on the road, starring in the theatrical productions \"Greater Tuna\" and \"A Tuna Christmas.\" In 1994, he switched gears and spent the year as a staff writer for the television series Evening Shade (1990) before penning the teleplay The Right to Remain Silent (1996) for Showtime with his friend and partner Mark Fauser, his old college roommate. In 1996, Brent moved to Los Angeles permanently on the heels of his role as Scooter in Billy Bob Thornton's Sling Blade (1996), the first of several efforts linking the two. Since then he has worked in a considerable number of films for some of the industry's most notable directors. His most memorable and critically acclaimed role was that of Lou in Sam Raimi's A Simple Plan (1998), also a project involving Thornton. Other highlights include roles in U Turn - Ici commence l'enfer (1997), The Green Mile (1999), The Majestic (2001), Mulholland Drive (2001), Driven (2001), Madison (2001), and Spider-Man 2 (2004). He also played a role alongside his partner Fauser in Waking Up in Reno (2002) for Miramax, for which they wrote the screenplay. Brent now resides in the San Fernando Valley with his wife Angela.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExOTMwMTE4MF5BMl5BanBnXkFtZTcwMzc0ODEzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0109785","name":"Brent Briscoe","idIMDB":"nm0109785"},"actorId":"nm0109785","character":"Plume","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dustin Milligan","urlProfile":"http://www.imdb.com/name/nm1682420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2OTkwNzcyNl5BMl5BanBnXkFtZTgwNDY0NjczOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1985","placeOfBirth":" Yellowknife, Northwest Territories, Canada","birthName":"Dustin Wallace Milligan","height":"5' 10½\" (1.79 m)","bio":"Dustin Milligan was born on July 28, 1985 in Yellowknife, Northwest Territories, Canada as Dustin Wallace Milligan. He is an actor, writer and producer, known for Extract (2009), 90210 (2010), Schitt's Creek (2014), Silicon Valley (2015), Me Him Her (2015) and Dirk Gently (2016). He currently resides in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2OTkwNzcyNl5BMl5BanBnXkFtZTgwNDY0NjczOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1682420","name":"Dustin Milligan","idIMDB":"nm1682420"},"actorId":"nm1682420","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jodelle Ferland","urlProfile":"http://www.imdb.com/name/nm0272706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMzQ4ODEzOV5BMl5BanBnXkFtZTcwNzU2MjUzNw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1994","placeOfBirth":" Nanaimo, British Columbia, Canada","birthName":"Jodelle Micah Ferland","height":"5' 2\" (1.57 m)","bio":"Jodelle Micah Ferland has built up an impressive resume filled with roles in film, television and, at the beginning of her career, commercials. Born on October 9, 1994, she got her start in an episode of CTV's Cold Squad, brigade spéciale (1998), before landing the lead role in her first film, Mermaid (2000) at an early age. Her portrayal of the heartbroken \"Desi\" earned her a Daytime Emmy Award nomination, making her the youngest nominee in history, as well as a Young Artist Award. Since then, she has appeared in films including They (2002), Trapped (2001) and Carrie (2002), and has made appearances on Smallville (2001), Dark Angel (2000) and The Collector (2004). She can also be seen starring in Stephen King's Kingdom Hospital (2004), playing a tortured young girl who haunts the hospital's halls. In 2004, she landed the lead role of \"Jeliza-Rose\" in Terry Gilliam's Tideland (2005), a film about a disturbed young girl who finds solace in her own imagination after the death of her parents. Several roles have followed, including taking on three characters in the horror, Silent Hill (2006), a despondent foster child in Hallmark's Pictures of Hollis Woods (2007), starring with Renée Zellweger in Case 39 (2009), Matthew Broderick's dour daughter in Wonderful World (2009), and a surprise character in Drew Goddard and Joss Whedon's The Cabin in the Woods (2012). Her latest role is playing the newly-turned vampire, \"Bree\", on the highly anticipated \"Twilight\" movie, The Twilight Saga: Eclipse (2010). When not performing, Jodelle spends her time in gymnastics and art. She played violin when she was younger but now is learning guitar. She also loves to hang out with her family and friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMzQ4ODEzOV5BMl5BanBnXkFtZTcwNzU2MjUzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272706","name":"Jodelle Ferland","idIMDB":"nm0272706"},"actorId":"nm0272706","character":"Michael Rollins","urlCharacter":"http://www.imdb.com/character/ch0201968","main":true},{"actorName":"Michael Daingerfield","urlProfile":"http://www.imdb.com/name/nm0197405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIxODQxNDQzNl5BMl5BanBnXkFtZTgwNDQ4Nzg3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1970","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Michael Daingerfield Hall","height":"6' 2\" (1.88 m)","bio":"Nominated for 2 Leo Awards as an actor, a ubcp/actra Award for Best Voice and a Leo Award for Screenwriting, Michael Daingerfield has been in the business for twenty years, working in Toronto, Los Angeles, New York and Vancouver. He's appeared in over sixty film and television roles; including Dreamcatcher opposite Morgan Freeman, Catwoman opposite Benjamin Bratt, The Messengers opposite Dylan McDermott and Tooth Fairy starring Dwayne 'The Rock' Johnson. In Television, Michael has had recurring Guest Starring roles on Smallville as Gordon Godfrey, Hermes on Olympus and Ned Foster on Arrow. Michael is also one of the busiest and most versatile voice artists in North America, his voice has appeared in over a thousand projects in various radio and TV commercials, animated series', promos, video games, and documentaries all over the world. He just completed narrating the 1st season of Cabin Truckers and the 6th season of Ice Pilots NWT. He's now playing 'Han Solo' on \"Lego Star Wars: Droid Tales\". You may recognize him as the voice of NBC, Truvia Sweetener, Nissan, Central Bank, Nautilus and Access Communications to name a few, and as characters in the animated series' Ace Ventura, Iron Man, George of the Jungle, Pucca, Inuyasha, Packages from Planet X, Kid vs Kat, Leap Frog, Barbie and Nerds and Monsters. Michael has also appeared in such Anime series as InuYasha, Gundam 00, No GO, Ghost in the Shell, The Story Of Saiunkoku, Death Note, Black Lagoon, Nana. In his spare time, Michael enjoys playing competitive tennis. In 2014 he was the #10 ranked doubles player in Canada in the Men's 40 and over category. Michael is currently living and working in Vancouver, he is represented by Andrew Webster at Webster Talent Management for FILM/TV and Ralph Streich at Red Talent Management for Voice-Over.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIxODQxNDQzNl5BMl5BanBnXkFtZTgwNDQ4Nzg3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197405","name":"Michael Daingerfield","nicknames":["Dainger"],"idIMDB":"nm0197405"},"actorId":"nm0197405","character":"Police Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tatiana Maslany","urlProfile":"http://www.imdb.com/name/nm1137209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5NjE4NDgzMl5BMl5BanBnXkFtZTgwNzk5OTQwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1985","placeOfBirth":" Regina, Saskatchewan, Canada","birthName":"Tatiana Gabrielle Maslany","height":"5' 4\" (1.63 m)","bio":"Tatiana Gabrielle Maslany was born September 22, 1985 in Regina, Saskatchewan, to Renate, a translator, and Dan, a woodworker. She graduated from Dr. Martin LeBoldus High school in 2003. She was a well respected student, and participated as often as possible in school productions. She is well known for her participation in the Canadian Improv Games. Maslany starred in the 2006 television movie, Booky Makes Her Mark (2006) along with Megan Follows and Stuart Hughes. She had supporting roles in the films Eastern Promises (2007) and The Vow (2012), and came to fame starring in the series Orphan Black (2013), playing a large number of clones. Maslany also had a large role in the 2015 film Woman in Gold (2015), playing a young version of Maria Altmann, Helen Mirren's character.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5NjE4NDgzMl5BMl5BanBnXkFtZTgwNzk5OTQwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1137209","name":"Tatiana Maslany","nicknames":["Tat"],"idIMDB":"nm1137209"},"actorId":"nm1137209","character":"Lindsay Rollins","urlCharacter":"http://www.imdb.com/character/ch0186120","main":true},{"actorName":"Shirley McQueen","urlProfile":"http://www.imdb.com/name/nm0574365","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM1MjMwOTg4Nl5BMl5BanBnXkFtZTgwODM5NjUzOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Shirley McQueen is an actress, known for The Messengers (2007), Stolen Heart (1998) and Corner Gas (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM1MjMwOTg4Nl5BMl5BanBnXkFtZTgwODM5NjUzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574365","name":"Shirley McQueen","idIMDB":"nm0574365"},"actorId":"nm0574365","character":"Mary Rollins","urlCharacter":"http://www.imdb.com/character/ch0186119","main":true},{"actorName":"Anna Hagan","urlProfile":"http://www.imdb.com/name/nm0353212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc1MTE5NzI3Nl5BMl5BanBnXkFtZTcwNjc4ODM5Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1939","placeOfBirth":" Toronto, Canada","bio":"Anna Hagan was born on April 25, 1939 in Toronto, Canada. She is an actress, known for The Possession (2012), The Messengers (2007) and The Stepfather (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc1MTE5NzI3Nl5BMl5BanBnXkFtZTcwNjc4ODM5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0353212","name":"Anna Hagan","idIMDB":"nm0353212"},"actorId":"nm0353212","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Blaine Hart","urlProfile":"http://www.imdb.com/name/nm0366162","urlPhoto":"","biography":{"bio":"Blaine Hart is an actor and writer, known for The Messengers (2007), The Stuff That Makes You Lift Cars (2002) and Malin comme un singe (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0366162","name":"Blaine Hart","idIMDB":"nm0366162"},"actorId":"nm0366162","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0425430","urlIMDB":"http://www.imdb.com/title/tt0425430","business":{"budget":{"money":"$16,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$14,713,321","country":"USA","day":"04","month":"02","year":"2007","remarks":"2,528 Screens"},{"money":"£262,562","country":"UK","day":"08","month":"04","year":"2007","remarks":"258 Screens"},{"money":"$2,002","country":"Estonia","day":"24","month":"06","year":"2007","remarks":"2 Screens"},{"money":"€47,043","country":"Netherlands","day":"03","month":"06","year":"2007","remarks":"20 Screens"}],"gross":[{"money":"$35,374,833","country":"USA","day":"18","month":"03","year":"2007","remarks":""},{"money":"$34,992,867","country":"USA","day":"11","month":"03","year":"2007","remarks":""},{"money":"$34,457,349","country":"USA","day":"04","month":"03","year":"2007","remarks":""},{"money":"$33,400,113","country":"USA","day":"25","month":"02","year":"2007","remarks":""},{"money":"$31,050,332","country":"USA","day":"18","month":"02","year":"2007","remarks":""},{"money":"$24,742,205","country":"USA","day":"11","month":"02","year":"2007","remarks":""},{"money":"$14,713,321","country":"USA","day":"04","month":"02","year":"2007","remarks":""},{"money":"£704,195","country":"UK","day":"15","month":"04","year":"2007","remarks":""},{"money":"£262,562","country":"UK","day":"08","month":"04","year":"2007","remarks":""},{"money":"€63,598","country":"Netherlands","day":"03","month":"06","year":"2007","remarks":""}],"weekendGross":[{"money":"$227,756","country":"USA","day":"18","month":"03","year":"2007","remarks":"306 Screens"},{"money":"$87,005","country":"USA","day":"11","month":"03","year":"2007","remarks":""},{"money":"$709,275","country":"USA","day":"04","month":"03","year":"2007","remarks":""},{"money":"$1,603,570","country":"USA","day":"25","month":"02","year":"2007","remarks":"1,492 Screens"},{"money":"$4,341,827","country":"USA","day":"18","month":"02","year":"2007","remarks":"2,183 Screens"},{"money":"$7,218,187","country":"USA","day":"11","month":"02","year":"2007","remarks":"2,529 Screens"},{"money":"$14,713,321","country":"USA","day":"04","month":"02","year":"2007","remarks":"2,528 Screens"},{"money":"£142,526","country":"UK","day":"15","month":"04","year":"2007","remarks":"221 Screens"},{"money":"£262,562","country":"UK","day":"08","month":"04","year":"2007","remarks":"258 Screens"},{"money":"€47,043","country":"Netherlands","day":"03","month":"06","year":"2007","remarks":"20 Screens"}],"admissions":[{"money":"26,619","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"06","year":"2005","remarks":null},null],"copyrightHolder":"(2006) GHP 3 - Scarecrow, LLC"},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color","Black and White (flashback scenes)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":null,"filmLength":["2,473 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 100T 5212, Vision2 200T 5217, Vision2 500T 5218)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"5.4","metascore":"34","filmingLocations":[{"location":"Canada Saskatchewan Production Studios, Regina, Saskatchewan, Canada"}],"rated":"PG-13","awards":[{"award":"Directors Guild of Canada 2008","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Craft Award","categories":[{"category":"Production Design - Feature Film","names":[{"name":"Alicia Keywan","id":"nm0450921","role":null}]}]}]},{"award":"Leo Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won Leo","categories":[{"category":"Best Cinematography in a Feature Length Drama","names":[{"name":"David Geddes","id":"nm0311454","role":null}]}]}]},{"award":"Rondo Hatton Classic Horror Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Rondo Statuette","categories":[{"category":"Best Movie","names":[{"name":"Danny Pang","id":"nm0659380","role":null},{"name":"Oxide Chun Pang","id":"nm0161152","role":null}]}]}]}],"votes":"34,548","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010568","name":"Screen Gems"},{"idCompany":"co0116611","name":"Ghost House Pictures"},{"idCompany":"co0071509","name":"Columbia Pictures"}],"keywords":{"keywords":["sunflower","murder","ghost","strong female character","stain on the wall","chicago illinois","boy","zombie","axe murderer","flashback","haunted house","farm","north dakota","foreclosure","raven","axe","lifting someone into the air","family relationships","rural setting","police","kitchen","sunflower field","teenage girl","sunflower seed","sun flower","spoon","moving in","little brother","little boy","lemonade","husband wife relationship","hiding under a bed","falling from height","face slap","bird attack","big sister","basement","animated title sequence","woods","policewoman","illness","heavy rain","father son relationship","evidence","death threat","children","attempted murder","uxoricide","tractor","toy","stain","stabbing","prologue","pocket watch","pitchfork","mute","moving","mother daughter relationship","marriage","hospital","handyman","filicide","father daughter relationship","crow","child murder","cellar","brother sister relationship","basketball","barn","animal attack","supernatural power","killer"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:25:30"}}