{"data":{"movies":[{"title":"Trailer Park Boys: The Movie","originalTitle":"","year":"2006","releaseDate":"20061006","directors":[{"name":"Mike Clattenburg","id":"nm0154104"}],"writers":[{"name":"Mike Clattenburg","id":"nm0154104"},{"name":"Robb Wells","id":"nm1036211"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5Mzg4MDM1M15BMl5BanBnXkFtZTcwNTk4MzkzMQ@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Comedy","Crime"],"plot":"Set in a separate storyline not related to the \"Trailer Park Boys\" Television show, but with the same lovable characters. The boys get arrested for robbing an ATM machine and spend 18 months in jail. When the get out, they decide to pull off \"The Big Dirty\" which is to steal a large amount of coins because they are untraceable and quit their life of crime forever.","simplePlot":"Ricky, Julian and Bubbles come up with a scheme to steal large amounts of untraceable coins.","actors":[{"actorName":"Robb Wells","urlProfile":"http://www.imdb.com/name/nm1036211","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjU2NzA4N15BMl5BanBnXkFtZTcwODYwMDYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1971","placeOfBirth":" Moncton, New Brunswick, Canada","height":"6' 1\" (1.85 m)","bio":"Robb Wells was born on October 28, 1971 in Moncton, New Brunswick and raised in Dartmouth, Nova Scotia since the age of 8. His father was a Forensic Expert with The RCMP. Robb later went to high school with Mike Clattenberg and John Paul Tremblay. The three were always pulling practical jokes on people and getting into trouble. They had a bizarre sense of humor. While Tremblay and Wells were operating a successful chain of pizza restaurants called J.R. Capone's, they decided to pass the time making crude video skits of themselves. In 1998 they made a short film with acting veteran John Dunsworth called One last Shot. The film won a best actor and best cinematography award. A year later they made a mockumentary film called \"Trailer Park boys\" featuring newcomers Patrick Roach, Mike Jackson, Cory Bowles, Lucy Decoutere and Jeanne Harrison. During the filming, they met a sound mixer named Mike Smith, and after the filming was complete they made a deal with Showcase to make Trailer Park Boys into a TV Series with Mike Smith on board. After the series was green-lit, the lovable Bubbles was born. Now there are 3 main characters in the Park. Besides their day jobs as restaurant managers in Nova Scotia and as sound mixers, Wells, John Paul Tremblay and Mike Smith are Canadian TV icons to this day.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjU2NzA4N15BMl5BanBnXkFtZTcwODYwMDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1036211","name":"Robb Wells","idIMDB":"nm1036211"},"actorId":"nm1036211","character":"Ricky","urlCharacter":"http://www.imdb.com/character/ch0022877","main":true},{"actorName":"John Paul Tremblay","urlProfile":"http://www.imdb.com/name/nm1033215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNzY3MjI0M15BMl5BanBnXkFtZTgwNTg5MTMzMDE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1968","placeOfBirth":" Halifax, Nova Scotia, Canada","height":"6' 1\" (1.85 m)","bio":"John Paul Tremblay was born in 1968 in Halifax, Nova Scotia, Canada. He is an actor and writer, known for Trailer Park Boys (2001), Trailer Park Boys: Countdown to Liquor Day (2009) and Trailer Park Boys (1999). He is married to Andrea. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNzY3MjI0M15BMl5BanBnXkFtZTgwNTg5MTMzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1033215","name":"John Paul Tremblay","nicknames":["Jape"],"idIMDB":"nm1033215"},"actorId":"nm1033215","character":"Julian","urlCharacter":"http://www.imdb.com/character/ch0022878","main":true},{"actorName":"Mike Smith","urlProfile":"http://www.imdb.com/name/nm1034266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTk2NzU5NV5BMl5BanBnXkFtZTcwMDE5Mzc0Nw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1972","placeOfBirth":" Thorburn, Nova Scotia, Canada","height":"5' 10\" (1.78 m)","bio":"Mike Smith was born and raised in Thorburn, Nova Scotia. He started playing hockey at the age of four but showed early signs of musical genius when he learned to play guitar at the age of seven. Continuing with both hobbies for the majority of his life, Mike eventually gave up hockey to concentrate on being a musician. He attended St.F.X. University in Antigonish where he earned an Advanced Major in English. In 1992, Mike's career in music began to take off. He started playing guitar and was one of the principal songwriters in the band Sandbox. the group quickly signed a record deal with EMI in Canada and Nettwerk in the U.S. Nominated for a Juno Award, East Coast Music Awards and a Casby Award, Sandbox released two albums with EMI and Nettwerk - Bionic and A Murder In The Glee Club. When Sandbox broke up in 1998 Mike began working as a location sound mixer on film and TV. He was hired to mix the original Trailer Park Boys black and white movie in 1999 where director Mike Clattenburg discovered him doing the 'Bubbles' character on set for the crew. Clattenburg saw that the character had some very lovable qualities and decided to write him into the upcoming Trailer Park Boys TV series. Never having acted before Smith decided to accept the offer but also remained on as the series sound mixer until Season 3. Since the rise of Trailer Park Boys, Mike has been in numerous music videos with the likes of Rush, The Tragically Hip, Snow and George Canyon and toured Canada, the US, Mexico, Australia and Japan (including a show at the legendary Budokan Arena in Tokyo) with rock legends Guns N Roses with front man and long-time friend Axl Rose. In 2010, along with his Trailer Park Boys co-stars Robb Wells and John Paul Tremblay, Mike is writing, producing and starring in the comedy series 'The Drunk And On Drugs Happy Funtime Hour', a half hour comedy set in the town of Port Cockerton where a kids show goes horribly wrong when a powerful hallucinogen is accidentally given to the cast and crew.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTk2NzU5NV5BMl5BanBnXkFtZTcwMDE5Mzc0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1034266","name":"Mike Smith","idIMDB":"nm1034266"},"actorId":"nm1034266","character":"Bubbles","urlCharacter":"http://www.imdb.com/character/ch0022876","main":true},{"actorName":"Lucy Decoutere","urlProfile":"http://www.imdb.com/name/nm0208164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NzM3MzM4M15BMl5BanBnXkFtZTcwNTU0MzgwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Lucy Decoutere is known for her work on Trailer Park Boys (2001), Trailer Park Boys: The Movie (2006) and Trailer Park Boys: Countdown to Liquor Day (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NzM3MzM4M15BMl5BanBnXkFtZTcwNTU0MzgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0208164","name":"Lucy Decoutere","idIMDB":"nm0208164"},"actorId":"nm0208164","character":"Lucy","urlCharacter":"http://www.imdb.com/character/ch0022882","main":true},{"actorName":"Lydia Lawson-Baird","urlProfile":"http://www.imdb.com/name/nm1480153","urlPhoto":"","biography":{"bio":"Lydia Lawson-Baird is an actress, known for Elf (2003), Trailer Park Boys: The Movie (2006) and The Love Crimes of Gillian Guess (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1480153","name":"Lydia Lawson-Baird","idIMDB":"nm1480153"},"actorId":"nm1480153","character":"Trinity","urlCharacter":"http://www.imdb.com/character/ch0095479","main":true},{"actorName":"Cory Bowles","urlProfile":"http://www.imdb.com/name/nm0101227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDdmMjU1NGYtNjRjOC00MzdkLWJlNmItNjA3ZDRjM2I5N2I5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1973","placeOfBirth":" Montreal, Quebec, Canada","bio":"Cory Bowles was born on August 27, 1973 in Montreal, Quebec, Canada. He is known for his work on Trailer Park Boys (2001), Trailer Park Boys: The Movie (2006) and Righteous (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDdmMjU1NGYtNjRjOC00MzdkLWJlNmItNjA3ZDRjM2I5N2I5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0101227","name":"Cory Bowles","idIMDB":"nm0101227"},"actorId":"nm0101227","character":"Cory","urlCharacter":"http://www.imdb.com/character/ch0022880","main":true},{"actorName":"Michael Jackson","urlProfile":"http://www.imdb.com/name/nm1034591","urlPhoto":"","biography":{"dateOfBirth":"8 November 1970","placeOfBirth":" Ottawa, Ontario, Canada","height":"6' 1\" (1.85 m)","bio":"Michael Jackson was born on November 8, 1970 in Ottawa, Ontario, Canada. He is known for his work on Trailer Park Boys (2001), Trailer Park Boys: The Movie (2006) and K-19: The Widowmaker (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1034591","name":"Michael Jackson","idIMDB":"nm1034591"},"actorId":"nm1034591","character":"Trevor","urlCharacter":"http://www.imdb.com/character/ch0022883","main":true},{"actorName":"Gord Downie","urlProfile":"http://www.imdb.com/name/nm0970841","urlPhoto":"","biography":{"dateOfBirth":"6 February 1964","placeOfBirth":" Kingston, Ontario, Canada","bio":"Gord Downie was born on February 6, 1964 in Kingston, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0970841","name":"Gord Downie","idIMDB":"nm0970841"},"actorId":"nm0970841","character":"Cop 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Lifeson","urlProfile":"http://www.imdb.com/name/nm0509820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWViOTkxNDAtZTQzNC00MDhjLThiMTItOWUzN2JlNjlmMTBmXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1953","placeOfBirth":" Fernie, British Columbia, Canada","birthName":"Alexander Zivojinovich","height":"6' (1.83 m)","bio":"Alex Lifeson is best known as the broadly-skilled guitarist for the rock group Rush, which also features drummer Neil Peart and bassist Geddy Lee. Rush is the most successful Canadian music group in history, and is the third most prolific seller of consecutive (American) Gold and Platinum Records and videos, behind only the Beatles and the Rolling Stones. Lifeson's ability to pull double-duty as both a melodic rhythm-guitar player and a searing soloist has earned him a reputation similar to that of his bandmates. All three share the distinction of being among the most highly influential virtuosos in their crafts. Alex has a passion for studio production, and is the only member of Rush to compose and produce a television theme (Andromeda (2000)). But his live performances are where his spontaneous side really shows. During live performances, Alex deftly switches from rhythm guitar to soloing, while simultaneously triggering his own pre-recorded accompaniments. Being the soul of spontaneity in the band, Alex is the member of Rush who most frequently contributes comedy to the show. This side of Alex can be seen during the performances of \"La Villa Strangiato\" on two of Rush's concert videos, Rush in Rio (2003) and Rush: A Show of Hands (1989), and to an even greater degree on the documentary \"The Boys In Brazil\" (2003), part of the bonus material included with Rush in Rio (2003). Alex's prowess can be heard on a few non-Rush recordings, primarily his solo album, entitled simply \"Victor\" (1996), and the soundtrack album for South Park: Bigger, Longer & Uncut (1999). After their longest break from recording and touring, a highly successful 2002 tour brought Rush back to the United States, Canada, and Mexico, to the great anticipation of fans. Rush ended their 2002 tour with their first-ever shows in Brazil, where they played to 125,000 fans in three nights. The final performance of the 2002 tour was captured on DVD as Rush in Rio (2003), which was certified double-platinum within weeks of its release. Alex has fostered several younger groups, such as The Dexters, who he often guests with during their live performances at The Orbit Room, a Toronto club that Alex owns in part.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWViOTkxNDAtZTQzNC00MDhjLThiMTItOWUzN2JlNjlmMTBmXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0509820","name":"Alex Lifeson","nicknames":["Lerxst","Big Al"],"idIMDB":"nm0509820"},"actorId":"nm0509820","character":"Cop 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerry Dee","urlProfile":"http://www.imdb.com/name/nm2089942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5OTIxNDY5OF5BMl5BanBnXkFtZTgwNzkzMDIzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1968","placeOfBirth":" Scarborough, Ontario, Canada","birthName":"Gerard Donoghue","height":"5' 10\" (1.78 m)","bio":"Gerry Dee is the son of Scottish immigrant parents. Born in Scarborough and raised in Toronto. Former high school physical education teacher. He was the first Canadian ever to win the prestigious San Francisco Comedy Competition. Played Varsity hockey at St Francis Xavier University in Antigonish, Nova Scotia. Gerry is a two handicap in golf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5OTIxNDY5OF5BMl5BanBnXkFtZTgwNzkzMDIzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2089942","name":"Gerry Dee","idIMDB":"nm2089942"},"actorId":"nm2089942","character":"Donny","urlCharacter":"http://www.imdb.com/character/ch0095485","main":true},{"actorName":"Glen Grant","urlProfile":"http://www.imdb.com/name/nm0335418","urlPhoto":"","biography":{"bio":"Glen Grant is known for his work on Trailer Park Boys: The Movie (2006), Special Correspondents (2016) and The Event (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335418","name":"Glen Grant","idIMDB":"nm0335418"},"actorId":"nm0335418","character":"Darren","urlCharacter":"http://www.imdb.com/character/ch0453680","main":true},{"actorName":"Eugene Clark","urlProfile":"http://www.imdb.com/name/nm0163925","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNTk2OTYyMTheQTJeQWpwZ15BbWU2MDI4MDY2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1951","placeOfBirth":" Tampa, Florida, USA","birthName":"Eugene Anthony Clark","height":"6' 3\" (1.91 m)","bio":"Eugene Clark Brings Multiple Talents Eugene Clark brings a career in theatre, television and film that is fascinating and diverse. A veteran of more than 100 television productions and 15 feature films, he won a Gemini Award (Canadian Emmy) for Best Supporting Actor in a Dramatic Series for his work on the hit TV series Night Heat. He starred as Mufasa in Disney's The Lion King onstage in Toronto for two years, as Horse in The Charlottetown Festival's production of The Full Monty in P.E.I., and starred as the lead zombie Big Daddy, in George A. Romero's long awaited Land of the Dead. He has appeared in the films Trailer Park Boys - The Movie; Resurrecting the Champ, and the TV series The L. A. Complex; Space Riders - Division Earth; The Latest Buzz, Sue Thomas F B Eye, Wingin' It and The Line. He was the 2nd lead in William Shatner's made for television movie series TekWar. He received critical acclaim for his performance as a suicidal Vietnam veteran who lost his arm to Agent Orange in Unnatural Causes, the Emmy Award winning drama starring John Ritter and Alfre Woodard. Acting is just one of Clark's creative outlets. Singing has long been a love in his life. From the days of singing as a child in his grandfather's church, to singing the national anthem in uniform as a member of the Toronto Argonauts, singing has always been \"like breath itself,\" he says. Distressed by television coverage of Africa's young famine victims, Clark wrote the lyrics, melody, and chorus to Letter from a Concerned Citizen Starvation in Africa. The Canadian Red Cross used the song for their national television and radio campaign to raise funds for their relief efforts in Africa. Of his three CDs he says, \"They speak to the need for effective community and global co-operation, how through assisting each other in times of need we can accomplish anything. These songs motivate and encourage us to be our best, for there is greatness in all of us.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNTk2OTYyMTheQTJeQWpwZ15BbWU2MDI4MDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163925","name":"Eugene Clark","idIMDB":"nm0163925"},"actorId":"nm0163925","character":"Cadillac","urlCharacter":"http://www.imdb.com/character/ch0453679","main":true},{"actorName":"Barrie Dunn","urlProfile":"http://www.imdb.com/name/nm0242500","urlPhoto":"","biography":{"bio":"Barrie Dunn is an award-winning producer with over 20 years' experience in the television and film industry. He has just completed production as Writer and Producer on the third season of the hit comedy/drama series Trailer Park Boys for Showcase Television, which is scheduled to go into production on eight more original episodes this summer. Barrie also wrote and produced Tough Guys, the documentary special for the CTV Television Network which was directed by Mike Clattenburg. He also recently co-produced the documentary special, Team Spirit: The Story of Team Indigenous for the CTV Television Network. Barrie worked for several years at the Canadian Broadcasting Corporation where his credits include Theatre On The Mulgrave Road for which he won the Moonsnail Award for Best Documentary, My Brother Larry (for which he wrote the original story and which was nominated for a Gemini as Best Short Drama), and God's Trombones for Adrienne Clarkson Presents. Barrie also wrote, produced, and directed the feature length documentary, Bernie's Going To Hollywood, the story of a Spryfield taxi driver's quest for fame as an actor in Hollywood. Barrie has worked on over 30 television and film productions including CBC's Gullage's and Black Harbour, the feature films Margaret's Museum, with Helena Bonham Carter, No Apologies, and Stations, the latter of which was a highly acclaimed independent film which played in many North American and European repertory cinemas. Barrie graduated with a degree in Law from Dalhousie University and has also studied philosophy, business and theatre. Today he is a practicing lawyer with Patterson Palmer, one of Atlantic Canada's largest law firms. He has guest lectured on entertainment law issues at Dalhousie Law School and also has taught Film and Television Production at Mount Saint Vincent University. He is a Past President of the Nova Scotia Film & Television Producers Association. Prior to getting into television production, he worked and lived in Eastern Europe as a street performer.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0242500","name":"Barrie Dunn","idIMDB":"nm0242500"},"actorId":"nm0242500","character":"Ray","urlCharacter":"http://www.imdb.com/character/ch0095493","main":true},{"actorName":"John Dunsworth","urlProfile":"http://www.imdb.com/name/nm0243082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzA1NTExMl5BMl5BanBnXkFtZTcwMzU5NTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"John Dunsworth was born in Bridgewater, Nova Scotia, not far from the sea where he now spends most of his time on his yacht when he's not working.  John is one of Halifax's most venerable and revered actors.  He has appeared in countless CBC radio dramas and has held leading roles in over 25 Neptune Theatre productions.  In 1970, long before the days of waterfront renewal, John convinced the city of Halifax to lease to him a run-down old building by the shipyards which he turned into Pier One Theatre - Halifax's first and arguably its most successful alternative theatre company.  John first met Mike Clattenburg in the mid-1990s when he auditioned for a small role in Mike's short, One Last Shot.  Halfway through shooting, John's small role blossomed into a leading part - a part that garnered him a Best Performance award from the Atlantic Film Festival.  From there, John developed that role into the character Jim Lahey, the trailer park supervisor on the series Trailer Park Boys.  John's recent film credits include principle roles in Sleepmurder for CTV, Blessing for CBS, Shattered City: Halifax Explosion for Salter Street Films and Thom Fitzgerald's Indie film Three Needles. John is an avid bridge player, holding master points.  He also holds, until somebody proves otherwise, the Internet Scrabble record for having three 7-letter words in a row.  Around town, John is easy to spot.  He drives an old truck with a thousand pound winch that he uses for hauling granite.  In 1987, John founded Filmworks Casting where he worked as Halifax's most successful casting director.  Prior to that, John worked in the transportation industry.  To be precise, he drove a cab for three years and worked the CNR trains from Halifax and Sydney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzA1NTExMl5BMl5BanBnXkFtZTcwMzU5NTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0243082","name":"John Dunsworth","idIMDB":"nm0243082"},"actorId":"nm0243082","character":"Mr. Lahey","urlCharacter":"http://www.imdb.com/character/ch0022881","main":true},{"actorName":"Patrick Roach","urlProfile":"http://www.imdb.com/name/nm1200571","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzI4NzMwMF5BMl5BanBnXkFtZTcwMjUzMDExOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1969","placeOfBirth":" Halifax, Nova Scotia, Canada","height":"5' 7½\" (1.71 m)","bio":"Patrick Roach was born on March 4, 1969 in Halifax, Nova Scotia, Canada. He is an actor and producer, known for Trailer Park Boys (2001), Trailer Park Boys: Countdown to Liquor Day (2009) and Trailer Park Boys: Don't Legalize It (2014). He is married to Candice Roach. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzI4NzMwMF5BMl5BanBnXkFtZTcwMjUzMDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1200571","name":"Patrick Roach","idIMDB":"nm1200571"},"actorId":"nm1200571","character":"Randy","urlCharacter":"http://www.imdb.com/character/ch0088268","main":true}],"seasons":[],"idIMDB":"tt0425601","urlIMDB":"http://www.imdb.com/title/tt0425601","business":{"budget":{"money":"$CAD5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$CAD1,353,024","country":"Canada","day":"08","month":"10","year":"2006","remarks":""}],"gross":null,"weekendGross":[{"money":"$CAD772,689","country":"Canada","day":"15","month":"10","year":"2006","remarks":""}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["16 mm"],"cinematographicProcess":["Super 16"],"printedFilmFormat":["35 mm (blow-up)"]},"rating":"7.3","metascore":"38","filmingLocations":[{"location":"Dartmouth, Nova Scotia, Canada"}],"rated":"R","awards":[{"award":"Genie Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Genie","categories":[{"category":"Best Motion Picture","names":[{"name":"Barrie Dunn","id":"nm0242500","role":null},{"name":"Mike Clattenburg","id":"nm0154104","role":null},{"name":"Michael Volpe","id":"nm0901739","role":null}]},{"category":"Best Performance by an Actor in a Supporting Role","names":[{"name":"Hugh Dillon","id":"nm0227003","role":null}]},{"category":"Best Screenplay, Adapted","names":[{"name":"Mike Clattenburg","id":"nm0154104","role":null},{"name":"Robb Wells","id":"nm1036211","role":null}]}]}]}],"votes":"10,436","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000763","name":"Alliance Atlantis Motion Picture Distribution"},{"idCompany":"co0044921","name":"Trailer Park Productions"},{"idCompany":"co0064423","name":"Topsail Entertainment"}],"keywords":{"keywords":["jock strap","trailer park","cult film","canada","nova scotia","based on tv series","street hockey","breathalyzer","tuxedo shirt","pistol","shopping cart","nunchucks","fake disability","marijuana","lap dance","father son relationship","father daughter relationship","small time crook","heist","alcoholism","male rear nudity","poor white trash","driving a car without a door","movie in title","mockumentary","black comedy","lesbian","precocious child","wetting pants","wedding","urination","prison guard","pimp","petty thief","no opening credits","night vision","male nudity","helicopter","eviction","cat","breast implant","stripper","strip club","female nudity","body double","prequel","sleeping in a car","rapper","mock documentary","megalomaniac","drugs","drug dealer","breaking the fourth wall","based on cult tv series","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:25:10"}}