{"data":{"movies":[{"title":"The Virgin Queen","originalTitle":"","year":"2005–","releaseDate":"20051113","writers":[],"runtime":"237 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDkzNTQyNF5BMl5BanBnXkFtZTcwNzc3NTEzMQ@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Biography","Drama","Romance"],"plot":"The Virgin Queen explores the full sweep of Elizabeth's life: from her days of fear as a potential victim of her sister's terror; through her great love affair with Robert Dudley; into her years of triumph over the Armada; and finally her old age and her last, enigmatic relationship with her young protégé, the Earl of Essex.","simplePlot":"The Virgin Queen explores the full sweep of Elizabeth's life: from her days of fear as a potential victim of her sister's terror; through her great love affair with Robert Dudley; into her ... ","actors":[{"actorName":"Anne-Marie Duff","urlProfile":"http://www.imdb.com/name/nm0240359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk0NzYxMTg1M15BMl5BanBnXkFtZTcwMzgyMjAyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1970","placeOfBirth":" Southall, London, England, UK","height":"5' 7\" (1.7 m)","bio":"Anne-Marie Duff is an English actress, born on 8 October 1970 in Southall, London. Her parents, Brendan and Mary (née Doherty), are from Donegal, Ireland. Her father worked as a painter and decorator and her mother worked in a shoe shop. She first came to the attention of the British public for her role as Margaret in The Magdalene Sisters (2002) and as Fiona Gallagher in the successful TV series Shameless (2004), where she met her future husband, James McAvoy. She went on to play Queen Elizabeth I opposite Tom Hardy's Robert Dudley, Earl of Leicester in the four-part miniseries The Virgin Queen (2005). In Nowhere Boy (2009), Duff played John Lennon's mother, Julia, a role for which she won British Independent Film Award for Best Supporting Actress. She played Violet Miller in Suffragette (2015), a working-class woman who introduces Maud Watts (Carey Mulligan) to the fight for women's rights in east London. \"Violet is extraordinary, she's a firebrand - a tornado that comes into Maud's life and changes it forever. I found her thrilling,\" says Duff. In 2017, she will appear as Hyzenthlay in a new BBC animated miniseries of Watership Down. Duff has also taken on many theatre roles, including Joan of Arc in George Bernard Shaw's \"Saint Joan\" in 2007 and Alma Rattenbury in Terence Rattigan's \"Cause Célèbre\" at The Old Vic, London in 2011. She has been married to McAvoy since 11 November 2006. They have one child, a son named Brendan after Duff's father. On 13 May 2016, Duff and McAvoy announced their decision to divorce.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk0NzYxMTg1M15BMl5BanBnXkFtZTcwMzgyMjAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240359","name":"Anne-Marie Duff","idIMDB":"nm0240359"},"actorId":"nm0240359","character":" Queen Elizabeth I","urlCharacter":"http://www.imdb.com/character/ch0026777","main":true},{"actorName":"Sienna Guillory","urlProfile":"http://www.imdb.com/name/nm0347149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTc1MTczOV5BMl5BanBnXkFtZTgwNjU4ODM2NTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1975","placeOfBirth":" Kettering, Northamptonshire, England, UK","birthName":"Sienna Tiggy Guillory","height":"5' 6\" (1.68 m)","bio":"Sienna Guillory is the daughter of American folk guitarist Isaac Guillory and Tina Thompson, an English model. Guillory's parents encouraged her to express herself artistically as she was growing up and this led to her decision to become an actor. She was educated at Gresham's School, Holt, Norfolk, England and appeared in school plays. Her acting break came when she was 16, and was cast in the TV movie Riders (1993). To support her acting career, Guillory also took up modeling and appeared in campaigns for such high profile companies as Armani and Dolce & Gabbana, as well as gracing many magazine covers. Further acting success followed in TV and films. Projects include The Time Machine (2002), Love Actually (2003) and the 'Resident Evil' film series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTc1MTczOV5BMl5BanBnXkFtZTgwNjU4ODM2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0347149","name":"Sienna Guillory","idIMDB":"nm0347149"},"actorId":"nm0347149","character":" Lettice Knollys","urlCharacter":"http://www.imdb.com/character/ch0217575","main":true},{"actorName":"Ian Hart","urlProfile":"http://www.imdb.com/name/nm0001324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTQ2MjI4Ml5BMl5BanBnXkFtZTYwMjUxNDMz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1964","placeOfBirth":" Liverpool, Merseyside, England, UK","height":"5' 7¾\" (1.72 m)","bio":"Ian Hart, born in England, began acting while a student in Liverpool, England, United Kingdom. He stumbled into acting almost accidentally, but was cast in the play \"The Government Inspector\". He continued to work in British theater and television, and first gained recognition for portraying John Lennon in the British film Backbeat (1994). He made many films in his native Britain, occasionally appearing in American films and TV series as well. He has now played John Lennon three times, most recently in the television play Snodgrass, where he played a 50 year old Lennon who had left The Beatles before they became successful.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTQ2MjI4Ml5BMl5BanBnXkFtZTYwMjUxNDMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001324","name":"Ian Hart","idIMDB":"nm0001324"},"actorId":"nm0001324","character":" William Cecil - Lord Burghley","urlCharacter":"http://www.imdb.com/character/ch0044111","main":true},{"actorName":"Tom Hardy","urlProfile":"http://www.imdb.com/name/nm0362766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1977","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Edward Thomas Hardy","height":"5' 9\" (1.75 m)","bio":"With his breakthrough performance as Eames in Christopher Nolan's science fiction thriller Inception (2010), English actor Tom Hardy has been brought to the attention of mainstream audiences worldwide. However, the versatile actor has been steadily working on both stage and screen since his television debut in the miniseries Band of Brothers (2001). After being cast in the World War II drama, Hardy left his studies at the prestigious Drama Centre in London and was subsequently cast as Twombly in Ridley Scott's Black Hawk Down (2001) and as the villain Shinzon in Star Trek: Nemesis (2002). Tom was born on September 15, 1977 in Hammersmith, London; his mother, Elizabeth Anne (Barrett), is an artist and painter, and his father, Edward Hardy, is a writer. He is of English and Irish descent. Hardy was brought up in East Sheen, London, and first studied at Reed's School. His education continued at Tower House School, then at Richmond Drama School, and subsequently at the Drama Centre London, along with fellow Oscar nominee Michael Fassbender. After winning a modeling competition at age 21, he had a brief contract with the agency Models One. Tom spent his teens and early twenties battling delinquency, alcoholism and drug addiction; after completing his work on Star Trek: Nemesis (2002), he sought treatment and has also admitted that his battles with addiction ended his 5-year marriage to Rachael Speed. Returning to work in 2003, Hardy was awarded the Evening Standard Most Promising Newcomer Award for his theatre performances in the productions of \"In Arabia, We'd All Be Kings\" and \"Blood\". In 2003, Tom also co-starred in the play \"The Modernists\" with Paul Popplewell, Jesse Spencer and Orlando Wells. During the next five years, Hardy worked consistently in film, television and theatre, playing roles as varied as Robert Dudley in the BBC's The Virgin Queen (2005), Bill Sikes in Oliver Twist (2007) and starring in \"The Man of Mode\" at the National Theatre. On the silver screen, he appeared in the crime thriller Layer Cake (2004) with Daniel Craig, Sofia Coppola's Marie Antoinette (2006), and the romp Scenes of a Sexual Nature (2006). In 2006, Hardy created \"Shotgun\", an underground theatre company along with director Robert Delamere, and directed a play, penned by his father for the company, called \"Blue on Blue\". In 2007, Hardy received a best actor BAFTA nomination for his touching performance as Stuart Shorter in the BBC adaptation of Alexander Masters' bestselling biography Stuart: A Life Backwards (2007). Hardy, hailed for his transformative character acting, was lauded for his emotionally and physically convincing portrayal in the ill-fated and warmhearted tale of Shorter, a homeless and occasionally violent man suffering from addiction and muscular dystrophy. The following year, he appeared as gay hoodlum Handsome Bob in the Guy Ritchie film RocknRolla (2008), but this would be his next transformation that would prove his extensive range and stun critics. In the film Bronson (2008), Hardy played the notorious Charles Bronson (given name, Michael Peterson), the \"most violent prisoner in Britain\". Bald, pumped-up, and outfitted with Bronson's signature strongman mustache, Hardy is unrecognizable and gives a harrowing performance that is physically fearless and psychologically unsettling. Director Nicolas Winding Refn breaks the fourth wall with Hardy retelling his tales directly to viewers as well as performing them outright before an audience of his own imagining. The performance mixes terrifying brutality, vaudevillian showmanship, wry humor, and an alarming amount of commitment, and won Hardy a British Independent Film Award for Best Actor. The performance got Hollywood's attention, and in 2009, Hardy was named one of Variety's \"10 Actors to Watch\". That year, he continued to garner praise for his starring role in The Take (2009), a four-part adaptation of Martina Cole's bestselling crime novel, as well as for his performance as Heathcliff in a version of Wuthering Heights (2009). Recent work includes the aforementioned breakthrough appearance in Inception (2010) alongside Leonardo DiCaprio, Joseph Gordon-Levitt, Cillian Murphy, Tom Berenger, Ken Watanabe, Michael Caine, Marion Cotillard and Ellen Page. The movie was released in July 2010 and became one of top 25 highest grossing films of all time, collecting eight Oscar nominations (including Best Picture) and winning four. Other films include Warrior (2011), opposite Joel Edgerton, the story of two estranged brothers facing the fight of a lifetime from director Gavin O'Connor, and This Means War (2012), directed by McG and co-starring Reese Witherspoon and Chris Pine. Tom also starred in the heralded Cold War thriller, La taupe (2011) with Colin Firth and Gary Oldman. Hardy rejoined Christopher Nolan for The Dark Knight Rises (2012); he played the villain role of Bane opposite Christian Bale, Anne Hathaway, Joseph Gordon-Levitt and Gary Oldman. Hardy's menacing physique and his character's scrambled, hard-to-distinguish voice became a major discussion point as the film was released. Outside of performing, Hardy is the patron for the charity \"Flack\", which is an organization to aid the recovery of the homeless in Cambridge. And in 2010, Hardy was named an Ambassador for The Prince's Trust, which helps disadvantaged youth. On the recent stage, he starred in the Brett C. Leonard play \"The Long Red Road\" in early 2010. Written for Hardy and directed by Philip Seymour Hoffman, the play was staged at Chicago's Goodman Theater. In 2015, Hardy starred as the iconic Mad Max in George Miller's reboot of his franchise, Mad Max: Fury Road (2015). He also collected a British Independent Film Award for his portrayal of both the Kray twins, Ronnie and Reggie, in Legend (2015), and an Oscar nomination for Best Supporting Actor for his role as John Fitzgerald in The Revenant (2015). He has an outlaw biker story among other projects in development. In 2010, Hardy became engaged to fellow English actress Charlotte Riley, whom he starred with in The Take (2009) and Wuthering Heights (2009), and is raising a young son, Louis, with ex-girlfriend Rachael Speed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362766","name":"Tom Hardy","idIMDB":"nm0362766"},"actorId":"nm0362766","character":"Robert Dudley","urlCharacter":"http://www.imdb.com/character/ch0044121","main":true},{"actorName":"Dexter Fletcher","urlProfile":"http://www.imdb.com/name/nm0002077","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjc4NDY4Nl5BMl5BanBnXkFtZTYwMjQwMjc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1966","placeOfBirth":" Enfield, London, England, UK","height":"5' 6\" (1.68 m)","bio":"Dexter Fletcher is an English actor who made his way in many screen and television performances, the most well-liked and well-known of the latter being in Press Gang (1989) where he played opposite real-life love (at the time) Julia Sawalha (Lynda Day on \"Press Gang\"). His career began at the age of 10, with a small role in Bugsy Malone (1976).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjc4NDY4Nl5BMl5BanBnXkFtZTYwMjQwMjc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002077","name":"Dexter Fletcher","idIMDB":"nm0002077"},"actorId":"nm0002077","character":" Sir Thomas Radcliffe - Earl of Sussex","urlCharacter":"http://www.imdb.com/character/ch0160249","main":true},{"actorName":"Richard Syms","urlProfile":"http://www.imdb.com/name/nm0843400","urlPhoto":"","biography":{"dateOfBirth":"1943","placeOfBirth":" England, UK","bio":"Richard Syms was born in 1943 in England. He is an actor, known for Gangs of New York (2002), Nowhere Boy (2009) and The Iron Lady (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0843400","name":"Richard Syms","idIMDB":"nm0843400"},"actorId":"nm0843400","character":" Courtier","urlCharacter":"http://www.imdb.com/character/ch0398517","main":true},{"actorName":"Tara Fitzgerald","urlProfile":"http://www.imdb.com/name/nm0001216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjQyNjEwMV5BMl5BanBnXkFtZTYwODMyOTI3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1967","placeOfBirth":" Cuckfield, Sussex, England, UK","birthName":"Tara Anne Cassandra Fitzgerald","height":"5' 5\" (1.65 m)","bio":"Tara Fitzgerald was born in Sussex, England. Her mother, Sarah Fitzgerald, is Irish, and her father, Michael Callaby, was Italian. Shortly after her birth, her family moved to Freeport, in the Bahamas where her grandfather, David Fitzgerald, was a well-established lawyer. Her sister, Arabella Fitzgerald, was born there, but the family returned to London when Tara was three. Her mother and father separated when she was four-years-old and, along with her mother and sister, Tara moved in with her uncle and Aunt Caroline. Her mother married the Irish actor Norman Rodway when Tara was age 6, and the birth of her half-sister, Bianca Rodway, followed shortly thereafter. Rodway and Sarah Fitzgerald separated when Tara was seven. Tara's formative years were spent moving around - a lifestyle that saw her attending five primary schools while living in a variety of locations which included Glasgow, Dublin, and Stratford-upon-Avon. Eventually, Sarah and her three daughters returned to South London, but she left at the age of 16 after passing her \"O\" level examinations, now known as the GCSE (General Certificate of Secondary Education) exams. Her reason for taking a break from the educational process was that she was not allowed to pursue her goal of attending drama school. Tara had auditioned for RADA and the Guildhall, but she was unable to secure a placement. She now recognizes that, at age 17, she really had not been ready. Tara spent the next two years working her way around Europe as a waitress, an experience that provided her with an improved perspective. When she returned to London and decided to audition for a place at the Drama Centre, she was accepted immediately. Her training at the Drama Centre leaned heavily toward method acting which she recalls was like one long therapy session of breaking down the ego, and then rebuilding it. (Other well-known actors who trained at the Drama Centre include Anthony Hopkins, Colin Firth, Simon Callow and Pierce Brosnan). Life at the Drama Centre consisted of long days and hard work, but Tara recalls the time as being one of the best in her life. She was living at home with her mother, and working as a waitress at \"The Ark\" restaurant in Kensington to repay the bank loan which she had secured to cover her tuition fees. A theatrical agent noticed her performance in an amateur production, and arranged for Tara to audition for a co-starring role in the offbeat comedy Hear My Song (1991). Tara was the first actress to audition and, after the director had seen another 300 young hopefuls, the role was hers. Two weeks after graduating from college in July, 1990, Tara was at work on a major film that turned out to be a surprise success, and generated rave reviews of her performance. Tara never looked back. Starring roles in several successful television productions during 1991 and 1992 followed. Tara received critical acclaim for The Black Candle (1991), Performance: Six Characters in Search of an Author (1992), The Camomile Lawn (1992) and Anglo Saxon Attitudes (1992). Her next major step was a co-starring role in the West End play, \"Our Song\", where she acquitted herself nightly opposite one of the legends of the London stage, Peter O'Toole. This success was followed by a role opposite Hugh Grant in the Australian hit film, Sirènes (1993), for which the Australian Film Institute nominated Tara as Best Actress in a Lead Role. An American mini-series, Fall from Grace (1994), was followed by the Irish film, A Man of No Importance (1994), which found Tara sharing honors with Albert Finney. Then came the two widely different television productions Mystery!: Cadfael (1994) (The Leper of St. Giles (#1.3)) and The Vacillations of Poppy Carew (1995). Tara was back co-starring with Hugh Grant in The Englishman Who Went Up a Hill But Came Down a Mountain (1995) before she embarked upon another major change of pace by playing \"Ophelia\" opposite Ralph Fiennes in \"Hamlet\" on the London and Broadway stages. Ralph received the notoriety, but Tara received the award for Best Supporting Actress from the New York Critics Circle. Tara's next success was co-starring with Ewan McGregor in the highly acclaimed comedy/drama Brassed Off (1996). Then, it was back to BBC television for The Tenant of Wildfell Hall (1996), The Woman in White (1997) and The Prince of Hearts (1997), all of which were featured on the U.S. mainstay, \"Masterpiece Theatre\". Tara's next theatrical film was Conquest (1998), which was produced in Canada. Back on the British side of the Atlantic, Tara starred in the contemporary Little White Lies (1998) and the Daphne Du Maurier swashbuckler (also featured on Masterpiece Theatre) Frenchman's Creek (1998), for which she received the award for Best Actress at the 1999 Reims International Television Festival. A major part in the film Childhood (2001) (which, regrettably, has never been released) was followed by the harrowing role of a stalked woman in the psychological drama In the Name of Love (1999). Radio dramatizations have included \"A Handful of Dust\", \"Look Back in Anger\", \"The African Queen\" and, most recently, \"Laughter in Leningrad\". Tara has been heard as the voice of the narrator in such diverse television mini-series as Wild Thing (Animal Life), The Final Day (Celebrity Deaths), Vice - Inside Britain's Sex Business (Self-explanatory), Reputations (Biographies), Omnibus: A Long Time Ago, The Story of Star Wars (TV Special) and, most recently, The Changemakers. You also will hear Tara's great voice doing radio and television advertisements for products ranging from Johnson's Facial Wipes to Norwich Union Insurance. Tara's recent cinematic appearances have included co-starring with Rutger Hauer in New World Disorder (1999), and starring opposite Rhys Ifans and Joseph Fiennes in Rancid Aluminum (2000). During this period, Tara appeared on stage in the title role of \"Antigone\", and as \"Blanche du Bois\" in \"A Streetcar Named Desire\". In 2001, Tara appeared as the female lead in the World War II drama, Dark Blue World (2001) (aka \"Dark Blue World\"), a Czech film by Academy Award-winning director Jan Sverák (Kolya (1996)). She was also seen on the big screen in I Capture the Castle (2003), a romantic comedy based upon the 1948 novel by Dodie Smith (101 Dalmatians). Tara's recent television work has included a starring role in a segment of the highly-regarded psychological drama series Murder in Mind (2001), Murder in Mind: Echoes (2003). She also played the leading female role in Love Again (2003), a dramatization of the life of British poet Philip Larkin, which was telecast on the BBC in July. Tara has completed work on Secret Passage (2004) opposite John Turturro, a period drama which is set in Venice during the Spanish Inquisition, and Cinq enfants et moi (2004), a family adventure film based on E. Nesbit's classic 1902 novel, which was released in the U.K. on October 22, 2004. During the late winter and early spring of 2004, Tara completed a very successful tour of the United Kingdom playing the role of \"Nora Helmer\" in \"A Doll's House\", for which she received high critical acclaim. In the fall of 2004, she began a tour in the role of \"Mara Hill\" in a new comedy \"Clouds\", by Michael Frayn. During her career, Tara has picked her roles cautiously, always seeking to play the role of a strong woman. She feels that playing characters who have weak and insipid parts do not provide her with the motivation that the role of a strong woman can deliver. She has been remarkably successful in a variety of genre ranging from historical costume dramas (The Woman in White (1997), The Tenant of Wildfell Hall (1996) and Frenchman's Creek (1998)), to contemporary psychological suspense dramas (Little White Lies (1998) and In the Name of Love (1999)), as well as comedy dramas (Brassed Off (1996) and Conquest (1998)), and offbeat comedies (Sirènes (1993) and The Vacillations of Poppy Carew (1995)). Her fine performance in the World War II drama Dark Blue World (2001) (aka \"Dark Blue World\") and her recent work on stage give further evidence of her acting versatility.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjQyNjEwMV5BMl5BanBnXkFtZTYwODMyOTI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001216","name":"Tara Fitzgerald","idIMDB":"nm0001216"},"actorId":"nm0001216","character":" Kat Ashley","urlCharacter":"http://www.imdb.com/character/ch0170769","main":true},{"actorName":"Ulrich Thomsen","urlProfile":"http://www.imdb.com/name/nm0860947","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjE0MjQ0Ml5BMl5BanBnXkFtZTgwNDEyNjA3MDE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1963","placeOfBirth":" Odense, Denmark","height":"5' 10¾\" (1.8 m)","bio":"Ulrich Thomsen graduated from The Danish National School of Theatre and Contemporary Dance in 1993, after which playing on several theaters in Copenhagen, i.e. Dr. Dantes Aveny, Mungo Park and Østre Gasværks Teater. His debut on film was in Ole Bornedal's Le veilleur de nuit (1994). Since then a number of roles in, among others, Thomas Vinterberg's The Biggest Heroes (1996), Susanne Bier's Credo (1997) and Anders Thomas Jensen's Flickering Lights (2000). However, the major breakthrough came in the film The Celebration (1998) by Thomas Vinterberg, playing the part as Christian, the son. This performance made him well known outside Denmark, earning him a bad guy role in the James Bond film The World Is Not Enough (1999) and a part in the English film Killing Me Softly (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjE0MjQ0Ml5BMl5BanBnXkFtZTgwNDEyNjA3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0860947","name":"Ulrich Thomsen","idIMDB":"nm0860947"},"actorId":"nm0860947","character":"Baron Casper Breuner","urlCharacter":"http://www.imdb.com/character/ch0205113","main":true},{"actorName":"Jason Watkins","urlProfile":"http://www.imdb.com/name/nm0914327","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjA0MzMxNl5BMl5BanBnXkFtZTgwNTQzNDc4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1966","placeOfBirth":" England, UK","height":"5' 6\" (1.68 m)","bio":"Jason Watkins was born on July 30, 1966 in England. He is an actor, known for The Lost Honour of Christopher Jefferies (2014), W1A (2014) and Trollied (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjA0MzMxNl5BMl5BanBnXkFtZTgwNTQzNDc4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0914327","name":"Jason Watkins","idIMDB":"nm0914327"},"actorId":"nm0914327","character":" Christopher Hatton","urlCharacter":"http://www.imdb.com/character/ch0160248","main":true},{"actorName":"Ben Daniels","urlProfile":"http://www.imdb.com/name/nm0199842","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjU4NDE2N15BMl5BanBnXkFtZTgwMzcxODExOTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1964","placeOfBirth":" Nuneaton, Warwickshire, England, UK","height":"6' (1.83 m)","bio":"Ben Daniels is a multi-award winning performer who is equally at home whether working in Film, Television or Theatre. He was born in the Midlands and became interested in acting through drama lessons while at comprehensive school. He began his career after leaving London's prestigious LAMDA drama school. His early work in theatres around the UK led to him being cast as Richard Loeb, one of the two Chicago \"thrill killers\" who murdered a nine-year-old boy in John Logan's factual play, \"Never the Sinner\", at London's Playhouse Theatre. His performance earned him a nomination for Best Supporting Actor in that year's Laurence Olivier Awards and has led to a highly respected theatre career, notably \"Martin Yesterday\" by Canadian writer Brad Fraser for which he received a M.E.N. nomination for Best Actor, \"As You Like It\" (TMA Supporting Actor award nomination), \"All My Sons\" receiving an Olivier Award and a Whatsonstage Award for Supporting Actor and, most recently, starring opposite Academy Award nominee Laura Linney in the Broadway revival of Christopher Hampton's \"Les Liaisons Dangereuses\", for which he received a Tony Nomination for Best Actor, A Theatre World Award for Breakthrough Broadway Performance, a Drama Desk nomination for Distinguished Performance and an Outer Critics Circle nomination for Outstanding Performance. Ben's television breakthrough came playing philandering \"Finn Bevan\" in three seasons of the BAFTA-nominated BBC series Cutting It (2002). Other notable television work includes the late, great Frank Deasy's hard-hitting drama Real Men (2003) and the controversial The Passion (2008), playing \"Caiaphas\"; \"Francis Walsingham\" in The Virgin Queen (2005); HBO's Conspiracy (2001); Ian Fleming in Ian Fleming: Bondmaker (2005); the political thriller The State Within (2006) and, more recently, four seasons of the acclaimed ITV drama, Law & Order: UK (2009), as senior crown prosecutor \"James Steel\". His diverse film work includes the religious fanatic \"Goat\" in Doom (2005); \"Leopold the Tutor\" in Daisy von Scherler Mayer's Madeline (1998); neo-hippy \"Tony\" in Beautiful Thing (1996); \"DJ Bob\" in Michael Winterbottom's I Want You (1998); \"Augustin Robert\", the soldier who falls in love with a leopard, in Passion in the Desert (1997), the sadistic \"Danny\" in Noli's disturbing Married/Unmarried (2001) and the upcoming _Luna (2011), written and directed by cult artist and graphic novelist Dave McKean.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjU4NDE2N15BMl5BanBnXkFtZTgwMzcxODExOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199842","name":"Ben Daniels","idIMDB":"nm0199842"},"actorId":"nm0199842","character":" Francis Walsingham","urlCharacter":"http://www.imdb.com/character/ch0032345","main":true},{"actorName":"Nigel Martin Davey","urlProfile":"http://www.imdb.com/name/nm1842807","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NjgwNjg0MV5BMl5BanBnXkFtZTgwMTI2NDYxNzE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1965","placeOfBirth":" Birmingham, England, UK","height":"6' (1.83 m)","bio":"Born in Birmingham UK, both his parents are from Southern Ireland. As a teenager he joined a touring theatre group for a few years. He then went onto act in numerous television dramas and feature films. He has been a Film Producer since 2003 and has produced many successful films and stage productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NjgwNjg0MV5BMl5BanBnXkFtZTgwMTI2NDYxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1842807","name":"Nigel Martin Davey","idIMDB":"nm1842807"},"actorId":"nm1842807","character":" Earl of Pembroke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin McKidd","urlProfile":"http://www.imdb.com/name/nm0571727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUxNTQ3OV5BMl5BanBnXkFtZTcwOTg4Mjc5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1973","placeOfBirth":" Elgin, Moray, Scotland, UK","height":"5' 11\" (1.8 m)","bio":"Kevin McKidd was born and raised in Elgin, Scotland, the son of Kathleen, a secretary, and Neil McKidd, a plumber. He was a member of the Moray Youth Theatre, before going on to study Engineering at the University of Edinburgh. While at the university, Kevin became involved with Bedlam Theatre, the university's student theatre company. At this point, Kevin decided to give up on engineering and dropped out of the university to pursue acting full-time. In 1994, he landed the leading role in the stageplay, \"The Silver Darlings\", produced by Robert Carlyle's Rain Dog Theatre Company. It was only a matter of time before Kevin made his screen debut as the vicious gangleader, \"Malky Johnson\", in Gillies MacKinnon's Small Faces (1996). His next role was as the tragic, gentle giant, \"Tommy\", in Trainspotting (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUxNTQ3OV5BMl5BanBnXkFtZTcwOTg4Mjc5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571727","name":"Kevin McKidd","idIMDB":"nm0571727"},"actorId":"nm0571727","character":" Duke of Norfolk","urlCharacter":"http://www.imdb.com/character/ch0095708","main":true},{"actorName":"Rodrigo De Veccha","urlProfile":"http://www.imdb.com/name/nm2169933","urlPhoto":"","biography":{"bio":"Rodrigo De Veccha is an actor, known for The Virgin Queen (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2169933","name":"Rodrigo De Veccha","idIMDB":"nm2169933"},"actorId":"nm2169933","character":" Jester","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcello Magni","urlProfile":"http://www.imdb.com/name/nm0536239","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDE5NTk0OF5BMl5BanBnXkFtZTcwMzk0MDU1NA@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Marcello Magni was born in Bergamo, Italy. He is known for his work on Nine (2009), The Adventures of Pinocchio (1996) and Mr. Turner (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDE5NTk0OF5BMl5BanBnXkFtZTcwMzk0MDU1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0536239","name":"Marcello Magni","idIMDB":"nm0536239"},"actorId":"nm0536239","character":" Alvarez De Quadra","urlCharacter":"http://www.imdb.com/character/ch0160250","main":true},{"actorName":"Emilia Fox","urlProfile":"http://www.imdb.com/name/nm0288976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMyMjcyNzA2Ml5BMl5BanBnXkFtZTcwNTM0MTA0MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1974","placeOfBirth":" London, England, UK","birthName":"Emilia Lydia Rose Fox","height":"5' 6\" (1.68 m)","bio":"Emilia Fox was born on July 31, 1974 in London, England as Emilia Lydia Rose Fox. She is an actress and producer, known for The Pianist (2002), Silent Witness (1996) and David Copperfield (1999). She was previously married to Jared Harris.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMyMjcyNzA2Ml5BMl5BanBnXkFtZTcwNTM0MTA0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0288976","name":"Emilia Fox","idIMDB":"nm0288976"},"actorId":"nm0288976","character":" Amy Dudley","urlCharacter":"http://www.imdb.com/character/ch0170770","main":true},{"actorName":"Lisa Millett","urlProfile":"http://www.imdb.com/name/nm0589584","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc5MDQ2NTc4NV5BMl5BanBnXkFtZTcwNzQ5MjI2Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Lisa Millett is an actress, known for Robin Hood (2010), Millions (2004) and Under the Skin (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc5MDQ2NTc4NV5BMl5BanBnXkFtZTcwNzQ5MjI2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0589584","name":"Lisa Millett","idIMDB":"nm0589584"},"actorId":"nm0589584","character":" Mrs. Odingsell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph Ineson","urlProfile":"http://www.imdb.com/name/nm0408591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjk5NzMyNl5BMl5BanBnXkFtZTcwODg3ODg3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1969","placeOfBirth":" Leeds, West Yorkshire, England, UK","height":"6' 3\" (1.91 m)","bio":"Ralph Ineson was born on December 15, 1969 in Leeds, West Yorkshire, England. He is an actor, known for The Witch (2015), Kingsman: The Secret Service (2014) and Harry Potter and the Deathly Hallows: Part 2 (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMjk5NzMyNl5BMl5BanBnXkFtZTcwODg3ODg3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408591","name":"Ralph Ineson","idIMDB":"nm0408591"},"actorId":"nm0408591","character":" Dr. William Cowes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ewen Bremner","urlProfile":"http://www.imdb.com/name/nm0001971","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTVjNzNhNzItNjc1ZC00YTJjLWI2MjctMDc4MmMxOGZkZGUxXkEyXkFqcGdeQXVyMTg0NTYyNjU@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1972","placeOfBirth":" Edinburgh, Scotland, UK","height":"5' 8\" (1.73 m)","bio":"Born in Edinburgh, Scotland, Ewen Bremner has worked with many of the most respected directors in world cinema, including Danny Boyle, Mike Leigh, Ridley Scott, Joon-Ho Bong, Werner Herzog and Woody Allen. Ewen has established himself by creating unique characters in critically acclaimed films, as well as going toe to toe with many of Hollywood's biggest stars. Bremner had worked widely in theatre, television, and film for years before being cast in his breakout role in Trainspotting (1996), by Oscar-winning director Danny Boyle. Having originated the role of Mark Renton in Edinburgh's Traverse Theatre production, Bremner then made waves opposite Ewan McGregor playing Spud Murphy and earned screen immortality with his character's infamous \"speed fueled\" job interview scene. Prior to Trainspotting, Bremner gave a striking performance in Mike Leigh's Naked, starring opposite David Thewlis. In 1999, Bremner received critical acclaim for his portrayal of a schizophrenic man living with his dysfunctional family in Harmony Korine's Julien Donkey-Boy. Filmed strictly in accordance with the ultra-realist tenants of Lars Von Trier's Dogma 95 movement and starring opposite Werner Herzog, Bremner played Julien its eponymous hero, requiring him to assume an American accent. He then worked with director Michael Bay in his high-profile 2001 war film Pearl Harbor, proving his versatility once again by portraying the role of a wholeheartedly patriotic American soldier fighting in WWII. The following year, he stepped back into fatigues for a supporting role in Ridley Scott's Black Hawk Down, while rounding out the next several years with roles in high-profile Hollywood releases such as The Rundown, Disney's Around the World in 80 Days, Alien vs. Predator, Woody Allen's Match Point, the comedy Death at a Funeral directed by Frank Oz, and Fool's Gold starring Matthew McConaughey and Kate Hudson. This past year proved to be a busy one when Bremner was invited to join the DC Universe in the Zack Snyder-produced feature Wonder Woman, directed by Patty Jenkins, co-starring Gal Gadot and Chris Pine, and set for release by Warner Bros. in the summer of 2017. Ewen would also reprise his unforgettable role as \"Spud\" in the highly-anticipated sequel to Danny Boyle's cult classic, T2: Trainspotting, for Sony due out early 2017. He rounded out the year with the feature The Lake, produced by Luc Besson. Currently (2017), Bremner is filming the TNT Drama Series Will with Shekhar Kapur, produced by Craig Pearce, whose writing credits include the feature films The Great Gatsby, Moulin Rouge, Romeo + Juliet and Strictly Ballroom. The series will tell the story of the lost years of young William Shakespeare after his arrival to London in 1589. Other notable film credits include Woody Allen's You Will Meet a Tall Dark Stranger, David Mackenzie's Perfect Sense starring again alongside Ewan McGregor, Great Expectations directed by Mike Newell, Bryan Singer's Jack the Giant Slayer, and Snowpiercer directed by Bong Joon-Ho and starring opposite Chris Evans and Tilda Swinton. Further credits include Exodus: Gods and Kings, Wide Open Spaces, Mojo, Mediator, Faintheart, Hallam Foe, Sixteen Years of Alcohol, and Snatch. In television, Ewen has worked on many acclaimed productions including David Hare's Worriker trilogy starring Bill Nighy for BBC, Jimmy McGovern's Moving On and also his Australian mini-series Banished, Strike Back for Sky TV, Dominic Savage's Dive, the Dylan Thomas biopic, A Poet In New York and the adaptation of Day of the Triffids for the BBC. Other noteworthy series appearances include portraying legendary surrealist Salvador Dali in the U.K. television drama Surrealissimo: The Trial of Salvador Dali, and a guest spot on the successful NBC series, My Name is Earl. Ewen has worked extensively in theatre and his credits include God of Hell (Donmar Warehouse), Damascus (Traverse), Trainspotting (Citizens/Traverse/Bush Theatres), The Present (Bush Theatre), Gormenghast (Lyric Hammersmith), Bright Light Shinning (Bush Theatre) and Conquest of the South Pole (Traverse/Royal Court) among others. He currently spends his time between Scotland and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTVjNzNhNzItNjc1ZC00YTJjLWI2MjctMDc4MmMxOGZkZGUxXkEyXkFqcGdeQXVyMTg0NTYyNjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001971","name":"Ewen Bremner","idIMDB":"nm0001971"},"actorId":"nm0001971","character":" Sir James Melville","urlCharacter":"http://www.imdb.com/character/ch0045092","main":true},{"actorName":"Hans Matheson","urlProfile":"http://www.imdb.com/name/nm0558548","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTcyNTI5MV5BMl5BanBnXkFtZTYwMDE0NDQ3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1975","placeOfBirth":" Stornaway, Scotland, UK","height":"5' 8½\" (1.74 m)","bio":"Hans Matheson was born in a caravan on August 7, 1975 at Stornoway, Isle of Lewis, located in the Outer Hebrides of Scotland. Shortly after, his family moved to Canterbury, Kent in England but Hans often spent his summer holidays on Stornoway with his grandparents. As a child, his parents Iain (Ado) and Sheena often took him and his younger brother to folk festivals and Bob Dylan concerts. His father Ado is a musician and his grandfather was a Gaelic singer and songwriter before him performing at concerts and ceilidhs throughout Scotland. His great-grandfather was crowned the Celtic Bard in recognition of his writing in the '50s. Hans claims to have been a shy and introverted child who was not happy at school. He left school and, at the suggestion of his mother, auditioned for drama school: Avondale Hall in Clapham. At the suggestion of his teacher and mentor, he auditioned for a Jez Butterworth TV show called Christmas and this led to a role in Mojo on stage at the Royal Court Theatre and later in the film version of the same name. Roles in TV shows Bramwell (1995), Wycliffe (1994), and Family Money (1996) followed and films Stella Does Tricks (1996), Still Crazy (1998), and Bodywork (2001). His first break on the international arena came with his casting as Marius in Bille August's production of the Victor Hugo classic Les Misérables (1998). He then starred in the European films Canone inverso - Making Love (2000) and Dina (2002), and the television mini-series Les brumes d'Avalon (2001). His major role to date has undoubtedly been the lead role as Yury Zhivago in the 2002 Granada Television adaptation of Doctor Zhivago (2002) the famous Russian novel by Boris Pasternak, where he co-starred with Keira Knightley and Sam Neill. Hans is not only a talented actor but plays guitar, violin and harmonica and writes his own songs. He prefers the simple things in life to pursuing fame and fortune. He takes his guitar with him everywhere and prefers to travel by train rather than by air, even if the trip takes days.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTcyNTI5MV5BMl5BanBnXkFtZTYwMDE0NDQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0558548","name":"Hans Matheson","idIMDB":"nm0558548"},"actorId":"nm0558548","character":"Earl of Essex","urlCharacter":"http://www.imdb.com/character/ch0030422","main":true},{"actorName":"Joanna Griffiths","urlProfile":"http://www.imdb.com/name/nm0341698","urlPhoto":"","biography":{"bio":"Joanna Griffiths is an actress, known for Le parfum - Histoire d'un meurtrier (2006), Vera Drake (2004) and Nice Girl (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0341698","name":"Joanna Griffiths","idIMDB":"nm0341698"},"actorId":"nm0341698","character":" Agnes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siobhan Hewlett","urlProfile":"http://www.imdb.com/name/nm1305192","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ4ODM3NzQ0OV5BMl5BanBnXkFtZTgwODQxMTU1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1983","placeOfBirth":" London, England, UK","height":"5' 10\" (1.78 m)","bio":"Siobhan is the daughter of the late comedy acting TV star Donald Hewlett and actress Therese McMurray. raised in Ireland and Whitstable in Kent a seaside town. her Grandmother was the last captain of the bluebell girl's a high kicking can can troupe from Paris in the 20's and 30's. working with Jaques Tati, Josephine Baker and Mistanguette. Her grandfather was a renowned vaudeville knockabout comic, introduced by their agent the late Lord Lew Grade who asked them to perform at the Nuremberg war trials to entertain the judges and diplomats. Her great grandparents were variety artists. She was educated at boarding school in England on art scholarships. Siobhan was the main carer for her parents from a young age, her mother was in a wheelchair. Was spotted by a top talent agent in a school production but chose to attend Drama school to focus on her theatre work. Turned down a place at Cambridge university after gaining a full scholarship to prestigious Webber Douglas Academy of Dramatic Art in London where she studied for 2 years. Siobhan left early to play the lead in a French movie. She persuaded the director she could play the character at the ages 16, 18,24 and 40 and learn french for the french speaking role. Siobhan lives in London splitting her time between her stage and film work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ4ODM3NzQ0OV5BMl5BanBnXkFtZTgwODQxMTU1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1305192","name":"Siobhan Hewlett","idIMDB":"nm1305192"},"actorId":"nm1305192","character":" Cecily","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geoff Bell","urlProfile":"http://www.imdb.com/name/nm1052141","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NzQ4ODIzNV5BMl5BanBnXkFtZTcwMDkyODQyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1963","placeOfBirth":" London, England, UK","bio":"Geoff Bell was born in 1963 in London, England. He is an actor, known for Kingsman: The Secret Service (2014), Green Street Hooligans (2005) and Scoop (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NzQ4ODIzNV5BMl5BanBnXkFtZTcwMDkyODQyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1052141","name":"Geoff Bell","idIMDB":"nm1052141"},"actorId":"nm1052141","character":" Dentist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karl Theobald","urlProfile":"http://www.imdb.com/name/nm1717331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODQ1NDEyMl5BMl5BanBnXkFtZTcwMTU0NDI1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1969","placeOfBirth":" Lowestoft, Suffolk, England, UK","height":"5' 8½\" (1.74 m)","bio":"Born in Lowestoft, Suffolk, Karl Theobald was a stand-up comedian before graduating from the Drama Centre in 2000, and subsequently joining theatrical touring companies such as Complicite . In both 2000 and 20001 he appeared at the Edinburgh Festival, in 2001 as a member of the prestigious Comedy Zone. He has also travelled throughout Great Britain performing his one-man show entitled Mr. Tinnamen's Travelling Medicine Show. In addition to his appearances as a comic actor, notably on television's 'Green Wing', '2012' and as the grasping landlord in Roman set 'Plebs', he is also a writer and in 2002 he was part of the team who collected a British Academy award for Best Television Comedy Series for scripting 'The Sketch Show.'","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODQ1NDEyMl5BMl5BanBnXkFtZTcwMTU0NDI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1717331","name":"Karl Theobald","idIMDB":"nm1717331"},"actorId":"nm1717331","character":" Alsop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Evans","urlProfile":"http://www.imdb.com/name/nm0262665","urlPhoto":"","biography":{"dateOfBirth":"31 July 1973","placeOfBirth":" Wales, UK","birthName":"Daniel Gwyn Evans","bio":"Daniel Evans was born on July 31, 1973 in Wales as Daniel Gwyn Evans. He is an actor, known for Les Misérables (2012), The Ramen Girl (2008) and Y Mabinogi (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0262665","name":"Daniel Evans","idIMDB":"nm0262665"},"actorId":"nm0262665","character":" Robert Cecil","urlCharacter":"http://www.imdb.com/character/ch0044958","main":true},{"actorName":"Derek Riddell","urlProfile":"http://www.imdb.com/name/nm0725701","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NzU2MzEzOV5BMl5BanBnXkFtZTgwMTczMDE5OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1967","placeOfBirth":" Glasgow, Scotland, UK","height":"5' 11½\" (1.82 m)","bio":"After completing a BA in business studies at the University of Strathclyde, in his home city of Glasgow, he went on to train at the London Academy of Music and Dramatic Art and has worked extensively in theatre film and television in both the UK and the USA Having first come to prominence in Channel 4's cult hit \"The Book Group\" ,he has since had recurring roles in many well known, much loved and award winning series such as \"Happy Valley\", \" Undercover\" ,\"The Village\", \"Frankie\", \"No Angels\" and \"Clocking Off\" In the US he starred alongside Lily Taylor in Lifetime's 'State of Mind' and is also known for the role of Stuart in series 2 and 3 of ABC's \"Ugly Betty\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NzU2MzEzOV5BMl5BanBnXkFtZTgwMTczMDE5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725701","name":"Derek Riddell","idIMDB":"nm0725701"},"actorId":"nm0725701","character":" Sir Walter Raleigh","urlCharacter":"http://www.imdb.com/character/ch0028262","main":true},{"actorName":"Neil Stuke","urlProfile":"http://www.imdb.com/name/nm0836146","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NzQ0NDI0MF5BMl5BanBnXkFtZTcwNjk5MzE1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1967","placeOfBirth":" Kent, England, UK","height":"5' 8\" (1.73 m)","bio":"Neil Stuke was born in 1967 in Kent, England. He is an actor, known for Sliding Doors (1998), Christie Malry's Own Double-Entry (2000) and Twice Upon a Yesterday (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NzQ0NDI0MF5BMl5BanBnXkFtZTcwNjk5MzE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0836146","name":"Neil Stuke","idIMDB":"nm0836146"},"actorId":"nm0836146","character":" Francis Bacon","urlCharacter":"http://www.imdb.com/character/ch0027625","main":true},{"actorName":"Sebastian Armesto","urlProfile":"http://www.imdb.com/name/nm0273797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjgzODM1Ml5BMl5BanBnXkFtZTcwMTk4MDkwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1982","placeOfBirth":" England, UK","birthName":"Sebastian Felipe Xavier Fernández-Garcia Armesto","bio":"Sebastian Armesto (born 3 June 1982) is an English film, television and theatre actor. He is the son of the historian Felipe Fernandez-Armesto. He was educated at Eton College. Armesto has acted in high-profile theatre productions in Britain, including three shows at the National Theatre and one at the Royal Court. He also writes and directs theatre with company Simple 8. His productions include directing and adaptating Les Enfants du Paradis to great acclaim. Most recently, he co-wrote and directed a play based on William Hogarth's The Four Stages of Cruelty and new versions of The Cabinet of Dr. Caligari and Moby-Dick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjgzODM1Ml5BMl5BanBnXkFtZTcwMTk4MDkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0273797","name":"Sebastian Armesto","idIMDB":"nm0273797"},"actorId":"nm0273797","character":" Charles Blount","urlCharacter":"http://www.imdb.com/character/ch0531320","main":true},{"actorName":"Shaun Evans","urlProfile":"http://www.imdb.com/name/nm1140345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODMxNDMxMF5BMl5BanBnXkFtZTcwNDUwNzcxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1980","placeOfBirth":" Liverpool, Merseyside, England, UK","height":"5' 9½\" (1.77 m)","bio":"Shaun Evans was born on March 6, 1980 in Liverpool, Merseyside, England. He is an actor and producer, known for Cashback (2006), Adorable Julia (2004) and Boy A (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODMxNDMxMF5BMl5BanBnXkFtZTcwNDUwNzcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1140345","name":"Shaun Evans","idIMDB":"nm1140345"},"actorId":"nm1140345","character":" Earl of Southampton","urlCharacter":"http://www.imdb.com/character/ch0244590","main":true},{"actorName":"Simon Anderson","urlProfile":"http://www.imdb.com/name/nm0027449","urlPhoto":"","biography":{"bio":"Simon Anderson is an actor and director, known for Holy Smoke (1999), Irina Palm (2007) and Boys on Film 15: Time & Tied (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0027449","name":"Simon Anderson","idIMDB":"nm0027449"},"actorId":"nm0027449","character":" Courtier","urlCharacter":"http://www.imdb.com/character/ch0398517","main":true},{"actorName":"Gavin Brocker","urlProfile":"http://www.imdb.com/name/nm2511874","urlPhoto":"","biography":{"dateOfBirth":"1983","placeOfBirth":" Plumstead, London, England, UK","bio":"Gavin Brocker was born in Plumstead, East London, and admits that the only school subjects that really interested him were English and drama. He was prepared to train for computer work and went to North West Kent College, where, on the strength of his performance record in school plays, it was suggested he considered taking up acting instead. He received in-service training at the Miskin Theatre before going on to the London Arts Educational School, where he won the Laurence Olivier Bursary, and from where he graduated in 2005. He has since appeared in all media, from the stage revival of 'Beautiful Thing' to the role of a conniving spiv in 'Foyle's War' and a strong supporting part in the football picture 'Cass'.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2511874","name":"Gavin Brocker","idIMDB":"nm2511874"},"actorId":"nm2511874","character":" Young Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jordy Cernik","urlProfile":"http://www.imdb.com/name/nm3385858","urlPhoto":"","biography":{"birthName":"Peter John Cernik","height":"5' 8\" (1.73 m)","bio":"Jordy Cernik was born as Peter John Cernik. He is known for his work on The Virgin Queen (2005), The Shouting Men (2010) and Goal! The Dream Begins (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3385858","name":"Jordy Cernik","nicknames":["Rent a gob","Rent A Gob!"],"idIMDB":"nm3385858"},"actorId":"nm3385858","character":" Period Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dirk Smith","urlProfile":"http://www.imdb.com/name/nm1952023","urlPhoto":"","biography":{"dateOfBirth":"21 July 1956","placeOfBirth":" South Shields, Tyne and Wear, England, UK","birthName":"Derek Smith","bio":"Dirk Smith was born on July 21, 1956 in South Shields, Tyne and Wear, England as Derek Smith. He is an actor, known for Public Sex (2009), The Virgin Queen (2005) and Perfect Day (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1952023","name":"Dirk Smith","idIMDB":"nm1952023"},"actorId":"nm1952023","character":" Soldier","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[{"yearSeason":2006,"episodes":[{"episode":1,"title":"Episode #1.1","date":"22 Jan. 2006","plot":"Elizabeth remains a threat in her childless Catholic sister's eyes. Queen Mary is still on the throne and with her harsh politics, she excessively pursues the persecution of Protestants, even of her sister. Queen Mary knows that her sister has a large number of supporters in England, and therefore, she imprisons Elizabeth in the tower and later puts her under house arrest. When Queen Mary surprisingly dies from a tumor, Elizabeth becomes Queen of England. William Cecil, her advisor, warns Elizabeth of the dangers that the married Robert Dudley may, due to their ...","idIMDB":"tt1411147","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjQwMjU0NV5BMl5BanBnXkFtZTgwODQ2MDg3MjE@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":2,"title":"Episode #1.2","date":"29 Jan. 2006","plot":"The pressure on Elizabeth grows as there is still no marriage and consequently no heir to the throne. Elizabeth fears that her cousin Mary Queen of Scots, recently widowed, might claim her right to the throne of England. However she is resolute in thinking that she can rule alone. Meanwhile she continues to meet Robert Dudley. When his wife dies, rumors spread that Elizabeth might be behind her death. Details of a plot to replace Elizabeth with Mary are uncovered by Walsingham. Even the Duke of Norfolk seems to be involved and is subsequently sent to the tower.","idIMDB":"tt1411148","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjQ0MzY2OF5BMl5BanBnXkFtZTgwNjg2MDg3MjE@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":3,"title":"Episode #1.3","date":"5 Feb. 2006","plot":"In order to neutralize the threat from the Catholics, Elizabeth pursues a match with the Duke of Anjou. Walsingham discovers proof of a planed murder of Elizabeth. Elizabeth sends the Duke of Anjou away when she finds a knife in her bed and brings Mary Queen of Scots to trial. She is forced to execute her when Mary Queen of Scots is found guilty. This execution angers the Spanish and they send their Armada to fight the English as a consequence. However, the English can defeat the Armada. The news of Dudley's death leaves Elizabeth heartbroken, but when she meets the ...","idIMDB":"tt1411149","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDg5OTAyN15BMl5BanBnXkFtZTgwMzQ2MDg3MjE@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":4,"title":"Episode #1.4","date":"12 Feb. 2006","plot":"The Queen refuses to pay him when the Earl of Essex, the new national hero, returns with less riches than expected. He then travels to Ireland in order to put down a rebellion. He is not doing as well there as hoped. Elizabeth, however, doesn't allow him to come back home. To her dismay, he gives up and agrees on a ceasefire. Back in England, the Earl of Essex leads a rebellion against Queen Elizabeth. He and the other rebellion members are put in the tower after he they were unable to mobilize enough support. Eventually, Essex is executed.","idIMDB":"tt1411150"}]},{"yearSeason":2006,"episodes":[{"episode":1,"title":"Episode #1.1","date":"22 Jan. 2006","plot":"Elizabeth remains a threat in her childless Catholic sister's eyes. Queen Mary is still on the throne and with her harsh politics, she excessively pursues the persecution of Protestants, even of her sister. Queen Mary knows that her sister has a large number of supporters in England, and therefore, she imprisons Elizabeth in the tower and later puts her under house arrest. When Queen Mary surprisingly dies from a tumor, Elizabeth becomes Queen of England. William Cecil, her advisor, warns Elizabeth of the dangers that the married Robert Dudley may, due to their ...","idIMDB":"tt1411147","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjQwMjU0NV5BMl5BanBnXkFtZTgwODQ2MDg3MjE@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":2,"title":"Episode #1.2","date":"29 Jan. 2006","plot":"The pressure on Elizabeth grows as there is still no marriage and consequently no heir to the throne. Elizabeth fears that her cousin Mary Queen of Scots, recently widowed, might claim her right to the throne of England. However she is resolute in thinking that she can rule alone. Meanwhile she continues to meet Robert Dudley. When his wife dies, rumors spread that Elizabeth might be behind her death. Details of a plot to replace Elizabeth with Mary are uncovered by Walsingham. Even the Duke of Norfolk seems to be involved and is subsequently sent to the tower.","idIMDB":"tt1411148","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjQ0MzY2OF5BMl5BanBnXkFtZTgwNjg2MDg3MjE@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":3,"title":"Episode #1.3","date":"5 Feb. 2006","plot":"In order to neutralize the threat from the Catholics, Elizabeth pursues a match with the Duke of Anjou. Walsingham discovers proof of a planed murder of Elizabeth. Elizabeth sends the Duke of Anjou away when she finds a knife in her bed and brings Mary Queen of Scots to trial. She is forced to execute her when Mary Queen of Scots is found guilty. This execution angers the Spanish and they send their Armada to fight the English as a consequence. However, the English can defeat the Armada. The news of Dudley's death leaves Elizabeth heartbroken, but when she meets the ...","idIMDB":"tt1411149","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDg5OTAyN15BMl5BanBnXkFtZTgwMzQ2MDg3MjE@._V1_UX200_CR0,0,200,112_AL_.jpg"},{"episode":4,"title":"Episode #1.4","date":"12 Feb. 2006","plot":"The Queen refuses to pay him when the Earl of Essex, the new national hero, returns with less riches than expected. He then travels to Ireland in order to put down a rebellion. He is not doing as well there as hoped. Elizabeth, however, doesn't allow him to come back home. To her dismay, he gives up and agrees on a ceasefire. Back in England, the Earl of Essex leads a rebellion against Queen Elizabeth. He and the other rebellion members are put in the tower after he they were unable to mobilize enough support. Eventually, Essex is executed.","idIMDB":"tt1411150"}]}],"idIMDB":"tt0481459","urlIMDB":"http://www.imdb.com/title/tt0481459","business":{"budget":{"money":"£6,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["3 hr 57 min (237 min) (4 parts)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.7","filmingLocations":[{"location":"Alnwick Castle, Alnwick, Northumberland, England, UK"}],"awards":[{"award":"BAFTA Awards 2007","titlesAwards":[{"titleAwardOutcome":"Won BAFTA TV Award","categories":[{"category":"Best Costume Design","names":[{"name":"Amy Roberts","id":"nm0730820","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA TV Award","categories":[{"category":"Best Drama Serial","names":[{"name":"Coky Giedroyc","id":"nm0317328","role":null},{"name":"Paula Milne","id":"nm0590360","role":null},{"name":"Paul Rutman","id":"nm0752107","role":null}]},{"category":"Best Actress","names":[{"name":"Anne-Marie Duff","id":"nm0240359","role":null}]}]}]},{"award":"International Emmy Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Emmy","categories":[{"category":"TV Movie/Mini-Series","names":[{"name":"British Broadcasting Corporation (BBC)","id":null,"role":null},{"name":"Power","id":null,"role":null}]}]}]},{"award":"Irish Film and Television Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated IFTA Award","categories":[{"category":"Best Actress in a Lead Role in Television","names":[{"name":"Anne-Marie Duff","id":"nm0240359","role":null}]}]}]},{"award":"Online Film & Television Association 2005","titlesAwards":[{"titleAwardOutcome":"Won OFTA Television Award","categories":[{"category":"Best Costume Design in a Motion Picture or Miniseries","names":[]}]},{"titleAwardOutcome":"Nominated OFTA Television Award","categories":[{"category":"Best Miniseries","names":[]},{"category":"Best Writing of a Motion Picture or Miniseries","names":[{"name":"Paula Milne","id":"nm0590360","role":null}]},{"category":"Best Production Design in a Motion Picture or Miniseries","names":[]}]}]},{"award":"Satellite Awards 2005","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Outstanding Miniseries","names":[]}]}]}],"votes":"2,102","type":"TV Mini-Series","companyCreditsSimple":[{"idCompany":"co0043107","name":"British Broadcasting Corporation (BBC)"},{"idCompany":"co0138182","name":"Power"},{"idCompany":"co0160370","name":"Powercorp"}],"keywords":{"keywords":["historical fiction","queen elizabeth i","strong female lead","female protagonist","court intrigue","tv mini series","tudor","16th century","1500s","queen of england"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:15:19"}}