{"data":{"movies":[{"title":"Man of Steel","originalTitle":"","year":"2013","releaseDate":"20130614","directors":[{"name":"Zack Snyder","id":"nm0811583"}],"writers":[{"name":"David S. Goyer","id":"nm0333060"},{"name":"David S. Goyer","id":"nm0333060"}],"runtime":"143 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5OTYzNjI0Ml5BMl5BanBnXkFtZTcwMzM1NDA1OQ@@._V1.jpg","countries":["USA","Canada","UK"],"languages":["English"],"genres":["Action","Adventure","Fantasy","Sci-Fi"],"plot":"A young boy learns that he has extraordinary powers and is not of this Earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.","simplePlot":"Clark Kent, one of the last of an extinguished race disguised as an unremarkable human, is forced to reveal his identity when Earth is invaded by an army of survivors who threaten to bring the planet to the brink of destruction.","actors":[{"actorName":"Henry Cavill","urlProfile":"http://www.imdb.com/name/nm0147147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTExMzUzOF5BMl5BanBnXkFtZTgwOTI1MjA3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1983","placeOfBirth":" Jersey, Channel Islands","birthName":"Henry William Dalgliesh Cavill","height":"6' 1\" (1.85 m)","bio":"Henry William Dalgliesh Cavill is a British actor. He was born on the Bailiwick of Jersey, a British Crown dependency in the Channel Islands. His mother, Marianne (Dalgliesh), a housewife, was also born on Jersey, and is of Irish, Scottish, and English ancestry. Henry's father, Colin Richard Cavill, a stockbroker, is of English origin (born in Chester, England). Henry is the second youngest son, with four brothers. He was privately educated at St. Michael's Preparatory School in Saint Saviour, Jersey before attending Stowe School in Buckinghamshire, England. Henry's interest in acting started at an early age with school play renditions of Shakespeare's \"A Midsummer Night's Dream\", and Sonny in \"Grease\". He also starred and directed Hamlet in \"40 Minutes\". It was at the age of seventeen when Henry was discovered by casting directors at school who were looking for a young boy to play Albert Mondego in The Count of Monte Cristo (2002). He went on to star in Laguna (2001), appear in BBC's \"The Inspector Lynley Mysteries\", TV film Goodbye, Mr. Chips (2002), and TV series Midsomer Murders (1997). When Henry was twenty years old, he gained starring roles in I Capture the Castle (2003), Red Riding Hood (2006), Hellraiser: Hellworld (2005) (V)Tristan + Isolde (2006). He also had a minor role in Stardust (2007) alongside Sienna Miller and Ben Barnes. During 2007-2010, Henry had a leading role in TV series Les Tudors (2007) as Charles Brandon, 1st Duke of Suffolk. The series was a hit and was nominated for a Golden Globe in 2007 and won an Emmy in 2008. Entertainment Weekly named him 'Most Dashing Duke'. He also starred in Blood Creek (2006) and Woody Allen's comedy film Whatever Works (2009). On January 30, 2011, it was announced that Henry Cavill had been cast as the next Superman in Man of Steel (2013), making him the first non-American actor to play Superman. Man of Steel (2013) was directed by Zach Snyder, produced by Christopher Nolan, and scripted by David S. Goyer. On November 7, 2011, Henry starred in Tarsem Singh's mythological special effects film Immortals (2011) alongside Mickey Rourke, Freida Pinto, and Luke Evans. On September 7, 2012, Henry starred in action-thriller Cold Light of Day (2003) alongside Bruce Willis and Sigourney Weaver. On June 10, 2013, Man of Steel (2013) kicked off its world premiere in New York City followed by London, Bailiwick of Jersey, Sicily, Madrid, Shanghai, Sydney, and Tokyo. Man of Steel (2013) became the highest-grossing Superman film to date, and the second-highest-grossing reboot of all time behind The Amazing Spider-Man (2012). Glamour magazine ranked him the #1 \"Sexiest Man\". In August 2014, Henry became the Ambassador for Durrell Wildlife Park and created a website and social media called #CavillConservation to help raise funds and awareness for his love of animals and conservation. On November 3, 2014, it was announced that Cavill, his brother Charlie, and London-based producer Rex Glensy, have formed their own British production company, Promethean Productions. On August 7, 2015, The Man from U.N.C.L.E. began its premiere tour with a people's premiere at the famous Somerset House in London, followed by its world premiere in New York City, then Toronto, and Rio de Janeiro.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTExMzUzOF5BMl5BanBnXkFtZTgwOTI1MjA3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0147147","name":"Henry Cavill","nicknames":["Hank","Henners","Most Dashing Duke"],"idIMDB":"nm0147147"},"actorId":"nm0147147","character":"Clark Kent / Kal-El","urlCharacter":"http://www.imdb.com/character/ch0118677","main":true},{"actorName":"Amy Adams","urlProfile":"http://www.imdb.com/name/nm0010736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NjExMjI1OF5BMl5BanBnXkFtZTcwODc0MjY2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1974","placeOfBirth":" Vicenza, Veneto, Italy","birthName":"Amy Lou Adams","height":"5' 4\" (1.63 m)","bio":"Amy Lou Adams was born in Vicenza, Veneto, Italy, to American parents, Kathryn (Hicken) and Richard Kent Adams, a U.S. serviceman who was stationed at Caserma Ederle in Italy at the time. She was raised in a Mormon family of seven children in Castle Rock, Colorado, and has English, as well as smaller amounts of Danish, Swiss-German, and Norwegian, ancestry. Adams sang in the school choir at Douglas County High School and was an apprentice dancer at a local dance company, with the ambition of becoming a ballerina. However, she worked as a greeter at The Gap and as a Hooters hostess to support herself before finding work as a dancer at Boulder's Dinner Theatre and Country Dinner Playhouse in such productions as \"Brigadoon\" and \"A Chorus Line\". It was there that she was spotted by a Minneapolis dinner-theater director who asked her to move to Chanhassen, Minnesota for more regional dinner theater work. Nursing a pulled muscle that kept her from dancing, she was free to audition for a part in Belles à mourir (1999), which was filming nearby in Minnesota. During the filming, Kirstie Alley encouraged her to move to Los Angeles, where she soon won a part in the Fox television version of the film, Cruel Intentions (1999), in the part played in the film by Sarah Michelle Gellar, \"Kathryn Merteuil\". Although three episodes were filmed, the troubled series never aired. Instead, parts of the episodes were cobbled together and released as the direct-to-video Cruel Intentions 2 (2000). After more failed television spots, she landed a major role in Catch Me If You Can (2002), playing opposite Leonardo DiCaprio. But this did not provide the break-through she might have hoped for, with no work being offered for about a year. She eventually returned to television, and joined the short-lived series, Dr. Vegas (2004). Her role in the low-budget independent film Junebug (2005) (which was shot in 21 days) got her real attention, including an Academy Award nomination for Best Supporting Actress as well as other awards. The following year, her ability to look like a wide-eyed Disney animated heroine helped her to be chosen from about 300 actresses auditioning for the role of \"Giselle\" in the animated/live-action feature film, Enchanted (2007), which would prove to be her major break-through role. Her vivacious yet innocent portrayal allowed her to use her singing and dancing talents. Her performance garnered a Golden Globe Award nomination for Best Actress in a Motion Picture Musical or Comedy. Adams next appeared in the major production, Charlie Wilson's War (2007), and went on to act in the independent film, Sunshine Cleaning (2008), which premiered at the 2008 Sundance Film Festival. Her role as \"Sister James\" in Doubt (2008) brought her a second Academy Award nomination for Best Supporting Actress, as well as nominations for a Golden Globe, a Screen Actors Guild award, and a British Academy Film award. She appeared as Amelia Earhart in Night at the Museum: Battle of the Smithsonian (2009) and as a post-9/11 hot line counselor, aspiring writer, amateur cook and blogger in Julie & Julia (2009). In the early 2010s, she starred with Jason Segel in The Muppets (2011), with Philip Seymour Hoffman in Paul Thomas Anderson's The Master (2012), and alongside Clint Eastwood and Justin Timberlake in Trouble with the Curve (2012). She played reporter Lois Lane in Man of Steel (2013) and con artist Sydney Prosser in American Hustle (2013), before portraying real-life artist Margaret Keane in Tim Burton's biopic Big Eyes (2014). In 2016, she reprised her role as Lane in Batman v Superman: Dawn of Justice (2016), and headlined Denis Villeneuve's science fiction drama Arrival (2016) and Tom Ford's dark thriller Nocturnal Animals (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NjExMjI1OF5BMl5BanBnXkFtZTcwODc0MjY2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0010736","name":"Amy Adams","idIMDB":"nm0010736"},"actorId":"nm0010736","character":"Lois Lane","urlCharacter":"http://www.imdb.com/character/ch0000198","main":true},{"actorName":"Michael Shannon","urlProfile":"http://www.imdb.com/name/nm0788335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODk4MjU1NV5BMl5BanBnXkFtZTcwMDYwNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1974","placeOfBirth":" Lexington, Kentucky, USA","birthName":"Michael Corbett Shannon","height":"6' 3½\" (1.92 m)","bio":"Michael Corbett Shannon was born and raised in Lexington, Kentucky, the son of Geraldine Hine, a lawyer, and Donald Sutherlin Shannon, an accounting professor at DePaul University. His grandfather was entomologist Raymond Corbett Shannon. Shannon began his professional stage career in Chicago. His first acting role was in \"Winterset\" at the Illinois Theatre Center. Over the next several years he continued working on the stage with such companies as Steppenwolf, The Next Lab and the Red Orchid Theatre. He subsequently relocated to London for a year, and performed on stage in London's West End in such productions as \"Woyzeck\", \"Killer Joe\" and \"Bug\". While in Chicago Shannon also kept busy in front of movie and television cameras, most notably in the big screen project Chicago Cab (1997), based on the long-running stage play \"Hellcab\". Kangaroo Jack (2003) marked the third Jerry Bruckheimer production in which Shannon has appeared. He also appeared in Bad Boys II (2003), directed by Michael Bay and starring Will Smith and Martin Lawrence, and in Grand Theft Parsons (2003), with Johnny Knoxville and Christina Applegate. In addition, Shannon appeared in Pearl Harbor (2001), also directed by Bay. His other film credits also include Curtis Hanson's 8 Mile (2002); Cameron Crowe's Vanilla Sky (2001) with Tom Cruise; Carl Franklin's High Crimes (2002) with Morgan Freeman; John Waters' Cecil B. Demented (2000), and Joel Schumacher's war drama Tigerland (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODk4MjU1NV5BMl5BanBnXkFtZTcwMDYwNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0788335","name":"Michael Shannon","nicknames":["Mike"],"idIMDB":"nm0788335"},"actorId":"nm0788335","character":"General Zod","urlCharacter":"http://www.imdb.com/character/ch0000225","main":true},{"actorName":"Diane Lane","urlProfile":"http://www.imdb.com/name/nm0000178","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODQ5NTgxNl5BMl5BanBnXkFtZTcwNDkwMDgyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1965","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Diane Lane was born on January 22, 1965, in New York. She is the daughter of acting coach Burton Eugene \"Burt\" Lane and nightclub singer/centerfold Colleen Farrington. Her parents' families were both from the state of Georgia. Diane was acting from a very young age and made her stage debut at the age of six. Her work in such acclaimed theater productions as \"The Cherry Orchard\" and \"Medea\" led to her being called to Hollywood. She was 13 when she was cast by director George Roy Hill in his wonderful 1979 film I love you, je t'aime (1979), opposite Sir Laurence Olivier. The film only did so-so commercially, but Olivier praised his young co-star, calling her the new Grace Kelly. After her well-received debut, Diane found herself on magazine covers all over the world, including \"Time\", which declared her the \"new young acting sensation\". However, things quietened down a bit when she found herself in such critical and financial flops as Touched by Love (1980), Cattle Annie and Little Britches (1981), Movie Madness (1982), Ladies and Gentlemen, the Fabulous Stains (1982) and, most unmemorably, Six Pack (1982), all of which failed to set her career on fire. She also made several TV movies during this period, but it was in 1983 that she finally began to fulfill the promise of stardom that had earlier been predicted for her. Acclaimed director Francis Ford Coppola took note of Diane's appeal and cast her in two \"youth\"-oriented films based on S.E. Hinton novels. Indeed, Rumble Fish (1983) and The Outsiders (1983) have become cult classics and resulted in her getting a loyal fan base. The industry was now taking notice of Diane Lane, and she soon secured lead roles in three big-budget studio epics. She turned down the first, Splash (1984) (which was a surprise hit for Daryl Hannah). Unfortunately, the other two were critical and box-office bombs: Walter Hill's glossy rock 'n' roll fable Streets of Fire (1984) was not the huge summer success that many had thought it would be, and the massively troubled Coppola epic The Cotton Club (1984) co-starring Richard Gere was also a high-profile flop. The back-to-back failure of both of these films could have ended her career there and then -- but thankfully it didn't. Possibly \"burned out\" by the lambasting these films received and unhappy with the direction her career was taking, she \"retired\" from the film business at age 19, saying that she had forgotten what she had started acting for. She stayed away from the screen for the next three years. Ironically, the two films that were the main causes of her \"retirement\" have since grown in popularity, and \"Streets of Fire\" especially seems to have found the kind of audience it couldn't get when it was first released. The process of rebuilding her career was a slow and gradual one. First came the obscure and very sexy straight-to-video thriller Lady Beware (1987), followed by the critically acclaimed but little seen The Big Town (1987) with Matt Dillon and Tommy Lee Jones. In the former, Diane plays a very mysterious and sexy stripper and her memorable strip sequence is a highlight of the film. Despite her sexy new on-screen image, it wasn't until 1989's smash hit TV mini-series Lonesome Dove (1989) that Diane made another big impression on a sizable audience. Her performance in the hugely popular and critically acclaimed western epic as a vulnerable \"whore with a heart\" won her an Emmy nomination and much praise. Film producers were interested in her again. Another well-received TV production, Descending Angel (1990), was followed by smaller roles in major films like Richard Attenborough's Chaplin (1992) and Mike Binder's Indian Summer (1993), and larger parts in small independent films like My New Gun (1992), Vital Signs (1990) and Face à face (1992). Indeed, the latter two films co-starred her then-husband, Christopher Lambert, with whom she had a daughter named Eleanor. Diane was now re-established in Hollywood and started to appear in higher-profile co-starring roles in some big-budget, major movies like Walter Hill's Wild Bill (1995), the Sylvester Stallone actioner Judge Dredd (1995), the Robin Williams's comedy Jack (1996) and Murder at 1600 (1997) co-starring Wesley Snipes. However, all of these still did not quite make Diane a \"big-name star\" and, by 1997, she found herself, possibly by choice, back in smaller, personal projects. Her next role as a frustrated 1960s housewife in the independent hit Le choix d'une vie (1999) deservedly won her rave notices and, at last, gave her career the big lift it needed. The cute but tear-jerking comedy My Dog Skip (2000) also proved to be a small-scale success. However, it was the £330-million worldwide grossing blockbuster hit The Perfect Storm (2000) that finally made Diane Lane the household name that she always should have been. After the worldwide success of \"The Perfect Storm\", she was more in demand than ever. She played Leelee Sobieski's sinister junkie guardian in the slick thriller The Glass House (2001), and co-starred with Keanu Reeves in the #1 smash hit Hardball (2001). However, her greatest career moment was still to come with her lead role in the enormous critical and commercial hit Unfaithful (2002), in which she superbly portrayed Richard Gere's adulterous wife. Her performance won the respect of critics and audiences alike, as well as many awards and nominations including Best Actress Oscar and Golden Globe nominations. Her follow-up films including Under the Tuscan Sun (2003), Must Love Dogs (2005), Hollywoodland (2006), Secretariat (2010), and the blockbuster, Man of Steel (2013), were all received and her performances were highly praised. She won further Best Actress Golden Globe nominations for her roles in Under the Tuscan Sun (2003) and Cinema Verite (2011). She is very well regarded within the industry, adored by film fans, and has a credibility and quality that is all too rare today. Her immense talent at playing human and real characters, her \"drop dead gorgeous\" beauty and down-to-earth grittiness guarantees that she will stay on top, and she guarantee has already shown the kind of resilience that will keep her working for a long, long time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODQ5NTgxNl5BMl5BanBnXkFtZTcwNDkwMDgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000178","name":"Diane Lane","idIMDB":"nm0000178"},"actorId":"nm0000178","character":"Martha Kent","urlCharacter":"http://www.imdb.com/character/ch0000233","main":true},{"actorName":"Russell Crowe","urlProfile":"http://www.imdb.com/name/nm0000128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTExNTMxOF5BMl5BanBnXkFtZTcwNDg1NzkzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1964","placeOfBirth":" Wellington, New Zealand","birthName":"Russell Ira Crowe","height":"5' 11½\" (1.82 m)","bio":"Russell Ira Crowe was born in Wellington, New Zealand, to Jocelyn Yvonne (Wemyss) and John Alexander Crowe, both of whom catered movie sets. His maternal grandfather, Stanley Wemyss, was a cinematographer. Crowe's recent ancestry includes Welsh (where his paternal grandfather was born, in Wrexham), English, Irish, Scottish, Norwegian, Swedish, and Maori (one of Crowe's maternal great-grandmothers, Erana Putiputi Hayes Heihi, was Maori). Crowe's family moved to Australia when he was a small child, and Russell got the acting bug early in life. Beginning as a child star on a local Australian TV show, Russell's first big break came with two films ... the first, Romper Stomper (1992), gained him a name throughout the film community in Australia and the neighboring countries. The second, The Sum of Us (1994), helped put him on the American map, so to speak. Sharon Stone heard of him from Romper Stomper (1992) and wanted him for her film, Mort ou vif (1995). But filming on The Sum of Us (1994) had already begun. Sharon is reported to have held up shooting until she had her gunslinger-Crowe, for her film. With Mort ou vif (1995) under his belt as his first American film, the second was offered to him soon after. Virtuosity (1995), starring Denzel Washington, put Russell in the body of a Virtual Serial Killer, Sid6.7 ... a role unlike any he had played so far. Virtuosity (1995), a Sci-Fi extravaganza, was a fun film and, again, opened the door to even more American offers. L.A. Confidential (1997), Russell's third American film, brought him the US fame and attention that his fans have felt he deserved all along. Missing the Oscar nod this time around, he didn't seem deterred and signed to do his first film with The Walt Disney Company, Mystery, Alaska (1999). He achieved even more success and awards for his performances in Gladiator (2000) and A Beautiful Mind (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTExNTMxOF5BMl5BanBnXkFtZTcwNDg1NzkzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000128","name":"Russell Crowe","nicknames":["Rusty","Russ"],"idIMDB":"nm0000128"},"actorId":"nm0000128","character":"Jor-El","urlCharacter":"http://www.imdb.com/character/ch0000192","main":true},{"actorName":"Antje Traue","urlProfile":"http://www.imdb.com/name/nm1662644","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjY4MjUyMF5BMl5BanBnXkFtZTgwMjc1ODU1MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1981","placeOfBirth":" Mittweida, East Germany [now Saxony, Germany]","height":"5' 6½\" (1.69 m)","bio":"Antje Traue was born in Mittweida, Saxony, East Germany. Her mother was a musician and dancer. Traue was raised speaking Russian. She discovered her love for acting at an early age. As a teenager, Traue attended the \"International Munich Art Lab\", where she was cast in the lead role in the theatre play, \"West End Opera\". For four years, she toured with the ensemble cast throughout Europe and then to New York. In 2002, Traue moved to Berlin and landed roles in both feature films and television projects, including Kleinruppin forever (2004), Berlin am Meer (2008) and Phantom Pain (2009). In 2008, she was cast as the female lead in the international science fiction film, Pandorum (2009), opposite Dennis Quaid and Ben Foster. In 2010, she was filming on Renny Harlin's 5 Days of War (2011), alongside Val Kilmer and Rupert Friend.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjY4MjUyMF5BMl5BanBnXkFtZTgwMjc1ODU1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1662644","name":"Antje Traue","idIMDB":"nm1662644"},"actorId":"nm1662644","character":"Faora-Ul","urlCharacter":"http://www.imdb.com/character/ch0246265","main":true},{"actorName":"Harry Lennix","urlProfile":"http://www.imdb.com/name/nm0502015","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcyNDMxNjIxNl5BMl5BanBnXkFtZTcwOTk3OTgyMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1964","placeOfBirth":" Chicago, Illinois, USA","birthName":"Harry Joseph Lennix III","height":"6' 4\" (1.93 m)","bio":"Harry Lennix is an accomplished film, television, and stage actor. His recent credits include Warner Bros.' \"Man of Steel\", The CW's \"Emily Owens, M.D.\", Fox's \"Dollhouse,\" HBO's \"Little Britain,\" as well as the critically acclaimed series \"24\" as Walid Al-Rezani. Harry Joseph Lennix III was born November 16, 1964 in Chicago, Illinois, to Lillian C. (Vines), a laundress, and Harry Lennix, Jr., a machinist. He is of African-American and Louisiana Creole descent. He was not always certain he wanted to be an actor. An A student, he decided to act in his high school's play while he waited for the baseball season to begin. Lennix attended Northwestern University in Evanston, Illinois, where he was recognized in \"Who's Who Among American College Students.\" He majored in Acting and Direction at Northwestern and upon graduation stayed teaching in Chicago for a bit, before moving to New York, and from there to Los Angeles, California. He has appeared in a veritable bevy of movies and guest-starring roles in many popular television shows such as ER (1994), Diagnosis Murder (1993), Century City (2004), and House (2004). Lennix made his Broadway debut in August Wilson's Tony nominated play, Radio Golf. He was seen on the big screen in Working Title's \"State of Play.\" In 2006, Lennix starred in the Golden Globe nominated ABC show \"Commander in Chief\" as Jim Gardner, the Chief of Staff. His other appearances include the Oscar winning film \"Ray,\" \"The Matrix: Reloaded,\" and \"The Matrix: Revolutions.\" Lennix received critical acclaim and a Golden Satellite Award as Aaron in Julie Taymor's \"Titus\" starring Anthony Hopkins. A host of other film credits include \"Across the Universe,\" \"Barbershop 2,\" and \"Love and Basketball.\" Lennix starred his as the legendary Adam Clayton Powell, Jr. in Showtime's \"Keep The Faith Baby,\" for which he won a Black Reel Award and was nominated for both an NAACP Image Award and a Golden Satellite Award. He continued to make his presence known with recurring roles on \"ER\" and \"Diagnosis Murder\" and other guest starring appearances on shows such as \"Law & Order: Los Angeles.\" Lennix has directed and appeared in stage productions across the country, including the Northlight Theater Company's production of Permanent Collection, at the Greenway Arts Alliance in Los Angeles. Under his directing consultation, it was remounted at Los Angeles' Kirk Douglas Theater. He directed the stage version of Robert Townsend's The Five Heartbeats, which received 3 NAACP Theater Award nominations and The Glass Menagerie for the Steppenwolf Theater Company. As a stage actor, Lennix was the first distinguished recipient of an Ollie Award for his portrayal of Malcolm X at the Goodman Theater in Chicago and two Joseph Jefferson Citations for his roles in Ma Rainey's Black Bottom and Caught in the Act. He also starred as King Hedley II, another play by August Wilson, at the Mark Taper Forum. In 2001, he was part of the first American company to be invited to the Royal Shakespeare Company in the production of Cymbeline. Lennix has also been extremely active in his native Chicago community where he was an English and music teacher before becoming an actor. He founded Legacy Productions with renowned director Chuck Smith in 1989. The company is dedicated to promoting significant works about the African American experience. He is on the staff of the Goodman Theater Co. He also is active in various civic groups and is on the Advisory Council for his alma mater, Northwestern University. He resides in Los Angeles. Harry has two older brothers and an older sister, and often returns to Chicago to visit his remaining family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcyNDMxNjIxNl5BMl5BanBnXkFtZTcwOTk3OTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502015","name":"Harry Lennix","idIMDB":"nm0502015"},"actorId":"nm0502015","character":"General Swanwick","urlCharacter":"http://www.imdb.com/character/ch0282353","main":true},{"actorName":"Richard Schiff","urlProfile":"http://www.imdb.com/name/nm0771493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDE5MzIwNF5BMl5BanBnXkFtZTYwNjgzMDI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1955","placeOfBirth":" Bethesda, Maryland, USA","height":"5' 10\" (1.78 m)","bio":"Richard was the middle of three sons born to Edward, a real estate lawyer, and Charlotte, a cable TV and publishing executive. His parents divorced when he was 12. He dropped out of high school but obtained an equivalency diploma. He tried studying at the City College of New York (CCNY) in 1973, but had no interest. After not bothering to show up for finals, he headed to Colorado where he cut firewood and lived a hippie life. He returned to New York in 1975 and started studying acting at CCNY and eventually was accepted into their theater program. He initially disliked acting and studied to be a director. He directed several off-Broadway plays, including \"Antigone\" with a then just-graduated Angela Bassett in 1983. He also met present wife, Sheila Kelley, during auditions for this play. The two married in 1996. In the mid-1980s, Richard says he conquered his fears and decided to take a stab at acting. He got several TV roles, but he was seen by Steven Spielberg in an episode of the TV drama High Incident (1996). Spielberg then cast him in The Lost World: Jurassic Park (1997) and his career has been on an upward climb ever since that has led to his co-starring role in The West Wing (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDE5MzIwNF5BMl5BanBnXkFtZTYwNjgzMDI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0771493","name":"Richard Schiff","idIMDB":"nm0771493"},"actorId":"nm0771493","character":"Dr. Emil Hamilton","urlCharacter":"http://www.imdb.com/character/ch0030865","main":true},{"actorName":"Christopher Meloni","urlProfile":"http://www.imdb.com/name/nm0005221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODc0MTI2N15BMl5BanBnXkFtZTcwNDYwMjk3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1961","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Christopher Peter Meloni","height":"6' (1.83 m)","bio":"Blessed with a piercing, blue-eyed glint, brawny looks, cocky \"tough guy\" stance and effortless charisma, TV's Christopher Meloni has grabbed audiences' attention, male and female alike, finding breakthrough small screen stardom playing both sides of the law. Audiences first were taken in by his sexually arresting portrayal of a sociopathic killer in the gripping prison drama Oz (1997) on cable TV. Although his small screen roots were in 90s situation comedy, the network powers-that-be wisely discovered his power and allure as a dramatic star and quickly handed him his own prime-time crime series, Law & Order: Special Victims Unit (1999), as a not-quite-by-the-book crime detective. This one-two punch of \"Oz\" and \"Law & Order: SVU\" put Meloni, who seems to grow sexier with age, on the map and well on top, where he remains today. Christopher Peter Meloni was born on April 2, 1961, in Washington, D.C., the son of Cecile (Chagnon) and Robert Meloni, an endocrinologist. Of Italian and French-Canadian parentage, he attended St. Stephen's School and played quarterback for his high school team. Developing an interest in acting rather early in life, he attended the University of Colorado at Boulder following high school graduation. He initially majored in acting but wound up earning a degree in history in 1983. Acting won out in the long run, however, and Chris relocated to New York where he studied with acting guru Sanford Meisner at the renowned Neighborhood Playhouse. Supplementing his income during these lean years by taking advantage of his powerful physique (as construction worker, bouncer, personal trainer), Meloni worked his way up the acting ladder via parts in commercials. With a full head of hair in the early days, he broke into series TV in 1989, the first being the already-established cable football comedy 1st & Ten: The Championship (1984). In this sitcom, which was HBO's very first back in 1984, Chris played ex-con quarterback Vito Del Greco (aka \"Johnny Gunn\"). The series' star Delta Burke had already left the cast by the time Chris came aboard in its final season. A second sitcom arrived almost immediately with the stereotypical Italian family sitcom The Fanelli Boys (1990) featuring Chris as dim-eyed, skirt-chasing Frankie Fanelli, one of the four \"dees, dem and dos\" sons of Brooklynite widow Theresa Fanelli (Ann Morgan Guilbert). Despite a strong, boisterous cast, the show was painfully obvious and met an early demise. True to nature, Chris gave voice and added to the fun as a cocky, mooching high school teen who knows the \"how to's\" of attracting pretty girl dinos in the animated prehistoric series Dinosaurs (1991). He also made a manly mark in mini-movies with co-starring roles in such \"women\" dramas as In a Child's Name (1991) starring Valerie Bertinelli, Something to Live for: The Alison Gertz Story (1992), which top-lined Molly Ringwald, Without a Kiss Goodbye (1993) as the caring husband of Lisa Hartman, and the Connie Sellecca starrer A Dangerous Affair (1995). An interchangeable ability to convey both heartfelt sympathy and virile menace did not go by unnoticed. After minor parts on the big screen with Clean Slate (1994), Junior (1994) and Twelve Monkeys (1995), Chris drew strong notices in the featured role of gangster Johnnie Marzzone in the classic neo-noir Bound (1996), which earned cult status for its sexually-charged lesbian sub-storyline. A tough recurring part on \"NYPD Blue\", a typical mafia role in the mini-series The Last Don (1997) and another short-lived comedic series lead (Leaving L.A. (1997)) finally led to a big payoff in the brutal and brilliant cable series Oz (1997). Christopher's introduction to the Oz prison as bisexual psychopath Chris Keller was powerhouse casting and he drew immediate notice and critical applause into the show's second season. Unflinching in its blood-soaked presentation of life behind bars, Chris' raw animal magnetism was unparalleled on the show and his steamy, erotic couplings with another male prisoner on screen promoted him swiftly to gay icon status. Undaunted by the possible career-damaging effects that could occur, Chris' frank acceptance and acknowledgment was admirable indeed and his outright support of human rights causes earned him high marks. The father of two (daughter Sophia Eva Pietra (born March 23, 2001), and son Dante Amadeo (born January 2, 2004), he has been married since 1995 to production designer 'Sherman Williams' (The Dark Backward (1991)). Chris' sudden burst of cable notoriety earned him his own prime time NBC series. With the veteran \"Law & Order\" program developing a sister spin-off, Law & Order: Special Victims Unit (1999), Meloni raised the bar with his trenchant pairing with co-star Mariska Hargitay as partners of a special victims crime unit. Despite the show's reality-driven approach, Meloni and Hargitay's dynamite chemistry carried the show to a new level. Allowing their characters' more serious flaws to surface, Meloni, in particular, managed to convey Detective Stabler's private pain and personal turmoil with a raw poignancy. Both he and Hargitay have been honored with Emmy award nominations for their work here (she has won). Occasionally appearing on stage, Chris' theater credits include \"The Rainmaker\" (as Starbuck) (1998) and \"Comers\" (1998), both at the Williamstown Theatre Festival. He earned standout reviews as Eddie Carbone in Arthur Miller's \"A View from the Bridge,\" which he performed at Dublin's Gate Theatre in 2005. In 2006 he joined the campy proceedings at an Actors' Fund of America Benefit of the soap opera spoof \"Die, Mommie Die!\" starring drag illusionist and \"Oz\" alumnus Charles Busch. Going well over a decade's worth of service to the series that made him a household name, Meloni finally retired his TV detective in 2011. Throughout the show's run he continued to flaunt his humorous side, showing up on such parody shows as \"Mad TV\" and cracking up on the various night time TV haunts. On film he continues to shatter his dramatic image in such fare as The Souler Opposite (1998), Wet Hot American Summer (2001), Harold & Kumar Go to White Castle (2004) and its sequel Harold & Kumar Escape from Guantanamo Bay (2008). While he has not found outright stardom on the big screen (he has nominally played \"other man\" roles in such popular films as Runaway Bride (1999) and Nights in Rodanthe (2008)), Chris has more than proved his staying power since he left the popular series. More recently, he moved forward as a writer/producer/director/star of the comedy film Dirty Movie (2011), which also has in its cast \"L&O: SVU\" co-star Diane Neal. In addition, Chris supplied the voice of DC Comics classic character Hal Jordan (aka Green Lantern) in the animated movie Green Lantern: First Flight (2009). He also has held regular roles on the series True Blood (2008) in 2012 and Surviving Jack (2014) as well as strong cinematic parts in the Superman film Man of Steel (2013) and in Small Time (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODc0MTI2N15BMl5BanBnXkFtZTcwNDYwMjk3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005221","name":"Christopher Meloni","idIMDB":"nm0005221"},"actorId":"nm0005221","character":"Colonel Nathan Hardy","urlCharacter":"http://www.imdb.com/character/ch0247776","main":true},{"actorName":"Kevin Costner","urlProfile":"http://www.imdb.com/name/nm0000126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1OTEyNF5BMl5BanBnXkFtZTgwNjI0MTk2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1955","placeOfBirth":" Lynwood, California, USA","birthName":"Kevin Michael Costner","height":"6' 1\" (1.85 m)","bio":"Kevin Michael Costner was born on January 18, 1955 in Lynwood, California, the third child of Bill Costner, a ditch digger and ultimately an electric line servicer for Southern California Edison, and Sharon Costner (née Tedrick), a welfare worker. His older brother, Dan, was born in 1950. A middle brother died at birth in 1953. His father's job required him to move regularly, which caused Kevin to feel like an Army kid, always the new kid at school, which led to him being a daydreamer. As a teen, he sang in the Baptist church choir, wrote poetry, and took writing classes. At 18, he built his own canoe and paddled his way down the rivers that Lewis & Clark followed to the Pacific. Despite his present height, he was only 5'2\" when he graduated high school. Nonetheless, he still managed to be a basketball, football and baseball star. In 1973, he enrolled at California State University at Fullerton, where he majored in business. During that period, Kevin decided to take acting lessons five nights a week. He graduated with a business degree in 1978 and married his college sweetheart, Cindy Costner. He initially took a marketing job in Orange County. Everything changed when he accidentally met Richard Burton on a flight from Mexico. Burton advised him to go completely after acting if that is what he wanted. He quit his job and moved to Hollywood soon after. He drove a truck, worked on a deep sea fishing boat, and gave bus tours to stars' homes before finally making his own way into the films. After making one soft core sex film, he vowed to not work again if that was the only work he could do. He didn't work for nearly six years, while he waited for a proper break. That break came with The Big Chill (1983), even though his scenes ended up on the cutting room floor -- he was remembered by director Lawrence Kasdan when he decided to make Silverado (1985). Costner's career took off after that.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1OTEyNF5BMl5BanBnXkFtZTgwNjI0MTk2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000126","name":"Kevin Costner","idIMDB":"nm0000126"},"actorId":"nm0000126","character":"Jonathan Kent","urlCharacter":"http://www.imdb.com/character/ch0000217","main":true},{"actorName":"Ayelet Zurer","urlProfile":"http://www.imdb.com/name/nm0957909","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjY1ODk3NF5BMl5BanBnXkFtZTcwNjczMzk3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1969","placeOfBirth":" Tel Aviv, Israel","height":"5' 6½\" (1.69 m)","bio":"Ayelet Zurer is one of Israel's most acclaimed actresses. She was born in Tel Aviv, and first garnered the attention of Hollywood when she was cast by Steven Spielberg in her first English-speaking role, as Eric Bana's character's wife in the Oscar® nominated film Munich. Since arriving in the United States, Zurer has starred in Studio films including Sony Pictures' Vantage Point with Dennis Quaid and William Hurt, Samuel Goldwyn's Fugitive Pieces opposite Stephen Dillane, Paul Schrader's Adam Resurrected opposite Jeff Goldblum and Willem Dafoe. Ron Howard's Angeles and Demons, opposite Tom Hanks, Darling Companion, a Lawrence Kasdan ensemble cast featuring Diane Keaton, Kevin Kline and Warner Bros. Man Of Steel opposite Russell Crow. She filmed Rodrigo Garcia, Last days in the desert opposite Ewan McGregor, as well as awaiting the release of the movie The Last Knights by the Japanese director Kazuaki Kiriya opposite Clive Owen. She recently won the Gold Nymph Award for Outstanding Actress in a Drama Series at the 54th Festival of Television of Monte-Carlo for her role in the series \"Hostages\". Ayelet won the Israeli Film And T.V Academy Award for her lead performance in Nina's Tragedies. She also received nominations for her work in the features Only Dogs Run Free, The Dybbuk from the Holy Apple Field, Desperado, and Rutenberg. She won the Haifa International Film Festival critic award and was awarded a star on Haifa's \"film boulevard,\" for her international and local achievements. Zurer also won the Israeli Television Academy Award for her lead performance in \"In Treatment,\" a highly acclaimed television series that has been adapted by HBO for American television. In 2014 She was nominated apposite herself in the year's best drama \"Shtisel\", but won best actress in a drama for her portrayal of a brilliant surgeon faced with the life and death dilemma in Hostages, sold to BBC4 and Canal Plus, and as a format to the American ABC. The \"face \" of one of Israel leading woman fashion companies- GOLBARY. She is a producer, a writer, an illustrator of two adult books, \"Shorts\" and the best seller \"Badolina\" by Gabi Nitazn. Ayelet has been developing a few of her own projects in Israel and the u.s. expressing interest in working internationally with directors from all over the world, believing in joining unknown writers/directors as well as known ones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjY1ODk3NF5BMl5BanBnXkFtZTcwNjczMzk3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0957909","name":"Ayelet Zurer","idIMDB":"nm0957909"},"actorId":"nm0957909","character":"Lara Lor-Van","urlCharacter":"http://www.imdb.com/character/ch0000238","main":true},{"actorName":"Laurence Fishburne","urlProfile":"http://www.imdb.com/name/nm0000401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjczNDc1MV5BMl5BanBnXkFtZTYwMDU0Mjg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1961","placeOfBirth":" Augusta, Georgia, USA","birthName":"Laurence John Fishburne III","height":"6' 0½\" (1.84 m)","bio":"One of Hollywood's most talented and versatile performers and the recipient of a truckload of NAACP Image awards, Laurence John Fishburne III was born in Augusta, Georgia on July 30, 1961, to Hattie Bell (Crawford), a teacher, and Laurence John Fishburne, Jr., a juvenile corrections officer. His mother transplanted her family to Brooklyn after his parents divorced. At the age of 10, he appeared in his first play, \"In My Many Names and Days,\" at a cramped little theater space in Manhattan. He continued on but managed to avoid the trappings of a child star per se, considering himself more a working child actor at the time. Billing himself as Larry Fishburne during this early phase, he never studied or was trained in the technique of acting. In 1973, at the age of 12, Laurence won a recurring role on the daytime soap One Life to Live (1968) that lasted three seasons and subsequently made his film debut in the ghetto-themed Cornbread, Earl and Me (1975). At 14 Francis Ford Coppola cast him in Apocalypse Now (1979), which filmed for two years in the Phillippines. Laurence didn't work for another year and a half after that long episode. A graduate of Lincoln Square Academy, Coppola was impressed enough with Laurence to hire him again down the line with featured roles in Rumble Fish (1983), The Cotton Club (1984), and Gardens of Stone (1987). Throughout the 1980s, he continued to build up his film and TV credit list with featured roles despite little fanfare. A recurring role as Cowboy Curtis on the kiddie show Pee-wee's Playhouse (1986) helped him through whatever lean patches there were at the time. With the new decade (1990s) came out-and-out stardom for Laurence. A choice lead in John Singleton's urban tale Boyz n the Hood (1991) catapulted him immediately into the front of the film ranks. Set in LA's turbulent South Central area, his potent role as a morally minded divorced father who strives to rise above the ignorance and violence of his surroundings, Laurence showed true command and the ability to hold up any film. On stage, he would become invariably linked to playwright August Wilson and his 20th Century epic African-American experience after starring for two years as the eruptive ex-con in \"Two Training Running.\" For this powerful, mesmerizing performance, Laurence won nearly every prestigious theater award in the books (Tony, Outer Critics Circle, Drama Desk and Theatre World). It was around the time of this career hallmark that he began billing himself as \"Laurence\" instead of \"Larry.\" More awards and accolades came his way. In addition to an Emmy for the pilot episode of the series \"Tribeca,\" he was nominated for his fine work in the quality mini-movies The Tuskegee Airmen (1995) and Miss Evers' Boys (1997). On the larger screen, both Laurence and Angela Bassett were given Oscar nominations for their raw, seething portrayals of rock stars Ike and Tina Turner in the film What's Love Got to Do with It (1993). To his credit, he managed to take an extremely repellent character and make it a sobering and captivating experience. A pulp box-office favorite as well, he originated the role of Morpheus, Keanu Reeves' mentor, in the exceedingly popular futuristic sci-fi The Matrix (1999), best known for its ground-breaking special effects. He wisely returned for its back-to-back sequels. Into the millennium, Laurence extended his talents by making his screenwriting and directorial debut in Once in the Life (2000), in which he also starred. The film is based on his own critically acclaimed play \"Riff Raff,\" which he staged five years earlier. In 1999, he scored a major theater triumph with a multi-racial version of \"The Lion in Winter\" as Henry II opposite Stockard Channing's Eleanor of Acquitaine. On film, Fishburne has appeared in a variety of interesting roles in not-always-successful films. Never less than compelling, a few of his more notable parts include an urban speed chess player in Searching for Bobby Fischer (1993); a military prisoner in Cadence (1990); a college professor in Singleton's Higher Learning (1995); a CIA operative in Bad Company (1995); the title role in Othello (1995) (he was the first black actor to play the part on film); a spaceship rescue team leader in the sci-fi horror Event Horizon (1997); a Depression-era gangster in Hoodlum (1997); a dogged police sergeant in Clint Eastwood's Mystic River (2003); a spelling bee coach in Akeelah and the Bee (2006); and prominent roles in the mainstream films Predators (2010) and Contagion (2011). He returned occasionally to the theatre. In April 2008, he played Thurgood Marshall in the one-man show \"Thurgood\" and won a Drama Desk Award. It was later transferred to the screen. In the fall of 2008, Fishburne replaced William Petersen as the male lead investigator on the popular CBS drama CSI: Crime Scene Investigation (2000), but left the show in 2011 to refocus on films and was in turn replaced by Ted Danson. Since then Fishburne has appeared in the Superman film Man of Steel (2013) as Daily Planet chief Perry White. Fishburne has two children, Langston and Montana, from his first marriage to actress Hajna O. Moss. In September 2002, Fishburne married Cuban-American actress Gina Torres.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjczNDc1MV5BMl5BanBnXkFtZTYwMDU0Mjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000401","name":"Laurence Fishburne","nicknames":["Fish","Larry"],"idIMDB":"nm0000401"},"actorId":"nm0000401","character":"Perry White","urlCharacter":"http://www.imdb.com/character/ch0000231","main":true},{"actorName":"Dylan Sprayberry","urlProfile":"http://www.imdb.com/name/nm2876098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE4NTI2ODUxM15BMl5BanBnXkFtZTgwMzUyNzU1MDI@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1998","placeOfBirth":" Houston, Texas, USA","height":"5' 5\" (1.65 m)","bio":"Dylan Sprayberry is an American actor and musician known for Man of Steel (2013), Teen Wolf (2011), Shuffle (2011) and Old Dogs (2009). Dylan attended West University Elementary until 2005 when his family moved to California. He has a younger sister, Ellery Sprayberry, who is also an actress. His most recent work (January 2015) has been starring in the fourth and fifth season of Teen Wolf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE4NTI2ODUxM15BMl5BanBnXkFtZTgwMzUyNzU1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2876098","name":"Dylan Sprayberry","idIMDB":"nm2876098"},"actorId":"nm2876098","character":"Clark Kent","urlCharacter":"http://www.imdb.com/character/ch0118677","main":true},{"actorName":"Cooper Timberline","urlProfile":"http://www.imdb.com/name/nm4742128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNjI2ODQ2NF5BMl5BanBnXkFtZTcwNTQ0MjY2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Cooper Timberline is an actor, known for Man of Steel (2013), Chasing Mavericks (2012) and Falsify (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNjI2ODQ2NF5BMl5BanBnXkFtZTcwNTQ0MjY2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4742128","name":"Cooper Timberline","idIMDB":"nm4742128"},"actorId":"nm4742128","character":"Clark Kent","urlCharacter":"http://www.imdb.com/character/ch0118677","main":true},{"actorName":"Richard Cetrone","urlProfile":"http://www.imdb.com/name/nm0149150","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjEwMTYxMl5BMl5BanBnXkFtZTcwNzA2MDcyNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Richard Cetrone is known for his work on Batman v Superman: Dawn of Justice (2016), Watchmen (2009) and Captain America: Civil War (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjEwMTYxMl5BMl5BanBnXkFtZTcwNzA2MDcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0149150","name":"Richard Cetrone","idIMDB":"nm0149150"},"actorId":"nm0149150","character":"Tor-An","urlCharacter":"http://www.imdb.com/character/ch0437588","main":true}],"seasons":[],"idIMDB":"tt0770828","urlIMDB":"http://www.imdb.com/title/tt0770828","business":{"budget":{"money":"$225,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$116,619,362","country":"USA","day":"16","month":"06","year":"2013","remarks":"4,207 Screens"},{"money":"£11,191,595","country":"UK","day":"16","month":"06","year":"2013","remarks":"572 Screens"},{"money":"AUD 8,877,913","country":"Australia","day":"30","month":"06","year":"2013","remarks":"560 Screens"},{"money":"HUF 56,995,608","country":"Hungary","day":"23","month":"06","year":"2013","remarks":""},{"money":"€900,007","country":"Netherlands","day":"23","month":"06","year":"2013","remarks":"118 Screens"},{"money":"PHP 245,085,619","country":"Philippines","day":"16","month":"06","year":"2013","remarks":"469 Screens"},{"money":"$5,859,801","country":"Russia","day":"24","month":"06","year":"2013","remarks":"1,412 Screens"}],"gross":[{"money":"$291,045,518","country":"USA","day":"19","month":"09","year":"2013","remarks":""},{"money":"$291,021,565","country":"USA","day":"15","month":"09","year":"2013","remarks":""},{"money":"$290,951,711","country":"USA","day":"13","month":"09","year":"2013","remarks":""},{"money":"$290,750,257","country":"USA","day":"01","month":"09","year":"2013","remarks":""},{"money":"$290,229,822","country":"USA","day":"25","month":"08","year":"2013","remarks":""},{"money":"$289,633,849","country":"USA","day":"18","month":"08","year":"2013","remarks":""},{"money":"$288,681,970","country":"USA","day":"11","month":"08","year":"2013","remarks":""},{"money":"$287,681,397","country":"USA","day":"04","month":"08","year":"2013","remarks":""},{"money":"$286,807,505","country":"USA","day":"28","month":"07","year":"2013","remarks":""},{"money":"$285,000,474","country":"USA","day":"21","month":"07","year":"2013","remarks":""},{"money":"$280,888,962","country":"USA","day":"14","month":"07","year":"2013","remarks":""},{"money":"$271,188,450","country":"USA","day":"07","month":"07","year":"2013","remarks":""},{"money":"$248,577,596","country":"USA","day":"30","month":"06","year":"2013","remarks":""},{"money":"$210,078,153","country":"USA","day":"23","month":"06","year":"2013","remarks":""},{"money":"$141,266,491","country":"USA","day":"19","month":"06","year":"2013","remarks":""},{"money":"$125,080,000","country":"USA","day":"16","month":"06","year":"2013","remarks":""},{"money":"$128,681,486","country":"USA","day":"16","month":"06","year":"2013","remarks":""},{"money":"£29,830,339","country":"UK","day":"14","month":"07","year":"2013","remarks":""},{"money":"£29,420,017","country":"UK","day":"07","month":"07","year":"2013","remarks":""},{"money":"£26,718,973","country":"UK","day":"30","month":"06","year":"2013","remarks":""},{"money":"£21,532,158","country":"UK","day":"23","month":"06","year":"2013","remarks":""},{"money":"£11,191,595","country":"UK","day":"16","month":"06","year":"2013","remarks":""},{"money":"$668,045,518","country":"Worldwide","day":"28","month":"02","year":"2015","remarks":""},{"money":"$660,951,711","country":"Worldwide","day":"13","month":"09","year":"2013","remarks":""},{"money":"$196,680,000","country":"Worldwide","day":"16","month":"06","year":"2013","remarks":""},{"money":"AUD 23,668,132","country":"Australia","day":"28","month":"07","year":"2013","remarks":""},{"money":"AUD 22,853,061","country":"Australia","day":"21","month":"07","year":"2013","remarks":""},{"money":"AUD 20,980,661","country":"Australia","day":"14","month":"07","year":"2013","remarks":""},{"money":"AUD 16,833,967","country":"Australia","day":"07","month":"07","year":"2013","remarks":""},{"money":"AUD 9,493,949","country":"Australia","day":"30","month":"06","year":"2013","remarks":""},{"money":"PHP 388,565,538","country":"Philippines","day":"18","month":"08","year":"2013","remarks":""},{"money":"PHP 388,431,062","country":"Philippines","day":"04","month":"08","year":"2013","remarks":""},{"money":"PHP 385,451,543","country":"Philippines","day":"14","month":"07","year":"2013","remarks":""},{"money":"PHP 385,279,467","country":"Philippines","day":"07","month":"07","year":"2013","remarks":""},{"money":"PHP 375,854,030","country":"Philippines","day":"30","month":"06","year":"2013","remarks":""},{"money":"PHP 351,847,466","country":"Philippines","day":"23","month":"06","year":"2013","remarks":""},{"money":"PHP 245,085,619","country":"Philippines","day":"16","month":"06","year":"2013","remarks":""},{"money":"$884,664","country":"Portugal","day":"28","month":"02","year":"2015","remarks":""},{"money":"$10,628,593 (Russia)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"€6,451,815","country":"Spain","day":"07","month":"07","year":"2013","remarks":""},{"money":"€5,420,351","country":"Spain","day":"30","month":"06","year":"2013","remarks":""}],"weekendGross":[{"money":"$61,017","country":"USA","day":"15","month":"09","year":"2013","remarks":"91 Screens"},{"money":"$390,175","country":"USA","day":"01","month":"09","year":"2013","remarks":"284 Screens"},{"money":"$353,846","country":"USA","day":"25","month":"08","year":"2013","remarks":"303 Screens"},{"money":"$512,308","country":"USA","day":"18","month":"08","year":"2013","remarks":"365 Screens"},{"money":"$750,307","country":"USA","day":"11","month":"08","year":"2013","remarks":"426 Screens"},{"money":"$466,574","country":"USA","day":"04","month":"08","year":"2013","remarks":"304 Screens"},{"money":"$749,233","country":"USA","day":"28","month":"07","year":"2013","remarks":"501 Screens"},{"money":"$1,819,387","country":"USA","day":"21","month":"07","year":"2013","remarks":"1,050 Screens"},{"money":"$4,719,084","country":"USA","day":"14","month":"07","year":"2013","remarks":"2,150 Screens"},{"money":"$11,414,297","country":"USA","day":"07","month":"07","year":"2013","remarks":"2,905 Screens"},{"money":"$20,737,490","country":"USA","day":"30","month":"06","year":"2013","remarks":"4,131 Screens"},{"money":"$41,287,206","country":"USA","day":"23","month":"06","year":"2013","remarks":"4,207 Screens"},{"money":"$116,619,362","country":"USA","day":"16","month":"06","year":"2013","remarks":"4,207 Screens"},{"money":"€900,007","country":"Netherlands","day":"23","month":"06","year":"2013","remarks":"118 Screens"},{"money":"PHP 37,997","country":"Philippines","day":"18","month":"08","year":"2013","remarks":"1 Screen"},{"money":"PHP 202,795","country":"Philippines","day":"04","month":"08","year":"2013","remarks":"5 Screens"},{"money":"PHP 391,594","country":"Philippines","day":"14","month":"07","year":"2013","remarks":"21 Screens"},{"money":"PHP 2,799,055","country":"Philippines","day":"07","month":"07","year":"2013","remarks":"22 Screens"},{"money":"PHP 19,980,393","country":"Philippines","day":"30","month":"06","year":"2013","remarks":"145 Screens"},{"money":"PHP 71,085,289","country":"Philippines","day":"23","month":"06","year":"2013","remarks":"276 Screens"},{"money":"PHP 245,085,619","country":"Philippines","day":"16","month":"06","year":"2013","remarks":"469 Screens"}],"admissions":[{"money":"173,923","country":"Norway","day":"19","month":"12","year":"2013","remarks":""},{"money":"108,219","country":"Portugal","day":"31","month":"07","year":"2013","remarks":""},{"money":"105,599","country":"Portugal","day":"24","month":"07","year":"2013","remarks":""},{"money":"97,584","country":"Portugal","day":"17","month":"07","year":"2013","remarks":""},{"money":"81,006","country":"Portugal","day":"10","month":"07","year":"2013","remarks":""},{"money":"53,660","country":"Portugal","day":"03","month":"07","year":"2013","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"08","year":"2011","remarks":null},{"money":null,"country":null,"day":"20","month":"01","year":"2012","remarks":null}],"copyrightHolder":"This motion picture © 2013 Warner Bros. Entertainment Inc. and Legendary Pictures Funding, LLC."},"technical":{"runtime":["2 hr 23 min (143 min)"],"soundMix":["Dolby Digital","Datasat","SDDS","Dolby Atmos","Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 235, Panavision C- and E-Series Lenses","Arriflex 435 ES, Panavision C-, E-Series, ATZ and AWZ2 Lenses","Panavision Panaflex Millennium XL2, Panavision C-, E-Series, ATZ and AWZ2 Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["3,909 m (Portugal, 35 mm)","3,918.4 m (7 reels)"],"negativeFormat":["35 mm (Kodak Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","70 mm (horizontal) (IMAX DMR blow-up) (dual-strip 3-D) (Kodak Vision 2383)","D-Cinema (also 3-D version)"]},"rating":"7,1","metascore":"55","filmingLocations":[{"location":"Lone Pine, California, USA"}],"rated":"PG-13","awards":[{"award":"BAFTA Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Children's Award","categories":[{"category":"BAFTA Kids Vote - Feature Film","names":[]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Comic-to-Film Motion Picture","names":[]},{"category":"Best Performance by a Younger Actor","names":[{"name":"Dylan Sprayberry","id":"nm2876098","role":null}]},{"category":"Best Special Effects","names":[{"name":"Joe Letteri","id":"nm0504784","role":null},{"name":"John 'D.J.' Des Jardin","id":"nm0220755","role":null},{"name":"Dan Lemmon","id":"nm0501424","role":null}]}]}]},{"award":"Annie Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Outstanding Achievement in Animated Effects in a Live Action Production","names":[{"name":"Jonathan Paquin","id":"nm0660763","role":null},{"name":"Brian Goodwin","id":"nm2267959","role":null},{"name":"Gray Horsfield","id":"nm1402398","role":null},{"name":"Matthieu Chardonnet","id":"nm3004770","role":null},{"name":"Adrien Toupet","id":"nm3296808","role":null}]}]}]},{"award":"ASCAP Film and Television Music Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"Hans Zimmer","id":"nm0001877","role":null}]}]}]},{"award":"Awards Circuit Community Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated ACCA","categories":[{"category":"Best Visual Effects","names":[]}]}]},{"award":"Broadcast Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Actor in an Action Movie","names":[{"name":"Henry Cavill","id":"nm0147147","role":null}]}]}]},{"award":"Central Ohio Film Critics Association 2014","titlesAwards":[{"titleAwardOutcome":"Nominated COFCA Award","categories":[{"category":"Actor of the Year","names":[{"name":"Amy Adams","id":"nm0010736","role":null},{"name":"American Hustle","id":"tt1800241","role":null},{"name":"Her","id":"tt1798709","role":null}]}]}]},{"award":"CinEuphoria Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated CinEuphoria","categories":[{"category":"Best Special Effects (Sound or Visual) - International Competition","names":[{"name":"Jonathan Paquin","id":"nm0660763","role":null},{"name":"Brian Goodwin","id":"nm2267959","role":null},{"name":"Gray Horsfield","id":"nm1402398","role":null},{"name":"Matthieu Chardonnet","id":"nm3004770","role":null},{"name":"Adrien Toupet","id":"nm3296808","role":null}]},{"category":"Best Trailer - International Competition","names":[]}]}]},{"award":"Denver Film Critics Society 2014","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Original Score","names":[{"name":"Hans Zimmer","id":"nm0001877","role":null}]},{"category":"Best Science-Fiction/Horror Film","names":[]}]}]},{"award":"Georgia Film Critics Association (GFCA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated GFCA Award","categories":[{"category":"Best Production Design","names":[{"name":"Alex McDowell","id":"nm0568273","role":null}]},{"category":"Best Original Score","names":[{"name":"Hans Zimmer","id":"nm0001877","role":null}]}]}]},{"award":"Golden Schmoes Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Golden Schmoes","categories":[{"category":"Best Trailer of the Year","names":[]}]},{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Biggest Disappointment of the Year","names":[]},{"category":"Best DVD of the Year","names":[]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Most Overrated Movie of the Year","names":[]},{"category":"Best Special Effects of the Year","names":[]},{"category":"Favorite Movie Poster of the Year","names":[]},{"category":"Best Action Sequence of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Wildposts","names":[{"name":"Warner Bros.","id":null,"role":null},{"name":"Works Progress Administration","id":null,"role":null}]}]}]},{"award":"Golden Trailer Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Golden Trailer","categories":[{"category":"Best Summer 2013 Blockbuster Poster","names":[{"name":"Warner Bros.","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Summer 2013 Blockbuster Trailer","names":[{"name":"Jennifer Horvath","id":"nm2519062","role":null},{"name":"Warner Bros.","id":null,"role":null}]},{"category":"Best Teaser Poster","names":[{"name":"Warner Bros.","id":null,"role":null}]}]}]},{"award":"Hollywood Film Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Hollywood Movie Award","categories":[{"category":"","names":[{"name":"Zack Snyder","id":"nm0811583","role":null}]}]}]},{"award":"Hollywood Post Alliance, US 2013","titlesAwards":[{"titleAwardOutcome":"Nominated HPA Awards","categories":[{"category":"Outstanding Visual Effects - Feature Film","names":[{"name":"Keith Miller","id":"nm1990096","role":null},{"name":"Daniel Barrett","id":"nm2280778","role":null},{"name":"Phillip Leonhardt","id":"nm1351004","role":null},{"name":"Thelvin Cabezas","id":"nm2447975","role":null},{"name":"Mark Tait","id":"nm1264243","role":null},{"name":"Weta Digital","id":null,"role":null}]},{"category":"Outstanding Color Grading - Feature Film","names":[{"name":"Stefan Sonnenfeld","id":"nm0814406","role":null},{"name":"Company 3","id":null,"role":null}]}]}]},{"award":"Houston Film Critics Society Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Best Original Score","names":[{"name":"Hans Zimmer","id":"nm0001877","role":null}]}]}]},{"award":"IGN Summer Movie Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Comic Book Adaptation Movie","names":[]},{"category":"Best Movie Trailer","names":[]},{"category":"Best Movie Blu-Ray","names":[]}]}]},{"award":"IGN Summer Movie Awards 2012","titlesAwards":[{"titleAwardOutcome":"Won IGN Award","categories":[{"category":"Best Movie Poster","names":[]}]},{"titleAwardOutcome":"Won IGN People's Choice Award","categories":[{"category":"Best Movie Poster","names":[]}]},{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Movie Trailer","names":[]}]}]},{"award":"Jupiter Award 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Jupiter Award","categories":[{"category":"Best International Actress","names":[{"name":"Amy Adams","id":"nm0010736","role":null}]},{"category":"Best International Actor","names":[{"name":"Michael Shannon","id":"nm0788335","role":null}]},{"category":"Best International Film","names":[{"name":"Zack Snyder","id":"nm0811583","role":null}]}]}]},{"award":"Key Art Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Key Art Award","categories":[{"category":"Best Audio/Visual Technique","names":[{"name":"Hans Zimmer","id":"nm0001877","role":"music by"},{"name":"Warner Bros.","id":null,"role":null}]}]},{"titleAwardOutcome":"2nd place Key Art Award","categories":[{"category":"Best Audio/Visual Technique","names":[{"name":"Jennifer Horvath","id":"nm4818265","role":null},{"name":"Warner Bros.","id":null,"role":null}]}]}]},{"award":"MTV Movie Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Best Hero","names":[{"name":"Henry Cavill","id":"nm0147147","role":null}]}]}]},{"award":"NewNowNext Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Nexty","categories":[{"category":"Cause You're Hot","names":[{"name":"Henry Cavill","id":"nm0147147","role":null}]}]}]},{"award":"Rondo Hatton Classic Horror Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Rondo Statuette","categories":[{"category":"Best Film","names":[{"name":"Zack Snyder","id":"nm0811583","role":null}]}]}]},{"award":"Seattle Film Critics Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Seattle Film Critics Award","categories":[{"category":"Best Visual Effects","names":[{"name":"John 'D.J.' Des Jardin","id":"nm0220755","role":null},{"name":"Guillaume Rocheron","id":"nm1806981","role":null},{"name":"Dan Lemmon","id":"nm0501424","role":null},{"name":"Ged Wright","id":"nm2261997","role":null}]}]}]},{"award":"Teen Choice Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Summer Movie: Action/Adventure","names":[]},{"category":"Choice Summer Movie Star: Male","names":[{"name":"Henry Cavill","id":"nm0147147","role":null}]},{"category":"Choice Summer Movie Star: Female","names":[{"name":"Amy Adams","id":"nm0010736","role":null}]},{"category":"Choice Movie: Liplock","names":[{"name":"Henry Cavill","id":"nm0147147","role":null},{"name":"Amy Adams","id":"nm0010736","role":null}]}]}]},{"award":"Visual Effects Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Virtual Cinematography in a Live Action Feature Motion Picture","names":[{"name":"Daniel Paulsson","id":"nm2383770","role":null},{"name":"Edmund Kolloen","id":"nm1590967","role":null},{"name":"Joel Prager","id":"nm3167217","role":null},{"name":"David Philip Stripinis","id":"nm1619396","role":null}]},{"category":"Outstanding FX and Simulation Animation in a Live Action Feature Motion Picture","names":[{"name":"Brian Goodwin","id":"nm2267959","role":null},{"name":"Gray Horsfield","id":"nm1402398","role":null},{"name":"Matthieu Chardonnet","id":"nm3004770","role":null},{"name":"Adrien Toupet","id":"nm3296808","role":null}]}]}]},{"award":"World Soundtrack Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Film Composer of the Year","names":[{"name":"Hans Zimmer","id":"nm0001877","role":null},{"name":"12 Years a Slave","id":"tt2024544","role":null},{"name":"The Lone Ranger","id":"tt1210819","role":null},{"name":"Rush","id":"tt1979320","role":null}]}]}]}],"votes":"572 308","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0159111","name":"Legendary Entertainment"},{"idCompany":"co0147954","name":"Syncopy"}],"keywords":{"keywords":["reboot","british actor playing american character","origin of hero","based on comic book","final battle","restaurant","diner","fire","super speed","adopted son","superhero","military","army","reference to sears","2010s","apocalypse","fictional war","first part","riding a dragon","ancient astronaut","laser gun","one man army","one against many","supernatural power","planet","symbol of hope","hope","general","reporter","flying super villainess","33 year old","family crest","natural birth","ectogenesis","ectogen","artificial womb","population control","humanoid skull","terraformer","extraterrestrial woman","extraterrestrial man","extraterrestrial human","flying supervillain","caped superhero","alien superhero","supervillain","alien supervillain","super villainess","alien super villainess","female supervillain","submerged bus","metropolis the city","krypton the planet","flying superhero","male protagonist","dc extended universe","american midwest","employer employee relationship","newspaper","newspaper editor","slow motion scene","clothes line","female journalist","budweiser","money falling through the air","megalomaniac","helicopter","american flag","sikorsky sh 60 seahawk","binoculars","oil platform","falling object","implosion","rocket launch","codex","suit of armor","human skull","fetus","assassination","woman in labor","falling debris","plane crashing into a building","lockheed martin boeing f 22 raptor","c 17 globemaster","oh 6 cayuse helicopter","fairchild republic a 10 thunderbolt ii","atmospheric reentry","humvee","uh 60 blackhawk helicopter","m1 abrams tank","m 2 bradley fighting vehicle","restraint","polar bear","uh 1 huey helicopter","sikorsky sh 3 sea king helicopter","ch 47 chinook helicopter","school bus falling off a bridge","space ship","blow out","tree swing","damsel in distress","fbi","ferry","yelling","revenge","war criminal","mercy killing","fake identity","fighting in the air","crushed to death","collapsing building","humanity in peril","kicked in the stomach","kicked in the face","punched in the chest","construction site","black hole","end of the world","beating","inside the mind","injection","x ray vision","laptop","air strike","gatling gun","missile","machine gun","tank","desert","lifting person in air","chase","hotel","media coverage","farmhouse","cell phone","chaos","rescue","hostage","kidnapping","fighter pilot","gas mask","fighter jet","gas station","bank vault","bank","costumed hero","costume","skeleton","engineer","professor","journalist","investigative reporter","villainess","female soldier","captain","soldier","u.s. army","u.s. air force","scientist","snow","ice","crash landing","canada","tent","bridge","bully comeuppance","truck","waiter","waitress","trucker","hitchhiker","hitchhiking","small town","pirate broadcasting","torture","barn","farmer","cornfield","farm","adoptive mother","adoptive father","telekinesis","mind reading","telepathy","school teacher","school","loner","drifter","fishing boat","fisherman","space capsule","mercilessness","invulnerability","anti villain","laboratory","nonlinear timeline","cryogenics","space war","space battle","escape pod","reluctant hero","childbirth","deoxyribonucleic acid","genetic engineering","helmet","spacesuit","race against time","creature","handcuffs","no title at beginning","council","knife","saturn the planet","moon","outpost","space exploration","alien civilization","alien race","civil war","coup d'etat","world domination","artificial intelligence","robot","jumping from height","jumping through a window","crashing through a window","fight to the death","laser","x rayed skeleton","warrior","tough guy","action hero","combat","battlefield","gunfight","violence","death","martial arts","mixed martial arts","hand to hand combat","brawl","fistfight","exploding building","exploding train","exploding truck","exploding car","exploding airplane","exploding plane","exploding helicopter","exploding ship","exploding body","priest","church","bare chested male","blockbuster","news report","title at the end","terraforming","two way mirror","breaking handcuffs","photograph","kansas","false identity","neck breaking","butt slap","power outage","spitting blood","satellite","lifted by the throat","woman punching a man","man punching a woman","car crash","school bus","thrown through a wall","thrown through a window","lens flare","drink thrown into someone's face","bar","imprisonment","altered version of studio logo","no opening credits","character repeating someone else's dialogue","head butt","punched in the face","skull","pistol","assault rifle","shot in the head","shot to death","shot in the chest","shootout","self sacrifice","hiding in a closet","murder","impalement","stabbed to death","stabbed in the chest","child in peril","3 dimensional","underwater scene","oil rig","person on fire","character's point of view camera shot","young version of character","mother son relationship","husband wife relationship","falling to death","destruction of planet","wilhelm scream","product placement","showdown","battle","epic","family farm","interview","red cape","flying man","alien abduction","human versus alien","destroyed city","u.s. soldier","fbi agent","fight","exploding gasoline station","phantom zone","coming of age","spacecraft","heroism","space travel","christ allegory","alien contact","catching someone who falls","reboot of series","cemetery","fictional city","earth viewed from space","secret identity","super strength","assumed identity","foster parent","outer space","cape","exploding planet","flashback","good versus evil","guided missile","falling from height","adoption","surrogate family","man with glasses","bully","death of husband","superhuman","escape","orphan","airplane","helicopter crash","alien planet","criminal","flying","dog","newspaper office","interrogation","arrest","infant","hologram","father son relationship","tornado","human alien","humanoid","colonel","explosion","ufo","editor in chief","newspaper reporter","female reporter","spaceship","alien","alien invasion","three word title","re boot","based on comic","dc comics","sequel","death of father","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:08:20"}}