{"data":{"movies":[{"title":"Year of the Dog","originalTitle":"","year":"2007","releaseDate":"20070511","directors":[{"name":"Mike White","id":"nm0925234"}],"writers":[{"name":"Mike White","id":"nm0925234"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTcxMzg5OV5BMl5BanBnXkFtZTcwMzkzOTM0MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Peggy is single, childless, in her 40s, a lonely executive assistant in a friendly office. Her dog Pencil is the love of her life, and when he dies after eating some sort of toxin, Peggy's life spins out of her control: a friendly neighbor invites her for dinner; a friendly staff member at her vet's calls with an abused dog he recommends she adopt - she does, and also finds herself attracted to this fellow. She becomes a vegan, supports animal-rights causes, and embroils her brother's young children in these concerns. Saving dogs and other animals become such a passion that her mental health and her job may be in danger. Are regaining control and finding love beyond her reach?","simplePlot":"A secretary's life changes in unexpected ways after her dog dies.","actors":[{"actorName":"Molly Shannon","urlProfile":"http://www.imdb.com/name/nm0788340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk3MDMyMDQ5MV5BMl5BanBnXkFtZTcwNTc5Mzk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1964","placeOfBirth":" Shaker Heights, Ohio, USA","birthName":"Molly Helen Shannon","height":"5' 5\" (1.65 m)","bio":"Molly Shannon has successfully become one of Hollywood's most sought-after talents on television and the silver screen. Shannon was born in Shaker Heights, Ohio, to Mary Margaret (Keating), a teacher, and James Francis Shannon, a sales manager. Her parents were both of Irish descent. She earned a BFA in drama from New York University's prestigious Tisch School of the Arts. Prior to joining \"SNL\", Molly appeared at The Up Front Comedy Theater in Los Angeles in \"The Rob and Molly Show\", an improvisational show she co-wrote with Rob Muir. Shannon spent six seasons as a member of the repertory company on Saturday Night Live (1975), primarily known for the eclectic characters she created, such as \"Mary Katherine Gallagher\" and \"Sally O'Malley\". She is also praised for her parodies of Courtney Love, Liza Minnelli, Monica Lewinsky and Meredith Vieira. Shannon starred as \"Betty Lou Who\" in Ron Howard's worldwide blockbuster, How the Grinch Stole Christmas (2000); and the title role in Paramount's hit comedy, Superstar (1999), portraying everybody's favorite Catholic schoolgirl, \"Mary Katherine Gallagher\". Additionally, she also starred in the following feature films: A Night at the Roxbury (1998), a spin-off of the popular head-bopping, nightclubbing brothers on Saturday Night Live (1975); Warner Bros. comedy, Analyze This (1999), opposite Billy Crystal and Robert De Niro; Todd Solondz's controversial Happiness (1998); and Fox 2000's Never Been Kissed (1999), opposite 'Drew Barrymore'; Good Boy! (2003), a CGI-animated live-action comedy; My Boss's Daughter (2003) with Ashton Kutcher; Miramax's romantic comedy, Serendipity (2001), opposite John Cusack and Kate Beckinsale; Osmosis Jones (2001), the animated comedy co-starring Bill Murray; the independent feature film, Wet Hot American Summer (2001), opposite Janeane Garofalo and David Hyde Pierce; and a featured cameo opposite Tim Allen in Disney's The Santa Clause 2 (2002). Shannon's recent film credits include a cameo in Evan Almighty (2007), the sequel to the hilarious comedy, Bruce Almighty (2003), opposite Steve Carell; Keenen Ivory Wayans' Littleman (2006); Talladega Nights: The Ballad of Ricky Bobby (2006) with Will Ferrell and an appearance in the box-office smash hit, Scary Movie 4 (2006). Molly's independent film credits include Sue Kramer's Gray Matters (2006) opposite Heather Graham and Bruce Leddy's The Wedding Weekend (2006). On television, Shannon has been seen opposite Christopher McDonald and Jason Schwartzman in the off-beat comedy series, Cracking Up (2004), created by her Year of the Dog (2007) director, Mike White. Molly also starred in USA Networks original movie, The Twelve Days of Christmas Eve (2004), and appeared in the remake of the classic musical, The Music Man (2003), co-starring Matthew Broderick and Kristin Chenoweth. Additional television guest appearances include memorable roles on Will & Grace (1998), Sex and the City (1998) and Seinfeld (1989), among many others. Shannon returned to television in 2008, starring in the US version of the popular Australian sitcom, Kath & Kim (2008), for NBC with Selma Blair. \"Kath and Kim\" earned a \"Favorite New Comedy\" nomination from the People's Choice Awards in its first season. The very busy Shannon also lent her voice to Exodus Film Group's CG animated feature, Igor (2008), a comedy that brought a new twist to the classic monster genre, along with Jeremy Piven, Steve Buscemi and John Cleese. Shannon was also seen in the Lifetime Original movie, More of Me (2007), playing multiple versions of an overwhelmed and overextended career woman who struggles to find balance in her roles as a wife, mother and working professional. In her most recent big screen appearance, Shannon starred in the quirky Paramount Vantage comedy, Year of the Dog (2007), for writer-director Mike White.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk3MDMyMDQ5MV5BMl5BanBnXkFtZTcwNTc5Mzk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0788340","name":"Molly Shannon","idIMDB":"nm0788340"},"actorId":"nm0788340","character":"Peggy","urlCharacter":"http://www.imdb.com/character/ch0061769","main":true},{"actorName":"Laura Dern","urlProfile":"http://www.imdb.com/name/nm0000368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzY0MDQxMF5BMl5BanBnXkFtZTcwNzMwMzcyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1967","placeOfBirth":" Saint John's Health Center, Santa Monica, Los Angeles County, California, USA","birthName":"Laura Elizabeth Dern","height":"5' 10½\" (1.79 m)","bio":"Laura Dern was born on February 10, 1967 in Los Angeles, the daughter of actors Bruce Dern and Diane Ladd. Dern was exposed to movie sets and the movie industry from infancy, and obtained several bit parts as a child. Her parents divorced when Dern was two and Dern lost contact with her father for several years as a result. Her parents' background and her own early taste of the moviemaking world soon convinced the young Dern to pursue acting herself. Like so many young actors, her decision may have been influenced by social awkwardness -- the child of 60s counterculture parents, she was steeped in Eastern mysticism and political radicalism, and was seen as an oddball by her more conservative classmates. Her gawky physical appearance didn't help - even before her teens, she had achieved most of her impressive 5' 10\" height, was rail-skinny (other than precociously wide hips), had huge feet and a slouching posture, and for all this was often teased by classmates. Perhaps the nine-year-old Dern found refuge by studying acting at the Lee Strasberg Theater Institute. The first success for the young Dern came in 1980, with a role in Adrian Lyne's Foxes (1980), a teen movie starring Jodie Foster. She followed this with several small parts, or parts in small movies, such as Ladies and Gentlemen, the Fabulous Stains (1982) and Teachers (1984), as a student who has an affair with a teacher. (Her mother objected to her active presence on movie sets at age thirteen, which required Dern to sue for emancipation so she could play her role in \"The Fabulous Stains\"). Her next roles, as the blind girl who befriends the deformed boy in Mask (1985), and as a teenaged girl whose sexual awakening collides with a mysterious older man in Smooth Talk (1985), gave her career an important boost. Dern appeared to have made it with a leading role in David Lynch's acclaimed Blue Velvet (1986), but it was four years before her next notable film, and this was the bizarre Wild at Heart (1990), also directed by Lynch. The following year, Dern starred in Rambling Rose (1991), which would become her signature performance, as a sexually-precocious, free-spirited young housemaid in the South in the 1930s. Dern earned an Oscar nomination for her performance, and so did her mother and co-star, Diane Ladd. Dern continues to win prominent roles on the big screen, often in smaller, highly-regarded human dramas such as October Sky (1999), I Am Sam (2001) and We Don't Live Here Anymore (2004), although she is perhaps most widely known for her repeat role as Ellie Sattler in the summer adventure movies Jurassic Park (1993) and Jurassic Park III (2001), or for her guest performance on Ellen (1994), as the woman to whom Ellen finally comes out as a lesbian. Dern's pre-teen gawkiness matured into lithe beauty, but this doesn't prevent Dern from fearlessly throwing herself into a wide variety of roles which are sometimes unflattering, an excellent example being her unflinchingly comic portrayal of an intensely annoying loser whose pregnancy becomes a social and political football in Citizen Ruth (1996). This results in Dern being one of the most interesting actors working in Hollywood today. Having previously dated such Hollywood talent as Treat Williams, Renny Harlin, Kyle MacLachlan, Jeff Goldblum and Billy Bob Thornton, Dern eventually married musician Ben Harper in 2005. Early in her career, Dern was roommate to Marianne Williamson, the spirituality guru. Dern attended two days of college at UCLA and one semester at USC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzY0MDQxMF5BMl5BanBnXkFtZTcwNzMwMzcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000368","name":"Laura Dern","idIMDB":"nm0000368"},"actorId":"nm0000368","character":"Bret","urlCharacter":"http://www.imdb.com/character/ch0061770","main":true},{"actorName":"Regina King","urlProfile":"http://www.imdb.com/name/nm0005093","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTU4MDc5NF5BMl5BanBnXkFtZTcwNDk5NTE2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1971","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Regina Rene King","height":"5' 3\" (1.6 m)","bio":"Regina King was born in Los Angeles, California, to Gloria, a special education teacher, and Thomas King, an electrician. She began her career in the television show 227 (1985), followed by a role in Boyz n the Hood (1991). She began to be recognized by a mainstream audience after her role as Cuba Gooding Jr.'s character's wife in Jerry Maguire (1996). She co-starred in Enemy of the State (1998) as Will Smith's character's wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTU4MDc5NF5BMl5BanBnXkFtZTcwNDk5NTE2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005093","name":"Regina King","nicknames":["Gina"],"idIMDB":"nm0005093"},"actorId":"nm0005093","character":"Layla","urlCharacter":"http://www.imdb.com/character/ch0061771","main":true},{"actorName":"Tom McCarthy","urlProfile":"http://www.imdb.com/name/nm0565336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODYyNzk2NF5BMl5BanBnXkFtZTYwMjAxNTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1966","placeOfBirth":" New Providence, New Jersey, USA","birthName":"Thomas Joseph McCarthy","height":"5' 11\" (1.8 m)","bio":"Tom McCarthy was born on June 7, 1966 in New Providence, New Jersey, USA as Thomas Joseph McCarthy. He is an actor and producer, known for Spotlight (2015), 2012 (2009) and Up (2009). He is married to Wendy Merry. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODYyNzk2NF5BMl5BanBnXkFtZTYwMjAxNTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0565336","name":"Tom McCarthy","nicknames":["Tom"],"idIMDB":"nm0565336"},"actorId":"nm0565336","character":"Pier","urlCharacter":"http://www.imdb.com/character/ch0061772","main":true},{"actorName":"Josh Pais","urlProfile":"http://www.imdb.com/name/nm0656929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTg2ODk0OF5BMl5BanBnXkFtZTgwMjE0MDkwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1964","placeOfBirth":" New York City, New York, USA","birthName":"Joshua Pais","height":"5' 7\" (1.7 m)","bio":"Josh Pais was born on June 21, 1964 in New York City, New York, USA as Joshua Pais. He is an actor and writer, known for Ray Donovan (2013), Law & Order: Special Victims Unit (1999) and Teenage Mutant Ninja Turtles (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTg2ODk0OF5BMl5BanBnXkFtZTgwMjE0MDkwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0656929","name":"Josh Pais","idIMDB":"nm0656929"},"actorId":"nm0656929","character":"Robin","urlCharacter":"http://www.imdb.com/character/ch0061773","main":true},{"actorName":"John C. Reilly","urlProfile":"http://www.imdb.com/name/nm0000604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzMDkzOF5BMl5BanBnXkFtZTYwNzQzNzcy._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1965","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Christopher Reilly","height":"6' 2\" (1.88 m)","bio":"Character actor, dramatic leading man, or hilarious comic foil? With an astonishing range of roles already under his belt, John C. Reilly has played an eclectic host of rich characters to great effect over the years, from seedy ne'er-do-wells, to lovable, good-natured schlepps. The fifth of six children, John Christopher Reilly was born in Chicago, to a father of mostly Irish descent, and a Lithuanian-American mother, and was brought up on Chicago's tough Southwest territory. His father, also named John, ran an industrial linen supply company business. On the amateur stage from age eight, Reilly trained at the Goodman School of Drama and eventually became a member of Chicago's renowned Steppenwolf Theatre. His film break came with a small role in the Vietnam War drama Casualties of War (1989), wherein Brian De Palma liked his work so much during the early stages that he recast him in a major role by the start of shooting as a soldier bent on rape. Reilly gained momentum throughout the 1990s and showed his dazzling stretch of talent in such films as Days of Thunder (1990), Shadows and Fog (1991), What's Eating Gilbert Grape (1993) and The River Wild (1994). He became a major stock player in director Paul Thomas Anderson's films, while finding some of his best roles in Hard Eight (1996) as a compulsive gambler, Boogie Nights (1997) in which he played a narcissistic porn star, and in Magnolia (1999) as a compassionate policeman. He went on to earn further critical points for his role of the soldier sent to the front lines in Terrence Malick's war epic The Thin Red Line (1998). On stage, Reilly has wowed audiences in \"The Grapes of Wrath\" on Broadway, \"A Streetcar Named Desire\" and \"Othello\" at Steppenwolf, and earned an Outer Critics Circle Award and Tony nomination for \"True West\" alongside another impeccable character player Philip Seymour Hoffman. Reilly finally received the film recognition he deserved in 2002 with a slew of choice, high-profile parts in The Hours (2002), The Good Girl (2002), Gangs of New York (2002), and especially Chicago (2002) as the put-upon husband, Amos Hart, who is played for a patsy by murderous wife Roxie (Renée Zellweger). For this last part, he received both Golden Globe and Academy Award nominations for Best Supporting Actor. Since then his stock has risen considerably, and he has further widened his cinematic repertoire, appearing in everything from dramatic roles - We Need to Talk About Kevin (2011), Aviator (2004) and Carnage (2011) - to broader comic turns - Walk Hard: The Dewey Cox Story (2007), Talladega Nights: The Ballad of Ricky Bobby (2006), Step Brothers (2008), Cyrus (2010) and Cedar Rapids (2011). Most recently, he has voiced the lead in Disney's animated smash Wreck-It Ralph (2012). Reilly is married to producer Alison Dickey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzMDkzOF5BMl5BanBnXkFtZTYwNzQzNzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000604","name":"John C. Reilly","idIMDB":"nm0000604"},"actorId":"nm0000604","character":"Al","urlCharacter":"http://www.imdb.com/character/ch0061774","main":true},{"actorName":"Peter Sarsgaard","urlProfile":"http://www.imdb.com/name/nm0765597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0Mjg0NzE2Nl5BMl5BanBnXkFtZTcwMDE1MTkxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1971","placeOfBirth":" Belleville, Illinois, USA","birthName":"John Peter Sarsgaard","height":"5' 11\" (1.8 m)","bio":"Peter Sarsgaard was born at Scott Air Force Base, Illinois, to Judy Lea (Reinhardt) and John Dale Sarsgaard, an engineer who worked for the Air Force and later Monsanto and IBM. He is a graduate of St. Louis' Washington University, where he majored in history and literature. He was a co-founder of the comedy improvisational group Mama's Pot Roast and trained initially with the Actors' Studio in New York. Such off-Broadway productions included Horton Foote's \"Laura Dennis\" and John Cameron Mitchell's \"Kingdom of Earth.\" He made his screen debut in Tim Robbins' Dead Man Walking (1995) and was given more sizable roles in Desert Blue (1998) and The Man in the Iron Mask (1998), as the ill-fated son of the Musketeer Athos, played by John Malkovich. Peter then started gracing the art-house circuit, making a violent, searing impression as a homophobic killer in Boys Don't Cry (1999) starring two-time Oscar-winner Hilary Swank as a trans-gendered teen. Other impressionable offbeat roles for Peter that have thrilled critics from coast to coast include Shattered Glass (2003), which earned him a slew of awards including the prestigious National Society of Film Critics Award. Prior to that, he showed off his versatility with portrayals ranging from a Russian nuclear reactor officer in K-19: The Widowmaker (2002) to a drug addict in The Salton Sea (2002). Other heralded performances in Garden State (2004) and Kinsey (2004) only prove that, at this rate, it is only a matter of time before the Oscars come rapping on Sarsgaard's door.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0Mjg0NzE2Nl5BMl5BanBnXkFtZTcwMDE1MTkxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0765597","name":"Peter Sarsgaard","idIMDB":"nm0765597"},"actorId":"nm0765597","character":"Newt","urlCharacter":"http://www.imdb.com/character/ch0021891","main":true},{"actorName":"Amy Schlagel","urlProfile":"http://www.imdb.com/name/nm1405219","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MTA4MjkzNDleQTJeQWpwZ15BbWU4MDg0NDE2MDIx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Amy Schlagel is an actress, known for Year of the Dog (2007), Legally Blonde 2: Red, White & Blonde (2003) and Le jackpot de Noël (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MTA4MjkzNDleQTJeQWpwZ15BbWU4MDg0NDE2MDIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1405219","name":"Amy Schlagel","idIMDB":"nm1405219"},"actorId":"nm1405219","character":"Lissie","urlCharacter":"http://www.imdb.com/character/ch0061775","main":true},{"actorName":"Zoe Schlagel","urlProfile":"http://www.imdb.com/name/nm1736343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTEyMzQzOF5BMl5BanBnXkFtZTgwMjQzMzc5MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Zoe Schlagel is an actress, known for Year of the Dog (2007), Le jackpot de Noël (2007) and Cold Case (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTEyMzQzOF5BMl5BanBnXkFtZTgwMjQzMzc5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1736343","name":"Zoe Schlagel","idIMDB":"nm1736343"},"actorId":"nm1736343","character":"Lissie","urlCharacter":"http://www.imdb.com/character/ch0061775","main":true},{"actorName":"Dale Godboldo","urlProfile":"http://www.imdb.com/name/nm0004964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDczMjE2Ml5BMl5BanBnXkFtZTgwNzU0MjU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1975","placeOfBirth":" Dallas, Texas, USA","birthName":"Dale Eugene Godboldo III","height":"5' 7\" (1.7 m)","bio":"Actor/producer Dale Godboldo has been working for over 25 years in film and television, both in front of and behind the camera, and currently plays 'Dream Team' attorney Carl E. Douglas on Ryan Murphy's \"American Crime Story: The People V. OJ Simpson.\" After completing four seasons as a Mouseketeer on the 90's \"All New Mickey Mouse Club\" (alongside Ryan Gosling, Keri Russell, and Justin Timberlake), Dale continued his acting career appearing in a dozen films and over 130 episodes of television. Dale's film work includes Marvel's \"Thor,\" \"The Sum of All Fears,\" the remake of \"Fame,\" the Brad Pitt produced \"Year of The Dog,\" and the Will Smith produced \"Lakeview Terrace.\" Dale's television work includes ER, Bones, and Disney's Good Luck Charlie, with series regular roles opposite Kristin Chenoweth, Jenny McCarthy, and Wanda Sykes on FOX's \"Wanda At Large.\" Dale is currently Executive Producing Lionsgate/Codeblack's \"Flyy Girl\" starring Sanaa Lathan and produced by Effie Brown (\"Dear White People\" & HBO's \"Project Greenlight\"). \"Flyy Girl\" is based on Omar Tyree's NY Times Bestselling trilogy of novels. Dale is also Producing the thriller \"Superstition: Final Chance\" with the creator of the hugely successful \"Final Destination\" franchise, as COO of Global Renaissance Entertainment Group - a joint venture with principals of a $2B investment firm. www.GodboldoEnterprises.com In looking for ways to help the next generation reach their dreams, Dale formed the aptly named Always In The Club Foundation (AITCF) in appreciation of the training and mentorship he received as a young man on the Mouse Club. AITCF recently became a member of Bill, Hillary, and Chelsea Clinton Foundation's Clinton Global Initiative (CGI), and announced Project:NOW - a non-profit initiative that rapidly addresses the educational needs of at-risk youth in America. AITCF/Project:NOW's first fundraiser was held in New York with George W. Bush on September 24, 2014, and sponsored by unite4:good. The evening was hosted by \"The Good Wife's\" Chris Noth. Dale is a founding member of Chelsea Clinton's CGI LEAD team - a group of accomplished young industry professionals committed to collaborating with CGI members and mentoring the next generation of global leaders. Other charitable activities have included fundraising for Unite4:Humanity, US Dream Academy, Charlize Theron Africa Outreach Project, and Kids In The Spotlight, volunteering for anti-bullying organization, Stand For The Silent, and serving as a judge for Miss America's Outstanding Teen Competition, where millions of dollars in scholarships have been raised to send outstanding young ladies to college. Dale was recently honored by the Los Angeles Urban League Young Professionals for his work in the community.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDczMjE2Ml5BMl5BanBnXkFtZTgwNzU0MjU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004964","name":"Dale Godboldo","nicknames":["Geno"],"idIMDB":"nm0004964"},"actorId":"nm0004964","character":"Don","urlCharacter":"http://www.imdb.com/character/ch0061776","main":true},{"actorName":"Inara George","urlProfile":"http://www.imdb.com/name/nm1102608","urlPhoto":"","biography":{"dateOfBirth":"4 July 1974","placeOfBirth":" Baltimore, Maryland, USA","bio":"Inara Maryland George was born in Baltimore, Maryland. At the time, her late father, Lowell George, was recording the Little Feat album, Feats Don't Fail Me Now. He died of a heart attack on June 29, 1979 at age 34. She grew up in the Topanga Canyon area of Los Angeles and tried ballet, studied acting, and appeared in stage productions at the outdoor Will Geer Theatricum Botanicum. In 1993, Inara, Gabriel Cowan, Robin Moxey, and Lonn Baker, friends from high school, formed a band called Lode. The band and their mixtures of blues and grunge sounds toured California and Colorado, along with the House of Blues in West Hollywood. They went on to win a contract with the Geffen label and released the album Legs & Arms in 1996. The record made no major impact on pop sales charts. With ambitions of becoming a Shakespearean actress, George spent three semesters as a student at Emerson College in Boston. Soon, she began writing songs with thoughts of returning to the music scene. She soon paired up with songwriter Bryony Atkinson to form the duo Merrick and the two went on to release four albums on small labels between 1998 and 2001. Merrick disbanded the following year and George had begun to assemble the team that would propel her to solo success. In 2005, Inara George released her first solo album, All Rise, which appeared on the Everloving label. Michael Andrews, who had written the score to the hit film Donnie Darko, produced and co-wrote much of the material on that album. All Rise was a success with critics like Ryan Dombal of Entertainment Weekly, who wrote that \"George's soothing, girlish vocals float above her sometimes-downcast, sometimes-poppy songs like a waft of warm air.\" The next project Inara George found herself working on was with multi-instrumentalist Greg Kurstin. The project arose after Kurstin, who played keyboards on All Rise, and George discovered that they both enjoyed classical jazz. The two named themselves the Bird and the Bee and released their first album, which was self-titled, in 2006. Several EPs, Ray Guns Are Not Just The Future, and Interpreting the Masters Volume 1: A Tribute to Daryl Hall and John Oates were later released. [Unfinished]","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1102608","name":"Inara George","idIMDB":"nm1102608"},"actorId":"nm1102608","character":"Holly","urlCharacter":"http://www.imdb.com/character/ch0061777","main":true},{"actorName":"Liza Weil","urlProfile":"http://www.imdb.com/name/nm0917962","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTkwMDkyMF5BMl5BanBnXkFtZTcwMjQ1NjEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1977","placeOfBirth":" Passaic, New Jersey, USA","birthName":"Liza Rebecca Weil","height":"5' 4\" (1.63 m)","bio":"Liza Weil's childhood was spent traveling around the world with her parents, who were members of The Mad House of London, a prestigious comedy troupe known throughout Europe. At the age of 7, Liza's family settled in a small town in Pennsylvania, and soon after, she began performing in local theater. Without any formal training, her parents helped guide her career, permitting Liza to travel several times a month to audition for roles in Manhattan. After a series of standout theatrical performances in such plays as \"Our Town\" and \"The Effect of Gamma Rays on Man-In-The-Moon Marigolds,\" casting directors began to take notice of Liza. She has also appeared Off-Broadway in the Playwright's Horizon production of \"Life By Asphyxiation\" and has performed onstage in several regional productions, including \"The Miracle Worker\" and \"Fifteen Minute Hamlet,\" among others. She made her feature film debut in Whatever (1998) which premiered at the 1998 Sundance Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTkwMDkyMF5BMl5BanBnXkFtZTcwMjQ1NjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0917962","name":"Liza Weil","idIMDB":"nm0917962"},"actorId":"nm0917962","character":"Trishelle","urlCharacter":"http://www.imdb.com/character/ch0061778","main":true},{"actorName":"Jon Shere","urlProfile":"http://www.imdb.com/name/nm1134242","urlPhoto":"","biography":{"bio":"Jon Shere is an actor, known for The Good Girl (2002), Year of the Dog (2007) and Gentlemen Broncos (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1134242","name":"Jon Shere","idIMDB":"nm1134242"},"actorId":"nm1134242","character":"Pound Employee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christy Moore","urlProfile":"http://www.imdb.com/name/nm0601053","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkyMjAyNjU1OF5BMl5BanBnXkFtZTcwMjk0MTUxNA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"birthName":"Christy Lynn Moore","height":"5' 5\" (1.65 m)","bio":"Christy was born in Pittsburgh, Pennsylvania and raised in Orlando, Florida. Her first job at the age of sixteen was performing for the Walt Disney World Company. At eighteen, while applying for colleges, she received a full Theatre Scholarship, which she turned down to accept an entertainment contract in Tokyo, Japan. After living and performing in Tokyo, she returned to Orlando to receive her Bachelor of Arts Degree in Psychology from the University of Central Florida. While pursuing her degree she continued acting, booking jobs in the states and overseas. After graduation she booked National Lampoon's Comedy Night School as the Host and a Head Writer. After moving to Los Angeles, she co-founded the bi-coastal (Los Angeles and New York) Theatre Company From the Ground Up. She then founded, produced, and performed in the all female sketch comedy group One Hott Mess. The group was immediately featured on Funny or Die. She resides in Los Angeles as a working Actress and Spokesmodel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkyMjAyNjU1OF5BMl5BanBnXkFtZTcwMjk0MTUxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601053","name":"Christy Moore","idIMDB":"nm0601053"},"actorId":"nm0601053","character":"Al's Girlfriend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Audrey Wasilewski","urlProfile":"http://www.imdb.com/name/nm0913585","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTk3ODU5NV5BMl5BanBnXkFtZTgwMjkyMjM4ODE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1967","placeOfBirth":" Maryland, USA","bio":"Audrey Wasilewski was born on June 26, 1967 in Maryland, USA. She is an actress and producer, known for RED (2010), Seven Pounds (2008) and Star Trek Into Darkness (2013). She has been married to Lyle Kanouse since 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTk3ODU5NV5BMl5BanBnXkFtZTgwMjkyMjM4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0913585","name":"Audrey Wasilewski","idIMDB":"nm0913585"},"actorId":"nm0913585","character":"Audrey","urlCharacter":"http://www.imdb.com/character/ch0061779","main":true}],"seasons":[],"idIMDB":"tt0756729","urlIMDB":"http://www.imdb.com/title/tt0756729","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$1,540,141","country":"USA","day":"28","month":"06","year":"2007","remarks":""},{"money":"$1,538,703","country":"USA","day":"24","month":"06","year":"2007","remarks":""},{"money":"$1,532,898","country":"USA","day":"17","month":"06","year":"2007","remarks":""},{"money":"$1,523,739","country":"USA","day":"10","month":"06","year":"2007","remarks":""},{"money":"$1,505,413","country":"USA","day":"03","month":"06","year":"2007","remarks":""},{"money":"$1,470,625","country":"USA","day":"27","month":"05","year":"2007","remarks":""},{"money":"$1,353,571","country":"USA","day":"20","month":"05","year":"2007","remarks":""},{"money":"$937,735","country":"USA","day":"06","month":"05","year":"2007","remarks":""},{"money":"$627,916","country":"USA","day":"29","month":"04","year":"2007","remarks":""},{"money":"$275,138","country":"USA","day":"22","month":"04","year":"2007","remarks":""}],"weekendGross":[{"money":"$2,974","country":"USA","day":"24","month":"06","year":"2007","remarks":"9 Screens"},{"money":"$3,912","country":"USA","day":"17","month":"06","year":"2007","remarks":"14 Screens"},{"money":"$8,513","country":"USA","day":"10","month":"06","year":"2007","remarks":"24 Screens"},{"money":"$16,619","country":"USA","day":"03","month":"06","year":"2007","remarks":"45 Screens"},{"money":"$73,147","country":"USA","day":"27","month":"05","year":"2007","remarks":"95 Screens"},{"money":"$112,833","country":"USA","day":"20","month":"05","year":"2007","remarks":"149 Screens"},{"money":"$223,032","country":"USA","day":"06","month":"05","year":"2007","remarks":"141 Screens"},{"money":"$309,318","country":"USA","day":"29","month":"04","year":"2007","remarks":"131 Screens"},{"money":"$133,335","country":"USA","day":"22","month":"04","year":"2007","remarks":"33 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Moviecam Compact, Cooke S4 and Angenieux Optimo Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Fuji Super F-250D 8562, Super F-500T 8572)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3513DI)"]},"rating":"6.1","metascore":"70","filmingLocations":[{"location":"Altadena, California, USA"}],"rated":"PG-13","awards":[{"award":"Film Independent Spirit Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Screenplay","names":[{"name":"Mike White","id":"nm0925234","role":null}]}]}]},{"award":"Genesis Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won Genesis Award","categories":[{"category":"Outstanding Feature Film","names":[{"name":"Paramount Vantage","id":null,"role":null}]}]}]}],"votes":"5,505","type":"Movie","companyCreditsSimple":[{"idCompany":"co0117811","name":"Black & White Productions"},{"idCompany":"co0136967","name":"Plan B Entertainment"},{"idCompany":"co0193472","name":"Rip Cord Productions"}],"keywords":{"keywords":["dog","love","animal","office","neighbor","vegan","secretary","animal rights","dog lover","xanax","weapon collection","watching tv","voice over narration","urination","turkey the bird","trust","trespassing","trauma","toxic poisoning","tofu","thief","theft","teeth","tears","supermarket","subjective camera","stuffed animal","store clerk","spoken e mail","sheep","seizure of property","sandwich","sadness","robbery","restaurant","rescue","poultry farm","poisoning","pill","photograph","pet","petition","peta","pastry","park","parenting","office worker","new year's eve","mule","mother son relationship","mother daughter relationship","moose","money","mental breakdown","lying in wait","loyalty","lint remover","kiss","investigation","husband wife relationship","hunting","hunting accident","hunter","house sitter","horse","gun","goat","friend","friendship","forged signature","food","flashback","fingernails","father son relationship","father daughter relationship","family relationships","fired from the job","embezzlement","elk","e mail","doughnut","donation","dog training","pet food","dog bite","dog adoption","death","death of pet","death of dog","cupcake","crying","cow","construction worker","computer","christmas","christmas present","check","champagne","cell phone","celibacy","cafe","bus","breaking and entering","book","bookstore","blowing a kiss","beagle","baby","babysitting","babysitter","aunt niece relationship","aspca","animal torture","animal testing","animal slaughter","african american","loneliness","animal in title","victorias secret","single woman","protest","kennel","infidelity","handicapped dog","cubicle","crippled dog","check fraud","cage","blackmail","rat poison","pig","pet adoption","lost dog","knife","homosexual","german shepherd","fur coat","farm","euthanasia","dog pound","dog on wheels","distempered animal","dead dog","chicken","cheating boyfriend","brother sister relationship","barking dog","attempted murder","animal shelter","animal rescue","animal lover"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:42:46"}}