{"data":{"movies":[{"title":"Case 39","originalTitle":"","year":"2009","releaseDate":"20101001","directors":[{"name":"Christian Alvart","id":"nm0023355"}],"writers":[{"name":"Ray Wright","id":"nm1242522"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA4NDUyOTE5NV5BMl5BanBnXkFtZTcwOTQ3NzY3Mw@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"\"Case 39\" centers on an idealistic social worker who saves an abused 10-year-old girl from her parents only to discover that the girl is not as innocent as she thinks.","simplePlot":"A social worker fights to save a girl from her abusive parents, only to discover that the situation is more dangerous than she ever expected.","actors":[{"actorName":"Renée Zellweger","urlProfile":"http://www.imdb.com/name/nm0000250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzYwMDI2OF5BMl5BanBnXkFtZTgwMzg3NjYwMzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1969","placeOfBirth":" Katy, Texas, USA","birthName":"Renée Kathleen Zellweger","height":"5' 3\" (1.6 m)","bio":"Renée Kathleen Zellweger was born on April 25, 1969, in Katy, Texas, USA. Her mother, Kjellfrid Irene (Andreassen), is a Norwegian-born former nurse and midwife, of Norwegian, Kven (Finnish), and Swedish descent. Her father, Emil Erich Zellweger, is a Swiss-born engineer. The two married in 1963. Renée has a brother named Drew Zellweger, a marketing executive born on February 15, 1967. Renée got interested in acting in high school while working on the drama club. She also took an acting class at the University of Texas (Austin), where she began looking towards acting as a career. After graduation, she wanted to continue acting, but Hollywood is a tough town to break into, so Renée decided to stay in Texas, and auditioned for roles around Houston, where she managed to grab roles in such films as Reality Bites (1994) and Empire Records (1995). While on the set for the sequel, Texas Chainsaw Massacre: The Next Generation (1994), she befriended Matthew McConaughey, another Hollywood up-and-comer. He was working on a project at the time that Renée was interested in, auditioned for, and won the role in the film Love and a .45 (1994), which earned her enough critical praise that she decided to move to Los Angeles. Another role in The Whole Wide World (1996) followed which led to her big break. Cameron Crowe was busy casting his next film, Jerry Maguire (1996), starring Tom Cruise. Crowe was considering such actresses as Cameron Diaz, Bridget Fonda, Winona Ryder, and Marisa Tomei, when he heard of Zellweger's performance in The Whole Wide World (1996). He auditioned Zellweger and was sure he'd found his Dorothy Boyd. Renée followed her huge success with a few small independent films and after receiving further critical praise, she felt confident enough to reenter the world of big-budget Hollywood films. She starred opposite Meryl Streep in the tear-jerker One True Thing (1998). She also took a role in Me, Myself & Irene (2000), opposite Jim Carrey, and soon after began dating Carrey. The two denied their relationship at first, but finally gave in and admitted it; today they are no longer together. Also in 2000, she starred in the title role in Nurse Betty (2000), where she won a Golden Globe for Best Actress in a Comedy/Musical. In 2001, she received even more critical and commercial success in the title role in Bridget Jones's Diary (2001). She received her first Academy Award nomination for her role, which was followed by her second Oscar-nominated role in the musical Chicago (2002). She then again wowed audiences with her fierce yet warm portrayal of Ruby Thewes in the film adaptation of Cold Mountain (2003), which won Zellweger an Oscar for Best Supporting Actress, which was her first Academy Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzYwMDI2OF5BMl5BanBnXkFtZTgwMzg3NjYwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000250","name":"Renée Zellweger","nicknames":["Zelly"],"idIMDB":"nm0000250"},"actorId":"nm0000250","character":"Emily Jenkins","urlCharacter":"http://www.imdb.com/character/ch0142470","main":true},{"actorName":"Jodelle Ferland","urlProfile":"http://www.imdb.com/name/nm0272706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMzQ4ODEzOV5BMl5BanBnXkFtZTcwNzU2MjUzNw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1994","placeOfBirth":" Nanaimo, British Columbia, Canada","birthName":"Jodelle Micah Ferland","height":"5' 2\" (1.57 m)","bio":"Jodelle Micah Ferland has built up an impressive resume filled with roles in film, television and, at the beginning of her career, commercials. Born on October 9, 1994, she got her start in an episode of CTV's Cold Squad, brigade spéciale (1998), before landing the lead role in her first film, Mermaid (2000) at an early age. Her portrayal of the heartbroken \"Desi\" earned her a Daytime Emmy Award nomination, making her the youngest nominee in history, as well as a Young Artist Award. Since then, she has appeared in films including They (2002), Trapped (2001) and Carrie (2002), and has made appearances on Smallville (2001), Dark Angel (2000) and The Collector (2004). She can also be seen starring in Stephen King's Kingdom Hospital (2004), playing a tortured young girl who haunts the hospital's halls. In 2004, she landed the lead role of \"Jeliza-Rose\" in Terry Gilliam's Tideland (2005), a film about a disturbed young girl who finds solace in her own imagination after the death of her parents. Several roles have followed, including taking on three characters in the horror, Silent Hill (2006), a despondent foster child in Hallmark's Pictures of Hollis Woods (2007), starring with Renée Zellweger in Case 39 (2009), Matthew Broderick's dour daughter in Wonderful World (2009), and a surprise character in Drew Goddard and Joss Whedon's The Cabin in the Woods (2012). Her latest role is playing the newly-turned vampire, \"Bree\", on the highly anticipated \"Twilight\" movie, The Twilight Saga: Eclipse (2010). When not performing, Jodelle spends her time in gymnastics and art. She played violin when she was younger but now is learning guitar. She also loves to hang out with her family and friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMzQ4ODEzOV5BMl5BanBnXkFtZTcwNzU2MjUzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272706","name":"Jodelle Ferland","idIMDB":"nm0272706"},"actorId":"nm0272706","character":"Lilith Sullivan","urlCharacter":"http://www.imdb.com/character/ch0077006","main":true},{"actorName":"Ian McShane","urlProfile":"http://www.imdb.com/name/nm0574534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1942","placeOfBirth":" Blackburn, Lancashire, England, UK","height":"5' 7½\" (1.71 m)","bio":"From a lawless, foul-mouthed saloon owner in \"Deadwood\" to a tough no-nonsense British gangster in \"Sexy Beast,\" Ian McShane has virtually cornered the market on playing rogues, villains and all-around bad asses. A natural at portraying complex anti-heroes and charismatic heavies, the classically trained actor was born in Blackburn, Lancashire, England, to parents Irene (Cowley) and Harry McShane, a soccer player for Manchester United. McShane caught his first break in 1962 when he landed a lead role in \"The Wild and the Willing.\" McShane later revealed that he had ditched class at the Royal Academy of Dramatic Art to audition for the role. Since then, the award-winning actor has gone on to grab the attention of audiences and critics alike with his unforgettable portrayals of scoundrels, kings, killers, and thieves. Coming soon, McShane will be reprising his role as club owner/ex-assassin Winston opposite Keanu Reeves in \"John Wick: Chapter 2\" in the film by director Chad Stahelski. He plays Leland, a retired sheriff with violent tendencies, opposite Patrick Wilson in \"The Hollow Point,\" the gritty drama directed by Gonzalo López-Gallego. Also, expect to see McShane in the upcoming films \"Jawbone,\" \"Bolden!\" and opposite Michael Shannon in \"Pottersville.\" On television, McShane next stars as Mr. Wednesday in Neil Gaiman's \"American Gods,\" the highly-anticipated event series for Starz produced by Michael Green and Bryan Fuller. \"Actor. Icon. And now god. It is a goddamn delight to be collaborating with the incomparable Ian McShane,\" said Michael Green recently. McShane previously starred in the Michael Green series \"Kings\" for NBC. McShane will also be seen opposite Dr. Dre for Apple TV's first scripted series \"Vital Signs,\" a semi-autobiographical series loosely based on the hip-hop icon's life. McShane's formidable acting resume is as long as it is varied. McShane starred as the notoriously fearsome pirate Blackbeard opposite Johnny Depp in Disney's worldwide blockbuster hit \"Pirates of the Caribbean: On Stranger Tides.\" He starred as priest/prophet/warrior Amphiarus opposite Dwayne Johnson in MGM's \"Hercules,\" played lead dwarf Beith in the dark fantasy flick \"Snow White and the Huntsman,\" and portrayed good King Bramwell in Bryan Singer's modern-day fairytale \"Jack the Giant Slayer.\" McShane also appeared as Joe Strombel in Woody Allen's \"Scoop.\" His universally praised performance as tough guy Teddy Bass in the cult indie hit \"Sexy Beast\" led one London critic to dub McShane as \"The King of Cool.\" In a change of pace, he portrayed soft-spoken Meredith in the darkly perverse crime drama \"44 Inch Chest,\" a film in which McShane not only starred, but also produced. McShane has also had a long and diverse career on both British and American television. Earning considerable critical acclaim as the fierce yet charismatic Al Swearengen in the much-loved David Milch HBO series \"Deadwood,\" McShane went on to win the Golden Globe Award for Best Performance by an Actor in a Drama Series. His compelling and gritty portrayal also scored him nominations for both Emmy and SAG Awards. He went on to collect yet another Golden Globe nomination for Best Actor in a Miniseries for his riveting portrayal of the scheming, corrupt Waleran Bigod in Starz' Emmy-nominated \"Pillars of the Earth.\" McShane also won over viewers in FX's \"American Horror Story\" as the very bad Santa/serial killer Leigh Emerson and as cold-blooded billionaire Andrew Finney opposite Liev Schreiber in Showtime's acclaimed series \"Ray Donovan.\" More recently, he portrayed Sir Roger Scatcherd in the Julian Fellows' miniseries \"Dr. Thorne\" for ITV and also made an appearance as peacenik Brother Ray in HBO's juggernaut \"Game of Thrones.\" Earlier in his television career McShane produced and starred as the irresistible rogue antiques dealer in the acclaimed series \"Lovejoy\" for the BBC and A&E, even directing several episodes himself. The show was one of the first independent co-productions with the BBC and aired in both the U.S. and U.K. Other notable portrayals on television have included his appearance in the landmark, blockbuster miniseries \"Roots\" and as Ken Harrison in \"Whose Life is it Anyway?\" McShane also played Sejanus in the miniseries \"A.D.,\" the eponymous \"Disraeli,\" produced by Masterpiece Theater, and Judas in NBC's \"Jesus of Nazareth.\" An accomplished, award-wining stage actor, McShane made his West End debut in \"The Promise,\" co-starring Dame Judi Dench and Sir Ian McKellen. The play went on to open on Broadway the following year. McShane also charmed audiences in the West End musical \"The Witches of Eastwick,\" originating the role of the seductive, sex-obsessed Darryl Van Horne on stage in London. At the esteemed L.A. Matrix Theatre, McShane appeared in Harold Pinter's \"Betrayal,\" Larry Atlas' \"Yield of the Long Bond\", as well as in John Osborne's \"Inadmissible Evidence,\" picking up a couple of Los Angeles Drama Critics' Awards for Lead Performance in the process. In addition, McShane appeared in the 40th Anniversary revival of Harold Pinter's \"The Homecoming\" on Broadway. With his low, distinctive voice, McShane has also made his mark in film and television as a voiceover artist. He narrated Disney's \"The Sorcerer's Apprentice,\" brought life to the eccentric magician Mr. Bobinsky in \"Coraline,\" and added a sinister edge to Tai Lung in \"Kung Fu Panda.\" McShane has also let his rich baritone to \"The Golden Compass,\" as well as to \"Shrek The Third\" as the notorious Captain Hook.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574534","name":"Ian McShane","idIMDB":"nm0574534"},"actorId":"nm0574534","character":"Detective Barron","urlCharacter":"http://www.imdb.com/character/ch0121739","main":true},{"actorName":"Bradley Cooper","urlProfile":"http://www.imdb.com/name/nm0177896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1975","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Bradley Charles Cooper","height":"6' 1\" (1.85 m)","bio":"Bradley Charles Cooper was born in Philadelphia, Pennsylvania. His mother, Gloria (Campano), is of Italian descent, and worked for a local NBC station. His father, Charles John \"Charlie\" Cooper, who was of Irish descent, was a stockbroker. He has a sister, Holly. Immediately after Bradley graduated from the Honors English program at Georgetown University in 1997, he moved to New York City to enroll in the Masters of Fine Arts program at the Actors Studio Drama School at New School University. There, he developed his stage work, culminating with his thesis performance as \"John Merrick\" in Bernard Pomerance's \"The Elephant Man\", performed in New York's Circle in the Square. While still in school, Bradley began his professional career, appearing opposite Sarah Jessica Parker in Sex and the City (1998) and in the series, The Beat (2000). His weekends were spent with LEAP (Learning through the Expanded Arts Program), a non-profit organization that teaches acting and movement to inner city school children. The summers took him all across the globe, from kayaking in British Columbia with Orca Whales to ice-climbing in the Peruvian Andes, while hosting Lonely Planet's Treks in a Wild World (2000) for the Discovery Channel. Bradley had to skip his graduation ceremony from the Actor's Studio in order to star in his first feature film, Wet Hot American Summer (2001). After finishing his second feature, Bending All the Rules (2002), his plans to relocate to Los Angeles were delayed when Darren Star hired him to star in the series The $treet (2000). Bradley went on to win the role of young law student Gordon Pinella in the film Changing Lanes (2002), starring Ben Affleck and Samuel L. Jackson, and also played Travis Paterson in My Little Eye (2002). He finally decided that it was time to forgo his other New York projects and move to Los Angeles when he was cast in Alias (2001). After supporting roles in Wedding Crashers (2005), Failure to Launch (2006), The Comebacks (2007), The Rocker (2008), and Yes Man (2008), Cooper broke out with major roles in He's Just Not That Into You (2009), The Hangover (2009), and Valentine's Day (2010). He co-starred in the action film The A-Team (2010) and headlined the thriller Limitless (2011). Cooper received an Academy Award nomination for Best Actor after starring opposite 'Jennifer Lawrence' in David O. Russell's Silver Linings Playbook (2012), as Pat Solatano. He then received two more consecutive Oscar nominations, Best Supporting Actor for playing Richie DiMaso in Russell's American Hustle (2013) (again opposite Lawrence, though their characters shared no significant screen time), and Best Actor for playing Chris Kyle in Clint Eastwood's American Sniper (2014), the highest grossing film of 2014. During this time period, Cooper also reprised his role in The Hangover Part II (2011) and The Hangover III (2013)_, turned in another strong dramatic turn in The Place Beyond the Pines (2012), and voiced Rocket Raccoon in the third highest grossing film of 2014, Guardians of the Galaxy (2014). In 2015, Bradley headlined two comedies, Cameron Crowe's Aloha (2015), set in Hawaii, and John Wells' Burnt (2015), set in London, and will star opposite Jennifer Lawrence again in David O. Russell's Joy (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177896","name":"Bradley Cooper","nicknames":["Coop"],"idIMDB":"nm0177896"},"actorId":"nm0177896","character":"Doug","urlCharacter":"http://www.imdb.com/character/ch0388779","main":true},{"actorName":"Callum Keith Rennie","urlProfile":"http://www.imdb.com/name/nm0719678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1960","placeOfBirth":" Sunderland, Tyne-and-Wear, England, UK","height":"5' 11\" (1.8 m)","bio":"Callum Keith Rennie was born in England, raised in Alberta, Canada and came late to acting - he discovered theatre in Edmonton at the age of 25. Starting out in university radio and working his way to the renowned Shaw Festival, Callum moved to Vancouver and quickly caught the eye of producers and directors. Currently he lives in Vancouver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719678","name":"Callum Keith Rennie","idIMDB":"nm0719678"},"actorId":"nm0719678","character":"Edward Sullivan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adrian Lester","urlProfile":"http://www.imdb.com/name/nm0504412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxMTU0MTIxMl5BMl5BanBnXkFtZTgwOTcxMjE4ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1968","placeOfBirth":" Birmingham, England, UK","birthName":"Adrian Anthony Lester","height":"6' 1\" (1.85 m)","bio":"Adrian Lester OBE was born on August 14, 1968 in Birmingham, England as Adrian Anthony Lester. He is a multi award winning actor and director, known for seven seasons of the hit TV show Hustle (2004), The Day After Tomorrow (2004) and Primary Colors (1998) and his extensive classical work in the theatre playing Othello, Henry V, Rosalind and Hamlet to name but a few. He is married to actress and writer Lolita Chakrabarti. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxMTU0MTIxMl5BMl5BanBnXkFtZTgwOTcxMjE4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0504412","name":"Adrian Lester","idIMDB":"nm0504412"},"actorId":"nm0504412","character":"Wayne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kerry O'Malley","urlProfile":"http://www.imdb.com/name/nm0641747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTQxOTYwM15BMl5BanBnXkFtZTgwODAxMzY0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Kerry O'Malley was raised in Nashua, NH. She was educated at Duke University and the American Repertory Theater Institute for Advanced Theater Training at Harvard University. She is one of four children. Her film credits include Terminator Genysis with Emilia Clarke and Arnold Schwarzenegger, Annabelle (prequel to The Conjuring), the Disney feature Earth to Echo, Case 39 with Renee Zellweger, The Happening with Mark Wahlberg, Rounders with Matt Damon, and many others. Her television credits include her recent series regular role as forensic pathologist Dr. Mia Vogel on A&E's production of Glen Morgan's Those Who Kill, based on the Danish series Den Som Draeber. She recurred as Kate, the bartender of the Alibi Room, on Showtime's Shameless and she played sister Mary-Kate to the titular brothers of Showtime's acclaimed Brotherhood, created by Blake Masters. She has played recurring roles on Starz' Survivor's Remorse, HBO's Boardwalk Empire, the CW's Hart of Dixie, and has made numerous guest star appearances on such shows as Backstrom, Masters of Sex, Rizzoli & Isles, The Mentalist, Criminal Minds, Detroit 187, Without a Trace, Cold Case, Law & Order, Law & Order: LA, Law & Order: SVU, NYPD Blue, Harry's Law, 666 Park Ave, and many more. Her New York theatre credits include roles on Broadway as Betty Haynes (the Rosemary Clooney role) in Irving Berlin's White Christmas, directed by Walter Bobbie; The Baker's Wife in the 2002 revival of Into the Woods, directed by James Lapine, for which she received Outer Critics and Drama Desk nominations; Dr. Sharone Stein in the recent revival of On a Clear Day You Can See Forever, directed by Michael Mayer; Dolly Tate in Annie Get Your Gun, directed by Graciela Daniele; Billy's Mum in Billy Elliot, directed by Stephen Daldry. Off-Broadway she played Fran Kubelik opposite Martin Short in the acclaimed Encores! revival of Promises, Promises directed by Rob Marshall; Sharon in the Irish Repertory Theatre's production of Finian's Rainbow; and Mary in the Atlantic Theatre Company's Dublin Carol, directed by the author Conor McPherson. She is a huge Boston sports fan and has sung the national anthem for many professional sports teams including the Boston Red Sox at Fenway Park, the Boston Celtics at TD Garden, the Minnesota Wild at Xcel Energy Center and the Pittsburgh Pirates at PNC Park. She resides in Los Angeles with her husband, Writer and Police and Medical Technical Advisor, Karl Sonnenberg. She is the sister of actor and writer Mike O'Malley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTQxOTYwM15BMl5BanBnXkFtZTgwODAxMzY0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641747","name":"Kerry O'Malley","idIMDB":"nm0641747"},"actorId":"nm0641747","character":"Margaret Sullivan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cynthia Stevenson","urlProfile":"http://www.imdb.com/name/nm0828906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODEyMDA2NV5BMl5BanBnXkFtZTgwMjIxNDA0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1962","placeOfBirth":" Piedmont, California, USA","birthName":"Cynthia C. Stevenson","bio":"Cynthia Stevenson was born in Oakland, California, to Al Stevenson, an upholstery warehouse owner and Gayle Stevenson née Boniface, an editor. She moved north with her mother and brother, Gregory, to Bellevue, Washington and then to Vancouver, British Columbia, where she spent most of her childhood. Cynthia took her first step toward an acting career in the University of Victoria's Phoenix Theatre Program. Cynthia returned to California to complete her training, attending the renowned American Conservatory Theatre (ACT) in San Francisco, and the Drama Studio London at Berkeley. After arriving in Los Angeles Cynthia found roles with an improv group and in two local theatre productions, one of which was a long-running hit, The Ladies Room, written and directed by Robin Schiff and produced by Aaron Spelling, which brought Cynthia critical acclaim for her comedic skills. Because of this work, she landed an immediate job on a TV sketch comedy, Off the Wall, where she was featured in 26 episodes. Cynthia quickly built her resume with guest parts on popular sitcoms, including Empty Nest, Teddy Z., Newhart, Major Dad and others. Next came her first starring role as Jennifer Bass in My Talk Show, an original, offbeat nightly series, described as \"the first cult hit\" of the 1990s. It proved to be Cynthia's big break, as director Robert Altman noticed and cast her as Bonnie Sherow, playing opposite Tim Robbins, in his Oscar nominated film, The Player. Legendary TV producers, Cherie and Bill Steinkellner, chose her for a recurring guest spot on their iconic hit series, Cheers. The producers then tapped her for a co-starring role in their next sitcom, Bob, playing Bob Newhart's daughter. That performance inspired the production team to create a new show - Hope & Gloria - especially for Cynthia. Cynthia was the center of a talented cast, including Jessica Lundy, Alan Thicke and Rico Colantoni. When talking about her career path, Cynthia is quick to point out that it was the Steinkellners who gave it direction. With a versatility that moves easily between TV and film, Cynthia had leading roles in character-driven ensemble features, such as the David Brown produced Watch It, Julianna Lavin's Live Nude Girls, Jodie Foster's Home for the Holidays, Billy Crystal's Forget Paris and Todd Solondz's Happiness. She's been a recurring guest on network and cable shows, including Ally McBeal, Monk, Six Feet Under, According to Jim and The L Word. When Lifetime decided to enter into the half hour comedy business, they tapped Cynthia for the lead role in Susan Beavers' Oh Baby, an innovative, first-person take on single motherhood which ran for two years. She then relocated to Vancouver (known as \"Hollywood North\"), where she starred as the troubled Joy Lass in the long-running Showtime favorite Dead Like Me. While working in Vancouver, Cynthia was featured in several family films, including Agent Cody Banks, Agent Cody Banks 2: Destination London and six Air Bud comedies for Disney and in Richard Benjamin's A Little Thing Called Murder opposite Judy Davis. Her roster also expanded with roles in independent films such as Neverwas, Case 39 and Reunion. Before returning to Southern California in 2008, Cynthia was a series regular, playing the feisty female sheriff on ABC's Men in Trees, and also starred in Lifetime TV's Christmas comedy, Will You Merry Me, I Love You Beth Cooper, Jennifer's Body, and the long-awaited Dead Like Me (The Movie). Since relocating back to Los Angeles Cynthia has had guest and recurring roles on such shows as Life Unexpected, Grey's Anatomy and Off the Map as well as co-starring in the ABC series, Surviving Suburbia. Cynthia recently completed the soon to be released feature film Tiger Eyes. Cynthia lives in the Los Angeles area with her husband and son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODEyMDA2NV5BMl5BanBnXkFtZTgwMjIxNDA0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828906","name":"Cynthia Stevenson","idIMDB":"nm0828906"},"actorId":"nm0828906","character":"Nancy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Conti","urlProfile":"http://www.imdb.com/name/nm1265503","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk4OTU1NjEyN15BMl5BanBnXkFtZTgwODY0NTYyNzE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1993","placeOfBirth":" Ontario, Canada","birthName":"Alexander Biagio Conti","height":"5' 7\" (1.7 m)","bio":"Alexander was born on September 1, 1993. He is the youngest of 4 children. Alexander loves to perform and has been involved in many different aspects of acting. His first real acting experience came by way of a Showtime Series, \"Street Time\" (2002)_. It's his greatest desire to continue acting. He also aspires to be a writer and to direct someday. He has a passion for music as well. His other interests include sports, outdoor activities and travel. He also loves to sing karaoke with his friends and family. He loves a challenge as he can be very competitive.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk4OTU1NjEyN15BMl5BanBnXkFtZTgwODY0NTYyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1265503","name":"Alexander Conti","nicknames":["Xander","Lex","Big Al"],"idIMDB":"nm1265503"},"actorId":"nm1265503","character":"Diego","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Cabrita","urlProfile":"http://www.imdb.com/name/nm2074440","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzY1MjQ2NF5BMl5BanBnXkFtZTgwMjQzMTk3NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1974","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Philip M. Cabrita","height":"5' 9\" (1.75 m)","bio":"Philip Cabrita was born on October 10, 1974 in Vancouver, British Columbia, Canada as Philip M. Cabrita. He is an actor, known for Case 39 (2009), Kindergarten Cop 2 (2016) and Moments (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzY1MjQ2NF5BMl5BanBnXkFtZTgwMjQzMTk3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2074440","name":"Philip Cabrita","nicknames":["Flipout"],"idIMDB":"nm2074440"},"actorId":"nm2074440","character":"Javier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vanesa Tomasino","urlProfile":"http://www.imdb.com/name/nm1500694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MTc4MzU4OV5BMl5BanBnXkFtZTgwNzEzOTA3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1981","placeOfBirth":" San Salvador, El Salvador","height":"5' 4\" (1.63 m)","bio":"Vanesa Maria Tomasino Rodríguez was born and raised in El Salvador, Central America. Her acting work includes: a supporting lead role in the Syfy TV Movie \"Chupacabra vs the Alamo\" alongside Erik Estrada and Julia Benson; A recurring role in the animated series'Martha Speaks'(Carolina); a lead role in 'A girl like me: The Gwen Araujo Story'(Directed by Agnieszka Holland); and the Hallmark TV movies 'Mr. Miracle' and 'The most wonderful time of the year.' Vanesa was also the host for the TV show world.beats and a radio personality for the Beat 94.5 FM in Vancouver,Canada. Vanesa has a Master's degree in Political Science and is currently a Political Science PhD candidate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MTc4MzU4OV5BMl5BanBnXkFtZTgwNzEzOTA3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1500694","name":"Vanesa Tomasino","nicknames":["Vane"],"idIMDB":"nm1500694"},"actorId":"nm1500694","character":"Javier's Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Black","urlProfile":"http://www.imdb.com/name/nm0085420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzA2ODIzMl5BMl5BanBnXkFtZTgwMjQyMDQ3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1935","placeOfBirth":" Oshawa, Ontario, Canada","birthName":"Mary Carter Walsh","height":"5' 3\" (1.6 m)","bio":"Mary Black is an established Canadian theatrical, film and television actress. She moved west to Vancouver from Toronto in 1995 seeking new adventures, then decided one rainy afternoon to restart the acting career she had left in 1970 to raise her children. It was a good decision, and at the right time. Work started coming in with varied and interesting roles - nuns, judges, vampires, cult leaders and rulers of far away planets (Man of Steel). She has shared the screen with some of Hollywood's top actors, including Russell Crowe, Colin Firth, Nicholas Cage, William H. Macy, Helen Mirren, Renee Zellwigger, Scott Bakula, and Christopher Lloyd. She has worked with directors Bruce Beresford, Neil LaBute, Jake Snyder (Man of Steel), Jerry Ciccoritti, and Jason Reitman (Juno). In addition to a rich film and television career, Mary has, through the years, satisfied her first love of the theatre by appearing in a variety of new works along with the classics, including staged readings of Shakespeare with the Savage God Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzA2ODIzMl5BMl5BanBnXkFtZTgwMjQyMDQ3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085420","name":"Mary Black","idIMDB":"nm0085420"},"actorId":"nm0085420","character":"Custody Judge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Domenico D'Ambrosio","urlProfile":"http://www.imdb.com/name/nm0195089","urlPhoto":"","biography":{"dateOfBirth":"30 August 1973","placeOfBirth":" Flörsheim am Main, Hesse, Germany","bio":"Domenico D'Ambrosio was born on August 30, 1973 in Flörsheim am Main, Hesse, Germany. He is an actor and producer, known for Pandorum (2009), Case 39 (2009) and Antibodies (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0195089","name":"Domenico D'Ambrosio","idIMDB":"nm0195089"},"actorId":"nm0195089","character":"Plainclothes Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benita Ha","urlProfile":"http://www.imdb.com/name/nm0351699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQwMzE4OF5BMl5BanBnXkFtZTcwNzYzNTY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Her acting career began in Halifax when she was a series regular host on the CBC National award-winning teen show,Street Cents (1989), which she was on for 6 years. Since moving to Vancouver she has had Principal and Guest Starring roles in over 30 television episodes including _\"Psych\"(2006)_, and Smallville (2001) and a recurring role on the series V and Stargate SG-1 (1997) . Benita also has over 20 feature film credits to her name including X-Men: L'affrontement final (2006),and her latest feature film,Case 39 (2009) , starring Renée Zellweger, which was just released this January.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQwMzE4OF5BMl5BanBnXkFtZTcwNzYzNTY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0351699","name":"Benita Ha","nicknames":["B"],"idIMDB":"nm0351699"},"actorId":"nm0351699","character":"Therapist","urlCharacter":"http://www.imdb.com/character/ch0352092","main":true},{"actorName":"J. Winston Carroll","urlProfile":"http://www.imdb.com/name/nm0140837","urlPhoto":"","biography":{"bio":"J. Winston Carroll is an actor, known for Case 39 (2009), 3000 Miles to Graceland (2001) and Police Academy (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0140837","name":"J. Winston Carroll","idIMDB":"nm0140837"},"actorId":"nm0140837","character":"Judge","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0795351","urlIMDB":"http://www.imdb.com/title/tt0795351","business":{"budget":{"money":"$26,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,350,570","country":"USA","day":"04","month":"10","year":"2010","remarks":"2,211 Screens"},{"money":"£183,088","country":"UK","day":"07","month":"03","year":"2010","remarks":"151 Screens"}],"gross":[{"money":"$13,248,477","country":"USA","day":"14","month":"11","year":"2010","remarks":""},{"money":"$13,182,174","country":"USA","day":"07","month":"11","year":"2010","remarks":""},{"money":"$13,036,803","country":"USA","day":"31","month":"10","year":"2010","remarks":""},{"money":"$12,711,934","country":"USA","day":"24","month":"10","year":"2010","remarks":""},{"money":"$11,924,115","country":"USA","day":"17","month":"10","year":"2010","remarks":""},{"money":"$9,650,005","country":"USA","day":"10","month":"10","year":"2010","remarks":""},{"money":"$5,350,570","country":"USA","day":"04","month":"10","year":"2010","remarks":""},{"money":"£183,088","country":"UK","day":"07","month":"03","year":"2010","remarks":""}],"weekendGross":[{"money":"$30,028","country":"USA","day":"14","month":"11","year":"2010","remarks":"106 Screens"},{"money":"$70,489","country":"USA","day":"07","month":"11","year":"2010","remarks":"157 Screens"},{"money":"$177,169","country":"USA","day":"31","month":"10","year":"2010","remarks":"406 Screens"},{"money":"$410,404","country":"USA","day":"24","month":"10","year":"2010","remarks":"721 Screens"},{"money":"$1,206,817","country":"USA","day":"17","month":"10","year":"2010","remarks":"1,406 Screens"},{"money":"$2,680,305","country":"USA","day":"10","month":"10","year":"2010","remarks":"2,212 Screens"},{"money":"$5,350,570","country":"USA","day":"04","month":"10","year":"2010","remarks":"2,211 Screens"},{"money":"£183,088","country":"UK","day":"07","month":"03","year":"2010","remarks":"151 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"06","month":"09","year":"2006","remarks":null},null],"copyrightHolder":"(2007) Paramount Pictures Corporation"},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Hawk V-Series Lenses","Arriflex 435, Hawk V-Series Lenses","Arriflex 535B, Hawk V-Series Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["2,985 m (Sweden)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Hawk Scope (anamorphic)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6,2","metascore":"25","filmingLocations":[{"location":"Burbank, California, USA"}],"rated":"R","awards":[{"award":"Fangoria Chainsaw Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Jodelle Ferland","id":"nm0272706","role":null}]}]}]},{"award":"Fright Meter Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Fright Meter Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Ian McShane","id":"nm0574534","role":null}]}]}]},{"award":"Young Artist Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actor","names":[{"name":"Alexander Conti","id":"nm1265503","role":null}]}]}]}],"votes":"63 351","type":"Movie","companyCreditsSimple":[{"idCompany":"co0179341","name":"Paramount Vantage"},{"idCompany":"co0085725","name":"Misher Films"},{"idCompany":"co0017525","name":"Anonymous Content"}],"keywords":{"keywords":["social worker","villainess","female protagonist","spinning in chair","hairy chest","bare chested male","overwork","driving into the sea","house fire","camera shot of feet","screwdriver","breaking down a door","popcorn","thunderstorm","aquarium","falling elevator","umbrella","school bus","extreme close up","ferocious dog","animal attack","tire iron","broken jaw","ice cream cone","supernatural power","drown","pier","arson","demon","sedative","stabbed with a fork","burned to death","telephone call","hornet","child killer","murder","mental institution","detective","child as villain","child abuse","laundry drying on clothes line","digit in title","german shepherd","dog","fear","death","close up of eyes","cityscape","startled","alarm clock","two word title","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:10:40"}}