{"data":{"movies":[{"title":"Brothers","originalTitle":"","year":"2009","releaseDate":"20091204","directors":[{"name":"Jim Sheridan","id":"nm0006487"}],"writers":[{"name":"David Benioff","id":"nm1125275"},{"name":"Susanne Bier","id":"nm0081540"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMTY5MTcxOV5BMl5BanBnXkFtZTcwMTI3MDE3Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Thriller","War"],"plot":"Before leaving on his second tour in Afghanistan, Marine Captain Sam Cahill, a leader, an athlete, a good husband and father, welcomes his screw-up brother Tommy home from prison. He'd robbed a bank. In country, Sam's helicopter is shot down and all are presumed dead. Back home, while Sam wastes away as a prisoner in a remote encampment, Tommy tries to take care of the widow and her two children. While imprisoned, Sam experiences horrors unbearable, so when he's rescued and returns home, he's silent, detached, without affect, and he's convinced his wife and brother have slept together. Demons of war possess him; what will silence them?","simplePlot":"A young man comforts his older brother's wife and children after he goes missing in Afghanistan.","actors":[{"actorName":"Tobey Maguire","urlProfile":"http://www.imdb.com/name/nm0001497","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTI5NTM2OF5BMl5BanBnXkFtZTcwODk3MDQ2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1975","placeOfBirth":" Santa Monica, California, USA","birthName":"Tobias Vincent Maguire","height":"5' 8\" (1.73 m)","bio":"Tobias Vincent Maguire was born in Santa Monica, California. His parents were 18 and 20, and not yet married, when he was born. His mother, Wendy (Brown), did advertising, publicity, and acting in Hollywood for years as she coached and managed Tobey. His father, Vincent Maguire, was a cook and sometimes a construction worker. Tobey did not finish high school in order to pursue and focus on acting roles, but he did end up getting his GED. He did several commercials (he was a model dancer for Nordstrom by age six), and he had some roles on various TV shows before landing a starring role on the Fox comedy Great Scott! (1992). That role lasted nine weeks before the show was canceled. Fox-made series were not doing well in general at the time. He avoids drugs and alcohol, and his best friend is Leonardo DiCaprio. Tobey is a vegan and studies yoga. He now has two beautiful children with his wife Jennifer Meyer Maguire. Their names are Ruby Sweetheart and Otis Tobias Maguire. Another little known fact is that his two half-brothers, Jopaul and Weston Epp, were the child actors who handed Tobey (Peter Parker) his mask after the train scene in Spider-Man 2.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTI5NTM2OF5BMl5BanBnXkFtZTcwODk3MDQ2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001497","name":"Tobey Maguire","idIMDB":"nm0001497"},"actorId":"nm0001497","character":"Capt. Sam Cahill","urlCharacter":"http://www.imdb.com/character/ch0151152","main":true},{"actorName":"Jake Gyllenhaal","urlProfile":"http://www.imdb.com/name/nm0350453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA0MTU2NDY3MF5BMl5BanBnXkFtZTgwNDU4ODkzMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Jacob Benjamin Gyllenhaal","height":"5' 11\" (1.8 m)","bio":"Jacob Benjamin Gyllenhaal was born in Los Angeles, to producer/screenwriter Naomi Foner (née Achs) and director Stephen Gyllenhaal. He is the brother of actress Maggie Gyllenhaal, who played his sister in Donnie Darko (2001). His godmother is actress Jamie Lee Curtis. His mother is from a Jewish family, and his father's ancestry includes Swedish, English, and Swiss-German. Gyllenhaal made his movie debut, at the age of eleven, in the film City Slickers (1991), playing Billy Crystal's character's son. He made an impact in various films in the late 1990s and early 2000s, in films such as October Sky (1999), his breakthrough performance, and as the title role in the cult phenomenon psychological thriller, Donnie Darko (2001), for which he received an Independent Spirit Award nomination for Best Actor, playing a psychologically troubled teenager. He followed this with roles encompassing many different genres, including the comedy film, Walt Disney romantic comedy, Bubble Boy (2001); opposite Jennifer Aniston in another Sundance favorite, The Good Girl (2002), as a young man grieving the death of his fiancée in Moonlight Mile (2002), and in the science fiction blockbuster, The Day After Tomorrow (2004), portraying a student caught in a cataclysmic climate event, opposite Dennis Quaid. Making his theater debut, Gyllenhaal appeared on the London stage with a starring role in Kenneth Lonergan's revival of \"This Is Our Youth\". The play was widely-received and played for eight weeks in London's West End. Gyllenhaal followed his successful theater en devour with a role in Jarhead (2005), playing Anthony \"Swoff\" Swofford, an aggressive and masculine but equally vulnerable and sensitive Marine during the Gulf War, and Proof (2005), as Gwyneth Paltrow's character's love interest. However, it was his follow-up performance that won critical acclaim in Brokeback Mountain (2005), in which he co-starred with Australian actor Heath Ledger, as sheep herders who fall in love in the 1960s and depicts their relationship over the 1960s, 1970s and early 1980s. For his role as Jack Twist, Gyllenhaal received critical acclaim and won the BAFTA Award for Best Actor in a Supporting Role and was nominated for the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role, the Satellite Award for Best Supporting Actor - Motion Picture, and the Academy Award for Best Supporting Actor. Since then, he has acted in a wide range of movies, ranging from the critically-acclaimed thriller, Zodiac (2007), the drama Brothers (2009), playing opposite Tobey Maguire as the title siblings, in the action adventure film, Prince of Persia: The Sands of Time (2010), sporting a bulked-up physique, and the box office hit, Love & Other Drugs (2010), in which he teamed up with Anne Hathaway, once again, and for which he was nominated for a Golden Globe Award for Best Actor - Motion Picture Musical or Comedy. In the 2010s, Gyllenhaal starred in several major films for which he received significant critical acclaim: science fiction thriller Source Code (2011), police drama End of Watch (2012), mystery Prisoners (2013), dark media satire Nightcrawler (2014), the boxing drama Southpaw (2015), and the dramedy Demolition (2015). For Nightcrawler, he was nominated for the Golden Globe Award for Best Actor - Motion Picture Drama, the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role, and the BAFTA Award for Best Actor in a Leading Role. Gyllenhaal is the godfather of Matilda Ledger (aka Matilda Rose Ledger), daughter of the late actor Heath Ledger and Michelle Williams. Gyllenhaal's most significant personal relationships have been with actresses Kirsten Dunst and Reese Witherspoon. He is friends with Maroon 5 front-man Adam Levine, having known him since kindergarten. He is a good friend of his sister's husband and Jarhead (2005) co-star, actor Peter Sarsgaard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA0MTU2NDY3MF5BMl5BanBnXkFtZTgwNDU4ODkzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0350453","name":"Jake Gyllenhaal","idIMDB":"nm0350453"},"actorId":"nm0350453","character":"Tommy Cahill","urlCharacter":"http://www.imdb.com/character/ch0122671","main":true},{"actorName":"Natalie Portman","urlProfile":"http://www.imdb.com/name/nm0000204","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODE3Mjg1NV5BMl5BanBnXkFtZTcwNzA4ODcxNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1981","placeOfBirth":" Jerusalem, Israel","birthName":"Natalie Hershlag","height":"5' 3\" (1.6 m)","bio":"Natalie Portman is the first person born in the 1980s to have won the Academy Award for Best Actress (for Black Swan (2010)). Natalie was born Natalie Hershlag on June 9, 1981, in Jerusalem, Israel, to a Jewish family. She is the only child of Avner Hershlag, an Israeli-born doctor, and Shelley Stevens, an American-born artist (from Cincinnati, Ohio), who also acts as Natalie's agent. She left Israel for Washington, D.C., when she was still very young. After a few more moves, her family finally settled in New York, where she still lives to this day. She graduated with honors, and her academic achievements allowed her to attend Harvard University. She was discovered by an agent in a pizza parlor at the age of 11. She was pushed towards a career in modeling but she decided that she would rather pursue a career in acting. She was featured in many live performances, but she made her powerful film debut in the movie Léon: The Professional (1994) (aka \"Léon\"). Following this role Natalie won roles in such films as Heat (1995), Beautiful Girls (1996), and Mars Attacks! (1996). It was not until 1999 that Natalie received worldwide fame as Queen Amidala in the highly anticipated US$431 million-grossing prequel Star Wars: Episode I - The Phantom Menace (1999). She then she starred in two critically acclaimed comedy dramas, Anywhere But Here (1999) and Where the Heart Is (2000), followed by Closer (2004), for which she received an Oscar nomination. She reprised her role as Padme Amidala in the last two episodes of the Star Wars prequel trilogy: Star Wars: Episode II - Attack of the Clones (2002) and Star Wars: Episode III - Revenge of the Sith (2005). She received an Academy Award and a Golden Globe Award for Best Actress in Black Swan (2010). She received a second nomination for Best Actress, for playing Jacqueline Kennedy in Jackie (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODE3Mjg1NV5BMl5BanBnXkFtZTcwNzA4ODcxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000204","name":"Natalie Portman","nicknames":["Nat"],"idIMDB":"nm0000204"},"actorId":"nm0000204","character":"Grace Cahill","urlCharacter":"http://www.imdb.com/character/ch0123417","main":true},{"actorName":"Sam Shepard","urlProfile":"http://www.imdb.com/name/nm0001731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzM1Nzg1OV5BMl5BanBnXkFtZTcwOTYzMDAxMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1943","placeOfBirth":" Fort Sheridan, Illinois, USA","birthName":"Samuel Shepard Rogers","height":"6' 2\" (1.88 m)","bio":"Sam Shepard was born Samuel Shepard Rogers in Fort Sheridan, Illinois, to Jane Elaine (Schook), a teacher, and Samuel Shepard Rogers, a teacher and farmer who was also in the army. As the eldest son of a US Army officer (and WWII bomber pilot), Shepard spent his early childhood moving from base to base around the US until finally settling in Duarte, California. While at high school he began acting and writing and worked as a ranch hand in Chino. He graduated high school in 1961 and then spent a year studying agriculture at Mount San Antonio Junior College, intending to become a vet. In 1962, though, a touring theater company, the Bishop's Company Repertory Players, visited the town and he joined up and left home to tour with them. He spent nearly two years with the company and eventually settled in New York where he began writing plays, first performing with an obscure off-off-Broadway group but eventually gaining recognition for his writing and winning prestigious OBIE awards (Off-Broadway ) three years running. He flirted with the world of rock, playing drums for the Holy Modal Rounders, then moved to London in 1971 where he continued writing. Back in the US by 1974, he became playwright in residence at San Francisco's Magic Theater and continued to work as an increasingly well respected playwright throughout the 1970s and into the '80s. Throughout this time he had been dabbling with Hollywood having, most notably in the early days, worked as one of the writers on Zabriskie Point (1970), but it was his role as Chuck Yeager in 1983's The Right Stuff (1983) that brought him fully to the attention of the wider, non-theater audience. Since then he has continued to write, act and direct, both on screen and in the theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzM1Nzg1OV5BMl5BanBnXkFtZTcwOTYzMDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001731","name":"Sam Shepard","nicknames":["Charlie"],"idIMDB":"nm0001731"},"actorId":"nm0001731","character":"Hank Cahill","urlCharacter":"http://www.imdb.com/character/ch0155704","main":true},{"actorName":"Mare Winningham","urlProfile":"http://www.imdb.com/name/nm0001858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjgxMV5BMl5BanBnXkFtZTcwMDM2MTA4MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1959","placeOfBirth":" Phoenix, Arizona, USA","birthName":"Mary Megan Winningham","height":"5' 6\" (1.68 m)","bio":"Mary 'Mare' Megan Winningham is an actress and songwriter who has appeared in nearly 100 TV shows and feature films. She began her career in 1976 as a singer, and starred in numerous and diverse film roles before hitting it big as one of the original Brat Pack in Joel Schumacher's St. Elmo's Fire (1985) with Emilio Estevez, Andrew McCarthy, Demi Moore, Judd Nelson, and Ally Sheedy. Mare attended Chatsworth High School with Val Kilmer, James Rekart and Kevin Spacey, but she was bitten by the acting bug much earlier on. She had enjoyed drama and music since primary school, taking a particular interest in the guitar and drums. Since St. Elmo's Fire (1985), Mare has played some outstanding roles in a number of big films. She starred in the Tom Hanks comedy Turner & Hooch (1989). She has also starred in two feature films with Kevin Costner, The War (1994) and the western Wyatt Earp (1994), the latter directed by Lawrence Kasdan and co-starring Gene Hackman. Mare won a Best Supporting Actress Oscar nomination for her role opposite Jennifer Jason Leigh in Georgia (1995). Bad Day on the Block (1997) saw her starring opposite Charlie Sheen and she put in a superb performance in Brothers (2009), a war drama co-starring Tobey Maguire and Natalie Portman. Her myriad TV roles include ER (1994), Grey's Anatomy (2005), and 24 (2001) with Kiefer Sutherland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODU1NjgxMV5BMl5BanBnXkFtZTcwMDM2MTA4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001858","name":"Mare Winningham","idIMDB":"nm0001858"},"actorId":"nm0001858","character":"Elsie Cahill","urlCharacter":"http://www.imdb.com/character/ch0232120","main":true},{"actorName":"Bailee Madison","urlProfile":"http://www.imdb.com/name/nm1933128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNGQ0YzEtZjRiOS00Y2JmLWJiMzctMWRmZDFkZGMyNmNkL2ltYWdlXkEyXkFqcGdeQXVyMTAwNjAwODg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1999","placeOfBirth":" Fort Lauderdale, Florida, USA","birthName":"Bailee Rose Madison","height":"5' 6\" (1.68 m)","bio":"This young actress has worked with a number of the industry's biggest stars in a variety of diverse and challenging roles. She won rave reviews and a Critics Choice Movie Award nomination for her powerful work on the feature film, Brothers (2009), opposite Tobey Maguire, Natalie Portman and Jake Gyllenhaal. She played the young \"Betty Ann Waters\" in Fox Searchlight's Conviction (2010), with Hilary Swank and Minnie Driver. Most recently, Bailee had a starring role in producer Guillermo del Toro's thriller, Don't Be Afraid of the Dark (2010), with Katie Holmes and Guy Pearce, Bailee was recommended for the role by her Brothers (2009) co-star, Natalie Portman. She played a withdrawn child being haunted by insatiable demons; the film was released in August 2011. Bailee starred as the daughter of Marisa Tomei and the granddaughter of Bette Midler and 'Billy Crystal' (qvi) in the film Parental Guidance (2012), a co-production between 20th Century Fox and Walden Media. In 2011, Variety named Bailee an honoree for her philanthropic efforts with \"Alex's Lemonade Stand\" at the \"Variety Power Of Youth Awards\", which pays homage to the industry's most talented young activists. A driven and talented young actress, Bailee is equally committed to using her public profile to raise awareness for those less fortunate. Between filming major motion pictures, Bailee has been devoting her time and energy to \"Alex's Lemonade Stand\", an organization that encourages children, nationwide, to raise money to find a cure for childhood cancer through running their own lemonade stands. Her other feature films include Letters to God (2010) and Hallmark's A Taste of Romance (2012) with Teri Polo. For her role in Columbia Pictures' comedy, Just Go with It (2011), with Adam Sandler and Jennifer Aniston, Bailee earned rave reviews with \"The Wall Street Journal\". Bailee captured audiences hearts with her role of \"May Belle Aarons\" in Disney's Bridge to Terabithia (2007), and has left lasting impressions with her performances in the independent film, Phoebe in Wonderland (2008) (starring Felicity Huffman and Elle Fanning), and on television in NBC's Law & Order: Special Victims Unit (1999). She appears as \"Maxine Russo\" in Disney Channel's Wizards of Waverly Place (2007), for its fourth and final season. When Bailee isn't working or studying, she loves cooking with her family. When Bailee's not traveling, she loves spending time at home with family and friends, barbecuing, swimming, and playing on her swing set. Of course her dog, Maddy, is always by her side.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNGQ0YzEtZjRiOS00Y2JmLWJiMzctMWRmZDFkZGMyNmNkL2ltYWdlXkEyXkFqcGdeQXVyMTAwNjAwODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1933128","name":"Bailee Madison","nicknames":["Bail","Bailes","Bay Bay"],"idIMDB":"nm1933128"},"actorId":"nm1933128","character":"Isabelle Cahill","urlCharacter":"http://www.imdb.com/character/ch0170656","main":true},{"actorName":"Taylor Geare","urlProfile":"http://www.imdb.com/name/nm2855622","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWYwNWZjZDQtZTFmMi00ODY3LWEzYmUtNDJhNDBiMTE0ZjY0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 2001","placeOfBirth":"","birthName":"Taylor Grace Geare","height":"5' 1½\" (1.56 m)","bio":"Taylor Geare was born on September 19, 2001 as Taylor Grace Geare. She is an actress, known for Inception (2010), Brothers (2009) and Dream House (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWYwNWZjZDQtZTFmMi00ODY3LWEzYmUtNDJhNDBiMTE0ZjY0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2855622","name":"Taylor Geare","idIMDB":"nm2855622"},"actorId":"nm2855622","character":"Maggie Cahill","urlCharacter":"http://www.imdb.com/character/ch0221724","main":true},{"actorName":"Patrick John Flueger","urlProfile":"http://www.imdb.com/name/nm1005514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1MjcyMTM5NV5BMl5BanBnXkFtZTgwNzgyMzA2NTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1983","placeOfBirth":" Red Wing, Minnesota, USA","height":"6' (1.83 m)","bio":"Patrick John Flueger was born on December 10, 1983 in Red Wing, Minnesota, USA. He is an actor, known for Chicago P.D. (2014), Brothers (2009) and The Princess Diaries (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1MjcyMTM5NV5BMl5BanBnXkFtZTgwNzgyMzA2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1005514","name":"Patrick John Flueger","idIMDB":"nm1005514"},"actorId":"nm1005514","character":"Private Joe Willis","urlCharacter":"http://www.imdb.com/character/ch0172285","main":true},{"actorName":"Clifton Collins Jr.","urlProfile":"http://www.imdb.com/name/nm0004286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODQwMTg2Ml5BMl5BanBnXkFtZTcwMDE3OTU2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1970","placeOfBirth":" Los Angeles, California, USA","birthName":"Clifton Craig Collins Jr.","height":"5' 8\" (1.73 m)","bio":"An acting chameleon who can easily lose himself in the life of his film and television characters, Clifton Collins Jr. is a native Angeleno who grew up destined to become a part of the Latino entertainment industry. His great-grandparents on his mother's side were a Mexican trumpet player and Spanish dancer who formed a traveling family act, and his grandfather was well-known character actor Pedro Gonzalez Gonzalez, most famous for his humorous sidekick roles in 1950s/1960s John Wayne westerns (he played the excitable hotel keeper in Rio Bravo (1959)) and in sitcoms. His uncle and aunt dabbled in the business at one point as well. While his famous grandfather was unable to break out of the old unflattering Latino stereotypes, Collins Jr. has done Pedro proud in the new millennium. Playing everything from policemen to boxers to serial killers, he has managed to transcend the typical racial trappings of his grandfather's era and play flesh-and-blood, three-dimensional characters. It was not always that way. Born short, lean and mean on June 16, 1970, he started his career in 1988 using his real name of Collins, but two years later began billing himself as \"Clifton Gonzales-Gonzales\" as a tribute to his aged grandfather and his early accomplishments. Pedro, who died in 2006, lived long enough to witness his grandson's achievements. Toiling in typical \"barrio\" roles at the beginning of his career, Collins Jr. found himself stuck in bit parts either as a struggling blue-collar worker or urban thug. In the mid-1990s, he began to search out and wing standout roles that enabled him to break the confines of the Latino stereotype. He slowly moved up in billing, even in mediocre material such as the futuristic prison film Fortress (1992) and the mindless 1970s rock-era comedy The Stöned Age (1994). His breakout role as Cesar, the vicious student and gangbanger in One Eight Seven (1997) opposite Los Angeles substitute teacher Samuel L. Jackson, set him on the right path. This led to a mesmerizing collection of other portrayals, both good-guy and bad-guy, in such films as The Replacement Killers (1998), The Wonderful Ice Cream Suit (1998) and Tigerland (2000). His versatility finally tested, he played everything from a gay Mexican hitman in the critically acclaimed Traffic (2000) to a psychological profiler for the FBI in the mainstream actioner Profession profiler (2004). A number of top guest appearances came his way on such series as NYPD Blue (1993) and La treizième dimension (2002) and he had recurring roles on Resurrection Blvd. (2000) and Alias (2001). A monumental shift forward in his career happened recently with his hypnotic portrayal of killer Perry Smith, the object of writer Truman Capote's obsession, in the art-house favorite Capote (2005). Decades ago, Robert Blake played the same part in the gripping Capote book-to-film In Cold Blood (1967). This heralded achievement has enabled Collins to move into the co-producer's chair of late, notably for Rampage: The Hillside Strangler Murders (2006), in which he inhabits the role of serial killer Kenneth Bianchi. Obviously, there is plenty more in the works for this major talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODQwMTg2Ml5BMl5BanBnXkFtZTcwMDE3OTU2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004286","name":"Clifton Collins Jr.","idIMDB":"nm0004286"},"actorId":"nm0004286","character":"Major Cavazos","urlCharacter":"http://www.imdb.com/character/ch0150862","main":true},{"actorName":"Carey Mulligan","urlProfile":"http://www.imdb.com/name/nm1659547","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODM0OTY4OF5BMl5BanBnXkFtZTgwMTg3NDk0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1985","placeOfBirth":" Westminster, London, England, UK","birthName":"Carey Hannah Mulligan","height":"5' 7\" (1.7 m)","bio":"Carey Mulligan is a British actress, born May 28, 1985, in Westminster, London, England, to Nano (Booth), a university lecturer, and Stephen Mulligan, a hotel manager. Her father is of Irish descent and her mother is Welsh, originally from Llandeilo. Her first major appearance was playing Kitty Bennet in Pride & Prejudice (2005) alongside Keira Knightley, Judi Dench and Donald Sutherland. Carey also played orphan \"Ada Clare\" in the B.B.C. television series, Bleak House (2005). Carey has said that her passion and love for acting was first kindled at her old school Woldingham School, where she took part in a school production of \"Sweet Charity\" in her final year, and where she was also a student head of drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODM0OTY4OF5BMl5BanBnXkFtZTgwMTg3NDk0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1659547","name":"Carey Mulligan","idIMDB":"nm1659547"},"actorId":"nm1659547","character":"Cassie Willis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Omid Abtahi","urlProfile":"http://www.imdb.com/name/nm1859475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzM2ODQyNF5BMl5BanBnXkFtZTcwMzc3ODAzMQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"bio":"Omid Abtahi is known for his work on Argo (2012), Brothers (2009) and The Hunger Games: Mockingjay - Part 2 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzM2ODQyNF5BMl5BanBnXkFtZTcwMzc3ODAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1859475","name":"Omid Abtahi","idIMDB":"nm1859475"},"actorId":"nm1859475","character":"Yusuf","urlCharacter":"http://www.imdb.com/character/ch0232122","main":true},{"actorName":"Navid Negahban","urlProfile":"http://www.imdb.com/name/nm1041023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E0M2Q4MGEtZmU4MC00YTVlLWI5YzYtNzNhNjc4OTU5NjI5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1968","placeOfBirth":" Iran","height":"5' 11¾\" (1.82 m)","bio":"Navid, though sometimes called \"the man of a thousand faces,\" is still most widely regarded as Abu Nazir, the enigmatic al-Qaeda leader he played for two seasons on Showtime's Emmy-winning original series \"Homeland.\" Among his many fans are Israeli president Shimon Peres and U.S. president Barack Obama. The versatile, scene-stealer has drawn critical praise as IRK delegate Jamot on the final season of Fox's hit series, \"24,\" and has appeared on \"CSI: NY,\" \"CSI: Miami,\" \"NCIS: Los Angeles,\" \"Law & Order: SVU,\" \"The Closer,\" \"The Game,\" \"Criminal Minds,\" \"Lost,\" \"JAG,\" \"The West Wing,\" \"Without a Trace,\" \"The Shield\" and others. Navid's star continues to rise on the big screen. He was a standout in Clint Eastwood's Oscar-nominated blockbuster \"American Sniper\" as Sheikh Al-Obodi, an Iraqi local paid to help the snipers locate their targets. He can next be seen in \"Baba Joon,\" the first Persian-language film shot in Israel from director Yuval Delshad. \"Variety\" proclaims Navid once again \"transforms in the role of Yitzhak,\" a turkey farmer struggling to pass his Iranian traditions onto his precocious Israeli-born son. The film, which received best picture at Israel's Ophir Awards, is now set to be the Jewish State's submission for the Academy Awards for Best Foreign Film. Navid recently wrapped principal photography in Vancouver on \"Brain on Fire,\" a biographical drama with Chloë Grace Moretz, Carrie-Anne Moss and Richard Armitage, and this spring he was shooting in Morocco with Jonathan Rhys Meyers, John Hurt and Olivia Thirlby in the espionage thriller \"Damascus Cover.\" His additional credits include a leading role in the critically acclaimed feature \"The Stoning of Soraya M.\" The \"New York Times\" called his portrayal of Ali as \"satanic as any horror-movie apparition.\" Navid also had significant supporting roles in the films \"Brothers\" starring Tobey Maguire and Jake Gyllenhaal; \"Powder Blue\" with Jessica Biel and Forest Whitaker; \"Charlie Wilson's War\" starring Tom Hanks, Julia Roberts and Amy Adams and \"Words and Pictures\" with Clive Owens and Juliette Binoche. As an active voice-over actor, he lends his smoky tenor to \"Revolution 1979,\" a video game series based on the Iranian revolution. It was awarded support from the Doris Duke Foundation in partnership with Sundance Institute's New Frontier Program for the Islamic Art's New Frontier Fellowship. Born in Mashhad, Iran, Navid caught the acting bug at the age of eight, when his portrayal of an old man drew laughter from a large audience at an elementary school play. His passion for acting led him to Germany where he spent eight years honing his theatrical skills prior to arriving in the United States. He is fluent in English, Farsi and German, and in his spare time enjoys traveling, studying anthropology, shooting pool, driving and playing poker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E0M2Q4MGEtZmU4MC00YTVlLWI5YzYtNzNhNjc4OTU5NjI5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1041023","name":"Navid Negahban","idIMDB":"nm1041023"},"actorId":"nm1041023","character":"Murad","urlCharacter":"http://www.imdb.com/character/ch0232124","main":true},{"actorName":"Ethan Suplee","urlProfile":"http://www.imdb.com/name/nm0839486","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjkyMzU1MF5BMl5BanBnXkFtZTcwNDAzNDI2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1976","placeOfBirth":" Manhattan, New York, USA","height":"6' 1\" (1.85 m)","bio":"Ethan Suplee has established himself over the past decade as an actor of considerable talent and accomplishment. His diverse and eclectic resume ranges from hilarious roles in such comedies as Mallrats (1995) and Without a Paddle (2004) to hauntingly dramatic performances in intense features such as American History X (1998), Blow (2001) and Cold Mountain (2003). His breakthrough performance as a young football player in Disney's Remember the Titans (2000) with Denzel Washington garnered him critical acclaim and led to another role opposite Washington in director Nick Cassavetes' thriller, John Q (2002). Born in New York and raised in Los Angeles, Suplee is the son of actors Debbie and Bill Suplee. He landed his first role at the age of 16 on the popular television series Boy Meets World (1993). He had a recurring role as the reluctant bully \"Frankie\" for three seasons. Most recently for television, he made a powerful guest-starring appearance on NBC's Third Watch (1999) as a disturbed young man who filmed a video journal about his obsession with a girl. He made his feature film debut in 1995 (alongside My Name Is Earl (2005) co-star Jason Lee) in writer/director Kevin Smith's Mallrats (1995). where he played the memorable 'Willam Black,' a young man determined to crack the mystery behind the mall's magic eye poster. Smith went on to cast Suplee in Chasing Amy (1997) and as the voice of 'Norman the Golgothan' in _Dogma (1998)_. More recent comedy credits include \"Without A Paddle\" with Seth Green and Matthew Lillard, director Todd Phillips Road Trip (2000) and Evolution (2001) for director Ivan Reitman. Suplee showcased his impressive acting chops with a powerful and compelling performance in 1998 in director Tony Kaye's \"American History X.\" He played a carelessly violent racist skinhead who tries to convince his friend (Edward Norton) to \"come back to his roots\" in their gang of white supremacists. His role of high school football lineman \"Louie\" in Disney's \"Remember the Titans\" exposed Suplee to a larger audience, and he was singled out by many critics as a fresh and welcome screen presence, with the Hollywood Reporter calling his performance \"scene-stealing.\" With Ted Demme's 1970s drug-cartel drama \"Blow,\" Suplee continued to raise his profile, playing \"Tuna\", the best friend of Johnny Depp's newly turned drug dealer \"George Jung\". More recently, Suplee played a pivotal role of a young soldier in Miramax and Anthony Minghella's period piece \"Cold Mountain,\" with Jude Law and Nicole Kidman. He also co-starred with Ashton Kutcher in New Line's The Butterfly Effect (2004). Suplee co-stars opposite Jason Lee in NBC and Twentieth Century-Fox TV's half-hour comedy, \"My Name is Earl.\" He plays \"Randy\", the brother of Lee's \"Earl\" who, following an epiphany, embarks on a mission to right all the wrongs he has inflicted on people. For the big screen, Suplee will next be seen starring in Art School Confidential (2006) for director Terry Zwigoff (Ghost World (2001)), and he recently completed work for director Darren Aronofsky on Warner Bros.' The Fountain (2006) with Hugh Jackman and Rachel Weisz. In his spare time, Suplee enjoys reading, cooking and playing chess. He has also recently starting taking Muay Thai kick-boxing classes three times a week. Muay Thai is a form of martial arts boxing using full contact sparring, kicks, punches, kick blocks and shadow boxing learned under professional instruction.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjkyMzU1MF5BMl5BanBnXkFtZTcwNDAzNDI2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0839486","name":"Ethan Suplee","nicknames":["Sups"],"idIMDB":"nm0839486"},"actorId":"nm0839486","character":"Sweeney","urlCharacter":"http://www.imdb.com/character/ch0232125","main":true},{"actorName":"Arron Shiver","urlProfile":"http://www.imdb.com/name/nm1377287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0OTQzMDYzMV5BMl5BanBnXkFtZTgwMDQzODAzOTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1977","placeOfBirth":" Baton Rouge, Louisiana, USA","height":"6' (1.83 m)","bio":"Arron Shiver was born on July 19, 1977 in Baton Rouge, Louisiana, USA. He is an actor and writer, known for Boardwalk Empire (2010), The Men Who Stare at Goats (2009) and 3:10 to Yuma (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0OTQzMDYzMV5BMl5BanBnXkFtZTgwMDQzODAzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1377287","name":"Arron Shiver","idIMDB":"nm1377287"},"actorId":"nm1377287","character":"A.J.","urlCharacter":"http://www.imdb.com/character/ch0232126","main":true},{"actorName":"Ray Prewitt","urlProfile":"http://www.imdb.com/name/nm0696697","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDY4MjgwN15BMl5BanBnXkFtZTcwNTMwMjk5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1970","placeOfBirth":" College Station, Texas, USA","bio":"Ray Prewitt (born March 12, 1970 in College Station, Texas) is an actor, producer, and aircraft broker (Prewitt Aircraft Sales). He is a graduate of Texas A&M University where he interned in the genetics lab at the veterinary school's exotic animal clinic and was a crew chief for the now infamous Aggie Bonfire. Ray is never seen on stage or screen without his Aggie Ring on. He is most famous for deciding to produce his former roommate, Pamela Ribon's (Samantha Who?) \"Call Us Crazy: The Anne Heche Monologues\" which achieved theatrical cult status in Los Angeles in 2003. He was raised in Austin, Texas where he began his acting career starring alongside Amy Ecklund (Guiding Light) in their elementary school production of \"Huck Finn\". Prewitt began performing with various improv troupes around Austin before booking his first small role with Natalie Portman in \"Where the Heart Is\". Still convinced his talents were lacking, he began producing the one person shows of his more gifted friends before finally producing his own, \"The World Owes Me a Party Favor\". Though he prefers the slower pace and outdoors of Texas and Oklahoma, he has done several long stints in Los Angeles doing national commercials, independent films, and conspiring with other comedian ex-patriots from Texas. He is now filming the Jim Sheridan helmed, \"Brothers\", as the beer guzzling and often underwear clad, Owen. By far his biggest role to date, he was cast in true, romanticized Hollywood form... by sending in a self-made tape without benefit of ever meeting the director or producers before start of production. He did, however, have the support of Brothers casting director and long time mentor, Jo Edna Boldin. Prewitt currently resides in Oklahoma City where he collaborates with longtime friends, Derek Doublin and Matt Brown on absurdist shorts like the AdCritic acclaimed \"The News\". He also has an entirely improvised, though deleted, scene on the DVD of Universal Picture's \"Friday Night Lights\". Ray enjoys bar-b-que, state fairs, and winning hot sauce festivals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDY4MjgwN15BMl5BanBnXkFtZTcwNTMwMjk5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0696697","name":"Ray Prewitt","idIMDB":"nm0696697"},"actorId":"nm0696697","character":"Owen","urlCharacter":"http://www.imdb.com/character/ch0138802","main":true}],"seasons":[],"idIMDB":"tt0765010","urlIMDB":"http://www.imdb.com/title/tt0765010","business":{"budget":{"money":"$26,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$9,527,848","country":"USA","day":"06","month":"12","year":"2009","remarks":"2,088 Screens"},{"money":"£366,290","country":"UK","day":"24","month":"01","year":"2010","remarks":"214 Screens"},{"money":"$CAD800,187","country":"Canada","day":"06","month":"12","year":"2009","remarks":""}],"gross":[{"money":"$28,501,651","country":"USA","day":"17","month":"01","year":"2010","remarks":""},{"money":"$28,198,793","country":"USA","day":"10","month":"01","year":"2010","remarks":""},{"money":"$25,341,515","country":"USA","day":"27","month":"12","year":"2009","remarks":""},{"money":"$22,349,862","country":"USA","day":"20","month":"12","year":"2009","remarks":""},{"money":"$17,416,217","country":"USA","day":"13","month":"12","year":"2009","remarks":""},{"money":"$9,527,848","country":"USA","day":"06","month":"12","year":"2009","remarks":""},{"money":"$27,414,913","country":"USA","day":"03","month":"01","year":"2009","remarks":""},{"money":"£1,028,334","country":"UK","day":"07","month":"02","year":"2010","remarks":""},{"money":"£795,745","country":"UK","day":"31","month":"01","year":"2010","remarks":""},{"money":"£366,290","country":"UK","day":"24","month":"01","year":"2010","remarks":""},{"money":"$43,318,349","country":"Worldwide","day":"05","month":"07","year":"2012","remarks":""}],"weekendGross":[{"money":"$152,353","country":"USA","day":"17","month":"01","year":"2010","remarks":"174 Screens"},{"money":"$364,633","country":"USA","day":"10","month":"01","year":"2010","remarks":"428 Screens"},{"money":"$1,192,134","country":"USA","day":"03","month":"01","year":"2010","remarks":"858 Screens"},{"money":"$1,210,172","country":"USA","day":"27","month":"12","year":"2009","remarks":"858 Screens"},{"money":"$2,889,121","country":"USA","day":"20","month":"12","year":"2009","remarks":"2,009 Screens"},{"money":"$5,014,426","country":"USA","day":"13","month":"12","year":"2009","remarks":"2,088 Screens"},{"money":"$9,527,848","country":"USA","day":"06","month":"12","year":"2009","remarks":"2,088 Screens"},{"money":"£83,156","country":"UK","day":"07","month":"02","year":"2010","remarks":"90 Screens"},{"money":"£209,439","country":"UK","day":"31","month":"01","year":"2010","remarks":"188 Screens"},{"money":"£366,290","country":"UK","day":"24","month":"01","year":"2010","remarks":"214 Screens"}],"admissions":[{"money":"77,656","country":"Netherlands","day":"31","month":"12","year":"2009","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 2009 Brothers Productions, LLC. (on print)"},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Cooke Speed Panchro Lenses","Arricam ST, Cooke S4 and Zeiss Variable Prime Lenses","Arriflex 235, Cooke Speed Panchro Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (film processing)","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)","Technicolor, Hollywood (CA), USA (release prints)"],"filmLength":["2,850 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 200T 5217, Vision2 500T 5218, Vision2 Expression 500T 5229)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3513DI)","D-Cinema"]},"rating":"7.1","metascore":"58","filmingLocations":[{"location":"Abiquiu, New Mexico, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actor in a Motion Picture - Drama","names":[{"name":"Tobey Maguire","id":"nm0001497","role":null}]},{"category":"Best Original Song - Motion Picture","names":[{"name":"U2","id":"nm1277752","role":null},{"name":"Bono","id":"nm0095104","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Action/Adventure/Thriller Film","names":[]},{"category":"Best Actor","names":[{"name":"Tobey Maguire","id":"nm0001497","role":null}]},{"category":"Best Actress","names":[{"name":"Natalie Portman","id":"nm0000204","role":null}]},{"category":"Best Performance by a Younger Actor","names":[{"name":"Bailee Madison","id":"nm1933128","role":null}]}]}]},{"award":"Broadcast Film Critics Association Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Young Actor/Actress","names":[{"name":"Bailee Madison","id":"nm1933128","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Natalie Portman","id":"nm0000204","role":null}]}]}]},{"award":"CinEuphoria Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won CinEuphoria","categories":[{"category":"Best Actor - International Competition","names":[{"name":"Tobey Maguire","id":"nm0001497","role":null}]},{"category":"Top Ten of the Year - International Competition","names":[{"name":"Jim Sheridan","id":"nm0006487","role":null}]}]}]},{"award":"Denver Film Critics Society 2010","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Original Song","names":[{"name":"Bono","id":"nm0095104","role":"music and lyrics"},{"name":"The Edge","id":"nm0857253","role":"music"},{"name":"Adam Clayton","id":"nm0165651","role":"music"},{"name":"Larry Mullen Jr.","id":"nm0611979","role":"music"}]}]}]},{"award":"Irish Film and Television Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won IFTA Award","categories":[{"category":"Best Director for Film","names":[{"name":"Jim Sheridan","id":"nm0006487","role":null}]}]}]},{"award":"Online Film & Television Association 2010","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Youth Performance","names":[{"name":"Bailee Madison","id":"nm1933128","role":null}]}]}]},{"award":"Prism Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Prism Award","categories":[{"category":"Performance in a Feature Film","names":[{"name":"Tobey Maguire","id":"nm0001497","role":null}]},{"category":"Feature Film- Mental Health","names":[]}]}]},{"award":"Teen Choice Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actor: Drama","names":[{"name":"Jake Gyllenhaal","id":"nm0350453","role":null}]},{"category":"Choice Movie Actor: Drama","names":[{"name":"Tobey Maguire","id":"nm0001497","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated WFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Jake Gyllenhaal","id":"nm0350453","role":null}]}]}]}],"votes":"92,427","type":"Movie","companyCreditsSimple":[{"idCompany":"co0173285","name":"Lionsgate"},{"idCompany":"co0142678","name":"Relativity Media"},{"idCompany":"co0300002","name":"Sighvatsson Films"}],"keywords":{"keywords":["afghanistan","presumed dead","marine","grief","prisoner","war trauma","death of soldier","false accusation of infidelity","suspicion","prisoner of war","murder","forced to kill","torture","captain","trauma","helicopter","widow","release from prison","u.s. marine","captive","starvation","emaciation","confession","ah 64 apache helicopter","uh 60 blackhawk helicopter","american flag","tragic hero","dark past","traumatic childhood","guilt","post traumatic stress disorder","emotional shock","emotional turmoil","therapy","helicopter shot down","remodeling","catholic mass","father son relationship","marital infidelity","threatened suicide","threat to kill","video camera","police","pistol","infant","gravestone","graveyard","renovation","father figure","kidnapping","gun held to head","anger","family relationships","american soldier","missing in action","uncle niece relationship","tears","taliban","rescue","paranoia","operation enduring freedom","mother daughter relationship","melodrama","love triangle","afghan war","husband wife relationship","homefront","helicopter crash","grieving","father daughter relationship","remake of danish film","brother brother relationship","based on film","girl","bare chested male","shaving","snowman","home movie","bubble bath","jogging","raising a flag","bartender","bar","winter","snow","camera","balloon","nursing student","nurse","private","family dinner","character says i love you","marriage","kitchen","ice skating","foreign language adaptation","crying","one word title","remake"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:03:30"}}