{"data":{"movies":[{"title":"Afghan Knights","originalTitle":"","year":"2007","releaseDate":"20070731","directors":[{"name":"Allan Harmon","id":"nm0363473"}],"writers":[{"name":"Brandon K. Hogan","id":"nm0389492"},{"name":"Christine Stringer","id":"nm1387540"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjkwMTQ2Nl5BMl5BanBnXkFtZTcwMDAxMTk0MQ@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Adventure","Drama","Horror"],"plot":"Haunted by the fact that he left a man behind in Afghanistan, a soldier (Bacic) pulls together a special task force to save his comrade.","simplePlot":"Haunted by the fact that he left a man behind in Afghanistan, a soldier (Bacic) pulls together a special task force to save his comrade.","actors":[{"actorName":"Steve Bacic","urlProfile":"http://www.imdb.com/name/nm0045584","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODY0NTQ3NF5BMl5BanBnXkFtZTcwMDUzNzkxNw@@._V1._CR4,1.649993896484375,568,695_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1965","placeOfBirth":" Lisicic, Croatia","height":"6' 1\" (1.85 m)","bio":"A leading man who is just as comfortable playing scary villains or comic sidekicks, Steve Bacic has gone from strength to strength culminating into a half-decade of non-stop work. Shortly after he moved from his home town of Windsor, Ontario to Vancouver, British Columbia, he landed a guest-starring role on the TV series 21 Jump Street (1987) -- the biggest part ever given a Canadian on the show at that time. Multiple episodes of Street Justice (1991), M.A.N.T.I.S. (1994), L'as de la crime (1991), Highlander (1992), Viper (1996) and The Marshal (1995) followed, along with important parts on Au-delà du réel - l'aventure continue (1995), The X-Files (1993), Millennium (1996), Andromeda (2000) and a recurring role on the short-lived but critically lauded Profit (1996). But it's in longer-form efforts such as She Stood Alone: The Tailhook Scandal (1995), Another Stakeout (1993) and Hardball (1997) (a.k.a. Bounty Hunters II) that Bacic has really been able to spread his wings. Admittedly an \"instinct\" player, he has been happy to learn the ropes from international stars like Gerald McRaney, Rosie O'Donnell and veteran Tony Curtis. Bacic regards one of his most unique professional experiences to-date as being the time he looked around the room while filming Another Stakeout (1993) and realized that he was alone with Rosie O'Donnell, Richard Dreyfuss, Emilio Estevez, the director (John Badham), the writer, and the producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODY0NTQ3NF5BMl5BanBnXkFtZTcwMDUzNzkxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045584","name":"Steve Bacic","idIMDB":"nm0045584"},"actorId":"nm0045584","character":"Pepper","urlCharacter":"http://www.imdb.com/character/ch0047505","main":true},{"actorName":"Michael Madsen","urlProfile":"http://www.imdb.com/name/nm0000514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODA5NzY2N15BMl5BanBnXkFtZTYwNjc3NTI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1958","placeOfBirth":" Chicago, Illinois, USA","birthName":"Michael Soren Madsen","height":"6' 2\" (1.88 m)","bio":"Michael Madsen's long career spans 25 years and more than 170 films in which he has played memorable characters in myriad box office hits, including: Kill Bill: Vol. 1 (2003), Kill Bill: Vol. 2 (2004) Sin City (2005), Hell Ride (2008), Die Another Day (2002), Donnie Brasco (1997), Species (1995), The Getaway (1994), Thelma & Louise (1991), and Free Willy (1993). Michael is notably recognized for his role as Mr. Blonde, in Quentin Tarantino's Reservoir Dogs (1992). Michael was born in Chicago, Illinois, to Elaine Madsen (née Melson), an Emmy-winning writer, producer, and poet, and Calvin Madsen, a firefighter. He is the brother of actress Virginia Madsen. His paternal grandparents were Danish. In recent years, Madsen has received Best Actor awards for his role in the Irish boxing film Strength and Honour, from the New York International Film Festival, the Boston Film Festival and the Downtown Los Angeles Film Festival. Madsen received the Golden Dolphin Award at the 25th Festroia Festival in Portugal, an award also given to veterans Kirk Douglas and Robert Mitchum. In 2012, Madsen was named President of the first annual Champs Elysees Film Festival in France which honored producer Harvey Weinstein. Recent television appearances include guest starring roles on The Mob Doctor (2012), Golden Boy (2013)and Blue Bloods (2010). Madsen is well recognized as an accomplished poet. His first book \"Burning In Paradise\" with a Foreword by Dennis Hopper, won the Independent Firecracker Award and was later translated into Norwegian. He has a world-wide following with his work, honored at International Poetry Festivals in Genoa, Italy and Mexico . He was recently the Guest of Honor at the Crossing Border Festival in Netherlands. His \"The Complete Poetic Works\" is an international bestseller. This was followed by his \"Signs of Life\" dedicated to Chris Penn. This unique work combined his new poetry with his own original photography. His next book of poetry \"American Badass\"was dedicated to the memory of the late David Carradine, his friend and Kill Bill co-star. His newest book \"Expecting Rain\" has a Foreword by Jerry Hopkins.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODA5NzY2N15BMl5BanBnXkFtZTYwNjc3NTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000514","name":"Michael Madsen","idIMDB":"nm0000514"},"actorId":"nm0000514","character":"Cooper","urlCharacter":"http://www.imdb.com/character/ch0079250","main":true},{"actorName":"Colin Lawrence","urlProfile":"http://www.imdb.com/name/nm0492687","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjAwOTYwOV5BMl5BanBnXkFtZTcwODU3NjMzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Colin Lawrence was born in London, England. He is an actor, known for Fantastic Four (2005), X-Men 2 (2003) and Watchmen (2009). He has been married to Lucia Walters since September 18, 1999. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjAwOTYwOV5BMl5BanBnXkFtZTcwODU3NjMzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0492687","name":"Colin Lawrence","nicknames":["Coolin"],"idIMDB":"nm0492687"},"actorId":"nm0492687","character":"JT","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Cree Molison","urlProfile":"http://www.imdb.com/name/nm1493646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWQxZWQ5ZGUtYWMyZC00ZTYzLTlhMWMtOWE1ZmQyMjQ1YmM0XkEyXkFqcGdeQXVyMzM0NTcxNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Steven Cree Molison is known for his work on Brokeback Mountain (2005), Fifty Shades of Grey (2015) and Blackstone (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWQxZWQ5ZGUtYWMyZC00ZTYzLTlhMWMtOWE1ZmQyMjQ1YmM0XkEyXkFqcGdeQXVyMzM0NTcxNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1493646","name":"Steven Cree Molison","idIMDB":"nm1493646"},"actorId":"nm1493646","character":"Rick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Kramer","urlProfile":"http://www.imdb.com/name/nm0469475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTcxODcxNF5BMl5BanBnXkFtZTcwMTMxODYwMw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1975","placeOfBirth":"","bio":"Chris Kramer was born in Regina, Saskatchewan. He lived in many different cities in Canada before settling in Calgary with his family. When he was 21, he dropped out of college and moved to Vancouver to pursue his dream of acting. He got his big break when he was cast in the lead role of Morgan Pym in 'The Collector.'He's best known for his roles on '24,' 'Saving Grace,' 'The Collector,' and 'Jericho.'","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTcxODcxNF5BMl5BanBnXkFtZTcwMTMxODYwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0469475","name":"Chris Kramer","idIMDB":"nm0469475"},"actorId":"nm0469475","character":"Jonathan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pete Antico","urlProfile":"http://www.imdb.com/name/nm0031055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZhNDdkOGEtNTUzOS00YTNkLWFjMDItYTZlYzYyYWQwODlhXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Pete Antico was born in New York City, New York, USA. He is known for his work on Through My Father's Eyes (2017), Creators: The Past and Faith (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZhNDdkOGEtNTUzOS00YTNkLWFjMDItYTZlYzYyYWQwODlhXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0031055","name":"Pete Antico","idIMDB":"nm0031055"},"actorId":"nm0031055","character":"Joey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vince Murdocco","urlProfile":"http://www.imdb.com/name/nm0613741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjYzNjIyMF5BMl5BanBnXkFtZTYwNDc3Mzcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Vince Murdocco gained fame in the kickboxing world when he was the North American Cruiserweight Champion. He soon made the transition from kickboxing to film, like many world champions back in the 1990s. However, Vince made his film debut in a softcore porn comedy, Le retour de Flesh Gordon (1990), as the titled character. In 1990 he starred as Sasha Mitchell's former friend in Kickboxer 2: The Road Back (1991), where he faced the awesome machine that is Michel Qissi (aka Tong Po). From there, Vince began work for PM Entertainment, starring in a variety of roles, from a racist kickboxer in Ring of Fire (1991) to a former prisoner turned hero in Private Wars (1997). After Death Game (1997), however, Vince took a break from acting. In but 2001, though, came back as a government agent in The Barber (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjYzNjIyMF5BMl5BanBnXkFtZTYwNDc3Mzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0613741","name":"Vince Murdocco","idIMDB":"nm0613741"},"actorId":"nm0613741","character":"Frank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Francesco Quinn","urlProfile":"http://www.imdb.com/name/nm0005331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxOTA5NzY0MF5BMl5BanBnXkFtZTcwNDEzNTMwMg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1963","placeOfBirth":" Rome, Lazio, Italy","birthName":"Francesco Daniele Quinn","bio":"Perhaps best known for his portrayal of underground drug king Rhah in Oliver Stone's Academy Award-winning Platoon (1986), Francesco Quinn is one of the film industry's most versatile young actors. Intent on following in the footsteps of his father, Oscar winner Anthony Quinn, who had appeared in more than 200 pictures, Francesco has already racked up some impressive film credits, setting him well on his way. He was the lead guest star in an episode of JAG (1995) which won the show a 29 share (the highest rating in its history) and had a lead role in TNT's Rough Riders (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxOTA5NzY0MF5BMl5BanBnXkFtZTcwNDEzNTMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005331","name":"Francesco Quinn","idIMDB":"nm0005331"},"actorId":"nm0005331","character":"Amad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Stretch","urlProfile":"http://www.imdb.com/name/nm0834282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NjMWI4MzctM2NjYS00NzI0LWJmODctZDQyZjI0ODUwNjBjXkEyXkFqcGdeQXVyMTY4ODI2MzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1968","placeOfBirth":" St. Helens, Merseyside, England, UK","height":"6' 2\" (1.88 m)","bio":"During the early nineties, Gary Stretch was the glamour-boy of British boxing. His good looks coupled with KO power in his fists ensured he was big box-office. He also made money strutting his stuff on the catwalk as a male model. Some said he earned more as a model than actually fighting, and his appearances in the British tabloid newspapers made sure that he was never out of the headlines. Stretch was an excellent amateur as a youngster and turned professional in 1985. He won the British light-middleweight championship in September 1988, then went on to win the WBC international super welterweight championship, beating Ramon 'Angel' Alegre at the London Docklands Arena, London on Feb 14th 1990 with a KO in round 6, in an entertaining and gritty contest that was billed as the \"Valentines Day Massacre\". In 1991 he finally got his world title chance when he challenged the colorful and eccentric Chris Eubank for the WBO world middleweight championship in London. 'Beauty v The Best' attracted the big celebrity crowd, and was a major sporting event that year. Despite taking the bout after almost a year out of the sport, Gary gave the iron-chinned champion hell for five rounds before the fight was stopped in the sixth round. After many unsuccessful attempts for a rematch, Stretch had one more fight then retired with a record of 23-2-0. Post-boxing, Gary was looking for another challenge and turned to the art of acting, In 2004, his hard work finally paid off when he was cast as psychotic gangster Sonny in Shane Meadows' gritty cult thriller Dead Man's Shoes (2004). Stretch received a BIFA nomination alongside another British talent, Paddy Considine. This picture finally earned Gary the recognition he deserved. He went on to co star opposite Colin Farrell, Angelina Jolie and Sir Anthony Hopkins in the Oliver Stone blockbuster Alexander (2004) World Trade Center (2006) (opposite Nicolas Cage), _Savages (2012)_qv_\" (opposite Benicio Del Toro & Salma Hayek).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NjMWI4MzctM2NjYS00NzI0LWJmODctZDQyZjI0ODUwNjBjXkEyXkFqcGdeQXVyMTY4ODI2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834282","name":"Gary Stretch","idIMDB":"nm0834282"},"actorId":"nm0834282","character":"Nash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maryam Ghaeni","urlProfile":"http://www.imdb.com/name/nm2287476","urlPhoto":"","biography":{"bio":"Maryam Ghaeni is an actress, known for Afghan Knights (2007) and Kayan (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2287476","name":"Maryam Ghaeni","idIMDB":"nm2287476"},"actorId":"nm2287476","character":"Soroya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sasha Lakovic","urlProfile":"http://www.imdb.com/name/nm1572882","urlPhoto":"","biography":{"dateOfBirth":"7 September 1971","placeOfBirth":" East Vancouver, British Columbia, Canada","height":"6' (1.83 m)","bio":"Has played 37 career NHL games with the Calgary Flames and the New Jersey Devils. Played in various leagues as the East Coast Hockey League, International Hockey League, Roller Hockey International, and the West Coast Hockey League on his way to the NHL.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1572882","name":"Sasha Lakovic","idIMDB":"nm1572882"},"actorId":"nm1572882","character":"Russian Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mig Macario","urlProfile":"http://www.imdb.com/name/nm0025891","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMThiNmRkODctZmQ5OC00ZmNlLWI4ODgtMzM5NGQ4OTFhMGZmXkEyXkFqcGdeQXVyNjU4NjczMA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1970","placeOfBirth":" Atimonan, Quezon, Luzon, Philippines","birthName":"Miguelito Macario Andaluz","height":"5' 6\" (1.68 m)","bio":"Born in the Philippines and named after the Filipino revolutionary, general and actor Macario Sakay; Mig is the youngest of 6 children and grew up in Vancouver, Canada. Mig Macario is known for his ability to play a diverse range of characters with seemingly effortless ease. If it wasn't for acting, he feels that he would have probably grown up being much like the gun toting, drug dealing characters he played on shows like 21 Jump Street, Wiseguy and The Commish. Macario was able to breakout from the usual thug roles when he played the lead - Song Liling in the Tony Award winning play M. Butterfly at the Arts Club Theatre. Mig's performance earned him a best newcomer nomination at The Jessie Richardson Awards. His producing, writing and directing debut was on the highly rated \"Summer Love - The Documentary\", which explored rave culture and aired on Much Music. With nearly 25 years experience in the entertainment industry, he has appeared in over 40 Film and Television projects; working with artists such as Johnny Depp, Maury Chaykin, Paul Sorvino, Dean McDermott and super mom come activist Jenny McCarthy. Mig made history when he was cast as George Amahit on the Gemini award winning, dark comedy \"Less Than Kind\". It's the first comedic series regular role written specifically for a Filipino in Canada if not North America. Recent projects find him recurring on not just one but two hit series! You'll see his familiar face on TV's blockbuster FRINGE for Fox and Nickelodeon's The Troop. He'll also be seen opposite Aaron Douglas (The Bridge, Battlestar Galactica) and a stellar cast including Emanuelle Vaugier (Two and a Half Men, CSI NY), Paul Campbell, Torrance Coombs, Andrew Airlie and Crystal Lowe in Killer Mountain airing on the SyFy network. From gang lord to Asian trans-gender diva spy to an overprotective Filipino father his performances are consistently creative, courageous and charismatic. From comedies to drama, stage to screen and everything in between; Mig's unstoppable joy, enthusiasm and humanity add a unique depth to any project he works on. As a practicing Buddhist Mig in turn supports many youth and aspiring actors globally to realize their true potential.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMThiNmRkODctZmQ5OC00ZmNlLWI4ODgtMzM5NGQ4OTFhMGZmXkEyXkFqcGdeQXVyNjU4NjczMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0025891","name":"Mig Macario","nicknames":["Mig"],"idIMDB":"nm0025891"},"actorId":"nm0025891","character":"Monk 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aaron Au","urlProfile":"http://www.imdb.com/name/nm1661289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NzYwNDEyNV5BMl5BanBnXkFtZTgwOTUzNTA4OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Aaron started in film as an actor and stunt performer and quickly amassed dozens of credits both in films and TV series. He used his time on set to learn film inside and out and in 2008 ventured into directing and producing. After a string of successful short films, he produced two features including \"Preggoland\" starring Sonja Bennett, Danny Trejo and James Caan. The film would premiered at TIFF in 2014 and had a North American theatrical release. While continuing to write and develop his own projects, Aaron recently joined Brightlight Pictures as a Development Executive.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NzYwNDEyNV5BMl5BanBnXkFtZTgwOTUzNTA4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1661289","name":"Aaron Au","idIMDB":"nm1661289"},"actorId":"nm1661289","character":"Monk 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karina Carreck","urlProfile":"http://www.imdb.com/name/nm0140128","urlPhoto":"","biography":{"height":"5' 4\" (1.63 m)","bio":"Karina Carreck is an actress and producer, known for Valentine (2001), Mourning Air (2006) and Afghan Knights (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0140128","name":"Karina Carreck","nicknames":["Nina"],"idIMDB":"nm0140128"},"actorId":"nm0140128","character":"Kim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cynde Harmon","urlProfile":"http://www.imdb.com/name/nm0363487","urlPhoto":"","biography":{"bio":"Cynde Harmon is known for her work on If I Had Wings (2013), Wolf Canyon (2009) and Stranger in the House (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0363487","name":"Cynde Harmon","idIMDB":"nm0363487"},"actorId":"nm0363487","character":"Market Moll","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0760157","urlIMDB":"http://www.imdb.com/title/tt0760157","business":{"budget":{"money":"$1,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"02","year":"2006","remarks":null},{"money":null,"country":null,"day":"17","month":"03","year":"2006","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Moviecam Cameras","Panavision Cameras and Lenses"],"laboratory":["Rainmaker Digital Pictures Group Ltd., Vancouver, Canada (lab services) (as Rainmaker)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.1","filmingLocations":[{"location":"Hope, British Columbia, Canada"}],"rated":"R","awards":[{"award":"Leo Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Leo","categories":[{"category":"Best Production Design in a Feature Length Drama","names":[{"name":"Paolo G. Venturi","id":"nm0003516","role":null}]}]}]}],"votes":"659","type":"Movie","companyCreditsSimple":[{"idCompany":"co0138212","name":"Paradox Pictures"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:05:37"}}