{"data":{"movies":[{"title":"The Last Electric Knight","originalTitle":"","year":"1986","releaseDate":"19860216","directors":[{"name":"James Fargo","id":"nm0267309"}],"writers":[{"name":"Dan Gordon","id":"nm0330108"}],"runtime":"30 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTU3Y2UyM2QtYWUxYS00YTQ4LWJlYjYtNGVmNmRjY2E4ZjZkL2ltYWdlXkEyXkFqcGdeQXVyNTQ2NzMwMzM@._V1.jpg","countries":[],"languages":[],"genres":["Crime","Drama","Family"],"plot":"An old man who lives with his grandson, Ernie, is approached by a social worker who tells him that Ernie can't continue living with him because he is old and an invalid. He needs to find someone to take Ernie in and he picks a man named Jake Rizzo who is a cop. He sends Ernie to him and Rizzo finds the whole thing strange. Ernie continues to follow him and when he gets in trouble Ernie who's trained by his grandmother in martial arts helps him. Jake starts to warm up to him. And he also finds himself attracted to the social worker.","simplePlot":"An old man who lives with his grandson, Ernie, is approached by a social worker who tells him that Ernie can't continue living with him because he is old and an invalid. He needs to find ... ","actors":[{"actorName":"Gil Gerard","urlProfile":"http://www.imdb.com/name/nm0001266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg4NjQzMDE3OF5BMl5BanBnXkFtZTcwNjI5NDY4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1943","placeOfBirth":" Little Rock, Arkansas, USA","birthName":"Gilbert C. Gerard","height":"6' 1\" (1.85 m)","bio":"Gilbert \"Gil\" Gerard was born on January 23, 1943 in Little Rock, Arkansas, and did a good deal of acting in high school. He attended the University of Arkansas but dropped out before graduation. He landed a job as an industrial chemist. He became regional manager of a large chemical company, headed by (1967-1971) Arkansas Governor \"Win\" Winthrop Rockefeller. After a few years, Gil's employers said they would name him the firm's vice-president if he pursued his master's degree. Gil resigned rather than tell everyone he did not have a college diploma. He moved to New York where he studied drama by day and drove a cab at night. By chance, Gil picked up a fare who showed a lively interest in the problems of unknown, unemployed actors. Before that passenger left the cab, he told Gil to report in a few days to the set of Love Story (1970), which was being filmed on location in New York City. When Gil arrived on the \"Love Story\" set, he was hired as an extra. Later that day, he was singled out for a \"bit\" role, which eventually wound up on the cutting room floor, but Gil now had his first professional credit. During the next few years, Gil did most of his acting in television commercials, some four hundred of them, including a stint as spokesman for the Ford Motor Company. Then came a leading role in the daytime soap opera The Doctors (1963). He formed his own production company in partnership with a writer-producer, co-authored a screenplay called Hooch (1977) and filmed it as a starring vehicle for himself. With \"Hooch\" completed, he was summoned to California to co-star with Yvette Mimieux in Ransom for Alice! (1977) and to play Lee Grant's youthful lover in Universal's Airport '77 (1977). A guest shot on Little House on the Prairie (1974) impressed producer-star Michael Landon, who cast him in the leading role in an ambitious television movie, Killing Stone (1978). He signed for his best known role as Captain Buck Rogers in the television series Buck Rogers in the 25th Century (1979).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg4NjQzMDE3OF5BMl5BanBnXkFtZTcwNjI5NDY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001266","name":"Gil Gerard","idIMDB":"nm0001266"},"actorId":"nm0001266","character":"Jake Rizzo","urlCharacter":"http://www.imdb.com/character/ch0182777","main":true},{"actorName":"Nancy Stafford","urlProfile":"http://www.imdb.com/name/nm0821328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzA4MDk4MF5BMl5BanBnXkFtZTcwNDM1Mjc4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1954","placeOfBirth":" Wilton Manors, Florida, USA","birthName":"Nancy Elizabeth Stafford","height":"5' 9\" (1.75 m)","bio":"Nancy Stafford was born in Wilton Manors, Florida, a suburb of Ft. Lauderdale, Florida, where she was raised in a Southern Baptist family home. She has starred in many TV shows, such as Riptide (1984), Remington Steele (1982), Scarecrow and Mrs. King (1983), Who's the Boss? (1984), Hunter (1984) and Quantum Leap (1989). She also guest-starred on an episode of Magnum, P.I. (1980). Her biggest claim to fame on television was with Andy Griffith on Matlock (1986). She also guest-starred in many shows in the late 1990s such as ER (1994), Frasier (1993), Babylon 5 (1994), Baywatch (1989) and The Mentalist (2008). Additionally, Stafford played \"The Lady in the Park\" in the 2004 Award-winning short film, The Proverb (2004), along with her friends, Jeff Andrus and Scott Waara.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzA4MDk4MF5BMl5BanBnXkFtZTcwNDM1Mjc4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0821328","name":"Nancy Stafford","idIMDB":"nm0821328"},"actorId":"nm0821328","character":"Patricia Blake","urlCharacter":"http://www.imdb.com/character/ch0277604","main":true},{"actorName":"Keye Luke","urlProfile":"http://www.imdb.com/name/nm0525601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Mjc4Njg4OF5BMl5BanBnXkFtZTcwMTI0ODcyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1904","placeOfBirth":" Guangzhou, China","height":"5' 6\" (1.68 m)","bio":"Keye Luke was born in Canton, China. He grew up in Seattle, Washington, and entered the film business as a commercial artist and a designer of movie posters. He was hired as a technical advisor on several Asian-themed films, and made his film debut in The Painted Veil (1934). It seemed that he appeared in almost every film that called for Chinese characters, usually in small parts but occasionally, as in The Good Earth (1937), in a meatier, more substantial role. In addition, he played Dr. Kildare's rival at the hospital in the Dr. Kildare series at MGM, but it was as Charlie Chan's #1 son in that series that Luke achieved his greatest recognition. In the 1970s a new generation was made aware of his talents by virtue of his recurring role in the TV series Kung Fu (1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Mjc4Njg4OF5BMl5BanBnXkFtZTcwMTI0ODcyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0525601","name":"Keye Luke","idIMDB":"nm0525601"},"actorId":"nm0525601","character":"Sabasan","urlCharacter":"http://www.imdb.com/character/ch0306723","main":true},{"actorName":"Ernie Reyes Jr.","urlProfile":"http://www.imdb.com/name/nm0721205","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTg0NzUwMV5BMl5BanBnXkFtZTgwMzc1MjI0NDE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1972","placeOfBirth":" San Jose, California, USA","birthName":"Ernest E. Reyes","height":"5' 5\" (1.65 m)","bio":"Ernie Reyes Jr. was born on January 15, 1972 in San Jose, California, USA as Ernest E. Reyes. He is known for his work on The Rundown (2003), Indiana Jones and the Kingdom of the Crystal Skull (2008) and Rush Hour 2 (2001). He has been married to Lisa Reyes since November 11, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTg0NzUwMV5BMl5BanBnXkFtZTgwMzc1MjI0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721205","name":"Ernie Reyes Jr.","idIMDB":"nm0721205"},"actorId":"nm0721205","character":"Ernie Lee","urlCharacter":"http://www.imdb.com/character/ch0182776","main":true},{"actorName":"Don Cheadle","urlProfile":"http://www.imdb.com/name/nm0000332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1964","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Donald Frank Cheadle","height":"5' 8½\" (1.74 m)","bio":"Donald Frank Cheadle was born in Kansas City, Missouri on November 29, 1964. His childhood found him moving from city to city with his family: mother Bettye (North), a teacher, father Donald Frank Cheadle, Sr., a clinical psychologist, sister Dawn, and brother Colin. After graduating high school in Denver, Colorado, Cheadle attended and graduated from the California Institute of the Arts with a Bachelor¹s Degree in Fine Arts. Encouraged by his college friends, he attended a variety of auditions and landed a recurring role on the hit series Fame (1982), which led to feature film roles in Dennis Hopper's Colors (1988) and John Irvin's Hamburger Hill (1987). Early in his career, Cheadle was named Best Supporting Actor by the Los Angeles Film Critics for his breakout performance opposite Denzel Washington in Devil in a Blue Dress (1995). His subsequent film credits include: Traitor (2008), an international thriller which he produced, starring opposite Guy Pearce; Kasi Lemmons's Talk to Me (2007), with Chiwetel Ejiofor; the 2006 Oscar-winning Best Picture, Collision (2004), which Cheadle also produced; Hotel Rwanda (2004), for which his performance garnered Oscar, Golden Globe, Broadcast Film Critics and Screen Actors Guild award nominations for Best Actor; Steven Soderbergh's Ocean's Eleven (2001), Ocean's Twelve (2004) and Ocean's Thirteen (2007), starring Brad Pitt and George Clooney; Mike Binder's Reign Over Me (2007) with Adam Sandler; the Academy Award-winning Traffic (2000) and Out of Sight (1998), with George Clooney and Jennifer Lopez, both films also directed by Soderbergh; Paul Thomas Anderson's acclaimed Boogie Nights (1997) with Julianne Moore and Mark Wahlberg; Bulworth (1998), directed by and starring Warren Beatty; Swordfish (2001), with John Travolta and Halle Berry; Mission to Mars (2000) with Tim Robbins and Gary Sinise; John Singleton's Rosewood (1997), for which Cheadle earned an NAACP Image Award nomination; Brett Ratner's The Family Man (2000), starring Nicolas Cage; and the independent features Manic (2001) and Things Behind the Sun (2001). Cheadle was honored by the CineVegas Film Festival and the Los Angeles Film Festival and received ShoWest's Male Star of the Year award. He is also well-recognized for his television work, including his portrayal of Sammy Davis Jr. in HBO's The Rat Pack (1998), for which he received a Golden Globe Award and a Best Supporting Actor Emmy nomination. That same year, he also received an Emmy nomination for his starring role in HBO's adaptation of the best-selling novel A Lesson Before Dying (1999), opposite Cicely Tyson and Mekhi Phifer. He also starred for HBO in Eriq La Salle's Rebound: The Legend of Earl 'The Goat' Manigault (1996). Cheadle's TV series credits include his two-year stint in David E. Kelley's acclaimed series Picket Fences (1992), a guest-starring role on ER (1994) (earning yet another Emmy nomination) and a regular role on The Golden Palace (1992) He also starred in the live television broadcast of Fail Safe (2000) opposite George Clooney, James Cromwell, Brian Dennehy, Richard Dreyfuss and Harvey Keitel. He also co-executive produced the TV version of Crash (2008). His most recent big screen appearances have been in Antoine Fuqua's ensemble crime thriller Brooklyn's Finest (2009) and Jon Favreau's Iron Man 2 (2010), another mainstream breakthrough where he played Lt. Col. James 'Rhodey' Rhodes, replacing Terrence Howard from the first film. L'Irlandais (2011), an art-house hit directed by John Michael McDonagh and co-starring Brendan Gleeson, followed. Cheadle stars in House of Lies (2012) on Showtime. Late in 2012, he was seen in Flight (2012), Robert Zemeckis's return to live-action filmmaking. In 2013, he reprised his role as Rhodey in Iron Man 3 (2013). Among his projects in development is a movie based on the life of jazz legend Miles Davis. A talented musician who plays saxophone, writes music and sings, he is also an accomplished stage actor and director and was nominated for a Grammy Award in 2004 for Best Spoken Word Album for his narration/dramatization of the Walter Mosley novel \"Fear Itself\". Other notable off-stage achievements include the 2007 BET Humanitarian Award for the cause of the people of Darfur and Rwanda, and sharing the Summit Peace Award by the Nobel Peace Prize Laureates in Rome with George Clooney for their work in Darfur.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000332","name":"Don Cheadle","idIMDB":"nm0000332"},"actorId":"nm0000332","character":"Gang Leader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Hervey","urlProfile":"http://www.imdb.com/name/nm0381155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ2MzYyNDIyNV5BMl5BanBnXkFtZTcwNDI3NjQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1972","placeOfBirth":" Los Angeles, California, USA","birthName":"Jason Robert Hervey","height":"5' 6\" (1.68 m)","bio":"Jason Hervey was born April 6th, 1972 in Los Angeles, California. He is the son of Alan & Marsha Hervey, brother of Scott. At the age 4, Jason began his career appearing in over 250 commercials for some of Americas favorite brands. Before long, his visibility from the various commercials lead him to several appearances in some of televisions most notable shows. He also appeared in cameo roles in such feature films as Back to The Future, Pee Wee's Big Adventure, Back To School, Monster Squad, Police Academy 2, Meatballs 2, Tim Burtons Franken-weenie and more. After appearing for two seasons in Different Strokes, Jason landed the role of Wayne Arnold in the Emmy Award-winning hit series \"The Wonder Years\". From this platform and experience Jason was able to leverage opportunities behind the camera as he began a career in producing. His first project was at the age of 17 whereby Jason created, starred in and produced 26 episodes of the Saturday morning series \"Wide World of Kids\". After 6 seasons and 29 Emmy Nominations for \"The Wonder Years\", Jason partnered with former Sony of America CEO Peter Guber in Mandalay Sports Action Entertainment,(MSAE). While at Mandalay Jason spearheaded a partnership with Time Warner's \"World Championship Wrestling\" (WCW) which yielded 17 original productions in television, home video and Pay Per View, an original soundtrack with Tommy Boy records and 4 television movies for TBS and TNT including one of the highest rated TV movies in the history of basic cable in which Jason was the original creator. After more than 5 years at Mandalay and growing that division, Jason had a short lived stint as a Chief Marketing Officer at a Fortune 500 company. Jason then returned to his roots in the entertainment business by partnering with long time friend, colleague and former President of Time Warners \"World Championship Wrestling\" (WCW) Eric Bischoff to form Bischoff Hervey Entertainment (BHE TV, LLC) Bischoff Hervey Entertainment specializes in content creation and production for various broadcast outlets, licensing and merchandising and innovative brand integration solutions. Jason and his family currently reside in Scottsdale, Arizona and Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ2MzYyNDIyNV5BMl5BanBnXkFtZTcwNDI3NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0381155","name":"Jason Hervey","idIMDB":"nm0381155"},"actorId":"nm0381155","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clarence Landry","urlProfile":"http://www.imdb.com/name/nm0485044","urlPhoto":"","biography":{"dateOfBirth":"31 August 1914","placeOfBirth":" Texas, USA","bio":"Clarence Landry was born on August 31, 1914 in Texas, USA. He was an actor, known for Harlem Nights (1989), Fletch Lives (1989) and Alien Nation (1988). He died on November 14, 2003 in Santa Monica, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0485044","name":"Clarence Landry","nicknames":["Frenchie"],"idIMDB":"nm0485044"},"actorId":"nm0485044","character":"Old Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Mesa","urlProfile":"http://www.imdb.com/name/nm1026794","urlPhoto":"","biography":{"bio":"Robert Mesa is known for his work on Happy, Texas (1999), Jacob (2011) and Sidekicks (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1026794","name":"Robert Mesa","idIMDB":"nm1026794"},"actorId":"nm1026794","character":"Louie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antony Ponzini","urlProfile":"http://www.imdb.com/name/nm0690747","urlPhoto":"","biography":{"dateOfBirth":"1 June 1933","placeOfBirth":" Brooklyn, New York, USA","bio":"Antony Ponzini was born on June 1, 1933 in Brooklyn, New York, USA. He was an actor, known for All My Children (1970), General Hospital (1963) and One Life to Live (1968). He died on December 30, 2002 in Moosup, Connecticut, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0690747","name":"Antony Ponzini","idIMDB":"nm0690747"},"actorId":"nm0690747","character":"Detective Kelly","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0700267","urlIMDB":"http://www.imdb.com/title/tt0700267","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":null,"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.1","filmingLocations":[],"awards":[],"votes":"7","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"Sidekicks","id":"tt0090519"},"season":"Season 1","episode":"Episode 0"},"companyCreditsSimple":[{"idCompany":"co0007638","name":"Motown Productions"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 06:04:39"}}