{"data":{"movies":[{"title":"Escape from Planet Earth","originalTitle":"","year":"2013","releaseDate":"20130215","directors":[{"name":"Cal Brunker","id":"nm2117510"}],"writers":[{"name":"Bob Barlen","id":"nm1779809"},{"name":"Cal Brunker","id":"nm2117510"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTk4NjkyMl5BMl5BanBnXkFtZTcwMzA2OTY4OA@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Animation","Adventure","Comedy","Family","Sci-Fi"],"plot":"The story takes place on planet Baab where admired astronaut Scorch Supernova (Brendan Fraser) is a national hero to the blue alien population. A master of daring rescues, Scorch pulls off astonishing feats with the quiet aid of his nerdy brother, Gary (Rob Corddry), head of mission control at BASA.","simplePlot":"Astronaut Scorch Supernova finds himself caught in a trap when he responds to an SOS from a notoriously dangerous alien planet.","actors":[{"actorName":"Brendan Fraser","urlProfile":"http://www.imdb.com/name/nm0000409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjExMzY0M15BMl5BanBnXkFtZTgwNTMxOTg4MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1968","placeOfBirth":" Indianapolis, Indiana, USA","birthName":"Brendan James Fraser","height":"6' 3\" (1.91 m)","bio":"Brendan James Fraser was born in Indianapolis, Indiana, to Canadian parents Carol Mary (Genereux), a sales counselor, and Peter Fraser, a journalist and travel executive. He is of Irish, Scottish, German, Czech, and French-Canadian ancestry. As his parents frequently moved, Brendan can claim affinity with Ottawa, Indianapolis, Detroit, Seattle, London and Rome. His early exposure to theatre, particularly in London, led him to Seattle's Cornish Institute. After graduation he found a minor role as Sailor #1 in River Phoenix's Dogfight (1991), then somewhat more substantial roles in Encino Man (1992) and School Ties (1992). He expresses a preference for playing \"fish out of water\" men. Five more years of supporting work led finally to the title role in George of the Jungle (1997), a role which fully utilized his charm and beefy good looks, as well as offering him a chance to show off his comic talents. He describes this role as the one which dramatically altered his career. Critical raves for his role in Gods and Monsters (1998) pointed to yet another dimension to his dramatic persona.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjExMzY0M15BMl5BanBnXkFtZTgwNTMxOTg4MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000409","name":"Brendan Fraser","idIMDB":"nm0000409"},"actorId":"nm0000409","character":"Scorch Supernova","urlCharacter":"http://www.imdb.com/character/ch0349448","main":true},{"actorName":"Rob Corddry","urlProfile":"http://www.imdb.com/name/nm1117791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODI5Njk2Nl5BMl5BanBnXkFtZTcwOTY3NTA3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1971","placeOfBirth":" Weymouth, Massachusetts, USA","birthName":"Robert William Corddry","height":"5' 11\" (1.8 m)","bio":"Rob Corddry was born on February 4, 1971 in Weymouth, Massachusetts, USA as Robert William Corddry. He is a writer and actor, known for Hot Tub Time Machine (2010), Childrens Hospital (2008) and Warm Bodies (2013). He has been married to Sandra Corddry since 2002. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODI5Njk2Nl5BMl5BanBnXkFtZTcwOTY3NTA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1117791","name":"Rob Corddry","idIMDB":"nm1117791"},"actorId":"nm1117791","character":"Gary Supernova","urlCharacter":"http://www.imdb.com/character/ch0349452","main":true},{"actorName":"Ricky Gervais","urlProfile":"http://www.imdb.com/name/nm0315041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDQwMDUyMV5BMl5BanBnXkFtZTcwNzI2NzQ4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1961","placeOfBirth":" Reading, Berkshire, England, UK","birthName":"Ricky Dene Gervais","height":"5' 8\" (1.73 m)","bio":"Ricky Dene Gervais was born in a suburb of Reading, Berkshire, to Eva Sophia (House) and Lawrence Raymond Gervais, who was a hod carrier and labourer. His father was born in Ontario, Canada, of French-Canadian descent, and his mother was English. He was educated at Ashmead Comprehensive School and went on to study at University College, London, where he gained a degree in Philosophy. After university, Gervais attempted to pursue a pop career with Seona Dancing, a duo he formed with a fellow student. Similar to many groups in the early 1980s, they were a synth-pop act with a somewhat pretentious name and exhibiting a strong musical influence by David Bowie. Gervais adopted a vocal style that has often been compared to Bowie; comedian Paul Merton would later joke that Bowie nicked their music. Seona Dancing were briefly signed to a recording contract and released two singles, \"More to Lose\" and \"Bitter Heart\". The latter was slightly reminiscent of Queen's \"Body Language\" from a year earlier, featuring a similar synthesizer riff. The act failed to breach the UK top 75 and earn a place in the Guinness Book of British Hit Singles, but clips have survived and they have been frequently used to tease Gervais in interviews. Despite his own lack of success, Gervais stayed within the music industry for a while and even spent time as the manager of Suede. Gervais had to wait a long time before achieving the fame he had hoped would come with a pop career. In the 1990s he formed a writing partnership with Stephen Merchant. In 2000, he landed his own comedy chat show on Channel 4, Meet Ricky Gervais (2000), which attracted legendary guests such as Jimmy Savile, Michael Winner, Paul Daniels, Peter Purves, Stefanie Powers, Jim Bowen and Midge Ure. The series only ran for six episodes but a year later greater stardom came for Gervais with the debut of BBC comedy The Office (2001). Although it was not initially received to great acclaim or viewing figures, it is now often cited as one of the greatest comedy series of all time and has been credited as reinventing the sitcom. Gervais starred as the obnoxious and embarrassing office manager David Brent, who has since been voted in various polls one of the greatest comic characters. It also prompted an American remake, The Office (2005). Gervais had further success with another sitcom, Extras (2005), which attracted a series of celebrity guests, including Ben Stiller, Samuel L. Jackson and his musical idol David Bowie. It served as a satire on the entertainment industry and leading stars were happy to play along by performing exaggerated versions of themselves. Gervais has become one of the most popular and omnipresent comedy performers of the 21st century, hosting the Golden Globe awards, lending his talent to films, becoming a voice artist and appearing on numerous talk shows, becoming one of the best known British comedy figures in America. He is also regularly the subject of controversy due to his dark comedy. Some critics have called him insensitive and outrageous. Gervais has responded by saying \"offense is the collateral damage of free speech\", he has said that he doesn't aim for a mass audience, he's just pleased he's managed to get one, and he has compared his style of comedy and the audience he has acquired with being Iggy Pop in preference to being Phil Collins.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDQwMDUyMV5BMl5BanBnXkFtZTcwNzI2NzQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0315041","name":"Ricky Gervais","idIMDB":"nm0315041"},"actorId":"nm0315041","character":"Mr. James Bing","urlCharacter":"http://www.imdb.com/character/ch0455622","main":true},{"actorName":"Jonathan Morgan Heit","urlProfile":"http://www.imdb.com/name/nm2384128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDhiMjBhNmUtY2I4Mi00OGI4LWFjODYtYmNmYjJhMGU5ZmY5XkEyXkFqcGdeQXVyMTc3NDg0ODE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 2000","placeOfBirth":" California, USA","height":"5' 8\" (1.73 m)","bio":"Jonathan Morgan Heit was born on July 16, 2000 in California, USA. He is an actor and director, known for Jake and the Never Land Pirates (2011), Bedtime Stories (2008) and Date Night (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDhiMjBhNmUtY2I4Mi00OGI4LWFjODYtYmNmYjJhMGU5ZmY5XkEyXkFqcGdeQXVyMTc3NDg0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2384128","name":"Jonathan Morgan Heit","idIMDB":"nm2384128"},"actorId":"nm2384128","character":"Kip Supernova","urlCharacter":"http://www.imdb.com/character/ch0166589","main":true},{"actorName":"Jessica Alba","urlProfile":"http://www.imdb.com/name/nm0004695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzE4OTk5Nl5BMl5BanBnXkFtZTcwODYyMDYzMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1981","placeOfBirth":" Pomona, California, USA","birthName":"Jessica Marie Alba","height":"5' 6½\" (1.69 m)","bio":"Jessica Marie Alba was born on April 28, 1981, in Pomona, CA, to Catherine (Jensen) and Mark David Alba, who served in the US Air Force. Her mother has Danish, Welsh, German, English, and French ancestry, while her father is of Mexican descent (including Spanish, Indigenous Mexican, and distant Sephardic Jewish, roots). Her family moved to Biloxi, MS, when she was an infant. Three years later her father's career brought the family back to California, then to Del Rio, TX, before finally settling in Southern California when Jessica was nine. In love with the idea of becoming an actress from the age of five, she was 12 before she took her first acting class. Nine months later she was signed by an agent. She studied at the Atlantic Theatre Company with founders William H. Macy and David Mamet. A gifted young actress, Jessica has played a variety of roles ranging from light comedy to gritty drama since beginning her career. She made her feature film debut in 1993 in Hollywood Pictures' comedy Camp Nowhere (1994). Originally hired for two weeks, she got her break when an actress in a principal role suddenly dropped out. Jessica cheerfully admits it wasn't her prodigious talent or charm that inspired the director to tap her to take over the part--it was her hair, which matched the original performer's. The two-week job stretched to two months, and Jessica ended the film with an impressive first credit. Two national TV commercials for Nintendo and J.C. Penney quickly followed before Jessica was featured in several independent films. She branched out into TV in 1994 with a recurring role in Nickelodeon's popular comedy series The Secret World of Alex Mack (1994). She played an insufferable young snob, devoted to making life miserable for the the title character, played by Larisa Oleynik. That same year, she won the role of \"Maya\" in Flipper (1995) and filmed the pilot for the series. She spent 1995 shooting the first season's episodes in Australia. An avid swimmer and PADI-certified SCUBA diver, Jessica was delighted to be doing a show that allowed her to play with dolphins. The show's success guaranteed it a second season, which she also starred in. Her involvement in the show lasted from 1995 to 1997. In 1996 she appeared in Venus Rising (1995) as \"Young Eve\". The next year she appeared on The Dini Petty Show (1989), a Canadian talk show, and spoke about her role in \"Flipper\" and her general acting career. She began working on P.U.N.K.S. (1999), featuring Randy Quaid, in 1998. In early 1998 she appeared in Brooklyn South (1997) as \"Melissa\". That same year she was in two episodes of Beverly Hills, 90210 (1990) as \"Leanne\" and in two episodes of Love Boat: The Next Wave (1998). She appeared in \"Teen Magazine\" in 1995 and various European magazines over the following years. More importantly, she was featured in the February 1999 issue of \"Vanity Fair\" magazine. She also had major roles in two movies that year: Never Been Kissed (1999) and Idle Hands (1999). In 2000 she had roles in Paranoid (2000) and starred in the sci-fi TV series Dark Angel (2000), gaining worldwide recognition. Her first starring role in a major studio film was the Honey (2003), Universal Pictures' contemporary urban drama that grossed over $60 million worldwide. She has since made over 25 feature films that have earned a combined box-office total of over $800 million, including comedies and dramas, from gritty independents to major studio blockbusters. In 2005 she starred opposite Bruce Willis and an all-star cast in the provocative and critically acclaimed Sin City (2005), directed by Robert Rodriguez and Frank Miller. She next starred as Sue Storm--\"The Invisible Girl\"--in Marvel's action-franchise blockbuster Fantastic Four (2005), which was released by 20th Century-Fox in July 2005 and became a worldwide box-office success with over $300 million in revenue. Jessica was part of Garry Marshall's all-star ensemble romantic comedy, Valentine's Day (2010), which broke box-office records with the largest opening on a four-day President's Day weekend in history. She starred opposite Casey Affleck and Kate Hudson in director Michael Winterbottom's controversial screen adaptation of The Killer Inside Me (2010), based on Jim Thompson's novel, as well as Robert Rodriquez's Machete (2010). She co-starred in the third installment of the hit \"Meet the Parents\" franchise Little Fockers (2010), as well as the 4D family adventure Spy Kids: All the Time in the World in 4D (2011), marking her third of five collaborations with Robert Rodriguez. Jessica was part of an all-star voice cast for The Weinstein Company's animated adventure, Escape from Planet Earth (2013), also featuring Sarah Jessica Parker, Brendan Fraser and James Gandolfini. She appeared in the comedy A.C.O.D. (2013), which premiered at the Sundance Film Festival and starred Adam Scott, Jane Lynch and Amy Poehler. She made a cameo appearance in Machete Kills (2013) and co-starred in Robert Rodriquez's highly-anticipated, star-studded sequel Sin City: A Dame to Kill For (2014). That year she had a full slate of acting projects, including the period drama Dear Eleanor (2016)\"; The Englishman opposite Pierce Brosnan and Salma Hayek; the IFC parody mini-series The Spoils of Babylon (2014), produced by Funny or Die, with a stellar cast including Will Ferrell, Kristen Wiig, Tobey Maguire, Michael Sheen and Tim Robbins; and Stretch (2014), co-starring Patrick Wilson, Chris Pine, Ray Liotta, Ed Helms and Brooklyn Decker. Jessica has received Golden Globe and People's Choice Award nominations, was voted TV Guide readers' Breakout Star of the Year, and won Favorite TV Actress at the 2001 Teen Choice Awards for \"Dark Angel.\" She won the Nickelodeon Kids' Choice Award for Favorite Female Actress for her performance in \"Fantastic Four\" and an MTV Movie Award for Sexiest Performance in \"Sin City.\" She received another Teen Choice Award for Choice Movie Actress in a Horror/Thriller for The Eye (2008) and was honored by the Young Hollywood Awards as Superstar of Tomorrow in 2005. She has received ALMA Awards for her performances in \"Dark Angel\" and \"Machete,\" as well as a Fashion Icon in 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzE4OTk5Nl5BMl5BanBnXkFtZTcwODYyMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004695","name":"Jessica Alba","nicknames":["Sky Angel","Albz"],"idIMDB":"nm0004695"},"actorId":"nm0004695","character":"Lena Thackleman","urlCharacter":"http://www.imdb.com/character/ch0371093","main":true},{"actorName":"Sofía Vergara","urlProfile":"http://www.imdb.com/name/nm0005527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDkwMDcxOV5BMl5BanBnXkFtZTcwMDk0MjQ2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1972","placeOfBirth":" Barranquilla, Colombia","birthName":"Sofía Margarita Vergara Vergara","height":"5' 7\" (1.7 m)","bio":"Sofía Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Dávila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school. She then went on to study pre-dentistry. However, Sofía was discovered by a photographer, whilst at the beach, and this led to various jobs in modeling and television. At age 23, she was a runway model. From 1995 to 1998, she co-hosted a travel show, Fuera de serie (1995), which gave her exposure in the United States. Her first film role was the criminal comedy Big Trouble (2002). Her breakthrough role was as Gloria Delgado-Pritchett on the American television series Modern Family (2009). In 2010-2013, she received four Emmy nominations for Outstanding Supporting Actress in a Comedy Series for this role. Sofía resides in Los Angeles, California with her son, Manolo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDkwMDcxOV5BMl5BanBnXkFtZTcwMDk0MjQ2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005527","name":"Sofía Vergara","nicknames":["La Toti"],"idIMDB":"nm0005527"},"actorId":"nm0005527","character":"Gabby Babblebrock","urlCharacter":"http://www.imdb.com/character/ch0407427","main":true},{"actorName":"Paul Scheer","urlProfile":"http://www.imdb.com/name/nm1179677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzczNjg5NV5BMl5BanBnXkFtZTgwOTgzMTAyNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1976","placeOfBirth":" New Hyde Park, New York, USA","birthName":"Paul Christian Scheer","height":"5' 11½\" (1.82 m)","bio":"Scheer is an American actor, comedian, writer, director, and producer. Scheer was born in Huntington, New York and graduated from New York University where he majored in Communication and Education. He stars on the FX series The League (2009), the ABC sitcom Fresh Off the Boat (2015), and Hulu comedy series The Hotwives of Orlando (2014), which he also executive produces. Scheer co-created and starred in the cult MTV sketch series Human Giant (2007) as well as the Adult Swim series NTSF:SD:SUV (2011). His films include supporting roles in Army of One (2016), Opening Night (2016), Daddy's Home (2015), Hell Baby (2013), Ass Backwards (2013), Clear History (2013), and Hell and Back (2015). He starred in a web series for JASH called The ArScheerio Paul Show (2013), which recreates classic moments from the The Arsenio Hall Show (1989) and was dubbed 2013's best viral video of the year by USA Today. Scheer also has made appearances on programs such as Burning Love (2012), 30 Rock (2006), Best Week Ever with Paul F. Tompkins (2004), Childrens Hospital (2008), Funny or Die Presents... (2010), Happy Endings (2011) and Yo Gabba Gabba! (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzczNjg5NV5BMl5BanBnXkFtZTgwOTgzMTAyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1179677","name":"Paul Scheer","idIMDB":"nm1179677"},"actorId":"nm1179677","character":"Cameraman","urlCharacter":"http://www.imdb.com/character/ch0455620","main":true},{"actorName":"Jason Simpson","urlProfile":"http://www.imdb.com/name/nm1154301","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk2NjIwODA2Ml5BMl5BanBnXkFtZTgwNzYwOTMxODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Jason Simpson is an actor, known for League of Legends (2009), Sausage Party (2016) and My Little Pony: Friendship Is Magic (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk2NjIwODA2Ml5BMl5BanBnXkFtZTgwNzYwOTMxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1154301","name":"Jason Simpson","idIMDB":"nm1154301"},"actorId":"nm1154301","character":"Barry / Hazmat / Pilot","urlCharacter":"http://www.imdb.com/character/ch0455619","main":true},{"actorName":"Sarah Jessica Parker","urlProfile":"http://www.imdb.com/name/nm0000572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDY0MzMxMV5BMl5BanBnXkFtZTcwMzMxNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1965","placeOfBirth":" Nelsonville, Ohio, USA","height":"5' 3\" (1.6 m)","bio":"Sarah Jessica Parker was born March 25, 1965, in Nelsonville, Ohio, to Barbra Forste (née Keck), a teacher who ran a nursery school, and Stephen Parker, a journalist. Her parents divorced, and her mother later remarried to Paul Forste and had four more children, bringing the total to eight. Sarah now had 3 full siblings and 4 half siblings. Her father was of Eastern European Jewish ancestry, and her mother had German, and some English, roots. Trained in singing and ballet, Sarah was cast in the Broadway production of \"The Innocents\", which prompted her family to relocate to New Jersey. Already a professional performer (she studied at the American Ballet School and the Professional Children's School), Sarah was cast in \"The Sound of Music\" (along with four of her siblings), and landed the lead in the Broadway run of \"Annie\". After a year as the free-spirited orphan, Sarah attended Dwight Morrow High School, while continuing to add more credits to her acting resume. She landed a role in the made-for-TV movie My Body, My Child (1982), before being cast as one of the lead roles in the 1982 sitcom Square Pegs (1982), as high-schooler Patty Green. Once a graduate, Sarah decided to pursue a full-time acting career rather than further her education. Since Square Pegs (1982) did not last more than a year, Sarah moved on to supporting film roles in movies such as Footloose (1984), Firstborn (1984), and the lead role in the teenage film Girls Just Want to Have Fun (1985). Sarah was having lots of fun, although she had yet to land a star-turning role. After more television appearances in series and made-for-TV movies including A Year in the Life (1986), The Room Upstairs (1987) and A Long Way from Home: Dadah Is Death (1988), Sarah finally landed the role of Steve Martin's bubbly lover in the 1991 comedy L.A. Story (1991). More substantial film roles soon followed, starting with a role opposite Nicolas Cage in Honeymoon in Vegas (1992) (which foreshadowed her comedic talent), Hocus Pocus (1993) and Ed Wood (1994). A big Woody Allen fan, she starred opposite the renowned filmmaker in the television movie The Sunshine Boys (1996), and that same year, she landed a starring role in Miami Rhapsody (1995). 1996 was a film intensive year with roles in The First Wives Club (1996), If Lucy Fell (1996), and Mars Attacks! (1996). All the while making a name for herself in film, Sarah was gaining respect as a theater actress, with her lead role as a dog (hard to imagine, but true) in the off-Broadway \"Sylvia\", and her Broadway roles in \"How to Succeed in Business Without Really Trying\" (starring her present husband, Matthew Broderick), and the Tony-Award nominated \"Once Upon a Mattress\". But Sarah's star has shot up since her portrayal of Manhattan sex-columnist Carrie Bradshaw in the HBO series Sex and the City (1998). Sarah's Golden Globe Best Actress victory in 2000 only underscores the fact that she plays the role of Carrie as though it were literally written for her. Sarah has been happily married to fellow actor Matthew Broderick for quite a while now. Before the marriage, she dated Robert Downey Jr. (who she also lived with), and the late John Kennedy Jr. When not serving as lead actress and producer of Sex and the City (1998), Sarah is a member of Hollywood's Women's Political Committee, and is UNICEF's representative for the Performing Arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDY0MzMxMV5BMl5BanBnXkFtZTcwMzMxNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000572","name":"Sarah Jessica Parker","nicknames":["SJP"],"idIMDB":"nm0000572"},"actorId":"nm0000572","character":"Kira Supernova","urlCharacter":"http://www.imdb.com/character/ch0146337","main":true},{"actorName":"Doug Abrahams","urlProfile":"http://www.imdb.com/name/nm0009002","urlPhoto":"","biography":{"bio":"Doug Abrahams is known for his work on Man of Steel (2013), Fantastic Four (2005) and Jin-Roh: The Wolf Brigade (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0009002","name":"Doug Abrahams","idIMDB":"nm0009002"},"actorId":"nm0009002","character":"Hazmat / Baabian Citizen","urlCharacter":"http://www.imdb.com/character/ch0166586","main":true},{"actorName":"Jason Benson","urlProfile":"http://www.imdb.com/name/nm1972338","urlPhoto":"","biography":{"bio":"Jason Benson is an actor, known for Escape from Planet Earth (2013), Stargate: Continuum (2008) and American Pie Presents: The Book of Love (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1972338","name":"Jason Benson","idIMDB":"nm1972338"},"actorId":"nm1972338","character":"Hazmat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Trevor Devall","urlProfile":"http://www.imdb.com/name/nm0222175","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTMzNjY3N15BMl5BanBnXkFtZTgwNzQzODg3MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1972","placeOfBirth":" Edmonton, Alberta, Canada","bio":"A native of Edmonton, Canada, Trevor Devall spent 15 years in Vancouver's voice-over industry as an animation and commercial voice actor. He is a prolific voice artist, having performed in hundreds of animated productions including television movies, series, feature films and video games. Some highlights: Rocket Raccoon in Marvel's Guardians of the Galaxy, Emperor Palpatine/Darth Sidious, Admiral Ackbar and Jar Jar Binks in Lego Star Wars: The Yoda Chronicles and Droid Tales, a wide assortment of supporting characters on Netflix's F is for Family, Iron Will, Hoity Toity and Fancy Pants (for which he was nominated for a UBCP Award for Best Voice) on My Little Pony: Friendship is Magic, Dukey on Cartoon Network's Johnny Test, Captain America and others in Marvels' Wolverine vs Sabretooth, Jayce on the globally popular League of Legends video game, Colossus on Joss Whedon's Astonishing X-Men, Dad on Disney's Kid vs Kat, Mu Laflaga in Gundam Seed, Togusa in Ghost in the Shell-SAC, Mr. Palmer, Ike and many others on Zeke's Pad, Moordryd Payne on Dragon Booster, Aizawa on Death Note, Chang and the maniacal Irishman Leigarch on Black Lagoon, Alpha Q in Transformers: Energon, Pyro in X-Men: Evolution, Wild Weasel in G.I. Joe: Valor vs. Venom, Scourge in Transformers: Cybertron, and the voice of the alien helmsman Hermiod on Stargate: Atlantis. For feature films, he has performed roles including Baramanda in the CG feature A.R.K. (with James Woods), Toa Pohatu in Bionicle: Mask of Light, Toa Nuju in Bionicle: Legends of Metru Nui, and Shesta in Escaflowne. He recently appeared in Escape from Planet Earth with Brendan Fraser and William Shatner. Trevor also starred as the villainous Sir Atticus Moon alongside Big Time Rush in their made-for-Nickelodeon feature, Big Time Movie. He is the host of the popular podcast, Voiceprint with Trevor Devall and Guests, an Internet talk show featuring some of animation's biggest voice performers, available under the \"Voiceprint\" menu on this website, or on iTunes. Trevor can also be heard narrating \"Million Dollar Neighborhood\" on the Oprah Winfrey Network, as well as \"Uberguide\" on TLC. Additionally, Trevor is an award-winning writer and director. Nominated for four Jessie Awards (including the Sydney Risk Prize For Outstanding Original Play), his play The Back Kitchen Release Party capped off the Vancouver Arts Club Theatre's 2008 season after a successful three-year run throughout British Columbia. Trevor's Leo-Award-winning film, The Plaids (which he wrote, produced and directed), aired on The Comedy Network and Space: The Imagination Station from 2001-2004. Trevor has also written episodes for several major animated programs, including The Very Good Adventures of Yam Roll in Happy Kingdom. In addition to performing for animation, Trevor works as a voice acting coach, and has taught acting at some of the finest institutions in Vancouver. He has recently expanded his operations and relocated to Los Angeles, having worked on various projects for Disney, Dreamworks. Warner Bros., and others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTMzNjY3N15BMl5BanBnXkFtZTgwNzQzODg3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0222175","name":"Trevor Devall","idIMDB":"nm0222175"},"actorId":"nm0222175","character":"Hazmat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Dobson","urlProfile":"http://www.imdb.com/name/nm0229889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU2Nzg5NjQ3NV5BMl5BanBnXkFtZTgwNzEzNTYyNTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1973","placeOfBirth":" England, UK","height":"6' 1\" (1.85 m)","bio":"Brian Dobson was born on September 9, 1973 in England. He is known for his work on Sausage Party (2016), Escape from Planet Earth (2013) and Fantastic Four: World's Greatest Heroes (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU2Nzg5NjQ3NV5BMl5BanBnXkFtZTgwNzEzNTYyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0229889","name":"Brian Dobson","idIMDB":"nm0229889"},"actorId":"nm0229889","character":"Hazmat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Dryborough","urlProfile":"http://www.imdb.com/name/nm0238694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5OTYzOTMwOF5BMl5BanBnXkFtZTcwNTIyNTgyMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1967","placeOfBirth":" Winnipeg, Manitoba, Canada","bio":"Brad Dryborough was born on August 25, 1967 in Winnipeg, Manitoba, Canada. He is an actor and producer, known for The Cabin in the Woods (2012), The Thaw (2009) and The Day the Earth Stood Still (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5OTYzOTMwOF5BMl5BanBnXkFtZTcwNTIyNTgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0238694","name":"Brad Dryborough","idIMDB":"nm0238694"},"actorId":"nm0238694","character":"Hazmat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabe Khouth","urlProfile":"http://www.imdb.com/name/nm0451917","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzODg1MDA2Ml5BMl5BanBnXkFtZTcwNzU2ODExOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1972","placeOfBirth":" North Vancouver, British Columbia, Canada","bio":"Gabe Khouth was born on November 2, 1972 in North Vancouver, British Columbia, Canada. He is an actor, known for It (1990), Big Eyes (2014) and Once Upon a Time (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzODg1MDA2Ml5BMl5BanBnXkFtZTcwNzU2ODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0451917","name":"Gabe Khouth","idIMDB":"nm0451917"},"actorId":"nm0451917","character":"Hazmat","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0765446","urlIMDB":"http://www.imdb.com/title/tt0765446","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$15,891,055","country":"USA","day":"17","month":"02","year":"2013","remarks":"3,288 Screens"},{"money":"HUF 8,653,983","country":"Hungary","day":"04","month":"05","year":"2014","remarks":""}],"gross":[{"money":"$57,011,847","country":"USA","day":"21","month":"07","year":"2013","remarks":""},{"money":"$56,958,051","country":"USA","day":"14","month":"07","year":"2013","remarks":""},{"money":"$56,885,485","country":"USA","day":"07","month":"07","year":"2013","remarks":""},{"money":"$56,852,484","country":"USA","day":"30","month":"06","year":"2013","remarks":""},{"money":"$56,784,246","country":"USA","day":"23","month":"06","year":"2013","remarks":""},{"money":"$56,690,667","country":"USA","day":"16","month":"06","year":"2013","remarks":""},{"money":"$56,548,355","country":"USA","day":"09","month":"06","year":"2013","remarks":""},{"money":"$56,322,427","country":"USA","day":"02","month":"06","year":"2013","remarks":""},{"money":"$56,039,400","country":"USA","day":"26","month":"05","year":"2013","remarks":""},{"money":"$55,612,398","country":"USA","day":"19","month":"05","year":"2013","remarks":""},{"money":"$55,340,718","country":"USA","day":"12","month":"05","year":"2013","remarks":""},{"money":"$55,210,402","country":"USA","day":"05","month":"05","year":"2013","remarks":""},{"money":"$55,050,333","country":"USA","day":"28","month":"04","year":"2013","remarks":""},{"money":"$54,849,381","country":"USA","day":"21","month":"04","year":"2013","remarks":""},{"money":"$54,660,113","country":"USA","day":"14","month":"04","year":"2013","remarks":""},{"money":"$54,440,464","country":"USA","day":"07","month":"04","year":"2013","remarks":""},{"money":"$53,927,096","country":"USA","day":"31","month":"03","year":"2013","remarks":""},{"money":"$53,354,899","country":"USA","day":"24","month":"03","year":"2013","remarks":""},{"money":"$52,178,000","country":"USA","day":"17","month":"03","year":"2013","remarks":""},{"money":"$47,844,105","country":"USA","day":"10","month":"03","year":"2013","remarks":""},{"money":"$43,106,877","country":"USA","day":"03","month":"03","year":"2013","remarks":""},{"money":"$34,812,699","country":"USA","day":"24","month":"02","year":"2013","remarks":""},{"money":"$21,101,976","country":"USA","day":"17","month":"02","year":"2013","remarks":""}],"weekendGross":[{"money":"$1,005","country":"USA","day":"21","month":"07","year":"2013","remarks":"7 Screens"},{"money":"$62,002","country":"USA","day":"14","month":"07","year":"2013","remarks":"55 Screens"},{"money":"$9,221","country":"USA","day":"07","month":"07","year":"2013","remarks":"62 Screens"},{"money":"$30,425","country":"USA","day":"30","month":"06","year":"2013","remarks":"101 Screens"},{"money":"$43,382","country":"USA","day":"23","month":"06","year":"2013","remarks":"138 Screens"},{"money":"$61,320","country":"USA","day":"16","month":"06","year":"2013","remarks":"151 Screens"},{"money":"$107,144","country":"USA","day":"09","month":"06","year":"2013","remarks":"182 Screens"},{"money":"$195,323","country":"USA","day":"02","month":"06","year":"2013","remarks":"268 Screens"},{"money":"$254,423","country":"USA","day":"26","month":"05","year":"2013","remarks":"346 Screens"},{"money":"$244,552","country":"USA","day":"19","month":"05","year":"2013","remarks":"693 Screens"},{"money":"$101,481","country":"USA","day":"12","month":"05","year":"2013","remarks":"254 Screens"},{"money":"$123,640","country":"USA","day":"05","month":"05","year":"2013","remarks":"257 Screens"},{"money":"$161,796","country":"USA","day":"28","month":"04","year":"2013","remarks":"283 Screens"},{"money":"$144,392","country":"USA","day":"21","month":"04","year":"2013","remarks":"240 Screens"},{"money":"$158,175","country":"USA","day":"14","month":"04","year":"2013","remarks":"276 Screens"},{"money":"$261,795","country":"USA","day":"07","month":"04","year":"2013","remarks":"432 Screens"},{"money":"$235,117","country":"USA","day":"31","month":"03","year":"2013","remarks":"977 Screens"},{"money":"$477,522","country":"USA","day":"24","month":"03","year":"2013","remarks":"1,494 Screens"},{"money":"$2,339,419","country":"USA","day":"17","month":"03","year":"2013","remarks":"2,211 Screens"},{"money":"$3,218,923","country":"USA","day":"10","month":"03","year":"2013","remarks":"2,549 Screens"},{"money":"$6,619,827","country":"USA","day":"03","month":"03","year":"2013","remarks":"3,110 Screens"},{"money":"$10,682,037","country":"USA","day":"24","month":"02","year":"2013","remarks":"3,353 Screens"},{"money":"$15,891,055","country":"USA","day":"17","month":"02","year":"2013","remarks":"3,288 Screens"}],"admissions":[{"money":"9,505","country":"Portugal","day":"18","month":"09","year":"2013","remarks":""},{"money":"8,455","country":"Portugal","day":"11","month":"09","year":"2013","remarks":""},{"money":"4,666","country":"Portugal","day":"04","month":"09","year":"2013","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min) (USA)"],"soundMix":["Dolby Digital","Datasat"],"color":["Color","Black and White"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","DeLuxe, Vancouver, Canada (digital intermediate)"],"filmLength":["2,444.9 m (5 reels)"],"negativeFormat":["Digital"],"cinematographicProcess":["Digital 3-D (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema (also 3-D version)"]},"rating":"6.0","metascore":"35","filmingLocations":[],"rated":"PG","awards":[{"award":"BMI Film & TV Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"Film Music","names":[{"name":"Aaron Zigman","id":"nm0956374","role":null}]}]}]}],"votes":"21,408","type":"Movie","companyCreditsSimple":[{"idCompany":"co0003199","name":"Blue Yonder Films"},{"idCompany":"co0414628","name":"GRF Productions"},{"idCompany":"co0168855","name":"Jon Shestack Productions"}],"keywords":{"keywords":["alien","mission control","rescue","cgi animation","product placement","escape","computer animation","prison","trailer park","convenience store","nerd","arrogance","cryogenic storage","remote control vehicle","xenophobia","3 eyed alien","sibling rivalry","super weapon","prison labor","online dating","spaceship","attempted genocide","power armor","kidnapping","brother brother relationship","area 51"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:33:12"}}