{"data":{"movies":[{"title":"Flight of Fury","originalTitle":"","year":"2007","releaseDate":"20070220","directors":[{"name":"Michael Keusch","id":"nm0450661"}],"writers":[{"name":"Steven Seagal","id":"nm0000219"},{"name":"Joe Halpin","id":"nm1546172"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNDA4MDUxOV5BMl5BanBnXkFtZTcwODEyMTc0MQ@@._V1.jpg","countries":["UK","Romania","USA"],"languages":["English"],"genres":["Action","Thriller"],"plot":"--**Contains Spoilers**----Air Force pilot John Sands has been wrongfully imprisoned in a military detention center, where his memory is to be chemically wiped because some of his superiors feel threatened by the knowledge that he gained from his assignments to operations that were deemed too sensitive for the regular intelligence services. Later, after John escapes from the detention center, a top secret Air Force Stealth Bomber known as the X-77, which uses the latest in stealth cloaking technology, making it capable of going anywhere undetected, is stolen by corrupt Air Force pilot Ratcher. General Tom Barnes, John's former commander, hears that John has been arrested after taking down a group of men who were robbing a rest stop. Knowing that John was Ratcher's trainer, Barnes sends John to northern Afghanistan with fellow pilot Rick Jannick to recover the X-77, promising John that he will be a free man if he succeeds. Barnes has Admiral Frank Pendleton, who is on an aircraft ...","simplePlot":"John is sent in to recover a stolen Stealth Bomber. His trusty sidekick Rojar and ever faithful Jessica fight the rebel forces of Banansistan, led by the vivacious Ellianna.","actors":[{"actorName":"Steven Seagal","urlProfile":"http://www.imdb.com/name/nm0000219","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTU4ODcyMV5BMl5BanBnXkFtZTYwMzkyMjA1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1952","placeOfBirth":" Lansing, Michigan, USA","birthName":"Steven Frederic Seagal","height":"6' 4\" (1.93 m)","bio":"Steven Seagal is a striking and somewhat boyishly handsome (often with ponytail) action star who burst onto the martial arts film scene in 1988 in the fast-paced Warner Bros. film Above the Law (1988). Steven Frederic Seagal was born in Lansing, Michigan, to Patricia Anne (Fisher), a medical technician, and Samuel Seagal, a high school math teacher. His paternal grandparents were Russian Jewish immigrants, and his mother had English, German, and Dutch ancestry. The enigmatic Seagal commenced his martial arts training at the age of seven under the tutelage of well-known karate instructor and author Fumio Demura, and in the 1960s commenced his aikido training in Orange County, CA, under the instruction of Harry Ishisaka. Seagal received his first dan accreditation in 1974, after he had moved to Japan to further his martial arts training. After spending many years there honing his skills, he achieved the ranking of a 7th dan in the Japanese martial art \"aikido\" and was instructing wealthy clients in Los Angeles when he came to the attention of Hollywood power broker Michael Ovitz. Ovitz saw star value in the imposing-looking Seagal. The high-octane action movie genre was in full swing in the late 1980s, and Seagal's debut movie, \"Above the Law\", was wildly received by action fans and actually received some complimentary critical reviews. He followed up \"Above the Law\" with another slam-bang thriller, Hard to Kill (1990), as a cop shot in an ambush by the mob who revives from a coma to take his revenge. The movie also starred Seagal's wife at the time, leggy Kelly LeBrock, who was married to him from 1987 to 1996 and is the mother of three of his children. His next outing was battling voodoo-using Jamaican drug \"posses\" in the hyper-violent Marked for Death (1990), before returning to fight psychotic mob gangster William Forsythe in the even more punishing Out for Justice (1991). Seagal was by now enormously popular, and his next movie, the big-budgeted Piège en haute mer (1992), set aboard the battleship USS Missouri and also starring Tommy Lee Jones and Gary Busey, was arguably his best film to date, impressing both fans and critics alike. Seagal's fighting style was rather different from that of other on-screen martial arts dynamos such as Bruce Lee, Chuck Norris and Jean-Claude Van Damme, who were predominantly fighters from striking arts background such as karate or tang soo do. However, aikido is built around using an opponent's inertia and body weight to employ various locks, chokes and holds that incapacitate him. Seagal carries himself differently, too, and often appears wearing Italian designer clothes and usually favors an all-black outfit, generally with a three-quarter-length coat with an elaborate trim. Additionally, Seagal's on-screen characters were often seemingly benign or timid individuals; however, when the going gets rough they reveal themselves to be deadly ex-CIA operatives, or retired Special Forces soldiers capable of enormous destruction! As his box-office drawing power grew, Seagal began to infuse his film projects with his personal and spiritual beliefs, especially concerning the abuse of the environment. He appeared as an oil fire expert who turns against his corrupt CEO (played by Michael Caine) in On Deadly Ground (1994) to save the Eskimo population from an oil disaster; in Fire Down Below (1997) he plays an environmental agency troubleshooter investigating the dumping of toxic waste in Kentucky coal mines, and in the slow-moving The Patriot (1998) he plays a medical specialist trying to stop a lethal virus unleashed by an extremist group. Action fans struggled to come to terms with social messaging being built into bone-crunching fight films; however, Seagal's box-office clout remained fairly strong, and more traditional chopsocky projects followed with the \"buddy cop\" film The Glimmer Man (1996), then almost a cameo role as a Navy SEAL alongside CIA analyst Kurt Russell before Seagal is sucked out of a jet at 35,000 feet in Executive Decision (1996). In 1999 Seagal took a different turn in his film projects with the surprising genteel Prince of Central Park (2000), about a child living inside NYC's most famous park. He returned to more familiar territory with further high-voltage, guns-blazing action in Exit Wounds (2001), Mission Alcatraz (2002), Out for a Kill (2003) and Un aller pour l'enfer (2003). Unbeknownst to many, in 1997 Seagal publicly announced that one of his Buddhist teachers, His Holiness Penor Rinpoche, had accorded Seagal as a tulku, the reincarnation of a Buddhist Lama. This initial announcement was met with some disbelief until Penor Rinpoche himself gave a confirmation statement on Seagal's new title. Seagal has repeatedly discussed his involvement in Buddhism and how he devotes many hours studying and meditating this ancient Eastern religion. While his box-office appeal has somewhat declined from his halcyon blockbusters of the mid-'90s, Seagal still has a very loyal fan base in the action movie genre and continues to remain a highly bankable star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTU4ODcyMV5BMl5BanBnXkFtZTYwMzkyMjA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000219","name":"Steven Seagal","nicknames":["The Great One","Lord Steven","The Master of Aikido"],"idIMDB":"nm0000219"},"actorId":"nm0000219","character":"John Sands","urlCharacter":"http://www.imdb.com/character/ch0039038","main":true},{"actorName":"Steve Toussaint","urlProfile":"http://www.imdb.com/name/nm0869750","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTczMzUzMl5BMl5BanBnXkFtZTgwMDk1NjgyMTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1965","placeOfBirth":" UK","bio":"Steve Toussaint was born on March 22, 1965 in the UK. He is an actor and writer, known for Prince of Persia: The Sands of Time (2010), Judge Dredd (1995) and Beyond the Gates (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTczMzUzMl5BMl5BanBnXkFtZTgwMDk1NjgyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0869750","name":"Steve Toussaint","idIMDB":"nm0869750"},"actorId":"nm0869750","character":"Col. Ratcher","urlCharacter":"http://www.imdb.com/character/ch0408125","main":true},{"actorName":"Angus MacInnes","urlProfile":"http://www.imdb.com/name/nm0532815","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY5MjcyNzUzMF5BMl5BanBnXkFtZTgwMDg3MTUxMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1947","placeOfBirth":" Windsor, Ontario, Canada","height":"6' 3\" (1.91 m)","bio":"Angus MacInnes was born on October 27, 1947 in Windsor, Ontario, Canada. He is an actor, known for Star Wars: Episode IV - A New Hope (1977), Captain Phillips (2013) and Hellboy (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY5MjcyNzUzMF5BMl5BanBnXkFtZTgwMDg3MTUxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0532815","name":"Angus MacInnes","idIMDB":"nm0532815"},"actorId":"nm0532815","character":"Gen. Tom Barnes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Bazeley","urlProfile":"http://www.imdb.com/name/nm0063303","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzA3ODA5OV5BMl5BanBnXkFtZTcwMDg0MTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1970","placeOfBirth":" Wantage, Oxfordshire, England, UK","bio":"Mark Bazeley was born on September 30, 1970 in Wantage, Oxfordshire, England. He is an actor, known for The Bourne Ultimatum (2007), The Queen (2006) and The Damned United (2009). He has been married to Victoria Hamilton since January 22, 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzA3ODA5OV5BMl5BanBnXkFtZTcwMDg0MTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0063303","name":"Mark Bazeley","idIMDB":"nm0063303"},"actorId":"nm0063303","character":"Capt. Richard Jannick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ciera Payton","urlProfile":"http://www.imdb.com/name/nm2234564","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MWFjNDEtZWYzMC00Y2JmLTllMDgtYWUzMGZhYWQ0NTllL2ltYWdlXkEyXkFqcGdeQXVyMTA2MTg2ODY@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1986","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 8\" (1.73 m)","bio":"Those who know Ciera Payton would describe her as a deeply creative and powerful individual with an unwavering dedication to the arts. An accomplished actor, writer and social activist, there is no doubt Ms. Payton has earned the respect of her peers and established herself as a well-respected pillar of the entertainment industry. Acting has always been Ciera's true calling. As a girl growing up in the vibrant city of New Orleans, Ciera was accustomed to being an artistically creative person. She would observe the street performers blowing their horns, take in the strokes of the impressive murals scattered throughout the city, taste the love in every spoon full of gumbo, and love moving to the percussive rhythms of the brass bands. These daily experiences fed Ciera's passion to becoming a successful working actor. Drawing inspiration from her idols Dr. Maya Angelou, Lena Horne, and Sophia Loren, Ciera knew she wanted to tell stories and give her voice to dynamic, strong, complex characters; bringing them to life from her own experiences. Her pursuit to be a highly-sought after actress led her to learn everything about the craft of acting. For high school, Ciera attended the New Orleans Center for Creative Arts (NOCCA) and graduated a full year early ahead of her peers. With an extra year in her hand, Ciera went on to obtain a BFA in Drama from the University of North Carolina School of the Arts (UNCSA). In her sophomore year in college, Ciera auditioned for and landed the female lead in the action-packed feature Flight of Fury starring opposite Steven Seagal. Equally as comfortable in front of the lens as she is in being a student of the theater, Ciera's natural acting ability has allowed her to share screen time with well-known actors including Nicholas Cage, Josh Brolin, Viola Davis and Kevin Hart. While ever committed to her acting career, Ciera manages to find time to give back to her local community. With a dedication to arts education and community service, Ciera created the Michael's Daughter Project; an annual theater and media arts summer camp in Panorama City, California serving the youth in underprivileged communities. Ciera teaches and empowers the youth to use their voice and tell their story through theater and short films. In addition to her creative endeavors, Ciera is the owner of Sincerely Ciera Payton Cosmetics, an all natural mineral based cosmetic company which caters to health conscious women who deal with sensitive skin. In the little free time she has, Ciera enjoys sewing, painting, cooking, and most importantly dancing! A passionate desire for life and ability to communicate with people from any background, Ciera embraces her daily role as a creative storyteller. She continues to have an unwavering commitment to always be her best, challenge the limits of everything she does, while always remaining true to her creative motivations.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MWFjNDEtZWYzMC00Y2JmLTllMDgtYWUzMGZhYWQ0NTllL2ltYWdlXkEyXkFqcGdeQXVyMTA2MTg2ODY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2234564","name":"Ciera Payton","idIMDB":"nm2234564"},"actorId":"nm2234564","character":"Jessica","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alki David","urlProfile":"http://www.imdb.com/name/nm0202810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjYzMzU4M15BMl5BanBnXkFtZTYwMTY3NTcy._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1968","placeOfBirth":" Lagos, Nigeria","height":"5' 10\" (1.78 m)","bio":"Alki David Greek was born in West Africa hi colorful experiences include a voluntary bout in the British armed forces, lab analyst for Coca Cola, as a fish farm laborer, water-ski instructor, PADI scuba instructor and radio jock. 2014 Alki owns and operated FilmOn.TV the online streaming site he started in 2007 and as well as HologramUSA a patented technology company responsible for Tupac at Coachella and many other resurrection concerts. Having graduated London's prestigious the Royal College of Art and relocated to California in 1991, Alki owned and operated a post-production facility called Beverly Hills Video Group. AFter building and selling a post production business BHVG, Alki returned to his London home in 1998. He then started a joint venture with ICM Europe's Chairman, Duncan Heath. This joint venture includes a television production company and what is now one of London's top model Agency, Independent Models. Alki set up an independent Rock label,which he distributes through Universal Music UK. He has also partnered with Matt Rhodes and Judd Payne in hot Hollywood indie shingle Persistent Pictures. In 2006, Alki launched 111 Pictures Ltd is a UK-based independent production and international sales company. A partnership between filmmaker, actor and business tycoon Alki David and veteran film producer Elliott Kastner. In 1995 he founded BIOS (Ancient Greek for Life), a non profit marine conservation agency which performs massive underwater cleanups all over Greece and whose members lecture at the high-school level as to the importance of maintaining a healthy marine environment. BIOS sponsors and organizes World Record Freediving events on Alki's Greek island home of Spetses.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjYzMzU4M15BMl5BanBnXkFtZTYwMTY3NTcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0202810","name":"Alki David","idIMDB":"nm0202810"},"actorId":"nm0202810","character":"Rojar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Woodward","urlProfile":"http://www.imdb.com/name/nm0941000","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDk3MjY0M15BMl5BanBnXkFtZTcwNjU5NDk1NA@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1953","placeOfBirth":" London, England, UK","bio":"Tim Woodward was born on April 24, 1953 in London, England. He is an actor, known for K-19: The Widowmaker (2002), Legend (2015) and Wings (1977).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDk3MjY0M15BMl5BanBnXkFtZTcwNjU5NDk1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0941000","name":"Tim Woodward","idIMDB":"nm0941000"},"actorId":"nm0941000","character":"Admr. Frank Pendleton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vincenzo Nicoli","urlProfile":"http://www.imdb.com/name/nm0630405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTU3MzI3NV5BMl5BanBnXkFtZTgwOTI0MzIzMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Vincenzo Nicoli is known for his work on The Dark Knight (2008), Captain Phillips (2013) and Alien 3 (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTU3MzI3NV5BMl5BanBnXkFtZTgwOTI0MzIzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0630405","name":"Vincenzo Nicoli","idIMDB":"nm0630405"},"actorId":"nm0630405","character":"Peter Stone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katie Jones","urlProfile":"http://www.imdb.com/name/nm0428514","urlPhoto":"","biography":{"bio":"Katie Jones is an actress, known for Flight of Fury (2007), Deserter (2002) and The Natural History of Parking Lots (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0428514","name":"Katie Jones","idIMDB":"nm0428514"},"actorId":"nm0428514","character":"Eliana Reed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Cooper","urlProfile":"http://www.imdb.com/name/nm3094433","urlPhoto":"","biography":{"bio":"Gary Cooper is an actor, known for Flight of Fury (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3094433","name":"Gary Cooper","idIMDB":"nm3094433"},"actorId":"nm3094433","character":"Cmdr. Bud Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bart Sidles","urlProfile":"http://www.imdb.com/name/nm1952831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDEyNDgzOV5BMl5BanBnXkFtZTcwOTMwNDM1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1968","placeOfBirth":" Lincoln, Nebraska, USA","birthName":"Frank Barton Sidles II","bio":"Bart Sidles was born on December 3, 1968 in Lincoln, Nebraska, USA as Frank Barton Sidles II. He is an actor, known for Mirrors (2008), Stuff That Bear! (2003) and Van Wilder 2: The Rise of Taj (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDEyNDgzOV5BMl5BanBnXkFtZTcwOTMwNDM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1952831","name":"Bart Sidles","nicknames":["Barton Sidles"],"idIMDB":"nm1952831"},"actorId":"nm1952831","character":"Capt. 'Fox' Hinkle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cristina Teodorescu","urlProfile":"http://www.imdb.com/name/nm0855234","urlPhoto":"","biography":{"bio":"Cristina Teodorescu is an actress, known for Flight of Fury (2007), Anaconda: The Offspring (2008) and Anacondas: Trail of Blood (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0855234","name":"Cristina Teodorescu","idIMDB":"nm0855234"},"actorId":"nm0855234","character":"Pendleton's Operational Soldier Lisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rares George Panfil","urlProfile":"http://www.imdb.com/name/nm2562559","urlPhoto":"","biography":{"bio":"Rares George Panfil is known for his work on Flight of Fury (2007), Sons of Liberty (2015) and Hatfields & McCoys (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2562559","name":"Rares George Panfil","idIMDB":"nm2562559"},"actorId":"nm2562559","character":"Williams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noah Lee Margetts","urlProfile":"http://www.imdb.com/name/nm0546664","urlPhoto":"","biography":{"dateOfBirth":"22 November 1970","placeOfBirth":" Bury St. Edmunds, Suffolk, England, UK","height":"5' 10½\" (1.79 m)","bio":"Noah was born to a British father and an American mother, in a tiny village outside Bury St. Edmunds, England. Two-weeks later he was living in New Mexico, on a high altitude quarter-horse training ground, with his parents and the likes of Dennis Hopper & friends (circa 1970). At the age of 3, Noah's mother tragically passed away. He then began living in New York with his father. At age 9, his father also passed. Noah had by then, moved to Miami where he was being raised by his grandparents until age 15, at which time, he embarked out on his own two feet, paying rent and running his own car washing business. He attended college to study journalism and rose to Features Editor for the campus newspaper, The Falcon Times, which at the time was rated the number one college newspaper in the U.S. During his time in high school and college he interned for, and then became a staff member of, the local TV station WSVN. He started out as a utility and rose to E.N.G. (Electronic News Gather). During his time at the station, he was shot at, raided crack dens with the police & flew in a helicopter in search of escaped buffalo amongst many other news adventures. However, soon it wasn't enough, and he left Florida for California 2 years later, in search of the notorious \"wild oats\". It was indeed a wild couple of months as Noah crossed the country in his ever breaking-down Volkswagen Transporter. When it finally died in Gila Bend, Arizona, he sold what he couldn't carry and went to a friend of a friend's in San Francisco. Noah initially settled in the Tenderloin district of San Francisco for about a year while studying acting with Bruno Borello. However, he soon got the itch to go south and jump into the void that is Los Angeles. After a brief few months, he started to find success in the form of a GTE commercial. This granted him access to the elusive S.A.G. card, and from there he kept on going. From \"Chaplin\" with Robert Downey Jr., to \"Cruel Doubt\" with Gyneth Paltrow. He soon found himself moving up from The Gage Group to the magnificent Johnathan Howard and the machine that is the William Morris Agency. He stayed with them for the following 4 years and racked up such shows as 19, for CBS by Amy Heckerling (Clueless) and 20 Bucks, playing Brendan Fraser's best man. In 1995, Noah left L.A. to come to sunny London where, once again, he immediately started working. First was John Sullivan's WWII mini-series \"Over Here\", with Sam West and Martin Clunes. A number of other soldier roles has ensued over the years since coming to the UK, most recently in Buffalo Soldiers, where Noah opens the film in a gritty army-noir film by Aussie Gregor Jordan. Most recently Noah has appeared in Batman: The Beginning and currently is playing in \"Death of a Salesman\" on London's West End. Noah continues to work in roles for film, television, stage and voice. On the stage Noah played in the Private Room at the New End Theatre as well as garnering Time Out Critic's Choice for his role in Gompers at The Arcola Theatre. Noah is also a prolific Voice-Over artist and can be heard in everything from ads, to video games to documentary narrations and language tapes. Video games like Viet Cong (Crockett), Sacred(Battle Mage), Carve(Moki), Starship Troopers (Base Leader); Documentaries like Miracle Statues (BBC/Discovery Channel), Bush for a day (BBC3), A Newsreel History of the Third Reich (20 Programmes, Arts Magic, UK); and ads for Budweiser, American Airlines, Lego Sports, Virgin Mega-Stores amongst many others. Noah has also written several film scripts, plays and television pilots and is now shopping them around to get them produced. Watch this space for future developments.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0546664","name":"Noah Lee Margetts","idIMDB":"nm0546664"},"actorId":"nm0546664","character":"Eliana's Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen David","urlProfile":"http://www.imdb.com/name/nm1314042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Mjg3Nzc1OV5BMl5BanBnXkFtZTgwMjU1MDM0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Karen Shenaz David","height":"5' 3\" (1.6 m)","bio":"From India to Canada, England to America, Karen David has crisscrossed the world making true fans everywhere along the way. With her exotic beauty and multicultural pedigree, of which she includes Chinese, Khasi tribe, and Indian, the actress and singer/songwriter has found equal diversity in her film, television, stage and recording career, fueled in no small part by an extraordinary talent and natural charisma. 2016 has been a very busy year for the sought after actress, in both North America and in the UK. Fully revealing her comedy chops, Karen David returned for Season 2 to star in the Emmy nominated, ABC comedy musical fairytale, \"Galavant\", earlier this year. In the medieval adventure, described as \"Monty Python meets Princess Bride,\" David played Princess Isabella, who enlists a once-gallant prince in order to save her people from an evil king. Shot in Bristol, England, the show is the creation of Dan Fogelman (Cars, Tangled, Crazy, Stupid, Love.), with songs by Oscar-winning composer Alan Menken and Christopher Lennertz, with lyricist Glenn Slater. Seasons 1 and 2 were recently added to Netflix, due to popular demand for the show from fans across the globe. Shortly after the Galavant season 2 premiere, Karen was snapped up to play opposite James Nesbitt, (The Hobbit Trilogy, Babylon) in the highly anticipated return of \"Cold Feet\", on ITV in the UK. Playing the glamorous, bio medical engineer, Angela Zubayr, she has quickly become the darling of the show as Adam's new love interest. The September 5th premiere debuted to 8.2 million viewers. From one Disney princess to another, Karen is now filming on ABC's, \"Once Upon A Time\" in the coveted role of Jasmine from Aladdin. The news of her casting was met with fanfare and press for being \"perfectly cast in the role\" and trended on Facebook worldwide for a week, as the top news item. Also on the horizon is \"The Tiger Hunter\", an independent film comedy with Danny Pudi, Kevin Pollak, Sam Page and Jon Heder, which kicked off to a great start in the festival circuit, having picked up 4 awards at the LAAPFF: Best Director, Best Picture, Best Ensemble Cast and the Audience Award. The film went on to win Best Feature at the Carmel Film Festival. She also has a leading role in two motion-capture video game projects, Mirror's Edge: Catalyst (EA) and another top game franchise (Capcom) which will be released this coming December. Born in Shillong, India in the foothills of the Himalayas, Karen David was raised in Toronto and came of age in the UK. At 17 she won a scholarship to Berklee College of Music in Boston, where she studied jazz and gospel. It was here she discovered a flair for songwriting and a love for drama, which led her to study at the Guildford School of Acting in London. It wasn't long after finishing drama school that she landed her first acting role in the original stage cast of the London West End musical Mamma Mia! Her talent as a singer and all-around performer led her to sign a record deal with BMG Europe, generating the 2003 single \"It's Me (You're Talking To),\" which became a Top Ten hit in Austria, Germany and Switzerland as well as BMG's fourth highest airplay hit for a debut artist. Soon after, she was discovered by composer A.R. Rahman (Slumdog Millionaire) who, impressed by her talents, invited David to help develop the soundtrack for the Bollywood-themed musical Bombay Dreams alongside Andrew Lloyd Webber and Don Black. They subsequently created the theme tune for the British drama \"Provoked,\" in which David had a supporting role. Unquestionably, it is her acting work in television that has earned Karen David the majority of her diehard fans in the UK and America. In the BBC's BAFTA-nominated \"Waterloo Road\" she played Francesca Montoya, a teacher who fell in love with a student. The storyline generated plenty of controversy, and more and more admirers fell for her compelling performance, with the series generating over nine million viewers per episode. Going on to co-star for two seasons on the hugely popular BBC comedy series \"Pixelface,\" produced by comedian Graham Norton's BAFTA award-winning company So Television, Karen David has begun to reap success on the other side of the pond: in MTV's \"Top Buzzer\" as a co-lead, in the action/thriller \"Strike Back\" for Cinemax, and in guest roles in the Fox drama \"Touch\" and the ABC crime drama \"Castle,\" prior to her work in ABC's \"Galavant.\" Her film career began with a supporting co-lead role as a member of an R&B band in the UK cult hit, \"Bollywood Queen\" with James McAvoy, leading to a supporting role in Batman Begins, a co- leading role in The Scorpion King: Rise of a Warrior, and notable performances in the Vince Vaughan comedy, \"Couples Retreat\", and in the Sigourney Weaver and Robert De Niro drama, \"Red Lights.\" More recently she portrayed a tough FBI agent in the blockbuster, \"Jack Ryan: Shadow Recruit\", and part of a dysfunctional family in the acclaimed British comedy romance Amar Akbar & Tony. On the musical front, Karen David is continually refining her passion for writing and recording \"feel-good, indie-girl pop with a twist.\" In the wake of her hit 2003 single, \"It's Me (You're Talking To),\" she released her first two EPs, The Live Sessions EP (2008) and Magic Carpet Ride (2009), followed by the 2010 single \"Hypnotize\" and three mixes. She shepherded the 2013 EP Dust to Stars, collaborating with such established songwriter/producers as Stefan Skarbek (Amy Winehouse), Carl Ryden (David Guetta, Nabiha, Cher, The Saturdays, Booty Luv), Boots Ottestad (Robbie Williams, Andy Grammer), Adam Argyle & Martin Brammer (Will Young, Newton Falkner, Olly Murs). She is back in the studio recording a new EP. Karen David is also an avid supporter of charity who devotes much of her time to campaigning for various issues. She has been active in raising funds for the Alzheimer's Association, and is also an ambassador for the Prince's Trust. Combining her love of music and support for charity, she released a charity Christmas album in 2010, entitled My Christmas List, to raise money for a housing and homelessness shelter. She is also an active supporter of SOS Children's Villages Foundation and Designers Against AIDS.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Mjg3Nzc1OV5BMl5BanBnXkFtZTgwMjU1MDM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1314042","name":"Karen David","nicknames":["KD","Shenu"],"idIMDB":"nm1314042"},"actorId":"nm1314042","character":"Barnes's Operational Soldier Flanders","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0783518","urlIMDB":"http://www.imdb.com/title/tt0783518","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"03","year":"2006","remarks":null},{"money":null,"country":null,"day":"30","month":"04","year":"2006","remarks":null}],"copyrightHolder":"© 2006 Pueblo Film Distribution Limited (on print)"},"technical":{"runtime":["1 hr 38 min (98 min)","1 hr 38 min (98 min) (Argentina)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.5","filmingLocations":[{"location":"Bucharest, Romania"}],"rated":"R","awards":[],"votes":"3,147","type":"Video","companyCreditsSimple":[{"idCompany":"co0020879","name":"Castel Film Romania"},{"idCompany":"co0097598","name":"Clubdeal"},{"idCompany":"co0003653","name":"Steamroller Productions"}],"keywords":{"keywords":["pilot","terrorist","bomber","street shootout","m 16","ak 47","krav maga","hand to hand combat","commando","tough girl","villainess","combat","stick fight","store robbery","pistol","machine gun","shootout","violence","punched in the face","catfight","brawl","action hero","tough guy","aikido","lesbianism","fighter plane","aviation","airplane","stealth fighter","throat slitting","martial arts","lesbian","female nudity","explosion","dogfight","bare breasts","blood","biological weapon","betrayal"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:37:34"}}