{"data":{"movies":[{"title":"The Initiation of Sarah","originalTitle":"","year":"2006","releaseDate":"20061022","directors":[{"name":"Stuart Gillard","id":"nm0318795"}],"writers":[{"name":"Dan Berendsen","id":"nm0073504"},{"name":"Tom Holland","id":"nm0276169"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzM5NTQwMV5BMl5BanBnXkFtZTcwNTU1MDE1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"When Sarah, a girl with magic powers, and her normal twin sister Lindsey are invited to join both Alpha Nu Gamma and Pi Epsilon Delta, they discover that the two sororities aren't just rivals, they're bitter enemies. Suddenly, Sarah and Lindsey are initiated into an ancient battle between good and evil that threatens to drive the sisters apart and force one of them to make the ultimate sacrifice. Can Sarah learn to master her magic in time to defeat the resident evil on campus? Who can she trust and who will commit an unforgivable act of betrayal? The magic starts flying and anything can happen. When these supernatural forces collide, they'll give new meaning to hell week.","simplePlot":"A college student uses her supernatural powers against a rival sorority house. A remake of the 1978 TV movie.","actors":[{"actorName":"Mika Boorem","urlProfile":"http://www.imdb.com/name/nm0095561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYyOTA4MGMtYzljYi00OGZiLWJjNTgtMWE1YmQ3YmVhMTdjL2ltYWdlXkEyXkFqcGdeQXVyMjAwMDUxMDc@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1987","placeOfBirth":" Tucson, Arizona, USA","birthName":"Mika Sue Boorem","height":"5' 5\" (1.65 m)","bio":"Mika Boorem is a actress, director, writer, and producer based in Los Angeles. Boorem began directing and producing plays in 2010. Boorem is best known for her acting career that began in 1994. Her feature film credits include Smile, Sleepover, Blue Crush, The Patriot, Along Came a Spider, Hearts in Atlantis, The Ward, Virgin Alexander, Good Day For It, Dirty Dancing: Havana Nights, Jack Frost, A Dark Desire, Carolina, Riding in Cars with Boys, Things You Can Tell Just by Looking at Her, Mighty Joe Young, Trucker and others. She has appeared on Dawson's Creek, House, Touched by an Angel, Ghost Whisperer. She starred in ABC Family's The Initiation of Sarah and the Lifetime Movie drama, Augusta, Gone, for which she won a Prism Award. Her work in Smile was honored at the Stony Brook Film Festival where she received the Rising Star Award. Mika was also nominated for a Teen Choice Award and four Young Artist Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYyOTA4MGMtYzljYi00OGZiLWJjNTgtMWE1YmQ3YmVhMTdjL2ltYWdlXkEyXkFqcGdeQXVyMjAwMDUxMDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095561","name":"Mika Boorem","idIMDB":"nm0095561"},"actorId":"nm0095561","character":"Sarah Goodwin","urlCharacter":"http://www.imdb.com/character/ch0038484","main":true},{"actorName":"Summer Glau","urlProfile":"http://www.imdb.com/name/nm1132359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ3ODY4MjQ2M15BMl5BanBnXkFtZTgwMzAzMzU5MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1981","placeOfBirth":" San Antonio, Texas, USA","birthName":"Summer Lyn Glau","height":"5' 6\" (1.68 m)","bio":"Summer is a native of San Antonio, Texas. She's been a ballerina most of her life. Her debut was in various commercials and a guest appearance on the WB's Angel (1999). She has gone on to star on the TV series Firefly (2002) as well as its follow-up movie Serenity (2005) and the TV series Terminator: The Sarah Connor Chronicles (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ3ODY4MjQ2M15BMl5BanBnXkFtZTgwMzAzMzU5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1132359","name":"Summer Glau","idIMDB":"nm1132359"},"actorId":"nm1132359","character":"Lindsey Goodwin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"JoAnna Garcia Swisher","urlProfile":"http://www.imdb.com/name/nm0305272","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4OTI5ODg1Ml5BMl5BanBnXkFtZTcwMzE5OTI2Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1979","placeOfBirth":" Tampa, Florida, USA","birthName":"JoAnna Lynne Garcia","height":"5' 5\" (1.65 m)","bio":"JoAnna Garcia Swisher was born in Tampa, Florida. She began performing at the age of ten, when she auditioned for a local theater production and landed the lead. She continued to act in high school where she was discovered by Nickelodeon and commuted from Florida to Montreal, Quebec, Canada, to star for two seasons in the television series, Are You Afraid of the Dark? (1990). After graduating from high school, she spent a year attending Florida State University, but dropped out to move to Hollywood where she worked extensively in television and then in popular movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4OTI5ODg1Ml5BMl5BanBnXkFtZTcwMzE5OTI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0305272","name":"JoAnna Garcia Swisher","idIMDB":"nm0305272"},"actorId":"nm0305272","character":"Corinne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tessa Thompson","urlProfile":"http://www.imdb.com/name/nm1935086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk4MDU3NDg4NF5BMl5BanBnXkFtZTcwMjMxMjcwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1983","placeOfBirth":" Los Angeles, California, USA","birthName":"Tessa Lynn Thompson","height":"5' 4\" (1.63 m)","bio":"Tessa Thompson was born on October 3, 1983 in Los Angeles, California, USA as Tessa Lynn Thompson. She is an actress, known for Creed (2015), Dear White People (2014) and When a Stranger Calls (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk4MDU3NDg4NF5BMl5BanBnXkFtZTcwMjMxMjcwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1935086","name":"Tessa Thompson","idIMDB":"nm1935086"},"actorId":"nm1935086","character":"Esme","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Ziff","urlProfile":"http://www.imdb.com/name/nm1197021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3OTgyOTI5Ml5BMl5BanBnXkFtZTcwMTk2MTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1983","placeOfBirth":" Chicago, Illinois, USA","birthName":"Benjamin Martin Ziff","bio":"Ben Ziff was born on July 9, 1983 in Chicago, Illinois, USA as Benjamin Martin Ziff. He is an actor, known for The Initiation of Sarah (2006), The Surfer King (2006) and Little Black Book (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3OTgyOTI5Ml5BMl5BanBnXkFtZTcwMTk2MTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1197021","name":"Ben Ziff","idIMDB":"nm1197021"},"actorId":"nm1197021","character":"Finn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan Fairchild","urlProfile":"http://www.imdb.com/name/nm0000392","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODQyOTU1MV5BMl5BanBnXkFtZTcwMDY5MjE3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1950","placeOfBirth":" Dallas, Texas, USA","birthName":"Patsy Ann McClenny","height":"5' 4\" (1.63 m)","bio":"This elegant lady defined the television version of the rich, sophisticated businesswoman who knows what she wants, and will do whatever it takes to get it. She was born Patsy Ann McClenny on February 3, 1950 in Dallas, Texas. She began acting as a child, when her mother enrolled her in drama lessons after she was too shy to give a book report in class. From the age of 10, she performed in children's plays. Later, she would do dinner theater and stock productions in Dallas. She chose Morgan as a stage name. In 1973, Morgan decided to pursue a career in television; just 6 weeks after moving to New York, she landed the key role of Jennifer in the daytime soap opera Search for Tomorrow (1951); she stayed on until 1977. Morgan moved to Los Angeles, where she originated the role of Jenna Wade on the wildly popular nighttime soap opera Dallas (1978) (Jenna was later portrayed by Priscilla Presley). Morgan made numerous guest appearances on television series. She played Constance (Weldon) Carlyle in Flamingo Road (1980), and she was nominated for a Golden Globe for Best Actress; that was her breakout series that propelled her to stardom. Morgan continued to perform in live theater, her acclaimed portrayal of Skye in the off-Broadway comedy \"Geniuses\" helped make it one of the \"Top Ten Plays\" of the year according to Time Magazine and the New York Times. Other stage appearances have included productions of \"Goodbye Charlie\" and \"Gentlemen Prefer Blondes.\" On television, she played the naughty Racine in the soap opera Paper Dolls (1984) in 1984. Later, she starred in the soap opera Falcon Crest (1981) from 1985-86, having made a niche for herself playing ambitious beauties. Morgan received an Emmy nomination for a special episode of Murphy Brown (1988). Morgan has shared some of her beauty secrets by authoring the book \"Super Looks\" which is a complete guide that includes makeup, exercise, and diet tips. Morgan is a member of the Entertainment Industry AIDS Task Force. She is an active speaker on environmental issues and helped found the Environmental Communications Office, which encourages entertainment industry professionals to become better educated and more active on environmental issues. Morgan is a collector of movie memorabilia (particularly anything about Marilyn Monroe) and antique clothing. She is a ballet fan and is also interested in anthropology and paleontology; Morgan is truly a brainy beauty.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODQyOTU1MV5BMl5BanBnXkFtZTcwMDY5MjE3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000392","name":"Morgan Fairchild","nicknames":["Little Bird"],"idIMDB":"nm0000392"},"actorId":"nm0000392","character":"Trina Goodwin","urlCharacter":"http://www.imdb.com/character/ch0231891","main":true},{"actorName":"Jennifer Tilly","urlProfile":"http://www.imdb.com/name/nm0000236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1958","placeOfBirth":" Harbor City, California, USA","birthName":"Jennifer Ellen Chan","height":"5' 7\" (1.7 m)","bio":"An actress who always attracts audiences' attention, Jennifer Tilly is by turns funny, sexy, compassionate, compelling and often all at once. Her breakthrough movie role tapped into all of those qualities failing singer Blanche \"Monica\" Moran in Steve Kloves' The Fabulous Baker Boys (1989) opposite brothers Jeff Bridges and Beau Bridges. A few years later, Jennifer earned an Academy Award nomination for her portrayal of the aspiring but hopelessly untalented actress Olive Neal in Woody Allen's Bullets Over Broadway (1994). She has become well-known to filmgoers for both major studio and independent films. In Tom Shadyac's blockbuster Liar Liar (1997), she kept pace with Jim Carrey. Her steamy performance opposite Gina Gershon helped make Lana Wachowski's and Lilly Wachowski's Bound (1996) a breakout indie success at the Sundance Film Festival and then in theatrical release. It also expanded Jennifer's already significant gay and lesbian following. She successfully cultivated another fan base with the revitalization of the \"Child's Play\" horror comedy franchise. For Ronny Yu's La fiancée de Chucky (1998), the filmmakers turned to Jennifer to create the character who would spark the series in a new direction. She met the challenge and established a new horror icon in Tiffany. This Halloween, in Rogue Pictures' all-new Le fils de Chucky (2004), written and directed by series creator Don Mancini, Jennifer again takes the popular series to the next level; she stars as Tiffany and as herself, the deadly doll's favorite actress, who soon becomes an unwitting hostess in more ways than one. Jennifer's pitch-perfect voiceover work as Tiffany is not the only instance of her being able to incarnate a character from the vocal chords out. Families know her distinctive cadences from the recent Disney hits Home on the Range (2004) (in which Jennifer voiced a new-age bovine), directed by Will Finn and John Sanford; The Haunted Mansion (2003) (in which Jennifer acted from the neck up only), directed by Rob Minkoff; and the Pixar blockbuster Monsters, Inc. (2001) (voicing Mike's love interest Celia), directed by Pete Docter, David Silverman and Lee Unkrich. She began her acting career as a teenager, putting herself through the theater program at Stephens College in Missouri by winning writing competitions. She then headed to Los Angeles, California. While she continued to act on the stage (earning a Dramalogue Award for her performance in \"Vanities\"), movies and television immediately came calling for the actress with the unique voice and visage. Over the years, Jennifer has made memorable appearances on some of television's best series, including Hill Street Blues (1981) (in a recurring dramatic role), Cheers (1982), Moonlighting (1985), It's Garry Shandling's Show. (1986) and Frasier (1993). In addition, she has been a favored guest on a number of talk shows, from The Tonight Show Starring Johnny Carson (1962) to The Arsenio Hall Show (1989) to (currently) The Tonight Show with Jay Leno (1992). Those interview segments have encouraged viewers to expect the unexpected from her interplay with the host and the studio audience. Her many films over a two-decade span include Neil Jordan's High Spirits (1988), Oliver Stone's The Doors (1991), Richard Benjamin's Made in America (1993), Roger Donaldson's The Getaway (1994), Joe Pytka's Let It Ride (1989), P.J. Castellaneta's Relax... It's Just Sex (1998), Michael Radford's Dancing at the Blue Iguana (2000), Peter Bogdanovich's The Cat's Meow (2001) (in which she played Louella Parsons). Jennifer Tilly has also continued to act on the stage. She won a Theater World Award for her performance in off-Broadway's \"One Shoe Off\" and starred on Broadway in the 2001 revival of \"The Women\" (which was later taped for, and broadcast on, PBS).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000236","name":"Jennifer Tilly","nicknames":["The Unabombshell","Jenny"],"idIMDB":"nm0000236"},"actorId":"nm0000236","character":"Dr. Eugenia Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amber Wallace","urlProfile":"http://www.imdb.com/name/nm0908511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY0NDgwNDM0NF5BMl5BanBnXkFtZTgwMzg5NTk4MzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1987","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 6\" (1.68 m)","bio":"Amber was born in Atlanta, Georgia. She is the oldest of four. She has two sisters and one brother. Amber started acting at an early age. Her first role at the age of six was, \"Baby\", the daughter of Diane Lane and Donald Sutherland in the TV mini-series, The Oldest Living Confederate Widow Tells All. Soon after, Amber started booking numerous voice-overs, commercials, industrials and roles on various TV shows. For two years, Amber was the announcer for The Cartoon Network in Latin America. Amber attended North Gwinnett until her hectic schedule caused her to switch to an online school, Laurel Springs. She graduated with honors as well as The Hope Scholarship. She is a member of The National Honor Societyand attended Georgia State University as an English Major with an emphasis on Creative Writing. Thanks to her wonderful Atlanta agent, Joy Pervis, Amber landed the recurring role of \"Lila\" on 90210. With the continual support of Joy and her family, Amber took it a step further and moved to Los Angeles to further her career. Amber started writing music at the age of 10 and with the help of her father, who is an audio engineer, released an EP and 2 full length CDs. She has won numerous national and international songwriting and vocal awards. Her music has been placed in TV shows and Film. She formed her own band when she was 14 and they have played in venues from Georgia to New York to Los Angeles to rave revues. You can find her music as a solo artist, Amber Brooke, and her band, Amber Brooke Band, on Itunes. She is working on an all girl band project in Los Angles called \"The Lemon Boys\". When Amber is not acting or working on her music, she spends much of her time reading and hanging out with her family and her three legged tiny toy poodle Chewbacca.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY0NDgwNDM0NF5BMl5BanBnXkFtZTgwMzg5NTk4MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908511","name":"Amber Wallace","idIMDB":"nm0908511"},"actorId":"nm0908511","character":"Vita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Damon Lipari","urlProfile":"http://www.imdb.com/name/nm2067832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc1MTg4MTk4NV5BMl5BanBnXkFtZTcwMjMxMDY4Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1978","placeOfBirth":" Patterson, Louisiana, USA","birthName":"Damon Gerard Galinis","height":"6' 1\" (1.85 m)","bio":"Damon Lipari was born in Patterson LA. Since he was 6 years old he wanted to be like his idols Pistol Pete and Michael Jordan. His love for basketball followed him through the years until he attended LSU. His passion for acting took over and he started to prepare himself for a move to Hollywood after he graduated. Damon with his wife Laurianne aka YaYa and two best friends Lyle Brocato and Angelena Swords Brocato packed everything they had in two cars and headed out west. Damon quickly picked up an agent and started booking commercial work. Ironically, Damon's first film work was on the CBS made for TV movie Vampire Bats which was filmed where he grew up, New Orleans LA. The production was moved half way through due to Hurricane Katrina to Halifax Nova Scotia. After it wrapped Damon quickly jumped on to The Guardian with Kevin Costner and Ashton Kutcher, Initiation of Sarah with Mika Boorem, Summer Glau and JoAnna Garcia Swisher, and A Perfect Day with Rob Lowe, Paget Brewster and Christopher Lloyd. After filming 5 straight movies in his native state Damon decided to make home.. home again. Other titles include Memphis Beat, Shark Night 3D, Breakout Kings, Halt and Catch Fire, When the Game Stands Tall, The Originals and his latest Navy Seals vs. Zombies. Damon's goal is to one day play Pistol Pete in a movie made about the legendary basketball player. Another goal is to one day be endorsed by Nike and design his own shoes. Damon and his wife YaYa have a daughter Wesly Lu, a son McHale Christopher Ren and a dog named Luke Duke.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc1MTg4MTk4NV5BMl5BanBnXkFtZTcwMjMxMDY4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2067832","name":"Damon Lipari","idIMDB":"nm2067832"},"actorId":"nm2067832","character":"Damien","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caitlin Wehrle","urlProfile":"http://www.imdb.com/name/nm2146766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MjA2Mjg1OF5BMl5BanBnXkFtZTcwOTgyODgzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1985","placeOfBirth":" Austin, Texas, USA","birthName":"Caitlin Therese Wehrle","height":"6' 0½\" (1.84 m)","bio":"Caitlin Wehrle was born on March 29, 1985 in Austin, Texas, USA as Caitlin Therese Wehrle. She is an actress, known for Crushed (2009), The Initiation of Sarah (2006) and The Big Picture (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MjA2Mjg1OF5BMl5BanBnXkFtZTcwOTgyODgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2146766","name":"Caitlin Wehrle","idIMDB":"nm2146766"},"actorId":"nm2146766","character":"Alpha Nu #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Luza","urlProfile":"http://www.imdb.com/name/nm1109973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAzMjY1ODYwMF5BMl5BanBnXkFtZTcwMDY3MDM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1984","placeOfBirth":"","birthName":"Jessica Ann Luza","height":"5' 3\" (1.6 m)","bio":"Jessica Luza was born on October 15, 1984 as Jessica Ann Luza. She is known for her work on Let's Be Cops (2014), The Labyrinth (2015) and House (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAzMjY1ODYwMF5BMl5BanBnXkFtZTcwMDY3MDM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1109973","name":"Jessica Luza","idIMDB":"nm1109973"},"actorId":"nm1109973","character":"Girl #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caroline Jahna","urlProfile":"http://www.imdb.com/name/nm2146878","urlPhoto":"","biography":{"height":"5' 5¾\" (1.67 m)","bio":"Caroline Jahna is an actress, known for The Initiation of Sarah (2006), For One Night (2006) and The Arrangement (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2146878","name":"Caroline Jahna","idIMDB":"nm2146878"},"actorId":"nm2146878","character":"Girl #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greer Howard","urlProfile":"http://www.imdb.com/name/nm1692205","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDY2MzM3OV5BMl5BanBnXkFtZTcwMzY5OTA4OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Greer Howard is known for her work on Allegiant (2016), The Initiation of Sarah (2006) and Evil Keg (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDY2MzM3OV5BMl5BanBnXkFtZTcwMzY5OTA4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1692205","name":"Greer Howard","idIMDB":"nm1692205"},"actorId":"nm1692205","character":"Young Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abigail Leigh","urlProfile":"http://www.imdb.com/name/nm1508047","urlPhoto":"","biography":{"bio":"Abigail Leigh is an actor, known for Everything We Forgot We Remember and Forget (2010), The Initiation of Sarah (2006) and Ordinary Wilderness (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1508047","name":"Abigail Leigh","idIMDB":"nm1508047"},"actorId":"nm1508047","character":"Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raylee Magill","urlProfile":"http://www.imdb.com/name/nm2375517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTI0NTA5NF5BMl5BanBnXkFtZTgwMTI3NjI2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1985","placeOfBirth":" Fort Knox, Kentucky, USA","height":"5' 5\" (1.65 m)","bio":"Raylee Magill was born on April 28, 1985 in Fort Knox, Kentucky, USA. She is known for her work on Most Likely to Kill (2013), Necrophilia: A Love Story (2013) and The Plunge (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTI0NTA5NF5BMl5BanBnXkFtZTgwMTI3NjI2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2375517","name":"Raylee Magill","nicknames":["Rach","Magill"],"idIMDB":"nm2375517"},"actorId":"nm2375517","character":"P.E.D. #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0795403","urlIMDB":"http://www.imdb.com/title/tt0795403","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"05","year":"2006","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["16 : 9"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.4","filmingLocations":[{"location":"Centenary College - 2911 Centenary Boulevard, Shreveport, Louisiana, USA"}],"awards":[{"award":"Teen Choice Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice TV: Movie","names":[]}]}]}],"votes":"1,485","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0050794","name":"ABC Family"},{"idCompany":"co0071026","name":"MGM Television"}],"keywords":{"keywords":["sorority","supernatural power","sacrifice","college","remake","horror movie remake","female protagonist","witch","virgin","suicide attempt","sorceress","sister sister relationship","pledges","occult","library","initiation","fire","blood","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:51:24"}}