{"data":{"movies":[{"title":"Moses","originalTitle":"","year":"1996","releaseDate":"19961016","directors":[{"name":"Gary Hurst","id":"nm0403597"}],"writers":[{"name":"Nigel Forde","id":"nm2766335"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRmZWUwOGMtOGQwOC00ZTE3LWJkMDYtZTZmM2M2ODZhNTMyXkEyXkFqcGdeQXVyNjExODE1MDc@._V1.jpg","countries":[],"languages":[],"genres":["Animation","Drama"],"plot":"Fleeing after murdering an Egyptian overseer, the Hebrew Moses settles in the land of Midian. But one day, he is visited by God, who instructs him to return to Egypt and, with the help of his brother Aaron and ten devastating plagues, free the Israelites from the iron grip of the Pharoah.","simplePlot":"Fleeing after murdering an Egyptian overseer, the Hebrew Moses settles in the land of Midian. But one day, he is visited by God, who instructs him to return to Egypt and, with the help of ... ","actors":[{"actorName":"Martin Jarvis","urlProfile":"http://www.imdb.com/name/nm0419089","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDYzODcwNF5BMl5BanBnXkFtZTcwMjMzOTQ4OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1941","placeOfBirth":" Cheltenham, Gloucestershire, England, UK","height":"6' (1.83 m)","bio":"Martin Jarvis OBE is one of Britain's most versatile leading actors. His distinguished career continues to encompass just about every aspect of the entertainment industry: film, television, theatre, radio and audio recording. He is also the author of two bestselling books: a hilarious autobiography Acting Strangely and a compelling account of his award-winning time on Broadway in 2001: Broadway, Jeeves - The Diary of a Theatrical Adventure, both published by Methuen. In 2010 he starred as Vincent Hogg in a new production of Agatha Christie's The Mirror Cracked in ITV/WGHB's popular 'Miss Marple' series. In 2009, he starred in BBC2's comedy/drama Taking the Flak, receiving outstanding reviews for his performance as national treasure tv journalist David Bradburn. He stars in the feature film Neander Jin - Return of the Neanderthal Man (US/ Germany co-production, 2010) as Peter Blodnik, network mogul. Alongside his screen and theatre career he is a prolific director of radio drama and, with his wife, actress/director Rosalind Ayres, produces plays and readings for BBC. His award-winning productions include Shadowlands, David Mamet's Keep Your Pantheon, Ayckbourn's Man of the Moment and Ian Fleming's Dr No. He has homes in London and Los Angeles. He trained at RADA (Royal Academy of Dramatic Arts in London, England), where he won the Vanbrugh Award and the Silver Medal. He is an Associate of RADA (Royal Academy of Dramatic Arts in London, England). He was awarded the OBE (Officer of the British Empire) in the 2000 Queen's New Years Honors List for his services to drama. In 2006, he appeared at the Santa Fe Arts Festival in New Mexico in Wilde's The Canterville Ghost with Shirley Maclaine and Ali McGraw. Earlier in the same year, he starred in Honour at Wyndham's Theatre, London giving an acclaimed performance opposite Dame Diana Rigg. On screen that year he played Leonard in BBC-TV's modern version of \"Much Ado About Nothing\" and (in 2005) starred as \"Malvolio\" in \"Twelfth Night\" at Regent's Park Open Air Theatre. He received a Theatre World Award on Broadway in 2001 for his title role performance in \"By Jeeves\" which he also filmed. His West End, National, Almeida and Donmar theatre appearances include works by Sir Alan Ayckbourn, Michael Frayn, Harold Pinter CH, Somerset Maugham, Sir George Bernard Shaw and Oscar Wilde. He played Jack Worthing opposite Dame Judi Dench's Lady Bracknell in Wilde's \"The Importance of Being Earnest\" at the National Theatre in the 1980s directed by Sir Peter Hall, and premiered Pinter's \"Other Places\" in the National's Cottesloe Theatre. Pinter directed him in the leading role of Hector in Giraudoux's \"The Trojan War Will Not Take Place.\" He met Sir Alan Ayckbourn at the National and subsequently went on to star in his \"Woman in Mind,\" \"Henceforward,\" \"Just Between Ourselves\" and \"By Jeeves.\" His Screen credits include leading roles in the British/Australian mini-series \"Bootleg,\" \"Inspector Lynley Mysteries,\" \"Lorna Doone,\" Frayn's \"Make and Break,\" \"Ike - The War Years\" (with Robert Duvall) and \"The Bunker\" (with Sir Anthony Hopkins.) He was \"Linus\" in Sir Richard Eyre's film, \"Absence of War written by Sir David Hare. He has guest starred (very often as villains) in \"Inspector Morse,\" \"Frost,\" \"Lovejoy,\" \"Casualty,\" \"Murder Most Horrid,\" \"Dr Who,\" \"Space Above and Beyond,\" \"Murder, She Wrote\" and \"Walker: Texas Ranger\" in the US. He played monstrous Neil Biddle in \"Sex 'N' Death\" and was a memorable television Uriah Heep in \"David Copperfield\" on British television. First major screen role: 'Jon' in the multi-award winning \"The Forsyte Saga.\" He followed this with many 'classic serials' including \"The Way of All Flesh (in which he starred as Ernest Pontifex), \"Nicholas Nickleby\" (title role), \"The Moonstone,\" \"Little Women\" and \"The Pallisers.\" His feature films include the psychological thriller \"Framed\" (2007), \"Mrs Caldicot's Cabbage War,\" James Cameron's \"Titanic,\" \"Kid With the X-Ray Eyes,\" \"Buster,\" \"The Last Escape,\" and \"Taste the Blood of Dracula.\" His voice can be heard in numerous television animation series as well as feature films including \"Flushed Away\" and \"Eragon.\" He has narrated \"Peter and the Wolf at the Barbican\" and appeared with City of Birmingham Symphony Orchestra and Scottish Chamber Orchestra as Narrator for Egmont and \"A Midsummer Night's Dream.\" At the Chichester Festival Theatre he starred with Sir John Gielgud in \"Paradise Lost,\" with Googie Withers CBE and Susan Hampshire OBE in \"The Circle\" and with concert pianist Lucy Parham in \"Beloved Clara.\" Jarvis & Ayres Productions, which he founded with his wife, Rosalind Ayres, has produced many award-winning dramas and readings for BBC Radio, National Public Radio in America and for audio books. Their work includes outstanding interpretations of plays by Sir George Bernard Shaw, Sir Alan Ayckbourn, Harold Pinter CH, Michael Frayn, David Mamet, Hugh Whitemore, Robert Shearman, Tennessee Williams, Oscar Wilde, and many more. British and American stars who have been associated with J&A productions include, in the UK: Dame Judi Dench, Sir Ian McKellen, Dame Diana Rigg, Alfred Molina, Richard E. Grant, Michael York OBE, Richard Briers CBE, Pauline Collins OBE, Janie Dee, Fiona Shaw CBE, Miriam Margolyes OBE, Patricia Hodge, Twiggy Lawson, Natascha McElhone, Martin Freeman, Barry Humphries CBE, Phil Collins and in the US: Brendan Fraser, Elaine Stritch, Teri Garr, Stacy Keach, Shirley Knight, Hector Elizondo, Bruce Davison, Matthew Wolf, Eric Stoltz, Rebecca Pidgeon, Ed Begley Jr, Ed O'Neill and Gregory Peck. Directors of J&A dramas include: David Mamet, Michael Grandage, David Grindley, Sir Alan Ayckbourn, Pete Atkin, Rosalind Ayres. Their productions have received Audie and Earphone awards in the US. In September 2006, he directed Teri Garr, Michael York OBE and Alfred Molina in an acclaimed production of \"Pack of Lies\" for BBC Radio 4. He and Fiona Shaw CBE starred for five years in the popular BBC series \"Our Brave Boys.\" His Just William audio and radio recordings are world wide best sellers. He was the subject of BBC TV's This Is Your Life in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDYzODcwNF5BMl5BanBnXkFtZTcwMjMzOTQ4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419089","name":"Martin Jarvis","idIMDB":"nm0419089"},"actorId":"nm0419089","character":"Moses / God","urlCharacter":"http://www.imdb.com/character/ch0006190","main":true},{"actorName":"Simon Callow","urlProfile":"http://www.imdb.com/name/nm0001003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTc3MDkwNl5BMl5BanBnXkFtZTcwMTQ4MTg5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1949","placeOfBirth":" London, England, UK","birthName":"Simon Phillip Hugh Callow","height":"5' 7\" (1.7 m)","bio":"Simon Callow was born on June 13, 1949 in London, England as Simon Phillip Hugh Callow. He is an actor and writer, known for Amadeus (1984), Ace Ventura: When Nature Calls (1995) and Four Weddings and a Funeral (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTc3MDkwNl5BMl5BanBnXkFtZTcwMTQ4MTg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001003","name":"Simon Callow","idIMDB":"nm0001003"},"actorId":"nm0001003","character":"Meneptah","urlCharacter":"http://www.imdb.com/character/ch0069230","main":true},{"actorName":"Anna Carteret","urlProfile":"http://www.imdb.com/name/nm0141997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYxYTViNDYtNDFiYi00ODUzLWIxMmItZmI5ZGI0YjI5YmE4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1942","placeOfBirth":" Bangalore, India","birthName":"Annabelle Susan Wilkinson","bio":"Anna Carteret was born on December 11, 1942 in Bangalore, India as Annabelle Susan Wilkinson. She is an actress, known for Juliet Bravo (1980), The Shell Seekers (1989) and Mrs. Palfrey at the Claremont (2005). She was previously married to Christopher Morahan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYxYTViNDYtNDFiYi00ODUzLWIxMmItZmI5ZGI0YjI5YmE4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0141997","name":"Anna Carteret","idIMDB":"nm0141997"},"actorId":"nm0141997","character":"Miriam","urlCharacter":"http://www.imdb.com/character/ch0006236","main":true},{"actorName":"Tony Leader","urlProfile":"http://www.imdb.com/name/nm2167665","urlPhoto":"","biography":{"bio":"Tony Leader is an actor, known for Ulysses Road (2008), Score (2001) and Cash and Curry (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2167665","name":"Tony Leader","idIMDB":"nm2167665"},"actorId":"nm2167665","character":"Aaron / Rameses","urlCharacter":"http://www.imdb.com/character/ch0006188","main":true},{"actorName":"Ivor Roberts","urlProfile":"http://www.imdb.com/name/nm0731175","urlPhoto":"","biography":{"dateOfBirth":"19 July 1925","placeOfBirth":" Nottingham, England, UK","bio":"Ivor Roberts (19 July 1925 - 5 September 1999) was an English actor and a television continuity announcer who often appeared in comedic roles. Born in Nottingham, he returned to acting following service in the Royal Navy during the Second World War. Roberts started his television career as a continuity announcer on regional television in Wales, working for TWW before that company lost its franchise in 1968. Among his better-known roles were the characters of Arnold Thomas in the 1995-97 television series Oh, Doctor Beeching! and Mr Barnes in the second, third and fourth series of You Rang, M'Lord?. He also made a guest appearance, as a police officer, in one episode of George and Mildred. Another notable appearance was as Mr. Chick in Dombey and Son. He also played a part in \"Porridge\". He died in Cardiff, Wales, in 1999 at the age of 74.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0731175","name":"Ivor Roberts","idIMDB":"nm0731175"},"actorId":"nm0731175","character":"Jethro / Hebrew Elder","urlCharacter":"http://www.imdb.com/character/ch0006211","main":true},{"actorName":"Ian Saynor","urlProfile":"http://www.imdb.com/name/nm0768520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA5NDY5MzQtOTg0Zi00OTFmLWFlZGMtNGE1YWNhMjdkNjhjXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"A renowned Welsh actor, Ian Saynor has given a range of incredible performances through this career. Making his break into Hollywood with \"The Corn is Green\" he rose to stardom next to Catherine Hepburn, and continued to impress with the likes of \"Screamtime\", \"Doctor Who\" and \"The Mallens\". A Welsh speaker also, he has been in many productions for BBC Wales and S4C, including \"Gwenoliaid\" and more recently, the bleak police drama \"Hinterland\". At his best in British television, Saynor was seen in the long-running BBC science fiction show \"Doctor Who\" alongside the great Tom Baker in The Doctor's adventures in \"The Armageddon Factor\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA5NDY5MzQtOTg0Zi00OTFmLWFlZGMtNGE1YWNhMjdkNjhjXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768520","name":"Ian Saynor","idIMDB":"nm0768520"},"actorId":"nm0768520","character":"Soldier / High Priest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dillwyn Owen","urlProfile":"http://www.imdb.com/name/nm0654121","urlPhoto":"","biography":{"dateOfBirth":"9 September 1922","placeOfBirth":" Bangor, Wales, UK","birthName":"Dillwyn Gwynfe Owen","bio":"Dillwyn Owen was born on September 9, 1922 in Bangor, Wales as Dillwyn Gwynfe Owen. He was an actor, known for The Magic Paintbrush: A Story from China (2000), Grand Slam (1978) and Under Milk Wood (1972). He died on January 30, 1999 in Glamorgan, Wales.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0654121","name":"Dillwyn Owen","idIMDB":"nm0654121"},"actorId":"nm0654121","character":"Hebrew Elder / Worker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hywel Nelson","urlProfile":"http://www.imdb.com/name/nm1947279","urlPhoto":"","biography":{"bio":"Hywel Nelson is an actor, known for Shakespeare: The Animated Tales (1992), Testament: The Bible in Animation (1996) and ABC Weekend Specials (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1947279","name":"Hywel Nelson","idIMDB":"nm1947279"},"actorId":"nm1947279","character":"Child","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0719849","urlIMDB":"http://www.imdb.com/title/tt0719849","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":null,"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.1","filmingLocations":[],"awards":[],"votes":"10","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"Testament: The Bible in Animation","id":"tt0115388"},"season":"Season 1","episode":"Episode 1"},"companyCreditsSimple":[{"idCompany":"co0103589","name":"Sianel 4 Cymru (S4C)"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:49:03"}}