{"data":{"movies":[{"title":"Cougar Club","originalTitle":"","year":"2007","releaseDate":"20071113","directors":[{"name":"Christopher Duddy","id":"nm0006799"}],"writers":[{"name":"Christopher Duddy","id":"nm0006799"},{"name":"Glenn W. Garland","id":"nm0307523"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzVjMTVmMzEtMTY0MC00MjVhLWFlZWQtMDIwMDc2NGZmZDQzXkEyXkFqcGdeQXVyMjQ2NDQ0NDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"When Spence and Hogan graduate from college, life is bleak. They have to work for heinous divorce lawyers that torture them. Spence has a girlfriend from hell and Hogan just wants to start his life already. As luck would have it, our two young men are presented with an opportunity, they develop a club of young men devoted to the older woman, the \"Cougar\" if you will. It is this club that ultimately guides our two heroes into young adulthood.","simplePlot":"When Spence and Hogan graduate from college, life is bleak. They have to work for heinous divorce lawyers that torture them. Spence has a girlfriend from hell and Hogan just wants to start ... ","actors":[{"actorName":"Jason Jurman","urlProfile":"http://www.imdb.com/name/nm1648225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzAxMDEyM15BMl5BanBnXkFtZTcwNDU1MDUzMQ@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1979","placeOfBirth":"","bio":"Jason Jurman was born on November 6, 1979. He was an actor, known for Cougar Club (2007), Perspective (2011) and Law & Order: Special Victims Unit (1999). He died on October 11, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzAxMDEyM15BMl5BanBnXkFtZTcwNDU1MDUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1648225","name":"Jason Jurman","idIMDB":"nm1648225"},"actorId":"nm1648225","character":"Spence Holmes","urlCharacter":"http://www.imdb.com/character/ch0063319","main":true},{"actorName":"Warren Kole","urlProfile":"http://www.imdb.com/name/nm1504650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODE0MjcxNF5BMl5BanBnXkFtZTgwMjk4MTU0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1977","placeOfBirth":" San Antonio, Texas, USA","birthName":"Warren David Blosjo Jr.","height":"5' 10\" (1.78 m)","bio":"Warren Kole was born on September 23, 1977 in San Antonio, Texas, USA as Warren David Blosjo Jr. He is an actor, known for The Avengers (2012), Uncharted 4: A Thief's End (2016) and Game of Assassins (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODE0MjcxNF5BMl5BanBnXkFtZTgwMjk4MTU0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1504650","name":"Warren Kole","idIMDB":"nm1504650"},"actorId":"nm1504650","character":"Hogan","urlCharacter":"http://www.imdb.com/character/ch0063320","main":true},{"actorName":"Joe Mantegna","urlProfile":"http://www.imdb.com/name/nm0001505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ5NDMxMzU4N15BMl5BanBnXkFtZTYwNjQxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1947","placeOfBirth":" Chicago, Illinois, USA","birthName":"Joseph Anthony Mantegna Jr.","height":"5' 11¼\" (1.81 m)","bio":"Joe Mantegna is an American actor who has made over 200 film and TV appearances. He is also a producer, writer, and director, and is probably best known for his role as Joey Zasa in the Francis Ford Coppola epic The Godfather: Part III (1990), in which he stars alongside Al Pacino and Andy Garcia. Joseph Anthony Mantegna, Jr. was born in Chicago, Illinois, to Mary Anne (Novelli), a shipping clerk, and Joseph Anthony Mantegna, Sr., an insurance salesman. He is of Italian descent. Having obtained a degree in acting from the Goodman School of Drama and taken to the stage early on in life, it is no surprise that Joe has maintained a strong relationship with the playwright -turned- screenwriter-director David Mamet. They have collaborated on several projects. He also stars as SSA David Rossi on the long running TV drama Criminal Minds. (2005-)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ5NDMxMzU4N15BMl5BanBnXkFtZTYwNjQxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001505","name":"Joe Mantegna","idIMDB":"nm0001505"},"actorId":"nm0001505","character":"Mr. Stack","urlCharacter":"http://www.imdb.com/character/ch0063321","main":true},{"actorName":"Kaley Cuoco","urlProfile":"http://www.imdb.com/name/nm0192505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTI0Njc2MV5BMl5BanBnXkFtZTcwMTQ3NjYyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1985","placeOfBirth":" Camarillo, California, USA","birthName":"Kaley Christine Cuoco","height":"5' 6\" (1.68 m)","bio":"Kaley Christine Cuoco was born in Camarillo, California, to Layne Ann (Wingate) and Gary Carmine Cuoco, a realtor. She is of Italian (father) and German and English (mother) descent. A model and commercial actress from the age of 6, Cuoco's first major role was in the TV movie Quicksand: No Escape (1992) with Donald Sutherland and Tim Matheson. Her other television credits include guest-starring on the series Ellen (1994) (where she played \"little Ellen\" to the Ellen DeGeneres character), Northern Exposure (1990), Don't Forget Your Toothbrush (1995) and My So-Called Life (1994). In addition, she played a leading role in the miniseries, Mr. Murder (1998). Cuoco has appeared in the feature films Lucky 13 (2005), Picture Perfect (1997) and Virtuosity (1995). On stage, she has performed in Los Angeles-area productions of \"Annie\" and \"Fiddler on the Roof\". When she's not acting, Cuoco is an avid tennis player, who consistently ranks well in Southern California Tennis Association standings as a member of a regional amateur division team. In addition, she enjoys spending time with friends, going to the mall, and hip-hop dancing. Cuoco was home-schooled, and lives in Ventura County, California with her family. She was previously married to Ryan Sweeting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTI0Njc2MV5BMl5BanBnXkFtZTcwMTQ3NjYyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0192505","name":"Kaley Cuoco","idIMDB":"nm0192505"},"actorId":"nm0192505","character":"Amanda","urlCharacter":"http://www.imdb.com/character/ch0054174","main":true},{"actorName":"Izabella Scorupco","urlProfile":"http://www.imdb.com/name/nm0001713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzM1MDEzMV5BMl5BanBnXkFtZTcwMDEyOTYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1970","placeOfBirth":" Bialystok, Podlaskie, Poland","birthName":"Izabella Dorota Skorupko","height":"5' 9\" (1.75 m)","bio":"Born in the northern Polish town of Bialystok, Izabella Scorupco moved to Sweden with her mother as a young child. She studied drama and music and, at 17, was discovered by a Swedish film director who cast her in the movie Ingen kan älska som vi (1988), which made her a local teenage idol. She then became a successful model in Sweden and throughout Europe, where she made good use of her fluency in four languages. In 1989, Scorupco displayed another facet of her talents, launching her career as a pop singer with her first single, Substitute. The single and subsequent album, IZA, both went gold, and she followed with another hit single, Shame, Shame, which she recorded in 1991. Returning to acting in 1994, she immediately won the lead role in the Swedish film The Tears of Saint Peter (1995). Scorupco stars as a woman who lives her life as a man in the medieval drama, which was released in August 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzM1MDEzMV5BMl5BanBnXkFtZTcwMDEyOTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001713","name":"Izabella Scorupco","nicknames":["Iza"],"idIMDB":"nm0001713"},"actorId":"nm0001713","character":"Paige Stack","urlCharacter":"http://www.imdb.com/character/ch0063322","main":true},{"actorName":"Chyna","urlProfile":"http://www.imdb.com/name/nm0491321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4ODE5ODU4MV5BMl5BanBnXkFtZTYwMDEwNzU1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1969","placeOfBirth":" Rochester, New York, USA","birthName":"Joan Marie Laurer","height":"5' 10\" (1.78 m)","bio":"Chyna has been called \"The First Lady of Sports Entertainment\". Her accomplishments have gone far beyond the wrestling ring and far beyond anyone's expectations. Before exchanging body slams, modeling for top magazines and guest-starring on hundreds of shows, Chyna was a shy girl who was born in Rochester, New York. She spent most of her childhood in a home filled with alcoholism and domestic problems. She found her escape through working out, and began doing aerobics and lifting weights at a gym near her home. This is where she found her true niche: in the world of fitness. As the only female in the gym, Chyna always stood out but developed bonds and friendships with the gym members that gave her the encouragement to keep going in the world of fitness. She broke all gender barriers everywhere she went and continued her love of fitness throughout her college days. Chyna graduated from the University of Tampa with a 3.9 GPA and a double major in Spanish Literature in under two years. She also studied foreign languages and can speak English, Spanish, German and French. Chyna is a true humanitarian and has served in the US Army ROTC (Reserve Officer Training Corps) and the Peace Corps, helping to teach illiterate third-world children to read. She is a strong supporter of the National Animal Rescue charity, which helps domesticated animals find good, loving homes. Throughout her life Chyna always dreamed of being an entertainer. She began that career in the early 1990s as a belly dancer and soon moved on to fitness competitions, but at 6'0\" the star found her real calling in the entertainment world: professional wrestling. She began training to be a professional wrestler under the guidance of the wrestling legend Walter 'Killer' Kowalski, in a professional wrestling school in which all the other students were men. She soon took the world of women's wrestling by storm and began competing in the PGWA, where she was named the 1996 Rookie of the Year award for the Women's Championship. After dominating the world of women's wrestling Chyna was discovered by Paul Levesque (aka \"Triple H\") and Shawn Michaels (HBK), two WWF (World Wrestling Federation) superstars who helped Chyna break into the big time. She made her worldwide television debut in February 1997 as a bodyguard for Triple H but soon went on to break all gender stereotypes by competing with some of the toughest men in the WWF, under the name \"Chyna\". Years later she became the only woman to qualify for the Royal Rumble and King of the Ring tournaments and became the only female Intercontinental Champion and the only undefeated Women's Champion in WWF history. Five years after she debuted as a professional wrestler in the WWF, Chyna parted ways with the company. She then toured Japan, taking the country by storm and battling in the ring with the likes of such champions as Keiji Mutô, The Great Kabuki, and most notably, Masahiro Chôno. Her 2002 Tokyo Dome match against Chono earned her the title of Nikkian Sport's 2002 Women's Wrestler of the Year. Meanwhile, back in the US, Chyna appeared in several films, hosted a variety of shows and showed that women can combine strength and beauty in two top-selling issues of \"Playboy\" magazine, which proved to the world that women can be beautiful without having the anorexic \"Twiggy\" look. She also appeared in the first-ever Playboy documentary, which did in-depth interviews with Chyna, her former manager Rich Minzer, her friend Joe Gold and Hugh M. Hefner himself. Her strong will to the best and \"survival of the fittest\" attitude made her one of the top wrestlers in history. She has served as a role model to millions of men and women by proving anything is possible through hard work and determination. In her best-selling autobiography \"If They Only Knew\" she discussed what it took to make it to the top and showed the world what she had to overcome to make her one of the most well-known pop culture icons in the world. Shortly after her first appearance in \"Playboy\" she released her own fitness video, Chyna Fitness: More Than Meets the Eye (2000), which won awards from fitness and lifestyle magazines. The video is still popular with both Chyna's fans and fitness fans alike. Unlike most former pro wrestlers, Chyna has had success on her own two feet. She has been on nearly every talk show and has been featured on hundreds of magazine covers from \"Playboy\" and \"Newsweek\" to \"TV Guide\" and \"People\". She has been featured on Reggie Benjamin's CD \"2X-Centrix\", performing drums and back up vocals. She was on the top of the \"dance music\" billboard charts for five weeks with the CD single \"Ride\". She also sang with her own rock band, \"The Chynna Dolls\", for a short time, playing venues like The Roxy, Elrey Theater, Hollywood Athletic Center and two performances on Howard Stern (1994). She has starred in two comedies, Cougar Club (2007) and Illegal Aliens (2007). She has also hosted a variety of shows, from Robot Wars: Extreme Warriors (2001) to FYE and AMC's \"Tough Guys series. She had many guest-starring roles on TV series, such as Whose Line Is It Anyway? (1998), 3rd Rock from the Sun (1996), Pacific Blue (1996), The Nick Cannon Show (2002), Sabrina, the Teenage Witch (1996), MADtv (1995), MTV's \"Diary\" and many others. She was also featured on season four of The Surreal Life (2003) and VH1's spin off, The Surreal Life: Fame Games (2007) as well as films including Alien Tracker (2003), Alien Fury: Countdown to Invasion (2000), Frank McKlusky, C.I. (2002), Hunter: Back in Force (2003). In 2008 she was featured on VH1's Celebrity Rehab with Dr. Drew (2008) TV series to conquer personal demons and depression caused from an abusive relationship and childhood trauma. In 2009, she released a fashion book, \"Paper Doll\", which became a best-seller. In May 2011 she returned to the world of wrestling with TNA, debuting on the May 12 edition of TNA Impact! Wrestling (2004), and followed it up with one last match at the TNA Sacrifice (2011) Pay Per View, where she and Kurt Angle took on Jeff Jarrett and Karen Angle. That episode was one of the highest-rated for the company in many years. Although her match with TNA was a one-time-only deal, Chyna showed the world she had turned her life around--she overcame depression, emotional trauma and was finally where she wanted to be in life. In June 2011, Chyna released her first adult video with Vivid Entertainment called, Backdoor to Chyna (2011), which sold over a million copies. She said the movie allowed her to regain control of her life, gave her a newfound confidence and got her back on her feet. She embarked on a huge media tour, appearing all over the US. She began feature dancing at high-end nightclubs, appeared on dozens of radio shows including Howard Stern on Demand (2005) and ABC radio and in November 2011 won a Fleshbot Award for her \"Backdoor to Chyna\" video. In 2012, she appeared in A Night at the Silent Movie Theater (2012) and appeared in the music video \"Gonna Make You Love Me\" for the band Lovechild. She also appeared in a tell-all interview with KayFabe Commentaries in which she discussed everything from her childhood to drugs, porn and everything in between. Chyna's future looks bright these days; with her past behind her she is ready for her next project.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4ODE5ODU4MV5BMl5BanBnXkFtZTYwMDEwNzU1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0491321","name":"Chyna","nicknames":["Va-Chyna","The Ninth Wonder of the World","Mamacita"],"idIMDB":"nm0491321"},"actorId":"nm0491321","character":"Teddy Archibald","urlCharacter":"http://www.imdb.com/character/ch0063325","main":true},{"actorName":"Jon Polito","urlProfile":"http://www.imdb.com/name/nm0689237","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjcwMjYzNF5BMl5BanBnXkFtZTYwNTczOTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1950","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"John Polito","height":"5' 8\" (1.73 m)","bio":"A veteran of nearly 100 films, Jon Polito is most recognized for his work with The Coen brothers, as well as his many television appearances as a series regular and guest star. Notable motion picture roles include: Millers Crossing, Barton Fink, The Man Who Wasn't There, The Crow, Blankman, and The Freshman with Marlon Brando, and Big Eyes. Directors he has worked with include; Russel Mulcahy, Clint Eastwood, John McNaughton, Tom Hanks, Andrew Bergman, Michael Apted, Ridley Scott, and Tim Burton amongst others. On television, he starred as a series regular on Crime Story, Ohara, Hearts are Wild, The Chronical, and the critically acclaimed Homicide, Life on the Street. Notable guest star roles include the befuddled landlord Sylvio on Seinfeld, his only role as a woman - Rhonda, on The Chris Isaak Show, Danny Devito's brother Frank on It's Always Sunny in Philadelphia,, and Earl Chambers on Modern Family. He starred on Broadway with Faye Dunaway in The Curse Of An Aching Heart, and with Dustin Hoffman in the 1985 Tony award winning revival of Death Of A Salesman, which he also filmed for CBS. He received the Best Actor OBIE award for Off Broadway theatre in 1980. Other awards include the 2001 TELLY for animation voice over in The Dancing Pumpkin which was directed by his brother Jack Polito, The New York Independent Festival Award for Excellence in Acting, and the 2005 Cinequest Maverick Award for his lifetime body of work in Film and Television. In 2012 Jon received the Best Actor Award for the short film Anti-Muse from the Hollywood Reel Independent Film Festival. He credits his success to three people; his mentor Dominic Garvey, his only acting teacher Irene Baird, and to the late, great director, and friend, Paul Bettis. In addition, his inspiration to this day is New York theatre artist, Theodora Skipitares, who taught him film and design in university, and who has since never been far away from his life. She is 'Art' surviving.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjcwMjYzNF5BMl5BanBnXkFtZTYwNTczOTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0689237","name":"Jon Polito","idIMDB":"nm0689237"},"actorId":"nm0689237","character":"Mr. Archibald","urlCharacter":"http://www.imdb.com/character/ch0063327","main":true},{"actorName":"Loretta Devine","urlProfile":"http://www.imdb.com/name/nm0222643","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NjAyMDc2OF5BMl5BanBnXkFtZTcwNTU3MDMzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1949","placeOfBirth":" Houston, Texas, USA","height":"5' 6½\" (1.69 m)","bio":"Loretta Devine was born August 21, 1949 in Houston, Texas, to Eunice O'Neal (née Toliver), a beautician, and James Devine, who worked as a laborer. Loretta grew up in the Acres Home area of Houston and later enrolled at the University of Houston, where she earned a a Bachelor of Arts in Speech and Drama, and later Brandeis University where she earned a MFA in Theater. With many minor roles in television and film, perhaps Loretta is best known for her performance as Gloria Matthews in Waiting to Exhale (1995). Her performance earned her an NAACP Image Award for Best Supporting Actress, as did her performance in her next film, The Preacher's Wife (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NjAyMDc2OF5BMl5BanBnXkFtZTcwNTU3MDMzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0222643","name":"Loretta Devine","idIMDB":"nm0222643"},"actorId":"nm0222643","character":"Dolly","urlCharacter":"http://www.imdb.com/character/ch0063326","main":true},{"actorName":"Jeremy Rowley","urlProfile":"http://www.imdb.com/name/nm0746811","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDY2ODQ5MF5BMl5BanBnXkFtZTcwMzIyOTAzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Jeremy Rowley is an actor and writer, known for Coyote Ugly (2000), Epic Movie (2007) and Sparks (2013). He has been married to Danielle Morrow since January 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDY2ODQ5MF5BMl5BanBnXkFtZTcwMzIyOTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0746811","name":"Jeremy Rowley","idIMDB":"nm0746811"},"actorId":"nm0746811","character":"Karl","urlCharacter":"http://www.imdb.com/character/ch0063339","main":true},{"actorName":"Scott Michael Campbell","urlProfile":"http://www.imdb.com/name/nm0132843","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1NzQ2MDM3N15BMl5BanBnXkFtZTgwMzEyMDIxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1971","placeOfBirth":" Missoula, Montana, USA","bio":"Scott Michael Campbell was born on August 14, 1971 in Missoula, Montana, USA. He is an actor and writer, known for Brokeback Mountain (2005), Push (2009) and Flight of the Phoenix (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1NzQ2MDM3N15BMl5BanBnXkFtZTgwMzEyMDIxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0132843","name":"Scott Michael Campbell","idIMDB":"nm0132843"},"actorId":"nm0132843","character":"Mr. Conrad","urlCharacter":"http://www.imdb.com/character/ch0063328","main":true},{"actorName":"Mo Collins","urlProfile":"http://www.imdb.com/name/nm0172558","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAyNjg4ZmUtYmU3Zi00ZWNmLWFlNDEtYmJkMmQwYTFiOTcyL2ltYWdlXkEyXkFqcGdeQXVyMTc1ODU0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1965","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Maureen Ann Collins","height":"5' 8½\" (1.74 m)","bio":"Mo Collins was born in Minneapolis, Minnesota, USA. She attended Dudley Riggs Brave New Workshop, honing her improvisation and sketch-writing skills. After many theater productions, dozens of commercials and two films, including Jingle All the Way (1996), she moved to LA. Within a year, she landed her big break on MADtv (1995). Mo is currently (2010) living with her 15 year old son in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAyNjg4ZmUtYmU3Zi00ZWNmLWFlNDEtYmJkMmQwYTFiOTcyL2ltYWdlXkEyXkFqcGdeQXVyMTc1ODU0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0172558","name":"Mo Collins","idIMDB":"nm0172558"},"actorId":"nm0172558","character":"Cindy Conrad","urlCharacter":"http://www.imdb.com/character/ch0063330","main":true},{"actorName":"Molly Cheek","urlProfile":"http://www.imdb.com/name/nm0154882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjA3MjczNV5BMl5BanBnXkFtZTcwNzM4MDAxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1950","placeOfBirth":" Bronxville, New York, USA","height":"5' 8\" (1.73 m)","bio":"Molly Cheek was born on March 2, 1950 in Bronxville, New York, USA. She is an actress and producer, known for American Pie (1999), American Wedding (2003) and It's Garry Shandling's Show. (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjA3MjczNV5BMl5BanBnXkFtZTcwNzM4MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0154882","name":"Molly Cheek","idIMDB":"nm0154882"},"actorId":"nm0154882","character":"Mrs. Holmes","urlCharacter":"http://www.imdb.com/character/ch0063329","main":true},{"actorName":"Robin Thomas","urlProfile":"http://www.imdb.com/name/nm0859450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDE2NjgwN15BMl5BanBnXkFtZTgwNDg0OTQwMTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1949","placeOfBirth":" Pittsfield, Massachusetts, USA","birthName":"Robin Thomas Grossman","height":"5' 11\" (1.8 m)","bio":"Robin Thomas was born on February 12, 1949 in Pittsfield, Massachusetts, USA as Robin Thomas Grossman. He is known for his work on Pacific Rim (2013), Summer School (1987) and The Banger Sisters (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDE2NjgwN15BMl5BanBnXkFtZTgwNDg0OTQwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859450","name":"Robin Thomas","idIMDB":"nm0859450"},"actorId":"nm0859450","character":"Mr. Holmes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carrie Fisher","urlProfile":"http://www.imdb.com/name/nm0000402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4ODU5MDY4MV5BMl5BanBnXkFtZTgwODY1MjQ5MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1956","placeOfBirth":" Burbank, California, USA","birthName":"Carrie Frances Fisher","height":"5' 1\" (1.55 m)","bio":"Carrie Frances Fisher was born on October 21, 1956 in Beverly Hills, Los Angeles, California, to singers/actors Eddie Fisher and Debbie Reynolds. She was an actress and writer, and is known for Star Wars: Episode IV - A New Hope (1977) (aka Star Wars: Episode IV - A New Hope (1977)), Star Wars: Episode V - The Empire Strikes Back (1980) and Star Wars: Episode VI - Return of the Jedi (1983). Fisher is also known for her book, \"Postcards From The Edge\", and Fisher wrote the screenplay for the movie from her novel. Carrie Fisher and talent agent Bryan Lourd have a daughter, Billie Lourd (Billie Catherine Lourd), born on July 17, 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4ODU5MDY4MV5BMl5BanBnXkFtZTgwODY1MjQ5MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000402","name":"Carrie Fisher","idIMDB":"nm0000402"},"actorId":"nm0000402","character":"Glady Goodbey","urlCharacter":"http://www.imdb.com/character/ch0063324","main":true},{"actorName":"Carolyn Hennesy","urlProfile":"http://www.imdb.com/name/nm0377321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NDI3NzgzNV5BMl5BanBnXkFtZTgwMDI3MzUwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1962","placeOfBirth":" Los Angeles, California, USA","birthName":"Carolyn Lee Hennesy","bio":"Carolyn Hennesy was born on June 10, 1962 in Los Angeles, California, USA as Carolyn Lee Hennesy. She is an actress and producer, known for True Blood (2008), Cougar Town (2009) and Revenge (2011). She was previously married to Donald Agnelli.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NDI3NzgzNV5BMl5BanBnXkFtZTgwMDI3MzUwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0377321","name":"Carolyn Hennesy","idIMDB":"nm0377321"},"actorId":"nm0377321","character":"Judge Margaret Emerson","urlCharacter":"http://www.imdb.com/character/ch0063337","main":true}],"seasons":[],"idIMDB":"tt0795361","urlIMDB":"http://www.imdb.com/title/tt0795361","business":{"budget":{"money":"$2,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Open Sky Entertainment"},"technical":{"runtime":["1 hr 37 min (97 min)","1 hr 33 min (93 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Sony HDW-F900, Panavision Digital Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["Video (HDTV)"],"cinematographicProcess":["HDCAM SR"],"printedFilmFormat":["35 mm"]},"rating":"4.2","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"3,141","type":"Movie","companyCreditsSimple":[{"idCompany":"co0152083","name":"Open Sky Entertainment"}],"keywords":{"keywords":["girlfriend","masturbation","2000s","breast fondling","cougar as older woman","female nudity","fellatio","sex with fat woman","female judge","caught masturbating","swimming pool","sex","party","megaphone","fetish"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:46:28"}}