{"data":{"movies":[{"title":"The Jane Austen Book Club","originalTitle":"","year":"2007","releaseDate":"20071005","directors":[{"name":"Robin Swicord","id":"nm0842523"}],"writers":[{"name":"Robin Swicord","id":"nm0842523"},{"name":"Karen Joy Fowler","id":"nm1983962"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYwMzM3MF5BMl5BanBnXkFtZTcwOTAxODM1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"Explores Austen's adage that general incivility is at love's essence. Sylvia's husband dumps her for another woman, so Bernadette and Jocelyn organize a book club to distract her. They recruit Sylvia's daughter Allegra; Prudie, a young teacher whose marriage may be on the rocks; and Grigg, a sci-fi fan who joins out of attraction to Jocelyn. The six read and discuss one Austen novel per month. Jocelyn tries to interest Grigg in Sylvia; Allegra falls in love with a woman she meets skydiving; Prudie contemplates an affair with a student; Sylvia's ex keeps popping up. In the discussions, characters reveal themselves in their comments. By the end, are truths universally acknowledged?","simplePlot":"Six Californians start a club to discuss the works of Jane Austen, only to find their relationships -- both old and new -- begin to resemble 21st century versions of her novels.","actors":[{"actorName":"Maria Bello","urlProfile":"http://www.imdb.com/name/nm0004742","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDE3NTAyOF5BMl5BanBnXkFtZTcwNTg0MDEwMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1967","placeOfBirth":" Norristown, Pennsylvania, USA","birthName":"Maria Elaina Bello","height":"5' 5\" (1.65 m)","bio":"Maria Bello was born on 18 April, 1967 in Norristown, Pennsylvania, to Kathy, a nurse and teacher, and Joe Bello, a contractor. She is of Italian and Polish descent. Maria went to Villanova University, majoring in political science. She had every intention of becoming a lawyer, but she took an acting class during her senior year, just for fun. She discovered she was very good at it, and she was soon cast in small off-Broadway plays, such as \"The Killer Inside Me\", \"Small Town Gals With Big Problems\" and \"Urban Planning\". She later guest-starred on episodes of L'as de la crime (1991), Nowhere Man (1995), Misery Loves Company (1995) and Tandem de choc (1994). She got her big break when producers Kenny Lenhart and John J. Sakmar cast her in the spy show Mr. & Mrs. Smith (1996) as \"Mrs. Smith\" (they remembered her from her performance in a failed pilot that was a remake of the classic TV series 77 Sunset Strip (1958)). The show was canceled after eight weeks on the air. Then came a spot on ER (1994) as \"Dr. Anna Del Amico\", in which she guest-starred on the final three episodes of the third season. The show's producers were so impressed with her that they asked her back as a regular on the series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDE3NTAyOF5BMl5BanBnXkFtZTcwNTg0MDEwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004742","name":"Maria Bello","idIMDB":"nm0004742"},"actorId":"nm0004742","character":"Jocelyn","urlCharacter":"http://www.imdb.com/character/ch0215831","main":true},{"actorName":"Emily Blunt","urlProfile":"http://www.imdb.com/name/nm1289434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY4MTMzM15BMl5BanBnXkFtZTcwMjg5NzM2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1983","placeOfBirth":" Roehampton, London, England, UK","birthName":"Emily Olivia Leah Blunt","height":"5' 7\" (1.7 m)","bio":"Emily Olivia Leah Blunt is a British actress known for her roles in The Young Victoria (2009) and The Devil Wears Prada (2006). Blunt was born on February 23, 1983, in Roehampton, South West London, England, the second of four children in the family of Joanna Mackie, a former actress and teacher, and Oliver Simon Peter Blunt, a barrister. Her grandfather was Major General Peter Blunt, and her uncle is MP Crispin Blunt. Emily received a rigorous education at Ibstock Place School, a co-ed private school at Roehampton. However, young Emily Blunt had a stammer, since she was a kid of 8. Her mother took her to relaxation classes, which did not do anything. She reached a turning point at 12, when a teacher cleverly asked her to play a character with a different voice and said, \"I really believe in you\". Blunt ended up using a northern accent, and it did the trick, her stammer disappeared. From 1999 - 2001, Blunt went to Hurtwood House, the top co-ed boarding school where she would excel at sport, cello and singing. She also had two years of drama studies at Hurtwood's theatre course. In August 2000, she was chosen to perform at the Edinburgh Festival. She was signed up by an agent, Kenneth Mcreddie, who led her to the West End and the BBC, scoring her roles in several period dramas on stage as well as on TV productions, such as Foyle's War (2002), Henry VIII (2003) and Empire (2005). In 2001, she appeared as \"Gwen Cavendish\" opposite Dame Judi Dench in Sir Peter Hall's production of \"The Royal Family\" at Haymarket Theatre. For that role, she won the Evening Standard Award for Best Newcomer. In 2002, she played \"Juliet\" in \"Romeo and Juliet\" at the prestigious Chichester Festival. Blunt's career ascended to international fame after she starred as \"Isolda\" opposite Alex Kingston in Warrior Queen (2003). A year later, she won critical acclaim for her breakout performance as \"Tamsin\", a well-educated, cynical and deceptive 16-year-old beauty in My Summer of Love (2004), a story of two lonely girls from the opposite ends of the social heap. Emily Blunt and her co-star, Natalie Press, shared an Evening Standard British Film award for Most Promising Newcomer. In 2005, she spent a few months in Australia filming Irresistible (2006) with Susan Sarandon and Sam Neill. Blunt gave an impressive performance as \"Mara\", a cunning young destroyer who acts crazy and surreptitiously provokes paranoia in others. She also continued her work on British television, starring as \"Natasha\" in Stephen Poliakoff's Gideon's Daughter (2005), opposite Bill Nighy, a role that won her a 2007 Golden Globe Award for Best Performance by an Actress in a Supporting Role. She continued the line of playing manipulative characters as \"Emily\", a caustic put-upon assistant to Meryl Streep's lead in The Devil Wears Prada (2006). Blunt's performance with a neurotic twist added a dimension of sarcasm to the comedy, and gained her much attention as well as new jobs: in two dramas opposite Tom Hanks, then in the title role in the period drama, The Young Victoria (2009). Her most recent works include appearances as antiques dealer \"Gwen Conliffe\" in The Wolfman (2010) and as the ballerina in The Adjustment Bureau (2011). Emily Blunt is a highly versatile actress and a multifaceted person. Her talents include singing and playing cello; she is also skilled at horseback riding. She was in a relationship with Canadian singer Michael Bublé, whom she met at the Australian Logie Awards in 2005 and, again, a few months later, backstage at his Los Angeles concert. Their relationship ended in 2008. Blunt's friend, Anne Hathaway, introduced her to John Krasinski, and they have been together since November 2008. On August 28, 2009, Blunt and Krasinski announced their engagement. The couple married on July 10, 2010, at the estate of their friend, George Clooney, on Lake Como in Italy. Emily Blunt and John Krasinski are living in the Los Angeles area, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY4MTMzM15BMl5BanBnXkFtZTcwMjg5NzM2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1289434","name":"Emily Blunt","nicknames":["Em"],"idIMDB":"nm1289434"},"actorId":"nm1289434","character":"Prudie","urlCharacter":"http://www.imdb.com/character/ch0391012","main":true},{"actorName":"Kathy Baker","urlProfile":"http://www.imdb.com/name/nm0000834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTA4NTExNV5BMl5BanBnXkFtZTcwNjU0MDgzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1950","placeOfBirth":" Midland, Texas, USA","birthName":"Kathy Whitton Baker","height":"5' 6\" (1.68 m)","bio":"For someone who has made an award-winning impact in all three mediums (stage, film and TV), actress Kathy Baker has been strangely denied all-out stardom, yet continues to demonstrate her versatility in whatever material comes her way. The comely blonde was born Katherine Whitton Baker in Midland, Texas, the daughter of parents John Seawand Baker, a geologist and educator who taught at both the University of Paris and at Princeton, and Helene Andree Baker (née Whitton). Raised in New Mexico, she first took to the stage at age 10. Influenced by her French-born mother, Kathy attended the University of California at Berkeley and instead received her Bachelor of Arts degree in French in 1977. From there she went to Paris to study haute cuisine at the famed Cordon Bleu. She returned to the States originally to work as a pastry chef, but still discovered a smouldering desire to act and eventually joined San Francisco's Magic Theatre. There she appeared in the play \"The Man Who Killed the Buddha\" and gave a performance that drew the immediate attention of playwright Sam Shepard. 1983 was a banner year for Kathy. At the Magic Theatre, wherein she used the stage name of Kathy Whitton Baker, Shepard cast her in a leading role in one of his new plays, \"Fool for Love.\" The premiere garnered exceptional notices and the play (and Kathy) went to New York. She and co-star Ed Harris, won 1984 Obie Awards for their rich performances, as did playwright Shepard for directing. The production itself won the Obie for \"Best New American Play.\" That same year Kathy made a strong movie debut co-starring in The Right Stuff (1983) as the wife of astronaut Alan Shepard (played by Scott Glenn). Displaying an attractive intelligence in her performances, Kathy continued to make strides on the New York stage both in 1984's \"Desire Under the Elms\" and as a replacement for the Lemon character in the Obie-winning \"Aunt Dan and Lemon\" at Joseph Papp's Shakespeare Festival in 1986. Later in the decade, both Kathy and Morgan Freeman stole the thunder right from under star Christopher Reeve in the tense film drama Street Smart (1987) with Kathy delivering a grim, heartfelt performance as an ill-fated hooker to Freeman's feral pimp. Both perfs delivered a one-two punch and were applauded for their shocking realism. Each received their share of awards and plaudits; Kathy nabbed both the National Society of Critics and Boston Society of Critics awards, but was shamefully snubbed when it came to the Oscar race (Freeman was nominated, but lost). Throughout the rest of the decade Kathy continued to give spot-on performances in such quality films as Clean and Sober (1988), as a recovering addict; Permanent Record (1988), as a wife whose son commits suicide; Jacknife (1989), in which she was reunited with Ed Harris as the put-upon, plain-Jane sister of an alcoholic Vietnam vet; and Edward Scissorhands (1990) as a seemingly model housewife who has an uncontrollably flirtatious nature. Top-flight stardom seemed to be almost a given. With the new decade, however, the movie roles tendered out to her became less frequent or noteworthy so Kathy decided to focus outside her medium of choice and actively search for TV roles. The results were customarily expert. In the slightly quirky Picket Fences (1992), Kathy found a perfect fit taking on the role of small town mother and doctor Jill Brock. Running for four seasons, she was nominated for an Emmy each year and took home the trophy three of those four times for \"Outstanding Lead Actress in a Drama Series\". Into the millennium Kathy has maintained consistency with quality roles in the more recent releases Cold Mountain (2003) and The Jane Austen Book Club (2007). On TV she and Helen Mirren picked up supporting Emmy nods in the bittersweet Door to Door (2002), with Emmy-winning William H. Macy starring as a man with cerebral palsy. In 2001 she joined the cast of Boston Public (2000) as a manipulative mom (another Emmy nomination). Some of those episodes were directed by Steven Robman, whom she married in June of 2003. Kathy has two sons from a previous marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTA4NTExNV5BMl5BanBnXkFtZTcwNjU0MDgzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000834","name":"Kathy Baker","idIMDB":"nm0000834"},"actorId":"nm0000834","character":"Bernadette","urlCharacter":"http://www.imdb.com/character/ch0214717","main":true},{"actorName":"Amy Brenneman","urlProfile":"http://www.imdb.com/name/nm0000312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ3MjkzNTkzNF5BMl5BanBnXkFtZTcwNTQ4MjgxNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1964","placeOfBirth":" New London, Connecticut, USA","birthName":"Amy Frederica Brenneman","height":"5' 6\" (1.68 m)","bio":"Amy Frederica Brenneman was born in New London, Connecticut, to Frederica (Shoenfield), a judge in the Connecticut State Superior Court, and Russell Langdon Brenneman, Jr., an environmental lawyer. Amy's mother was one of the first women to graduate from Harvard. Amy is also a graduate of Harvard, where she majored in comparative religion. She spent one semester studying sacred dances in Nepal. While in college, she formed the Cornerstone Theater Company, a touring production company that takes classics to small towns and encourages locals to participate in them. After touring for five years, she moved to New York, where she became a teacher in Brooklyn. She landed her first TV role in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ3MjkzNTkzNF5BMl5BanBnXkFtZTcwNTQ4MjgxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000312","name":"Amy Brenneman","nicknames":["Ames"],"idIMDB":"nm0000312"},"actorId":"nm0000312","character":"Sylvia","urlCharacter":"http://www.imdb.com/character/ch0456924","main":true},{"actorName":"Maggie Grace","urlProfile":"http://www.imdb.com/name/nm1192254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDYxNjU1N15BMl5BanBnXkFtZTgwMDU2MzQ0ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1983","placeOfBirth":" Columbus, Ohio, USA","birthName":"Margaret Grace Denig","height":"5' 9\" (1.75 m)","bio":"Maggie Grace was born on September 21, 1983, in Columbus, Ohio, to Valinn (Everett) and Rick Denig, who ran a jewelry business. She has English, German, and Scots-Irish ancestry. Grace got her start in films in 2002 with Murder in Greenwich (2002) and Shop Club (2002). In 2003, at the age of 20, she played a creepy, Goth-influenced estranged daughter of Wendy Crewson and Tom Selleck in the drama Twelve Mile Road (2003), but her big break didn't come until one year later, playing the beautiful Shannon Rutherford on the hit ABC island-survival drama Lost (2004). She also stars with Smallville (2001) cover boy Tom Welling in the horror film The Fog (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDYxNjU1N15BMl5BanBnXkFtZTgwMDU2MzQ0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1192254","name":"Maggie Grace","idIMDB":"nm1192254"},"actorId":"nm1192254","character":"Allegra","urlCharacter":"http://www.imdb.com/character/ch0056195","main":true},{"actorName":"Jimmy Smits","urlProfile":"http://www.imdb.com/name/nm0001751","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4OTI5MTE3NF5BMl5BanBnXkFtZTYwMDMxNjc4._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1955","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Jimmy L. Smits","height":"6' 3\" (1.91 m)","bio":"Jimmy Smits was born on July 9, 1955 in Brooklyn, New York City, New York, USA as Jimmy L. Smits. He is an actor and producer, known for Star Wars: Episode III - Revenge of the Sith (2005), NYPD Blue (1993) and Star Wars: Episode II - Attack of the Clones (2002). He was previously married to Barbara Smits.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4OTI5MTE3NF5BMl5BanBnXkFtZTYwMDMxNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001751","name":"Jimmy Smits","idIMDB":"nm0001751"},"actorId":"nm0001751","character":"Daniel","urlCharacter":"http://www.imdb.com/character/ch0456925","main":true},{"actorName":"Ed Brigadier","urlProfile":"http://www.imdb.com/name/nm0108970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ1MTcwOTg0MF5BMl5BanBnXkFtZTcwNTE5ODAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1949","placeOfBirth":" Cleveland, Ohio, USA","bio":"Ed Brigadier was born on October 16, 1949 in Cleveland, Ohio, USA. He was an actor and casting director, known for The Jane Austen Book Club (2007), Mockingbird Don't Sing (2001) and Dr. Chopper (2005). He died on February 26, 2012 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ1MTcwOTg0MF5BMl5BanBnXkFtZTcwNTE5ODAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0108970","name":"Ed Brigadier","idIMDB":"nm0108970"},"actorId":"nm0108970","character":"Pastor","urlCharacter":"http://www.imdb.com/character/ch0456926","main":true},{"actorName":"Kevin Zegers","urlProfile":"http://www.imdb.com/name/nm0954225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE3MDcxNl5BMl5BanBnXkFtZTgwNTMzNTU5OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1984","placeOfBirth":" Woodstock, Ontario, Canada","birthName":"Kevin Joseph Zegers","height":"5' 10\" (1.78 m)","bio":"Kevin Joseph Zegers started acting at the tender age of six. He has starred in more than 40 films, including Air Bud (1997), Dawn of the Dead (2004), and Transamerica (2005), and has also appeared in several modeling campaigns. Kevin was born in Woodstock, Ontario, to Mary-Ellen (Veldman), a teacher, and James Zegers, a quarry worker. All of his grandparents were Dutch immigrants. He lives in Los Angeles, CA, with his wife, agent Jaime Feld (CAA). Their daughters, Zoë Madison and Blake Everleigh, were born on August 17, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE3MDcxNl5BMl5BanBnXkFtZTgwNTMzNTU5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0954225","name":"Kevin Zegers","nicknames":["Ziggy"],"idIMDB":"nm0954225"},"actorId":"nm0954225","character":"Trey","urlCharacter":"http://www.imdb.com/character/ch0179426","main":true},{"actorName":"Marc Blucas","urlProfile":"http://www.imdb.com/name/nm0089456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTYxMTIyNV5BMl5BanBnXkFtZTgwNDQ4MzkyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1972","placeOfBirth":" Butler, Pennsylvania, USA","birthName":"Marcus Paul Blucas","height":"6' 2\" (1.88 m)","bio":"Marc graduated Girard High School in 1990. Marc played basketball throughout high school and his senior year. Because of his athletic ability, Marc went on full scholarship to Wake Forest University in Winston-Salem North Carolina. After college, he played one year in Europe for the Manchester Giants. His acting break came when the producers of Eddie (1996) needed a baby-faced kid that could play basketball.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTYxMTIyNV5BMl5BanBnXkFtZTgwNDQ4MzkyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089456","name":"Marc Blucas","idIMDB":"nm0089456"},"actorId":"nm0089456","character":"Dean","urlCharacter":"http://www.imdb.com/character/ch0290143","main":true},{"actorName":"Catherine Schreiber","urlProfile":"http://www.imdb.com/name/nm0775220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTE3NTAyMV5BMl5BanBnXkFtZTcwOTgwNTE1Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Catherine Schreiber is an actress, known for The Jane Austen Book Club (2007), Rat Race (2001) and Volcano (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTE3NTAyMV5BMl5BanBnXkFtZTcwOTgwNTE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0775220","name":"Catherine Schreiber","idIMDB":"nm0775220"},"actorId":"nm0775220","character":"Academic Woman","urlCharacter":"http://www.imdb.com/character/ch0456927","main":true},{"actorName":"Ned Hosford","urlProfile":"http://www.imdb.com/name/nm2465513","urlPhoto":"","biography":{"bio":"Ned Hosford is an actor, known for The Jane Austen Book Club (2007), SIFF 35th Anniversary Tribute (2009) and Mesmerize Me (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2465513","name":"Ned Hosford","idIMDB":"nm2465513"},"actorId":"nm2465513","character":"Waiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh Dancy","urlProfile":"http://www.imdb.com/name/nm0199215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTgxMDM2OV5BMl5BanBnXkFtZTcwMTQ1Mzc3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1975","placeOfBirth":" Stoke-on-Trent, Staffordshire, England, UK","height":"5' 10\" (1.78 m)","bio":"Talented British actor Hugh Dancy is one of the UK's most up-and-coming talents. Hugh Michael Horace Dancy was born in Stoke-on-Trent, Staffordshire, England, to Sarah Ann (Birley), who works in academic publishing, and Jonathan Peter Dancy, a philosophy professor and writer. He has a brother, Jack (b. 1977), and a sister, Kate (b. 1980). He was raised in Newcastle-under-Lyme. He got started with roles in the series Trial & Retribution (1997), Dangerfield (1995), Kavanagh QC (1995) and Granada's popular series, Cold Feet (1997), and his theater appearances include Sam Mendes's David Copperfield (2000) and BBC's Madame Bovary (2000). He also portrayed \"D'Artagnan\" in the series, Young Blades (2001). Dancy's appearance in Ridley Scott's war drama, Black Hawk Down (2001), as \"Medic Kurt Schmid\" was followed with starring roles in Tempo (2003) with Melanie Griffith and Rachael Leigh Cook and The Sleeping Dictionary (2003). He played Prince Charmont opposite Anne Hathaway in Ella Enchanted (2004), and Sir Galahad in King Arthur (2004). He has since become well known for his roles as the Earl of Essex in the mini-series Elizabeth I (2005) and Will Graham on the show Hannibal (2013). Dancy married American actress Claire Danes in 2009. The couple has one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTgxMDM2OV5BMl5BanBnXkFtZTcwMTQ1Mzc3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199215","name":"Hugh Dancy","nicknames":["Fancy Dancy"],"idIMDB":"nm0199215"},"actorId":"nm0199215","character":"Grigg","urlCharacter":"http://www.imdb.com/character/ch0388774","main":true},{"actorName":"Messy Stench","urlProfile":"http://www.imdb.com/name/nm2670286","urlPhoto":"","biography":{"bio":"Messy Stench is an actress, known for The Jane Austen Book Club (2007), Dangerous Worry Dolls (2008) and In a Spiral State (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2670286","name":"Messy Stench","idIMDB":"nm2670286"},"actorId":"nm2670286","character":"Girl with Dog Collar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Burket","urlProfile":"http://www.imdb.com/name/nm2421526","urlPhoto":"","biography":{"bio":"Chris Burket is known for his work on Dawn of the Planet of the Apes (2014), Oz the Great and Powerful (2013) and Underworld Awakening (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2421526","name":"Chris Burket","idIMDB":"nm2421526"},"actorId":"nm2421526","character":"Skydive Instructor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Parisa Fitz-Henley","urlProfile":"http://www.imdb.com/name/nm1406792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MDQ3MTcxMV5BMl5BanBnXkFtZTgwODc2ODk4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9½\" (1.77 m)","bio":"Parisa Fitz-Henley is an actress and producer, known for Jessica Jones (2015) and Midnight, Texas (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MDQ3MTcxMV5BMl5BanBnXkFtZTgwODc2ODk4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1406792","name":"Parisa Fitz-Henley","idIMDB":"nm1406792"},"actorId":"nm1406792","character":"Corinne","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0866437","urlIMDB":"http://www.imdb.com/title/tt0866437","business":{"budget":null,"openingWeekend":[{"money":"£50,052","country":"UK","day":"18","month":"11","year":"2007","remarks":"106 Screens"}],"gross":[{"money":"$3,573,870","country":"USA","day":"16","month":"12","year":"2007","remarks":""},{"money":"$3,569,428","country":"USA","day":"09","month":"12","year":"2007","remarks":""},{"money":"$3,566,338","country":"USA","day":"02","month":"12","year":"2007","remarks":""},{"money":"$3,555,238","country":"USA","day":"24","month":"11","year":"2007","remarks":""},{"money":"$3,546,272","country":"USA","day":"18","month":"11","year":"2007","remarks":""},{"money":"$3,482,038","country":"USA","day":"04","month":"11","year":"2007","remarks":""},{"money":"$3,334,613","country":"USA","day":"21","month":"10","year":"2007","remarks":""},{"money":"$3,002,853","country":"USA","day":"14","month":"10","year":"2007","remarks":""},{"money":"$1,819,721","country":"USA","day":"07","month":"10","year":"2007","remarks":""},{"money":"$400,666","country":"USA","day":"30","month":"09","year":"2007","remarks":""},{"money":"£50,052","country":"UK","day":"18","month":"11","year":"2007","remarks":""}],"weekendGross":[{"money":"$2,464","country":"USA","day":"16","month":"12","year":"2007","remarks":"4 Screens"},{"money":"$1,272","country":"USA","day":"09","month":"12","year":"2007","remarks":"7 Screens"},{"money":"$3,810","country":"USA","day":"02","month":"12","year":"2007","remarks":"10 Screens"},{"money":"$3,988","country":"USA","day":"24","month":"11","year":"2007","remarks":"8 Screens"},{"money":"$11,821","country":"USA","day":"18","month":"11","year":"2007","remarks":"29 Screens"},{"money":"$24,031","country":"USA","day":"04","month":"11","year":"2007","remarks":"35 Screens"},{"money":"$114,763","country":"USA","day":"21","month":"10","year":"2007","remarks":"132 Screens"},{"money":"$549,998","country":"USA","day":"14","month":"10","year":"2007","remarks":"1,001 Screens"},{"money":"$1,343,596","country":"USA","day":"07","month":"10","year":"2007","remarks":"1,232 Screens"},{"money":"$192,719","country":"USA","day":"30","month":"09","year":"2007","remarks":"41 Screens"},{"money":"£50,052","country":"UK","day":"18","month":"11","year":"2007","remarks":"106 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"11","year":"2006","remarks":null},null],"copyrightHolder":"Sony Pictures Classics Inc."},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arricam ST"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm"]},"rating":"6.8","metascore":"61","filmingLocations":[{"location":"Encino, Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Casting Society of America, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Independent Feature - Drama/Comedy","names":[{"name":"Deborah Aquila","id":"nm0032597","role":null},{"name":"Tricia Wood","id":"nm0939873","role":null},{"name":"Jennifer L. Smith","id":"nm1341114","role":null}]}]}]},{"award":"GLAAD Media Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated GLAAD Media Award","categories":[{"category":"Outstanding Film - Wide Release","names":[]}]}]}],"votes":"22,299","type":"Movie","companyCreditsSimple":[{"idCompany":"co0124412","name":"Mockingbird Pictures"},{"idCompany":"co0125552","name":"John Calley Productions"}],"keywords":{"keywords":["club","teacher","marriage","reading","jane austen","lesbian","funeral","book","friend","writer","skydiving","book club","dog","f rated","title directed by female","robot","reference to paris france","reference to pepsi cola","falling from height","bicycle","security check","parking ticket","traffic light","freeway","hare krishna","tai chi","treadmill","father daughter relationship","older woman younger woman relationship","playground","bathtub","bath","boy","school play","reference to brigadoon the stage musical","dog breeder","dog breeding","knitting","cliff climbing","basketball","midlife crisis","cell phone","telephone call","cemetery","graveyard","burial","hospital","credit card","computer","goth","movie theatre","death of dog","death","teenage girl","teenage boy","watching tv","montage","pot smoking","marijuana","drug use","bookstore","voice over narration","eating","food","drinking","drink","sex","infidelity","unfaithfulness","adultery","old friend","husband wife relationship","friendship","wine","teacher student relationship","sofa","reconciliation","pregnancy","penis","mother daughter relationship","library","lesbian relationship","lawyer","lawn mower","kiss","jealousy","jealous husband","injury","hotel","high school","group","furniture store","ex husband ex wife relationship","elevator","doctor","divorce","convention","computer genius","coffee shop","champagne","cafe","brother sister relationship","broken wrist","book discussion","beach","bar","attorney","extramarital affair","accident","rhodesian ridgeback","german shepherd","death of mother","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:54:07"}}