{"data":{"movies":[{"title":"Sleuth","originalTitle":"","year":"2007","releaseDate":"20080213","directors":[{"name":"Kenneth Branagh","id":"nm0000110"}],"writers":[{"name":"Harold Pinter","id":"nm0056217"},{"name":"Anthony Shaffer","id":"nm0787289"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4Nzc0MTA5MF5BMl5BanBnXkFtZTcwNDI1MjI1MQ@@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Drama","Mystery","Thriller"],"plot":"Two extremely clever British men are in a game of trickery and deceit. Andrew Wyke, an aging famous author who lives alone in a high-tech mansion, after his wife Maggie has left him for a younger man; and Milo Tindle, an aspiring actor, equipped with charm and wit, who demonstrates both qualities once again. When Wyke invites Tindle to his mansion, Tindle seeks to convince the former into letting his wife go by signing the divorce paper. However, Wyke seems far more interested in playing mind games with his wife's new lover, and lures him into a series of actions he thoroughly planned in seeking revenge on his unfaithful spouse.","simplePlot":"On his sprawling country estate, an aging writer matches wits with the struggling actor who has stolen his wife's heart.","actors":[{"actorName":"Michael Caine","urlProfile":"http://www.imdb.com/name/nm0000323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1933","placeOfBirth":" Rotherhithe, London, England, UK","birthName":"Maurice Joseph Micklewhite","height":"6' 1\" (1.85 m)","bio":"Michael Caine was born Maurice Joseph Micklewhite in London, to Ellen Frances Marie (Burchell), a charlady, and Maurice Joseph Micklewhite, a fish-market porter. He left school at 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit, \"The Long and the Short and the Tall.\" Zulu (1964), the 1964 epic retelling of a historic 19th-century battle in South Africa between British soldiers and Zulu warriors, brought Caine to international attention. Instead of being typecast as a low-ranking Cockney soldier, he played a snobbish, aristocratic officer. Although \"Zulu\" was a major success, it was the role of Harry Palmer in The Ipcress File (1965) and the title role in Alfie (1966) that made Caine a star of the first magnitude. He epitomized the new breed of actor in mid-'60s England, the working-class bloke with glasses and a down-home accent. However, after initially starring in some excellent films, particularly in the 1960s, including Gambit (1966), Funeral in Berlin (1966), Play Dirty (1969), Battle of Britain (1969), Too Late the Hero (1970), The Last Valley (1971) and especially Get Carter (1971), he seemed to take on roles in below-average films, simply for the money he could by then command. There were some gems amongst the dross, however. He gave a magnificent performance opposite Sean Connery in The Man Who Would Be King (1975) and turned in a solid one as a German colonel in The Eagle Has Landed (1976). Educating Rita (1983) and Hannah and Her Sisters (1986) (for which he won his first Oscar) were highlights of the 1980s, while more recently Little Voice (1998), The Cider House Rules (1999) (his second Oscar) and Last Orders (2001) have been widely acclaimed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000323","name":"Michael Caine","idIMDB":"nm0000323"},"actorId":"nm0000323","character":"Andrew","urlCharacter":"http://www.imdb.com/character/ch0017488","main":true},{"actorName":"Jude Law","urlProfile":"http://www.imdb.com/name/nm0000179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTg5NTQ3NV5BMl5BanBnXkFtZTcwNzM3MDAzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1972","placeOfBirth":" Lewisham, London, England, UK","birthName":"David Jude Law","height":"5' 10\" (1.78 m)","bio":"Jude Law is a talented and versatile actor. Law has been nominated for two Academy Awards and continues to build a prolific body of work that spans from early successes such as Gattaca (1997) and The Talented Mr. Ripley (1999) to more recent turns as Dr. John Watson in Sherlock Holmes (2009) and Sherlock Holmes: A Game of Shadows (2011), as Hugo's father in Hugo (2011) and in the titular role in Dom Hemingway (2013). David Jude Law was born on December 29, 1972 in Lewisham, London, England, to Margaret Anne (Heyworth) and Peter Robert Law, both of whom taught at comprehensive schools; his father later became a headmaster. Law has said that he was named after both the book Jude the Obscure and the song Hey Jude. In 1992, Jude began his stage career. He starred in many plays throughout London, and was nominated for the Laurence Olivier Award of \"Outstanding Newcomer\" After doing the play \"Indiscretions\" in London, he moved and did it again on Broadway. This time, he was alongside Kathleen Turner. He then received a Tony Nomination for \"Outstanding Supporting Actor\". He was then rewarded the Theatre World Award. After Broadway, Jude started on the big screen, in many independent films. His first big-named movie was Gattaca (1997), with Uma Thurman and Ethan Hawke. He also had a good role in Midnight in the Garden of Good and Evil (1997). Jude's latest rise to fame has been because of The Talented Mr. Ripley (1999), in which he plays Matt Damon's obsession. The film did very well at the box office, and critics loved Jude's acting. Following the success of Gattaca (1997) and The Talented Mr. Ripley (1999), Law's feature film career continued to gain momentum throughout the late 1990s and early 2000s with roles in such films as Enemy at the Gates (2001), Road to Perdition (2002), I Heart Huckabees (2004), Aviator (2004) and many others. Law is one of three actors, along with Colin Farrell and Johnny Depp, to take over acting responsibilities in the Terry Gilliam project The Imaginarium of Doctor Parnassus (2009) following Heath Ledger's death. Law is a partner in the production company \"Natural Nylon\". His partners include Jonny Lee Miller, Ewan McGregor and his ex-wife Sadie Frost. Law has been active in many charitable activities and supports several different foundations and causes, doing work for organizations including the Make-A-Wish Foundation, Make Poverty History, Breast Cancer Care and others. Law is also a peace advocate, and in 2011, participated in street protests against the rule of Alexander Lukashenko in Belarus. Law married Sadie Frost in 1997 and the couple had two sons (Rafferty and Rudy) and a daughter (Iris) before divorcing in 2003. Law and Alfie (2004) co-star Sienna Miller were engaged to be married in 2005 and separated in 2006 (they would later rekindle their relationship in 2009, splitting once again in 2011). Law and American model Samantha Burke had a brief relationship in 2008 that resulted in the birth of Law's fourth child, daughter Sophia. Law's fifth child, with an ex-girlfriend, Catherine Harding, was born in 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTg5NTQ3NV5BMl5BanBnXkFtZTcwNzM3MDAzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000179","name":"Jude Law","idIMDB":"nm0000179"},"actorId":"nm0000179","character":"Milo","urlCharacter":"http://www.imdb.com/character/ch0017487","main":true},{"actorName":"Harold Pinter","urlProfile":"http://www.imdb.com/name/nm0056217","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwODY3NTA4MV5BMl5BanBnXkFtZTcwMTM0OTAyOQ@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1930","placeOfBirth":" Hackney, London, England, UK","bio":"Harold Pinter, the 2005 Nobel Laureate for Literature, was born October 10, 1930, in London's working-class Hackney district to Hyman and Frances Pinter, Eastern European Jews who had immigrated to the United Kingdom from Portugal. Hyman (known as \"Jack\") was a tailor specializing in women's clothing and Frances was a homemaker. The Pinters, whose families hailed from Odessa and Poland in the Russian Empire, were part of a wave of Jewish emigration to the UK at the turn of the last century. It was a community that revered learning and culture. The Pinter family was close, and young Harold was traumatized when, at the outbreak of World War II, he was evacuated from London to Cornwall with other London children for a year to avoid becoming casualties of German aerial bombing. Pinter has said that his encounter with anti-Semitism while growing up was the fuse that ignited the organic process leading him to becoming a playwright. As the Nobel Prize citation attests, Pinter developed into the greatest English dramatist of the post-World War II era. The young Pinter studied acting at the Royal Academy of Dramatic Art and the Central School of Speech and Drama. In 1950 he published several poems and began working as a professional actor. Under the stage name David Baron, he toured the Republic of Ireland with Anew McMaster's Shakespearean repertory company in 1951-52. Significantly for Pinter's future, 1951 not only marked the debut of his career as a professional actor but also marked the first performance of future Nobel Literature Laureate Samuel Beckett's absurdist masterpiece \"Waiting for Godot.\" He next appeared with Sir Donald Wolfit's theatrical company at the King's Theatre, Hammersmith, for the 1953- 54 season before becoming a player with various provincial repertory companies, including the Birmingham Rep, until he gave himself over full-time to playwriting in 1959. Two significant events that would change Great Britain forever occurred during his apprenticeship in provincial rep: (1) the Suez Crisis of 1955 that shattered the UK's pretensions to empire in a post-colonial world and doomed the imperial generations represented by Prime Minister Anthony Eden and his mentor Winston Churchill, and (2) the 1956 premiere of John Osborne's play \"Look Back in Anger.\" The shattering of the United Kingdom's complacency over imperialism meant that many successful people of Pinter's generation, who normally would have become Tories upon achieving some modicum of success, were disillusioned and drifted towards Labour and the left. No longer would a working- class person, if he so chose, have to be ashamed or stymied if \\eschewing becoming middle-class or bourgeois. Osborne's play was the seminal work of the \"kitchen-sink\" school of drama that would dominate English theater for a decade, in which working-class life and struggles were dramatized. The hegemony of this school of theater was such that for the first time, a working-class or provincial accent became something treasured, something to be proud of, as the former world was set firmly upon its head. Even the great Laurence Olivier turned his back on the commercial theater to assay Osbourne's Archie Rice, a down-at-the-heels music hall performer, in \"The Entertainer\" (1957). The kitchen-sink drama was a movement that Pinter would not be a part of, though it did open the doors for working-class writers who, unlike the working class-born Noël Coward, had no interest in becoming bourgeois. The other major element in the cultural milieu that forged Pinter was the Cold War, the absurdity of facing doomsday everyday under the threat of The Bomb (the USSR had acquired the means to produce a bomb through its atomic spy ring and exploded its first A-bomb in 1949, thus ending the US monopoly on nuclear weapons and making the Korean war, the suppression of an East Berlin uprising and the squashing of the Hungarian Revolution practical, if not possible). The Cold War gave legitimacy to the rise of the police state, not in totalitarian countries but in the use of police-state tactics in the western industrial democracies. To quote American poet' Charles Bukowski', this was an era marked by \"War All The Time,\" not between two superpower behemoths but in everyday human relations, poisoned as they were by the Cold War climate of absurdity, paranoia and imminent holocaust. In 1953 the accused \"atomic spies\" Julius Rosenberg and Ethel Rosenberg were executed in the United States when President Dwight D. Eisenhower, the man who had overseen the liberation of Europe as Supreme Allied Commander fighting the Nazi totalitarian menace, had refused clemency for even Ethel, the mother of two small boys. It was a domestic drama -- a woman's loyalty to her husband, her loss of not only her life but the Issac-like evocative sacrifice of any normal life for her two children when Eisenhower-Jehovah refused to stay the executioner's hand -- that had combined with the felicities of affairs of state and world power politics. The question of whether they were guilty or innocent--not proven beyond a doubt in 1951, when they had been convicted in a trial that was compared by many to the Stalinist show-trials that had occurred in the Soviet Union and still occurred in the satellite countries of the Warsaw Pact after World War II - gave rise to an overwhelming fundamental question: What is real? Reality, as Hannah Arendt had put it in \"The Human Condition,\" is socially defined; that is a given. But how about when that reality no longer makes sense, when the individual cannot partake of the consensus demanded of him in the 1950s, whether conservative, middle-class, haute bourgeoisie or radical left as dictated by some flaming Red party boss - a person struggling with his own life? How does he answer the question: What is real? It is a question that Pinter took upon himself to answer, and answered by showing us there is no answer. In this quest, a genius arrived on the world stage in the form of a player who decided to craft his own words, for himself and his post-Holocaust, pre-Holocaust audience. When life stops making sense, as it did in the 1940s when the global war against fascism left 50 million dead and the modern industrial state was tasked with the exigencies of mass- murder, and as it did in the 1950s when, under the aegis of combating another totalitarian system a domestic fascism in kind if not degree arose in the Anglo-Saxon countries with their great gravital pull towards conformity within a shell of consumerism, it still behooves a human being to try to understand the human condition. In 1957 Bristol University staged Pinter's first play \"The Room.\" He had told a friend who worked in Bristol University's drama department an idea he had for a play. The friend was so enamored of the idea that he commissioned the work, with the proviso that a script be ready within a week. Though he didn't believe he could meet his friend's demands, Pinter wrote the one-act play in four days. \"The Room\" had all the hallmarks of what would become known as \"Pinteresque,\" in that it had a mundane situation that gradually filled with menace and mystery through the author's deliberate omission of an explanation or motivation for the action on stage. It is ironic perhaps that an actor would rid his script of motivation as \"motivation\" is the Holy Grail of inwardly-directed actors such as those tutored in \"The Method\" in America, but it was emblematic of the times that stated motivations frequently masked other, starker, more id-like drives in people or in nation-states that were beyond human comprehension in terms of being rational. Modern society had become irrational, and motivations post-Freud could be understood as a manifestation of Thanatos, the Death Instinct. Imminent violence and power plays would become other leitmotifs of Pinter's oeuvre. Pinter wrote a second one-act play in 1957, \"The Dumb Waiter,\" an absurdist drama concerning two hit men employed by a secret organization to kill an unknown victim. It was with this play that Pinter added an element of black comedy, mostly through his brilliant use of dialog, which not only elucidated the killers' growing anxiety but underscored the very absurdity of their situation. The play would not be performed until 1960, after the staging of his first two full-length plays, one a flop, and one a hit. His first full-length play, \"The Birthday Party,\" debuted at the Arts Theatre in Cambridge in 1958. In the play the apathetic Stanley, the denizen of a dilapidated boarding house, is visited by two men. The audience never learns their motivation, but knows that Stanley is terrified of them. They organize a birthday party for Stanley, who insists that it is not his birthday. Pinter is following in the footsteps of the great absurdist Samuel Beckett in that he steadfastly refuses to give clear motivations to his characters, or rational explanations for the sake of his audience (Pinter and Beckett became friends). The play, now considered a masterpiece, flopped on its initial London run after being savaged by critics. It was revived after Pinter's second full-length play, 1960's \"The Caretaker,\" established him as a major force in the English-language theater. His early plays were rooted in the absurdism that became the major theatrical paradigm on the European stage in the third quarter of the 20th century, after the horrors of the war and the Holocaust. The early plays that made his reputation such as \"The Homecoming\" (1964) and his middle-period work such as \"No Man's Land\" (1976) have been called \"comedies of menace.\" Typically, they use what at first seems like an innocent situation and develop it into an absurd and threatening environment through actions that usually are inexplicable to the audience and sometimes even to the other characters in the play. A Pinter drama is dark and claustrophobic. His language is full of menacing pauses. The lives of Pinter's characters usually are revealed to be stunted by guilt and horror. The duality and absurdity of Pinter's theatrical world-view gave rise to the adjective \"Pinteresque,\" which took its place next to \"Kafkaesque,\" a product of the horrors of the first quarter of the century (Pinter would write the screenplay for an adaption of Franz Kafka's \"The Trial\".) Beginning in the 1960s, Pinter further enhanced his reputation as a writer with his screenplays, particular his work with Joseph Losey in The Servant (1963) and Accident (1967) (Losey planned an adaptation of Marcel Proust's \"Le Temps Retrouve\" and commissioned Pinter to write the screenplay. The film was never made by Losey, but Pinter's screenplay was subsequently published to great acclaim). His later screenplays, including his last produced work with Losey, The Go-Between (1971), are, ironically, noted for their clarity. He was twice nominated for the Academy Award as a screenwriter, for his adaptation of John Fowles' labyrinthine novel into the film The French Lieutenant's Woman (1981) and for Betrayal (1983), his adaptation of his own play. Such was the respect that Pinter was held that Elia Kazan, one of the great film directors, complained in his autobiography \"A Life\" (1988) that The Last Tycoon (1976) producer Sam Spiegel had such reverence for Pinter that he would not let Kazan change his script. After the great plays of his early and mid-period, Pinter became more overtly political. His later plays, which generally are shorter than the plays from the period in which he made his reputation, typically address political subjects and often are allegories on oppression. In the late 1970s Pinter became more outspoken on political issues and is decidedly of the left. He is passionately committed to human rights and is not shy about bringing examples of oppression from client states sponsored by the Anglo-Saxon democracies to the public's attention. In 2002 Pinter experienced what he described as a \"personal nightmare\" when he had to undergo chemotherapy to treat a case of cancer of the esophagus. The ordeal, which has been ongoing for three years, triggered a personal metamorphosis in the man. \"I've been through the valley of the shadow of death,\" Pinter explained about his quickening. \"While in many respects I have certain characteristics that I had, I'm also a very changed man.\" In early 2005 Pinter declared in a radio interview that he was retiring as a dramatist in favor of writing poetry: \"I think I've stopped writing plays now, but I haven't stopped writing poems. I've written 29 plays. Isn't that enough?\" Pinter has become an outspoken critic of war. He was a bitter critic of the US-led intervention against Slobodan Milosevic's Serbia during President Bill Clinton's administration and an even harsher critic of the US-led war in Iraq. The fiercely anti- war Pinter has accused President George W. Bush of being a \"mass-murderer\" and has called British Prime Minister Tony Blair a \"deluded idiot\" for supporting US foreign policy. Pinter claimed immediately after the 9/11 attacks on New York City and the Pentagon that they were a requited revenge for the destruction wrought on Afghanistan and Iraq by US imperialism and its anti-Taliban policies and sanctions on Iraq. He has publicly denounced the retaliatory U.S. invasion of Afghanistan and the unprovoked 2003 invasion of Iraq. Pinter likens the Bush administration and Bush's America to Adolf Hitler and Nazi Germany, claiming the US is bent on world hegemony. Controversially, he has declared that the only difference between Nazi Germany and the Stalinist Soviet Union is that the US is more hypocritical and has better public relations. One cannot fault Pinter, in the political ring, for being inconsistent or for jumping on a bandwagon. The man, as well as the artist, is a person that sticks to his convictions. The award of the Nobel Prize for Literature to Pinter just after he celebrated his 75th birthday was completely unexpected by pundits handicapping the award. Turkish writer Orhan Pamuk and Syrian poet Adonis were considered the front-runners, as European writers recently had dominated the award (Pinter's Nobel Prize makes it nine out of ten times in the past ten years that a European writer has won, and the second time in the past five years an English writer has banged the gong), and it was felt the Academy would recognize a writer from another continent, particularly one from Asia Minor. Thus, the award can be seen as a not-so-veiled criticism of the United States in general and President George W. Bush in particular by the Swedish Academy. Because of Pinter's renouncing of the form of which he was a master and his anointment of himself as a poet, in light of his volume of poetry, \"War\" (2003) that denounces the Iraq War frequently in vulgar, raw and unrythmic poetry that poses no threat to William Butler Yeats or W.H. Auden or Robert Frost or Stevens, one must consider that the Swedish Academy was giving the world's highest prize for literature at least in part to a poet whose latest work was fiercely anti-American and anti-imperialist. Despite being highly controversial, Pinter -- who was appointed a Commander of the British Empire in 1966 (one step down from a knighthood, an honor he subsequently turned down) -- was named a Companion of Honour in 2002, an honor that does not carry a title. In addition to writing poetry, acting and directing in the theater, Pinter serves as the chairman of the Gaieties Cricket Club, an affiliate of he Club Cricket Conference. He also is active in the Cuba Solidarity Campaign, an organization that supports Fidel Castro, who remains the #1 bugaboo of the United States after Islamic terrorists, just slightly ahead of fellow hemispheric boogeyman Hugo Chávez, a recent arriviste on the world stage. He also is a member of the International Committee to Defend Slobodan Milosevic, an organization that appeals for the freedom of Slobodan Milosevic on the grounds that NATO's war against Milosevic's Yugoslavia was unjustified under international law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwODY3NTA4MV5BMl5BanBnXkFtZTcwMTM0OTAyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0056217","name":"Harold Pinter","idIMDB":"nm0056217"},"actorId":"nm0056217","character":"Man on T.V.","urlCharacter":"http://www.imdb.com/character/ch0308351","main":true}],"seasons":[],"idIMDB":"tt0857265","urlIMDB":"http://www.imdb.com/title/tt0857265","business":{"budget":null,"openingWeekend":[{"money":"$46,265","country":"USA","day":"14","month":"10","year":"2007","remarks":"9 Screens"},{"money":"£165,788","country":"UK","day":"25","month":"11","year":"2007","remarks":"146 Screens"}],"gross":[{"money":"$342,835","country":"USA","day":"20","month":"01","year":"2008","remarks":""},{"money":"$340,769","country":"USA","day":"13","month":"01","year":"2008","remarks":""},{"money":"$338,264","country":"USA","day":"06","month":"01","year":"2008","remarks":""},{"money":"$333,385","country":"USA","day":"30","month":"12","year":"2007","remarks":""},{"money":"$331,807","country":"USA","day":"23","month":"12","year":"2007","remarks":""},{"money":"$310,668","country":"USA","day":"09","month":"12","year":"2007","remarks":""},{"money":"$281,038","country":"USA","day":"02","month":"12","year":"2007","remarks":""},{"money":"$264,936","country":"USA","day":"24","month":"11","year":"2007","remarks":""},{"money":"$256,139","country":"USA","day":"18","month":"11","year":"2007","remarks":""},{"money":"$205,005","country":"USA","day":"04","month":"11","year":"2007","remarks":""},{"money":"$101,837","country":"USA","day":"21","month":"10","year":"2007","remarks":""},{"money":"$46,265","country":"USA","day":"14","month":"10","year":"2007","remarks":""},{"money":"£315,766","country":"UK","day":"02","month":"12","year":"2007","remarks":""},{"money":"£165,788","country":"UK","day":"25","month":"11","year":"2007","remarks":""}],"weekendGross":[{"money":"$233","country":"USA","day":"20","month":"01","year":"2008","remarks":"1 Screen"},{"money":"$626","country":"USA","day":"13","month":"01","year":"2008","remarks":"3 Screens"},{"money":"$4,341","country":"USA","day":"06","month":"01","year":"2008","remarks":"5 Screens"},{"money":"$1,143","country":"USA","day":"30","month":"12","year":"2007","remarks":"5 Screens"},{"money":"$1,052","country":"USA","day":"23","month":"12","year":"2007","remarks":"8 Screens"},{"money":"$22,067","country":"USA","day":"09","month":"12","year":"2007","remarks":"35 Screens"},{"money":"$14,737","country":"USA","day":"02","month":"12","year":"2007","remarks":"21 Screens"},{"money":"$4,136","country":"USA","day":"24","month":"11","year":"2007","remarks":"7 Screens"},{"money":"$19,232","country":"USA","day":"18","month":"11","year":"2007","remarks":"18 Screens"},{"money":"$29,920","country":"USA","day":"04","month":"11","year":"2007","remarks":"27 Screens"},{"money":"$36,657","country":"USA","day":"21","month":"10","year":"2007","remarks":"21 Screens"},{"money":"$46,265","country":"USA","day":"14","month":"10","year":"2007","remarks":"9 Screens"},{"money":"£55,202","country":"UK","day":"02","month":"12","year":"2007","remarks":"133 Screens"},{"money":"£165,788","country":"UK","day":"25","month":"11","year":"2007","remarks":"146 Screens"}],"admissions":[{"money":"2,050","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"copyright 2007 MRC II Distribution Company LP"},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":["Dolby Digital","SDDS","DTS"],"color":["Color","Black and White"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Millennium XL, Panavision Primo Lenses","Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["DeLuxe"],"filmLength":["2,285 m (Portugal, 35 mm)","2,465 m (Finland)"],"negativeFormat":["35 mm (Kodak Vision2 50D 5201, Vision2 250D 5205, Vision2 500T 5218)"],"cinematographicProcess":["Digital Intermediate (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm"]},"rating":"6.5","metascore":"49","filmingLocations":[{"location":"Twickenham Film Studios, St Margarets, Twickenham, Middlesex, England, UK"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best International Film","names":[]}]}]},{"award":"Camerimage 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Frog","categories":[{"category":"Main Competition","names":[{"name":"Haris Zambarloukos","id":"nm0952539","role":null}]}]}]},{"award":"Evening Standard British Film Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Evening Standard British Film Award","categories":[{"category":"Best Screenplay","names":[{"name":"Harold Pinter","id":"nm0056217","role":null}]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2007","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for a Horror/Thriller Film","names":[{"name":"Patrick Doyle","id":"nm0236462","role":null}]}]}]},{"award":"Venice Film Festival 2007","titlesAwards":[{"titleAwardOutcome":"Won Queer Lion - Special Mention","categories":[{"category":"","names":[{"name":"Kenneth Branagh","id":"nm0000110","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Lion","categories":[{"category":"","names":[{"name":"Kenneth Branagh","id":"nm0000110","role":null}]}]}]}],"votes":"26,702","type":"Movie","companyCreditsSimple":[{"idCompany":"co0014453","name":"Sony Pictures Classics"},{"idCompany":"co0040620","name":"Castle Rock Entertainment"},{"idCompany":"co0134409","name":"Riff Raff Film Productions"}],"keywords":{"keywords":["unfaithfulness","actor","game","divorce","surveillance device","writer","trickery","revenge","novelist","mind game","estate","deceit","country estate","cat and mouse","author","husband hires someone to kill his wife","wetting oneself","double entendre","derelict","scotland yard inspector","quid pro quo","wide angle lens","reference to queen elizabeth ii","gay","intimidation","murder","fear","revolver","flashback","disguised man","blood stain","tattoo","reference to madonna","investigation","reference to mike tyson","inspector","reference to dick cheney","new scotland yard","video surveillance","wall safe","destruction","imagination","countryside","gunshot","deviousness","set up","photograph","pistol","knife","painting","hammer","rooftop","ladder","gadget","mistress","scam","luxury","garden shed","manipulation","rival","peacock","wealth","sculpture","video camera","computer","wife's lover murdered by husband","husband murders wife's lover","homosexual","author cameo","stairway","rivalry","leather jacket","bedroom","cigarette smoking","dialogue driven","dialogue driven storyline","shot with a blank","shot to death","reference to henry kissinger","burglary","blank bullet","adulteress","wire sculpture","vodka","three day beard","bowing","standing on bed","snoring","shouting","shoulder holster","scotch whiskey","safe","remote control","overhead camera shot","mystery writer","modern art","modern architecture","interrogation","impersonating a police officer","headset","handshake deal","fireplace","face to face","elevator","disguise","cuckold","colored lights","chain ladder","broken window","aquarium","aluminum ladder","shot","minimal cast","two hander","tryst","theatrical play","sleuth","infidelity","game playing","detective","betrayal","extramarital affair","all male cast","watching tv","proposition","jewelry","insurance fraud","humiliation","fish tank","falling from height","fainting","breaking and entering","adultery","remake","tony award source","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:08:33"}}