{"data":{"movies":[{"title":"Rails & Ties","originalTitle":"","year":"2007","releaseDate":"20080418","directors":[{"name":"Alison Eastwood","id":"nm0002055"}],"writers":[{"name":"Micky Levy","id":"nm0506551"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzEzNjI2Ml5BMl5BanBnXkFtZTcwMTc2MDU1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Train fanatic Tom Stark's job enjoyment stops shielding him from grief over his wife Megan's now terminal cancer when Laura Danner commits suicide by planting her car on the railway just before Tom's train arrives. Tom's colleague Otis, who never got over a hobo doing the same on foot, resigns, Tom is suspended. It's even worse for Laura's fatherless son Davey, who loses his home too. He escapes from a monstrous foster-ma's home and tracks down Tom's home. Megan, who was about to leave without allowing him to get closer again during her last weeks, promises to stay if they take on Davey. Boy and childless couple soon grow on each-other, but a social worker is on Davey's trail.","simplePlot":"A deadly collision between a train and car lead to an unlikely bond between the train engineer and a young boy who escapes the carnage.","actors":[{"actorName":"Kevin Bacon","urlProfile":"http://www.imdb.com/name/nm0000102","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQxMTEyMjI0NV5BMl5BanBnXkFtZTgwODE4ODAzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1958","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Kevin Norwood Bacon","height":"5' 10\" (1.78 m)","bio":"Kevin Norwood Bacon was born on July 8, 1958 in Philadelphia, Pennsylvania, to Ruth Hilda (Holmes), an elementary school teacher, and Edmund Norwood Bacon, a prominent architect who was on the cover of Time Magazine in November 1964. Kevin's early training as an actor came from The Manning Street. His debut as the strict Chip Diller in Animal House (1978) almost seems like an inside joke, but he managed to escape almost unnoticed from that role. Diner (1982) became the turning point after a couple of television series and a number of less-than-memorable movie roles. In a cast of soon-to-be stars, he more than held his end up, and we saw a glimpse of the real lunatic image of The Bacon. He also starred in Footloose (1984), She's Having a Baby (1988), Tremors (1990) with Fred Ward, Flatliners (1990), and Apollo 13 (1995). Bacon is married to actress Kyra Sedgwick, with whom he has 2 children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQxMTEyMjI0NV5BMl5BanBnXkFtZTgwODE4ODAzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000102","name":"Kevin Bacon","idIMDB":"nm0000102"},"actorId":"nm0000102","character":"Tom Stark","urlCharacter":"http://www.imdb.com/character/ch0033731","main":true},{"actorName":"Marcia Gay Harden","urlProfile":"http://www.imdb.com/name/nm0001315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5Njg2ODgyNF5BMl5BanBnXkFtZTcwMzkzMjQ3OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1959","placeOfBirth":" La Jolla, California, USA","height":"5' 4½\" (1.64 m)","bio":"Marcia Gay Harden was born on August 14, 1959, in La Jolla, California, the third of five children. Her mother, Beverly (Bushfield), was a homemaker, and her father, Thad Harold Harden, was in the military. The family relocated often -- she first became interested in the theater when the family was living in Greece, and she had attended plays in Athens. Harden began her college education at American universities in Europe and returned to the US to complete her studies at the University of Texas in 1983; went on to earn an MFA at NYU, and, thereafter, embarked on her acting career. Although she had acted in a movie as early as 1986, in the little-known The Imagemaker (1986), her first mainstream role, coming alongside some TV movie work, was as a sultry femme fatale in the Coen Brothers' cleverly offbeat homage to the gangster movie, Miller's Crossing (1990). Harden received good reviews for her sultry performance as Verna, a seductive, trouble-making moll. Harden thereafter worked steadily in supporting roles, including the portrayal of Ava Gardner in Sinatra (1992), a television biopic about Frank Sinatra. Harden also worked in the theater and, in 1993, was part of the Broadway cast of Tony Kushner's \"Angels in America\", playing Harper, the alienated wife of a closeted gay man. It was a demanding dramatic role, and Harden won acclaim for her work, including a Tony award nomination. She returned to movie making in the mid-1990s, continuing to turn in superb supporting performances in films and television. Harden's road to success was a long one, her work generally being overlooked because the productions were either critically panned or ignored by audiences. However, it was just a matter of time before Harden got a chance to truly show her quality on-screen, and that time came in 2000, with Ed Harris's Pollock (2000), in which she played Lee Krasner, artist and long-suffering wife of Jackson Pollock. Harden's performance was deeply moving and unforgettable and earned her the Oscar and New York Film Critic's Circle awards for best supporting actress. Continuing to work prolifically in features and television, she earned another Oscar nomination in 2003 for her supporting role in Clint Eastwood's Mystic River (2003), Harden having earlier worked with Eastwood in 2000's Space Cowboys (2000). Harden's work often makes otherwise mediocre productions worth watching, fully inhabiting any character she portrays. She married Thaddaeus Scheel, with whom she worked on The Spitfire Grill (1996), in 1996 and the couple have three children, a daughter Eulala Scheel and twins Julitta and Hudson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5Njg2ODgyNF5BMl5BanBnXkFtZTcwMzkzMjQ3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001315","name":"Marcia Gay Harden","idIMDB":"nm0001315"},"actorId":"nm0001315","character":"Megan Stark","urlCharacter":"http://www.imdb.com/character/ch0033732","main":true},{"actorName":"Miles Heizer","urlProfile":"http://www.imdb.com/name/nm1851028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0MDkwODg1MF5BMl5BanBnXkFtZTgwNTY1NzA2MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1994","placeOfBirth":" Greenville, Kentucky, USA","height":"5' 10\" (1.78 m)","bio":"Miles Heizer was born on May 16, 1994 in Greenville, Kentucky, USA. He is an actor, known for Nerve (2016), Parenthood (2010) and Rudderless (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0MDkwODg1MF5BMl5BanBnXkFtZTgwNTY1NzA2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1851028","name":"Miles Heizer","idIMDB":"nm1851028"},"actorId":"nm1851028","character":"Davey Danner","urlCharacter":"http://www.imdb.com/character/ch0033736","main":true},{"actorName":"Marin Hinkle","urlProfile":"http://www.imdb.com/name/nm0385792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTIyNDgyMV5BMl5BanBnXkFtZTcwMDk3MjU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1966","placeOfBirth":" Dar es Salaam, Tanzania","birthName":"Marin Elizabeth Hinkle","height":"5' 5\" (1.65 m)","bio":"Marin's parents met while serving in the Peace Corps. She was born in Tanzania, but her family moved to Boston, Massachusetts, when she was four months old. Two years later, her brother Mark was born. Her father, Rodney, is a retired school teacher. Her mother, Margaret, is a judge of the Massachusetts Superior Court. Marin wanted to be a ballerina and studied dance until age 16, when an ankle injury ended her dancing aspirations. While concerned about her decision to pursue acting, her parents nonetheless urged her to follow her dreams, but they encouraged her to get a Master's degree so she could at least fall back on a teaching career in case things did not work out. She graduated from Brown University and then enrolled at New York University, where she says she was pretty terrible in her acting classes. In 1992, she met her husband Randall, a New York theater director. After her success, they both moved to a Hollywood home that they leased after a a 9-month separation. Marin had her first successes performing in New York theater (\"Electra\" & \"The Tempest\"), then got some minor movie roles and then guest roles on several television shows before her co-starring role on Once and Again (1999). She then got a role as Judith Harper on the popular sitcom Two and a Half Men (2003) and did several guest appearances on Law & Order: Special Victims Unit (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTIyNDgyMV5BMl5BanBnXkFtZTcwMDk3MjU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385792","name":"Marin Hinkle","idIMDB":"nm0385792"},"actorId":"nm0385792","character":"Renee","urlCharacter":"http://www.imdb.com/character/ch0169222","main":true},{"actorName":"Eugene Byrd","urlProfile":"http://www.imdb.com/name/nm0126021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjQyNjU5M15BMl5BanBnXkFtZTcwMjE0MDMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1975","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Eugene Byrd was born on August 28, 1975 in Philadelphia, Pennsylvania, USA. He is an actor and producer, known for 8 Mile (2002), Dead Man (1995) and Sleepers (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjQyNjU5M15BMl5BanBnXkFtZTcwMjE0MDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126021","name":"Eugene Byrd","idIMDB":"nm0126021"},"actorId":"nm0126021","character":"Otis Higgs","urlCharacter":"http://www.imdb.com/character/ch0169223","main":true},{"actorName":"Bonnie Root","urlProfile":"http://www.imdb.com/name/nm0740505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQyMTQwNDk1Nl5BMl5BanBnXkFtZTcwNDM1OTc4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1975","placeOfBirth":" Portland, Oregon, USA","height":"5' 5½\" (1.66 m)","bio":"Bonnie Root was born on August 24, 1975 in Portland, Oregon, USA. She is an actress and producer, known for Coming Soon (1999), Rails & Ties (2007) and Home Invasion (1997). She has been married to Johnny K. since July 2, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQyMTQwNDk1Nl5BMl5BanBnXkFtZTcwNDM1OTc4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0740505","name":"Bonnie Root","idIMDB":"nm0740505"},"actorId":"nm0740505","character":"Laura Danner","urlCharacter":"http://www.imdb.com/character/ch0169224","main":true},{"actorName":"Steve Eastin","urlProfile":"http://www.imdb.com/name/nm0247611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTE2MzI1N15BMl5BanBnXkFtZTYwNjE5NTQy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1948","placeOfBirth":" Colorado, USA","birthName":"Ronald Steve Eastin","bio":"Steve Eastin was born on June 22, 1948 in Colorado, USA as Ronald Steve Eastin. He is known for his work on Catch Me If You Can (2002), Up in the Air (2009) and Con Air (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTE2MzI1N15BMl5BanBnXkFtZTYwNjE5NTQy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247611","name":"Steve Eastin","idIMDB":"nm0247611"},"actorId":"nm0247611","character":"N.B. Garcia","urlCharacter":"http://www.imdb.com/character/ch0169225","main":true},{"actorName":"Laura Cerón","urlProfile":"http://www.imdb.com/name/nm0149018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODkyMzY2NF5BMl5BanBnXkFtZTcwMjU0MjQ0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1964","placeOfBirth":" Mexico City, Distrito Federal, Mexico","bio":"Laura Ceron born in Mexico City was raised in Chicago Suburb Elgin. Was a member of The Latino Chicago Theater Company, where they created many original productions and innovative stylized theatrical form such as \"Cartooning\", which merged 'Commedia dell'arte' along with 'Carpero' style Theater. Always giving room to Traditional Theater, some productions including Puffin, Each Day Dies With Sleep, Dona Sol and Her Trained Dog, Federico García Lorca's Once Five Years Pass and Juan Rulfo's Pedro Paramo. After 13 yrs on the Chicago stage and recurring as Anita Marrón on the short-lived ABC drama series \"Missing Persons\", Laura then moved to Los Angeles, where she joined the supporting cast of the NBC drama series \"ER\". As Nurse Marquez in the penultimate episode of the 1st season, Directed by Quentin Tarantino, she went on to complete the 15 season drama series. Ms. Ceron continues to work on TV and Film and lives in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODkyMzY2NF5BMl5BanBnXkFtZTcwMjU0MjQ0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0149018","name":"Laura Cerón","idIMDB":"nm0149018"},"actorId":"nm0149018","character":"Susan Garcia","urlCharacter":"http://www.imdb.com/character/ch0169226","main":true},{"actorName":"Margo Martindale","urlProfile":"http://www.imdb.com/name/nm0553269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDg3OTE2NF5BMl5BanBnXkFtZTgwMTI5MDg0MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1951","placeOfBirth":" Jacksonville, Texas, USA","height":"5' 5½\" (1.66 m)","bio":"Margo Martindale was born July 18, 1951 in Jacksonville, Texas, to Margaret (Pruitt) and William Everett Martindale, a lumber company owner and dog handler. She is the youngest of three children, and the only daughter. Margo attended Lon Marris College, and later transferred to University of Michigan at Ann Arbor, and did a summer study at Harvard University. She made her film debut appearance in Days of Thunder (1990), she played the minor role of Donna. Notable roles include: Sister Colleen, Susan Sarandon's fellow nun in Dead Man Walking (1995). She played a brief but memorable role as the selfish mother to Hilary Swank's character in Million Dollar Baby (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDg3OTE2NF5BMl5BanBnXkFtZTgwMTI5MDg0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0553269","name":"Margo Martindale","idIMDB":"nm0553269"},"actorId":"nm0553269","character":"Judy Neasy","urlCharacter":"http://www.imdb.com/character/ch0169227","main":true},{"actorName":"Kathryn Joosten","urlProfile":"http://www.imdb.com/name/nm0429760","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzNDkxMTU0N15BMl5BanBnXkFtZTcwODYwNTU5MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1939","placeOfBirth":" Chicago, Illinois, USA","birthName":"Kathryn Rausch","height":"5' 3\" (1.6 m)","bio":"Kathryn is best known for her portrayals of \"Karen McCluskey\" on Desperate Housewives (2004) on ABC and of \"Mrs. Landingham\", secretary to the President (Martin Sheen), on the critically-acclaimed NBC drama, The West Wing (1999). She has also recurred on Dharma & Greg (1997), and guest-starred on many hit television series, such as Becker (1998), Arli$$ (1996), Ally McBeal (1997), Providence (1999), Scrubs (2001) and over twenty other prime-time shows. Kathryn will also be seen later this year on ABC's daytime drama, General Hospital (1963). Her credits are impressive for any actor, let alone one that only began the craft at age 42. Although only put into action well into her middle years, Kathryn's dream began in her twenties, when her mother died of cancer in 1963. While dying in the hospital, her mother shared that her biggest regret was not following her dreams. Kathryn vowed, at that moment, that she would someday pursue her own dream of acting. At the time, she was entering into a new career as a psychiatric nurse in a medium security wing for disturbed teenagers. Through that job, she met and married a psychiatrist, gave birth to two boys and settled down as a suburban housewife in Lake Forest, Illinois, a well-to-do suburb of Chicago. But Kathryn never forgot her dream of acting, something that she never had time to pursue in-between caring for her children and husband. In 1980, her husband's alcoholism led Kathryn to a divorce and a difficult situation; a single mother with two young sons. Rather than lose hope, she took the opportunity to change her life forever and follow her lost dream. Kathryn took classes at Steppenwolf Theater in Chicago and performed at community theaters all over Northern Illinois. By day, she supported her family hanging wallpaper and painting the mansions of Lake Forest, working as a sales person for a Welcome Wagon company and using her contacts to book film and print locations in the houses she was painting. By night, Kathryn was improving her skills and moving from community theater to semi-professional theater. Her first break was in 1991. Disney held a cattle call for street performers for Disney World. After standing in line for five hours, Kathryn got the part and moved shop to Orlando, Florida. Though she was living behind an adult arcade in the \"tourist unfriendly\" part of Buena Vista, Kathryn was finally earning her living through performance and loving it. The part only lasted for a year and, once again, Kathryn was forced to supplement her acting income with other work -- bar-tending and catering during the day, theater at night. Though the acting gig was over, the move to Florida proved one thing to Kathryn...she had the talent to make it as an actor. She did it once and she could do it again. Unfortunately, it took her two and half years to realize it wouldn't happen in central Florida. In December 1995, Kathryn again packed a truck and drove to Hollywood. Although she didn't have an agent and had no contacts, Kathryn never hesitated following her dream. In only five months, she landed her first part...two lines in Family Matters (1989). In the six years since then, she has appeared in over a dozen plays, six movies, eleven national television commercials, two pilots, ten drama series and over twenty sitcoms. From her many roles, Kathryn is recognized as one of Murphy Brown (1988)'s secretaries, Frasier (1993)'s agent's mother and the bingo buddy to Drew Carey's girlfriend, on The Drew Carey Show (1995). But it is her portrayal of \"Mrs. Landingham\", the foil, friend and secretary to Martin Sheen's \"President Bartlet\" on The West Wing (1999) that propelled her into the spotlight she truly deserves. She followed that up with her last huge roll as Karen McCluskey for 8 seasons on ABC's Desperate Housewives (2004), which won her two Emmy awards. Joosten made a guest appearance on CBS daytime soap The Bold and the Beautiful as part of the show's 6000th episode, which featured several other real-life lung cancer survivors discussing their experiences. She was named the national spokesperson for the Lung Cancer Profiles campaign on behalf of Pfizer. Joosten died of lung cancer on the morning of June 2, 2012. Her death happened 20 days after the onscreen death of her character Karen McCluskey on the final episode of Desperate Housewives. The hit show ended its eight-year run on ABC last month with a series finale in which Joosten's character passed away. Her character's battle with brain cancer was a story line in the show.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzNDkxMTU0N15BMl5BanBnXkFtZTcwODYwNTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0429760","name":"Kathryn Joosten","nicknames":["Kathy"],"idIMDB":"nm0429760"},"actorId":"nm0429760","character":"Mrs. Brown","urlCharacter":"http://www.imdb.com/character/ch0169228","main":true},{"actorName":"Steven M. Porter","urlProfile":"http://www.imdb.com/name/nm0692298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwMDY2NDYzNl5BMl5BanBnXkFtZTgwMDE5MTQ5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Steven M. Porter is an actor, known for Best in Show (2000), Hart of Dixie (2011) and Million Dollar Baby (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwMDY2NDYzNl5BMl5BanBnXkFtZTgwMDE5MTQ5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0692298","name":"Steven M. Porter","idIMDB":"nm0692298"},"actorId":"nm0692298","character":"Howie Pugh","urlCharacter":"http://www.imdb.com/character/ch0169229","main":true},{"actorName":"Jim Cody Williams","urlProfile":"http://www.imdb.com/name/nm0930908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDA2MzcxNF5BMl5BanBnXkFtZTcwNDUxMTYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Jim Cody Williams is known for his work on Pirates of the Caribbean: Dead Man's Chest (2006), Dodgeball: A True Underdog Story (2004) and Bill & Ted's Excellent Adventure (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDA2MzcxNF5BMl5BanBnXkFtZTcwNDUxMTYzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930908","name":"Jim Cody Williams","idIMDB":"nm0930908"},"actorId":"nm0930908","character":"Vince the Engineer","urlCharacter":"http://www.imdb.com/character/ch0169230","main":true},{"actorName":"Kerri Randles","urlProfile":"http://www.imdb.com/name/nm0709839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzU5MzEzNl5BMl5BanBnXkFtZTcwNjc0MTIzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1971","placeOfBirth":" Decatur, Illinois, USA","bio":"For several years, Kerri Randles has been acting, writing and developing projects for Film, Stage and Television. Kerri started her career as an actress in Chicago, Illinois. Her first break into films came working with directors Oliver Stone (Heaven and Earth) and William Friedkin (Jailbreakers), respectively. Subsequent roles after that included Marilyn Monroe, in Introducing Dorothy Dandridge for HBO, directed by Martha Coolidge, Poor White Trash, and Scenes of the Crime. She most recently worked with Angelina Jolie on Clint Eastwood's, Changeling. In June 2010, Kerri brought her one-woman show Can't You Hear Me Knockin? to the stage, opening the first ever Hollywood Fringe Festival to rave reviews. The show went on to New York for a successful limited engagement, and will play the Edinburgh Fringe Festival, August 2011. A memoir, Can't You Hear Me Knockin?, will follow in 2012. In 2005 Kerri founded her own production company, Littlecommando Productions. In 2007 she helped to bring Alison Eastwood's directorial debut film, Rails & Ties to the big screen, shepherding a successful tour of the festival circuit. Kerri was also instrumentally involved in the Exit Through the Gift Shop debut at Sundance and the subsequent L.A. premiere and 2011 Oscar campaign for the film. Kerri currently resides in Los Angeles. She is an avid art collector and is known to produce shows for artists. She collaborated on Banksy's Los Angeles show, Barely Legal, in 2006, and also produced The Sex Lives of Mannequins in Chicago and Los Angeles for producer Charles Evans Jr. (Aviator).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzU5MzEzNl5BMl5BanBnXkFtZTcwNjc0MTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0709839","name":"Kerri Randles","idIMDB":"nm0709839"},"actorId":"nm0709839","character":"Rosanna","urlCharacter":"http://www.imdb.com/character/ch0169231","main":true},{"actorName":"Stephen Peace","urlProfile":"http://www.imdb.com/name/nm0686232","urlPhoto":"","biography":{"bio":"Stephen Peace is an actor and writer, known for Rails & Ties (2007), The Corpse Had a Familiar Face (1994) and The Procrastinators (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0686232","name":"Stephen Peace","idIMDB":"nm0686232"},"actorId":"nm0686232","character":"Bartender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Harvey","urlProfile":"http://www.imdb.com/name/nm0367445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzkxMjMzOV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1948","placeOfBirth":" Chicago, Illinois, USA","bio":"Robert Harvey was born on April 8, 1948 in Chicago, Illinois, USA. He is an actor, known for Looper (2012), The Box (2009) and Reign Over Me (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzkxMjMzOV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367445","name":"Robert Harvey","idIMDB":"nm0367445"},"actorId":"nm0367445","character":"Administrator #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0822849","urlIMDB":"http://www.imdb.com/title/tt0822849","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$18,718","country":"USA","day":"04","month":"11","year":"2007","remarks":""}],"weekendGross":[{"money":"$2,416","country":"USA","day":"04","month":"11","year":"2007","remarks":"5 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 41 min (101 min)","1 hr 49 min (109 min) (Argentina)"],"soundMix":["Dolby Digital","SDDS","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.8","metascore":"44","filmingLocations":[{"location":"Fillmore, California, USA"}],"rated":"PG-13","awards":[{"award":"Young Artist Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Leading Young Actor","names":[{"name":"Miles Heizer","id":"nm1851028","role":null}]}]}]}],"votes":"3,557","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010258","name":"Malpaso Productions"}],"keywords":{"keywords":["father figure","train","cancer","train engineer","suicide","f rated","medical examination","scolding","hugging","abuse","dancing","bathing","punctuation in title","ampersand in title","train conductor","railway accident","orphan","mother son relationship","husband wife relationship","dying","car accident","marriage","loss of mother"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:57:08"}}