{"data":{"movies":[{"title":"Jimi Hendrix: Feedback","originalTitle":"","year":"2005","releaseDate":"20051001","directors":[{"name":"Sonia Anderson","id":"nm2078601"}],"writers":[],"runtime":"60 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NDUyOTExMl5BMl5BanBnXkFtZTgwMjkxMTA2MDE@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Documentary","Drama"],"plot":"This new and revealing programme provides an incredibly detailed account of how Jimi Hendrix, a legendary guitarist touched by genius, lived his life in the high powered world of 60's Rock 'n' Roll.","simplePlot":"This new and revealing programme provides an incredibly detailed account of how Jimi Hendrix, a legendary guitarist touched by genius, lived his life in the high powered world of 60's Rock 'n' Roll.","actors":[{"actorName":"Keith Altham","urlProfile":"http://www.imdb.com/name/nm1460705","urlPhoto":"","biography":{"bio":"Keith Altham is known for his work on Classic Albums: The Beach Boys - Pet Sounds (2016), The Roaring 20s: Mick Jagger's Glory Years (2011) and Peter Green: 'Man of the World' (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1460705","name":"Keith Altham","idIMDB":"nm1460705"},"actorId":"nm1460705","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed Chalpin","urlProfile":"http://www.imdb.com/name/nm0150071","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Ed Chalpin yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0150071","name":"Ed Chalpin","idIMDB":"nm0150071"},"actorId":"nm0150071","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Davies","urlProfile":"http://www.imdb.com/name/nm0203600","urlPhoto":"","biography":{"bio":"Ben Davies is a producer and writer, known for Truth Is... (2013), Truckies Don't Eat Quiche (2004) and Here Come the Habibs! (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0203600","name":"Ben Davies","idIMDB":"nm0203600"},"actorId":"nm0203600","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimi Hendrix","urlProfile":"http://www.imdb.com/name/nm0001342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDA1MjM2Nl5BMl5BanBnXkFtZTcwNTExNjkxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1942","placeOfBirth":" Seattle, Washington, USA","birthName":"Johnny Allen Hendrix","height":"5' 11\" (1.8 m)","bio":"Jimi Hendrix was born on November 27, 1942 in Seattle, Washington, to African-American parents Lucille (Jeter) and James Allen Hendrix. His mother named him John Allen Hendrix and raised him alone while his father, Al Hendrix, was off fighting in World War II. When his mother became sick from alcoholism, Hendrix was sent to live with relatives in Berkeley, California. When his father returned from Europe in 1945 he took back Hendrix, divorced his wife, and renamed him James Marshall Hendrix. When Jimi was 13 his father taught him to play an acoustic guitar. In 1959 Jimi dropped out of high school and enlisted in the U.S. Army, but soon became disenchanted with military service. After he broke his ankle during a training parachute jump, he was honorably discharged. He then went to work as a sideman on the rhythm-and-blues circuit, honing his craft but making little or no money. Jimi got restless being a sideman and moved to New York City hoping to get a break in the music business. Through his friend Curtis Knight, Jimi discovered the music scene in Greenwich Village, which left indelible impressions on him. It was here that he began taking drugs, among them marijuana, pep pills and cocaine. In 1966, while Jimi was performing with his own band called James & the Blue Flames at Cafe Wha?, John Hammond Jr. approached Jimi about the Flames playing backup for him at Cafe Au Go Go. Jimi agreed and during the show's finale, Hammond let Jimi cut loose on Bo Diddley's \"I'm the Man.\" Linda Keith, girlfriend of The Rolling Stones guitarist Keith Richards, was one of Jimi's biggest fans and it was she who told friend Chas Chandler, a band manager, about Jimi. When Chandler heard Jimi play, he asked him to come to London to form his own band, and while there Chandler made the simple change in Jimi's name by formally dropping James and replacing it with Jimi. Having settled in England with a new band called the Jimi Hendrix Experience, which consisted of Jimi as guitarist and lead singer, bass player Noel Redding and drummer Mitch Mitchell, Jimi took the country by storm with the release of his first single \"Hey, Joe.\" In the summer of 1967 Jimi performed back in the USA at the Monterey Pop Festival, a mix-up backstage forced Jimi to follow The Who onstage, where after a superb performance Jimi tore up the house by trashing his guitar in a wild frenzy. Afterwards, Jimi's career skyrocketed with the release of the Experience's first two albums, \"Are You Experienced?\" and \"Axis: Bold as Love,\" which catapulted him to the top of the charts. However, tensions, possibly connected with Jimi's drug use and the constant presence of hangers-on in the studio and elsewhere, began to fracture some of his relationships, including Chas Chandler, who quit as manager in February 1968. In September 1968 the Experience released their most successful album, \"Electric Ladyland.\" However, in early 1969 bassist Redding left the Experience and was replaced by Billy Cox, an old army buddy who Jimi had jammed with. Jimi began experimenting with different musicians. For the Woodstock music festival Jimi put together an outfit called the Gypsies, Sun and Rainbows, with Mitchell and Cox as well as a second guitarist and two percussionists. Their one and only performance in August 1969 at Woodstock took place near Bethel, New York, where Hendrix and his band were to be the closing headline act. Because of the delay getting there and the logistical problems, Jimi performed on the morning of the fourth and final day. Only 25,000 people of the original 400,000 stayed to watch Jimi and his band as the closing music number, where Jimi's searing rendering of \"The Star-Spangled Banner\" became the anthem for counterculture. After Woodstock, Jimi formed a new band with Cox on bass and Buddy Miles on drums with the May 1970 release of the album \"The Band of Gypsys.\" Jimi's last album, \"Cry of Love\", featured Cox on bass and former Experience drummer Mitchell on drums. However, Jimi's drug problem finally caught up with him. On the night of September 17, 1970, while living in London, Jimi took some sleeping pills, which were prescribed for his live-in girlfriend Monika Danneman. Sometime after midnight, Jimi threw up from an apparent allergic reaction to the pills and then passed out. Danneman, thinking him to be all right, went out to get cigarettes for them. When she returned, she found him lying where he collapsed, having inhaled his own vomit, and and she couldn't wake him. Danneman called an ambulance, which took him to a nearby hospital, but Jimi Hendrix was pronounced dead a short while later without regaining consciousness. He was 27 years old. Jimi Hendrix's life was short, but his impact on the rock guitar is still being heard which set the course for a new era of rock music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDA1MjM2Nl5BMl5BanBnXkFtZTcwNTExNjkxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001342","name":"Jimi Hendrix","nicknames":["Noize"],"idIMDB":"nm0001342"},"actorId":"nm0001342","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melinda Merryweather","urlProfile":"http://www.imdb.com/name/nm0581478","urlPhoto":"","biography":{"bio":"Melinda Merryweather is a set decorator, known for Clipping Adam (2004), Rainbow Bridge (1972) and Jimi Hendrix: Feedback (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0581478","name":"Melinda Merryweather","idIMDB":"nm0581478"},"actorId":"nm0581478","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerry Stickells","urlProfile":"http://www.imdb.com/name/nm0830000","urlPhoto":"","biography":{"bio":"Gerry Stickells is known for his work on Killer Queen! (2002), We Will Rock You: Queen Live in Concert (1982) and Queen: Magic Years, Volume Three - A Visual Anthology (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0830000","name":"Gerry Stickells","idIMDB":"nm0830000"},"actorId":"nm0830000","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geno Washington","urlProfile":"http://www.imdb.com/name/nm0913446","urlPhoto":"","biography":{"bio":"Geno Washington is an actor, known for The Record Star Show (1967), Hendrix on Hendrix (2013) and Jimi Hendrix: Feedback (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0913446","name":"Geno Washington","idIMDB":"nm0913446"},"actorId":"nm0913446","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chuck Wein","urlProfile":"http://www.imdb.com/name/nm0918077","urlPhoto":"","biography":{"dateOfBirth":"24 March 1939","placeOfBirth":" USA","height":"6' 1\" (1.85 m)","bio":"Wein attended Taylor Allderdice High School in Pittsburgh, PA, graduating in 1957. At Harvard in the early 1960s, he met a young Radcliffe heiress named Edie Sedgwick, reportedly in their psychiatrist's office. When Chuck decided to move to New York, Edie went with him. With fair skin, natural blond hair, and blue eyes, Chuck was convinced that he and Edie could become society darlings. Recognizing that Edie had great social potential but was too disorganized to promote herself, he took over her life. Acting as her promoter, he introduced Edie to Andy Warhol in January 1965, and began taking her regularly to Warhol's Factory. According to friends, Chuck plotted their every move - whom he was going to introduce to Edie that night, what they could do for her. Chuck called himself and Edie \"mock elitists in fellowship... I was her roommate, shrink, astrologer, and Tarot instructor.\" He was a product of the Timothy Leary acid-experiment days. He was largely responsible for several Factory films, including 'Poor Little Rich Girl' and 'Beauty #2,' as well as conceiving 'My Hustler' and 'Ciao Manhattan.' After becoming disillusioned with Factory life, he spent the rest of the 60s adventuring in the Far East, managing bizarre nightclub acts, and focusing on the occult.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0918077","name":"Chuck Wein","idIMDB":"nm0918077"},"actorId":"nm0918077","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0808329","urlIMDB":"http://www.imdb.com/title/tt0808329","business":{"budget":{"money":"£150,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr (60 min) (DVD) (UK)"],"soundMix":["Dolby Digital (RCA Sound System)"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.1","filmingLocations":[{"location":"London, England, UK"}],"awards":[],"votes":"27","type":"Video","companyCreditsSimple":[{"idCompany":"co0172667","name":"WHE International"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:47:54"}}