{"data":{"movies":[{"title":"LA Blues","originalTitle":"","year":"2007","releaseDate":"2007","directors":[{"name":"Ian Gurvitz","id":"nm0348795"}],"writers":[{"name":"Ian Gurvitz","id":"nm0348795"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTUxNjMyNF5BMl5BanBnXkFtZTcwODEzNTA3MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Opening in a Hollywood parking lot on New Years Eve as a crowd gathers around an ambulance as a guy is being loaded in on a gurney, the story is told in flashback by one of the characters to a female detective who comes on the scene of what may have been an attempted suicide and he unravels the story of a year in the lives of 6 guys who hang out in a blues bar in Hollywood, watch sports, trash talk, and bitch about their lives, as they go through problems ranging from construction nightmares to divorce, gambling addiction, alcoholism, child custody fights, and all the headaches and heartaches men go through in the course of their lives. As the story unfolds, the audience is left wondering which one of these guys ended up in the ambulance, and why. The blues soundtrack is true to the nature of the music itself, and to the movie, as it's about heartache and longing, loving and losing, striving and failing, and all the hell in between. And just like the blues, the movie is about joy and ...","simplePlot":"Opening in a Hollywood parking lot on New Years Eve as a crowd gathers around an ambulance as a guy is being loaded in on a gurney, the story is told in flashback by one of the characters ... ","actors":[{"actorName":"Kevin Rahm","urlProfile":"http://www.imdb.com/name/nm0706716","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4Njk2NDIwNV5BMl5BanBnXkFtZTgwMDAxMzAwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1971","placeOfBirth":" Mineral Wells, Texas, USA","birthName":"Kevin Patrick Rahm","height":"5' 9¼\" (1.76 m)","bio":"Born in Mineral Wells, Texas and raised in Bossier City, Louisiana, Rahm enrolled in the Brigham Young University theater program.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4Njk2NDIwNV5BMl5BanBnXkFtZTgwMDAxMzAwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0706716","name":"Kevin Rahm","idIMDB":"nm0706716"},"actorId":"nm0706716","character":"Bobby Gordon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Ragsdale","urlProfile":"http://www.imdb.com/name/nm0706619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjE3MTAzMV5BMl5BanBnXkFtZTcwNTM2MzI3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1961","placeOfBirth":" El Dorado, Arkansas, USA","birthName":"Robert William Ragsdale","bio":"Dark, wavy-haired, boyishly earnest, Williams Ragsdale graduated from Hendrix College in Conway, Arkansas studying religion and humanities before deciding to buckle down and become an actor. The acting bug began to tempt the handsome young actor while appearing in a few college plays and musicals on the sly. His parents actually gave him a graduation present in the form of tuition for the Drama Studio London's American school at Berkeley, California. His first taste of success came on stage playing Eugene, Neil Simon's autobiographical protagonist, in both \"Biloxi Blues\" and \"Broadway Bound.\" Reminding one easily of a young Jack Lemmon, Ragsdale's appeal came in a cute, accessible package and he clinched this likable image after being cast in the hugely successful teen horror flick Fright Night (1985) as a typical high school student convinced that vampires are living next door. Other less notable entries, including the sequel Fright Night Part 2 (1988) and Mannequin: On the Move (1991), came his way as a result. Since then, TV has been his medium of choice, with the cult series favorite \"Herman's Head\" adding to his momentum, not to mention brief runs in such series as _American Pie_, Brother's Keeper (1998) and \"Grosse Point\" (2000). He recently married.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjE3MTAzMV5BMl5BanBnXkFtZTcwNTM2MzI3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0706619","name":"William Ragsdale","idIMDB":"nm0706619"},"actorId":"nm0706619","character":"Paul Cooper","urlCharacter":"http://www.imdb.com/character/ch0510738","main":true},{"actorName":"Dave Foley","urlProfile":"http://www.imdb.com/name/nm0004929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE5MjgyODYxNV5BMl5BanBnXkFtZTcwMzQxNTU3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1963","placeOfBirth":" Toronto, Ontario, Canada","birthName":"David Scott Foley","height":"5' 8\" (1.73 m)","bio":"Dave Foley dropped out of an alternative high school to do stand-up comedy. He met Kevin McDonald at an improv class and, while employed as movie ushers, they began working as a comedy team. In 1984 they merged with another team to form \"The Kids in the Hall\". Foley made his film debut at 22 as the lead in the Canadian film High Stakes (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE5MjgyODYxNV5BMl5BanBnXkFtZTcwMzQxNTU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004929","name":"Dave Foley","nicknames":["Dave"],"idIMDB":"nm0004929"},"actorId":"nm0004929","character":"Neil Schwartz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Maguire","urlProfile":"http://www.imdb.com/name/nm0536630","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUzMzI3MzM2OF5BMl5BanBnXkFtZTgwNzAxMTkwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1976","placeOfBirth":" Ilford, Essex, England, UK","birthName":"Sean Martin Michael Maguire","height":"5' 10\" (1.78 m)","bio":"Sean was born on 18 April 1976 in Ilford, Essex, England. He made his acting debut at the age of five in Voyage Around My Father with Sir Laurence Olivier. Many TV roles for UK television followed including, Tegs in Grange Hill, Aiden Brosnan in Eastenders, Marty in Dangerfield and Lee in Sunburn (all BBC). Sean played the role of Euan in The WB sitcom, Off Centre, and most recently he has been playing the role of Robin Hood in ABC's hit series Once Upon A Time (2013) replacing Tom Ellis in the role. He currently lives in LA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUzMzI3MzM2OF5BMl5BanBnXkFtZTgwNzAxMTkwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0536630","name":"Sean Maguire","idIMDB":"nm0536630"},"actorId":"nm0536630","character":"Jack Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Michael Hall","urlProfile":"http://www.imdb.com/name/nm0001309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjM2MjAyM15BMl5BanBnXkFtZTcwMjQ2NjQwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1968","placeOfBirth":" West Roxbury, Massachusetts, USA","birthName":"Michael Anthony Thomas Charles Hall","height":"6' 2\" (1.88 m)","bio":"Anthony Michael Hall was born in West Roxbury, Massachusetts. His parents are Mercedes Hall, an actress-blues and jazz singer, and Larry Hall, who owned an auto body shop. His stepfather is a show-business manager. His sister, Mary Christian, is also a performer. He has Irish and Italian ancestry. Hall's given name was Michael Anthony Thomas Charles Hall, but he adopted the Anthony Michael moniker upon finding that another Michael Hall was already a member of the Screen Actors' Guild. Hall began acting in commercials at the age of seven, and his breakthrough role was as Rusty Griswold in National Lampoon's Vacation (1983) alongside Chevy Chase and Beverly D'Angelo. Following the success of National Lampoon's Vacation (1983), Hall entered the defining period of his career, starring in three John Hughes classics: Sixteen Candles (1984), The Breakfast Club (1985) and Weird Science (1985). Wanting to avoid being typecast, Hall turned down roles in two subsequent 1986 Hughes films, Pretty in Pink (1986) and Ferris Bueller's Day Off (1986). His early television credits include the Emmy Award-winning \"The Gold Bug\", in which he played the young Edgar Allan Poe, as well as the TV movie Rascals and Robbers: The Secret Adventures of Tom Sawyer and Huck Finn (1982), and specials \"The Body Human\" and \"Orphans, Waifs and Wards\". On stage, he appeared in the Lincoln Center Festival's production of \"St. Joan of the Microphone\". Following a one-year stint on Saturday Night Live (1975), excessive drinking and partying threatened to sidetrack Hall's career. However, he was able to regain control and has been sober since 1990, the year he played the role of Jim in Edward Scissorhands (1990). After a series of minor roles in the 1990s, he starred as Microsoft chairman Bill Gates in the television movie Pirates of Silicon Valley (1999). Since that time, Hall has focused on television work, including an 81-episode run on Stephen King's The Dead Zone (2002), but has managed to take on film projects as well, including the role of Mike Engel in The Dark Knight (2008). In addition to acting, Hall has also pursued his musical talents, as songwriter and lead singer of his band, Hall of Mirrors, which was formed in 1998. Hall helps at-risk youth via the Anthony Michael Hall Literacy Club and lives in Los Angeles, Caifornia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjM2MjAyM15BMl5BanBnXkFtZTcwMjQ2NjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001309","name":"Anthony Michael Hall","idIMDB":"nm0001309"},"actorId":"nm0001309","character":"Larry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas D'Agosto","urlProfile":"http://www.imdb.com/name/nm0194900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NTEwMjI2ODZeQTJeQWpwZ15BbWU3MDY3NDAxMTc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1980","placeOfBirth":" Omaha, Nebraska, USA","height":"6' 2\" (1.88 m)","bio":"Nicholas D'Agosto was born and raised in Omaha, Nebraska. He is the son of Alan and Deanna D'Agosto, and the middle of five children (two older brothers, two younger sisters). He began acting when he was eleven years old, and was a senior at Creighton Preparatory School when he was cast in Election (1999), which filmed in Omaha in 1997. He later moved to Milwaukee, Wisconsin to attend college at Marquette University, graduating cum laude with degrees in History and Theatre. He is an active member at Antaeus Company in Los Angeles, and supports the charity \"The Life You Can Save\". He lives in Los Angeles, CA with his wife and young son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NTEwMjI2ODZeQTJeQWpwZ15BbWU3MDY3NDAxMTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0194900","name":"Nicholas D'Agosto","nicknames":["Nick"],"idIMDB":"nm0194900"},"actorId":"nm0194900","character":"Adam Cooper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marsha Thomason","urlProfile":"http://www.imdb.com/name/nm0859720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMTYxNjQwM15BMl5BanBnXkFtZTcwODEzOTQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1976","placeOfBirth":" Manchester, England, UK","birthName":"Marsha Lisa Thomason","height":"5' 8\" (1.73 m)","bio":"Marsha Thomason was born and raised in Manchester, England. Her love for acting began after watching the musical \"Bugsy Malone\". Soon after, aged 12, she joined Oldham Theatre Workshop, where she performed many diverse stage plays, including \"Our Day Out\" by Willy Russell and \"Peace\" by Aristophanes. What began as a hobby soon helped her achieve her first professional acting job at the age of 14, when she starred in 8:15 from Manchester (1990) (BBC 1). Marsha took \"A\" levels in English Language, Media Studies and Theatre Studies before studying for her BA in English at Manchester Metropolitan University. While at university, Marsha won the role of Janice Lafferty in Prime Suspect 5: Errors of Judgement (1996) alongside Helen Mirren, and later the same year she appeared in Brazen Hussies (1996) with Julie Walters and Robert Lindsay. Many parts followed, including Sally in the BBC's popular series Pie in the Sky (1994). Aged 20, Marsha moved to London's Notting Hill to take the role of Shazza Pearce in Playing the Field (1998), in which she played a beer-swilling, drug-taking soccer player. This was a role close to her heart as a life-long Manchester City supporter. After the first season of the show Marsha also starred as Nurse Jacqui Richards in Where the Heart Is (1997). She appeared in both programs simultaneously for three years. At this point she was spotted by Red Productions and appeared in Love in the 21st Century (1999), a series of six adult morality tales. Marsha fulfilled a lifelong dream of starring in London's West End when she made her professional stage debut in \"Breath Boom\" at the Royal Court Theatre. The play was also the debut of Marsha's American accent, as her character was a 15-year-old prostitute from New York whose dream of acceptance was to belong to a girl gang. Marsha's first foray into feature film was the Working Title production Long Time Dead (2002), a British horror film also starring Lukas Haas and Alec Newman. Her career then took her to America where she has continued to work in films, with roles as diverse as Victoria in Black Knight (2001) starring Martin Lawrence, and Brandy in Miramax's My Baby's Daddy (2004). She returned to England for the independent feature Pure (2002), directed by Gillies MacKinnon. Considered her most ambitious role to date, Marsha played Vicki, a Cockney heroin-addicted prostitute. While still in England, Marsha returned to Red Productions for the first series of the critically acclaimed Burn It (2003). In 2002 Marsha was awarded Best Actress in Film at the BFM awards. She recently appeared in the Disney feature The Haunted Mansion (2003) in which she starred opposite Eddie Murphy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMTYxNjQwM15BMl5BanBnXkFtZTcwODEzOTQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859720","name":"Marsha Thomason","idIMDB":"nm0859720"},"actorId":"nm0859720","character":"Carla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liza Lapira","urlProfile":"http://www.imdb.com/name/nm0487594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDM0MDc0Ml5BMl5BanBnXkFtZTcwMjIyMDQzMw@@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Liza Lapira was born in Queens, New York City, New York, USA. She is an actress, known for 21 (2008), Crazy, Stupid, Love. (2011) and Fast & Furious (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDM0MDc0Ml5BMl5BanBnXkFtZTcwMjIyMDQzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0487594","name":"Liza Lapira","nicknames":["Minnie"],"idIMDB":"nm0487594"},"actorId":"nm0487594","character":"Sandra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rebecca McFarland","urlProfile":"http://www.imdb.com/name/nm0568777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzQ2MDkzOV5BMl5BanBnXkFtZTgwMzIyNDcxMTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"American actor Rebecca McFarland is a native of New Orleans, Louisiana. She began acting in middle school, playing the Ice Queen in a school production, and has been a performer ever since. She attended the New Orleans Center for Creative Arts, an arts training center for children of secondary school age, and went on to Tulane University where she obtained her BA in Theater. Relocating to Los Angeles, she was soon cast in guest starring roles on television, including in the famous Seinfeld (1989) episode, Seinfeld: The Little Kicks (1996), in which she plays Anna, a love interest of George's who is attracted to rough men, causing George to feign a dangerous side, with predictable results. Recurring roles followed, such as in the Fred Savage series, Working (1997), and as the bartender Leanne in the hit series, Two and a Half Men (2003). McFarland's film roles have included Scream 2 (1997). New Orleans famously boasts bigger-than-life personalities and McFarland, a daughter of that city, is no exception, being capable of portraying a gamut of roles from tough professional to comical ditz. She is an accomplished self-taught painter and is active on social media. McFarland has been linked romantically to director Jason Ensler.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzQ2MDkzOV5BMl5BanBnXkFtZTgwMzIyNDcxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0568777","name":"Rebecca McFarland","idIMDB":"nm0568777"},"actorId":"nm0568777","character":"Caren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Wendt","urlProfile":"http://www.imdb.com/name/nm0001841","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODgzNDY1MF5BMl5BanBnXkFtZTYwMTYwMjE1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1948","placeOfBirth":" Chicago, Illinois, USA","birthName":"George Robert Wendt","height":"5' 8\" (1.73 m)","bio":"George Robert Wendt III was born and raised in Chicago, Illinois, USA, to Loretta Mary (Howard) and George Robert Wendt, who was a realtor and navy officer. He attended a strict Jesuit prep school and then dropped out of Notre Dame University after a few uneventful years. He worked with the Windy City's famed Second City comedy troupe from 1974-1980. He is best known for playing Norm Peterson on the hit televison series, Cheers (1982). He is married to actress Bernadette Birkett, who provided the rare offscreen voice of Norm's unseen wife Vera. The couple have two sons and a daughter. They met while working at the Second City in Chicago.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODgzNDY1MF5BMl5BanBnXkFtZTYwMTYwMjE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001841","name":"George Wendt","idIMDB":"nm0001841"},"actorId":"nm0001841","character":"Mickey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elaine Hendrix","urlProfile":"http://www.imdb.com/name/nm0005006","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDc3NzgwMV5BMl5BanBnXkFtZTgwNzMxNzM2OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1970","placeOfBirth":" Oak Ridge, Tennessee, USA","birthName":"Katherine Elaine Hendrix","height":"5' 8\" (1.73 m)","bio":"Born in Oak Ridge, Tennessee, Elaine Hendrix spent her early years in nearby Knoxville and Morristown. At 15 she moved with her divorced mother to Atlanta, Georgia, where she attended the Northside School of Performing Arts. She started her professional career as a dancer and model but gave up dance after she was hit by a car while bicycling. She officially moved to Los Angeles in 1992 and had an agent within a month. She worked her way from commercials to TV guest shots to a starring role on the 1995 Fox revival of Get Smart (1995) to features. A member of Women in Film, Women in Theatre and Women of Los Angeles, Hendrix has written a short film that she plans to direct at the end of 1999/beginning of 2000 (as soon as she can take a break from her acting schedule). She has two birds and two turtles and in September 1999 added a dog named Tiloc to her family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDc3NzgwMV5BMl5BanBnXkFtZTgwNzMxNzM2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005006","name":"Elaine Hendrix","idIMDB":"nm0005006"},"actorId":"nm0005006","character":"Brenda Simon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Farley","urlProfile":"http://www.imdb.com/name/nm0267656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTc0NTE4Nl5BMl5BanBnXkFtZTYwOTM2NjAz._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1968","placeOfBirth":" Madison, Wisconsin, USA","bio":"John is the youngest brother of Chris Farley. He grew up in Madison, Wisconsin. His older brother, Kevin, also acts. Tom, the eldest of the boys, works in Madison as the head of the Chris Farley Foundation. His sister, Barb, is a pre-school teacher in Madison. John attended Portsmouth Abbey School in Portsmouth, Rhode Island, and Regis University in Denver, Colorado, where he majored in Marketing. He studied and worked at the Second City in Chicago after college. He moved to LA in 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTc0NTE4Nl5BMl5BanBnXkFtZTYwOTM2NjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267656","name":"John Farley","idIMDB":"nm0267656"},"actorId":"nm0267656","character":"Cop #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin P. Farley","urlProfile":"http://www.imdb.com/name/nm0267659","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTlkY2RmY2UtNmZhMi00ZjViLTg3MmMtZjFkYzQ3OGQ5ZTRkL2ltYWdlXkEyXkFqcGdeQXVyMTk4NDcxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1965","placeOfBirth":" Madison, Wisconsin, USA","birthName":"Kevin Prindiville Farley","height":"5' 10\" (1.78 m)","bio":"Kevin Farley (accomplished actor, writer, director) has truly established himself as a comedic presence both on the big screen and television. Kevin was born in Madison, Wisconsin, to Mary Anne (Crosby) and Thomas Farley, who owned an oil company. Among his siblings are actors John Farley and the late Chris Farley. He is of Irish heritage. He has 2 other brothers and sisters--Barb, a nursery school teacher, and Tom Jr., who works for a marketing firm. He majored in business at Marquette University in Milwaukee. After graduation, for six years he sold asphalt for his father's company, Scotch Oil. However, Chris soon convinced him to try show business. Kevin first went on stage at the Chicago ImprovOlympic. Farley eventually moved to Chicago and studied at the famed Second City. The minute he relocated to Los Angeles he began landing roles in films such as Tommy Boy and Black Sheep. Then Farley landed a starring role as \"Doug Linus\" on MTV's sitcom 2gether where he was met with rave reviews. After that Farley appeared in numerous TV series programs such as That '70s Show, 3rd Rock from the Sun, Joey, Just Shoot Me, Curb Your Enthusiasm and many more. When Farley moved more into feature films, his unsurprising emphasis was exclusively on comedy. He appeared in the Adam Sandler animated comedy Eight Crazy Nights, and soon after The Waterboy, Dirty Work, the Cedric the Entertainer laugh-fest Johnson Family Vacation to name a few. Farley recently starred in the lead role of An American Carol playing a cynical, Anti-American \"Hollywood\" filmmaker who sets out on a crusade to abolish the 4th of July holiday. He is visited by three spirits who take him on a hilarious journey in an attempt to show him the true meaning of America. This comedy film, (directed by David Zucker) is a parody of liberal filmmaker Michael Moore that \"lampoons contemporary American culture, particularly Hollywood.\" It uses the framework of A Christmas Carol but moves the setting of the story from Christmas to Independence Day. The supporting cast included Kelsey Grammer, Jon Voight, Dennis Hopper, and Leslie Nielsen Soon to be released this fall is the feature film Hollywood and Wine, which Farley co-wrote, directed and stars in. The film also stars Chazz Palminteri, Chris Kattan, David Spade, Norm MacDonald and Jeremy London. Next up is Farley's latest written project Back in the Saddle - a western comedy set in Wyoming. Multi tasking is easy for Farley - he does it all with a fabulously contagious sense of humor, both on screen and off. Kevin Farley resides in Los Angeles and is truly one Hollywood's fastest rising stars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTlkY2RmY2UtNmZhMi00ZjViLTg3MmMtZjFkYzQ3OGQ5ZTRkL2ltYWdlXkEyXkFqcGdeQXVyMTk4NDcxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267659","name":"Kevin P. Farley","idIMDB":"nm0267659"},"actorId":"nm0267659","character":"Cop #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobby Gaylor","urlProfile":"http://www.imdb.com/name/nm0310929","urlPhoto":"","biography":{"bio":"Bobby Gaylor is a writer and actor, known for The Nightly Show with Larry Wilmore (2015), Phineas and Ferb (2007) and The Bernie Mac Show (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0310929","name":"Bobby Gaylor","idIMDB":"nm0310929"},"actorId":"nm0310929","character":"Guitar Player","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dave Baez","urlProfile":"http://www.imdb.com/name/nm0651104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDkwNTc1NV5BMl5BanBnXkFtZTcwNTI4OTczMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1971","placeOfBirth":" New Bedford, Massachusetts, USA","birthName":"Dave Ortiz","bio":"With a dedication to his craft, and consummate appetite for the world and people around him, Dave Baez has built a career on character study, and cultivated a passion to share his experience with a new generation of theater and film actors. Dave can next be seen in the feature Mothers and Daughters, opposite Sharon Stone, Susan Sarandon, Selma Blair, Christina Ricci, and Courteney Cox, due out May 6th of this year, playing a doctor who develops a personal relationship with Selma Blair's character, as she struggles to make a tough decision regarding an unexpected pregnancy. Born in the old New England fishing town of New Bedford, Massachusetts, Dave grew up in a multi-ethnic family, deeply rooted in Portuguese and Puerto Rican culture. Raised with unwavering support, Dave developed a passion for the arts, leading him to the University of Massachusetts, Dartmouth. There, he majored in Theater Studies, performing in several plays as well as establishing a program for students called, \"The Experimental Stage,\" a creative outlet for free speech and the performing arts on campus. After college, Dave moved to Miami, and was soon cast in his first professional theater production as King Philip of France, in \"A Lion In Winter.\" More success followed as he was given an opportunity to meet with legendary fashion photographer Bruce Weber, who booked him for ads in Versace and Ralph Lauren, among others. Dave's focus, however, remained on acting as he used his newfound opportunity to move to New York and enroll in the acclaimed Herbert Bergdorf studio, studying under the late, celebrated actor, William Hickey, as well as an acceptance into the \"Absolute Theater Company,\" which produced off Broadway plays. After benefiting from a donation from Al Pacino, the Company was able to produce a showcase in Los Angeles, which in turn, allowed Dave to make his destined move out west. With experience and a solid resume, Dave quickly booked a role in the final installment of the Crow franchise, The Crow: Wicked Prayer, for Dimension Films in 2005, opposite Danny Trejo and Dennis Hopper. Several parts in film and television followed, including recurring roles in NBC's \"Miss Match,\" alongside Alicia Silverstone and Ryan O'Neil, \"Las Vegas,\" opposite Josh Duhamel and Vanessa Marcil, and a five-episode arc on Showtime's \"Dexter,\" where Dave played Gabriel, the boyfriend to the title character's sister. Other credits include the Daytime Episodic, \"Days of Our Lives,\" CBS' \"The Mentalist,\" The CW fantasy-drama, \"The Secret Circle,\" the long-running Paramount comedy, \"All of Us,\" co-created by Will and Jada Pinkett Smith, and the popular IFC series \"Maron\" in 2015, along with countless commercials for brands such as, Bud Light, Craftsman, Honda, Toyota, Buick, Caress, Verizon and AT&T, among others. For Dave, acting is a companion to his natural thirst for life and intense reflection into his own soul. He is keenly aware that an actors journey never ends, the craft never perfected, but only built layer upon layer. This intense passion has led Dave to a new endeavor as he transitions into teaching the craft as well, sharing his experience, trade-craft and unique insights of the industry that has fulfilled him for over a decade. Dave continues to live and work in Los Angeles, and although he remains very active in the business he loves so much, he looks forward to supporting the dreams and passions of the new crop of budding actors, the way his were so long ago.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDkwNTc1NV5BMl5BanBnXkFtZTcwNTI4OTczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651104","name":"Dave Baez","idIMDB":"nm0651104"},"actorId":"nm0651104","character":"Eric","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0853127","urlIMDB":"http://www.imdb.com/title/tt0853127","business":{"budget":{"money":"$625,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.9","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"206","type":"Movie","companyCreditsSimple":[{"idCompany":"co0187802","name":"LA Blues"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:50:41"}}