{"data":{"movies":[{"title":"Epic","originalTitle":"","year":"2013","releaseDate":"20130524","directors":[{"name":"Chris Wedge","id":"nm0917188"}],"writers":[{"name":"James V. Hart","id":"nm0366337"},{"name":"William Joyce","id":"nm0431622"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDYwNzE5NV5BMl5BanBnXkFtZTcwMzUyODM5OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Adventure","Family","Fantasy"],"plot":"Young Mary Katherine (M.K.) returns to her eccentric scientist father's home, but his all-consuming quest to discover a tiny civilization in the neighboring forest drives them apart. However, M.K. soon finds herself shrunken down by Queen Tara of that forest who was mortally wounded by the putrefying Boggans, and charged to deliver a pod bearing the new Queen to safety. Together with a veteran Leafman warrior, two goofy mollusks and a young maverick, M.K. agrees to help. As the villainous Boggan leader, Mandrake closes in, M.K. and her new friends must draw on the best of themselves together and discover what they have to save their world.","simplePlot":"A teenager finds herself transported to a deep forest setting where a battle between the forces of good and the forces of evil is taking place. She bands together with a rag-tag group of characters in order to save their world -- and ours.","actors":[{"actorName":"Blake Anderson","urlProfile":"http://www.imdb.com/name/nm2981935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzEwMjUzNTheQTJeQWpwZ15BbWU4MDc3MjAwOTMx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Blake Anderson is a comedian and one of the stars and creators of the Comedy Central show Workaholics. Originally from Concord, California, Anderson studied with The Groundlings and with Upright Citizens Brigade. He formed the sketch-comedy group Mail Order Comedy along with Workaholics costars and co-creators Anders Holm, Adam DeVine and Kyle Newacheck. Anderson appeared on several episodes of the Fox show Traffic Light and has had small cameos in an episode of HBO's Entourage and an episode of the Fox show House. Anderson is also a big supporter of the Hyphy hip-hop music scene in the East Bay, California area, noting Lil B as one of his favorite performers. Anderson says he is \"Based 4 Life\" and \"Lil B is the true based God.\" On December 17, 2011, Anderson required surgery after fracturing his spine during a house party by jumping from his roof onto a beer pong table. Blake also recently played an extra in the music video \"We are young\" by FUN. In 2011, Blake had a cameo in One Direction's \"One Thing\" music video.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzEwMjUzNTheQTJeQWpwZ15BbWU4MDc3MjAwOTMx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2981935","name":"Blake Anderson","nicknames":["Uncle Blazer"],"idIMDB":"nm2981935"},"actorId":"nm2981935","character":"Dagda","urlCharacter":"http://www.imdb.com/character/ch0437721","main":true},{"actorName":"Aziz Ansari","urlProfile":"http://www.imdb.com/name/nm2106637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NzYwNDQwN15BMl5BanBnXkFtZTgwNDA2NjQwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1983","placeOfBirth":" Columbia, South Carolina, USA","birthName":"Aziz Ishmael Ansari","height":"5' 6\" (1.68 m)","bio":"Aziz Ansari was born in Columbia, South Carolina, to Fatima, a medical office worker, and Shoukath, a gastroenterologist. His family is from Tamil Nadu, India. He graduated from NYU as a business major in 2004. He studied at the South Carolina governors school of science and mathematics. He previously attended the Bennetsville Academy which was in his home town. Starting out in television like the hit comedy Parks and Recreation (2009), he later had bit parts in the films I Love You, Man (2009), Funny People (2009), and Get Him to the Greek (2010), among others, before co-starring in the comedy 30 minutes maximum (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NzYwNDQwN15BMl5BanBnXkFtZTgwNDA2NjQwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2106637","name":"Aziz Ansari","idIMDB":"nm2106637"},"actorId":"nm2106637","character":"Mub","urlCharacter":"http://www.imdb.com/character/ch0314265","main":true},{"actorName":"Allison Bills","urlProfile":"http://www.imdb.com/name/nm3535974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODAwMzA2N15BMl5BanBnXkFtZTgwMDcxNDkwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Allison Bills is an actress and writer, known for Documentary Now! (2015), Shameless (2011) and Superstore (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODAwMzA2N15BMl5BanBnXkFtZTgwMDcxNDkwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3535974","name":"Allison Bills","idIMDB":"nm3535974"},"actorId":"nm3535974","character":"Dandelion Jinn","urlCharacter":"http://www.imdb.com/character/ch0000497","main":true},{"actorName":"Jim Conroy","urlProfile":"http://www.imdb.com/name/nm0175828","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjEwNzYyOF5BMl5BanBnXkFtZTgwNzk5OTI2NzE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Jim Conroy is an actor and writer, known for Epic (2013), Rio 2 (2014) and Ice Age: Continental Drift (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjEwNzYyOF5BMl5BanBnXkFtZTgwNzk5OTI2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175828","name":"Jim Conroy","idIMDB":"nm0175828"},"actorId":"nm0175828","character":"Race Announcer / Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Cummings","urlProfile":"http://www.imdb.com/name/nm1423742","urlPhoto":"","biography":{"bio":"Todd Cummings is an actor, known for Epic (2013), Bolt (2008) and American Splendor (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1423742","name":"Todd Cummings","idIMDB":"nm1423742"},"actorId":"nm1423742","character":"Fruit Fly","urlCharacter":"http://www.imdb.com/character/ch0386465","main":true},{"actorName":"John DiMaggio","urlProfile":"http://www.imdb.com/name/nm0224007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODA3OTE2N15BMl5BanBnXkFtZTgwMTc1MzQzMTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1968","placeOfBirth":" North Plainfield, New Jersey, USA","birthName":"John William DiMaggio","height":"6' 3½\" (1.92 m)","bio":"John DiMaggio was born on September 4, 1968 in North Plainfield, New Jersey, USA as John William DiMaggio. He is an actor, known for Adventure Time (2010), Futurama (1999) and Princess Mononoke (1997). He has been married to Kate Miller since October 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODA3OTE2N15BMl5BanBnXkFtZTgwMTc1MzQzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0224007","name":"John DiMaggio","idIMDB":"nm0224007"},"actorId":"nm0224007","character":"Pinecone Jinn","urlCharacter":"http://www.imdb.com/character/ch0000497","main":true},{"actorName":"Troy Evans","urlProfile":"http://www.imdb.com/name/nm0263283","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMjU3NjMyMl5BMl5BanBnXkFtZTgwMDUyMjE2NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1948","placeOfBirth":" Missoula, Montana, USA","bio":"Troy Evans was born on February 16, 1948 in Missoula, Montana, USA. He is an actor, known for Ace Ventura: Pet Detective (1994), Piège en haute mer (1992) and ER (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMjU3NjMyMl5BMl5BanBnXkFtZTgwMDUyMjE2NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0263283","name":"Troy Evans","idIMDB":"nm0263283"},"actorId":"nm0263283","character":"Thistle Jinn","urlCharacter":"http://www.imdb.com/character/ch0000497","main":true},{"actorName":"Colin Farrell","urlProfile":"http://www.imdb.com/name/nm0268199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzM5NDk0MV5BMl5BanBnXkFtZTcwNzAzMTUxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1976","placeOfBirth":" Castleknock, Dublin, Ireland","birthName":"Colin James Farrell","height":"5' 10\" (1.78 m)","bio":"Colin Farrell is one of Ireland's best rising stars in Hollywood and abroad today. His film presence has been filled with memorable roles that range from an inwardly tortured hit man, to an adventurous explorer, a determined-but-failing writer, and the greatest military leader in history. Farrell was born on May 31, 1976 in Castleknock, Dublin, Ireland, to Rita (Monaghan) and Eamon Farrell. His father and uncle were both professional athletes, and for a while, it looked like Farrell would follow in their footsteps. Farrell auditioned for a part in the Irish Boy Band, Boyzone, but it didn't work out. After dropping out of the Gaiety School of Acting, Farrell was cast in Ballykissangel (1996), a BBC television drama. \"Ballykissangel\" was not his first role on screen. Farrell had previously been in The War Zone (1999), directed by Tim Roth and had appeared in the independent film Drinking Crude (1997). Farrell was soon to move on to bigger things. Exchanging his usually thick Dublin accent for a light Texas drawl, Farrell acted in the gritty Tigerland (2000), directed by Joel Schumacher. Starring Farrell amongst a number of other budding young actors, the film portrays a group of new recruits being trained for the war in Vietnam. Farrell played the arrogant soldier Boz, drafted into the army and completely spiteful of authority. The film was praised by critics, but did not make much money at the box office. It was Farrell's first big role on film, and certainly not his last. Farrell followed up with American Outlaws (2001), where he played the notorious outlaw Jesse James with Scott Caan, son of legendary actor James Caan, in the role of Cole Younger. The film was a box office flop and failure with the critics. Immediately, Farrell returned to the war drama film that had made him famous. Co-starring in the war film Hart's War (2002) opposite Bruce Willis, Farrell played the young officer captured by the enemy. The film was another failure. Farrell struck gold when he was cast in the Steven Spielberg film Minority Report (2002) that same year. Set in a futuristic time period, Farrell played the character Danny Witwer, a young member of the Justice Department who is sent after Tom Cruise's character. The film was a smash hit, and praised by critics. Farrell continued this success when he reunited with Joel Schumacher on the successful thriller Phone Booth (2002). Farrell played the role of the victim who is harassed by an unseen killer (Kiefer Sutherland) and is made to reveal his sins to the public. 2003 was a big year for Farrell. He starred in the crime thriller The Recruit (2003) as a young CIA man mentored by an older CIA veteran (Al Pacino). Pacino later stated that Farrell was the best actor of his generation. Farrell certainly continued to be busy that year with Daredevil (2003), which actually allowed him to keep his thick Irish accent. The film was another success for Farrell, as was the crime film S.W.A.T. (2003) where Farrell starred opposite Samuel L. Jackson and LL Cool J. Farrell also acted in the Irish black comedy film Intermission (2003) and appeared another Irish film Veronica Guerin (2003) which reunited him with Joel Schumacher once again. The following year, Farrell acted in what is his most infamous film role yet: the title role in the mighty Oliver Stone film epic Alexander (2004), which is a character study of Alexander the Great as he travels across new worlds and conquers all the known world before him. Farrell donned a blond wig and retained his Irish accent, and gave a fine performance as Alexander. However, both he and the film were criticized. Despite being one of the highest grossing films internationally and doing a good job at the DVD sales, Farrell did not come out of the experience without a few hurts. Farrell attempted to rebound with his historical film The New World (2005). Reuniting with \"Alexander\" star Christopher Plummer, and also acting with Christian Bale, Farrell played the brave explorer John Smith, who would make first contacts with the Native peoples. The film did not do well at the box office, though critics praised the film's stunning appearance and cinematography. Farrell returned to act in Michael Mann's film Miami Vice (2006) alongside Jamie Foxx. The film was a film adaptation of the famous television series, and did reasonably well at the box office. Farrell also acted in Ask the Dust (2006) with Salma Hayek and Donald Sutherland, though the film did not receive much distribution. The next year, Farrell acted alongside Ewan McGregor in the Woody Allen film Cassandra's Dream (2007) which received mixed reviews from critics. Farrell followed up with the hilarious black comedy In Bruges (2008). Written and directed by Irish theatre director Martin McDonagh, the film stars Farrell and Brendan Gleeson as two Irish hit men whose latest assignment went wrong, leaving them to hide out in Bruges, Belgium. The film has been one of Farrell's most praised work, and he was nominated for a Golden Globe. As well as In Bruges (2008), Farrell acted alongside Edward Norton in the crime film Pride and Glory (2008) which was not as successful as the former film. As well as working with charity, and speaking at the Special Olympics World Games in 2007, he has donated his salary for Terry Gilliam's The Imaginarium of Doctor Parnassus (2009) to Heath Ledger's little daughter (who was left nothing in a will that had not been updated in time). Ledger had originally been cast in the film and was replaced by Farrell, Johnny Depp and Jude Law. The film was a critical and financial success, and Farrell also played a small role in Crazy Heart (2009) which had the Dubliner playing a country singer. Farrell even sang a few songs for the film's soundtrack. As well as those small roles, Farrell took the lead role in the war film Triage (2009). Farrell incredibly lost forty-four pounds to play the role of a war photographer who must come to terms with what he has experienced in Kurdistan. While the film was finely made, with excellent performances from all involved, the film has received almost no distribution. Farrell's other leading role that year was in Neil Jordan's Irish film Ondine (2009), which had Farrell playing an imaginative fisherman who thinks he has caught a mermaid in his net. In recent years, he co-starred in the comedy horror film Fright Night (2011), the science fiction action film Total Recall (2012), both remakes, and McDonagh's second feature, and the black comedy crime film Seven Psychopaths (2012). Since the mid-2000s, Farrell has cleaned up his act, and far from being a Hollywood hell raiser and party animal, Farrell has shown himself to be a respectable and very talented actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzM5NDk0MV5BMl5BanBnXkFtZTcwNzAzMTUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0268199","name":"Colin Farrell","idIMDB":"nm0268199"},"actorId":"nm0268199","character":"Ronin","urlCharacter":"http://www.imdb.com/character/ch0314263","main":true},{"actorName":"Jason Fricchione","urlProfile":"http://www.imdb.com/name/nm1723600","urlPhoto":"","biography":{"bio":"Jason Fricchione is known for his work on Rio (2011), Ice Age: Dawn of the Dinosaurs (2009) and Ice Age: Continental Drift (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1723600","name":"Jason Fricchione","idIMDB":"nm1723600"},"actorId":"nm1723600","character":"Bufo's Goon","urlCharacter":"http://www.imdb.com/character/ch0454421","main":true},{"actorName":"Judah Friedlander","urlProfile":"http://www.imdb.com/name/nm0295103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzNzkwODIzOV5BMl5BanBnXkFtZTgwNDIyMzM0MDI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1969","placeOfBirth":" Gaithersburg, Maryland, USA","height":"5' 9\" (1.75 m)","bio":"Judah Friedlander was born on March 16, 1969 in Gaithersburg, Maryland, USA. He is an actor, known for 30 Rock (2006), The Wrestler (2008) and Meet the Parents (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzNzkwODIzOV5BMl5BanBnXkFtZTgwNDIyMzM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0295103","name":"Judah Friedlander","idIMDB":"nm0295103"},"actorId":"nm0295103","character":"Taxi Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Hong","urlProfile":"http://www.imdb.com/name/nm1998151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MTU4MDAyNV5BMl5BanBnXkFtZTgwMDQ3NjU2MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 1\" (1.55 m)","bio":"Helen Hong plays \"Janet Fung\" in the Coen Brothers' \"Inside Llewyn Davis\" and recurs as \"Mrs. Song\" in Starz' \"Blunt Talk.\" She also has a recurring guest star role as \"Mrs. Wong\" on Nickelodeon's \"The Thundermans.\" In addition to her numerous acting roles, Helen has performed standup comedy on \"The Arsenio Hall Show,\" \"Last Call with Carson Daly,\" \"Comics Unleashed,\" OWN's \"Wanda Sykes Presents Herlarious,\" TV Guide Network's \"Standup in Stilettos,\" and the Showtime documentary \"Why We Laugh: Funny Women.\" As a reality TV director/producer, Helen's credits include \"What Not to Wear,\" \"Say Yes to the Dress\" and \"Four Weddings.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MTU4MDAyNV5BMl5BanBnXkFtZTgwMDQ3NjU2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1998151","name":"Helen Hong","idIMDB":"nm1998151"},"actorId":"nm1998151","character":"Thistle Lady","urlCharacter":"http://www.imdb.com/character/ch0454422","main":true},{"actorName":"Josh Hutcherson","urlProfile":"http://www.imdb.com/name/nm1242688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4OTk0MjQ1OV5BMl5BanBnXkFtZTcwNTE3NjM3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1992","placeOfBirth":" Union, Kentucky, USA","birthName":"Joshua Ryan Hutcherson","height":"5' 7\" (1.7 m)","bio":"Joshua Ryan Hutcherson was born on October 12, 1992 in Union, Kentucky to Michelle Fightmaster Hutcherson, who worked for Delta Air Lines, and Chris Hutcherson, an EPA analyst. He has one younger brother, Connor Hutcherson. From the age of four, Josh knew that he wanted to be an actor. In order to pursue his goal, Josh and his family moved to Los Angeles when he was nine-years-old. In 2002, Josh landed his first acting role in the TV film, House Blend (2002), with Amy Yasbeck, Dan Cortese and Sean Faris. The same year, Josh was cast in the pilot, Becoming Glen (2002), but Fox did not order it to series (though, several years later, it was reconfigured as the short-lived series, The Winner (2007), starring Rob Corddry, and co-written/produced by Seth MacFarlane). Toward the end of 2002, Josh appeared on an episode of ER (1994). Josh made his big-screen debut, in 2003, with a bit part in the Oscar-nominated American Splendor (2003). His career began its measured ascent in 2005 with a supporting slot as one of Will Ferrell's kids in Kicking & Screaming (2005), a co-starring role in the indie hit Little Manhattan (2005), and another co-starring role in Zathura: A Space Adventure (2005), which was originally conceived as a sequel to Jumanji (1995). Despite underperforming at the box office, \"Zathura\" helped earned for Josh his first Young Artist Award for \"Leading Young Actor\". 2006 saw bigger returns for Josh's burgeoning film career with a role as one of Robin Williams' sons in the modest hit, RV (2006). The following year, he landed his first breakthrough role in Bridge to Terabithia (2007), the kid-approved adaptation of Katherine Paterson's novel that co-starred AnnaSophia Robb, whose career was also taking off at this time. Josh starred as Brendan Fraser's nephew in another family-film hit, Journey to the Center of the Earth (2008), and he had a smaller role in the Crash-like drama, Fragments (2008), though by now his face and name were being used in movie-marketing materials. Though it wasn't a hit, Josh's character in Cirque du Freak: The Vampire's Assistant (2009) served as a major plot device early in the story. In 2010, Josh co-starred in the critically-acclaimed film, The Kids Are All Right (2010), alongside Annette Bening, Julianne Moore, Mark Ruffalo, and Mia Wasikowska. The film received several awards and four Academy Award nominations, including Best Picture. Josh's performance as the youngest child in a family, led by two mothers, earned him acclaim from audiences and the industry, alike. Josh followed up with an expanded role in Journey 2: The Mysterious Island (2012), which saw Dwayne Johnson take over as the main character from Brendan Fraser. Between the star power and the allure of 3D, the sequel was a worldwide hit and a third installment is in development. With the announcement that he would portray the beloved \"Peeta Mellark\" in The Hunger Games (2012), the film adaptation of the best-selling novel written by Suzanne Collins, Josh became an instant celebrity. In the wake of the movie's massive worldwide success, Detention (2011), a horror/comedy that Josh made before \"The Hunger Games\", was released. Josh was also an executive producer on that feature. Before Josh reprises his role as \"Peeta\" in The Hunger Games: Catching Fire (2013), we will see him in the long-delayed remake of Red Dawn (2012); the omnibus 7 jours à la Havane (2012) (aka \"7 Days in Havana\") (Josh's segment was directed by Benicio Del Toro); The Forger (2012) opposite Lauren Bacall, Alfred Molina, and Hayden Panettiere; and the animated Epic (2013) from Ice Age (2002) co-director (and voice of \"Scrat\"), Chris Wedge.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4OTk0MjQ1OV5BMl5BanBnXkFtZTcwNTE3NjM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1242688","name":"Josh Hutcherson","nicknames":["JHutch","Hutch"],"idIMDB":"nm1242688"},"actorId":"nm1242688","character":"Nod","urlCharacter":"http://www.imdb.com/character/ch0314261","main":true},{"actorName":"Kelly Keaton","urlProfile":"http://www.imdb.com/name/nm1960185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmMzYmM0ZGItZTU5OS00OTFjLWIzYmMtZmE4YWZmNTFiNWJmXkEyXkFqcGdeQXVyNjQ5MTMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Kelly Hanley","height":"5' 2\" (1.57 m)","bio":"Kelly Keaton was born as Kelly Hanley. She is an actress and writer, known for Rio (2011), Ice Age: Dawn of the Dinosaurs (2009) and Epic (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmMzYmM0ZGItZTU5OS00OTFjLWIzYmMtZmE4YWZmNTFiNWJmXkEyXkFqcGdeQXVyNjQ5MTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1960185","name":"Kelly Keaton","idIMDB":"nm1960185"},"actorId":"nm1960185","character":"Berry Lady","urlCharacter":"http://www.imdb.com/character/ch0437716","main":true},{"actorName":"Emma Kenney","urlProfile":"http://www.imdb.com/name/nm3160752","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTY0NjIzNl5BMl5BanBnXkFtZTgwNzQzOTAzMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1999","placeOfBirth":" Manhattan, New York City, New York, USA","height":"5' 3\" (1.6 m)","bio":"Emma Kenney was born on September 14, 1999 in Manhattan, New York City, New York, USA. She is an actress, known for Shameless (2011), Epic (2013) and Bittersweet (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTY0NjIzNl5BMl5BanBnXkFtZTgwNzQzOTAzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3160752","name":"Emma Kenney","idIMDB":"nm3160752"},"actorId":"nm3160752","character":"Marigold Girl","urlCharacter":"http://www.imdb.com/character/ch0437718","main":true},{"actorName":"Kyle Kinane","urlProfile":"http://www.imdb.com/name/nm2780278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAyNDM2MzQ2Ml5BMl5BanBnXkFtZTcwMDczNDAzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Kyle Kinane is an actor and writer, known for Epic (2013), Funny People (2009) and Invisible (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAyNDM2MzQ2Ml5BMl5BanBnXkFtZTcwMDczNDAzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2780278","name":"Kyle Kinane","idIMDB":"nm2780278"},"actorId":"nm2780278","character":"Biker Dude","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0848537","urlIMDB":"http://www.imdb.com/title/tt0848537","business":{"budget":{"money":"$100,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$33,531,068","country":"USA","day":"26","month":"05","year":"2013","remarks":"3,882 Screens"},{"money":"HUF 43,928,689","country":"Hungary","day":"26","month":"05","year":"2013","remarks":""}],"gross":[{"money":"$107,515,297","country":"USA","day":"15","month":"09","year":"2013","remarks":""},{"money":"$107,492,284","country":"USA","day":"08","month":"09","year":"2013","remarks":""},{"money":"$107,452,356","country":"USA","day":"01","month":"09","year":"2013","remarks":""},{"money":"$107,356,605","country":"USA","day":"25","month":"08","year":"2013","remarks":""},{"money":"$107,213,621","country":"USA","day":"18","month":"08","year":"2013","remarks":""},{"money":"$106,984,453","country":"USA","day":"11","month":"08","year":"2013","remarks":""},{"money":"$106,648,833","country":"USA","day":"04","month":"08","year":"2013","remarks":""},{"money":"$106,189,993","country":"USA","day":"28","month":"07","year":"2013","remarks":""},{"money":"$105,595,201","country":"USA","day":"21","month":"07","year":"2013","remarks":""},{"money":"$104,872,293","country":"USA","day":"14","month":"07","year":"2013","remarks":""},{"money":"$104,042,667","country":"USA","day":"07","month":"07","year":"2013","remarks":""},{"money":"$103,010,133","country":"USA","day":"30","month":"06","year":"2013","remarks":""},{"money":"$101,048,500","country":"USA","day":"23","month":"06","year":"2013","remarks":""},{"money":"$95,713,528","country":"USA","day":"16","month":"06","year":"2013","remarks":""},{"money":"$83,930,559","country":"USA","day":"09","month":"06","year":"2013","remarks":""},{"money":"$65,377,491","country":"USA","day":"02","month":"06","year":"2013","remarks":""},{"money":"$42,820,971","country":"USA","day":"26","month":"05","year":"2013","remarks":""}],"weekendGross":[{"money":"$15,483","country":"USA","day":"15","month":"09","year":"2013","remarks":"31 Screens"},{"money":"$34,144","country":"USA","day":"08","month":"09","year":"2013","remarks":"56 Screens"},{"money":"$68,329","country":"USA","day":"01","month":"09","year":"2013","remarks":"80 Screens"},{"money":"$77,264","country":"USA","day":"25","month":"08","year":"2013","remarks":"115 Screens"},{"money":"$120,853","country":"USA","day":"18","month":"08","year":"2013","remarks":"168 Screens"},{"money":"$160,241","country":"USA","day":"11","month":"08","year":"2013","remarks":"222 Screens"},{"money":"$226,256","country":"USA","day":"04","month":"08","year":"2013","remarks":"255 Screens"},{"money":"$313,403","country":"USA","day":"28","month":"07","year":"2013","remarks":"289 Screens"},{"money":"$380,629","country":"USA","day":"21","month":"07","year":"2013","remarks":"319 Screens"},{"money":"$480,879","country":"USA","day":"14","month":"07","year":"2013","remarks":"352 Screens"},{"money":"$511,334","country":"USA","day":"07","month":"07","year":"2013","remarks":"428 Screens"},{"money":"$820,608","country":"USA","day":"30","month":"06","year":"2013","remarks":"774 Screens"},{"money":"$1,793,375","country":"USA","day":"23","month":"06","year":"2013","remarks":"1,994 Screens"},{"money":"$6,284,905","country":"USA","day":"16","month":"06","year":"2013","remarks":"3,151 Screens"},{"money":"$11,876,003","country":"USA","day":"09","month":"06","year":"2013","remarks":"3,594 Screens"},{"money":"$16,616,310","country":"USA","day":"02","month":"06","year":"2013","remarks":"3,894 Screens"},{"money":"$33,531,068","country":"USA","day":"26","month":"05","year":"2013","remarks":"3,882 Screens"}],"admissions":[{"money":"95,367","country":"Portugal","day":"03","month":"07","year":"2013","remarks":""},{"money":"92,169","country":"Portugal","day":"26","month":"06","year":"2013","remarks":""},{"money":"86,237","country":"Portugal","day":"19","month":"06","year":"2013","remarks":""},{"money":"70,637","country":"Portugal","day":"12","month":"06","year":"2013","remarks":""},{"money":"38,026","country":"Portugal","day":"05","month":"06","year":"2013","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Dolby Digital","Datasat","Dolby Atmos","Dolby Surround 7.1","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Modern VideoFilm, Burbank (CA), USA (digital intermediate)"],"filmLength":["2,809.5 m (5 reels)"],"negativeFormat":["Digital"],"cinematographicProcess":["Digital 3-D (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3523XD)","D-Cinema (also 3-D version)"]},"rating":"6.7","metascore":"52","filmingLocations":[],"rated":"PG","awards":[{"award":"Annie Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Outstanding Achievement in Animated Effects in an Animated Production","names":[{"name":"Alen Lai","id":"nm1157590","role":null},{"name":"David Quirus","id":"nm2352684","role":null},{"name":"Diego Garzon","id":"nm2418491","role":null},{"name":"Ilan Gabai","id":"nm2718247","role":null}]},{"category":"Outstanding Achievement in Character Animation in a Feature Production","names":[{"name":"Thom Roberts","id":"nm2188745","role":null}]},{"category":"Outstanding Achievement in Directing in an Animated Feature Production","names":[{"name":"Chris Wedge","id":"nm0917188","role":null}]},{"category":"Outstanding Achievement in Music in an Animated Feature Production","names":[{"name":"Danny Elfman","id":"nm0000384","role":null}]},{"category":"Outstanding Achievement in Production Design in an Animated Feature Production","names":[{"name":"Michael Knapp","id":"nm1155591","role":null},{"name":"Greg Couch","id":"nm5620524","role":null},{"name":"William Joyce","id":"nm0431622","role":null}]}]}]},{"award":"Behind the Voice Actors Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated BTVA Feature Film Voice Acting Award","categories":[{"category":"Best Male Vocal Performance in a Feature Film in a Supporting Role","names":[{"name":"Aziz Ansari","id":"nm2106637","role":null}]}]}]},{"award":"Black Reel Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Voice Performance","names":[{"name":"Beyoncé Knowles","id":"nm0461498","role":null}]}]}]},{"award":"BMI Film & TV Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"Film Music","names":[{"name":"Danny Elfman","id":"nm0000384","role":null}]}]}]},{"award":"Casting Society of America, USA 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Animation Feature","names":[{"name":"Christian Kaplan","id":"nm0438215","role":"casting director"}]}]}]},{"award":"Georgia Film Critics Association (GFCA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated GFCA Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Pre-Show Theatrical Advertising for a Brand","names":[{"name":"Twentieth Century Fox Film Corporation","id":null,"role":null},{"name":"Toy Box Entertainment","id":null,"role":null}]},{"category":"Best Viral Video or Campaign","names":[{"name":"Twentieth Century Fox Film Corporation","id":null,"role":null},{"name":"Toy Box Entertainment","id":null,"role":null}]}]}]},{"award":"Golden Trailer Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Animation/Family Poster","names":[{"name":"Twentieth Century Fox Film Corporation","id":null,"role":null},{"name":"Refinery, The","id":null,"role":null}]}]}]},{"award":"IGN Summer Movie Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Fantasy Movie","names":[]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2013","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for an Animated Feature Film","names":[{"name":"Danny Elfman","id":"nm0000384","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects, Foley, Dialogue and ADR in an Animation Feature Film","names":[{"name":"Randy Thom","id":"nm0858378","role":"supervising sound editor, sound designer"},{"name":"Gwendolyn Yates Whittle","id":"nm0946705","role":"supervising sound editor"},{"name":"Jeremy Bowker","id":"nm2840352","role":"sound designer"},{"name":"Luke Dunn Gielmuda","id":"nm0317355","role":"supervising foley editor"},{"name":"Brad Semenoff","id":"nm2522313","role":"supervising dialogue editor"},{"name":"Dennie Thorpe","id":"nm0861658","role":"foley artist"},{"name":"Jana Vance","id":"nm0888527","role":"foley artist"},{"name":"Benjamin A. Burtt","id":"nm0123785","role":"foley editor"},{"name":"James Likowski","id":"nm0510160","role":"foley editor"},{"name":"Michael Silvers","id":"nm0799011","role":"dialogue editor"},{"name":"Leff Lefferts","id":"nm1396496","role":"sound effects editor"},{"name":"Andre Fenley","id":"nm0271859","role":"sound effects editor"},{"name":"Kyrsten Mate","id":"nm0131144","role":"sound effects editor"},{"name":"Kent Sparling","id":"nm0817070","role":"sound effects editor"},{"name":"Lisa Jaime","id":"nm0415799","role":"music editor"},{"name":"Bill Abbott","id":"nm0007935","role":"music editor"}]}]}]},{"award":"PGA Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated PGA Award","categories":[{"category":"Outstanding Producer of Animated Theatrical Motion Pictures","names":[{"name":"Jerry Davis","id":"nm1124979","role":null},{"name":"Lori Forte","id":"nm1000858","role":null}]}]}]},{"award":"Satellite Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Motion Picture, Animated or Mixed Media","names":[]}]}]},{"award":"Visual Effects Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Animated Character in an Animated Feature Motion Picture","names":[{"name":"Thom Roberts","id":"nm2188745","role":null},{"name":"Haven Cousins","id":"nm1418300","role":null},{"name":"Tim Bower","id":"nm2973098","role":null},{"name":"Daniel Sampaio Lima","id":"nm3146517","role":null}]},{"category":"Outstanding Animated Character in an Animated Feature Motion Picture","names":[{"name":"Jeff Gabor","id":"nm2939778","role":null},{"name":"Dylan Maxwell","id":"nm2304624","role":null},{"name":"Sang Jun Lee","id":"nm1550293","role":null},{"name":"Chris Pagoria","id":"nm5921502","role":null}]},{"category":"Outstanding Created Environment in an Animated Feature Motion Picture","names":[{"name":"Aaron M. Ross","id":"nm1253061","role":null},{"name":"Travis Price","id":"nm0004075","role":null},{"name":"Jake Panian","id":"nm5921428","role":null},{"name":"Antelmo Villarreal","id":"nm2316080","role":null}]},{"category":"Outstanding FX and Simulation Animation in an Animated Feature Motion Picture","names":[{"name":"Thierry Dervieux","id":"nm3584028","role":null},{"name":"David Gatenby","id":"nm5921412","role":null},{"name":"Mark Adams","id":"nm0011185","role":null},{"name":"Matthew D. Simmons","id":"nm2189932","role":null}]}]}]},{"award":"World Soundtrack Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Film Composer of the Year","names":[{"name":"Danny Elfman","id":"nm0000384","role":null},{"name":"Frankenweenie","id":"tt1142977","role":null},{"name":"Hitchcock","id":"tt0975645","role":null},{"name":"Oz the Great and Powerful","id":"tt1623205","role":null},{"name":"Promised Land","id":"tt2091473","role":null},{"name":"Silver Linings Playbook","id":"tt1045658","role":null}]}]}]}],"votes":"88,822","type":"Movie","companyCreditsSimple":[{"idCompany":"co0179259","name":"Twentieth Century Fox Animation"},{"idCompany":"co0047265","name":"Blue Sky Studios"},{"idCompany":"co0145996","name":"House of Cool Studios"}],"keywords":{"keywords":["miniature person","father daughter relationship","forest","sword and fantasy","riding a bird","magic","fantasy world","queen","scientist","battle","quest","warrior","dog","slug","search","self doubt","push pin","loss of mother","loss of son","fruit fly","friendship","bat the animal","doubt","miniaturization","loss of friend","cgi animation","3 dimensional","sudden change in size","woman shot","sword","sword fight","science","taxi","tree","saddle","helmet","armor","sole black character dies cliche","shot with an arrow","mild violence","chase","bow and arrow","staff","kiss","love interest","rescue","escape","brawl","parkour","army","samurai sword","fictional war","swordsman","hand to hand combat","martial arts","final battle","showdown","duel","ambush","siege","surprise attack","female protagonist","no title at beginning","no opening credits","pun","plant","surveillance camera","ipod","decay","deer","mouse","jump","moonlight","full moon","moon","parchment","bud","death of queen","teenage girl","good versus evil","talking animal","snail","bat","bird","video camera","based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:33:31"}}