{"data":{"movies":[{"title":"Erotic Curse of Cairo","originalTitle":"","year":"1997","releaseDate":"1997","directors":[{"name":"Hamilton Lewiston","id":"nm0507895"}],"writers":[{"name":"Milo Manara","id":"nm1081810"},{"name":"Al Reynolds","id":"nm3564988"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODdiNTItNjA0MS00MjIzLWFiMzItYzE0ZmVkMzk0NDAxXkEyXkFqcGdeQXVyMjEwOTg0MjY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"simplePlot":"","actors":[{"actorName":"John Lazar","urlProfile":"http://www.imdb.com/name/nm0493677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NDYyNDI3MV5BMl5BanBnXkFtZTcwODU3NDYzMQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1946","placeOfBirth":" San Francisco, California, USA","birthName":"John Edward Lazar","height":"6' (1.83 m)","bio":"John La Zar was born and raised in San Francisco, California. He trained at the American Conservatory Theatre and has studied acting with Uta Hagen, Bill Ball, Jack Kosslyn, and Paul Shenar. La Zar was portraying the titular role in a University of Hawaii stage production of \"Caligula\" when he was approached by 20th Century Fox studio casting agent Phil Benjamin to audition for the part of deranged and debauched rock'n'roll music producer Ronnie 'Z-Man' Barzell in Russ Meyer's delightfully outrageous camp cult classic \"Beyond the Valley of the Dolls.\" John's wonderfully wild and eccentric performance as 'Z-Man' should have led to bigger and better things, but alas did not. A majority of La Zar's subsequent roles have been decidedly minor: funny as sleazy pimp Carl McKinney in Meyer's typically off-the-wall \"Supervixens,\" a Palestine general in the \"David & Goliath\" episode of \"Greatest Heroes of the Bible,\" a limousine driver in \"Eddie Presley,\" a warlock in \"Night of the Scarecrow,\" and a strip club patron in \"Stripteaser.\" However, on occasion John has landed a more substantial part; he's especially memorable as evil sorcerer Jarek in the enjoyably silly tongue-in-cheek sword and sorcery fantasy hoot \"Deathstalker II.\" La Zar had a recurring role as scientist Dr. Fez on the soft-core cable TV series \"Click.\" In addition to his regrettably sparse film and TV credits, John has acted in stage productions of such plays as \"The Crucible,\" \"Macbeth,\" \"Carnival,\" \"High Mass,\" \"No Exit,\" and \"Everyman.\" Outside of acting, La Zar is also a ballet dancer, master swordsman, and expert martial artist. He lives in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NDYyNDI3MV5BMl5BanBnXkFtZTcwODU3NDYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0493677","name":"John Lazar","idIMDB":"nm0493677"},"actorId":"nm0493677","character":"Dr. Fez","urlCharacter":"http://www.imdb.com/character/ch0112887","main":true},{"actorName":"Randall Bosley","urlProfile":"http://www.imdb.com/name/nm0098011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODczNzI1NF5BMl5BanBnXkFtZTYwNTM0Njgy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1947","placeOfBirth":" Van Nuys, California, USA","bio":"Randall Bosley was born on August 1, 1947 in Van Nuys, California, USA. He is an actor, known for The United States of Leland (2003), Envy (2004) and An American Carol (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODczNzI1NF5BMl5BanBnXkFtZTYwNTM0Njgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0098011","name":"Randall Bosley","idIMDB":"nm0098011"},"actorId":"nm0098011","character":"Abdul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugene Buica","urlProfile":"http://www.imdb.com/name/nm1042671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMzNTUyOTI4MV5BMl5BanBnXkFtZTcwOTcxMjk2Nw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"birthName":"Eugene Peter Buica","bio":"After graduating from both the University of Pennsylvania and The Neighborhood Playhouse in New York, where he studied with the legendary Sanford Meisner, Mr. Buica went on to work at length with Michael Chekhov's associate George Shdanoff, Uta Hagen and master teacher Michael Howard. Mr. Buica has been coaching and teaching actors since 1991, leading workshops in the Grotowski, Michael Chekhov and Meisner approaches in Malibu, Los Angeles, Bucharest, Beijing, Munich, and New York. As Artistic Director and Founder of The Acting Corps, Mr. Buica originated and implemented unique training processes reflected in the Actors' Boot Camp and all the other programs at The Acting Corps. The Acting Corps has, as of 2012, trained 4000 actors with 1400 of them acquiring film and TV credits now appearing with their own IMDB pages after attending The Actors' Boot Camp. Guest Speakers at The Acting Corps On Acting series have included, Academy Award winning filmmaker and actor Sydney Pollack, Peter Facinelli, Ethan Embry and Rainn Wilson, who also taught acting at The Acting Corps' Actor's Boot Camp. As a result of The Acting Corps's growing prominence, Mr. Buica, alongside Whoopi Goldberg and Dennis Franz, was asked to judge TNT's Dramatic Auditions National Competition. TNT then selected The Acting Corps to train the winner of its National Competition. Studios. Mr. Buica has also written and directed for the theater. Most notably Parachute, a play in which he also starred, won accolades from the Los Angeles Times for its debut production at Hollywood's Theater East. Over the course of his career, Mr. Buica has appeared in films, television shows, film commercials and also extensively on reality TV shows as an acting guru. Mr. Buica has acted in over 50 Stage productions. Starring roles include The Sound of Music on Broadway, Coriolanus at Princeton's McCarter Theater, as well as a starring role in his own adaptation of The Swan at Lincoln Center. Mr. Buica recently launched the grand opening of The Acting Corps in house stage, The Americano Theater with an inaugural production of David Mamet's Speed The Plow directed by Acting Corps faculty member, Sydney Walsh and featuring faculty colleagues Corey Sorenson and Sage Howard. along with Mr. Buica. His book, 90 Days of Rants, Observations, and Meditations for The Actor is due to appear in November of 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMzNTUyOTI4MV5BMl5BanBnXkFtZTcwOTcxMjk2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1042671","name":"Eugene Buica","idIMDB":"nm1042671"},"actorId":"nm1042671","character":"Mustapha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thao Nguyen","urlProfile":"http://www.imdb.com/name/nm0629093","urlPhoto":"","biography":{"bio":"Thao Nguyen is an actress, known for Legally Exposed (1997), True Vengeance (1997) and Playboy: Asian Exotica (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0629093","name":"Thao Nguyen","idIMDB":"nm0629093"},"actorId":"nm0629093","character":"Mummy Goddess","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Sane","urlProfile":"http://www.imdb.com/name/nm2567977","urlPhoto":"","biography":{"bio":"Justin Sane is an actor, known for Legally Exposed (1997), Click (1997) and City Guys (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2567977","name":"Justin Sane","idIMDB":"nm2567977"},"actorId":"nm2567977","character":"First Grave Robber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kira Reed Lorsch","urlProfile":"http://www.imdb.com/name/nm0715529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTk1MDMyMF5BMl5BanBnXkFtZTgwMTM4MjY4NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1971","placeOfBirth":" Santa Clara, California, USA","birthName":"Kira Katherine Reed","height":"5' 3\" (1.6 m)","bio":"Kira Reed Lorsch is an actress, television host and sex symbol who has been writing and producing reality programming since 2002. After graduating UCLA's School of Theatre Film and Television, she enjoyed a prolific on-camera career including feature films, guest spots on major network shows and a seven-year stint as a series regular reporter for Playboy TV's Sexcetera (1998). Her work with the bunny led her to writing and producing for Playboy, E! and Eleventh Day Entertainment. She has also served as writer and Supervising Producer on the travel reality series 69 Sexy Things 2 Do B4U Die (2008). Kira continues to work in front of the camera as an entertainment reporter for The Daytime Emmy Awards, The Hollywood Christmas Parade and The Hero Dog Awards. She joined the cast of the Emmy nominated The Bay as Jo Connors in 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTk1MDMyMF5BMl5BanBnXkFtZTgwMTM4MjY4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0715529","name":"Kira Reed Lorsch","idIMDB":"nm0715529"},"actorId":"nm0715529","character":"Dominique","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Coppola","urlProfile":"http://www.imdb.com/name/nm0178917","urlPhoto":"","biography":{"bio":"Scott Coppola is an actor, known for The Erotic Misadventures of the Invisible Man (2003), The Night That Never Happened (1997) and The Escort (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0178917","name":"Scott Coppola","idIMDB":"nm0178917"},"actorId":"nm0178917","character":"Hermes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Renee Thompson","urlProfile":"http://www.imdb.com/name/nm0860718","urlPhoto":"","biography":{"dateOfBirth":"27 August 1979","placeOfBirth":" El Paso, Texas, USA","bio":"Renee Thompson was born on August 27, 1979 in El Paso, Texas, USA. She is an actress and producer, known for You Only Live Until You Die (1997), Passion and Romance: Ocean of Dreams (1997) and The Rowdy Girls (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0860718","name":"Renee Thompson","idIMDB":"nm0860718"},"actorId":"nm0860718","character":"Gwendolyn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Giavocchini","urlProfile":"http://www.imdb.com/name/nm0316428","urlPhoto":"","biography":{"bio":"Tommy Giavocchini is an actor, known for U.F.O. Abduction (1989), Interviewing Norman (2005) and The Wedding Video (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0316428","name":"Tommy Giavocchini","idIMDB":"nm0316428"},"actorId":"nm0316428","character":"Baxter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bo Zena","urlProfile":"http://www.imdb.com/name/nm0954811","urlPhoto":"","biography":{"bio":"Bo Zena is an actress, known for Dangerous Invitation (1998), Passion and Romance: Strange Desire (2002) and Legally Exposed (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0954811","name":"Bo Zena","idIMDB":"nm0954811"},"actorId":"nm0954811","character":"Francesca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gina Garcia","urlProfile":"http://www.imdb.com/name/nm0752561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMDAwMDQ5MV5BMl5BanBnXkFtZTgwNzk2NjM5ODE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1976","placeOfBirth":" USA","height":"5' 9\" (1.75 m)","bio":"Gina Garcia was born on July 29, 1976 in the USA. She is known for her work on Mission: Impossible III (2006), 2012 (2009) and Criminal Minds (2005). She has been married to Kevin Sharp since October 8, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMDAwMDQ5MV5BMl5BanBnXkFtZTgwNzk2NjM5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752561","name":"Gina Garcia","idIMDB":"nm0752561"},"actorId":"nm0752561","character":"Ina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Duke Blackburn","urlProfile":"http://www.imdb.com/name/nm1068704","urlPhoto":"","biography":{"bio":"Duke Blackburn is an actor, known for The Erotic Misadventures of the Invisible Man (2003), Legally Exposed (1997) and Click (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1068704","name":"Duke Blackburn","idIMDB":"nm1068704"},"actorId":"nm1068704","character":"Kraxen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Roberts","urlProfile":"http://www.imdb.com/name/nm0730838","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NTk1OTc2OF5BMl5BanBnXkFtZTgwODU0NTE0MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1938","placeOfBirth":" New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Arthur Roberts first fell in love with acting starring as Crichton in The Admirable Crichton at Fieldston, his New York City high school. The most beautiful girls in the class surrounding him after the curtain fell didn't hurt either!!! While Dean's List and on scholarship at Harvard, he found acting far more fun than studying pre-med - he thought, \" if I can just get them to pay me to do this...\" So off he went to learn his craft with the Harvard Summer Players with Faye Dunaway and Jane Alexander, and then Summer Stock all over the East Coast. At the Hampton Playhouse in New Hampshire, they paid $27 a week, which covered room and board. He then played the title roles in Mr. Roberts and Poor Richard in Pennsylvania, won the Barter Theatre award in a big New York competition for the famous Barter Theatre Virginia, did Streetcar Named Desire in Connecticut and Barefoot in the Park in Michigan, and starred in Neil Simon in Winter Rep in Buffalo and Pinter in Princeton. He got his Equity card playing in Othello with James Earl Jones and the New York Shakespeare Festival in Central Park. During all this, he got an MBA at NYU (a fallback option which thankfully he never used) with a prize-winning thesis \" On Why Good TV Series Stop Production and Go Off the Air.\" The prize money helped buy his first Chevy convertible, which he then drove down to Ft. Lauderdale, Florida to play the third lead, Lord Henry Darnley, husband and King to Inga Swenson's \"Mary,\" Queen of Scots in a pre-Broadway musical tryout. He then had a strong New York run playing Hank with the original cast of The Boys in the Band, starred on Broadway in the Tony-winning Borstal Boy, and won wide critical acclaim from all the New York critics as Karenin in Anna Karenina. On matinee days of Borstal Boy, he took great natural light headshots of fellow cast members with his Nikon and lifted his portrait photography hobby to a professional level. He starred in a wide range of intriguing independent films, enjoyed a run on the soap Secret Storm, did numerous commercials and print modeling for Wilhelmina. He sailed thru a Nova Scotia storm for Maxim Coffee - because he, the director and the DP were on deck sailing through rain, wind and storm, they were fine; the poor ad agency folk who mistakenly stayed below became quite seasick. Bodybuilding took him to walk the Bahamas beaches with a gorgeous bikini blonde for Bahamas Tourist Board TV and print ads. After traveling to Mexico, Greece and Europe, he came to LA in 1974 and soon guest starred in Starsky and Hutch, Barnaby Jones, The Rockford Files and enjoyed a run on General Hospital as James Duvall, the scientist who invented the Ice Princess at the height of the Luke and Laura excitement. He pitched for the General Hospital softball team and played celebrity tennis. Playing the title role in Not of This Earth proudly got him into The Academy of Motion Picture Arts and Sciences in 1988. This and other films, among them Revenge of the Ninja, rent worldwide and give him international recognition, as do the reruns of his many TV shows. He was a regular on the Lorenzo Lamas series Air America in 1998 -- 1999. He continues to work all over the world, shooting Gargoyle with Jim Wynorski in Bucharest, Romania, Hammerhead with William Forsythe and Hunter Tylo for Avi Lerner Nu Image six weeks in Bulgaria in 2004, the Nissan Versa product launch in Canada in 2006 and a commercial for Labatt's Canadian beer that was cast in LA and shot in Prague, Czech Republic -- go figure -- in 2007. On LA stages he has starred at the Mark Taper Forum, Los Angeles Theatre Center, and as Prospero in Shakespeare's The Tempest, a huge workout... it took five weeks to learn all the words. His most colorful recent credit was the sublime pleasure of working opposite Blythe Danner in \" I'll See You in My Dreams,\" Clips from that outrageous scene lead off his comedy demo reel. All the words were taken from a real-life speed dating situation A strong believer in the Greek ideal of mens sana in corpore sano - a sound mind in a sound body, he enjoys weight workouts, swimming, tennis, basketball, biking and hiking and absolutely loves playing beach volleyball in Manhattan Beach and Santa Monica. Often his group is the last one standing, the only people playing volleyball as far you can see up and down the beach, stopping only when it gets too cold or too dark, whichever comes first. An avid swimmer, he ran camp waterfronts in Maine during college summers and remembers the adventure of saving a sailor who overturned his catamaran in the Atlantic Ocean off Fire Island and was out way past where lifeguards would go... they said \" if you get in trouble out there, you're on your own... we won't come get you!!\" Arthur loves traveling and taking pictures on photo safaris to Kenya and Tanzania in 1999, in Thailand, Vietnam, and Hong Kong in 2000, Prague in 2007, a grand tour of China in 2008 - the Great Wall and shooting the Yangtze River Cruise were his favorites. Since then he toured Peru , Morocco, the Greek islands, Portugal and Spain. His absolute favorite for scenic photos was multi-colorful Italy: the Mediterranean hill towns of Cinque Terre and the incomparable experience of Venice. He has shared with his good friend and manager Phil Brock his love of framing and hanging the very best of his travel photos on the wall - so you live with your own self-made art. He loves cameras and helps friends pick out which one best to buy. He has taught Actors' Survival - How to Earn Your Living Acting -- at UCLA and Santa Monica College and enjoys giving powerful private coaching.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NTk1OTc2OF5BMl5BanBnXkFtZTgwODU0NTE0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0730838","name":"Arthur Roberts","idIMDB":"nm0730838"},"actorId":"nm0730838","character":"Elwood Brimstone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leigh Ann Garrett","urlProfile":"http://www.imdb.com/name/nm3214992","urlPhoto":"","biography":{"bio":"Leigh Ann Garrett is an actress, known for Legally Exposed (1997) and Click (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3214992","name":"Leigh Ann Garrett","idIMDB":"nm3214992"},"actorId":"nm3214992","character":"Ashley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vanessa Shaeffer","urlProfile":"http://www.imdb.com/name/nm1082340","urlPhoto":"","biography":{"bio":"Vanessa Shaeffer is an actress, known for Legally Exposed (1997), Click (1997) and Butterscotch (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1082340","name":"Vanessa Shaeffer","idIMDB":"nm1082340"},"actorId":"nm1082340","character":"Transformed Ashley","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0820369","urlIMDB":"http://www.imdb.com/title/tt0820369","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":null,"color":null,"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.1","filmingLocations":[],"awards":[],"votes":"29","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"Click","id":"tt0300745"},"season":"Season 1","episode":"Episode 4"},"companyCreditsSimple":[{"idCompany":"co0035015","name":"Alain Siritzky Productions"}],"keywords":{"keywords":["thong","sex with coworker","sex machine","sex comedy","sequel","paralegal","mummy","law office","death","bondage","dominatrix"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:35:58"}}