{"data":{"movies":[{"title":"Star Trek: Of Gods and Men","originalTitle":"","year":"2007","releaseDate":"20071222","directors":[{"name":"Tim Russ","id":"nm0750913"}],"writers":[{"name":"Gene Roddenberry","id":"nm0734472"},{"name":"Sky Douglas Conway","id":"nm2124026"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWE3NzYxZGYtYmM0Ni00ZmZiLWExODktYzM3MjIzMDU0Y2ZlXkEyXkFqcGdeQXVyNjMwNTM0OTM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"It is the year 2306. Thirteen years have passed since Captain James T. Kirk was swept away by the Nexus, after saving the crew of the Enterprise-B. The remaining crew members of the original USS Enterprise have gone their separate ways. Captain Nyota Uhura and Captain Pavel Chekov, along with Captain John Harriman of the Enterprise-B, come together for a special dedication in honor of Kirk's Enterprise. Their reunion is cut short when they receive a distress call from a mysterious planet, that presses the three friends to embark on a mission that will change their lives forever.","simplePlot":"It is the year 2306. Thirteen years have passed since Captain James T. Kirk was swept away by the Nexus, after saving the crew of the Enterprise-B. The remaining crew members of the ... ","actors":[{"actorName":"Walter Koenig","urlProfile":"http://www.imdb.com/name/nm0000479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk1Mzc4NTU0M15BMl5BanBnXkFtZTcwNTk2ODY5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1936","placeOfBirth":" Chicago, Illinois, USA","birthName":"Walter Marvin Koenig","height":"5' 6\" (1.68 m)","bio":"Walter Koenig has had a recurring role of the quintessential scoundrel Bester on the television series Babylon 5 (1994). He has been the \"Special Guest Star\" in twelve episodes and, at the end of the third season, the production company applied for an Emmy nomination on his behalf. He once again plays Bester in the spin-off series Crusade (1999). He has also appeared on dozens of other television series and as Pavel Chekov in the original Star Trek (1966) series. Koenig recreated the character of the Russian navigator for the first seven Star Trek films and took the leading role in the video feature, Moontrap (1989). In an interactive state-of-the-art video game from Digital Pictures called Maximum Surge (1996), Koenig starred as Drexel, another scoundrel. Walter completed worked in the low budget feature film Drawing Down the Moon (1997) from Chaos Productions. And has star billing as a German psychologist in the martial arts picture, Sworn to Justice (1996). A one character piece that Koenig wrote and performed entitled \"You're Never Alone when You're a Schizophrenic\" was a finalist in the 1996 New York Film Festival awards. Koenig filmed a guest appearance as himself on the CBS situation comedy Almost Perfect (1995), did sketch comedy on the Comedy Central series \"Viva Variety\" (1996) and performed on an ESPN sports commercial that aired in the spring of 1998. The Viacom CD-Rom, Star Trek: Starfleet Academy (1997) in which he reprised the character of Chekov continues to sell impressively. Walter also hosted a cult movie marathon for Comedy Central. It played once a week for the course of a month. Koenig's autobiography, \"Warped Factors - A Neurotic's Guide to the Universe\" was released through Taylor Publishing on April 1, 1998. The audio tape reading of the book by the author has been released through Dove Video in January 1999. Koenig performed as the Shadow Guy in an episode of Diagnosis Murder (1993) and went to New York to perform in a new radio broadcast version of \"War of the Worlds\" in tribute to both H.G. Wells and Orson Welles. From \"The Girls of Summer\" to \"The Boys in Autumn\", Koenig's stage career spans thirty years and includes stops in New York with \"A Midsummer Night's Dream\" (Quince) and \"Six Characters in Search of an Author\" (Oldest Son). In Chicago, he guested in \"Make a Million\" (Johnny) opposite Jackie Coogan and on the road -- from Arizon to Philadelphia -- Mark Lenard (Sarek: Spock's father) and he performed in the short plays \"Box and Cox\" (Box) and \"Actors\" (Dave). They also toured in a two character play, \"The Boys in Autumn\", the comedy-drama about the reunion of Tom Sawyer and Huck Finn forty years later. By himself, Koenig also starred as Larry the Liquidator in \"Other People's Money\" in Reno, Nevada. His Los Angeles productions include \"Steambath\" (God), \"The White House Murder Case\" (Captain Weems), \"Night Must Fall\" (Danny), \"La Ronde\" (Gentleman), \"The Typist and the Tiger\" (Paul), and \"The Deputy\" (Jacobson) among almost two dozen others (\"Blood Wedding\", \"The Collection\", et al.). Directorial credits include \"Hotel Paradiso\" for Company of Angles, \"Beckett\" for Theatre 40, \"America Hurrah!\" at the Oxford Theater, \"Twelve Angry Men\" at the Rita Hayworth Theatre, \"Matrix\" at the Gascon Theatre Institute, and \"Three by Ten\" at Actor's Alley. Walter has performed in the television movies Antony and Cleopatra (1984) (Pompey) opposite Timothy Dalton and Lynn Redgrave as well as the MOW's Goodbye, Raggedy Ann (1971) and The Questor Tapes (1974). Walter has written for the television series The Powers of Matthew Star (1982), What Really Happened to the Class of '65? (1977), Family (1976), Land of the Lost (1974), and the animated Star Trek: The Animated Series (1973) series. This actor-writer has seen publication with the non-fiction \"Chekov's Enterprise\" and the satiric fantasy novel \"Buck Alice and the Actor-Robot\". He also created the three issues of the comic book story \"Raver\" published by Malibu Comics. Koenig has taught classes in acting and directing privately at UCLA, The Sherwood Oaks Experimental Film College and at the California School of Professional Psychology. Most recently, he has been an instructor at the Actor's Alley Repertory Company in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk1Mzc4NTU0M15BMl5BanBnXkFtZTcwNTk2ODY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000479","name":"Walter Koenig","idIMDB":"nm0000479"},"actorId":"nm0000479","character":"Captain Pavel Chekov","urlCharacter":"http://www.imdb.com/character/ch0001534","main":true},{"actorName":"Nichelle Nichols","urlProfile":"http://www.imdb.com/name/nm0629667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4OTUxMTU0OV5BMl5BanBnXkFtZTYwNzY4OTc2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1932","placeOfBirth":" Robbins, Illinois, USA","birthName":"Grace Nichols","height":"5' 5\" (1.65 m)","bio":"Nichelle Nichols was born Grace Nichols on December 28, 1932 in Robbins, Illinois. She began her show business career at age 16 as a singer with Duke Ellington in a ballet she created for one of his compositions and later sang with his band. After switching to acting, she was twice nominated for the Sarah Siddons Award for best actress in \"The Blacks\" and \"Kicks and Company\". Her film debut found her dancing with Sammy Davis Jr. in Porgy and Bess (1959). A guest appearance on The Lieutenant (1963) led to an offer from Gene Roddenberry to join the cast of Star Trek (1966). Her best known role on the series is communications officer Lieutenant Nyota Uhura. She later repeated her role in a string of successful Star Trek films: Star Trek: The Motion Picture (1979), Star Trek II: The Wrath of Khan (1982), Star Trek III: The Search for Spock (1984), Star Trek IV: The Voyage Home (1986), Star Trek V: The Final Frontier (1989), and Star Trek VI: The Undiscovered Country (1991). Invited to join the board of directors of the National Space Institute, NASA asked her to participate in its astronaut recruitment programme for the space shuttle project. Three of her recruits were on the ill-fated Challenger mission. For her work, she received NASA's distinguished Public Service Award. She has a consultant firm, Women in Motion Inc. through which she produced and starred in the Smithsonian Institution's National Air and Space Museum film \"What's in It for Me?\". With all this, she has not neglected her singing making a series of video albums the latest being \"Nichelle Nichols: Live at Disneyland\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4OTUxMTU0OV5BMl5BanBnXkFtZTYwNzY4OTc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629667","name":"Nichelle Nichols","idIMDB":"nm0629667"},"actorId":"nm0629667","character":"Captain Nyota Uhura","urlCharacter":"http://www.imdb.com/character/ch0001462","main":true},{"actorName":"Alan Ruck","urlProfile":"http://www.imdb.com/name/nm0001688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTc0NDE2MF5BMl5BanBnXkFtZTcwMzQzNzQzMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1956","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Alan Douglas Ruck","height":"6' (1.83 m)","bio":"Alan Ruck was born on July 1, 1956 in Cleveland, Ohio, and has made over 100 appearances in films and television, and on stage. He is best known for his role as the friend of Matthew Broderick and hopeless hypochondriac Cameron Frye, in John Hughes's Ferris Bueller's Day Off (1986). During the 1980s he appeared in films such as Class (1983) with Rob Lowe and Andrew McCarthy and Three for the Road (1987) with Charlie Sheen. The 1990s included Young Guns II (1990) with Emilio Estevez and Lou Diamond Phillips, Star Trek: Generations (1994), Speed (1994) with Keanu Reeves and Twister (1996) (the latter two films are directed by Jan de Bont). Ruck's television appearances include Tales from the Crypt (1989) opposite Lou Diamond Philips, Mad About You (1992) with Helen Hunt (his co-star in Twister), and Spin City (1996) with Michael J. Fox. Ruck made an appearance in the HBO miniseries From the Earth to the Moon (1998) which reunited him with his Twister co-star Cary Elwes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTc0NDE2MF5BMl5BanBnXkFtZTcwMzQzNzQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001688","name":"Alan Ruck","idIMDB":"nm0001688"},"actorId":"nm0001688","character":"Captain John Harriman","urlCharacter":"http://www.imdb.com/character/ch0001477","main":true},{"actorName":"Garrett Wang","urlProfile":"http://www.imdb.com/name/nm0910897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDQ1NzU0MF5BMl5BanBnXkFtZTcwODM2MjIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1968","placeOfBirth":" Riverside, California, USA","birthName":"Garrett Richard Wang","height":"5' 11\" (1.8 m)","bio":"Garrett Richard Wang was born on December 15, 1968 in Riverside, California to Chinese immigrant parents. He and his sister Laura spent their childhood on the move. He lived in Indiana, then moved to Bermuda and finally to Tennessee. Later, he graduated from Harding Academy High School, Memphis, and moved to Los Angeles to attend UCLA where he majored in Asian studies. UCLA theater professor Jenny Roudtree inspired him to pursue an acting career. His first acting performance outside College was the portrayal of \"John Lee\" in the lead role of Chay Yew's \"Porcelain\" at the burbage theater. Later, he continued to perform onstage such as \"Model Minority\", \"Woman Warrior\" and \"A Language Of Our Own\". He made his TV debut in 1994 as a guest star on the pilot episode of comedy All-American Girl (1994). One year later, he got the part of \"Ensign Harry Kim\" on Star Trek: Voyager (1995) where he appeared on television regularly for 7 years. Later, in 1997, Wang was named one of People Magazine's 50 most beautiful people in the world. Also E! Entertainment Television has named Garrett as one of the \"20 Coolest Bachelors\" in the country. His television experience also includes roles in a variety of movies including Flesh Suitcase (1995), Angry Cafe (1995), Ivory Tower (1998), Hundred Percent (1998), Survival Island (2002), among others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDQ1NzU0MF5BMl5BanBnXkFtZTcwODM2MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910897","name":"Garrett Wang","idIMDB":"nm0910897"},"actorId":"nm0910897","character":"Commander Garan","urlCharacter":"http://www.imdb.com/character/ch0076229","main":true},{"actorName":"William Wellman Jr.","urlProfile":"http://www.imdb.com/name/nm0920041","urlPhoto":"","biography":{"dateOfBirth":"20 January 1937","placeOfBirth":" Los Angeles, California, USA","bio":"Rangy, sturdy-looking actor William Wellman Jr., was born in Los Angeles on January 20, 1937, one of seven children born to legendary director William A. Wellman and his fourth wife, one-time actress Dorothy Coonan Wellman, who appeared in a few of her husband's pictures. Bill Jr. spent most of his childhood surrounded by Hollywood celebrity. He got the fresh taste of a film set as a youngster when he appeared unbilled in a couple of his father's features. Following graduation, he attended Duke University but eventually abandoned that direction for a career in the movies. Starting off in featured parts in the war pictures Lafayette Escadrille (1958) and Darby's Rangers (1958), both of which directed by his father, Bill Jr. found other work on his own in less quality films. Some of the teen exploitation he found himself in have since attained cult status, including High School Confidential! (1958), La sorcière noire (1960) and College Confidential (1960). \"Billy Jack\" director Tom Laughlin also began using Bill prominently in his early work such as Like Father, Like Son (1961) [The Young Sinner] and The Born Losers (1967). In sparser times he managed to find some unbilled bits in several of Jerry Lewis's film slapstick of the 1960s, and fell in with the party crowd in A Swingin' Affair (1963), Winter A-Go-Go (1965) and A Swingin' Summer (1965). His TV career kicked in as the 1960s approached with a number of rugged guest roles on such established westerns as \"Have Gun, Will Travel,\" \"Rawhide,\" \"Laramie\" and \"Gunsmoke.\" In later years, Bill found work in a few more cult classics, including Black Caesar (1973), It's Alive (1974), and Laughlin's \"Billy Jack\" sequels. Establishing himself as a solid character actor, he took the lead in the apocalypse thrillers Image of the Beast (1980) and The Prodigal Planet (1983), the latter featuring daughter Cathy Wellman. While the quality of a number of his films over the years are certainly suspect, Bill has managed longevity and durability in a very difficult business. Moreover, he is credited with nearly 200 movies and television shows, 17 stage productions and some 200 commercial and industrial films. In addition to his acting work, his nearly 50-year career includes writing and producing efforts. He has occasionally appeared as a guest lecturer and has been active at autograph conventions. Of his many siblings, sister Cissy Wellman has also established herself on stage, film and TV.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0920041","name":"William Wellman Jr.","idIMDB":"nm0920041"},"actorId":"nm0920041","character":"Charlie Evans","urlCharacter":"http://www.imdb.com/character/ch0001613","main":true},{"actorName":"J.G. Hertzler","urlProfile":"http://www.imdb.com/name/nm0381117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDcyNTUzNl5BMl5BanBnXkFtZTcwOTAwNDA0NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1950","placeOfBirth":" Savannah, Georgia, USA","birthName":"John Garman Hertzler","height":"6' 0½\" (1.84 m)","bio":"J.G. Hertzler was born on March 18, 1950 in Savannah, Georgia, USA as John Garman Hertzler. He is an actor and writer, known for General Hospital (1963), Pirates of Silicon Valley (1999) and Dead Space (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDcyNTUzNl5BMl5BanBnXkFtZTcwOTAwNDA0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0381117","name":"J.G. Hertzler","idIMDB":"nm0381117"},"actorId":"nm0381117","character":"Koval","urlCharacter":"http://www.imdb.com/character/ch0074043","main":true},{"actorName":"Gary Graham","urlProfile":"http://www.imdb.com/name/nm0334048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjU1NjcxOV5BMl5BanBnXkFtZTcwNjg4ODY0Mg@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1950","placeOfBirth":" Long Beach, California, USA","height":"5' 10\" (1.78 m)","bio":"Gary Graham was born on June 6, 1950 in Long Beach, California, USA. He is an actor and producer, known for Robot Jox (1989), Alien Nation (1989) and All the Right Moves (1983). He is married to Becky. He was previously married to Susan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjU1NjcxOV5BMl5BanBnXkFtZTcwNjg4ODY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0334048","name":"Gary Graham","idIMDB":"nm0334048"},"actorId":"nm0334048","character":"Ragnar","urlCharacter":"http://www.imdb.com/character/ch0076230","main":true},{"actorName":"Tim Russ","urlProfile":"http://www.imdb.com/name/nm0750913","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mjk5MDQ0NF5BMl5BanBnXkFtZTcwMzE3MjkwOQ@@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1956","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Timothy Darrell Russ","height":"6' (1.83 m)","bio":"Timothy Darrell Russ was born on June 22, 1956, in Washington, D.C., to Air Force officer Walt and his wife Josephine. He and his younger siblings Michael and Angela grew up on several military bases, including Niagara Falls, Elmendorf (Alaska) AFB, Omaha, Taiwan, Philippines and Turkey. During these moves around the world, he graduated from Izmir High School in Turkey, and received his diploma from Rome Free Academy in Rome, New York. Afterwards he attended Saint Edwards University and earned a B.S. in Theater Arts but continued his studies with a full scholarship to continue theater studies at Illinois State University. His first professional job came while he was at St. Edward's University in Austin, when he appeared in a PBS Masterpiece Theater production, but he started to pursue acting full time in 1985. During that time he's been on many TV shows and movies - including The Twilight Zone (1985), Amazing Stories (1985), Thirtysomething (1987), Jake and the Fatman (1987), 21 Jump Street (1987), Beauty and the Beast (1987), The People Next Door (1989), Mancuso, FBI (1989), Family Matters (1989), The Fresh Prince of Bel-Air (1990), Tequila and Bonetti (1992), SeaQuest 2032 (1993), Dark Justice (1991), Murphy Brown (1988), Monty (1994), Star Trek: Voyager (1995), Melrose Place (1992), Any Day Now (1998), The Highwayman (1987), Star Trek: The Next Generation (1987) and Star Trek: Deep Space Nine (1993), among others. Along with his television experience he has also played in a variety of films, including Crossroads (1986), Fire with Fire (1986), Timestalkers (1987), Spaceballs (1987), Death Wish 4: The Crackdown (1987), Pulse (1988), Bird (1988), Roots: The Gift (1988), Eve of Destruction (1991), Dead Silence (1997), Night Eyes II (1991), Mr. Saturday Night (1992), Star Trek: Generations (1994), Dead Connection (1994), East of Hope Street (1998). During his comprehensive acting career he appeared in numerous theatrical productions including \"Romeo & Juliet\", \"Barrabas\", \"Dream Girls\", \"As You Like It\", \"Twelfth Night\", \"Cave Dwellers\" among others. When not acting, Russ finds time for music and film producing. Songs sung by Tim Russ are available on the CDs \"Only a Dream in Rio\", \"Tim Russ\", \"Kushangaza\" and \"Brave New World\". He lives in the area of Los Angeles where his whole family resides.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mjk5MDQ0NF5BMl5BanBnXkFtZTcwMzE3MjkwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0750913","name":"Tim Russ","idIMDB":"nm0750913"},"actorId":"nm0750913","character":"Tuvok","urlCharacter":"http://www.imdb.com/character/ch0001528","main":true},{"actorName":"Chase Masterson","urlProfile":"http://www.imdb.com/name/nm0135895","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODMzMDc5MV5BMl5BanBnXkFtZTgwNTU2MTQ4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1963","placeOfBirth":" Colorado Springs, Colorado, USA","birthName":"Christianne Carafano","height":"5' 7\" (1.7 m)","bio":"Chase Masterson (born February 26, 1963 in Colorado Springs, Colorado) is perhaps best known as sexy casino girl \"Leeta\" on Star Trek: Deep Space Nine (1993) and \"Ivy Lief\" on General Hospital (1963), as well as being the featured guest star in the first Emmy Award-winning episode of ER (1994). Masterson was named one of the \"Hot Leading Ladies\" of Film in 2008 by \"Film Fetish\", one of the world's \"50 Sexiest Women\" by \"Femme Fatales Magazine\", the \"#1 Favorite Science Fiction Actress on Television\" in a \"TV Guide\" online readers poll, and one of the \"Top 20 People to Watch in Hollywood\" by \"Sci-Fi Universe Magazine\". She was also named \"Best Feature Film Producer\" by the LA Femme Film Festival for her work on Yesterday Was a Lie (2008). Masterson got her start as a child actress, singer, and dancer in Texas. After several theatre and film roles in her youth and teen years, she got her first big break in lead roles in the low budget thrillers In a Moment of Passion (1993) and Married People, Single Sex (1994) as well as Sacré Robin des Bois (1993) (in which she played Richard Lewis' girlfriend). Masterson originally auditioned for the one-time guest role of Jake Sisko's girlfriend \"Mardah\" in a 1994 episode of Star Trek: Deep Space Nine (1993), but was told that she was a bit too old to be romantically involved with the teenage Jake character. Director Avery Brooks has subsequently indicated at Trek conventions that he held off casting her because he \"didn't want [his] character's son to be with someone so sexy\", and that he hoped she would be brought on as a regular cast member (perhaps as a love interest for himself). The role of \"Leeta\" was then written for her (although she was apparently still required to audition for it), and she remained in the role for the final five years of the series' run. Prominent film roles include \"J.A.N.I.C.E. Em\" in Robotech: The Shadow Chronicles (2006) and the \"Singer\" in Yesterday Was a Lie (2008). Masterson hosted Sci-Fi Entertainment (1998) for the Syfy Channel in the 1990s and an Internet-based radio talk show for the website The Fandom in 2004-2005. She has also hosted \"Showtime: Nighttime\" and Encore's \"Starz On Demand\", and guest-hosted CNet Central (1996) and NBC's Saturday Night at the Movies (1974). Masterson is also a singer of jazz/torch songs and has received positive reviews for her music from magazines such as \"Film Score Monthly\" and \"Entertainment Today\". She has performed in USO tours for the Navy and the Marine Corps. Masterson has been actively involved in numerous charities worldwide, including Caring for Babies With AIDS, Homeboy Industries, Iris Ministries, and Youth With a Mission, and founded the G.E.N.I.U.S. charity umbrella organization which is supported by her licensed fan club. She donated proceeds from sales of a photo collection to the organization Operation Call Home, supplying phone cards to U.S. troops. Following a series of stalking incidents instigated by a man in Berlin, Masterson was the plaintiff in a highly controversial legal case in which the Ninth Circuit Court of Appeals ruled that user-account-based websites constitute \"interactive computer services\" under the Communications Decency Act and are therefore not liable for information published on them. The court also ruled that public figures are not entitled to the same privacy protection online as other individuals. The case precedent has since been used to indemnify websites such as Craigslist when used to advertise illegal services. Masterson also served as executive producer on the documentary film Through Your Eyes (2007) (about the world's only deaf-blind triplets) and has optioned the rights to the HarperCollins novel The Camel Bookmobile.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODMzMDc5MV5BMl5BanBnXkFtZTgwNTU2MTQ4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0135895","name":"Chase Masterson","nicknames":["Leeta"],"idIMDB":"nm0135895"},"actorId":"nm0135895","character":"Xela","urlCharacter":"http://www.imdb.com/character/ch0090162","main":true},{"actorName":"Daamen J. Krall","urlProfile":"http://www.imdb.com/name/nm0469411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5ODcyNjE0M15BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1951","placeOfBirth":" Los Angeles, California, USA","bio":"Daamen J. Krall was born on October 20, 1951 in Los Angeles, California, USA. He is known for his work on The Nightmare Before Christmas (1993), Garfield (2004) and Lilo & Stitch (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5ODcyNjE0M15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0469411","name":"Daamen J. Krall","idIMDB":"nm0469411"},"actorId":"nm0469411","character":"Gary Mitchell","urlCharacter":"http://www.imdb.com/character/ch0001603","main":true},{"actorName":"Crystal Allen","urlProfile":"http://www.imdb.com/name/nm1296597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzkzMDcyMF5BMl5BanBnXkFtZTgwODM5ODA1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1972","placeOfBirth":" Orange County, California, USA","height":"5' 8\" (1.73 m)","bio":"Crystal Allen was born in California where she now resides, however she was raised in Camrose in Alberta Canada. With dual Canadian/American citizenship, she has landed many leading roles. \"Crooked Arrows'\"opposite Brandon Routh and \"Ghost Storm\" with Carlos Bernard, both to be released in spring of 2012. Allen has also starred in the latest two sequels to their already hit films Anaconda which have just been released. In Anaconda 3 & 4, Allen stars in the lead role of Dr Amanda Hayes, a scientist having to fight for what she believes in while holding firm to her integrity in these action packed sequels. She is also know for her portrayal of the \"Orion Slave Girl D'nesh\" on Startrek Enterprise and as \"Navigator Yara\" in the popular independent film. \"Of Gods and Men\". Allen's additional notable performances were on hit TV shows such as Haven, Prison Break, Desperate Housewives, Boston Legal, Enterprise, Navy NCIS, Modern Men, Sex and the City, Sopranos, ED, and the feature film Maid in Manhattan. Allen was also well received as the lead in the Hallmark movie \"Falling in Love with the Girl Next Door. One may also affectionately remember Allen as the Tic Tac spokes woman a few years back. Previous to making her mark on screen, Allen studied dance for many years in NYC which then brought her to Japan and Monte Carlo. Her modeling career took her to Greece, London, Germany, and South Africa before ending back in NYC where she studied acting at the Lee Strasberg Institute. It's her love and commitment to the roles she plays which keeps Allen focused and successful which is evident in her short film festival hits \"Comic Con\" and \"Lake Arrowhead\". Then there are the Crystal Allen's dinner parties where she shines in her passion for cooking up elaborate meals to host a wonderful evening with the most interesting group of friends from all over the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzkzMDcyMF5BMl5BanBnXkFtZTgwODM5ODA1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1296597","name":"Crystal Allen","idIMDB":"nm1296597"},"actorId":"nm1296597","character":"Conqueror Navigator Yara","urlCharacter":"http://www.imdb.com/character/ch0094505","main":true},{"actorName":"Ethan Phillips","urlProfile":"http://www.imdb.com/name/nm0680392","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0Mzk3MzUxOV5BMl5BanBnXkFtZTgwMzIxMjU4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1955","placeOfBirth":" Garden City, Long Island, New York, USA","height":"5' 6\" (1.68 m)","bio":"Ethan Phillips was born on February 8, 1955 in Garden City, Long Island, New York as the only boy of six children. He graduated from Boston University with a degree in English Literature and received a Masters Degree in Fine Arts from Cornell University. He began his acting career on stage in both Broadway and off-Broadway shows, recently appearing in the premier of David Mamet's \"November\" with Nathan Lane at Broadway's Ethyl Barrymore and in the title character opposite Peter Dinklage in the all-male cast of \"The Imaginary Invalid\" for Bard College's SummerScape Festival 2012. Also in New York, \"My Favorite Year\" at Lincoln Center, \"Measure for Measure\" for the NYSF, \"Lips Together Teeth Apart\" for Manhattan Theatre Club, and \"Modigliani\" at the Astor Place, as well as new works for Playwrites Horizons, Ensemble Studio Theatre, the Hudson Guild Theatre, the American Jewish Theatre, and many others. During his comprehensive acting career, he also played leading roles for many of the major regional theaters around the country such as San Diego Old Globe, Seattle Rep, Alaska Rep, Actors' Theatre of Louisville, Mark Taper Forum, Baltimore Center Stage, the Geffen in Los Angeles, Pasadena Playhouse, Westport Country Playhouse, the McCarter Theatre, and the Boston Shakespeare Company. He spent ten summers at the Sundance Theatre Lab and is a co-founder of First Stage in Los Angeles, which has been developing new plays for over twenty years. Phillips has been on several popular TV shows and movies, including five seasons on Benson (1979), and seven seasons on Star Trek: Voyager (1995). He has been a guest star on scores of other television shows. Ethan has appeared in many feature films and award winning shorts and has an active voice-over career. Phillips is also a playwright and an author. His original play, \"Penguin Blues\" has been produced more than 150 times throughout USA and Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0Mzk3MzUxOV5BMl5BanBnXkFtZTgwMzIxMjU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0680392","name":"Ethan Phillips","nicknames":["Johnny"],"idIMDB":"nm0680392"},"actorId":"nm0680392","character":"Data Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cirroc Lofton","urlProfile":"http://www.imdb.com/name/nm0517467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTk1MzA5NF5BMl5BanBnXkFtZTcwNjMyNTUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1978","placeOfBirth":" Los Angeles, California, USA","height":"6' 3\" (1.91 m)","bio":"Cirroc Lofton was born on August 7, 1978 in Los Angeles, California, USA. He is an actor, known for Star Trek: Deep Space Nine (1993), Beethoven (1992) and Star Trek: Of Gods and Men (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTk1MzA5NF5BMl5BanBnXkFtZTcwNjMyNTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0517467","name":"Cirroc Lofton","idIMDB":"nm0517467"},"actorId":"nm0517467","character":"Sevar","urlCharacter":"http://www.imdb.com/character/ch0090163","main":true},{"actorName":"Lawrence Montaigne","urlProfile":"http://www.imdb.com/name/nm0598807","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjY1MDUzOV5BMl5BanBnXkFtZTgwODk5MDk0MDE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1931","placeOfBirth":" Brooklyn, New York City, New York, USA","bio":"\"Every actor should have a Great Escape\" wrote Lawrence Montaigne in his autobiography \"A Vulcan Odyssey\". He referred, of course, to the famous 1960's P.O.W. classic in which he played a small role. His character, Canadian prisoner Haynes, gets killed at the end of the film. Nonetheless, this was his self-declared favorite and career defining part. For most of us, Montaigne will be regarded as one of the most prolific science fiction actors of the era. We remember him as the robotic Mr. Glee in two seminal episodes of Batman (1966) versus The Joker; as Yellow Elk, a native American who finds himself in the base of The Time Tunnel (1966); as a THRUSH agent infiltrating the headquarters of The Man from U.N.C.L.E. (1964); as a sinister alien assassin in The Invaders (1967); most importantly, as Spock's Vulcan 'pon farr' rival Stonn and as Decius, the first Romulan ever glimpsed in one of the very best episodes of the original _Star Trek. Had Leonard Nimoy decided to leave the show for Mission: Impossible (1966) -- at one stage a distinct possibility-- Montaigne, who resembled him in appearance, would have succeeded him in the Spock role. A native New Yorker raised in Italy, Montaigne began his career in summer stock at the Belgrade Playhouse in Maine. He was multilingual, had trained as a classical dancer and first came to California as a member of the Hollywood Bowl Ballet Company. His introduction to the screen came both via dancing and stunt work in swashbucklers, the latter aided by the fact that he was also an accomplished fencer. After military service in the Marine Corps, he went on to complete his training at the Dramatic Workshop in New York. His role in The Great Escape (1963) then opened the doors to regular engagements in television beginning with guest spots on quintessential series like Perry Mason (1957), The Fugitive (1963), The Rogues (1964), Hogan's Heroes (1965), and, of course, Star Trek. He retired in the late 1980's. Based in Las Vegas he continued to be much involved in the convention scene. Montaigne wrote a screenplay for Disney in 1978 and subsequently penned two novels: \"The Guardian List\" and \"The Barrel of Death\". He held a Masters Degree from North Texas State University where he also lectured on film as an Associate Professor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjY1MDUzOV5BMl5BanBnXkFtZTgwODk5MDk0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0598807","name":"Lawrence Montaigne","idIMDB":"nm0598807"},"actorId":"nm0598807","character":"Stonn","urlCharacter":"http://www.imdb.com/character/ch0074044","main":true},{"actorName":"Ralph M. Miller","urlProfile":"http://www.imdb.com/name/nm1906475","urlPhoto":"","biography":{"bio":"Ralph M. Miller is known for his work on Star Trek: Of Gods and Men (2007), Ocean Pond (2014) and Starship Exeter: The Tressaurian Intersection (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1906475","name":"Ralph M. Miller","idIMDB":"nm1906475"},"actorId":"nm1906475","character":"Computer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0835378","urlIMDB":"http://www.imdb.com/title/tt0835378","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Renegade Studios, Inc."},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Panasonic AG-DVX100"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.3","filmingLocations":[{"location":"Lakeview Terrace, Los Angeles, California, USA"}],"awards":[],"votes":"1,004","type":"Video","companyCreditsSimple":[{"idCompany":"co0146329","name":"Renegade Studios"},{"idCompany":"co0490977","name":"Great Bird of the Galaxy Productions"},{"idCompany":"co0205712","name":"Jet Set Films"}],"keywords":{"keywords":["green skin","sexy alien","vulcan","romulan","klingon","24th century","star trek"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:11:18"}}