{"data":{"movies":[{"title":"Lions for Lambs","originalTitle":"","year":"2007","releaseDate":"20071109","directors":[{"name":"Robert Redford","id":"nm0000602"}],"writers":[{"name":"Matthew Michael Carnahan","id":"nm1996352"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMzc0MzYyM15BMl5BanBnXkFtZTcwMTM2NDk0NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Thriller","War"],"plot":"Three stories told simultaneous in ninety minutes of real time: a Republican Senator who's a presidential hopeful gives an hour-long interview to a skeptical television reporter, detailing a strategy for victory in Afghanistan; two special forces ambushed on an Afghani ridge await rescue as Taliban forces close in; a poli-sci professor at a California college invites a promising student to re-engage. Decisions press upon the reporter, the student, and the soldiers.","simplePlot":"Injuries sustained by two Army rangers behind enemy lines in Afghanistan set off a sequence of events involving a congressman, a journalist and a professor.","actors":[{"actorName":"Robert Redford","urlProfile":"http://www.imdb.com/name/nm0000602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzc5MzQyMV5BMl5BanBnXkFtZTcwNjQ5OTA0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1936","placeOfBirth":" Santa Monica, California, USA","birthName":"Charles Robert Redford Jr.","height":"5' 10½\" (1.79 m)","bio":"Charles Robert Redford, Jr. was born on August 18, 1936, in Santa Monica, California, to Martha (Hart), from Texas, and Charles Robert Redford, an accountant for Standard Oil, who was originally from Connecticut. He is of English, Scottish, Cornish, and Irish ancestry. Robert's mother died in 1955, the year after he graduated from high school. Robert was a scrappy kid who stole hubcaps in school and lost his college baseball scholarship at the University of Colorado because of drunkenness. After leaving UoC, he spent some time drifting across America, spending a time working in the California oil fields. Having saved enough he moved to Europe studying art in Paris and Florence.Back in the States he decided on a career as a theatrical designer in New York. Enrolling at the American Academy of Dramatic Art he turned to acting making his stage debut in 'Tall Story'. In 1962 he was signed for the stage production of 'Barefoot in the Park' which was a smash hit but it wasn't until 5 years later when it was filmed that he became an important star. Television and stage experience coupled with all-American good looks led to movies and television roles. His breakthrough role was \"The Sundance Kid\" in Butch Cassidy and the Sundance Kid (1969), when the actor was 32. The Way We Were (1973) and The Sting (1973), both in 1973, made Redford the number one box office star for the next three years. Redford used his clout to advance environmental causes and his riches to acquire Utah property, which he transformed into a ranch and the Sundance ski resort. In 1980, he established the Sundance Institute for aspiring filmmakers. Its annual film festival has become one of the world's most influential. Redford's directorial debut, Ordinary People (1980), won him the Academy Award as Best Director in 1981. He waited eight years before getting behind the camera again, this time for the screen version of John Nichols' acclaimed novel of the Southwest, The Milagro Beanfield War (1988). He scored with critics and fans in 1992 with the Brad Pitt film A River Runs Through It (1992), and again, in 1994, with Quiz Show (1994), which earned him yet another Best Director nomination. Lola Van Wagenen (consumer activist), born in 1940, dropped out of college to marry Redford on September 12, 1958. They divorced in 1985 after having four children, one of whom died of sudden infant death syndrome (SIDS). Daughter Shauna Redford, born November 15, 1960, is a painter who married Eric Schlosser on October 5, 1985, in Provo, UT. Her first child, born in January 1991, made Redford a grandfather. Son James Redford (aka Jamie Redford), a screenwriter, was born May 5, 1962. Daughter Amy Redford, an actress; was born October 22, 1970. Redford also has a brother named William.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzc5MzQyMV5BMl5BanBnXkFtZTcwNjQ5OTA0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000602","name":"Robert Redford","nicknames":["Bob"],"idIMDB":"nm0000602"},"actorId":"nm0000602","character":"Professor Stephen Malley","urlCharacter":"http://www.imdb.com/character/ch0033733","main":true},{"actorName":"Meryl Streep","urlProfile":"http://www.imdb.com/name/nm0000658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1949","placeOfBirth":" Summit, New Jersey, USA","birthName":"Mary Louise Streep","height":"5' 6\" (1.68 m)","bio":"Considered by many critics to be the greatest living actress, Meryl Streep has been nominated for the Academy Award an astonishing 20 times, and has won it three times. Meryl was born Mary Louise Streep in 1949 in Summit, New Jersey, to Mary Wolf (Wilkinson), a commercial artist, and Harry William Streep, Jr., a pharmaceutical executive. Her father was of German and Swiss-German descent, and her mother had English, Irish, and German ancestry. Meryl's early performing ambitions leaned toward the opera. She became interested in acting while a student at Vassar and upon graduation she enrolled in the Yale School of Drama. She gave an outstanding performance in her first film role, Julia (1977), and the next year she was nominated for her first Oscar for her role in The Deer Hunter (1978). She went on to win the Academy Award for her performances in Kramer vs. Kramer (1979) and Sophie's Choice (1982), in which she gave a heart-wrenching portrayal of an inmate mother in a Nazi death camp. A perfectionist in her craft and meticulous and painstaking in her preparation for her roles, Meryl turned out a string of highly acclaimed performances over the next decade in great films like Silkwood (1983); Out of Africa (1985); Ironweed (1987); and A Cry in the Dark (1988). Her career declined slightly in the early 1990s as a result of her inability to find suitable parts, but she shot back to the top in 1995 with her performance as Clint Eastwood's married lover in The Bridges of Madison County (1995) and as the prodigal daughter in Marvin's Room (1996). In 1998 she made her first venture into the area of producing, and was the executive producer for the moving ...First Do No Harm (1997). A realist when she talks about her future years in film, she remarked that \"...no matter what happens, my work will stand...\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000658","name":"Meryl Streep","idIMDB":"nm0000658"},"actorId":"nm0000658","character":"Janine Roth","urlCharacter":"http://www.imdb.com/character/ch0031225","main":true},{"actorName":"Tom Cruise","urlProfile":"http://www.imdb.com/name/nm0000129","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM3NTU5M15BMl5BanBnXkFtZTcwMTMyMjAyMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1962","placeOfBirth":" Syracuse, New York, USA","birthName":"Thomas Cruise Mapother IV","height":"5' 7\" (1.7 m)","bio":"In 1976, if you had told fourteen year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not too distant future he would become Tom Cruise, one of the top 100 movie stars of all time, he would have probably grinned and told you that his ambition was to join the priesthood. Nonetheless, this sensitive, deeply religious youngster who was born in 1962 in Syracuse, New York, was destined to be one of the highest paid and most sought after actors in screen history. Tom is the only son (among four children) of nomadic parents, Mary Lee (Pfeiffer), a special education teacher, and Thomas Cruise Mapother III, an electrical engineer. His parents were both from Louisville, Kentucky, and he has German, Irish, and English ancestry. Young Tom spent his boyhood eternally on the move, and by the time he was 14 he had attended 15 different schools in the U.S. and Canada. He finally settled in Glen Ridge, New Jersey, with his mother and her new husband. While in high school, he developed an interest in acting and abandoned his plans of becoming a priest, dropped out of school, and at age 18 headed for New York and a possible acting career. The next 15 years of his life are the stuff of legends. He made his film debut with a small part in Endless Love (1981) and from the outset exhibited an undeniable box office appeal to both male and female audiences. Though below average height and not particularly handsome in the traditional sense, within 5 years Tom Cruise was starring in some of the top grossing films of the 1980s including Top Gun (1986); The Color of Money (1986), Rain Man (1988) and Born on the Fourth of July (1989). By the 1990s he was one of the highest paid actors in the world earning an average 15 million dollars a picture in such blockbuster hits as Interview with the Vampire: The Vampire Chronicles (1994), Mission: Impossible (1996) and Jerry Maguire (1996) for which he received an Academy Award Nomination for best actor. In 1990 he renounced his devout Catholic beliefs and embraced The Church Of Scientology claiming that Scientology teachings had cured him of the dyslexia that had plagued him all of his life. A kind and thoughtful man well known for his compassion and generosity, Tom Cruise is one of the best liked members of the movie community. He was married to actress Nicole Kidman until 2001. Thomas Cruise Mapother IV has indeed come a long way from the lonely wanderings of his youth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM3NTU5M15BMl5BanBnXkFtZTcwMTMyMjAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000129","name":"Tom Cruise","nicknames":["TC"],"idIMDB":"nm0000129"},"actorId":"nm0000129","character":"Senator Jasper Irving","urlCharacter":"http://www.imdb.com/character/ch0033734","main":true},{"actorName":"Michael Peña","urlProfile":"http://www.imdb.com/name/nm0671567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzcxNTE5NV5BMl5BanBnXkFtZTcwOTE4MTMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1976","placeOfBirth":" Chicago, Illinois, USA","height":"5' 7\" (1.7 m)","bio":"Peña was born and raised in Chicago, to Nicolasa, a social worker, and Eleuterio Peña, who worked at a button factory. His parents were originally from Mexico, his mother from Charcas in San Luis Potosí and his father from Villa Purificación in Jalisco. After graduating from high school, he went to an open casting call for the Peter Bogdanovich feature To Sir, with Love II (1996), and to his surprise, beat out hundreds of other young men for a role. After relocating to Los Angeles Peña quickly booked a succession of roles in features including Star Maps, My Fellow Americans (1996) (opposite Jack Lemmon and James Garner), La Cucaracha (1998) (winner of the Best Picture in the Austin Film Festival), Bellyfruit (1999), and the Disney/Jerry Bruckheimer feature Gone in Sixty Seconds (2000). Michael Peña resides in Los Angeles where he plays bass guitar with his band, plays golf and boxes for relaxation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzcxNTE5NV5BMl5BanBnXkFtZTcwOTE4MTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671567","name":"Michael Peña","idIMDB":"nm0671567"},"actorId":"nm0671567","character":"Ernest Rodriguez","urlCharacter":"http://www.imdb.com/character/ch0036854","main":true},{"actorName":"Andrew Garfield","urlProfile":"http://www.imdb.com/name/nm1940449","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjI2OTk1OV5BMl5BanBnXkFtZTgwNTY1NzM4MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1983","placeOfBirth":" Los Angeles, California, USA","birthName":"Andrew Russell Garfield","height":"5' 10½\" (1.79 m)","bio":"Andrew Russell Garfield was born in Los Angeles, California, to a British-born mother, Lynn (Hillman), and an American-born father, Richard Garfield. When he was three, he moved to Surrey, U.K., with his parents and older brother. He is of English and Polish-Jewish heritage. Andrew was raised in a middle class family, and attended a private school, the City of London Freemen's School. He began acting in youth theatre productions while he was still at school. At age 19, he went to the Central School of Speech and Drama. His first professional roles were on the stage and in 2005 he made his TV debut in the Channel 4 teen series Sugar Rush (2005) in the UK. More TV work followed (reaching a wider UK audience in a two-part story in the third season of Doctor Who (2005)), as well as a number of movie appearances. Garfield played Eduardo in The Social Network (2010) and Tommy in Never Let Me Go (2010), two films that brought him to full international attention. That same year, he was cast as the title character in the reboot of the Spider-Man film franchise, The Amazing Spider-Man (2012). He reprised the role in the sequel, The Amazing Spider-Man 2 (2014), before passing off the torch to Tom Holland. Resuming his work in drama films, Garfield starred in Ramin Bahrani's 99 Homes (2014), with Michael Shannon, Mel Gibson's Tu ne tueras point (2016), about real-life Seventh Day Adventist war hero Desmond Doss, and Martin Scorsese's Silence (2016), opposite Adam Driver, playing Jesuit priests. His upcoming films include the Andy Serkis-directed drama Breathe (2017), where Garfield plays an adventurous man paralyzed by polio, and David Robert Mitchell's noir thriller Under the Silver Lake (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjI2OTk1OV5BMl5BanBnXkFtZTgwNTY1NzM4MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1940449","name":"Andrew Garfield","nicknames":["Andy"],"idIMDB":"nm1940449"},"actorId":"nm1940449","character":"Todd Hayes","urlCharacter":"http://www.imdb.com/character/ch0036855","main":true},{"actorName":"Peter Berg","urlProfile":"http://www.imdb.com/name/nm0000916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzA5Mzk1MV5BMl5BanBnXkFtZTcwMTY2OTA2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1964","placeOfBirth":" New York City, New York, USA","birthName":"Peter Winkler Berg","height":"6' 1\" (1.85 m)","bio":"Peter Berg is an American actor, director, writer, and producer. His first role was in the Adam Rifkin road movie Never on Tuesday (1989). He went on to star in the World War 2 film A Midnight Clear (1992). Roles in Fire in the Sky (1993) and Cop Land (1997) followed, and the Tom Cruise films Collateral (2004) and Lions for Lambs (2007). Peter has since moved behind the camera, directing films such as as Very Bad Things (1998) and Hancock (2008). He has also turned pen-to-paper and scripted many projects including Friday Night Lights (2004) and The Losers (2010). He is best known on-screen for his role as Dr. Billy Kronk in Chicago Hope (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzA5Mzk1MV5BMl5BanBnXkFtZTcwMTY2OTA2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000916","name":"Peter Berg","idIMDB":"nm0000916"},"actorId":"nm0000916","character":"Lt. Col. Falco","urlCharacter":"http://www.imdb.com/character/ch0037706","main":true},{"actorName":"Kevin Dunn","urlProfile":"http://www.imdb.com/name/nm0242656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTk4MTAwOF5BMl5BanBnXkFtZTcwODA4OTMwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1956","placeOfBirth":" Chicago, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Kevin Dunn was born in Chicago, Illinois, in 1956. He is an American actor who has made over 100 appearances in both TV and film. One of his earliest roles was in the Alan Parker film Mississippi Burning (1988) with Gene Hackman and Willem Dafoe. He followed this up with Kathryn Bigelow's Blue Steel (1990), Ghostbusters II (1989), and the Brian De Palma hit The Bonfire of the Vanities (1990). He has since appeared in a number of box office hits, such as Hot Shots! (1991), Chain Reaction (1996), and Godzilla (1998). He also appeared in the Oliver Stone epic, Nixon (1995) and the Ridley Scott fantasy film 1492: Christophe Colomb (1992). Dunn is able to fit into various roles in diverse genres with ease, whether the role in question be a political thriller like 'Robert Redford (I)'s Lions for Lambs (2007), an action film such as Tony Scotts Unstoppable (2010), or a romantic drama like Woody Allen's Vicky Cristina Barcelona (2008). He is an established and reliable supporting - and character - actor. He has gained considerable notoriety as the father in the hit movies Transformers (2007), Transformers: Revenge of the Fallen (2009), and Transformers: Dark of the Moon (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTk4MTAwOF5BMl5BanBnXkFtZTcwODA4OTMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242656","name":"Kevin Dunn","idIMDB":"nm0242656"},"actorId":"nm0242656","character":"ANX Editor","urlCharacter":"http://www.imdb.com/character/ch0040152","main":true},{"actorName":"Derek Luke","urlProfile":"http://www.imdb.com/name/nm1035682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTcxMDMwOF5BMl5BanBnXkFtZTgwODc2ODI2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1974","placeOfBirth":" Jersey City, New Jersey, USA","height":"5' 11\" (1.8 m)","bio":"Derek Luke was born on April 24, 1974 in Jersey City, New Jersey, USA. He is an actor, known for Captain America: The First Avenger (2011), Antwone Fisher (2002) and Glory Road (2006). He has been married to Sophia Adella Luke since 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MTcxMDMwOF5BMl5BanBnXkFtZTgwODc2ODI2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1035682","name":"Derek Luke","idIMDB":"nm1035682"},"actorId":"nm1035682","character":"Arian Finch","urlCharacter":"http://www.imdb.com/character/ch0036373","main":true},{"actorName":"Larry Bates","urlProfile":"http://www.imdb.com/name/nm0060966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzA4MzU3MF5BMl5BanBnXkFtZTgwMTQ4MTA2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Larry Bates is an actor and producer, known for Big Little Lies (2017), Lions for Lambs (2007) and Veronica Mars (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzA4MzU3MF5BMl5BanBnXkFtZTgwMTQ4MTA2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0060966","name":"Larry Bates","idIMDB":"nm0060966"},"actorId":"nm0060966","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher May","urlProfile":"http://www.imdb.com/name/nm0561894","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTYwNTQ4Nl5BMl5BanBnXkFtZTcwMzkyMDcwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Christopher May is an actor, known for The Hero (2017), CSI: Crime Scene Investigation (2000) and Castle (2009). He has been married to Miracle Laurie since November 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTYwNTQ4Nl5BMl5BanBnXkFtZTcwMzkyMDcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0561894","name":"Christopher May","idIMDB":"nm0561894"},"actorId":"nm0561894","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Pease","urlProfile":"http://www.imdb.com/name/nm0669440","urlPhoto":"","biography":{"bio":"David Pease is an actor, known for Deja Vu (2006), Lions for Lambs (2007) and Crazy (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0669440","name":"David Pease","idIMDB":"nm0669440"},"actorId":"nm0669440","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heidi Janson","urlProfile":"http://www.imdb.com/name/nm2811830","urlPhoto":"","biography":{"bio":"Heidi Janson is an actress, known for Lions for Lambs (2007) and Drake & Josh (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2811830","name":"Heidi Janson","idIMDB":"nm2811830"},"actorId":"nm2811830","character":"Soldier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Carley","urlProfile":"http://www.imdb.com/name/nm1542291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc5NDY4MDY3Nl5BMl5BanBnXkFtZTgwODU4MjI5NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1978","placeOfBirth":" Suffern, New York, USA","birthName":"Christopher Murphy Carley","bio":"He is best known for his Irish look with his natural red hair and slightly freckled skin. In 1996, he graduated from Pearl River High School in Pearl River, New York. In 1998, he took over the role of Ray in the Broadway production of The Beauty of Queen Leenane. He went on to play Second Bell Boy in the production of Once in a Lifetime. In 2005, he appeared in several Verizon Wireless commercials as Schmitty where his business-field character was tormented via cell phone by his friends and roommates.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc5NDY4MDY3Nl5BMl5BanBnXkFtZTgwODU4MjI5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1542291","name":"Christopher Carley","idIMDB":"nm1542291"},"actorId":"nm1542291","character":"Sniper","urlCharacter":"http://www.imdb.com/character/ch0040155","main":true},{"actorName":"George Back","urlProfile":"http://www.imdb.com/name/nm1197104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODc1NjkzOF5BMl5BanBnXkFtZTgwMTgxNjcxNzE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"George Back is a producer and actor, known for Horrible Bosses (2011), Lions for Lambs (2007) and The IMDb Studio (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODc1NjkzOF5BMl5BanBnXkFtZTgwMTgxNjcxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1197104","name":"George Back","idIMDB":"nm1197104"},"actorId":"nm1197104","character":"Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristy Wu","urlProfile":"http://www.imdb.com/name/nm0943127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY4Njc5MzA5Ml5BMl5BanBnXkFtZTYwMzI1MTI3._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1982","placeOfBirth":" Los Angeles, California, USA","bio":"Kristy Wu was born on October 11, 1982 in Los Angeles, California, USA. She is an actress, known for End of Watch (2012), Lions for Lambs (2007) and Cry_Wolf (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY4Njc5MzA5Ml5BMl5BanBnXkFtZTYwMzI1MTI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943127","name":"Kristy Wu","idIMDB":"nm0943127"},"actorId":"nm0943127","character":"Student","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0891527","urlIMDB":"http://www.imdb.com/title/tt0891527","business":{"budget":{"money":"$35,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$6,702,434","country":"USA","day":"11","month":"11","year":"2007","remarks":""},{"money":"£658,282","country":"UK","day":"11","month":"11","year":"2007","remarks":"404 Screens"},{"money":"BRL 798,954","country":"Brazil","day":"11","month":"11","year":"2007","remarks":"105 Screens"},{"money":"$10,862","country":"Estonia","day":"11","month":"11","year":"2007","remarks":"3 Screens"},{"money":"PHP 3,754,967","country":"Philippines","day":"11","month":"11","year":"2007","remarks":"14 Screens"}],"gross":[{"money":"$14,998,070","country":"USA","day":"03","month":"02","year":"2008","remarks":""},{"money":"$14,991,014","country":"USA","day":"27","month":"01","year":"2008","remarks":""},{"money":"$14,971,658","country":"USA","day":"20","month":"01","year":"2008","remarks":""},{"money":"$14,939,738","country":"USA","day":"13","month":"01","year":"2008","remarks":""},{"money":"$14,938,321","country":"USA","day":"06","month":"01","year":"2008","remarks":""},{"money":"$14,935,362","country":"USA","day":"30","month":"12","year":"2007","remarks":""},{"money":"$14,931,651","country":"USA","day":"23","month":"12","year":"2007","remarks":""},{"money":"$14,894,306","country":"USA","day":"16","month":"12","year":"2007","remarks":""},{"money":"$14,799,972","country":"USA","day":"09","month":"12","year":"2007","remarks":""},{"money":"$14,510,141","country":"USA","day":"02","month":"12","year":"2007","remarks":""},{"money":"$13,795,571","country":"USA","day":"24","month":"11","year":"2007","remarks":""},{"money":"$11,584,339","country":"USA","day":"18","month":"11","year":"2007","remarks":""},{"money":"$6,702,434","country":"USA","day":"11","month":"11","year":"2007","remarks":""},{"money":"£1,238,396","country":"UK","day":"18","month":"11","year":"2007","remarks":""},{"money":"£658,282","country":"UK","day":"11","month":"11","year":"2007","remarks":""},{"money":"BRL 798,954","country":"Brazil","day":"11","month":"11","year":"2007","remarks":""},{"money":"PHP 6,970,513","country":"Philippines","day":"23","month":"12","year":"2007","remarks":""},{"money":"PHP 6,632,169","country":"Philippines","day":"09","month":"12","year":"2007","remarks":""},{"money":"PHP 6,194,298","country":"Philippines","day":"02","month":"12","year":"2007","remarks":""},{"money":"PHP 5,737,425","country":"Philippines","day":"25","month":"11","year":"2007","remarks":""},{"money":"PHP 5,416,876","country":"Philippines","day":"18","month":"11","year":"2007","remarks":""},{"money":"PHP 3,754,967","country":"Philippines","day":"11","month":"11","year":"2007","remarks":""}],"weekendGross":[{"money":"$2,905","country":"USA","day":"03","month":"02","year":"2008","remarks":"4 Screens"},{"money":"$9,187","country":"USA","day":"27","month":"01","year":"2008","remarks":"43 Screens"},{"money":"$31,563","country":"USA","day":"20","month":"01","year":"2008","remarks":"95 Screens"},{"money":"$526","country":"USA","day":"13","month":"01","year":"2008","remarks":"4 Screens"},{"money":"$2,173","country":"USA","day":"06","month":"01","year":"2008","remarks":"7 Screens"},{"money":"$3,658","country":"USA","day":"30","month":"12","year":"2007","remarks":"12 Screens"},{"money":"$15,382","country":"USA","day":"23","month":"12","year":"2007","remarks":"32 Screens"},{"money":"$32,670","country":"USA","day":"16","month":"12","year":"2007","remarks":"116 Screens"},{"money":"$136,738","country":"USA","day":"09","month":"12","year":"2007","remarks":"350 Screens"},{"money":"$401,039","country":"USA","day":"02","month":"12","year":"2007","remarks":"825 Screens"},{"money":"$1,163,124","country":"USA","day":"24","month":"11","year":"2007","remarks":"1,527 Screens"},{"money":"$2,896,594","country":"USA","day":"18","month":"11","year":"2007","remarks":"2,216 Screens"},{"money":"$6,702,434","country":"USA","day":"11","month":"11","year":"2007","remarks":""},{"money":"£241,724","country":"UK","day":"18","month":"11","year":"2007","remarks":"378 Screens"},{"money":"£658,282","country":"UK","day":"11","month":"11","year":"2007","remarks":"404 Screens"},{"money":"BRL 798,954","country":"Brazil","day":"11","month":"11","year":"2007","remarks":"105 Screens"},{"money":"PHP 255,128","country":"Philippines","day":"23","month":"12","year":"2007","remarks":"8 Screens"},{"money":"PHP 201,645","country":"Philippines","day":"09","month":"12","year":"2007","remarks":"10 Screens"},{"money":"PHP 425,614","country":"Philippines","day":"02","month":"12","year":"2007","remarks":"14 Screens"},{"money":"PHP 360,001","country":"Philippines","day":"25","month":"11","year":"2007","remarks":"13 Screens"},{"money":"PHP 925,352","country":"Philippines","day":"18","month":"11","year":"2007","remarks":"14 Screens"},{"money":"PHP 3,754,967","country":"Philippines","day":"11","month":"11","year":"2007","remarks":"14 Screens"}],"admissions":[{"money":"75,375","country":"Brazil","day":"11","month":"11","year":"2007","remarks":""},{"money":"248,210","country":"Germany","day":"25","month":"11","year":"2007","remarks":""},{"money":"192,094","country":"Germany","day":"18","month":"11","year":"2007","remarks":""},{"money":"98,405","country":"Germany","day":"11","month":"11","year":"2007","remarks":""},{"money":"26,572","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"01","year":"2007","remarks":null},null],"copyrightHolder":"United Artists Production Finance LLC"},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["2,515 m (Sweden)","2,517 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"6.2","metascore":"47","filmingLocations":[{"location":"The White House, 1600 Pennsylvania Avenue NW, Washington, District of Columbia, USA"}],"rated":"R","awards":[{"award":"AARP Movies for Grownups Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Movies for Grownups Award","categories":[{"category":"Best Actress","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"Alliance of Women Film Journalists 2007","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Female Focus Award","categories":[{"category":"Actress Defying Age and Ageism","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2007","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Film Music Composition of the Year","names":[{"name":"Mark Isham","id":"nm0006142","role":null}]}]}]}],"votes":"42,264","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0026841","name":"United Artists"},{"idCompany":"co0034515","name":"Wildwood Enterprises"}],"keywords":{"keywords":["student","afghanistan","professor","reporter","university","republican","california","political science","iran","behind enemy lines","class attendance","special forces","ridge","rescue","college","taliban","washington d.c.","reference to abu ghraib","vietnam war veteran","arlington national cemetery","shorthand","condescension","reference to the who","national mall","reference to watergate","reference to richard nixon","mexican american","colin powell","night vision","reference to chicago convention","condoleezza rice","george w. bush","military offensive","reference to aaron copland","reference to creighton abrams","hindu kush","reference to 9 11","reference to alexander the great","lincoln memorial","reference to saddam hussein","arrogance","reference to hamid karzai","reference to the holocaust","corpse","dead body","obscene finger gesture","public service","war on terrorism","reference to aristotle","reference to plato","reference to socrates","explosion","self sacrifice","flash forward","watching tv","jumping from a helicopter","falling from a helicopter","montage","head wound","conservative","radical","anti aircraft artillery","rifle","cynicism","blood","snowing","snow","game playing","u.s. soldier","ex student","teacher student relationship","teacher","idealism","murder","teacher student conference","military mission","air assault","rocket fire","white house washington d.c.","cemetery","reference to west point","stitches","classroom","political science class","university student","bicycle","tv news","jihad","sunni islam","shi'ia islam","helicopter crash","helicopter shot down","restaurant","newspaper office","telephone call","activism","student activism","reference to osama bin laden","computer","newspaper","black american","african american","valley","mountain peak","woman with glasses","scene during end credits","politics","friendship","blizzard","animal in title","wound","volunteer","u.s. senator","u.s. senate","timeline","tv reporter","skepticism","sell out","presidental hopeful","leg wound","lecture","jumping from height","infra red","helicopter","fraternity","fraternity house","flashback","falling from height","military enlistment","news editor","military draft","death","college campus","camaraderie","broken leg","anti aircraft","air strike","afghan war","military strategy","propaganda","directed by star","college student","iraq war"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:08:03"}}