{"data":{"movies":[{"title":"The Soloist","originalTitle":"","year":"2009","releaseDate":"20090424","directors":[{"name":"Joe Wright","id":"nm0942504"}],"writers":[{"name":"Susannah Grant","id":"nm0335666"},{"name":"Steve Lopez","id":"nm2311134"}],"runtime":"117 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODQ3MTI5Nl5BMl5BanBnXkFtZTcwMDEyMTQ5MQ@@._V1.jpg","countries":["UK","France","USA"],"languages":["English"],"genres":["Biography","Drama","Music"],"plot":"In 2005, the only thing hurting Los Angeles Times columnist Steve Lopez more than his face from a recent bike accident was his pressing need for story ideas. That is when he discovers Nathaniel Ayers, a mentally ill, homeless street musician who possesses extraordinary talent, even through his half-broken instruments. Inspired by his story, Lopez writes an acclaimed series of articles about Ayers and attempts to do more to help both him and the rest of the underclass of LA have a better life. However, Lopez's good intentions run headlong in the hard realities of the strength of Ayers' personal demons and the larger social injustices facing the homeless. Regardless, Lopez and Ayers must find a way to conquer their deepest anxieties and frustrations to hope for a brighter future for both of them.","simplePlot":"A Los Angeles journalist befriends a homeless Juilliard-trained musician, while looking for a new article for the paper.","actors":[{"actorName":"Jamie Foxx","urlProfile":"http://www.imdb.com/name/nm0004937","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1967","placeOfBirth":" Terrell, Texas, USA","birthName":"Eric Marlon Bishop","height":"5' 9\" (1.75 m)","bio":"Jamie Foxx is an American actor, singer, and comedian. He won an Academy Award for Best Actor, BAFTA Award for Best Actor in a Leading Role, and Golden Globe Award for Best Actor in a Musical or Comedy, for his work in the 2004 biographical film Ray (2004). The same year, he was nominated for the Academy Award for Best Supporting Actor for his role in the action film Collateral (2004). Other prominent acting roles include the title role in the film Django Unchained (2012), the super villain Electro in The Amazing Spider-Man 2 (2014), and William Stacks in the 2014 version of Annie (2014). Jamie Foxx was born Eric Marlon Bishop in Terrell, Texas, to Louise Annette Talley and Darrell Bishop, who worked as a stockbroker and had later changed his name to Shahid Abdula. His mother was an adopted child. When her marriage to his father failed, his maternal grandparents, Mark and Estelle Talley, stepped in and, at age seven months, adopted Jamie too. He has said that he had a very rigid upbringing that placed him in the Boy Scouts and the church choir. During high school, he played quarterback for his high school team and was good enough that he got press in Dallas newspapers. He studied music in college. He released a music album in 1994, \"Peep This\", and sings the theme song for his 1999 movie, Any Given Sunday (1999). However, in 1989, his life changed when a girl friend challenged him to get up onstage at the Comedy Club. In fact, he says he took his androgynous stage name because he learned that women got preference for mike time on open stage nights. That led to his being cast in Roc (1991) and In Living Color (1990). Foxx had his own WB television show from 1996 to 2001, the sitcom The Jamie Foxx Show (1996), in which he played Jamie King Jr. Foxx is also a Grammy Award-winning musician, producing four albums which have charted highly on the US Billboard 200: Unpredictable (2005), which topped the chart, Intuition (2008), Best Night of My Life (2010), and Hollywood: A Story of a Dozen Roses (2015). In 2012, Foxx starred in the title role of the Quentin Tarantino written and directed Django Unchained. Foxx starred alongside his Ray co-star Kerry Washington, as well as Christoph Waltz, Leonardo DiCaprio and Samuel L. Jackson. In 2013, Foxx was cast as President James Sawyer in White House Down alongside Channing Tatum. The following year, Foxx appeared in The Amazing Spider-Man 2 as the villain Electro, and co-starred with Quvenzhané Wallis in Annie, Sony's Will Smith and Jay-Z produced update of the comic strip-turned-musical. He has two children, including Corinne Foxx, born in 1995, who lives with her mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004937","name":"Jamie Foxx","idIMDB":"nm0004937"},"actorId":"nm0004937","character":"Nathaniel Ayers","urlCharacter":"http://www.imdb.com/character/ch0128666","main":true},{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Steve Lopez","urlCharacter":"http://www.imdb.com/character/ch0057489","main":true},{"actorName":"Catherine Keener","urlProfile":"http://www.imdb.com/name/nm0001416","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzQ1Mzg1MF5BMl5BanBnXkFtZTcwNTE4MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1959","placeOfBirth":" Miami, Florida, USA","birthName":"Catherine Ann Keener","height":"5' 8\" (1.73 m)","bio":"Catherine Keener is an American actress, Oscar-nominated for her roles in the independent films Being John Malkovich (1999) and Capote (2005). Acclaimed in her community for her quirky roles in independent film and mainstream such as The 40-Year-Old Virgin (2005), Keener got her start as a casting director in New York City. Catherine Ann Keener was born in Miami, Florida, and was raised in Hialeah, FL. She is the daughter of Evelyn (Jamiel) and James Keener, who owned an auto shop. She is of Lebanese (mother) and English, Scottish, and German (father) descent. Keener attended Wheaton College in Massachusetts. She began taking acting classes when she was unable to sign up for a photography class. After graduating, Keener managed a McDonalds in New York City before becoming an assistant casting director and soon relocating to Los Angeles. Not long after, Keener told her superior of her aspirations for acting and she landed a one-worded role as a waitress in About Last Night... (1986). Two years later, she landed a role in a film called Survival Quest (1988), where she met her future husband, Dermot Mulroney. After struggling for years in the industry, Keener landed a role in an independent film, opposite the unknown Brad Pitt, in Johnny Suede (1991). Her ascent in independent film began as she starred in Living in Oblivion (1995) and Walking and Talking (1996) before her mainstream break with Being John Malkovich (1999) in 1999, which earned Keener her first Oscar nomination. Since then, Catherine Keener has starred in several critically acclaimed films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzQ1Mzg1MF5BMl5BanBnXkFtZTcwNTE4MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001416","name":"Catherine Keener","idIMDB":"nm0001416"},"actorId":"nm0001416","character":"Mary Weston","urlCharacter":"http://www.imdb.com/character/ch0180693","main":true},{"actorName":"Tom Hollander","urlProfile":"http://www.imdb.com/name/nm0390903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjY0NjM4M15BMl5BanBnXkFtZTcwOTEwMjQzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1967","placeOfBirth":" Bristol, England, UK","height":"5' 5\" (1.65 m)","bio":"Tom Hollander was born the second child of educated parents, both teachers. He grew up in Oxford, (UK). Hollander credits the happy atmosphere of the Dragon School with his childhood introduction to acting. There, encouraged by an influential teacher named Andrew Roberts, he won the title role in \"Oliver\". His studies continued at Abingdon, as did his pursuit of acting. At about this point, he won a place in the National Youth Theatre, a UK organization for young people in the field of musical theatre, based in London, and later at the Children's Music Theatre. It was during CMT's \"The Leaving of Liverpool\" (1981) that he came to the attention of BBC television, and subsequently found himself front and center as the young protagonist in a well-regarded John Diamond (1981), based on the popular Leon Garfield adventure novel. He was just fourteen years old. Other early projects included two roles in Bertholt Brecht's \"The Caucasian Chalk Circle\" (1985) for the National Youth Theatre, and \"A Midsummer Night's Dream\" for Oxford University Dramatic Society. Hollander attended Cambridge University at about the same time as his childhood friend Sam Mendes in a visually bold (and well-remembered) staging of \"Cyrano de Bergerac\" (1988). Other collaborations with Mendes have followed, including work at the West End production of \"The Cherry Orchard\" (1989, with Judi Dench), and the Chichester Festival Theatre (1989) as well as a Toronto staging of \"Kean\" (1991) with Derek Jacobi. He also appeared in the Cambridge Footlights Revue (1988). Upon graduation, Hollander hoped to gain entry to drama school, but found himself disappointed. The oversight did nothing to discourage a successful career already well under way: he garnered an Ian Charleson Award for his turn as Witwould in \"The Way of the World\" (1992), was nominated again for a \"splendidly sinister, manic\" performance as \"Tartuffe\" (1996), and yet again as a finalist for his Khlestakov (\"a performance of ideal vigour and impudence\"), in Gogol's \"The Government Inspector\" (1997). Inevitably, Hollander was urged to try films, and appeared in two films as early as 1996. True Blue (1996) (aka \"Miracle at Oxford\") found him in a small but memorable role as the cox for Oxford's noted 1987 \"mutiny crew\" that went on to win the that year's boat race against Cambridge, and in a thankless role in Some Mother's Son (1996), a sober drama about an IRA gunman, playing a Thatcher representative. Hollander's career has featured a number of memorable gay roles. His fans are especially fond of the larger-than-life Darren from Bedrooms and Hallways (1998), a romantic comedy with what one reviewer called the \"funniest bedroom scene of the year\" involving Hollander's character and Hugo Weaving. The over-the-top Darren was so convincing that some viewers assumed Hollander was gay. \"Sometimes I call myself a professional homosexual impersonator,\" he told an interviewer at the time, quickly adding, \"you could say that ...Sir Ian McKellen and Rock Hudson do straight actors.\" The following year, he would take on a very different kind of \"gay\" role, playing the notorious \"Bosie\" (Lord Alfred Douglas) against Liam Neeson's Oscar Wilde in \"The Judas Kiss\" (1998). \"Martha -- Meet Frank Daniel and Laurence\" (aka The Very Thought of You (1998), with Joseph Fiennes and Rufus Sewell, brought accolades for his standout role as Daniel, a difficult music executive. Variety, impressed, noted him for \"U.K. legit work\" and called him the \"undisputed hit of the pic\". 2001 brought Gosford Park (2001), Robert Altman's masterfully stylized murder mystery, in which he played the quietly desperate Anthony Meredith against Michael Gambon's callously indifferent paterfamilias. Hollander's name figures in a half dozen or more \"Best Ensemble\" awards for this complex, multi-storied film. Considered the character-actor-of-choice for roles with comedic qualities, Hollander has challenged assumptions about his capacity by taking on difficult, troubled characters such as the tightly-wound King George V in Stephen Poliakoff's The Lost Prince (2003) for BBC and the demented fascist dictator Maximillian II in Land of the Blind (2006). Hollander himself is particularly proud of the film Lawless Heart (2001), a slyly humorous, cleverly constructed comedy-drama told from three viewpoints. Hollander's character, the heart of the film, is a decent man, devastated by the death of his partner, and grieving privately as the stories of friends and family unfold around him. A study of desire, loyalty and courage, the film was very well reviewed and much respected. More recent film work has brought him to the attention of mainstream movie audiences, who now know him as the magnificently petty tyrant Lord Cutler Beckett in the second and third installments of Disney's \"Pirates of the Caribbean\" movies, Pirates of the Caribbean: Dead Man's Chest (2006) and Pirates of the Caribbean: At World's End (2007). This role brought another kind of achievement: Hollander could now say that he'd been commemorated in collectible action-figure form. He's worked three times with director Joe Wright, beginning with the prissy, yet strangely likeable Mr. Collins in Pride & Prejudice (2005), as a clueless classical cellist in an unfortunately truncated role in The Soloist (2009), and as Issacs, the German henchman in Hanna (2011). With In the Loop (2009), Hollander brought a perfectly unbearable, delicate tension to the role of Simon Foster, the earnestly clueless \"British Secretary of State for International Development\" who says the wrong thing at exactly the wrong moment. The film acted as a kind of companion piece to the critically-acclaimed The Thick of It (2005) on BBC2, Armando Iannucci's furious political satire on the machinations of war and media. Hollander's contribution to the expanded story was apparently so well-received he was \"brought back\" (but in a different role, entirely) from film to television for a series-ending surprise-appearance in series 3, delighting fans of the show. Recent work in television has brought him the opportunity to expand on his special capacity for conveying nuanced and contradictory characters. He earned an award for Best Actor at the FIPA International Television Festival for his portrayal of Guy Burgess in Cambridge Spies (2003), and earned praise for the monstrously rude yet oddly endearing Leon in the satire Freezing (2008), with Hugh Bonneville and Elizabeth McGovern) for BBC. He was unforgettable in an elegantly brief but very moving portrayal of King George III for HBO's John Adams (2008). 2010 brought Hollander to widespread attention with Rev. (2010), which he co-created with James Wood. The show, initially described in what was assumed to be familiar terms (\"vicar\", \"comedy\") became something entirely new: \"...an exploration of British hypocrisy and a warmly played character piece\", wrote Giles Fraser, Canon Chancellor at St Paul's Cathedral in a piece for The Sunday Telegraph. Rev. was much more than it appeared: reviews called it intelligent, realistic and very funny, with a stellar cast headed by Hollander as the sympathetic and very human vicar, Adam Smallbone. The show would garner a BAFTA in 2011 for Best Situation Comedy, among other awards and recognition. Hollander supports a variety of charitable causes in innovative ways. In 2006 he ran his first race for the Childline Crisis hotline, and in 2007 ran for the Teenage Cancer Trust. He is a long-time supporter of the Helen and Douglas House in Oxford, which provides Hospice care for children, and continues to support charitable organizations by contributing readings and other appearances throughout the year. Hollander is a patron of BIFA, the British Independent Film Awards, and has supported the efforts of the Old Vic's \"24 Hour Plays New Voices\" Gala, which forwards the cause of young writers for the British stage. Hollander continues to diversify with voicework roles in radio, reading audiobooks, doing voiceover work and onstage. He appeared in the Old Vic's production of Georges Feydeau's \"A Flea in Her Ear\" (2010), playing a demanding dual role: the upstanding Victor Emmanuel Chandebise and the lame-brained Poche. Reviews called it \"insanity\", and his performance \"a breathtaking combination of lightning physical precision and shockingly true confusion\". Hollander is in production for series 2 of the winning comedy Rev. (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjY0NjM4M15BMl5BanBnXkFtZTcwOTEwMjQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0390903","name":"Tom Hollander","idIMDB":"nm0390903"},"actorId":"nm0390903","character":"Graham Claydon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"LisaGay Hamilton","urlProfile":"http://www.imdb.com/name/nm0004986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNTEyNDI5Ml5BMl5BanBnXkFtZTYwMTUwODcz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1964","placeOfBirth":" Los Angeles, California, USA","height":"5' 1\" (1.55 m)","bio":"Lisa's mother, Tina, is a retired social worker. Her late father, Ira, worked as an engineer and then went into business as a general contractor. A sister, Heidi, is a lawyer. Lisa started acting as a child and played Flip Wilson in a 3rd grade performance. During junior high, she started traveling by train to Manhattan for private acting lessons and acted in summer drama camps. Her principal interest initially was to act in Shakepearean drama. She earned her degree from theatre from New York University and followed it up with a second BFA from Julliard. In 1993, she got her first break at the New York Shakespearean festival playing Isabella opposite Kevin Kline in \"Measure for Measure\". She was later turned down to play the role of Hester Prynne in a production of \"The Scarlet Letter\" because of race. Upset, she wrote a letter to 'The Village Voice' to protest legal racism. The play's playwright, Phyllis Nagy, responded with a criticism of her acting, which obviously made things worse. She went on to have a successful career in theater. In 1995-96, her portrayal of a South African singer in Athol Fugard's Valley Song garnered an Obie Award and the Clarence Derwent Award. More recently, Hamilton earned critical acclaim, her second Obie, and a Lucille Lortel Award nomination for her role as Suzanne Alexander in Adrienne Kennedy's, \"The Ohio State Murders.\" Besides appearing in over two dozen films, Hamilton directed the documentary film Beah: A Black Woman Speaks in 2003. This film, about pioneering black actress Beah Richards, dealt with Hamilton seeking out Richards, an African-American actress who had broken ground making inroads for black actresses.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNTEyNDI5Ml5BMl5BanBnXkFtZTYwMTUwODcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004986","name":"LisaGay Hamilton","idIMDB":"nm0004986"},"actorId":"nm0004986","character":"Jennifer Ayers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nelsan Ellis","urlProfile":"http://www.imdb.com/name/nm1734700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODI2NDI5MV5BMl5BanBnXkFtZTcwNDY4NDk0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Nelson Ellis","height":"5' 9¼\" (1.76 m)","bio":"Nelsan Ellis (born c. 1978) is an award-winning American film and television actor and playwright, perhaps best known as Lafayette Reynolds on HBO's True Blood. Ellis was born in Harvey, Illinois. Following his parents' divorce, Ellis and his mother moved to Alabama. He moved back to Illinois as a teenager, and graduated from Thornridge High School in Dolton, Illinois, in 1997. Ellis attended Juilliard and, while there, wrote a semi-autobiographical play titled Ugly that was performed at the school and later won the Lincoln Center's Martin E. Segal Award. Ellis won a 2008 Satellite Award from the International Press Academy for best supporting actor in a television series for his role as Lafayette Reynolds in HBO's True Blood. Ellis won the \"Brink of Fame: Actor\" award at the 2009 NewNowNext Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODI2NDI5MV5BMl5BanBnXkFtZTcwNDY4NDk0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1734700","name":"Nelsan Ellis","idIMDB":"nm1734700"},"actorId":"nm1734700","character":"David Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rachael Harris","urlProfile":"http://www.imdb.com/name/nm0006713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzQ3MDYzNl5BMl5BanBnXkFtZTgwODEzMTc2MTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1968","placeOfBirth":" Worthington, Ohio, USA","birthName":"Rachael Elaine Harris","height":"5' 1\" (1.55 m)","bio":"Rachael Harris was born on January 12, 1968 in Worthington, Ohio, USA as Rachael Elaine Harris. She is known for her work on The Hangover (2009), Diary of a Wimpy Kid (2010) and Lucifer (2015). She has been married to Christian Hebel since April 30, 2015. They have one child. She was previously married to Adam Paul.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNzQ3MDYzNl5BMl5BanBnXkFtZTgwODEzMTc2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006713","name":"Rachael Harris","idIMDB":"nm0006713"},"actorId":"nm0006713","character":"Leslie Bloom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Root","urlProfile":"http://www.imdb.com/name/nm0740535","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MDA3OTA5OF5BMl5BanBnXkFtZTcwMjQ4MDU0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1951","placeOfBirth":" Sarasota, Florida, USA","height":"5' 8\" (1.73 m)","bio":"One of the most prolific character actors working today, Stephen Root has worked alongside many of the biggest names in Hollywood. Born in Sarasota, Root majored in acting and broadcasting at the University of Florida and remains a die-hard Gator fan. After three years of touring the U.S. and Canada with the National Shakespeare Company, Root settled in New York, honing his craft in many regional theaters and starring off-Broadway in 'Journey's End' and 'The Au Pair Man'. His Broadway debut came in 'So Long On Lonely Street', which was followed by the Tony award-winning production of 'All My Sons', with Richard Kiley. A starring role as 'Boolie', in the Broadway national touring company of 'Driving Miss Daisy' with Julie Harris, brought Root to Los Angeles where he now resides. Back on the boards, he recently starred with Helen Hunt and Lyle Lovett in ;Much Ado About Nothing', an LA Shakespeare Production. His first acting role on screen came in George A. Romero's cult horror classic Monkey Shines (1988). After that, many more under-the-radar supporting roles came his way until he found some moderate fame in the acclaimed series NewsRadio (1995), where he played the somewhat eccentric owner of a radio station, Jimmy James, with Dave Foley as the station manager. The show ran from 1995 to 1999. Root has played more eccentric characters in recent years, voicing several characters in the hit animated TV series King of the Hill (1997), a show created by and starring Mike Judge. Judge would later cast Root in another cult classic film, 1999's 35 heures, c'est déjà trop (1999), where Root played the squirrelly and unforgettable Milton Waddams, a man who is pushed around at work and has a fetish for Swingline staplers. More recently Root has worked with such directors as the Coen brothers and Kevin Smith creating more oddball characters as well as making guest appearances on numerous TV shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MDA3OTA5OF5BMl5BanBnXkFtZTcwMjQ4MDU0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0740535","name":"Stephen Root","idIMDB":"nm0740535"},"actorId":"nm0740535","character":"Curt Reynolds","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lorraine Toussaint","urlProfile":"http://www.imdb.com/name/nm0005501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4MTE1OTgyMF5BMl5BanBnXkFtZTcwMDQwOTg3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1960","placeOfBirth":" Trinidad, British West Indies [now Trinidad and Tobago]","height":"5' 9\" (1.75 m)","bio":"SAG Award and Critics Choice Award winner for Best Supporting Actress in a Drama Series, Lorraine Toussaint shocked audiences on the smash hit Netflix original series \"Orange is the New Black\" as the viciously seductive inmate Vee. Toussaint's epically thrilling performance has won her glowing reviews from the likes of TV Guide and Vanity Fair, stirring the Emmy buzz for her outstanding performance. Toussaint also received praise for her performance in the Academy Award nominated feature film \"Selma.\" Up next, Toussaint will star in the new Fox series \"Rosewood,\" alongside Morris Chestnut, which premieres this fall. Born in Trinidad and raised in Brooklyn, NY, Toussaint and her mother moved to Brooklyn when she was ten years old. Growing up, she watched a lot of television while she waited for her mother to return from work and this sparked her interest in acting. Toussaint begged her mother to enroll her in acting school and her search lead to her studying theater at New York's renowned High School of Performing Arts. After graduation, she enrolled herself at the Juilliard School's drama division where she graduated with a Bachelors of Fine Arts degree. On her graduation day, she landed her first paying job as Lady Macbeth with \"Shakespeare & Company.\" Toussaint spent the first 12 years of her career acting on stage in New York City before moving to Los Angeles. Her first television appearance was in 1983 in \"The Face of Rage.\" Toussaint's biggest career boost has come from her co-starring role opposite Annie Potts in the TV series \"Any Day Now,\" which earned Toussaint an NAACP Image Award nomination for best actress in a drama series, a TV Guide Award nomination for Best Actress in a Drama Series and she received the Wiley A. Branton Award from the National Bar Association. Among Toussaint's TV credits were recurring roles on several popular television shows such as NBC's drama series \"Friday Night Lights,\" TNT's \"Saving Grace,\" \"Law & Order,\" and ABC's hit \"ugly Betty.\" She has also had several guest appearances on the hit television shows \"CSI: Crime Investigation,\" \"Grey's Anatomy,\" and opposite Kerry Washington on drama thriller \"Scandal.\" No stranger to the silver screen, Touissant's first film role was opposite Burt Reynolds in the crime comedy \"Breaking In.\" Touissant has also appeared in \"Dangerous Minds,\" \"The Soloist,\" and Ava DuVernay's \"Middle of Nowhere,\" in which her performance was nominated for an Independent Spirit Award for Best Supporting Female. Up next, Toussaint stars as Salome Whitmore in the upcoming period drama, \"Sophie and the Rising Sun,\" written and directed by Maggie Greenwald. Toussaint will also play Anthony Mackie's mother in the upcoming Seth Rogen comedy \"X-Mas,\" in theaters this November. Toussaint and her daughter currently split their time between New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4MTE1OTgyMF5BMl5BanBnXkFtZTcwMDQwOTg3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005501","name":"Lorraine Toussaint","idIMDB":"nm0005501"},"actorId":"nm0005501","character":"Flo Ayers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Martin","urlProfile":"http://www.imdb.com/name/nm0552595","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MzYyNjE0NF5BMl5BanBnXkFtZTcwOTg3NTg2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1994","placeOfBirth":" San Diego, California, USA","height":"5' 8\" (1.73 m)","bio":"Justin is a native of Atlanta, Georgia. He started acting at age seven in the drama department in his church. Justin was soon discovered by Atlanta agent Joy Pervis, who had previously discovered many child stars including Dakota Fanning and Kyle Massey. Justin worked for two years in the Atlanta doing commercials and local theater. He came to Los Angeles for pilot season in 2003 at age 9. His parents thought they would come and experience pilot season for about three weeks, Justin continued to work for five months. That pilot season Justin booked two national commercials (Mercedes Benz and Shoney's), episodic roles on The Bernie Mac Show and Malcolm in the Middle, and a role in the film Doing Hard Time. In 2004 Justin returned to LA for his second pilot season. That year he booked another national commercial (Bounty paper towels) and roles on Judging Amy and Drake and Josh. After five successful months in LA, Justin returned to Atlanta to enroll in The Lovett School, one of the top private day schools in the country. In 2005 Justin was invited to New York to audition for the role of 'Young Simba' in the Disney Theatrical show The Lion King on Broadway. Out of thousands of other young contenders, Justin became the new star of the biggest show on Broadway. He made his Broadway debut on March 1st of 2006 and continued in that role for 12 months. While on Broadway, Justin booked the role of 'Travis' in the television movie adaptation of Lorraine Hansberry's A Raisin in the Sun with Tony winners Phylicia Rashad, and Audra McDonald and also Sean Combs. In January of 2008 Justin joined the star-studded cast at Sundance as A Raisin in the Sun was the first made for television movie to ever be invited to premier at the Sundance Film Festival. Justin will be one of the three new Wildcat's in High School Musical 3: Senior Year. He will play Donnie. Justin is a brilliantly gifted student and a member of the National Honor Society and A Better Chance. He is also a singer and dancer and is looking forward to a long career in the industry as a triple threat. Justin lives in LA with his mother, Trina and his 8 year old sister Zion who is also an actor, while his father Tony holds down the home front in Atlanta.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MzYyNjE0NF5BMl5BanBnXkFtZTcwOTg3NTg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0552595","name":"Justin Martin","idIMDB":"nm0552595"},"actorId":"nm0552595","character":"Young Nathaniel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kokayi Ampah","urlProfile":"http://www.imdb.com/name/nm0025346","urlPhoto":"","biography":{"bio":"Kokayi Ampah is known for his work on The Shawshank Redemption (1994), Million Dollar Baby (2004) and Mystic River (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0025346","name":"Kokayi Ampah","idIMDB":"nm0025346"},"actorId":"nm0025346","character":"Bernie Carpenter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Tatten","urlProfile":"http://www.imdb.com/name/nm2567087","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU4OTY2MjU3MF5BMl5BanBnXkFtZTgwNzg2MzMzOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1981","placeOfBirth":" Sterling, Massachusetts, USA","birthName":"Patrick J. Tatten","bio":"Patrick Tatten was born in Worcester, Massachusetts. His mother enrolled him in the prestigious Thayer Conservatory, where he began taking violin lessons at the age of three. Tatten's love of music and performance would continue throughout his educational journey. After earning his BA in music theory from Connecticut College, he moved to Hollywood. A resident of Los Angeles, Tatten has continued to work as an actor in both television and film, while frequently performing as a violinist and musical guest of various acts in Hollywood. Tatten is represented by Genesis Artists.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU4OTY2MjU3MF5BMl5BanBnXkFtZTgwNzg2MzMzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2567087","name":"Patrick Tatten","idIMDB":"nm2567087"},"actorId":"nm2567087","character":"Paul Jr.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susane Lee","urlProfile":"http://www.imdb.com/name/nm1638142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMTc3OTA5M15BMl5BanBnXkFtZTcwMDYxMTU2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Susane Lee is an actress and producer, known for Rizzoli & Isles (2010), Grey's Anatomy (2005) and Gilmore Girls (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMTc3OTA5M15BMl5BanBnXkFtZTcwMDYxMTU2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1638142","name":"Susane Lee","idIMDB":"nm1638142"},"actorId":"nm1638142","character":"Marisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcos De Silvas","urlProfile":"http://www.imdb.com/name/nm2780326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NTg3MDIzOV5BMl5BanBnXkFtZTgwNzY4MjI5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Marcos De Silvas is an actor, known for Scandal (2012), American Crime (2015) and Lopez (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NTg3MDIzOV5BMl5BanBnXkFtZTgwNzY4MjI5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2780326","name":"Marcos De Silvas","idIMDB":"nm2780326"},"actorId":"nm2780326","character":"Mayor Villaraigosa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ilia Volok","urlProfile":"http://www.imdb.com/name/nm0901679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzYzMDg3Ml5BMl5BanBnXkFtZTcwNDU4MzM2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1965","placeOfBirth":" Kiev, Ukrainian SSR","height":"6' 3\" (1.91 m)","bio":"Ilia Volok is a Soviet-born actor. He has appeared in over 90 films, television shows, and video games. He was born on November 1, 1965 in Kiev, Ukrainian SSR, Ukraine. He is known for his work on Indiana Jones and the Kingdom of the Crystal Skull (2008), Mission: Impossible - Ghost Protocol (2011) and The Curious Case of Benjamin Button (2008). Ilia was born in Kiev and for his education, he studied and graduated from Moscow Art Theatre School, where he took the acting class of Russian actor Aleksandr Kalyagin. Volok has appeared in more than 90 films and television programs. He starred as Vladimir Krasin in Air Force One and portrayed Master Org in Power Rangers Wild Force. Additionally, he has had recurring roles in General Hospital and The Young and the Restless. He guest starred in an episode of Friends in which reference was made to the Air Force One without mentioning him as one of its actors. Volok frequently performs on stage. He co-wrote, co-created, and starred as the title character in the comedy play Fakov in America. He plays a leading part in Cat's Paw, an Actors Studio project. The character Vladimir Kamarivsky in the Electronic Arts video game Battlefield 3 is modeled after and voiced by Volok. His life took an unexpected turn when after being a professional athlete (3rd place at the world championship in rowing with the Soviet Union team in Italy), and on his way to become a rowing coach, he left his native Kiev (Ukraine) to audition for one of the most prestigious acting colleges-the famous Moscow Art Theatre School. To the complete surprise of his friends and relatives, he passed a rigorous competition (200 hundred contestants per one spot) and was accepted to study under the direction of one of the top stars of Russian theatre and cinema - Alexander Kalyagin. Upon graduation he was invited to work in several top theatre companies the Moscow Art Theatre being one of them. But once again he changed the direction of his life, and with $300.00 in his pocket, without any knowledge of English, he came to America to pursue his dream of being a working Hollywood actor. The first jobs that came along had little to do with acting. He was cutting sandwiches and flipping chicken at a restaurant, and working at a cemetery as a funeral service attendant where he enjoyed quiet surroundings and fresh air (later he was promoted to selling cemetery plots). But finally in the fall of 1993 he got his acting break in the movie Hail Ceaser, playing opposite Samuel Jackson, Robert Downey Jr. and Michael Anthony Hall. To this date, he has appeared in over 110 films and television shows, including Air Force One, Oliver Stone's \"U-Turn\", \"Indiana Jones-4, David Fincher's \"The Curious Case of Benjamin Button\", \"The Soloist\", \"Six Feet Under\", \"Alias\", \"Friends\", \"Las Vegas\", \"Burn Notice\" and many others. Recent film credits include \"Water for Elephants\" starring Reese Witherspoon , \"Mission Impossible-4 with Tom Cruise, \"Abduction\" with Alfred Molina, directed by John Singleton, Upcoming \"GI JOE 2 with Bruce Willis and Dwayne Johnson-the Rock and \"Untitled James Gray Movie\" with Marion Cotillard and Joaquin Phoenix. Recent television includes a Guest Lead on \"Undercovers\", \"Supernatural\", \"Closer\", \"Chaos\" directed by Brett Ratner, and 37 episode arch as Karpov on \"General Hospital\". Among his LA Theater credits are \"Just a song at twilight\" at Write Act repertory company, \"Cat's paw\", produced by the Actor's Studio, \"Cassat and Degas\" at the Hudson theatre where he portrayed the French impressionist, Destiny's Calling at the Stelle Adler Theatre, \"Ferdinand\" by Vaclav Haveland \"Fakov in America\"- a 2-men show, which he co-wrote and co-produced with David Laird Scott. His ongoing one-man show \"Diary of a madman\" written by Nicolai Gogol and directed by Eugene Lazarev, received rave reviews. For more information on Ilia and \"Diary of a Madman\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzYzMDg3Ml5BMl5BanBnXkFtZTcwNDU4MzM2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0901679","name":"Ilia Volok","idIMDB":"nm0901679"},"actorId":"nm0901679","character":"Harry Barnoff","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0821642","urlIMDB":"http://www.imdb.com/title/tt0821642","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$9,716,458","country":"USA","day":"26","month":"04","year":"2009","remarks":"2,024 Screens"},{"money":"£373,151","country":"UK","day":"27","month":"09","year":"2009","remarks":"351 Screens"},{"money":"$CAD478,511","country":"Canada","day":"26","month":"04","year":"2009","remarks":""}],"gross":[{"money":"$31,670,931","country":"USA","day":"05","month":"07","year":"2009","remarks":""},{"money":"$31,527,902","country":"USA","day":"28","month":"06","year":"2009","remarks":""},{"money":"$31,295,414","country":"USA","day":"21","month":"06","year":"2009","remarks":""},{"money":"$30,726,123","country":"USA","day":"07","month":"06","year":"2009","remarks":""},{"money":"$29,507,907","country":"USA","day":"24","month":"05","year":"2009","remarks":""},{"money":"$27,505,154","country":"USA","day":"17","month":"05","year":"2009","remarks":""},{"money":"$23,845,177","country":"USA","day":"10","month":"05","year":"2009","remarks":""},{"money":"$18,162,696","country":"USA","day":"03","month":"05","year":"2009","remarks":""},{"money":"$9,716,458","country":"USA","day":"26","month":"04","year":"2009","remarks":""},{"money":"£1,060,061","country":"UK","day":"11","month":"10","year":"2009","remarks":""},{"money":"£857,170","country":"UK","day":"04","month":"10","year":"2009","remarks":""},{"money":"£373,151","country":"UK","day":"27","month":"09","year":"2009","remarks":""}],"weekendGross":[{"money":"$69,114","country":"USA","day":"05","month":"07","year":"2009","remarks":"156 Screens"},{"money":"$126,488","country":"USA","day":"28","month":"06","year":"2009","remarks":"228 Screens"},{"money":"$192,526","country":"USA","day":"21","month":"06","year":"2009","remarks":"304 Screens"},{"money":"$264,531","country":"USA","day":"07","month":"06","year":"2009","remarks":"306 Screens"},{"money":"$1,112,075","country":"USA","day":"24","month":"05","year":"2009","remarks":"654 Screens"},{"money":"$2,402,801","country":"USA","day":"17","month":"05","year":"2009","remarks":"2,022 Screens"},{"money":"$3,949,430","country":"USA","day":"10","month":"05","year":"2009","remarks":"2,090 Screens"},{"money":"$5,654,558","country":"USA","day":"03","month":"05","year":"2009","remarks":"2,033 Screens"},{"money":"$9,716,458","country":"USA","day":"26","month":"04","year":"2009","remarks":"2,024 Screens"},{"money":"£208,962","country":"UK","day":"04","month":"10","year":"2009","remarks":"332 Screens"},{"money":"£373,151","country":"UK","day":"27","month":"09","year":"2009","remarks":"351 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"01","year":"2008","remarks":null},null],"copyrightHolder":"(2008) DreamWorks LLC and Universal Studios"},"technical":{"runtime":["1 hr 57 min (117 min)"],"soundMix":["Dolby Digital","SDDS","DTS"],"color":["Color (DeLuxe)"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Millennium XL2, Panavision C-, E-Series, ATZ and AWZ2 Lenses","Panavision Panaflex Platinum, Panavision C-, E-Series, ATZ and AWZ2 Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["3,227 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 200T 5217, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6.7","metascore":"61","filmingLocations":[{"location":"Skid Row, Central City East, Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Black Reel Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Best Actor","names":[{"name":"Jamie Foxx","id":"nm0004937","role":null}]}]}]},{"award":"Prism Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Prism Award","categories":[{"category":"Feature Film- Mental Health","names":[]}]},{"titleAwardOutcome":"Nominated Prism Award","categories":[{"category":"Performance in a Feature Film","names":[{"name":"Jamie Foxx","id":"nm0004937","role":null}]},{"category":"Performance in a Feature Film","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]}]}]}],"votes":"45,246","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040938","name":"DreamWorks"},{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0047476","name":"StudioCanal"}],"keywords":{"keywords":["musician","los angeles times","journalist","columnist","wearing a traffic cone as a hat","comic relief","unlikely friendship","outsider","broom","sweeping","cat","shaving","ohio state university","reference to jascha heifetz","spelling","nurse","faith","uncle sam hat","sing along","what happened to epilogue","soup","drumsticks","megaphone","mayor","reference to frank sinatra","speaker phone","christian","reference to jesus christ","cross","church","airplane","eyeglasses","video camera","ballet dancer","psychiatry","diagnosis","medication","traffic cone","american flag","sleeping","rat","face mask","torment","bare chested male","basement","reference to simon cowell","reference to paula abdul","delivering newspaper","cello lesson","music lesson","music teacher","teacher","whiteface","love","policeman","police","shopping cart","crack cocaine","homeless shelter","beating","liar","lie","divorce","elevator","reference to johann sebastian bach","coercion","hotel","awards banquet","mirror","men's bathroom","reference to donald duck","walt disney concert hall","flowers","audience","theatre audience","hair dresser","beauty salon","park","reference to mr. bojangles","freeway","usc","cat scan","phone booth","bar","drug addict","mental breakdown","fire","lithium","cocaine","raccoon","hit by a car","standing in the middle of traffic","talking to oneself","fear","blood","violence","epilogue","dancing","dancer","drunkenness","drinking","drink","tears","crying","pajamas","undressing","los angeles river","apartment","underwear","emergency room","mother son relationship","father son relationship","urine sample","los angeles philharmonic orchestra","orchestra rehearsal","underpass","rehearsal","hiding","group therapy","therapy","slow motion scene","song","singing","singer","pay phone","telephone call","cell phone","listening to music","cigarette smoking","storytelling","aunt niece relationship","tape recorder","bible","snowing","snow","face injury","head injury","brother sister relationship","reference to god","family relationships","concert hall","concert","flash forward","hearing voices","multiple narrators","subjective camera","street musician","passion","drug use","bicycle","hospital","ambulance","taxi","prologue","violinist","homeless man","urination","statue","reference to ludwig van beethoven","voice over narration","black eye","bicycle accident","atheist","violin","traffic tunnel","street life","skid row","schizophrenia","savant","reporter","rehabilitation","prodigy","paranoia","orchestra","newspaper","newspaper reporter","musical prodigy","musical genius","mental illness","los angeles california","juilliard school manhattan new york city","homelessness","genius","friend","friendship","flashback","ex husband ex wife relationship","editor","chance meeting","cello","cellist","black american","african american"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:51:39"}}