{"data":{"movies":[{"title":"Dead Air","originalTitle":"","year":"2009","releaseDate":"2009","directors":[{"name":"Corbin Bernsen","id":"nm0000929"}],"writers":[{"name":"Kenny Yakkel","id":"nm0945035"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTA2NDgwOF5BMl5BanBnXkFtZTcwMjg3NzM1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Sci-Fi","Thriller"],"plot":"Radio Host, Logan Burnhardt, starts off his show with off-beat questions such as the whereabouts of the Taj Mahal, and why it is only photographed from the front. With listeners calling in on a variety of issues, he soon becomes aware that terrorists have planted chemical bombs in stadiums and crowded areas that make people violent. He subsequently asks his colleague to travel home to ensure that his wife, Gabbi, and child are safe - not knowing that terrorists will soon take over the building and hold him and other colleagues hostage and force them to make a live broadcast of their real agenda.","simplePlot":"Logan Burnhardt is the ego-king of the airwaves, but his unflappable persona is put to the test when a terrorist bio-attack unleashes a plague of flesh-ripping maniacs on Los Angeles.","actors":[{"actorName":"Haley Pullos","urlProfile":"http://www.imdb.com/name/nm2610277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzE5MDY5M15BMl5BanBnXkFtZTgwMTA4MjA2MDI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1998","placeOfBirth":" Palo Alto, California, USA","birthName":"Haley Alexis Pullos","height":"5' 3\" (1.6 m)","bio":"Haley Pullos was born on July 10, 1998 in Palo Alto, California, USA as Haley Alexis Pullos. She is an actress, known for General Hospital (1963), Instant Mom (2013) and House (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzE5MDY5M15BMl5BanBnXkFtZTgwMTA4MjA2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2610277","name":"Haley Pullos","idIMDB":"nm2610277"},"actorId":"nm2610277","character":"Dee Dee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Moscow","urlProfile":"http://www.imdb.com/name/nm0608378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDY3MDA5Nl5BMl5BanBnXkFtZTcwMDYyNjQxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1974","placeOfBirth":" New York City, New York, USA","birthName":"David Raphael Moscow","height":"5' 9½\" (1.77 m)","bio":"David Moscow was born on November 14, 1974 in New York City, New York, USA as David Raphael Moscow. He is an actor and producer, known for Big (1988), Just Married (2003) and Newsies (1992). He has been married to Karen Riotoc Moscow since September 6, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDY3MDA5Nl5BMl5BanBnXkFtZTcwMDYyNjQxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0608378","name":"David Moscow","nicknames":["Rafe"],"idIMDB":"nm0608378"},"actorId":"nm0608378","character":"Gil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corbin Bernsen","urlProfile":"http://www.imdb.com/name/nm0000929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDQ4Njk4OV5BMl5BanBnXkFtZTcwNjY0MDk4Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1954","placeOfBirth":" North Hollywood, Los Angeles, California, USA","birthName":"Corbin Dean Bernsen","height":"5' 10¾\" (1.8 m)","bio":"Corbin Bernsen made his initial mark on the seminal television series L.A. Law as opportunistic divorce lawyer \"Arnie Becker\" earning him multiple Emmy and Golden Globe nominations over the show's eight-year run. He proved along the way the role was not to be a dead-end stereotype, maintaining a steady career in both television and film over the course of three decades. Moreover, his intent devotion to his career and love for the craft has compelled him in recent years to climb into the producer/writer, and director's chair. Born in North Hollywood, California, on September 7, 1954, Corbin was raised in and around the entertainment business. The eldest of three children, his father film and television producer Harry Bernsen and mother, veteran actress Jeanne Cooper encouraged him to continue the family tradition. After high school he originally attended UCLA with the intention of pursuing law, but instead, he went on to receive a BFA in Theatre Arts and MFA in Playwriting. He worked on the Equity-waiver L.A. stage circuit as both actor and set designer, making his film debut as a bit player in his father's picture Three the Hard Way. He then set his sights on New York in the late 70s. In the early years he carved out a living as a carpenter building rooftop decks in NYC that still stand to this day. Then in 1983 he landed the role of \"Ken Graham\" on daytime's Ryan's Hope and he put his tool belt away. This break led to an exclusive deal with NBC and eventually the TV role in L.A. Law. The perks of his \"newly-found stardom\" on L.A. Law included a hosting stint on Saturday Night Live and the covers of numerous major magazines. Not one to settle for what he knew could be fleeting comfort, he worked diligently to parlay his small screen success into a diverse resume of feature film roles, both starring and supporting, often enjoying the challenge of portraying unsympathetic characters with an infusion of charm and likability. He co-starred as Shelley Long's egotistical husband in the reincarnation comedy Hello Again; played an equally vain Hollywood star in the musical comedy Bert Rigby, You're a Fool; and starred as a disorganized ringleader of a band of crooks in the bank caper Disorganized Crime. He capped the 1980s decade opposite Charlie Sheen and Tom Berenger in the box office hit Major League, which took advantage of his natural athleticism, playing ballplayer-cum-owner \"Roger Dorn\". Two sequels followed. Other notable feature film work includes the mystery thriller Shattered, directed by Wolfgang Peterson, which re-teamed him with Tom Berenger, Stephen Frears' Lay The Favorite, and a turn opposite Robert Downey Jr. in Shane Black's Kiss Kiss Bang Bang. On the TV front, he has appeared in many MOW's including Line of Fire: The Morris Dees Story as the famed civil rights attorney who founded the Southern Poverty Law Center. Topping it off, Corbin's title role in the horror/ thriller The Dentist for HBO had audiences developing a similar paranoia of tooth doctors as Anthony Perkins invoked decades before to motel clerks. As spurned husband-turned-crazed dentist \"Dr. Alan Feinstone\", Corbin reached cult horror status. The movie spawned a sequel in which he also served as a producer. Most recently, he has reunited with Dentist director Brian Yuzna on a slate of films exploring similar themes starting with \"The Plastic Surgeon.\" More recently Bernsen wrapped eight seasons on USA Network's hit series Psych as Henry Spencer playing James Roday's retired cop father who taught his \"fake psychic,\" crime solving son everything he knows. In 2006 he formed his own production company, Team Cherokee Productions to exert more creative control over his projects and begin exploring material both as writer, director and producer. Today that company has taken root as Home Theater Films, an early player in the Faith and Family film genre. The company has explored a wide variety of themes beginning with the film \"Rust\" which was distributed by Sony Pictures. With five other films under their belt, including \"25 Hill,\" \"Beyond the Heavens,\" \"Christian Mingle\" starring Lacey Chabert, and the upcoming \"Jesse and Naomi,\" Home Theater Films has firmly carved a niche and name in this lucrative genre. Corbin has been happily married (since 1988) to British actress Amanda Pays who most recently be seen on \"The Flash.\" They have appeared together in the sci-fi film Spacejacked and the TV-movies Dead on the Money and The Santa Trap, among others. The couple has four sons. Never one to become complacent or fall prey to the hype - a lesson learned from his mother - he still practices his carpenter skills at home as he continues to write, produce, and direct. Perseverance and dedication has played a large part in his continued success. Having a savvy take-charge approach hasn't hurt either -- characteristics worthy of many of the characters he's explored on screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDQ4Njk4OV5BMl5BanBnXkFtZTcwNjY0MDk4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000929","name":"Corbin Bernsen","idIMDB":"nm0000929"},"actorId":"nm0000929","character":"Dr. F","urlCharacter":"http://www.imdb.com/character/ch0143067","main":true},{"actorName":"Bill Moseley","urlProfile":"http://www.imdb.com/name/nm0608405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDUwNDAyMl5BMl5BanBnXkFtZTgwNTc1Mjc2OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1951","placeOfBirth":" Stamford, Connecticut, USA","birthName":"William Moseley","height":"6' (1.83 m)","bio":"William \"Bill\" Moseley (born November 11, 1951) is an American film actor and musician who has starred in a number of cult classic horror films, including House of 1000 Corpses (2003), Repo! The Genetic Opera (2008) and The Devil's Rejects (2005). His first big role was in The Texas Chainsaw Massacre 2 (1986) as Chop Top. On the HBO TV series La caravane de l'étrange (2003), Moseley had a recurring role as camp cook Possum. He has also released records with guitarist Buckethead in the band Cornbugs, as well as featuring on the guitarist's solo work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDUwNDAyMl5BMl5BanBnXkFtZTgwNTc1Mjc2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0608405","name":"Bill Moseley","idIMDB":"nm0608405"},"actorId":"nm0608405","character":"Logan","urlCharacter":"http://www.imdb.com/character/ch0076060","main":true},{"actorName":"Jeanne Cooper","urlProfile":"http://www.imdb.com/name/nm0178137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNzk2MzAwMF5BMl5BanBnXkFtZTYwMzE1MzA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1928","placeOfBirth":" Taft, California, USA","birthName":"Wilma Jeanne Cooper","height":"5' 3½\" (1.61 m)","bio":"Jeanne Cooper was born on October 25, 1928 in Taft, California, USA as Wilma Jeanne Cooper. She was an actress, known for The Young and the Restless (1973), The Boston Strangler (1968) and Bracken's World (1969). She was married to Harry Bernsen. She died on May 8, 2013 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNzk2MzAwMF5BMl5BanBnXkFtZTYwMzE1MzA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0178137","name":"Jeanne Cooper","idIMDB":"nm0178137"},"actorId":"nm0178137","character":"Paranoid Caller #1","urlCharacter":"http://www.imdb.com/character/ch0384167","main":true},{"actorName":"Patricia Tallman","urlProfile":"http://www.imdb.com/name/nm0848191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE5NzU0Nl5BMl5BanBnXkFtZTcwODY4MDEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1957","placeOfBirth":" Pontiac, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"When she portrayed \"Lyta Alexander\" in the Hugo Award-winning sci-fi series Babylon 5 (1994), Patricia Tallman was the most powerful telepath in the universe. Seems fitting, considering that the actress knew she was going to be in show business at the early age of two. It was then that she first appeared with her father, Jerry, on his Midwest radio show, soloing on \"Bicycle Built for Two\". By age 15, Pat was performing in summer stock at the Red Barn Theatre in Saugatuck, Michigan, doing ten shows in 11 weeks. She soon spent all of her high school vacations in professional summer stock, and eventually chose Carnegie Mellon University to earn a BFA in its prestigious theater arts program. While other theater majors waited tables, Pat worked her way through college, performing in eighteen musicals at the Pittsburgh Civic Light Opera. Recognizing Pat's formidable talents, CMU presented her with an award for Outstanding Achievement in Acting. Immediately after college, Pat moved to New York City, where she landed a role in the long-running off-Broadway hit \"Big, Bad Burlesque\". She went on to score other parts on the New York stage, including her favorite, \"Rosalind\" in the Riverside Shakespeare Company's production of \"As You Like It\". Television roles began shortly thereafter, when Pat was cast in a recurring role on the CBS soap opera, Guiding Light (1952). This led to roles on virtually every New York-based daytime serial. Film roles were not far behind. George A. Romero contacted her to play a role in his feature Knightriders (1981), starring Ed Harris. This led to a long working relationship with him. Pat relocated to Los Angeles , where she again worked with Romero on Creepshow 2 (1987). The film she is perhaps best known for followed: George Romero and Tom Savini's remake of the 1968 cult classic, Night of the Living Dead (1990). The move to L.A. was a smart one, Pat discovered, as she was soon cast as undercover cop \"Christy Russell\" on NBC's Generations (1993), and as an evil, sexy swashbuckler in the Ring of the Musketeers (1992). Other films include Sweet Justice (1992), Benefit of the Doubt (1993), Austin Powers: International Man of Mystery (1997) and Austin Powers: The Spy Who Shagged Me (1999). Television shows include Star Trek: The Next Generation (1987), Star Runner (1990) (A USA Network pilot), Dark Skies (1996), Babylon 5 (1994) and \"The Universe and Harry Morgann\" (an independent pilot). Pat's other projects include starring in the science-fiction thriller Never Die Twice (2001) and playing one of the leads, Lt. Richmond, in two audio plays, \"Lives of the Cat\" and \"Anne Manx\". In addition, her voice can be heard in the cartoon \"Babylon 5\" parodies Babylon Park: Frightspace (1999) and Grudge Match (2000). Equally important to Patricia are her roles of mother to son her Julian, as well as her fund-raising activities for the children of Penny Lane. Through her tireless efforts within the science fiction community, Pat and her fans have contributed more than $250,000 to Penny Lane over the past several years, the bulk of which transformed the CARE Computer Lab dream into reality. Since 1996, Pat, her friends, family and fans have made a holiday happen for the Penny Lane kids, through the Be A Santa program. Dedicated Patricia Tallman fans make a hobby of trying to spot her in her many stunt performances. An extremely athletic and former fearless member of the Stunt Woman's Association of Motion Pictures, Pat has tumbled, slid and taken punches for the likes of Laura Dern (in Jurassic Park (1993)), Gates McFadden (in \"Star Trek: Generations\"), Geena Davis (in The Long Kiss Goodnight (1996)) and Laura Prepon (in Karla (2006)). Pat's roots as a stage actress have never left her, and she continues to tread the footlights in Los Angeles whenever film and TV work allow her the time. Her latest projects include Dead Air (2009), a psychological horror film directed by Corbin Bernsen, for which her performance is getting great reviews. Pat has a book out \"Pleasure Thresholds, Patricia Tallman's Babylon 5 Memoirs\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE5NzU0Nl5BMl5BanBnXkFtZTcwODY4MDEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848191","name":"Patricia Tallman","idIMDB":"nm0848191"},"actorId":"nm0848191","character":"Lucy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Lauria","urlProfile":"http://www.imdb.com/name/nm0491357","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MTIxOTUyMV5BMl5BanBnXkFtZTcwMjE4NTkzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1947","placeOfBirth":" Brooklyn, New York, USA","height":"5' 11½\" (1.82 m)","bio":"Dan Lauria was born on April 12, 1947 in Brooklyn, New York, USA. He is an actor, known for The Wonder Years (1988), One Life to Live (1968) and Independence Day (1996). He was previously married to Eileen Cregg.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MTIxOTUyMV5BMl5BanBnXkFtZTcwMjE4NTkzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0491357","name":"Dan Lauria","idIMDB":"nm0491357"},"actorId":"nm0491357","character":"Fred","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Drake","urlProfile":"http://www.imdb.com/name/nm0236952","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzg5NTUyOV5BMl5BanBnXkFtZTYwOTAwODU3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1949","placeOfBirth":" Tulsa, Oklahoma, USA","birthName":"Lawrence Richard Drake","height":"6' 3\" (1.91 m)","bio":"Larry Drake was born on February 21, 1949 in Tulsa, Oklahoma, USA as Lawrence Richard Drake. He was an actor and director, known for L.A. Law (1986), Darkman (1990) and Bean (1997). He was married to Ruth de Sosa. He died on March 17, 2016 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzg5NTUyOV5BMl5BanBnXkFtZTYwOTAwODU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236952","name":"Larry Drake","idIMDB":"nm0236952"},"actorId":"nm0236952","character":"Vernon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Navid Negahban","urlProfile":"http://www.imdb.com/name/nm1041023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E0M2Q4MGEtZmU4MC00YTVlLWI5YzYtNzNhNjc4OTU5NjI5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1968","placeOfBirth":" Iran","height":"5' 11¾\" (1.82 m)","bio":"Navid, though sometimes called \"the man of a thousand faces,\" is still most widely regarded as Abu Nazir, the enigmatic al-Qaeda leader he played for two seasons on Showtime's Emmy-winning original series \"Homeland.\" Among his many fans are Israeli president Shimon Peres and U.S. president Barack Obama. The versatile, scene-stealer has drawn critical praise as IRK delegate Jamot on the final season of Fox's hit series, \"24,\" and has appeared on \"CSI: NY,\" \"CSI: Miami,\" \"NCIS: Los Angeles,\" \"Law & Order: SVU,\" \"The Closer,\" \"The Game,\" \"Criminal Minds,\" \"Lost,\" \"JAG,\" \"The West Wing,\" \"Without a Trace,\" \"The Shield\" and others. Navid's star continues to rise on the big screen. He was a standout in Clint Eastwood's Oscar-nominated blockbuster \"American Sniper\" as Sheikh Al-Obodi, an Iraqi local paid to help the snipers locate their targets. He can next be seen in \"Baba Joon,\" the first Persian-language film shot in Israel from director Yuval Delshad. \"Variety\" proclaims Navid once again \"transforms in the role of Yitzhak,\" a turkey farmer struggling to pass his Iranian traditions onto his precocious Israeli-born son. The film, which received best picture at Israel's Ophir Awards, is now set to be the Jewish State's submission for the Academy Awards for Best Foreign Film. Navid recently wrapped principal photography in Vancouver on \"Brain on Fire,\" a biographical drama with Chloë Grace Moretz, Carrie-Anne Moss and Richard Armitage, and this spring he was shooting in Morocco with Jonathan Rhys Meyers, John Hurt and Olivia Thirlby in the espionage thriller \"Damascus Cover.\" His additional credits include a leading role in the critically acclaimed feature \"The Stoning of Soraya M.\" The \"New York Times\" called his portrayal of Ali as \"satanic as any horror-movie apparition.\" Navid also had significant supporting roles in the films \"Brothers\" starring Tobey Maguire and Jake Gyllenhaal; \"Powder Blue\" with Jessica Biel and Forest Whitaker; \"Charlie Wilson's War\" starring Tom Hanks, Julia Roberts and Amy Adams and \"Words and Pictures\" with Clive Owens and Juliette Binoche. As an active voice-over actor, he lends his smoky tenor to \"Revolution 1979,\" a video game series based on the Iranian revolution. It was awarded support from the Doris Duke Foundation in partnership with Sundance Institute's New Frontier Program for the Islamic Art's New Frontier Fellowship. Born in Mashhad, Iran, Navid caught the acting bug at the age of eight, when his portrayal of an old man drew laughter from a large audience at an elementary school play. His passion for acting led him to Germany where he spent eight years honing his theatrical skills prior to arriving in the United States. He is fluent in English, Farsi and German, and in his spare time enjoys traveling, studying anthropology, shooting pool, driving and playing poker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E0M2Q4MGEtZmU4MC00YTVlLWI5YzYtNzNhNjc4OTU5NjI5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1041023","name":"Navid Negahban","idIMDB":"nm1041023"},"actorId":"nm1041023","character":"Abir","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Federico Dordei","urlProfile":"http://www.imdb.com/name/nm0196325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdhMzI1N2UtZTkyMi00NmE2LWFmNTctNTA1MDA3MTNkODY2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1975","placeOfBirth":" Rome, Lazio, Italy","birthName":"Federico Dordei","height":"5' 11\" (1.8 m)","bio":"Federico Dordei was born on June 9, 1975 in Rome, Lazio, Italy. He is an actor, known for 2 Broke Girls (2011), Deuce Bigalow: European Gigolo (2005) and Girl Missing (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdhMzI1N2UtZTkyMi00NmE2LWFmNTctNTA1MDA3MTNkODY2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0196325","name":"Federico Dordei","idIMDB":"nm0196325"},"actorId":"nm0196325","character":"Kalil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Ruttan","urlProfile":"http://www.imdb.com/name/nm0711880","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY1NDU1ODY4Ml5BMl5BanBnXkFtZTcwNDUzNzY1MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1948","placeOfBirth":" Oregon City, Oregon, USA","birthName":"Susan Dunrud","height":"5' 6\" (1.68 m)","bio":"Susan Ruttan was born on September 16, 1948 in Oregon City, Oregon, USA as Susan Dunrud. She is an actress, known for L.A. Law (1986), Prayers for Bobby (2009) and Chances Are (1989). She was previously married to Randy McDonald and Melven Ruttan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY1NDU1ODY4Ml5BMl5BanBnXkFtZTcwNDUzNzY1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711880","name":"Susan Ruttan","idIMDB":"nm0711880"},"actorId":"nm0711880","character":"Maggie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Ray Parker","urlProfile":"http://www.imdb.com/name/nm0662562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIxNjk1MDQwNV5BMl5BanBnXkFtZTcwNTQwMjUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1958","placeOfBirth":" Saginaw, Michigan, USA","height":"6' 1\" (1.85 m)","bio":"Anthony Ray Parker was born on May 13, 1958 in Saginaw, Michigan, USA. He is an actor, known for The Matrix (1999), The Marine (2006) and Fantômes contre fantômes (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIxNjk1MDQwNV5BMl5BanBnXkFtZTcwNTQwMjUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662562","name":"Anthony Ray Parker","idIMDB":"nm0662562"},"actorId":"nm0662562","character":"Tanner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Davis","urlProfile":"http://www.imdb.com/name/nm1151921","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIzNzQ3MzY5M15BMl5BanBnXkFtZTgwNjYwMzI0NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Jason Davis was born in Pine Bluff, Arkansas, USA. He is an actor and producer, known for The Accountant (2016), Talladega Nights: The Ballad of Ricky Bobby (2006) and Step Brothers (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIzNzQ3MzY5M15BMl5BanBnXkFtZTgwNjYwMzI0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1151921","name":"Jason Davis","idIMDB":"nm1151921"},"actorId":"nm1151921","character":"Maniac","urlCharacter":"http://www.imdb.com/character/ch0143164","main":true},{"actorName":"Tammy Felice","urlProfile":"http://www.imdb.com/name/nm2176463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxOTU5NTQ2NTZeQTJeQWpwZ15BbWU3MDMxOTIyODk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Tammy Felice is an actress, known for Live Fast, Die Young (2008), Hack! (2007) and Vanquisher (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxOTU5NTQ2NTZeQTJeQWpwZ15BbWU3MDMxOTIyODk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2176463","name":"Tammy Felice","nicknames":["T-Pie"],"idIMDB":"nm2176463"},"actorId":"nm2176463","character":"Colleague #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danielle Petty","urlProfile":"http://www.imdb.com/name/nm0678776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTEyNDQxOV5BMl5BanBnXkFtZTYwNTAxMDcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1970","placeOfBirth":" Bellevue, Washington, USA","height":"5' 7\" (1.7 m)","bio":"She was born in Bellevue Washington. Her grandmother introduced her to the world of acting in her tavern, singing and dancing with her sister and cousins. When Ron Howard and Mickey Rourke came to shoot a movie on her grandparents house in Issaquah, Washington, she was given her first film role. This experience brought the light to what she wanted to do for the rest of her life. Danielle came to Los Angeles and was having a hard time even getting an audition. As time passed her by, she decided that the Indy movie market might be the way to help open doors. As time keeps ticking by, she seems to be getting closer and closer to her dream. Doors are opening and she's got the chops to close them behind her. Danielle is someone you might want to keep an eye out for in the near future.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTEyNDQxOV5BMl5BanBnXkFtZTYwNTAxMDcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0678776","name":"Danielle Petty","idIMDB":"nm0678776"},"actorId":"nm0678776","character":"Business Woman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0993841","urlIMDB":"http://www.imdb.com/title/tt0993841","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.3","filmingLocations":[],"awards":[],"votes":"2,039","type":"Movie","companyCreditsSimple":[{"idCompany":"co0261067","name":"Team Cherokee Productions"},{"idCompany":"co0185880","name":"Antibody Films"}],"keywords":{"keywords":["stadium","radio host","hostage","glass shard","vaccine","trapped in a building","thrown from a car","terrorism","telephone call","syringe","subtitled scene","staircase","stabbed with scissors","stabbed in the neck","stabbed in the chest","stabbed in the back","sound effects","shot in the head","shot in the forehead","shot in the chest","security guard","scratching","rubik's cube","riot","reporter","radio broadcast","producer","power outage","murder of a police officer","pistol","parking garage","paranoia","news report","murder","motorcycle","mop","los angeles california","kicked in the stomach","interracial couple","injection","infection","impalement","husband wife relationship","homeless person","home invasion","hit by a motorcycle","helicopter","held at gunpoint","gong","gas","gas mask","foot chase","flickering light","film starts with a quote","exposed breast","ex husband ex wife relationship","elevator","directed by star","death","corpse","child in peril","cell phone","bus","brother murders brother","breaking through a door","bluetooth","blood","blood splatter","bleeding from eyes","bitten in the neck","biker","basketball game","radio station"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:29:45"}}