{"data":{"movies":[{"title":"Hallowed Ground","originalTitle":"","year":"2007","releaseDate":"20071009","directors":[{"name":"David Benullo","id":"nm0073026"}],"writers":[{"name":"David Benullo","id":"nm0073026"}],"runtime":"83 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NjE1MjcwNTZeQTJeQWpwZ15BbWU3MDE0NjEyMzI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"When her car breaks down in a small town, Liz Chambers (Jaimie Alexander) meets journalist Sarah Austin (Hudson Leick), who tells her about the town's bloodthirsty past. A hundred years ago, the town preacher nailed people to crosses, sacrificing them as living scarecrows","simplePlot":"When her car breaks down in a small town, Liz Chambers (Jaimie Alexander) meets journalist Sarah Austin (Hudson Leick), who tells her about the town's bloodthirsty past. A hundred years ago... ","actors":[{"actorName":"Jaimie Alexander","urlProfile":"http://www.imdb.com/name/nm1526352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzAzMzQyNl5BMl5BanBnXkFtZTgwMTU3OTA2MDE@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1984","placeOfBirth":" Greenville, South Carolina, USA","birthName":"Jaimie Lauren Tarbush","height":"5' 9\" (1.75 m)","bio":"Jaimie Alexander was born in Greenville, South Carolina, but moved with her family to Grapevine, Texas, when she was four years old. She took theatre classes in grade school as a hobby but was kicked out in high school because she could not sing, and so she took up sports instead. At age 17 she substituted for a friend at a meeting with a scouting agency and she met her manager, Randy James, who sent her some scripts. After graduating from high school she moved to Los Angeles, California, to pursue acting. Her career was launched in 2003 when she was cast in the leading role of Hanna Thompson in the low-budget award-winning film The Other Side (2006). According to the DVD commentary, she was originally at the audition to help out by reading against the male actors, but director Gregg Bishop decided to cast her in the leading role after hearing her perform the lines. Her second role was in 2004 in Squirrel Trap (2004), in which she played the co-lead role of Sara. A year later she was cast as Jessi XX on the ABC Family series Kyle XY (2006), in which she played the role of a superhuman being created by scientists as a laboratory experiment. She was nominated for the Saturn Awards as \"Best Supporting Actress on Television\" for that role in 2008. Her biggest role came in 2011, when she was cast as Lady Sif, a warrior goddess of Asgard, in the blockbuster from Marvel Comics, Thor (2011). She later reprised her role in its sequel, Thor: The Dark World (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzAzMzQyNl5BMl5BanBnXkFtZTgwMTU3OTA2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1526352","name":"Jaimie Alexander","nicknames":["James"],"idIMDB":"nm1526352"},"actorId":"nm1526352","character":"Liz Chambers","urlCharacter":"http://www.imdb.com/character/ch0081812","main":true},{"actorName":"Brian McNamara","urlProfile":"http://www.imdb.com/name/nm0573658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWIxY2RjNmEtZTFhYi00MGE4LWE2M2YtZDQ3ZDUyYTQyNzE5XkEyXkFqcGdeQXVyMjAyNzY0MTU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1960","placeOfBirth":" Long Island, New York, USA","bio":"Brian McNamara is a character actor, director and producer who has made over 100 TV and film appearances. His first major role was in the Garry Marshall comedy drama The Flamingo Kid (1984) with Matt Dillon. He then went on to star opposite Ally Sheedy and Steve Guttenberg in the John Badham science fiction project Short Circuit (1986), which performed well at the box office. The following year he put in a solid lead performance as Dean Karny in the thriller Billionaire Boys Club (1987): the film was based on an actual event and co-starred Judd Nelson and John Stockwell. Brian switched easily into slapstick comedy next with a supporting role in Caddyshack II (1988), where he shared the screen with veteran comedians Dan Aykroyd, Chevy Chase, and Jackie Mason. He helped Jeff Daniels and John Goodman battle grossly mutated spiders in the Frank Marshall horror comedy Arachnophobia (1990), and shined in the romantic comedy Mystery Date (1991) opposite Ethan Hawke and Teri Polo. Since then he has maintained a steady career in film - most notably a great performance in the independent film The Legend of Tillamook's Gold (2006)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWIxY2RjNmEtZTFhYi00MGE4LWE2M2YtZDQ3ZDUyYTQyNzE5XkEyXkFqcGdeQXVyMjAyNzY0MTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573658","name":"Brian McNamara","idIMDB":"nm0573658"},"actorId":"nm0573658","character":"Sheriff O'Connor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ethan Phillips","urlProfile":"http://www.imdb.com/name/nm0680392","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0Mzk3MzUxOV5BMl5BanBnXkFtZTgwMzIxMjU4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1955","placeOfBirth":" Garden City, Long Island, New York, USA","height":"5' 6\" (1.68 m)","bio":"Ethan Phillips was born on February 8, 1955 in Garden City, Long Island, New York as the only boy of six children. He graduated from Boston University with a degree in English Literature and received a Masters Degree in Fine Arts from Cornell University. He began his acting career on stage in both Broadway and off-Broadway shows, recently appearing in the premier of David Mamet's \"November\" with Nathan Lane at Broadway's Ethyl Barrymore and in the title character opposite Peter Dinklage in the all-male cast of \"The Imaginary Invalid\" for Bard College's SummerScape Festival 2012. Also in New York, \"My Favorite Year\" at Lincoln Center, \"Measure for Measure\" for the NYSF, \"Lips Together Teeth Apart\" for Manhattan Theatre Club, and \"Modigliani\" at the Astor Place, as well as new works for Playwrites Horizons, Ensemble Studio Theatre, the Hudson Guild Theatre, the American Jewish Theatre, and many others. During his comprehensive acting career, he also played leading roles for many of the major regional theaters around the country such as San Diego Old Globe, Seattle Rep, Alaska Rep, Actors' Theatre of Louisville, Mark Taper Forum, Baltimore Center Stage, the Geffen in Los Angeles, Pasadena Playhouse, Westport Country Playhouse, the McCarter Theatre, and the Boston Shakespeare Company. He spent ten summers at the Sundance Theatre Lab and is a co-founder of First Stage in Los Angeles, which has been developing new plays for over twenty years. Phillips has been on several popular TV shows and movies, including five seasons on Benson (1979), and seven seasons on Star Trek: Voyager (1995). He has been a guest star on scores of other television shows. Ethan has appeared in many feature films and award winning shorts and has an active voice-over career. Phillips is also a playwright and an author. His original play, \"Penguin Blues\" has been produced more than 150 times throughout USA and Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0Mzk3MzUxOV5BMl5BanBnXkFtZTgwMzIxMjU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0680392","name":"Ethan Phillips","nicknames":["Johnny"],"idIMDB":"nm0680392"},"actorId":"nm0680392","character":"Preacher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chloë Grace Moretz","urlProfile":"http://www.imdb.com/name/nm1631269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODk0Mzc0Ml5BMl5BanBnXkFtZTgwNDYzMzgzMzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1997","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 4\" (1.63 m)","bio":"Chloë Grace Moretz was born in Atlanta, Georgia, to Teri (Duke), a nurse, and McCoy Lee Moretz, a plastic surgeon. She has four brothers, all older, including actor Trevor Duke-Moretz. Her ancestry is mostly German and English. Chloë's first two appearances were as Violet in two episodes of the series The Guardian (2001). Her first movie role was as Molly in Heart of the Beholder (2005), a story about a family that opened the first video rental store in 1980. This was followed by a small role in Family Plan (2005) as Young Charlie. After that, however, came Chloe's biggest role, and the one that made her famous: The Amityville Horror (2005), the remake of the famous The Amityville Horror (1979). Next she landed a small role in Today You Die (2005) as the Little Girl, and has since appeared in Room 6 (2006) and Big Momma's House 2 (2006). She filmed Wicked Little Things (2006) in Bulgaria, in which she plays Emma Tunney. In 2007 she completed The Third Nail (2007), in which she appeared as Hailey Deonte. In 2010 she appeared as Hit-Girl in director Matthew Vaughn's action film Kick-Ass (2010), based on the comic book series of the same name by Mark Millar and John Romita Jr. Although her role in the violent action film engendered some controversy, she received widespread critical acclaim for her portrayal. Moretz trained with Jackie Chan's stunt crew for three months prior to filming \"Kick-Ass\" and did most of her own stunts in the film. Also that year she played Abby, a 12-year-old vampire, in Let Me In (2010), the UK/US remake of the Swedish film Let the Right One In (2008), which was released on October 1, 2010. She played Ann Sliger in the crime thriller Texas Killing Fields (2011), released on October 14, 2011. Chloe next played Isabelle in Martin Scorsese's Hugo (2011), a film adaptation of \"The Invention of Hugo Cabret\". \"Hugo\", which was nominated for 11 Oscars, co-starred Asa Butterfield, Ben Kingsley, Sacha Baron Cohen and Helen McCrory. Moretz then starred in Hick (2011), an adaptation of the novel by Andrea Portes. She was in Tim Burton's Dark Shadows (2012), based on the iconic TV series Dark Shadows (1966), playing the role of Carolyn Stoddard, a rebellious teenage daughter. In 2013 she reprised her role as Hit-Girl in the sequel Kick-Ass 2 (2013), which received mixed reviews, but once again her performance was highly praised. The same year she also appeared in a short segment in Movie 43 (2013) and played the title character in Carrie (2013), a remake of Carrie (1976), based on a Stephen King story and directed by Kimberly Peirce. In January 2013 Moretz was chosen to play Mia in the film adaptation of Gayle Forman's If I Stay (2014), which was released in August 2014. On January 16, 2014, it was announced Moretz would appear in an off-Broadway show directed by Steven Soderbergh entitled \"The Library\". In 2014 Chloë was in six films: a cameo as a newspaper girl in Muppets Most Wanted (2014), the female lead of prostitute Teri alongside Denzel Washington in The Equalizer (2014) and teenage party girl Annika with Keira Knightley and Sam Rockwell in Laggies (2014). In December she played the role of very young Hollywood actress with a scandalous reputation Jo-Ann Ellis alongside Kristen Stewart and Juliette Binoche in Sils Maria (2014). In April it was announced that Chloë would be playing the lead role of Cassie Sullivan in The 5th Wave (2016), another adaptation similar to The Hunger Games (2012), alongside Nick Robinson and Alex Roe. It was later announced that Chloë would play the lead female role of Digger in the movie adaptation of Sam Munson's novel \"November Criminals\". Moretz's character is the best friend of Addison Schacht, played by Ansel Elgort,","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODk0Mzc0Ml5BMl5BanBnXkFtZTgwNDYzMzgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1631269","name":"Chloë Grace Moretz","nicknames":["Chloë Grace","Chloe the braniac"],"idIMDB":"nm1631269"},"actorId":"nm1631269","character":"Sabrina","urlCharacter":"http://www.imdb.com/character/ch0465525","main":true},{"actorName":"Ned Vaughn","urlProfile":"http://www.imdb.com/name/nm0891224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTE3NzA1MV5BMl5BanBnXkFtZTcwOTAwNzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1964","placeOfBirth":" Huntsville, Alabama, USA","bio":"Ned Vaughn grew up in Huntsville, Alabama and first acted at age 8 in a community theatre production of \"Oliver!\" The son of an artist and a civilian Army public affairs specialist, he mixed acting with athletics and music until leaving high school. In college, he began to concentrate seriously on pursuing a career as an actor. A year and a half later, he dropped out of college and took the bold step of moving to New York with $600 and a one-way rental car. To make ends meet, he worked as a doorman at the Wellington Hotel while auditioning and studying at the famed HB Studio. Ned won quick success in TV commercials, but was still working as a doorman when his big break came. He auditioned for a starring role in the feature film \"The Rescue\" and was ultimately cast as the heroic son of a captured Navy Seal. After shooting the film in New Zealand and Hong Kong, he moved to Los Angeles, where he has lived and worked ever since. Ned's rich career has taken him around the world, from submarines to mountaintops, but the role he cherishes most is that of husband and father. He and his wife Adelaide were married in 1997 and are the happy, busy parents of five children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTE3NzA1MV5BMl5BanBnXkFtZTcwOTAwNzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0891224","name":"Ned Vaughn","idIMDB":"nm0891224"},"actorId":"nm0891224","character":"Deputy Mark Simmons","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Cody Williams","urlProfile":"http://www.imdb.com/name/nm0930908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDA2MzcxNF5BMl5BanBnXkFtZTcwNDUxMTYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Jim Cody Williams is known for his work on Pirates of the Caribbean: Dead Man's Chest (2006), Dodgeball: A True Underdog Story (2004) and Bill & Ted's Excellent Adventure (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDA2MzcxNF5BMl5BanBnXkFtZTcwNDUxMTYzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930908","name":"Jim Cody Williams","idIMDB":"nm0930908"},"actorId":"nm0930908","character":"Earl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tamara Clatterbuck","urlProfile":"http://www.imdb.com/name/nm0004830","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMzQ1Mjg5Ml5BMl5BanBnXkFtZTgwMzAwNDE2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1963","placeOfBirth":" Seattle, Washington, USA","height":"5' 6\" (1.68 m)","bio":"Tamara Clatterbuck was born on May 26, 1963 in Seattle, Washington, USA. She is an actress, known for Criminal Minds (2005), The Young and the Restless (1973) and Days of Our Lives (1965). She has been married to Alexander Farkas since September 8, 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMzQ1Mjg5Ml5BMl5BanBnXkFtZTgwMzAwNDE2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004830","name":"Tamara Clatterbuck","idIMDB":"nm0004830"},"actorId":"nm0004830","character":"Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Chinlund","urlProfile":"http://www.imdb.com/name/nm0157915","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzE1OTI3N15BMl5BanBnXkFtZTgwNjIxODgzMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1961","placeOfBirth":" New York City, New York, USA","birthName":"Zareh Nicholas Chinlund","height":"6' 2½\" (1.89 m)","bio":"Nick Chinlund was born and raised in New York City. He left the city to play basketball at Brown University, but his hoops career was cut short when he suffered an injury during his freshman year. He stayed at Brown and took up acting classes, and realized it was his true calling. He graduated from Brown and moved to Los Angeles to pursue his film career. He worked in the theater and performed in many acclaimed plays. He worked at the Williamstown Theater Festival from 1988 to 1989. He started his film career in Lethal Weapon 3 (1992) and Eraser (1996) and has appeared on The X-Files (1993) and NYPD Blue (1993). He now lives in New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzE1OTI3N15BMl5BanBnXkFtZTgwNjIxODgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0157915","name":"Nick Chinlund","idIMDB":"nm0157915"},"actorId":"nm0157915","character":"Jonas Hathaway","urlCharacter":"http://www.imdb.com/character/ch0076411","main":true},{"actorName":"Hudson Leick","urlProfile":"http://www.imdb.com/name/nm0500098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ3MDc3NjQ2MV5BMl5BanBnXkFtZTgwNzkyNDYzMzE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1969","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Heidi Hudson Leick","height":"5' 7¾\" (1.72 m)","bio":"Heidi Hudson Leick, upon graduating high school, got a modeling gig in Japan; this was perfect because she loves traveling and modeling. When she returned to New York, her dream was to be an international model and then go into acting. One day, she quit modeling while in France, and pursued a TV career. After several episodes of Melrose Place (1992) and several TV movies, Hudson's big break in television came auditioning for her signature role of \"Callisto\" on Xena: Warrior Princess (1995). The casting people told her the part was that of a warrior queen, which she thought was great. Her audition consisted of doing a kick and throwing a chakram; having intimidated the crew, she got the part. Hudson attends Xena conventions as a guest of honor. She said her celebrity status surprises even her: when she had a birthday, several hundred fans sent her email messages. Her presence touches so many other people. She loves traveling, going on yoga retreats and climbing mountains. Hudson said at a convention, \"I really want to thank all the people who have been supportive of me. It is so appreciated.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ3MDc3NjQ2MV5BMl5BanBnXkFtZTgwNzkyNDYzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0500098","name":"Hudson Leick","idIMDB":"nm0500098"},"actorId":"nm0500098","character":"Sarah Austin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Warner","urlProfile":"http://www.imdb.com/name/nm1490516","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTIwYTJjOGEtNDQ0Ni00NGJlLTkwMjQtODk5Yjk5NGY2MjM5XkEyXkFqcGdeQXVyMjg2MTA3Mg@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1965","placeOfBirth":" Los Angeles, California, USA","birthName":"Daniel Paul Warner","height":"6' 1\" (1.85 m)","bio":"Dan Warner has been in everyone's home as an actor since the year 2000. From his award winning commercials to his gripping detective work and humorous banter opposite David Duchovny on Aquarius. He's currently (2016) working on a new series called \"Chance\" with Hugh Laurie, and last year was one of the leads in a film that was accepted and screened at the Cannes Film Festival! The same film \"Valley of Love\" starring Gérard Depardieu, won the coveted \"Cesar\" award for best cinematography. His deadpan response in situations in most of his funny commercials have been said to be reminiscent of the flawless timing of comedic greats like Jack Benny or a Johnny Carson.The same year Dan graced the cover of The Hollywood Reporter, he also won the Bobby Award as the best commercial actor in 2001. An accomplished dramatic sense has propelled Dan into the high drama as a Guest Star on such shows as Mad Men, Scandal, Aquarius and Ray Donovan, which some say his performance may win him critical recognition. What makes up a successful rising actor? If you ask Dan it begins with humility. He goes to work, and work he does, with a strong ethic of giving the directors what they want in a timely and professional manner. I guess it works says Dan. Just take a look at his resume and the proof is embedded there.It probably hasn't hurt that Dan has had the good fortune to study with The Groundling Theater, Greg Dean, along with Richard Lawson, and Jocelyn Jones. Dan also fancies himself as a gourmet cook although he's not had formal training, living on the Westside of Los Angeles in a lifestyle somewhat different from his rural beginnings in Northern California the spawning ground of many great actors.When he gets a chance to relax from his heavy schedule, you'll find Dan at the gym, in the kitchen or on the golf course. He also loves to participate in numerous charity fund-raisers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTIwYTJjOGEtNDQ0Ni00NGJlLTkwMjQtODk5Yjk5NGY2MjM5XkEyXkFqcGdeQXVyMjg2MTA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1490516","name":"Dan Warner","idIMDB":"nm1490516"},"actorId":"nm1490516","character":"Officer Chandler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randy Ross","urlProfile":"http://www.imdb.com/name/nm0743764","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2Q1NWE1YWMtYTQ5ZC00MmFhLWI5YTMtMDgxZjdjMjM3NjFkXkEyXkFqcGdeQXVyMzE5NjIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"A classic case of small town boy goes to the big city. Randy is originally from a little Oklahoma town of 1600 give or take a few. Great place to grow up and still a great place to visit but how he got out of there without a serious \"Okie\" accent is still a mystery. His stage debut was the lead role in his Sr. class play, \"Tell Me That You Love Me, Junie Moon\" by D.D. Brooke. Oklahoma State University gave him a degree in Landscape Design but performing & directing campus shows & musicals often took priority over studying. After a short stint in Dallas working as a commercial print model and studying acting, he bit the Big Apple, where he got an agent and booked print ads for BMW, AT&T, and Welbutrin, to name a few. His acting studies continued and soon he was booking roles on All My Children, Loving and some crazy small-budget films. Voice coach, Norma Garbo helped further develop his pop/rock/country vocals. He also led a teen youth group for kids from the Upper East Side and Spanish Harlem. After 3 yrs in NYC, he packed up a ton of stories and life experience and headed for Hollywood. He booked roles on shows like, The X-Files, The Unit, Las Vegas, short films, horror films, more TV, more soaps, more plays, more singing and even a little songwriting. Randy builds things and loves old cars! He's also creative in the kitchen where he can whip up a healthy gourmet meal complete with candle light, cloth napkins and a nice glass of wine. Five days a week at the gym keeps him fit and ready to play the bad guy, the good guy or shades of both.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2Q1NWE1YWMtYTQ5ZC00MmFhLWI5YTMtMDgxZjdjMjM3NjFkXkEyXkFqcGdeQXVyMzE5NjIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0743764","name":"Randy Ross","idIMDB":"nm0743764"},"actorId":"nm0743764","character":"Farmer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Larkin","urlProfile":"http://www.imdb.com/name/nm1510120","urlPhoto":"","biography":{"height":"6' (1.83 m)","bio":"Steve Larkin is an actor, known for Help for the Holidays (2012), Trunk (2008) and Beneath the Darkness (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1510120","name":"Steve Larkin","idIMDB":"nm1510120"},"actorId":"nm1510120","character":"Mayor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Meyers","urlProfile":"http://www.imdb.com/name/nm0583541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNTAxNDk2NV5BMl5BanBnXkFtZTYwNTU5OTcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1983","placeOfBirth":" Fort Leavenworth, Kansas, USA","bio":"Fred Meyers was born in Fort Leavenworth, Kansas. Currently lives in Burbank, California. Fred made his breakthrough in the popular Disney Channel television series Even Stevens (2000). He also played a bad boy in Suspended Animation (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNTAxNDk2NV5BMl5BanBnXkFtZTYwNTU5OTcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0583541","name":"Fred Meyers","idIMDB":"nm0583541"},"actorId":"nm0583541","character":"Lanky Teenager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Time Winters","urlProfile":"http://www.imdb.com/name/nm0936011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMjM2MjQyNF5BMl5BanBnXkFtZTgwNjU2NDMyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1956","placeOfBirth":" Lebanon, Oregon, USA","height":"6' 3\" (1.91 m)","bio":"Time Winters was born on February 3, 1956 in Lebanon, Oregon, USA. He is an actor, known for Thinner (1996), Sneakers (1992) and Gremlins 2: The New Batch (1990). He has been married to Tracy Winters since January 5, 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMjM2MjQyNF5BMl5BanBnXkFtZTgwNjU2NDMyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936011","name":"Time Winters","idIMDB":"nm0936011"},"actorId":"nm0936011","character":"Victim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Stanford Davis","urlProfile":"http://www.imdb.com/name/nm1017853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAyMDIxOTY4Nl5BMl5BanBnXkFtZTgwMjMxMTg0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1951","placeOfBirth":" St. Louis, Missouri, USA","height":"5' 11\" (1.8 m)","bio":"William Stanford Davis, born and raised in St. Louis, Missouri, is no stranger to the stage. He got his start in an R&B band as a youngster and remained the front man throughout his college years. Soon to be bitten by the comedy bug, he spent the next few years working at many of the comedy clubs across the country.\" It was only then, he discovered his true passion Acting. \"I love music and making people laugh but nothing feeds my soul like acting,\" he says.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAyMDIxOTY4Nl5BMl5BanBnXkFtZTgwMjMxMTg0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1017853","name":"William Stanford Davis","nicknames":["Stan"],"idIMDB":"nm1017853"},"actorId":"nm1017853","character":"Truck driver","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0914372","urlIMDB":"http://www.imdb.com/title/tt0914372","business":{"budget":{"money":"$1,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 23 min (83 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.5","filmingLocations":[],"awards":[],"votes":"1,238","type":"Video","companyCreditsSimple":[{"idCompany":"co0089252","name":"Daniel Grodnik Productions"},{"idCompany":"co0194987","name":"Liz's Garden Company"},{"idCompany":"co0210917","name":"Reel Entertainment"}],"keywords":{"keywords":["small town","preacher","evil man","lifting someone into the air","child","yelling","villain","toy","tied to a cross","small town sheriff","scarecrow","religious sacrifice","religious insanity","religious fanatic","religious cult","religion","preaching","police station","police car","pitchfork","orphan","occult","murder","murder of mother","murder of father","loss of mother","loss of father","key","insanity","insane preacher","insane man","human sacrifice","evil preacher","doll","diner","crying girl","crying child","crucifixion","crow","church","attempted sacrifice","attempted rape","attempted murder","attempted child murder","killer scarecrow","death of mother","death of father"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:40:23"}}