{"data":{"movies":[{"title":"Adolf Eichmann","originalTitle":"Eichmann","year":"2007","releaseDate":"200910","directors":[{"name":"Robert Young","id":"nm0950000"}],"writers":[{"name":"Snoo Wilson","id":"nm0934154"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNzU4NTk1MF5BMl5BanBnXkFtZTcwMjkwNjQ5Mg@@._V1.jpg","countries":["Hungary","UK"],"languages":["English","German","Hebrew","Spanish"],"genres":["Biography","Drama","History","War"],"plot":"Based upon the final confession of Adolf Eichmann, made before his execution in Israel as he accounts to Captain Avner Less, a young Israeli Police Officer, of his past as the architect of Hitler's plan for the final solution. Captured by intelligence operatives in Argentina, 15 years after World War II, Eichmann (Kretschmann), the World's most wanted man, must be broken down and the truth unveiled. As the world waits, two men must confront each other in a battle of wills- the result of which will change a nation forever.","simplePlot":"Based upon the final confession of Adolf Eichmann, made before his execution in Israel as he accounts to Captain Avner Less, a young Israeli Police Officer, of his past as the architect of ... ","actors":[{"actorName":"Avner W. Less","urlProfile":"http://www.imdb.com/name/nm3500452","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Avner W. Less yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3500452","name":"Avner W. Less","idIMDB":"nm3500452"},"actorId":"nm3500452","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Kretschmann","urlProfile":"http://www.imdb.com/name/nm0470981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Njc5MzE1OF5BMl5BanBnXkFtZTcwMTc1NDM4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1962","placeOfBirth":" Dessau, German Democratic Republic [now Saxony-Anhalt, Federal Republic of Germany]","height":"5' 9¼\" (1.76 m)","bio":"Thomas Kretschmann was born in East Germany. Before becoming an actor, he was a swimmer. He has acted in several popular American movies, such as Resident Evil: Apocalypse (2004), The Pianist (2002), U-571 (2000), In Enemy Hands (2004), etc. He has three children, Nicolas, Stella and Sascha with his ex-girlfriend Lena.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Njc5MzE1OF5BMl5BanBnXkFtZTcwMTc1NDM4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0470981","name":"Thomas Kretschmann","idIMDB":"nm0470981"},"actorId":"nm0470981","character":"Adolf Eichmann","urlCharacter":"http://www.imdb.com/character/ch0026858","main":true},{"actorName":"Troy Garity","urlProfile":"http://www.imdb.com/name/nm0004949","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzEwNjYwN15BMl5BanBnXkFtZTgwMjM2MjE5ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1973","placeOfBirth":" Los Angeles, California, USA","birthName":"Troy O'Donovan Garity","height":"6' 2\" (1.88 m)","bio":"Troy Garity is an actor known for his diverse body of work. Though his breakout film performance came when he starred opposite Bruce Willis, Cate Blanchett and Billy Bob Thorton in Barry Levinson's \"Bandits\", he is perhaps best known for his role as Isaac in the \"Barbershop\" film franchise. A role he will reprise for the upcoming 2016 film. Garity earned both a Golden Globe and Independent Spirit Award nomination for his performance in the Showtime original film \"Soldier's Girl\". The film also garnered Garity a Peabody Award and the AFI award for excellence in film. Born in Santa Monica California, as a member of the Fonda family, acting was indeed in his blood. He attended the University of Colorado at Boulder and went on to study at The American Academy of Dramatic Arts in NYC. After graduation, Troy spent a year performing as a member of the Academy's famed repertory company. Some of Garity's other notable credits include the Danny Boyle sci-fi thriller \"Sunshine,\" \"Gangster Squad\" directed by Ruben Fleischer, and the critically acclaimed television series \"Boss\" directed by Gus Van Sant. Troy can been seen playing NFL agent Jason Antolotti in HBO's hit comedy series \"Ballers.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzEwNjYwN15BMl5BanBnXkFtZTgwMjM2MjE5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004949","name":"Troy Garity","idIMDB":"nm0004949"},"actorId":"nm0004949","character":"Avner Less","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franka Potente","urlProfile":"http://www.imdb.com/name/nm0004376","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3ODYyNjU0NV5BMl5BanBnXkFtZTcwNDMxNDE3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1974","placeOfBirth":" Dülmen, North Rhine-Westphalia, Germany","height":"5' 8½\" (1.74 m)","bio":"Franka Potente was born on 22 July 1974 in the German town of Dülmen, to Hildegard, a medical assistant, and Dieter Potente, a teacher. After her graduation in 1994, she went to the Otto-Falckenberg-Schule, a drama school in Munich, but soon broke off to study at the Lee Strasberg Theatre Institute in New York. After a notable debut in Dans la forêt vierge après cinq heures (1995), the role of the heroine in Run Lola Run (1998), directed by her then longtime companion Tom Tykwer was her national breakthrough. After some other successful movies in Germany, she starred in several Hollywood productions, most prominently The Bourne Identity (2002) and The Bourne Supremacy (2004) and lived one year in Los Angeles. After her return to Berlin, she continues working with German and international directors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3ODYyNjU0NV5BMl5BanBnXkFtZTcwNDMxNDE3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004376","name":"Franka Potente","idIMDB":"nm0004376"},"actorId":"nm0004376","character":"Vera Less","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Fry","urlProfile":"http://www.imdb.com/name/nm0000410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1957","placeOfBirth":" Hampstead, London, England, UK","birthName":"Stephen John Fry","height":"6' 4½\" (1.94 m)","bio":"Writer, actor, comedian, doer of good works, excellent good friend to the famous and not, Fry lives in his London SW1 flat and his Norfolk house when not traveling. Famous for his public declaration of celibacy in the \"Tatler\" back in the 1980s, Emma Thompson has characterised her friend as \"90 percent gay, 10 percent other.\" Stephen Fry was born in Hampstead, London, to Marianne Eve (Newman) and Alan Fry, a physicist and inventor. His maternal grandparents were Hungarian Jewish immigrants, while his father's family was of English background. He grew up in Norfolk and attended Uppingham School and Stout's Hill. After his notorious three months in Pucklechurch prison for credit card fraud, he attended Queens College, Cambridge in 1979, finishing with a 2:1 in English in 1981/2. While at Cambridge, he was a member of the Cherubs drinking club, and Footlights with Thompson, Tony Slattery, Martin Bergman, and Hugh Laurie (to whom he was introduced by E.T.). His prolific writing partnership with Laurie began in 1981 with resulting Footlights revues for (among others) Mayweek, Edinburgh Festival, and a three month tour of Australia. In 1984, Fry was engaged to do the rewrite of the Noel Gay musical \"Me and My Girl,\" which made him a millionaire before the age of 30. It also earned him a nomination for a Tony award in 1987. (Sidenote: It was upon SF's suggestion that Emma Thompson landed a leading role in the London cast of this show.) Throughout the 1980s, Fry did a huge amount of television and radio work, as well as writing for newspapers (e.g. a weekly column in the \"Daily Telegraph\") and magazines (e.g. articles for \"Arena\"). He is probably best known for his television roles in Black-Adder II (1986) and Jeeves and Wooster (1990). His support of the Terence Higgins Trust through events such as the first \"Hysteria\" benefit, as well as numerous other charity efforts, are probably those works of which he is most proud. Fry's acting career has not been limited to films and television. He had successful runs in Alan Bennett's \"Forty Years On,\" Simon Gray's \"The Common Pursuit\" with John Sessions, Rik Mayall, John Gordon Sinclair, and others. Michael Frayn's \"Look Look\" and Gray's \"Cell Mates\" were less successful for both Fry and their playwrights, the latter not helped by his walking out of the play after only a couple of weeks. Fry has published four novels as well as a collection of his radio and journalistic miscellanea. He has recorded audiotapes of his novels (an unabridged version of \"The Liar\" was released in 1995), as well as many other works for both adults and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000410","name":"Stephen Fry","idIMDB":"nm0000410"},"actorId":"nm0000410","character":"Minister Tormer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Delaine Yates","urlProfile":"http://www.imdb.com/name/nm0946738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTI0MTIwNV5BMl5BanBnXkFtZTcwODk4MDgzMQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"bio":"Delaine Yates is an actress, known for Lucky You (2007), Unthinkable (2010) and The City (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTI0MTIwNV5BMl5BanBnXkFtZTcwODk4MDgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0946738","name":"Delaine Yates","idIMDB":"nm0946738"},"actorId":"nm0946738","character":"Miriam Fröhlich","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tereza Srbová","urlProfile":"http://www.imdb.com/name/nm2462293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDY0MDcyNl5BMl5BanBnXkFtZTgwMTM5OTIzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Tereza Srbova was born in Prague, Czech Republic. She spent most of her adult life abroad in Paris, New York and London where she currently lives. She holds a masters degree in culture anthropology as she originally thought of becoming a journalist. While undertaking her studies, she was approached by a modelling agency Elite Paris and appeared in several perfume and cosmetic's campaigns such as Clarins and Dior. Over time, her childhood passion for singing and performing grew stronger and she enrolled into a part time drama school. This hobby turned quickly into a career path after her debut appearance in David Cronenberg's Eastern Promises.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDY0MDcyNl5BMl5BanBnXkFtZTgwMTM5OTIzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2462293","name":"Tereza Srbová","idIMDB":"nm2462293"},"actorId":"nm2462293","character":"Baroness Ingrid von Ihama","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Judit Viktor","urlProfile":"http://www.imdb.com/name/nm1316139","urlPhoto":"","biography":{"bio":"Judit Viktor is an actress, known for Hellboy II: The Golden Army (2008), Severance (2006) and Hercules (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1316139","name":"Judit Viktor","idIMDB":"nm1316139"},"actorId":"nm1316139","character":"Ann Marie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Greif","urlProfile":"http://www.imdb.com/name/nm0340039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzAyMjU4M15BMl5BanBnXkFtZTgwNjMyNTMxOTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1944","placeOfBirth":" Sawbridgeworth, Hertfordshire, England, UK","height":"6' (1.83 m)","bio":"Stephen Greif was born on Aug 26, 1944 in Highgate, London. He is an Honours graduate from The Royal Academy of Dramatic Art. He is also a recent and past Member of the Royal Shakespeare Company and a Laurence Olivier and London Critics Circle award winning nominee for his work at The National Theatre over many years. He has often appeared in the West End and at The Old Vic. His grandparents were from Budapest, Lithuania, Russia and Poland. His father Ferenc was born in Vienna and his mother Polly in the East End of London. He attended Hordle House Preparatory School for two years with his older brother Anthony and his younger brother Peter, but in 1955 when his father's partnership was defrauded and the family endured severe financial hardship, he and Peter were enrolled in Primary School in the London area of Ladbroke Grove, then a run-down part of London. He went on to Sloane Grammar School in Chelsea where he excelled in sport, becoming the school's Athletics and Swimming champion representing his school and county in various London and Regional championships - at the famous White City Stadium amongst others. He played Captain Hook at primary school, and his love of acting was rekindled during a brief spell at Regent Polytechnic. After brief times working for an electronics manufacturer (where he nearly electrocuted himself) and as a junior negotiator in a West End real estate agency, he finally decided to become an actor. Having been offered places at LAMDA and RADA, he chose the latter where he won a first Class Honours Diploma, as well as receiving 5 other awards including the prestigious Kendal Award (the Gold Medal equivalent) and others judged and presented by Sir John Gielgud. He has appeared in many seasons with the National Theatre in both Olivier's companies at the Old Vic and in the West End. Whilst performing in 'Saturday, Sunday, Monday', directed by Franco Zeffirelli and Sir Laurence , he won a best actor nomination at the Critics Circle awards. Shortly after he played Biff opposite Warren Mitchell in the landmark revival of Arthur Miller's masterpiece 'Death of a Salesman' in The Lyttleton Theatre. He won a Laurence Olivier Award nomination for his performance. Further to these notable engagements, Stephen was contracted in Nicholas Hytner's inaugural season at the National Theatre, where he played in productions such as 'His Girl Friday' directed by the multi-award-winning Broadway veteran Jack O'Brien, 'Edmond' directed by Edward Hall, and starring Kenneth Branagh, and 'His Dark Materials', the two-part Christmas show directed by Nicholas Hytner. He appeared in the West End in Ronald Harwood's 'Reflected Glory' with Albert Finney, 'Epitaph for George Dillon' with Joseph Fiennes, directed by Peter Gill and in Bill Kenwright's smash hit 'Fallen Angels' working with Felicity Kendal and Frances de la Tour. He recently appeared at The Old Vic in 'Six degrees of Separation' with Lesley Manville. He also contributed to the 85th Birthday celebration of his friend, the playwright Bernard Kops, with a rehearsed performance of his breakthrough play 'The Hamlet of Stepney Green' at London's Jewish Museum. He recently appeared (2016) at The St James Theatre in \"Tears, Treachery ..and just a little murder\" With Fenella Fielding reprising this in 2017 this time at The Crazy Coqs at Zed's Brasserie with further shows to come in May and September. He also played The Globe in an adaptation of 'The Prince of West End Avenue'. He has played on stage opposite such luminaries as Sir Laurence Olivier, Elaine Stritch, Denholm Elliot, Dame Joan Plowright, Sir Anthony Hopkins, Frank Langella, Sir Ian Mackellan, Joseph Fiennes and Albert Finney and has been directed by Laurence Olivier, Franco Zeffirelli, Trevor Nunn, David Jones, Clifford Williams, Michael Blakemore, Jonathan Miller, John Dexter, Nicholas Hytner, Edward Hall, Alan Strachan, Peter Coe, Elijah Moshinsky, Peter Gill and on several occasions Michael Rudman. Aside from a continuing presence in the theatre, Stephen has also garnered a long list of television and film work. Early television roles included parts in Edward II (1970) and The Tragedy of King Richard II (1971), The Persuaders! (1971), Thriller (1973), Chapeau melon et bottes de cuir (1976), Killers (1976), Armchair Thriller (1978), Dirty Money (1979) (aka \"Sewers of Gold\" and \"Dirty Money\", with Ian McShane) and The Life and Loves of a She-Devil (1986). He was cast in his most recognizable role - the villainous Travis in the famous BBC science fiction series Blake's 7 (1978). The character would appear throughout the first series. He also took notable roles in The Persuaders! (1971), Dick Turpin (1979), Return of the Saint (1978), Play for Today (1970) (twice) and three series of Citizen Smith (1977), with Robert Lindsay and produced and directed by the legendary Dennis Main Wilson. He has continued to build up a remarkable number of television appearances to the present, acting in productions such as\"Doctors\"(2016) New Tricks (2003), Silent Witness (1996), Waking the Dead (2000), Doctor Who: The Infinite Quest (2007), Mistresses (2008), MI-5 (2002), Space Race (2005), Holby City (1999), Screen Two: Midnight Movie (1994) (Denis Potter), Minder (1979), EastEnders (1985) and The Bill (1984). Recent film roles include Risen (2016), Bill (2015), Woman in Gold (2015), Boogie Woogie (2009), Shoot on Sight (2007), Adolf Eichmann (2007), Back in Business (2007), Sixty Six (2006), Casanova (2005), The Upside of Anger (2005), Fakers (2004) and Spartan (2004). Stephen has narrated countless talking books including The History of the Jews, Inspector Palfrey of Westminster (6 books), Send No More Roses, The Match King, He Kills Coppers, Seeking Robinson Crusoe, The Boy with the Magic Numbers (for which he won the prestigious Earphones Award from BBC Audiobooks America), The Pianist, The Darkness of Wallis Simpson, and His Dark Materials. His radio work includes Waterloo, The Ball at Brussels, The Castle, The Zone, The Carter Mysteries, Austerlitz, Love and War, The Man in Black, Tinker Tailor Soldier Spy, Peter Lorre V Peter Lorre (playing Lorre), The Grand Hotel Babylon, The Babbington Plot, The Devil was Here Yesterday, The Iceman, Witness, Take-Away, Down and Out in London and Paris, Captain Corelli's Mandolin, and Hooligan Nights. He has also voiced hundreds of radio and television commercials as well as thousands of cinema and television promos and trailers, on-line games, corporate presentations, narratives and scores of voices for numerous computer games including the latest Sony Playstation game, Puppeteer, Zenoblade Chronicles, Risen 2, Fable 2. Dragon Quest, Witcher, Venetica, Medieval, Momento Mori. He is the proud inventor of \"VoiceQuality\", a system for describing the quality and character of the human voice and licensed worldwide to the famous actors' directory \"The Spotlight\". He appeared by invitation of the National Film Theatre to discuss his work in Blakes 7, and by invitation of the Israeli Embassy to read from Amos Oz's \"A Tale of Love and Darkness\" to celebrate the founding of the state of Israel. He is a keen golfer, a member of The Stage Golfing Society and a movie buff.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzAyMjU4M15BMl5BanBnXkFtZTgwNjMyNTMxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340039","name":"Stephen Greif","idIMDB":"nm0340039"},"actorId":"nm0340039","character":"Hans Lipmann","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dénes Bernáth","urlProfile":"http://www.imdb.com/name/nm1029183","urlPhoto":"","biography":{"dateOfBirth":"1974","placeOfBirth":" Eger, Hungary","bio":"Dénes Bernáth was born in 1974 in Eger, Hungary. He is an actor, known for Spy (2015), Maigret's Dead Man (2016) and Zoltan: The Hungarian Gangster of Love (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1029183","name":"Dénes Bernáth","idIMDB":"nm1029183"},"actorId":"nm1029183","character":"Benjamin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernadett Kis","urlProfile":"http://www.imdb.com/name/nm1824943","urlPhoto":"","biography":{"dateOfBirth":"24 February 1978","placeOfBirth":" Pápa, Hungary","bio":"Bernadett Kis was born on February 24, 1978 in Pápa, Hungary. She is an actress, known for Bienvenue à Monte Carlo (2011), Adolf Eichmann (2007) and Les piliers de la terre (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1824943","name":"Bernadett Kis","idIMDB":"nm1824943"},"actorId":"nm1824943","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tilly O'Neil","urlProfile":"http://www.imdb.com/name/nm2758380","urlPhoto":"","biography":{"dateOfBirth":"12 March 2000","placeOfBirth":" Ashford, Kent, England, UK","bio":"Tilly O'Neil was born on March 12, 2000 in Ashford, Kent, England. She is an actress, known for Adolf Eichmann (2007) and The Other Man (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2758380","name":"Tilly O'Neil","idIMDB":"nm2758380"},"actorId":"nm2758380","character":"Hannah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"László Bereczki","urlProfile":"http://www.imdb.com/name/nm3250923","urlPhoto":"","biography":{"bio":"László Bereczki is an actor, known for Adolf Eichmann (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3250923","name":"László Bereczki","idIMDB":"nm3250923"},"actorId":"nm3250923","character":"David","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexis Latham","urlProfile":"http://www.imdb.com/name/nm1203273","urlPhoto":"","biography":{"bio":"Alexis Latham is an actor, known for Sissification (2014), Pinprick (2009) and Adolf Eichmann (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1203273","name":"Alexis Latham","idIMDB":"nm1203273"},"actorId":"nm1203273","character":"Dubois","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Alexander Young","urlProfile":"http://www.imdb.com/name/nm1488880","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTE1ODYyMV5BMl5BanBnXkFtZTgwNDg2NDQzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Scott is a scriptwriter and travel writer, who went to an audition 10 years ago and unwittingly started a second career. Since then, he's appeared in over 20 big budget films and TV shows; playing everything from KGB spy to an English butler, American presidential aide to medieval lawman. He lives mostly in Europe, but comes from New Zealand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTZmMDdlNmMtZTEyZC00NGMzLWEwNmMtYzU5OTkxYWM5Y2UxXkEyXkFqcGdeQXVyMjE2OTU0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1488880","name":"Scott Alexander Young","idIMDB":"nm1488880"},"actorId":"nm1488880","character":"Robert Servatius","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0901481","urlIMDB":"http://www.imdb.com/title/tt0901481","business":{"budget":{"money":"$8,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"11","year":"2006","remarks":null},{"money":null,"country":null,"day":"13","month":"01","year":"2007","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby Digital"],"color":["Color","Black and White (archive footage)"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Soho Images, London, UK"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm"]},"rating":"5.9","metascore":"35","filmingLocations":[{"location":"Budapest, Hungary"}],"awards":[],"votes":"2,568","type":"Movie","companyCreditsSimple":[{"idCompany":"co0181282","name":"Entertainment Motion Pictures (E-MOTION)"},{"idCompany":"co0318083","name":"uFilm"},{"idCompany":"co0121002","name":"Thema Production"}],"keywords":{"keywords":["execution","israeli","confession","female rear nudity","stomping on glass","mailing a letter","year 1962","forced march","cavity search","orange","electric razor","carbon monoxide poisoning","shot to death","hanged by the neck","man on a toilet","swastika painted on door","shooting a baby","picketing","molotov cocktail","woman undressing for a man","year 1943","budapest hungary","suicide ring","peeping","model train","archival footage","sex scene","reference to dieter wisliceny","klezmer music","cheering crowd","dancing","begins with text","starts with a definition","man with glasses","femme fatale","family relationships","locksmith","mass execution","nazi soldier","german soldier","death camp","concentration camp","cheating husband","unfaithful husband","mistress","shoe shiner","bureaucrat","voice over","reading a letter","husband wife relationship","little boy","sex","three brothers","flashback","writing a letter","cynic","cynicism","reference to adolf hitler","horn rimmed glasses","crime against humanity","holocaust","nazi war criminal","protest sign","protestors","interrogation room","interrogator","cigarette smoking","washing dishes","kitchen","dinner party","prison food","israeli flag","newspaper headline","prison cell","jewish wedding","1960s","wedding party","wedding ceremony","german accent","nazi hunter","based on interrogation manuscripts","anti semitism","persecution of jews","anal exam","hospital","shaving","vacuuming","vacuum cleaner","little girl","female reporter","gas chamber","reference to heinrich himmler","mass murderer","tape recorder","public hanging","toilet","female soldier","firing range","shooting range","target practice","israeli soldier","hit in the face","volkswagen beetle","angry mob","baby killer","child in peril","nazi officer","child abduction","side boob","baroness","one word title","world war two","partial female nudity","interrogation","1950s","1940s","nazi","based on true story","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:47:39"}}