{"data":{"movies":[{"title":"Lottery Ticket","originalTitle":"","year":"2010","releaseDate":"20100820","directors":[{"name":"Erik White","id":"nm1336172"}],"writers":[{"name":"Abdul Williams","id":"nm2226110"},{"name":"Erik White","id":"nm1336172"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODA2NjcxM15BMl5BanBnXkFtZTcwNTA3NTI0Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Kevin Carson is a young man living in the projects who has to survive a three-day weekend after his opportunistic neighbors find out he's holding a winning lottery ticket worth $370 million.","simplePlot":"Kevin Carson is a young man living in the projects who has to survive a three-day weekend after his opportunistic neighbors find out he's holding a winning lottery ticket worth $370 million.","actors":[{"actorName":"Shad Moss","urlProfile":"http://www.imdb.com/name/nm0510168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTg2ODQwMl5BMl5BanBnXkFtZTYwOTMxNDUz._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1987","placeOfBirth":" Columbus, Ohio, USA","birthName":"Shad Gregory Moss","height":"5' 7\" (1.7 m)","bio":"Shad Gregory Moss was born on March 9, 1987 in Columbus, Ohio to Teresa Rena (Jones) and Alfonso Preston Moss. When Shad was five, he started his rap career using the nickname \"Kid Gangsta.\" One year later, he took front stage during \"The Chronic Tour\" and impressed rapper Snoop Dogg, who later gave him the name Lil' Bow Wow. Snoop Dogg later hired him as an opening act and introduced him to Jermaine Dupri, the producer who helped Shad's career. He backed up the success of his double platinum debut album \"Beware of The Dog\" (2000) with 2002's platinum \"Doggy Bag.\" It was during the release of his first album that he publicly took his nom de guerre. After having several guest spots on TV shows such as \"Moesha\" and \"The Steve Harvey Show,\" Shad made his big-screen acting debut in 2002's All About The Benjamins, which he immediately followed with his first starring role, Like Mike, and a new stage name- Bow wow. He has publicly dated Ciara, and in 2011 admitted to having a child with an unnamed woman. In 2012 he made news when he was publicly forced to pay child support. In 2015 he became engaged with reality star Erica Mena. In 2015 he began starring in the TV show \"CSI: Cyber\" and resides in Atlanta, Georgia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTg2ODQwMl5BMl5BanBnXkFtZTYwOTMxNDUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0510168","name":"Shad Moss","nicknames":["Bow Weezy","L B Dub"],"idIMDB":"nm0510168"},"actorId":"nm0510168","character":"Kevin Carson","urlCharacter":"http://www.imdb.com/character/ch0188738","main":true},{"actorName":"Brandon T. Jackson","urlProfile":"http://www.imdb.com/name/nm1040365","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDUwMTc5Ml5BMl5BanBnXkFtZTgwNjA4NTc4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1984","placeOfBirth":" Detroit, Michigan, USA","birthName":"Brandon Timothy Jackson","height":"5' 9\" (1.75 m)","bio":"Brandon Timothy Jackson was born and raised in Detroit, Michigan, the son of Beverly Yvonne (Bozeman) and Wayne Timothy Jackson. His parents are both pastors, and his maternal grandfather was a Pentecostal child preacher. He credits his sense of humor to both his father and his life straddling the fence between suburbia and the inner city. Brandon held the title of \"class clown\" and grew his passion for comedy and acting by doing talent shows and performing at youth nights at his father's church. By age 14, Brandon's career as a stand-up comic evolved from local school shows and community projects, such as the \"Motor City Youth Festival\", to an appearance in Marc Cayce's film, Nikita Blues (2001). Brandon took an internship at local Detroit radio station 93.1 FM and soon found himself as a guest host at 105.9 FM. Brandon's drive took him to Hollywood where, in 2001, he was cast as an extra in major movies such as Ali (2001), Bowling for Columbine (2002) and 8 Mile (2002). He began to get calls to open up and work with comedians, such as Chris Tucker and Wayne Brady. After Brandon's performances at New York City's \"Showtime at the Apollo\" and BET's Comicview (1992), the 19-year-old actor/comedian was cast in his first major movie role as Shad Moss's (X) best friend, \"Junior\", in Roll Bounce (2005). He won Black Reel's 2006 Best Breakthrough Performance award for his performance. Jackson starred opposite NBA basketball superstar Kevin Durant in Thunderstruck (2012) and'Martin Lawrence (I)' in the third incarnation of the highly profitable Big Mommas: Like Father, Like Son (2011) franchise released by Fox in 2011. He played Lawrence's son and the two went undercover to solve a murder. Jackson is perhaps best known as Alpha Chino from the high- concept runaway hit Tropic Thunder (2008). Jackson received rave reviews for his role as the satyr Grover Underwood, the best friend and protector of Percy Jackson & the Olympians: The Lightning Thief (2010), opposite Logan Lerman and Alexandra Daddario. Brandon co-starred in both Hulu's original series Deadbeat(2014) and Showtimes's _Californication (2008) (V)_. He lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDUwMTc5Ml5BMl5BanBnXkFtZTgwNjA4NTc4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1040365","name":"Brandon T. Jackson","idIMDB":"nm1040365"},"actorId":"nm1040365","character":"Benny","urlCharacter":"http://www.imdb.com/character/ch0188741","main":true},{"actorName":"Naturi Naughton","urlProfile":"http://www.imdb.com/name/nm1166613","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4NDk1NjE1Nl5BMl5BanBnXkFtZTgwMTQyNzQ2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1984","placeOfBirth":" East Orange, New Jersey, USA","birthName":"Naturi Cora Maria Naughton","height":"5' (1.52 m)","bio":"Naturi Naughton is an American Singer and Actress best known for her performance as \"Lil Kim\" in Fox Searchlight's hit film \"Notorious\", and her role in MGM's remake of the classic film \"Fame\". Naughton has starred in various other projects such as: Lottery Ticket, The Playboy Club, Mad Men and The Client List. She also appeared on Broadway in the Tony Award winning musical, \"Hairspray\" for 3 years. Before her transition into film and television, Naughton was a member of the Platinum selling Pop trio 3LW. She was greatly inspired by Whitney Houston as a child and knew by the age of 5 that she wanted to be a singer and an actress. She is a rising star in the Film/TV community who values hard work and perseverance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4NDk1NjE1Nl5BMl5BanBnXkFtZTgwMTQyNzQ2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1166613","name":"Naturi Naughton","idIMDB":"nm1166613"},"actorId":"nm1166613","character":"Stacie","urlCharacter":"http://www.imdb.com/character/ch0297217","main":true},{"actorName":"Loretta Devine","urlProfile":"http://www.imdb.com/name/nm0222643","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NjAyMDc2OF5BMl5BanBnXkFtZTcwNTU3MDMzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1949","placeOfBirth":" Houston, Texas, USA","height":"5' 6½\" (1.69 m)","bio":"Loretta Devine was born August 21, 1949 in Houston, Texas, to Eunice O'Neal (née Toliver), a beautician, and James Devine, who worked as a laborer. Loretta grew up in the Acres Home area of Houston and later enrolled at the University of Houston, where she earned a a Bachelor of Arts in Speech and Drama, and later Brandeis University where she earned a MFA in Theater. With many minor roles in television and film, perhaps Loretta is best known for her performance as Gloria Matthews in Waiting to Exhale (1995). Her performance earned her an NAACP Image Award for Best Supporting Actress, as did her performance in her next film, The Preacher's Wife (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NjAyMDc2OF5BMl5BanBnXkFtZTcwNTU3MDMzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0222643","name":"Loretta Devine","idIMDB":"nm0222643"},"actorId":"nm0222643","character":"Grandma","urlCharacter":"http://www.imdb.com/character/ch0297778","main":true},{"actorName":"Ice Cube","urlProfile":"http://www.imdb.com/name/nm0001084","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTE0NDQwMV5BMl5BanBnXkFtZTcwMDA1NjA1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1969","placeOfBirth":" Los Angeles, California, USA","birthName":"O'Shea Jackson","height":"5' 8\" (1.73 m)","bio":"Ice Cube was born in South Central Los Angeles, to Doris (Benjamin), a custodian and hospital clerk, and Hosea Jackson, a UCLA groundskeeper. He first came to public notice as a singer and songwriter with the controversial and influential band N.W.A. His compositions with that group included many of the classic cuts from their debut LP \"Straight Outta Compton\" (Ruthless/Priority, 1989), including the title track, \"Gangsta Gangsta\" and \"Express Yourself\". He quit the band over business differences in 1990 and began a still-growing series of commercially and critically acclaimed solo albums, starting with \"AmeriKKKa's Most Wanted\" (Priority, 1990). His second solo album, \"Death Certificate\" (Priority, 1991), a concept album about the fall and rise of the Black man, sold two million copies, and his subsequent solo output (six albums to date total) has sold over ten million copies. He has also discovered Yoyo, Del, K-Dee and Mack 10. He has also produced, written, toured and recorded with Public Enemy, The Red Hot Chili Peppers, George Clinton, The D.O.C., Michel'e, Big Daddy Kane, WC & The Madd Circle (which spawned the solo career of Coolio), former N.W.A. bandmate Dr. Dre and Cypress Hill. He has also recorded with two post-N.W.A. side-project bands, Da Lench Mob (\"Guerillas In Tha Mist\", Street Knowledge/East-West, 1991) and Westside Connection (\"Bow Down\", Priority, 1996). His movie career has been no less stellar. Ice Cube's debut in Boyz n the Hood (1991) led to more roles in such films as Trespass (1992), Dangerous Ground (1997) and Anaconda (1997). He also appeared as himself in the comedy CB4 (1993). He is also no stranger to the other side of the camera, directing videos for himself as well as Prince and Color Me Badd, as well as co-writing his screenwriting debut, Friday (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTE0NDQwMV5BMl5BanBnXkFtZTcwMDA1NjA1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001084","name":"Ice Cube","nicknames":["Cube"],"idIMDB":"nm0001084"},"actorId":"nm0001084","character":"Mr. Washington","urlCharacter":"http://www.imdb.com/character/ch0297777","main":true},{"actorName":"Keith David","urlProfile":"http://www.imdb.com/name/nm0202966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5OTU4ODI1MF5BMl5BanBnXkFtZTcwMjU1NjkyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1956","placeOfBirth":" Harlem, New York City, New York, USA","birthName":"Keith David Williams","height":"6' 2\" (1.88 m)","bio":"Keith David was born Keith David Williams in New York City's Harlem district, and was raised in East Elmhurst, in the Queens section of the city. He is the son of Dolores (Dickenson), a New York Telephone manager, and Lester Williams, a payroll operations director. As a child, he realized he wanted to act after playing the cowardly lion in his school's production of \"The Wizard of Oz.\" He later enrolled in New York's High School of the Performing Arts and continued his studies at Juilliard. After graduation, he was hired as an understudy for Tullus Aufidius in William Shakespeare's \"Coriolanus.\" In 1992, he received a Tony Award nomination for Best Supporting Actor in a Musical for his role in the Broadway play \"Jelly's Last Jam.\" Keith's extraordinary range of talent is evidenced by his body of work. His films include \"The Princess and the Frog\", \"Coraline\", and \"Crash\". Other credits are \"Barbershop\", \"Agent Cody Banks\", and \"Requiem for a Dream\". Prior to that, Keith was featured in \"There's Something About Mary\", \"Armageddon\" and \"Dead Presidents\". Keith has received Emmy Awards for his narration of two Ken Burns documentaries: \"The War\" and \"Unforgivable Blackness\", and was nominated for his narration of \"Jazz\". He received a daytime Emmy nomination for his work in Showtime's \"The Tiger Wood's Story\". Keith David gained wide attention in 1986 for his role as King in the Oscar winning film \"Platoon\". Other of his over 75 film credits includes \"Men at Work\", \"Clockers\", and \"Pitch Black\". Keith has also worked with notable directors including Clint Eastwood (\"Bird\"), Steven Spielberg (\"Always\") and John Carpenter (\"The Thing\" and \"They Live\"). Born in Harlem, New York and raised in East Elmhurst, Queens, Keith sang in the all borough choir as a boy. He knew he wanted to act at the age of nine when he appeared as the cowardly lion in his school's production of \"The Wizard of Oz\". He later attended New York's famed High School of the Performing Arts and then graduated from Juilliard. There he studied under such voice and speech teachers as Robert Williams and Edith Skinner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5OTU4ODI1MF5BMl5BanBnXkFtZTcwMjU1NjkyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0202966","name":"Keith David","idIMDB":"nm0202966"},"actorId":"nm0202966","character":"Sweet Tee","urlCharacter":"http://www.imdb.com/character/ch0188740","main":true},{"actorName":"Terry Crews","urlProfile":"http://www.imdb.com/name/nm0187719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1968","placeOfBirth":" Flint, Michigan, USA","birthName":"Terrence Alan Crews","height":"6' 3¼\" (1.91 m)","bio":"Terry Crews was born in Flint, Michigan, to Patricia and Terry Crews, Sr. He earned an Art Excellence Scholarship to attend Western Michigan University and also earned a full-ride athletic scholarship to play football. Crews was an All-Conference defensive end, and was a major contributor on the 1988 MAC champion WMU Broncos. His college success was rewarded in 1991, when he was drafted by the NFL's Los Angeles Rams. Crews played six years in the NFL, with stints at the L.A. Rams, San Diego Chargers , Rhein Fire (NFL Europe-Germany), Washington Redskins and Philadelphia Eagles. While in the NFL, used his art talent by painting a line of NFL licensed lithographs for Sierra Sun Editions. In 1996, Crews co-wrote and co-produced the independent feature film, \"Young Boys Incorporated\" (1996). Crews retired from the NFL in 1997 and moved to Los Angeles to pursue an acting career. Crews' first break came in 1999, when he auditioned for the extreme sports show called Battle Dome (1999), with other actor-athletes from around the country. Crews was chosen to be a series regular, known as the urban warrior, \"T-Money\". In 2000, Crews made his big screen debut in The 6th Day (2000). Since then, he has landed roles in Au service de Sara (2002), Friday After Next (2002), Deliver Us from Eva (2003), Malibu's Most Wanted (2003), Starsky & Hutch (2004), Soul Plane (2004), White Chicks (2004), and the Mike Judge film, Idiocracy (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187719","name":"Terry Crews","idIMDB":"nm0187719"},"actorId":"nm0187719","character":"Jimmy the Driver","urlCharacter":"http://www.imdb.com/character/ch0188739","main":true},{"actorName":"Mike Epps","urlProfile":"http://www.imdb.com/name/nm0258402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjEzOTQyNF5BMl5BanBnXkFtZTYwNjM1MjU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1970","placeOfBirth":" Indianapolis, Indiana, USA","birthName":"Michael Elliot Epps","height":"6' 1\" (1.85 m)","bio":"Mike Epps was born on November 18, 1970 in Indianapolis, Indiana, USA as Michael Elliot Epps. He is an actor and producer, known for The Hangover (2009), Resident Evil: Apocalypse (2004) and The Hangover Part III (2013). He has been married to Mechelle McCain (I) since July 28, 2006. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjEzOTQyNF5BMl5BanBnXkFtZTYwNjM1MjU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0258402","name":"Mike Epps","idIMDB":"nm0258402"},"actorId":"nm0258402","character":"Reverend Taylor","urlCharacter":"http://www.imdb.com/character/ch0297779","main":true},{"actorName":"Charlie Murphy","urlProfile":"http://www.imdb.com/name/nm0614151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjIyNzkzMV5BMl5BanBnXkFtZTcwODc5MTMzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1959","placeOfBirth":" New York City, New York, USA","birthName":"Charles Quinton Murphy","height":"6' 1\" (1.85 m)","bio":"Charlie Murphy was born on July 12, 1959 in New York City, New York, USA as Charles Quinton Murphy. He was an actor and writer, known for Night at the Museum (2006), Norbit (2007) and Grand Theft Auto: San Andreas (2004). He was married to Tisha Taylor Murphy. He died on April 12, 2017 in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjIyNzkzMV5BMl5BanBnXkFtZTcwODc5MTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614151","name":"Charlie Murphy","nicknames":["Charlie"],"idIMDB":"nm0614151"},"actorId":"nm0614151","character":"Semaj","urlCharacter":"http://www.imdb.com/character/ch0297780","main":true},{"actorName":"Bill Bellamy","urlProfile":"http://www.imdb.com/name/nm0004740","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTY4OTc2M15BMl5BanBnXkFtZTgwODg4NjI0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1965","placeOfBirth":" Newark, New Jersey, USA","height":"6' 2\" (1.88 m)","bio":"1 brother (deceased) - per TV series \"UnSung Hollywood - Bill Bellamy\" (S3 Ep7) Recently aired on TVOne as a repeat on 11/16/2016, It's a Documentary show which details archival film footage and personal, revealing interviews, about the lives and careers of some of the world's most highly talented but sometimes forgotten celebrities from the industry. Credits: Gary Anthony Williams (Narrator).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTY4OTc2M15BMl5BanBnXkFtZTgwODg4NjI0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004740","name":"Bill Bellamy","idIMDB":"nm0004740"},"actorId":"nm0004740","character":"Giovanni","urlCharacter":"http://www.imdb.com/character/ch0297781","main":true},{"actorName":"Gbenga Akinnagbe","urlProfile":"http://www.imdb.com/name/nm1782153","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODgzODU3MV5BMl5BanBnXkFtZTcwMzY4NjMyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1978","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 10\" (1.78 m)","bio":"Gbenga Akinnagbe was born on December 12, 1978 in Washington, District of Columbia, USA. He is an actor and producer, known for The Taking of Pelham 123 (2009), The Savages (2007) and Independence Day: Resurgence (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODgzODU3MV5BMl5BanBnXkFtZTcwMzY4NjMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1782153","name":"Gbenga Akinnagbe","idIMDB":"nm1782153"},"actorId":"nm1782153","character":"Lorenzo","urlCharacter":"http://www.imdb.com/character/ch0297782","main":true},{"actorName":"Chris Williams","urlProfile":"http://www.imdb.com/name/nm0930282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTY0Mjk2OF5BMl5BanBnXkFtZTcwNDYyMTkwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1967","placeOfBirth":" Westchester, New York, USA","birthName":"Christopher James Williams","height":"5' 10\" (1.78 m)","bio":"An extremely versatile performer in film, television and on stage, Chris is no stranger to the entertainment arena both on and off camera in both comedy and drama. Film credits include the \"The World's Fastest Indian\" playing Tina, a transvestite opposite Sir Anthony Hopkins \"The Joneses\" opposite Demi Moore as well as a lead in the classic comedy \"Dodgeball: A True Underdog Story\". Other credits include \"The Lottery Ticket\" \"Friday After Next\", \"Sex Ed\", \"'TRI\" and \"Jimmy Vestvood American Hero\". As for television, he can be seen starring in the new CBS series \"The Great Indoors\" and is recurring on the the FX show \"Better Things\", the and as Hoover on \"Silicon Valley\". Chris was a series regular in the NBC \"One Big Happy\" and on David E. Kelley's series \"The Wedding Bells\" for FOX and has recurred on the Showtime series \"DICE\" starring Andrew Dice Clay,\"Satisfaction\", \"Californication\", while making his mark as 'Krazee Eyez Killa' on \"Curb Your Enthusiasm\". He has guest starred on Ugly Betty, CSI: Miami, Hot in Cleveland, Monk, Weeds, and numerous other shows. Chris had also appeared multiple times on Late Night with David Letterman as the angry audience member and has an upcoming self help show \"Be a Better Man with Chris Williams\" which he created, stars in and produces. Chris has also lent his vocal talents to such animated series as The Boondocks and Word Girl and can be heard on several video games including multiple characters in Crash Bandicoot. Chris is a successful stand-up, he has performed at several top comedy clubs around the world including: Caesar's Palace, The Improv, The Comedy Store and The Venetian. His innovative routines are included in his character-rich one-man show \"Old Blue Eyes Is Black\" while also having studied with the Groundlings. Chris has been coaching other professional actors the craft of scene work as well as improvisation for over 15 years and speaks to children across the nation about the art of performing. A graduate of Georgetown University, he is a magician's member of the Academy of Magical Arts (The Magic Castle) and when not practicing as a 3rd degree black belt in Tae Kwon Do or running marathons to raise money for the American Diabetes Association and Eye Bank of New York, he is a board member of the charity Special Kids Network. Chris divides his time between Los Angeles and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTY0Mjk2OF5BMl5BanBnXkFtZTcwNDYyMTkwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930282","name":"Chris Williams","idIMDB":"nm0930282"},"actorId":"nm0930282","character":"Doug","urlCharacter":"http://www.imdb.com/character/ch0297785","main":true},{"actorName":"Vince Green","urlProfile":"http://www.imdb.com/name/nm0338393","urlPhoto":"","biography":{"bio":"Vince Green is an actor and director, known for Save the Last Dance (2001), Hardball (2001) and Barbershop (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0338393","name":"Vince Green","idIMDB":"nm0338393"},"actorId":"nm0338393","character":"Malik","urlCharacter":"http://www.imdb.com/character/ch0297786","main":true},{"actorName":"Leslie Jones","urlProfile":"http://www.imdb.com/name/nm0428656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTgyMDMzM15BMl5BanBnXkFtZTgwODE1NzczMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1967","placeOfBirth":" Memphis, Tennessee, USA","height":"6' (1.83 m)","bio":"Leslie Jones was born on September 7, 1967 in Memphis, Tennessee, USA. She is an actress and writer, known for Saturday Night Live (1975), Ghostbusters (2016) and Sing (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTgyMDMzM15BMl5BanBnXkFtZTgwODE1NzczMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428656","name":"Leslie Jones","idIMDB":"nm0428656"},"actorId":"nm0428656","character":"Tasha","urlCharacter":"http://www.imdb.com/character/ch0297787","main":true},{"actorName":"Malieek Straughter","urlProfile":"http://www.imdb.com/name/nm1151209","urlPhoto":"","biography":{"bio":"Malieek Straughter is an actor, known for A Man Apart (2003), Beyond the Lights (2014) and Linewatch (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1151209","name":"Malieek Straughter","idIMDB":"nm1151209"},"actorId":"nm1151209","character":"Deangelo","urlCharacter":"http://www.imdb.com/character/ch0297788","main":true}],"seasons":[],"idIMDB":"tt0979434","urlIMDB":"http://www.imdb.com/title/tt0979434","business":{"budget":null,"openingWeekend":[{"money":"$10,652,297","country":"USA","day":"22","month":"08","year":"2010","remarks":"1,973 Screens"}],"gross":[{"money":"$24,708,699","country":"USA","day":"31","month":"10","year":"2010","remarks":""},{"money":"$24,663,550","country":"USA","day":"24","month":"10","year":"2010","remarks":""},{"money":"$24,584,082","country":"USA","day":"17","month":"10","year":"2010","remarks":""},{"money":"$24,452,661","country":"USA","day":"10","month":"10","year":"2010","remarks":""},{"money":"$24,245,405","country":"USA","day":"04","month":"10","year":"2010","remarks":""},{"money":"$23,942,211","country":"USA","day":"26","month":"09","year":"2010","remarks":""},{"money":"$23,505,360","country":"USA","day":"19","month":"09","year":"2010","remarks":""},{"money":"$22,613,669","country":"USA","day":"12","month":"09","year":"2010","remarks":""},{"money":"$21,074,972","country":"USA","day":"05","month":"09","year":"2010","remarks":""},{"money":"$17,284,641","country":"USA","day":"29","month":"08","year":"2010","remarks":""},{"money":"$10,652,297","country":"USA","day":"22","month":"08","year":"2010","remarks":""}],"weekendGross":[{"money":"$32,593","country":"USA","day":"31","month":"10","year":"2010","remarks":"70 Screens"},{"money":"$55,083","country":"USA","day":"24","month":"10","year":"2010","remarks":"92 Screens"},{"money":"$88,361","country":"USA","day":"17","month":"10","year":"2010","remarks":"138 Screens"},{"money":"$144,773","country":"USA","day":"10","month":"10","year":"2010","remarks":"194 Screens"},{"money":"$241,265","country":"USA","day":"04","month":"10","year":"2010","remarks":"302 Screens"},{"money":"$306,318","country":"USA","day":"26","month":"09","year":"2010","remarks":"370 Screens"},{"money":"$625,812","country":"USA","day":"19","month":"09","year":"2010","remarks":"677 Screens"},{"money":"$1,206,043","country":"USA","day":"12","month":"09","year":"2010","remarks":"905 Screens"},{"money":"$2,717,275","country":"USA","day":"05","month":"09","year":"2010","remarks":"1,310 Screens"},{"money":"$3,854,303","country":"USA","day":"29","month":"08","year":"2010","remarks":"1,973 Screens"},{"money":"$10,652,297","country":"USA","day":"22","month":"08","year":"2010","remarks":"1,973 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"©2010 Alcon Film Fund, LLC (on print)"},"technical":{"runtime":["1 hr 39 min (99 min) (USA)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","Technicolor, Hollywood (CA), USA (prints)","Technicolor, New York (NY), USA (dailies)"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"4.9","metascore":"50","filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"rated":"PG-13","awards":[],"votes":"8,288","type":"Movie","companyCreditsSimple":[{"idCompany":"co0054452","name":"Alcon Entertainment"},{"idCompany":"co0073858","name":"Burg/Koules Productions"},{"idCompany":"co0044714","name":"Cube Vision"}],"keywords":{"keywords":["lottery ticket","eurocopter ec120 colibri","block party","fortune cookie","reverend","ensemble cast","ex convict","convenience store clerk","punched in the face","bare chested male","friendship","greed","holiday","fourth of july","grandmother grandson relationship","lottery winner"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:38:51"}}