{"data":{"movies":[{"title":"Surrogates","originalTitle":"","year":"2009","releaseDate":"20090925","directors":[{"name":"Jonathan Mostow","id":"nm0609236"}],"writers":[{"name":"Michael Ferris","id":"nm0274905"},{"name":"John Brancato","id":"nm0104335"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTU5OTY0Ml5BMl5BanBnXkFtZTcwMDA0NjA3Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi","Thriller"],"plot":"People are living their lives remotely from the safety of their own homes via robotic surrogates -- sexy, physically perfect mechanical representations of themselves. It's an ideal world where crime, pain, fear and consequences don't exist. When the first murder in years jolts this utopia, FBI agent Greer discovers a vast conspiracy behind the surrogate phenomenon and must abandon his own surrogate, risking his life to unravel the mystery.","simplePlot":"Set in a futuristic world where humans live in isolation and interact through surrogate robots, a cop is forced to leave his home for the first time in years in order to investigate the murders of others' surrogates.","actors":[{"actorName":"Bruce Willis","urlProfile":"http://www.imdb.com/name/nm0000246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Idar-Oberstein, West Germany","birthName":"Walter Bruce Willis","height":"6' (1.83 m)","bio":"Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts. Walter Bruce Willis was born on March 19, 1955, in Idar-Oberstein, West Germany, to a German mother, Marlene K. (from Kassel), and an American father, David Andrew Willis (from Carneys Point, New Jersey), who were then living on a United States military base. His family moved to the U.S. shortly after he was born, and he was raised in Penns Grove, New Jersey, where his mother worked at a bank and his father was a welder and factory worker. Willis picked up an interest for the dramatic arts in high school, and was allegedly \"discovered\" whilst working in a café in New York City and then appeared in a couple of off-Broadway productions. While bartending one night, he was seen by a casting director who liked his personality and needed a bartender for a small movie role. After countless auditions, Willis contributed minor film appearances, usually uncredited, before landing the role of private eye \"David Addison\" alongside sultry Cybill Shepherd in the hit romantic comedy television series Moonlighting (1985). The series firmly established Bruce Willis as a hot new talent, and his sarcastic and wisecracking P.I. was in effect a dry run for the role of hard-boiled NYC detective \"John McClane\" in the monster hit Die Hard (1988). This superbly paced action film balanced laconic humor and wholesale destruction as Willis' character single handedly battles a gang of ruthless international thieves in a Los Angeles skyscraper. Willis reprized the role of tough guy cop \"John McClane\" in the eagerly anticipated sequel Die Hard 2 (1990) set at snowbound Washington's Dulles International Airport as a group of renegade Special Forces soldiers seek to repatriate a corrupt South American general. Excellent box office returns demanded a further sequel Die Hard with a Vengeance (1995) this time also starring Samuel L. Jackson as a cynical Harlem shopowner unwittingly thrust into assisting McClane during a terrorist bombing campaign on a sweltering day in NYC. Willis found time out from all the action mayhem to provide the voice of \"Mikey\" the baby in the very popular family comedies Look Who's Talking (1989), and its sequel Look Who's Talking Too (1990) also starring John Travolta and Kirstie Alley. Over the next decade, Willis starred in some very successful films, some very offbeat films and some unfortunate box office flops. The Bonfire of the Vanities (1990) and Hudson Hawk (1991) were both large scale financial disasters that were savaged by the critics, and both are arguably best left off the CVs of all the actors involved, however Willis was still popular with movie audiences and selling plenty of theatre tickets with the hyperviolent The Last Boy Scout (1991), the darkly humored Death Becomes Her (1992) and the mediocre police thriller Striking Distance (1993). During the 1990s, Willis also appeared in several independent and low budget productions that won him new fans and praise from the critics for his intriguing performances working with some very diverse film directors. He appeared in the oddly appealing North (1994), as a cagey prizefighter in the Quentin Tarantino directed mega-hit Pulp Fiction (1994), the Terry Gilliam directed apocalyptic thriller Twelve Monkeys (1995), the Luc Besson directed sci-fi opus The Fifth Element (1997) and the M. Night Shyamalan directed spine-tingling epic The Sixth Sense (1999). Willis next starred in the gangster comedy The Whole Nine Yards (2000), worked again with \"hot\" director M. Night Shyamalan in the less gripping Unbreakable (2000), and in two military dramas, Hart's War (2002) and Tears of the Sun (2003) that both failed to really fire with movie audiences or critics alike. However, Willis bounced back into the spotlight in the critically applauded Frank Miller graphic novel turned movie Sin City (2005), the voice of \"RJ\" the scheming raccoon in the animated hit Over the Hedge (2006) and \"Die Hard\" fans rejoiced to see \"John McClane\" return to the big screen in the high tech Live Free or Die Hard (2007) aka \"Die Hard 4.0\". Willis was married to actress Demi Moore for approximately thirteen years and they share custody to their three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000246","name":"Bruce Willis","nicknames":["Bruno"],"idIMDB":"nm0000246"},"actorId":"nm0000246","character":"Greer","urlCharacter":"http://www.imdb.com/character/ch0151692","main":true},{"actorName":"Radha Mitchell","urlProfile":"http://www.imdb.com/name/nm0593664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1973","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Radha Rani Amber Indigo Anunda Mitchell","height":"5' 5¾\" (1.67 m)","bio":"Radha Mitchell (born 12 November 1973) is an Australian actress. She started her career acting in various Australian TV series and movies, and later became known for her appearance in Hollywood films. Mitchell, a native of Melbourne, began acting when she was still in high school and had her professional debut on the popular Australian soap, Les voisins (1985) in 1994. Two years later, she made her film debut in the romantic comedy Love and Other Catastrophes (1996), in which she starred as a college student experiencing a messy breakup. The film proved to be fairly popular in Australia, but it wasn't until she was cast in High Art (1998) that Mitchell gained an introduction to a wider audience. The critical success of \"High Art\" made it possible for her to do more international work, and her increasing popularity was reflected by her subsequent casting in a number of projects. Among them were Pitch Black (2000), a sci-fi horror film in which Mitchell played a pilot whose ship crashes on a hostile planet, and Everything Put Together (2000), a drama where she plays a suburban woman shunned by her peers after the death of her baby. Her career continued with a diverse run of films, including Nobody's Baby (2001), Man on Fire (2004), Finding Neverland (2004), and landing the lead in Woody Allen's Melinda and Melinda (2004). Those last three films all hit the screens in 2004, and although kept working steadily, she never quite capitalized on the buzz she generated that year. Her other credits include Silent Hill (2006), Henry Poole Is Here (2008), Surrogates (2009) and The Crazies (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593664","name":"Radha Mitchell","idIMDB":"nm0593664"},"actorId":"nm0593664","character":"Peters","urlCharacter":"http://www.imdb.com/character/ch0176605","main":true},{"actorName":"Rosamund Pike","urlProfile":"http://www.imdb.com/name/nm0683253","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MjIxMzA1OV5BMl5BanBnXkFtZTcwNDQwNzU0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1979","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Rosamund Mary Elizabeth Pike","height":"5' 8½\" (1.74 m)","bio":"Born on January 27, 1979 in London, England, actress Rosamund Mary Elizabeth Pike is the only child of a classical violinist mother, Caroline (Friend), and an opera singer father, Julian Pike. Due to her parents' work, she spent her early childhood traveling around Europe. Pike attended Badminton School in Bristol, England and began acting at the National Youth Theatre. While appearing in a National Youth Theatre production of \"Romeo and Juliet\", she was first spotted and signed by an agent, although she continued her education at Wadham College, Oxford, where she read English Literature, eventually graduating with an upper second class honors degree. Pike appeared in a number of UK television series, including Wives and Daughters (1999), before scoring an auspicious feature film debut as the glacial beauty \"Miranda Frost\" in the James Bond film, Die Another Day (2002); when the film was released, she was only 23. Though her debut was a big-budget action film, the film work that followed was primarily in smaller, independent films, including Terre promise (2004), The Libertine (2004), (for which she won the Best Supporting Actress award at The British Independent Film Awards), and Pride & Prejudice (2005), as one of the Bennet daughters. A brief foray into Hollywood film followed with the action flick, Doom (2005), and the thriller, Fracture (2007), but she returned to smaller films with exceptional performances in three films: An Education (2009), Made in Dagenham (2010), and the lead opposite Paul Giamatti in Le monde de Barney (2010). As she continued her stage work in England, Pike appeared in the spy spoof, Johnny English Reborn (2011), and inhabited the role of \"Andromeda\" in the sci-fi epic, La colère des Titans (2012). She returned to action films with the female lead opposite Tom Cruise in Jack Reacher (2012). Pike entered into a relationship with a mathematical researcher named Robie Uniacke in 2009. She gave birth to their first son, named Solo, in May 2012. She returned to acting and landed the coveted title role in Gone Girl (2014). The film became a critical and box-office hit, with Pike earning the film's sole Academy Award nomination as Best Actress. She also earned nominations as Best Actress from Screen Actor's Guild, Golden Globes, and BAFTA. She gave birth to her second son with Uniacke in December 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MjIxMzA1OV5BMl5BanBnXkFtZTcwNDQwNzU0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0683253","name":"Rosamund Pike","nicknames":["Ros"],"idIMDB":"nm0683253"},"actorId":"nm0683253","character":"Maggie","urlCharacter":"http://www.imdb.com/character/ch0473513","main":true},{"actorName":"Boris Kodjoe","urlProfile":"http://www.imdb.com/name/nm0462673","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDUyOTU2OF5BMl5BanBnXkFtZTcwMjEyNjg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1973","placeOfBirth":" Vienna, Austria","birthName":"Boris Frederic Cecil Tay-Natey Ofuatey-Kodjoe","height":"6' 3½\" (1.92 m)","bio":"Boris Frederic Cecil Tay-Natey Ofuatey-Kodjoe, better known as Boris Kodjoe, is a German actor known for his roles as Jason in the 2000 film Love & Basketball (2000), and the sports-courier agent Damon Carter on the Showtime drama series Soul Food (2000). Kodjoe was born in Vienna, Austria, the son of Ursula, a German psychologist of partially Jewish descent, and Eric Kodjoe, a Ghanaian physician who is of the Nzema people. His namesake is the Russian poet and writer Boris Pasternak. Kodjoe's great-grandmother was Jewish and died in the Holocaust; his maternal grandmother survived the war in hiding. Kodjoe's parents divorced when he was six years old. Kodjoe is fluent in German, English, and French, and speaks some Spanish. He has a brother named Patrick and two sisters named Nadja and Lara.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDUyOTU2OF5BMl5BanBnXkFtZTcwMjEyNjg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0462673","name":"Boris Kodjoe","idIMDB":"nm0462673"},"actorId":"nm0462673","character":"Stone","urlCharacter":"http://www.imdb.com/character/ch0212732","main":true},{"actorName":"James Francis Ginty","urlProfile":"http://www.imdb.com/name/nm0320179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDU0NjU1Ml5BMl5BanBnXkFtZTcwODIwOTY4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"James Francis Lawrence Ginty","height":"6' 1\" (1.85 m)","bio":"Born James Francis Lawrence Ginty on December 4, 1980, at Cedar Sinai Medical Center in Los Angeles, California. Ginty holds dual citizenship with the United States and Ireland, and is the only son of actor/director Robert Ginty and actress Francine Tacker who met while starring on the late 1970s television series, The Paper Chase, alongside John Houseman. Ginty's educational background includes time at Valley Forge Military Academy in Wayne, Pennsylvania, and the performing arts boarding school, Interlochen, located in northern Michigan. After Interlochen Ginty continued his acting training at the Juilliard School in New York City as a member of Group 32 with Jessica Chastain and Patrick Heusinger, but dropped out when Kathryn Bigelow cast him in her film K-19: The Widowmaker alongside Harrison Ford and Liam Neeson. Upon completion of the film Ginty began a career in regional theatre playing such roles as Romeo in Seattle Repertory Theatre's production of Romeo and Juliet, Bertram in The Folger Shakespeare Theatre's production of All's Well That Ends Well, and Jacob Milne in Tom Stoppard's play Night and Day at The Wilma Theatre in Philadelphia. After his time in regional theatre Ginty transitioned back into film and television work, finding his way onto hit shows such as ER, Days of Our Lives and Grey's Anatomy, before landing the roles of Dr. Lionel Canter and his son Jarred in Walt Disney's, Surrogates, starring opposite Bruce Willis and Rosamund Pike. Ginty holds a degree in History from UCLA and a graduate degree from the University of Pennsylvania. He has consistently worked between the world's of acting and teaching. He has taught history at the all-girl's school Miss Porter's, in Farmington, CT, and The Chapin School in New York City. Ginty has also served as a Professor at Fordham University. In 2013 he appeared in the HBO movie Muhammad Ali's Greatest Fight directed by Stephen Frears. The film was nominated for a 2014 Primetime Emmy in the category of Outstanding Television Movie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDU0NjU1Ml5BMl5BanBnXkFtZTcwODIwOTY4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0320179","name":"James Francis Ginty","idIMDB":"nm0320179"},"actorId":"nm0320179","character":"Canter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Cromwell","urlProfile":"http://www.imdb.com/name/nm0000342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU1NTEzMzMxM15BMl5BanBnXkFtZTgwMzY0MjAzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1940","placeOfBirth":" Los Angeles, California, USA","birthName":"James Oliver Cromwell","height":"6' 6½\" (1.99 m)","bio":"Born in Los Angeles but raised in Manhattan and educated at Middlebury College and Carnegie-Mellon University, James Cromwell, the son of famous film director John Cromwell, studied acting at Carnegie-Mellon. He went into the theater (like both his parents) doing everything from Shakespeare to experimental plays. He started doing television in 1974, gaining some notice in a recurring role as Archie Bunker's friend Stretch Cunningham on All in the Family (1971), made his film debut in 1976, and goes back to the stage periodically. Some of his more noted film roles have been in Revenge of the Nerds (1984), Star Trek: First Contact (1996) and the surprise classic about a charming pig, Babe, le cochon devenu berger (1995). He garnered some of the best reviews of his career (many of which said he should have received an Oscar) for his role as a corrupt, conniving police captain in L.A. Confidential (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU1NTEzMzMxM15BMl5BanBnXkFtZTgwMzY0MjAzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000342","name":"James Cromwell","nicknames":["Jamie"],"idIMDB":"nm0000342"},"actorId":"nm0000342","character":"Older Canter","urlCharacter":"http://www.imdb.com/character/ch0161754","main":true},{"actorName":"Ving Rhames","urlProfile":"http://www.imdb.com/name/nm0000609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTgyMzc4MV5BMl5BanBnXkFtZTYwNjE5Mjk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1959","placeOfBirth":" New York City, New York, USA","birthName":"Irving Rameses Rhames","height":"6' (1.83 m)","bio":"Strikingly featured and muscular American actor Ving Rames was born Irving Rameses Rhames in Harlem, New York, to Reather, a homemaker, and Ernest Rhames, an auto mechanic. A good student, Ving entered the New York High School of Performing Arts, where he discovered his love of acting. He studied at the Juilliard School of Drama, and began his career in New York theater and in Shakespeare in the Park productions. He first appeared on Broadway in the play \"The Winter Boys\", in 1984. Also that year, he appeared in front of the cameras for the first time in the TV movie American Playhouse: Go Tell It on the Mountain (1985), and was then quickly cast in minor roles in several popular TV shows, including Miami Vice (1984), Tour of Duty (1987) and Crime Story (1986). Ving continued his rise to fame through his work in soap operas. His big break came in 1994 when director Quentin Tarantino cast him as the merciless drug dealer Marsellus Wallace in the mega hit Pulp Fiction (1994). Not long after, director Brian De Palma cast Rhames alongside Tom Cruise as the ace computer hacker, Luther Stickell in Mission: Impossible (1996). With solid performances in both these highly popular productions, his face was now well known to movie goers, and the work offers began rolling in more frequently. The next career highlight was playing the lead role in the HBO production of Don King: Only in America (1997). Rhames' performance as the world's most infamous boxing promoter was nothing short of brilliant, and at the 1998 Golden Globe Awards he picked up the award for Best Actor in a MiniSeries. However, in an incredible display of compassion, he handed over the award to fellow nominee Jack Lemmon, as he felt Lemmon was a more deserving winner! The talented actor then contributed attention grabbing performances in Bringing Out the Dead (1999), returned as Luther Stickell in Mission: Impossible II (2000), contributed his deep bass voice for the character of Cobra Bubbles in Lilo & Stitch (2002), and played a burly cop fighting cannibal zombie hordes in Dawn of the Dead (2004). A keen fitness & weight lifting enthusiast, Rhames is also well known for his strong spiritual beliefs and benevolent attitude towards other people. In a remarkable turn of events, whilst filming The Saint of Fort Washington (1993) in New York, he was introduced to a homeless man, who turned out to be his long lost, older brother, Junior, who had lost contact with the family after serving in Vietnam. The thrilled Rhames immediately assisted his disheveled brother in getting proper food & clothing, and moving him into his own apartment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTgyMzc4MV5BMl5BanBnXkFtZTYwNjE5Mjk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000609","name":"Ving Rhames","idIMDB":"nm0000609"},"actorId":"nm0000609","character":"The Prophet","urlCharacter":"http://www.imdb.com/character/ch0157361","main":true},{"actorName":"Jack Noseworthy","urlProfile":"http://www.imdb.com/name/nm0005276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmFiZDA5ZGYtZjU2YS00NWJkLTkzNTktYjQ0MWEwZjAxMTBlXkEyXkFqcGdeQXVyMzY3NTE1Njk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1969","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"John E. Noseworthy Jr.","height":"5' 8\" (1.73 m)","bio":"Born and raised in Massachusetts, Jack received his BFA from The Boston Conservatory. He began his career on stage in the national tour of the musical CATS. He made his Broadway debut in the original company of JEROME ROBBINS BROADWAY, played Mark in A CHORUS LINE, and opposite John Lithgow in SWEET SMELL OF SUCCESS. In addition to his New York stage work, he received the Los Angeles Drama Critics prize and a Drama-Logue Award as Best Actor for his starring role as Alan Strang in the Los Angeles production of EQUUS. He stared as Pip in the Utah Shake's production of GREAT EXPECTATIONS as well as Mr. Charles Bingley, in PRIDE & PREJUDICE. In January of 2017 he guest stared on \"Shades Of Blue\" opposite Ray Liotta, and is currently shooting the independent feature \"Band Night\". Jack played Alan deShields in the Lifetime miniseries \"Marilyn\". He played Bobby Kennedy in NatGeo's highest rated film, \"Killing Kennedy\" opposite Rob Lowe and Ginnifer Goodwin. He has completed the features\"10,000 Miles\", \"Julia\" \"Needlestick\" and \"Tio Papi\". He played \"Mordred\" in CAMELOT opposite Nathan Gunn at The Glimmerglass Festival, and recently shot the web pilot, IN PLAIN VIEW. He received rave reviews as Elliot in \"Two Point Oh\" Jeff Jackson's new play off Broadway at 59E59th St. in NYC, as well as narrating the Christopher Wheeldon Ballet, \"Carnival Of The Animals\" for NYCB. In the motion picture arena, he has worked with Jonathan Mostow five times, most recently in the Bruce Willis action thriller \"The Surrogates\", as well as, \"Breakdown,\" \"U-571,\" the FOX Network's pilot \"Them\" and his cameo in \"Terminator 3: Rise of the Machines\". Jack's other feature film credits include the independent favorites, \"Pretty Ugly People\" and \"Phat Girlz,\" as well as, \"Undercover Brother,\" \"Poster Boy,\" \"Unconditional Love,\" \"Event Horizon,\" \"The Brady Bunch Movie,\" \"Barb Wire,\" \"Trigger Effect,\" \"Cecil B. DeMented,\" \"Alive\" and \"Encino Man,\" his movie debut. On television: the Hallmark-Hall-Of-Fame western \"Aces 'N Eights\" \"ELVIS\" opposite Jonathan Rhys Meyers, played Sissy Spacek's son in \"A Place For Annie,\" and Anne Bancroft's obsession in \"Mrs. Cage.\" Other television credits include: \"Shades Of Blue\" \"CSI,\" \"The District,\" \"Law & Order,\" \"Law & Order: SVU,\" \"Crossing Jordan\" and \"Judging Amy\" (four episodes). He also has the distinction of being the series lead on MTV's first scripted series, \"Dead At 21.\" In March of 2016, Jack produced \"Arrabal\" at the Bi-Annual Ibero American Theatre Festival in Bogota, Colombia. \"Arrabal\" begins rehearsals in Cambridge, Ma at American Repertory Theatre on April 3rd, 2017. It opens on May 12th and runs thru June 18th. He previously optioned and produced \"Peter & I\" by Matte O'Brien and Matt Vinson. Jack created, directed and produced three benefits under the Voices For Change banner at Ars Nova, for John Kerry's presidential campaign.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmFiZDA5ZGYtZjU2YS00NWJkLTkzNTktYjQ0MWEwZjAxMTBlXkEyXkFqcGdeQXVyMzY3NTE1Njk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005276","name":"Jack Noseworthy","idIMDB":"nm0005276"},"actorId":"nm0005276","character":"Strickland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Devin Ratray","urlProfile":"http://www.imdb.com/name/nm0711864","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzYxODY0N15BMl5BanBnXkFtZTcwMTU1NDM0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1977","placeOfBirth":" New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Devin Ratray was born on January 11, 1977 in New York City, New York, USA. He is an actor and writer, known for Home Alone (1990), Home Alone 2: Lost in New York (1992) and Blue Ruin (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzYxODY0N15BMl5BanBnXkFtZTcwMTU1NDM0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711864","name":"Devin Ratray","idIMDB":"nm0711864"},"actorId":"nm0711864","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Cudlitz","urlProfile":"http://www.imdb.com/name/nm0191044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTk5NDc4N15BMl5BanBnXkFtZTcwNDQ0MDYyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1964","placeOfBirth":" Long Island, New York, USA","height":"6' 2\" (1.88 m)","bio":"Michael Cudlitz was born on December 29, 1964 in Long Island, New York, USA. He is known for his work on The Walking Dead (2010), Southland (2009) and Négociateur (1998). He is married to Rachel Cudlitz. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTk5NDc4N15BMl5BanBnXkFtZTcwNDQ0MDYyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191044","name":"Michael Cudlitz","idIMDB":"nm0191044"},"actorId":"nm0191044","character":"Colonel Brendon","urlCharacter":"http://www.imdb.com/character/ch0161262","main":true},{"actorName":"Jeffrey De Serrano","urlProfile":"http://www.imdb.com/name/nm1490232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NDQ4OTMxM15BMl5BanBnXkFtZTgwMDc5NDE1NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jeff De Serrano a Cleveland Ohio native, arrived in New York City to pursue a career in acting after receiving a degree from Ohio University. Jeff came to Los Angeles working on the pilot of MTV's Lyricists Lounge, and decided to make The City of Angels his home. Since, Jeff has been able to put together a body of work on Television, on shows such as CSI Miami, Karen Cisco, Ncis LA, Dexter and HBO's Family Tree to name a few. He has also been fortunate to have worked with Directors such as, J J Abrahms, Cameron Crow, Matt Reeves and Jonathan Mastow in his feature film career. Jeff also enjoys being a part of the LA theater scene performing in productions of \"Short Eyes\" by Miguel Pinero at Latc, Seth Zvi Rosenfelds \"Handball\" and Pasadena Playhouse's production of \"Stop Kiss\" by DIana Son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NDQ4OTMxM15BMl5BanBnXkFtZTgwMDc5NDE1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1490232","name":"Jeffrey De Serrano","idIMDB":"nm1490232"},"actorId":"nm1490232","character":"Armando","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helena Mattsson","urlProfile":"http://www.imdb.com/name/nm1998498","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwZWE4MWEtYTc3OS00Yzg3LThkNDYtNTJkYmRmNDk2ZWU4XkEyXkFqcGdeQXVyNzU5NTQ5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1984","placeOfBirth":" Stockholm, Sweden","height":"5' 8\" (1.73 m)","bio":"Helena Mattsson was born and raised in Stockholm, Sweden, with her two sisters. In her early teens she was discovered by one of the biggest modeling agencies in Sweden. After graduating from her Performing Arts High School in Stockholm, Helena traveled to London and New York to continue to study acting. Her big break came at the age of 19 when she left London for Los Angeles and was cast as the lead in the Warner Bros. comedy Sweden, Ohio (2004). Mattsson recently had recurring roles on ABC's Desperate Housewives (2004) and CW's Nikita (2010). In 2012 she was cast as Alexis Blume in 666 Park Avenue (2012) for ABC. Her feature film credits include: Seven Psychopaths (2012) with Colin Farrell, Guns, Girls and Gambling (2012) with Gary Oldman, Surrogates (2009) with Bruce Willis and Iron Man 2 (2010) with Robert Downey Jr..","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwZWE4MWEtYTc3OS00Yzg3LThkNDYtNTJkYmRmNDk2ZWU4XkEyXkFqcGdeQXVyNzU5NTQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1998498","name":"Helena Mattsson","idIMDB":"nm1998498"},"actorId":"nm1998498","character":"JJ the Blonde","urlCharacter":"http://www.imdb.com/character/ch0161263","main":true},{"actorName":"Michael Philip","urlProfile":"http://www.imdb.com/name/nm0679950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgzODQ0NjY5MF5BMl5BanBnXkFtZTgwNjg5NTAwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michael Philip is an actor, known for Guiding Light (1952), Surrogates (2009) and Welcome to Paradox (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgzODQ0NjY5MF5BMl5BanBnXkFtZTgwNjg5NTAwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0679950","name":"Michael Philip","idIMDB":"nm0679950"},"actorId":"nm0679950","character":"Uniformed Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny F Smith","urlProfile":"http://www.imdb.com/name/nm3487301","urlPhoto":"","biography":{"bio":"Danny was born in San Francisco, California on April 24th, the second of two boys to Wayne and Cathy Smith. His father Wayne is a decorated officer in the San Francisco Police Department and his mother Cathy worked as a Kaiser Permanente nurse for 30 years. Danny attended College Park High School in Pleasant Hill California, where he excelled as a three-sport athlete in Football, Wrestling, and Baseball. Subsequently, Danny attended San Diego State University where he studied sociology and played Rugby for the University team. In the summer of his senior year, Danny was scouted and given the opportunity to model for Abercrombie & Fitch in New York City for their Winter 2005 campaign. After graduation Danny made the decision to pursue a career in entertainment. His father encouraged him in this endeavor and advised him to move to Los Angeles. Since his arrival, Danny has had success with recurring roles in soap operas, several commercials, and most recently a supporting role in Surrogates (2009), the upcoming Bruce Willis film opening in September 2009.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3487301","name":"Danny F Smith","idIMDB":"nm3487301"},"actorId":"nm3487301","character":"Victim","urlCharacter":"http://www.imdb.com/character/ch0177842","main":true},{"actorName":"Brian A. Parrish","urlProfile":"http://www.imdb.com/name/nm3040012","urlPhoto":"","biography":{"bio":"Brian A. Parrish is known for his work on Surrogates (2009) and Grand Theft Auto V (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3040012","name":"Brian A. Parrish","idIMDB":"nm3040012"},"actorId":"nm3040012","character":"Hard Hat","urlCharacter":"http://www.imdb.com/character/ch0161755","main":true}],"seasons":[],"idIMDB":"tt0986263","urlIMDB":"http://www.imdb.com/title/tt0986263","business":{"budget":{"money":"$80,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$14,902,692","country":"USA","day":"27","month":"09","year":"2009","remarks":"2,951 Screens"},{"money":"£961,271","country":"UK","day":"27","month":"09","year":"2009","remarks":"356 Screens"}],"gross":[{"money":"$38,542,418","country":"USA","day":"29","month":"11","year":"2009","remarks":""},{"money":"$38,368,790","country":"USA","day":"15","month":"11","year":"2009","remarks":""},{"money":"$38,255,840","country":"USA","day":"08","month":"11","year":"2009","remarks":""},{"money":"$37,573,398","country":"USA","day":"25","month":"10","year":"2009","remarks":""},{"money":"$36,327,650","country":"USA","day":"18","month":"10","year":"2009","remarks":""},{"money":"$32,725,781","country":"USA","day":"11","month":"10","year":"2009","remarks":""},{"money":"$26,284,134","country":"USA","day":"04","month":"10","year":"2009","remarks":""},{"money":"$14,902,692","country":"USA","day":"27","month":"09","year":"2009","remarks":""},{"money":"£3,021,803","country":"UK","day":"18","month":"10","year":"2009","remarks":""},{"money":"£2,763,606","country":"UK","day":"11","month":"10","year":"2009","remarks":""},{"money":"£2,113,842","country":"UK","day":"04","month":"10","year":"2009","remarks":""},{"money":"£961,271","country":"UK","day":"27","month":"09","year":"2009","remarks":""}],"weekendGross":[{"money":"$98,902","country":"USA","day":"29","month":"11","year":"2009","remarks":"158 Screens"},{"money":"$55,642","country":"USA","day":"15","month":"11","year":"2009","remarks":"101 Screens"},{"money":"$126,617","country":"USA","day":"08","month":"11","year":"2009","remarks":"174 Screens"},{"money":"$590,444","country":"USA","day":"25","month":"10","year":"2009","remarks":"797 Screens"},{"money":"$1,917,315","country":"USA","day":"18","month":"10","year":"2009","remarks":"2,326 Screens"},{"money":"$7,241,054","country":"USA","day":"04","month":"10","year":"2009","remarks":"2,951 Screens"},{"money":"$14,902,692","country":"USA","day":"27","month":"09","year":"2009","remarks":"2,951 Screens"},{"money":"£108,910","country":"UK","day":"18","month":"10","year":"2009","remarks":"209 Screens"},{"money":"£591,803","country":"UK","day":"04","month":"10","year":"2009","remarks":"360 Screens"},{"money":"£961,271","country":"UK","day":"27","month":"09","year":"2009","remarks":"356 Screens"}],"admissions":[{"money":"90,795","country":"Netherlands","day":"31","month":"12","year":"2009","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"04","year":"2008","remarks":null},null],"copyrightHolder":"Copyright © 2009 Touchstone Pictures All Rights Reserved For the purposes of United Kingdom copyright, Disney Enterprises, Inc. was the owner of copyright in this film immediately after it was made. (on print)"},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 235, Panavision Primo and Slant Focus Lenses","Arriflex 435, Panavision Primo and Slant Focus Lenses","Panavision Panaflex Millennium XL, Panavision Primo and Slant Focus Lenses","Panavision Panaflex Platinum, Panavision Primo and Slant Focus Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA (also prints: USA & Canada)","Technicolor (prints: all other territories worldwide)"],"filmLength":["2,419 m (Sweden)","2,448 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 250D 5205, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.3","metascore":"45","filmingLocations":[{"location":"Boston, Massachusetts, USA"}],"rated":"PG-13","awards":[],"votes":"154,972","type":"Movie","companyCreditsSimple":[{"idCompany":"co0049348","name":"Touchstone Pictures"},{"idCompany":"co0064942","name":"Mandeville Films"},{"idCompany":"co0025498","name":"Top Shelf Productions"}],"keywords":{"keywords":["fbi agent","future","robot","murder","android","investigation","suicide by poison","fried brain","neo luddite","beauty salon","superhuman speed","superhuman strength","laptop computer","telephone call","deskinned android","burglar","beard","internet research","marital problem","futurism","pro life","factory","prototype","facial scar","eurocopter as350 squirrel","police chase","camera shot of a woman's legs","tuxedo","rolls royce","apb","brain in a vat","crying man","pantsuit","subjective camera","kicking in a door","subway","revenge","hostage","held at gunpoint","duct tape over mouth","cell phone","stealing a car","hit by a car","deception","stabbed in the head","shot in the leg","face ripped off","shot in the back","scarred face","gash in the face","hit with a chair","recreational vehicle","beating","kicked in the face","kicked in the stomach","punched in the face","person on fire","metal detector","obesity","dorchester massachusetts","hit by a truck","nosebleed","severed arm","shot to death","shot in the chest","soldier","lawyer","blood","news report","san diego california","photograph","corpse","reflection in eye","torso cut in half","car crash","falling from height","father son relationship","character says i love you","prologue","doctor","scene during opening credits","suicide","addiction","ch 47 chinook helicopter","nightmare","american flag","secret weapon","anxiety","newscast","foot chase","riding a bicycle down stairs","malfunction","laboratory","man crying","car rollover","limousine","controversial technology","tech noir","megacorporation","impostor","cyberpunk","computer hacker","swat team","shotgun","shot in the head","shootout","rogue agent","murder of a police officer","pistol","motorcycle","military","machine gun","hospital","helicopter","explosion","exploding helicopter","body landing on a car","fbi investigation","2010s","nightclub","husband wife relationship","helicopter crash","electrocution","detective","car chase","assembly line","based on graphic novel","based on comic book","one word title","based on comic","death of child","death of son","based on novel","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:59:56"}}