{"data":{"movies":[{"title":"Stargate: The Ark of Truth","originalTitle":"","year":"2008","releaseDate":"20080311","directors":[{"name":"Robert C. Cooper","id":"nm0178338"}],"writers":[{"name":"Robert C. Cooper","id":"nm0178338"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyODQwMzYyM15BMl5BanBnXkFtZTcwOTY5MzI3NA@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Action","Adventure","Drama","Fantasy","Sci-Fi"],"plot":"SG-1 searches for an ancient weapon which could help them defeat the Ori, and discover it may be in the Ori's own home galaxy. As the Ori prepare to send ships through to the Milky Way to attack Earth, SG-1 travels to the Ori galaxy aboard the Odyssey. The International Oversight committee has their own plans and SG-1 finds themselves in a distant galaxy fighting two powerful enemies.","simplePlot":"SG-1 search for an Ancient Artifact to finally defeat the Ori. But the Artifact is in the Ori Galaxy.","actors":[{"actorName":"Ben Browder","urlProfile":"http://www.imdb.com/name/nm0112871","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzA2NTMwOF5BMl5BanBnXkFtZTgwNzMwMDE2MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1962","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Robert Benedic Browder","height":"6' (1.83 m)","bio":"Ben Browder is an American actor, writer and director born in Memphis, Tennessee on December 11, 1962, as Robert Benedict Browder. After a successful college football career with the Furman University Paladins as a Championship-winning Linebacker while staring in theatrical productions and gaining a degree in Psychology, Ben moved to London to study classical acting at the Central School of Speech and Drama. Ben's acting career started in Charlotte, North Carolina where he was raised. In the late 60s he made TV commercials. In the late 70's he appeared in the children's movie Duncan's World playing Gates, one of Duncan's best friends. While at drama school, he says he was highly influenced by Dame Judith Dench who was a visiting teacher at the school and directed him in several Shakespeare productions. In 1987, he and his future wife, Francesca Buller, were cast in Dustin Hoffman's West End London production of Shakespeare's Merchant of Venice (which went on to play on Broadway in New York). He worked as a guest on various TV series, TV pilots and movies before he got his first noted TV series role as Sam Brody in Party of Five's 3rd season, beginning with episode 9, titled, Gimme Shelter. In 1999, Ben was cast after numerous auditions to play the lead on a science fiction TV series, Farscape which was filmed in Australia by a collaboration of The Jim Henson Company, Channel 9, Hallmark Company and The SciFi Channel. The dramatic and eccentric series where Ben played American astronaut John Crichton unique among a crew of renegade aliens, ran for four seasons on what was then known as the SciFi cable channel (until 2002, when it was cancelled). After finding financing, Farscape: The Peacekeeper Wars was filmed to complete the Farscape series. During has time as lead actor on Farscape, Ben wrote two scripts for the show: Season 3's \"Green-Eyed Monster\" and Season 4's \"John Quixote.\" Ben also starred as Lt. Colonel Cameron Mitchell in the 9th and 10th seasons of SciFi Channel's, Stargate SG-1, after series star and producer Richard Dean Anderson left the show. During his time as lead actor on the show, Ben was given credit for developing the story for Season 10's \"Bad Guys.\" In 2008, Stargate SG-1 filmed two made-for-TV movies staring the actors from the television show including Ben playing Lt. Col. Cameron Mitchell. Ark of Truth dealt with the fall of Adria and Ben played a double-role of his grandfather and Cameron Mitchell in the followup movie, Continuum. From 2012, Ben appeared in guest-starring roles twice on the TV show Arrow, playing Ted Gaynor, on Chuck playing a Thug, and on CSI New Orleans playing a sociopath named Randy Pruitt. He made a huge splash as Sheriff Isaac on the seventh season episode of Doctor Who called, \"A Town Called Mercy.\" Ben has been nominated for the genre industry's Saturn award five times. He took home the award in 2002 for Best Actor in a Television Series (Farscape) and again in 2005 for Best Actor on Television (Farscape: The Peacekeeper Wars). In 2014, Ben made his directorial debut with \"Bad Kids of Crestview Academy,\" for which he also repeated his role as Max Rainwater, a rather dim janitor. He also acted in two movies, \"Dead Still\" and \"RoboRex.\" Ben recently played an extreme character named George Tildon in an independent art house western called \"Outlaws and Angels\" directed and written by JT Mollner which debuted in theaters in January 2016. As of the Fall 2016, he is completing work on a horror film called Hoax that takes place in the wilds of Colorado and is prepping for other projects. Ben makes a few convention appearances each year. In 2012, that included the US and Australia. In 2013, he was in the US - Chicago Stargate Convention, Germany, New Zealand and Australia. Ben is married to actress Francesa Buller. They met in acting school in London. Ben and Francesca have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzA2NTMwOF5BMl5BanBnXkFtZTgwNzMwMDE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0112871","name":"Ben Browder","idIMDB":"nm0112871"},"actorId":"nm0112871","character":"Lt. Col. Cameron Mitchell","urlCharacter":"http://www.imdb.com/character/ch0005982","main":true},{"actorName":"Amanda Tapping","urlProfile":"http://www.imdb.com/name/nm0850102","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NzY0NTY1MF5BMl5BanBnXkFtZTgwNzAxMTk4ODE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1965","placeOfBirth":" Rochford, Essex, England, UK","height":"5' 9\" (1.75 m)","bio":"Born In England, raised in Canada. BFA Acting University of Windsor. Amanda spent 12 seasons on Stargate SG-1 (1997) and its spin-offs, Stargate: Atlantis (2004) and Stargate: Universe (2009), as \"Samantha Carter\". She then took on the lead role of \"Dr. Helen Magnus\" on the television series Sanctuary (2008), a project she had been nurturing from its inception on the internet. Tapping has come to secure a strong and direct influence on her projects from behind the lens. She was an Executive Producer of \"Sanctuary\" and also sat in the director's chair for several episodes. She previously directed the Stargate SG-1 (1997) episode, Stargate SG-1: Resurrection (2004), in 2004, which garnered her a Leo Award nomination for Best Director. She has also directed three episodes each of Primeval: New World (2012), Arctic Air (2012) and Continuum (2012). She has also directed Strange Empire (2014), Olympus (2015), Dark Matter (2015) and X Company (2015). Tapping has also earned four Leo Awards for Best Actress, has been nominated for two Gemini Awards and four Saturn Awards and won the 2005 Saturn Award for Best Supporting Actress. Amanda's love of comedy lead her to co-found the all female Canadian comedy troupe, Random Acts. Her work in the short film Breakdown (2006) earned her the Canadian Comedy Award in 2007. She also did films like Space Milkshake (2012), Random Acts of Romance (2012), 12 ans sans ma fille (2012) and Kid Cannabis (2014). She was Naomi on 7 episodes of the 8th season of Supernatural (2005). She also played a recurring character on the sitcom Package Deal (2013). Tapping has had the pleasure of supporting various charities and organizations such as The Coast Foundation, a support agency for people with mental disabilities, The Canadian Cancer Society, UNICEF and V-Day by performing in \"The Vagina Monologues\" to help end violence against women and girls worldwide. She also sits on the leadership council for The Waterkeeper Alliance. Amanda launched the charitable foundation \"Sanctuary for Kids\" in 2009 to support both local and global children's charities helping children in crisis. To date they have raised over $650,000. Their work takes them to Nepal, Haiti and the downtown east side of Vancouver. She was honored with Women in Film's \"Woman of Vision\" award. She also received the YWCA Women of Distinction \"Connecting the Community\" Award. She was awarded The Jules Verne Award in Paris for her humanitarian work. She was offered an Honorary Life Membership from the University College of Dublin Law Society and received an Honorary Doctorate of Laws from The University of Windsor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NzY0NTY1MF5BMl5BanBnXkFtZTgwNzAxMTk4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0850102","name":"Amanda Tapping","idIMDB":"nm0850102"},"actorId":"nm0850102","character":"Lt. Col. Samantha Carter","urlCharacter":"http://www.imdb.com/character/ch0005974","main":true},{"actorName":"Christopher Judge","urlProfile":"http://www.imdb.com/name/nm0431895","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MDQ0NjEzNl5BMl5BanBnXkFtZTcwMTU2NjQ4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1964","placeOfBirth":" Los Angeles, California, USA","birthName":"Douglas Christopher Judge","height":"6' 2\" (1.88 m)","bio":"Douglas Christopher Judge was born and raised in Los Angeles, and is of African-American and Cherokee ancestry. Judge always knew that he wanted to be an actor, wanting to invoke feelings in others that he was receiving from the shows. He realized quickly that sports would be the stepping stone to an acting career. Attending the University of Oregon on a football scholarship, Judge led in kickoff return yardage for 1983-84 and interceptions in 1984, in addition to earning the Casanova Award in 1982 (given to the freshman or newcomer of the year). Judge was also a three-time All-American, a Pacific-10 Conference Selection in 1984, and played in the 1985 Hula Bowl. While at Oregon, Judge was a pre-med major, then psychology, then telecommunications and film, with a minor in psychology. In his senior year, he won a regional contest to host the West Coast Fox KLSR Morning Show, an \"MTV talk show-type thing\"; he used this experience to get an agent and move to Los Angeles. Judge began studying at the Howard Fine Institute in LA in 1989. Some early roles were Bird on a Wire (1990), Cadence (1990), Le ranch de l'espoir (1989) and MacGyver (1985) with future Stargate SG-1 (1997) star Richard Dean Anderson. In the ensuing years, Judge had small parts in various television shows and movies, such as 21 Jump Street (1987) (with future SG-1 director Peter DeLuise), The Fresh Prince of Bel-Air (1990), and House Party 2 (1991), and as a regular on Les anges de la ville (1993) from 1994 to 1995. Judge's largest role came in 1997 with Stargate SG-1 (1997). While at a friend's house, he saw his friend's roommate practicing for an audition and was intrigued. While the roommate was away, Judge looked at the audition notes, then called his agent and insisted he get him an audition, or lose him as a client. At the audition, there were three sets of actors for each of the principle roles, but eight or ten for the role of \"Teal'c\". Judge was confident he got the part when they dismissed everyone who read for the part, except him. Out of all the actors on \"Stargate SG-1\", Judge has been in the most episodes. More recent works of Judge's include guest spots on Andromeda (2000) and Stargate: Atlantis (2004), the television movie Le souvenir d'un frère (2005), and the films, Chiens des neiges (2002) and A Dog's Breakfast (2007), the latter written and directed by fellow \"Stargate\" actor, David Hewlett. Judge has written three episodes of Stargate SG-1 (1997): Stargate SG-1: The Changeling (2003), Stargate SG-1: Birthright (2003) and Stargate SG-1: Sacrifices (2004). After \"Stargate SG-1\" was canceled, Judge began writing a script for a show called \"Rage of Angels\". Judge also does voice acting for animated series and video games, including the voice of \"Magneto\" on X-Men: Evolution (2000) and the canceled \"Stargate SG-1: The Alliance\". In the season eight episodes of \"Stargate SG-1\" (Stargate SG-1: Avatar (2004) and \"The Warrior\"), Teal'c informs SG-1 that he plays Def Jam Vendetta (2003), alluding to the fact that Judge was a voice actor in that game. He is also known for voicing \"Jericho\" in Turok (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MDQ0NjEzNl5BMl5BanBnXkFtZTcwMTU2NjQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0431895","name":"Christopher Judge","idIMDB":"nm0431895"},"actorId":"nm0431895","character":"Teal'c","urlCharacter":"http://www.imdb.com/character/ch0005979","main":true},{"actorName":"Michael Shanks","urlProfile":"http://www.imdb.com/name/nm0788218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzc2NTE0NF5BMl5BanBnXkFtZTcwOTQ5OTQ1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1970","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Michael Garrett Shanks","height":"6' (1.83 m)","bio":"Michael Shanks was born on December 15, 1970 in Vancouver, British Columbia, Canada as Michael Garrett Shanks. He is an actor and director, known for Stargate SG-1 (1997), Elysium (2013) and Stargate: Continuum (2008). He has been married to Lexa Doig since August 2, 2003. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzc2NTE0NF5BMl5BanBnXkFtZTcwOTQ5OTQ1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0788218","name":"Michael Shanks","idIMDB":"nm0788218"},"actorId":"nm0788218","character":"Dr. Daniel Jackson","urlCharacter":"http://www.imdb.com/character/ch0005966","main":true},{"actorName":"Beau Bridges","urlProfile":"http://www.imdb.com/name/nm0000977","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTY4NzEzOF5BMl5BanBnXkFtZTYwNjgyNTIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1941","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Lloyd Vernet Bridges III","height":"5' 10\" (1.78 m)","bio":"Beau Bridges is the son of actor Lloyd Bridges and his wife, who was his college sweetheart, Dorothy Dean Bridges. Born just two days after the attack on Pearl Harbour, he was delivered by candlelight because of a power blackout. Named Lloyd Vernet Bridges III, his parents immediately started calling him Beau after Ashley Wilkes' son in Gone with the Wind (1939), a book they were reading at the time. His younger brother, actor Jeff Bridges, was born in 1949 and a sister, Cindy Bridges, the following year. Although only 5'10\", Beau played basketball for UCLA his freshman year. The following year he transferred to the University of Hawaii, but dropped out to pursue acting and got his first major role in 1967. During his first marriage to Julie Landifield, they adopted Casey Bridges and then had Jordan Bridges. He and his second wife, Wendy Treece Bridges, have three children from this marriage: Dylan Bridges (born 1985); Emily Bridges, (born 1987) and Ezekiel Jeffry Bridges. Beau likes to play guitar and collects Native American percussion instruments. He also loves the ocean, including swimming and surfing. He is also active in environmental causes and handgun control.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTY4NzEzOF5BMl5BanBnXkFtZTYwNjgyNTIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000977","name":"Beau Bridges","idIMDB":"nm0000977"},"actorId":"nm0000977","character":"Mjr. Gen. Henry Landry","urlCharacter":"http://www.imdb.com/character/ch0005984","main":true},{"actorName":"Claudia Black","urlProfile":"http://www.imdb.com/name/nm0085227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDg2MzY2Ml5BMl5BanBnXkFtZTgwNTQ1NjU4NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1972","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Claudia Lee Black","height":"5' 8\" (1.73 m)","bio":"Claudia Lee Black was born and raised in Sydney, Australia. Her parents Jules and Judy Black are both Australian Medical Academics Doctors. She has lived in Australia, New Zealand, England and the US. Throughout her career Black has played in many Australian and New Zealand films and guested on such Australian series as Sidney police (1989) and Brigade des mers (1996), the American and New Zealand series Hercules: The Legendary Journeys (1995) and Xena: Warrior Princess (1995), and a leading role in the New Zealand soap opera City Life (1996). Since then she has mostly played in science-fiction and fantastic series. She is probably best known for her roles as Ayren Sun in the Australian series Farscape (1999) and Vala Mal Doran in the American series Stargate SG-1 (1997), in which she co-starred with Ben Browder.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDg2MzY2Ml5BMl5BanBnXkFtZTgwNTQ1NjU4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085227","name":"Claudia Black","idIMDB":"nm0085227"},"actorId":"nm0085227","character":"Vala Mal Doran","urlCharacter":"http://www.imdb.com/character/ch0005977","main":true},{"actorName":"Currie Graham","urlProfile":"http://www.imdb.com/name/nm0333982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTc3NDU2Nl5BMl5BanBnXkFtZTcwNzczMDY2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1967","placeOfBirth":" Hamilton, Ontario, Canada","height":"6' 3\" (1.91 m)","bio":"Currie Graham was born on February 26, 1967 in Hamilton, Ontario, Canada. He is an actor, known for Pompéi (2014), Assaut sur le central 13 (2005) and Hitchcock (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTc3NDU2Nl5BMl5BanBnXkFtZTcwNzczMDY2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0333982","name":"Currie Graham","idIMDB":"nm0333982"},"actorId":"nm0333982","character":"James Marrick","urlCharacter":"http://www.imdb.com/character/ch0067738","main":true},{"actorName":"Morena Baccarin","urlProfile":"http://www.imdb.com/name/nm1072555","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODY3MzM2OV5BMl5BanBnXkFtZTgwMDM1OTk5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1979","placeOfBirth":" Rio de Janeiro, Rio de Janeiro, Brazil","birthName":"Morena Silva de Vaz Setta Baccarin","height":"5' 7½\" (1.71 m)","bio":"Morena Baccarin was born in Rio de Janeiro, Brazil, to actress Vera Setta and journalist Fernando Baccarin. Her uncle was actor Ivan Setta. Morena has Italian and Brazilian Portuguese ancestry. She moved to New York at the age of 10, when her father was transferred there. She attended the LaGuardia High School of Music and Performing Arts and then the Juilliard School. Staying in New York she, worked in the theater - notably in the Central Park production of Anton Chekhov's \"The Seagull\" where she was also Natalie Portman's understudy - and appeared in several movies. After making Roger Dodger (2002) she moved to Los Angeles where she came to the attention of Joss Whedon who cast her in his short-lived cult sci-fi show Firefly (2002). Since then she has rarely been off our TV screens.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODY3MzM2OV5BMl5BanBnXkFtZTgwMDM1OTk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1072555","name":"Morena Baccarin","idIMDB":"nm1072555"},"actorId":"nm1072555","character":"Adria","urlCharacter":"http://www.imdb.com/character/ch0027351","main":true},{"actorName":"Tim Guinee","urlProfile":"http://www.imdb.com/name/nm0347375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzUzMzMwNF5BMl5BanBnXkFtZTgwNjk3MTk2OTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1962","placeOfBirth":" Los Angeles, California, USA","birthName":"Timothy Sanders Guinee","height":"5' 10\" (1.78 m)","bio":"Tim Guinee was born in Los Angeles, California. He is a middle child, with three brothers and two sisters. He was raised in Illinois and Texas. As a teenager, he attended the Houston High School for Performing Arts. He also started a theater company in Houston before moving to New York to study at the American Academy of Dramatic Arts. He made his feature film debut after graduating from the North Carolina School of the Arts in Winston-Salem. He met his wife, Daisy Foote, while filming Showtime's Lily Dale (1996). Daisy is the daughter of Pulitzer Prize winner Horton Foote, who adapted \"Lily Dale\" for the screen from his own play.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzUzMzMwNF5BMl5BanBnXkFtZTgwNjk3MTk2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0347375","name":"Tim Guinee","idIMDB":"nm0347375"},"actorId":"nm0347375","character":"Tomin","urlCharacter":"http://www.imdb.com/character/ch0035873","main":true},{"actorName":"Julian Sands","urlProfile":"http://www.imdb.com/name/nm0001696","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwOTg0NjM2NV5BMl5BanBnXkFtZTcwNDU0MjgyMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1958","placeOfBirth":" Otley, Yorkshire, England, UK","birthName":"Julian Richard Morley Sands","height":"5' 11¼\" (1.81 m)","bio":"Tall, gaunt, and particularly effective in horror and drama films--British actor Julian Sands was born in Otley, West Riding of Yorkshire, to Brenda and William Sands. He came to the attention of NBC when the network cast him in the made-for-TV The Sun Also Rises (1984) and then with Anthony Hopkins in the television film A Married Man (1983). Sands also got notice in his very small roles in Privates on Parade (1983) and The Killing Fields (1984). It wasn't until his funny and romantic role opposite Denholm Elliott in A Room with a View (1985) and then his unusual role in Gothic (1986) that audiences noticed him and were fascinated with his good looks and unusual but sometimes chilling appearance. He continued work on screen in Vibes (1988), Impromptu (1991) and Steven Spielberg's Arachnophobia (1990), until his most remembered role as Warlock (1989), directed by Steve Miner. The film was such a major success that he returned for the terrifying sequel, Warlock: The Armageddon (1993). His other credits include Le festin nu (1991), Tale of a Vampire (1992) and the title role in Dario Argento's The Phantom of the Opera (1998). Sands has more recently been in Stephen King's Rose Red (2002) and is also occasionally seen on the English stage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwOTg0NjM2NV5BMl5BanBnXkFtZTcwNDU0MjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001696","name":"Julian Sands","idIMDB":"nm0001696"},"actorId":"nm0001696","character":"Doci","urlCharacter":"http://www.imdb.com/character/ch0005981","main":true},{"actorName":"Sarah Strange","urlProfile":"http://www.imdb.com/name/nm0833385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTM2MDI0NF5BMl5BanBnXkFtZTgwNjc0MDU5ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1974","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 10\" (1.78 m)","bio":"Sarah Strange was born on September 6, 1974 in Vancouver, British Columbia, Canada. She is an actress, known for Da Vinci's Inquest (1998), Men in Trees (2006) and Garage Sale Mystery (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTM2MDI0NF5BMl5BanBnXkFtZTgwNjc0MDU5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0833385","name":"Sarah Strange","nicknames":["Yumm!"],"idIMDB":"nm0833385"},"actorId":"nm0833385","character":"Morgan Le Fay / Ganos Lal","urlCharacter":"http://www.imdb.com/character/ch0090240","main":true},{"actorName":"Michael Beach","urlProfile":"http://www.imdb.com/name/nm0004729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzY5MTcyNl5BMl5BanBnXkFtZTcwOTg2ODEzOQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1963","placeOfBirth":" Roxbury, Massachusetts, USA","birthName":"Michael Anthony Beach","height":"5' 9\" (1.75 m)","bio":"Born and raised in the rough inner city Roxbury area of Boston, Beach was an athlete who never expected to be an actor. After performing in a few high school plays, he auditioned for, got accepted to and later graduated from the prestigious Juilliard School Of Drama in NYC. For the past thirty years, Beach has worked with many acclaimed actors, producers and directors on 50 Feature Films and hundreds of hours of Television. 2013 was a busy year for Beach in both Film and TV. On the big screen, he appeared in BROKEN CITY opposite Mark Wahlberg & Russell Crow, the frightening INSIDIOUS 2 starring Patrick Wilson & Rose Byrne, in ASSASSINS TALE as a killer for hire who rethinks his career choice, and in the Independent films THINGS NEVER SAID and SCRAPPER, and also executive produced the latter. In 2014, Beach returned to NBC as a series regular, joining Gillian Anderson and Dermot Mulroney as the Director of the FBI in the political thriller, CRISIS. He had a lead role in the independent feature SHAKER POINTE, and filmed a supporting part in THE BOUNCE BACK, opposite Shemar Moore and Nadine Velazquez. Beach was also cast in a prominent role alongside Emilie de Ravin and Nancy Travis, in SUBMARINE KID. Beach has stayed busy in Television over the past few years with recurring roles on the following series: CW's highly rated THE 100 playing 'Charles Pike', NBC's number 1 rated THE BLACKLIST, ABC's SECRETS AND LIES, FX's hit show SONS OF ANARCHY, playing 'T.O. Cross,' President of the Grim Bastards MC, BET's number one series THE GAME, Lifetime's THE CLIENT LIST. Beach also starred in the Lifetime movie PASTOR BROWN which featured an All-Star cast. One of Beach's favorite moments in 2013 was re-teaming with long time friends and colleagues, Eddie Cibrian and director Eriq LaSalle, in Hallmark Channel's NOTES FROM DAD. Other notable Feature Films include: CBS Films' PATRIOT'S DAY portraying the role of Governor Patrick during the Boston bombings, MGM's RED DAWN remake, Sony's SPARKLE remake, starring the late Whitney Houston, Dimension's HELL RIDE, starring the late Dennis Hopper, and Screen Gems' FIRST SUNDAY. Beach has guest starred on many of today's top Television series as well, notably the Final episode of the long running series, CSI. Beach is most often recognized for his three year stint on NBC's medical drama mega hit, ER, playing the role of 'Al Boulet,' which allowed Beach to be a part of one of Television's ground breaking HIV/AIDS story lines. Beach continued on NBC and with John Wells, playing 'Monty \"Doc\" Parker' in the character driven, action packed series THIRD WATCH for the run of the series. In the late 1980's and 1990's, Beach enjoyed Films where he starred opposite beautiful, talented women such as Angela Bassett and Whitney Houston in WAITING TO EXHALE, as Ms. Bassett's cheating husband, where she burned his clothes in his expensive Lexus! Beach then cheated on Vanessa Williams, with her cousin no less, in SOUL FOOD, which also starred Vivica Fox and Nia Long. Beach also worked closely with acclaimed actors and directors in several films, such as Robert Duval and James Earl Jones in A FAMILY THING, Richard Geer and Andy Garcia in INTERNAL AFFAIRS, Billy Bob Thornton and Bill Paxton in the critically acclaimed ONE FALSE MOVE, Don Cheadle and Forrest Whitaker in REBOUND, Laurence Fishburne and Charlie Sheen in the Martin Sheen directed film CADENCE, Laurence Fishburne, Frank Langella and Ellen Barkin in BAD COMPANY, Cher and Dennis Quaid in SUSPECT, Kevin Bacon and Holly Hunter in END OF THE LINE, Blair Underwood in ASUNDER, John Travolta in WHITE MAN'S BURDEN, Morgan Freeman in LEAN ON ME, James Cameron in THE ABYSS, Robert Altman in SHORT CUTS, and the late Tony Scott in TRUE ROMANCE written by Quentin Tarantino, with an All-Star cast.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzY5MTcyNl5BMl5BanBnXkFtZTcwOTg2ODEzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004729","name":"Michael Beach","idIMDB":"nm0004729"},"actorId":"nm0004729","character":"Colonel Abe Ellis","urlCharacter":"http://www.imdb.com/character/ch0065549","main":true},{"actorName":"Gary Jones","urlProfile":"http://www.imdb.com/name/nm0428104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzM1NTQ2Nl5BMl5BanBnXkFtZTcwNjQzNDExOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1958","placeOfBirth":" Swansea, Wales, UK","height":"5' 5½\" (1.66 m)","bio":"Gary Jones was born on January 4, 1958 in Swansea, Wales. He is an actor and writer, known for Stargate SG-1 (1997), Stargate: Continuum (2008) and Stargate: The Ark of Truth (2008). He is married to Meg Cameron. They have three children. He was previously married to Greta Headley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzM1NTQ2Nl5BMl5BanBnXkFtZTcwNjQzNDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428104","name":"Gary Jones","nicknames":["Jonesy"],"idIMDB":"nm0428104"},"actorId":"nm0428104","character":"Chief Master Sgt. Walter Harriman","urlCharacter":"http://www.imdb.com/character/ch0006012","main":true},{"actorName":"Martin Christopher","urlProfile":"http://www.imdb.com/name/nm1530106","urlPhoto":"","biography":{"dateOfBirth":"14 December 1977","placeOfBirth":" Vancouver, British Columbia, Canada","height":"6' 1\" (1.85 m)","bio":"Martin Christopher was born on December 14, 1977 in Vancouver, British Columbia, Canada. He is an actor, known for Night at the Museum (2006), Stargate: The Ark of Truth (2008) and Art History (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1530106","name":"Martin Christopher","idIMDB":"nm1530106"},"actorId":"nm1530106","character":"Major Kevin Marks","urlCharacter":"http://www.imdb.com/character/ch0006026","main":true},{"actorName":"Chris Gauthier","urlProfile":"http://www.imdb.com/name/nm0310240","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDcyNzk0NV5BMl5BanBnXkFtZTgwOTY2NTA0MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1976","placeOfBirth":" Luton, Bedfordshire, England, UK","height":"5' 7\" (1.7 m)","bio":"Chris Gauthier was born on January 27, 1976 in Luton, Bedfordshire, England. He is an actor and writer, known for Watchmen (2009), Insomnia (2002) and Eureka (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDcyNzk0NV5BMl5BanBnXkFtZTgwOTY2NTA0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0310240","name":"Chris Gauthier","nicknames":["the Gooch"],"idIMDB":"nm0310240"},"actorId":"nm0310240","character":"Hertis","urlCharacter":"http://www.imdb.com/character/ch0077393","main":true}],"seasons":[],"idIMDB":"tt0942903","urlIMDB":"http://www.imdb.com/title/tt0942903","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"04","year":"2007","remarks":null},{"money":null,"country":null,"day":"08","month":"05","year":"2007","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["DTS (5.1 surround)"],"color":["Color"],"aspectRatio":["1.78 : 1 (widescreen)"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["16 mm"],"cinematographicProcess":["Super 16"],"printedFilmFormat":["Video"]},"rating":"7.4","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"awards":[],"votes":"16,797","type":"Video","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0232746","name":"Kawoosh! Productions DTV I"}],"keywords":{"keywords":["stargate","evil god","wormhole","2000s","space opera","deus ex machina","intragalactic travel","alternate timeline"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:25:16"}}