{"data":{"movies":[{"title":"Taken","originalTitle":"","year":"2008","releaseDate":"20090130","directors":[{"name":"Pierre Morel","id":"nm0603628"}],"writers":[{"name":"Luc Besson","id":"nm0000108"},{"name":"Robert Mark Kamen","id":"nm0436543"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzQ0OTYyOF5BMl5BanBnXkFtZTcwMDkyNjQyMg@@._V1.jpg","countries":["France"],"languages":["English","French","Albanian","Arabic"],"genres":["Action","Thriller"],"plot":"Seventeen year-old Kim is the pride and joy of her father Bryan Mills. Bryan is a retired agent who left the Central Intelligence Agency to be near Kim in California. Kim lives with her mother Lenore and her wealthy stepfather Stuart. Kim manages to convince her reluctant father to allow her to travel to Paris with her friend Amanda. When the girls arrive in Paris they share a cab with a stranger named Peter, and Amanda lets it slip that they are alone in Paris. Using this information an Albanian gang of human traffickers kidnaps the girls. Kim barely has time to call her father and give him information. Her father gets to speak briefly to one of the kidnappers and he promises to kill the kidnappers if they do not let his daughter go free. The kidnapper wishes him \"good luck,\" so Bryan Mills travels to Paris to search for his daughter and her friend.","simplePlot":"A retired CIA agent travels across Europe and relies on his old skills to save his estranged daughter, who has been kidnapped while on a trip to Paris.","actors":[{"actorName":"Liam Neeson","urlProfile":"http://www.imdb.com/name/nm0000553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1952","placeOfBirth":" Ballymena, Co. Antrim, Northern Ireland, UK","birthName":"William John Neeson","height":"6' 4\" (1.93 m)","bio":"Liam Neeson was born on June 7, 1952 in Ballymena, Northern Ireland, UK, to Katherine (Brown), a cook, and Bernard Neeson, a school caretaker. Liam worked as a forklift operator for Guinness, truck driver, assistant architect and an amateur boxer. He had originally sought a career as a teacher by attending St. Mary's Teaching College, Newcastle. However, in 1976, Neeson joined the Belfast Lyric Players' Theater and made his professional acting debut in the play \"The Risen People\". After two years, Neeson moved to Dublin's Abbey Theater where he performed the classics. It was here that he was spotted by director John Boorman and was cast in the film Excalibur (1981) as Sir Gawain, his first high-profile film role. Through the 1980s Neeson appeared in a handful of films and British TV series - including The Bounty (1984), A Woman of Substance (1984), The Mission (1986), and Duet for One (1986) - but it was not until he moved to Hollywood to pursue larger roles that he began to get noticed. His turn as a mute homeless man in Suspect (1987) garnered good reviews, as did supporting roles in The Good Mother (1988) and High Spirits (1988) - though he also starred in the best-to-be-forgotten Satisfaction (1988), which also featured a then-unknown Julia Roberts - but leading man status eluded him until the cult favorite Darkman (1990), directed by Sam Raimi. From there, Neeson starred in Under Suspicion (1991) and Ethan Frome (1993), was hailed for his performance in Woody Allen's Husbands and Wives (1992), and ultimately was picked by Steven Spielberg to play Oskar Schindler in Schindler's List (1993). The starring role in the Oscar-winning Holocaust film brought Neeson Academy Award, BAFTA and Golden Globe nominations for Best Actor. Also in 1993, he made his Broadway debut with a Tony-nominated performance in \"Anna Christie\", in which he co-starred with his future wife Natasha Richardson. The next year, the two also starred opposite Jodie Foster in the movie Nell (1994), and were married in July of that year. Leading roles as the 18th century Scottish Highlander Rob Roy (1995) and the Irish revolutionary leader Michael Collins (1996) followed, and soon Neeson was solidified as one of Hollywood's top leading men. He starred in the highly-anticipated Star Wars: Episode I - The Phantom Menace (1999) as Qui-Gon Jinn, received a Golden Globe nomination for Kinsey (2004), played the mysterious Ducard in Christopher Nolan's Batman Begins (2005), and provided the voice for Aslan in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). Neeson found a second surprise career as an action leading man with the release of Taken (2008) in early 2009, an unexpected box office hit about a retired CIA agent attempting to rescue his daughter from being sold into prostitution. However, less than two months after the release of the film, tragedy struck when Richardson suffered a fatal head injury while skiing and passed away days afterward. Neeson returned to high-profile roles in 2010 with two back-to-back big-budget films, Clash of the Titans (2010) and The A-Team (2010), and returned to the action genre with Unknown (2011), The Grey (2011), Battleship (2012) and Taken 2 (2012), as well as the sequel La colère des Titans (2012). Neeson was awarded Officer of the Order of the British Empire in the 1999 Queen's New Year's Honours List for his services to drama. He has two sons from his marriage to Richardson: Micheal Richard Antonio Neeson (born June 22, 1995) and Daniel Jack Neeson (born August 27, 1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000553","name":"Liam Neeson","idIMDB":"nm0000553"},"actorId":"nm0000553","character":"Bryan Mills","urlCharacter":"http://www.imdb.com/character/ch0116776","main":true},{"actorName":"Maggie Grace","urlProfile":"http://www.imdb.com/name/nm1192254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDYxNjU1N15BMl5BanBnXkFtZTgwMDU2MzQ0ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1983","placeOfBirth":" Columbus, Ohio, USA","birthName":"Margaret Grace Denig","height":"5' 9\" (1.75 m)","bio":"Maggie Grace was born on September 21, 1983, in Columbus, Ohio, to Valinn (Everett) and Rick Denig, who ran a jewelry business. She has English, German, and Scots-Irish ancestry. Grace got her start in films in 2002 with Murder in Greenwich (2002) and Shop Club (2002). In 2003, at the age of 20, she played a creepy, Goth-influenced estranged daughter of Wendy Crewson and Tom Selleck in the drama Twelve Mile Road (2003), but her big break didn't come until one year later, playing the beautiful Shannon Rutherford on the hit ABC island-survival drama Lost (2004). She also stars with Smallville (2001) cover boy Tom Welling in the horror film The Fog (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDYxNjU1N15BMl5BanBnXkFtZTgwMDU2MzQ0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1192254","name":"Maggie Grace","idIMDB":"nm1192254"},"actorId":"nm1192254","character":"Kim","urlCharacter":"http://www.imdb.com/character/ch0101951","main":true},{"actorName":"Leland Orser","urlProfile":"http://www.imdb.com/name/nm0650702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODE2ODM5OF5BMl5BanBnXkFtZTgwODc5NzIyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1960","placeOfBirth":" San Francisco, California, USA","birthName":"Leland Jones Orser","height":"5' 8½\" (1.74 m)","bio":"Leland Orser was born on August 6, 1960 in San Francisco, California, USA as Leland Jones Orser. He is an actor and director, known for Taken (2008), Taken 2 (2012) and Se7en (1995). He has been married to Jeanne Tripplehorn since October 14, 2000. They have one child. He was previously married to Roma Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODE2ODM5OF5BMl5BanBnXkFtZTgwODc5NzIyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0650702","name":"Leland Orser","idIMDB":"nm0650702"},"actorId":"nm0650702","character":"Sam","urlCharacter":"http://www.imdb.com/character/ch0098835","main":true},{"actorName":"Jon Gries","urlProfile":"http://www.imdb.com/name/nm0340973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTkwNjg0NV5BMl5BanBnXkFtZTYwNzg2Njc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1957","placeOfBirth":" Glendale, California, USA","birthName":"Jonathan Francis Gries","height":"5' 11\" (1.8 m)","bio":"Jon Gries was born on June 17, 1957 in Glendale, California, USA as Jonathan Francis Gries. He is an actor, known for Taken (2008), Napoleon Dynamite (2004) and Men in Black (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTkwNjg0NV5BMl5BanBnXkFtZTYwNzg2Njc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340973","name":"Jon Gries","idIMDB":"nm0340973"},"actorId":"nm0340973","character":"Casey","urlCharacter":"http://www.imdb.com/character/ch0135700","main":true},{"actorName":"David Warshofsky","urlProfile":"http://www.imdb.com/name/nm0913175","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDY4NDY0OF5BMl5BanBnXkFtZTcwMzE0MDczNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1961","placeOfBirth":" San Francisco, California, USA","bio":"David was born David Warner in San Francisco, CA. He changed his last name back to the original, Warshofsky, in 1984 when he joined Actor's Equity and then legally when his son Macgee was born in 1997. He went to Saratoga High School and is still good friends with fellow show biz alumni Lance Guest and Ed Solomon. Warshofsky is a graduate of the MFA program at NYU's Tisch School of the Arts and in his early career worked extensively both on and off Broadway. He recently had a daughter, Helen, with his girlfriend Kristina Lear. They all live together in a very nice Los Angeles neighborhood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDY4NDY0OF5BMl5BanBnXkFtZTcwMzE0MDczNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0913175","name":"David Warshofsky","idIMDB":"nm0913175"},"actorId":"nm0913175","character":"Bernie","urlCharacter":"http://www.imdb.com/character/ch0094049","main":true},{"actorName":"Holly Valance","urlProfile":"http://www.imdb.com/name/nm0883480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzIyMjkyMl5BMl5BanBnXkFtZTYwMTI1ODgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1983","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Holly Rachel Vukadinovic","height":"5' 7½\" (1.71 m)","bio":"Holly Rachel Valance was born on 11th May 1983 in Melbourne, to parents Rachel and Ryko. Holly's mother is from Southampton, England and her father hails from Yugoslavia. Both her parents were fashion models and her father is a pianist and guitarist. Her parents live in Melbourne with Holly's two younger sisters, Coco Melody, and Olympia Montana. Holly has a home in the lively Melbourne suburb of Brighton, but lives in London, England. In her early teens, Holly did modelling for catwalk shows, commercials, editorial and catalogues. After leaving school, she started a three year contract on the popular Australian soap Les voisins (1985), and her popularity soared as feisty Felicity Scully. She left Les voisins (1985) in August 2002 to further pursue her pop career; that awarded her with a #1 hit with her debut single in the UK and Australia - \"Kiss Kiss\" in May 2002. Not only has Holly been a talented singer since her childhood days, but she's proved to be an accomplished dancer, and has even penned some tracks on her album - \"Footprints\". When Holly isn't busy, she likes to swim, go for walks and even watch kickboxing after previously practising Muay Tai. Holly enjoys visits to clubs, bars and restaurants, but confesses that she much prefers a quiet night in with one of her favourite meals - antipasto, Greek and Lebanese food, or rocket and parmesan salad.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzIyMjkyMl5BMl5BanBnXkFtZTYwMTI1ODgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0883480","name":"Holly Valance","idIMDB":"nm0883480"},"actorId":"nm0883480","character":"Sheerah","urlCharacter":"http://www.imdb.com/character/ch0134851","main":true},{"actorName":"Katie Cassidy","urlProfile":"http://www.imdb.com/name/nm1556320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMzA1MTY2MV5BMl5BanBnXkFtZTgwMzIyNzQ3MDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Katherine Evelyn Anita Cassidy","height":"5' 7½\" (1.71 m)","bio":"Katie Cassidy was born Katherine Evelyn Anita Cassidy on November 25, 1986, in Los Angeles, California. Her father, David Cassidy, was a pop star in the 1970s. Her mother, Sherry Williams, was a high fashion model in the early 1970s. Sherry left her career to concentrate on raising her 3 daughters, with husband, Richard Benedon M.D., Katie's stepdad. Her famous relatives include uncles Shaun Cassidy, Patrick Cassidy and Ryan Cassidy, and grandparents Jack Cassidy, Evelyn Ward and Shirley Jones. As a child, Katie took gymnastics, studied piano, guitar and singing, then took dancing and acting lessons and eventually became a cheerleader for the California Flyers. She attended Calabasas High School in her neighborhood, where she also cheered as a freshman. Her mother insisted that she complete college prep classes in high school before she embarked on her acting career. For years prior to graduation in 2005, Katie was modeling and studying acting in community theater. Katie had just been accepted to 'Tisch' at NYU when she was offered her first role as \"Dee Dee\", which was one month before graduating. Katie has not stopped working since. Katie's early exposure to show business, the cosmopolitan culture of Los Angeles, her family upbringing, and her comprehensive education altogether produced a remarkable result. She grew up as a multifaceted person showing her many talents in a variety of professions such as recording her father's 1970s hit \"I Think I Love You\" and singing in VH1's TV special Bubblegum Babylon (2002), writing her own songs, modeling for Abercrombie and Fitch and Guess?'s Rock and Republic clothing lines in 2004, and acting. However, she was publicly criticized by her father who would have liked for her to wait before she covered his classic hit. During her stint with Artemis Records, she was introduced to the popular boy band Dream Street. There she met Greg Raposo, who wrote the song \"We're In Love\" for her when they dated in 2002. She also met her ex-boyfriend, Jesse McCartney, there and later appeared as his love interest in his video hit \"She's No You\". A story on Jesse and Katie appeared in the January 2006 issue of Teen People magazine. At that time she was busy working on five feature film productions going on almost simultaneously. Katie made several appearances in TV series, such as 7th Heaven (1996) and Sex, Love & Secrets (2005), among others. She appeared as Samantha, the grown-up daughter of Adam Sandler and Kate Beckinsale in the comedy Click (2006). After the release of a teen horror film, When a Stranger Calls (2006),in which she co-starred as Tiffany, Cassidy went to Vancouver to work on her second horror film, Black Christmas (2006), in which she stars as a sorority girl. Katie recently beat out the likes of Jessica Simpson and Kristin Cavallari for the leading role opposite John Travolta as his daughter and the heir to the most powerful energy company in the world in Dallas, the big-screen remake of the cult TV series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMzA1MTY2MV5BMl5BanBnXkFtZTgwMzIyNzQ3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1556320","name":"Katie Cassidy","nicknames":["Bug","K"],"idIMDB":"nm1556320"},"actorId":"nm1556320","character":"Amanda","urlCharacter":"http://www.imdb.com/character/ch0130215","main":true},{"actorName":"Xander Berkeley","urlProfile":"http://www.imdb.com/name/nm0075359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1955","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Alexander Harper Berkeley","height":"6' (1.83 m)","bio":"Xander's father was a painter and his mother a school teacher who sewed, providing him with costumes (his preference over toys). School plays and Community Theater were next. An experimental theater troupe in the area (which was an offshoot from Joseph Chaikin's Open Theater in New York) took Xander under their wing when he was 16. He credits this group for shaping him as both a person and an actor, committed to taking risks and remaining open to the unknown. Xander went to Hampshire College, the progressive brainchild of Smith, Mt. Holyoke, Amherst, and the University of Massachusetts. He would continue in the theater at Hampshire, studying and doing plays at each of the other schools, all of which were there in the area. A move to New York after college brought him access to private teachers from the Royal Academy of the Arts, the Moscow Arts Theater and HB Studios. Later in Los Angeles, Xander would spend time with Lee Strasberg at The Actor's Studio during the last years of his life. Xander worked in Regional and Repertory Theaters in addition to off-Broadway while living in New York but, despite a classically trained theater background, he was increasingly drawn to the subtleties of film acting. A play, written by the great southern novelist Reynolds Price, called \"Early Dark\" had such a cinematic feel to it, that an agent saw the film acting potential in Xander and encouraged him to make the move out west. Soon Mommie Dearest (1981) provided Xander with his film debut in the role of \"Christopher Crawford\", and simultaneously gave his career a slightly cultish twist. Alex Cox with Sid and Nancy (1986), James Cameron with Terminator 2: Judgment Day (1991), Bernard Rose with Candyman (1992), Todd Haynes with Safe (1995), Mike Figgis with Leaving Las Vegas (1995), Andrew Niccol with Gattaca (1997) all helped to further associate Xander as an actor in his own rather unusual category. Xander's choices were often determined by the opportunity to learn from directors he admired, certainly all those listed above fell into that category. Clint Eastwood with The Rookie (1990), Ron Howard with Apollo 13 (1995), Rob Reiner with A Few Good Men (1992), Michael Mann with Heat (1995), Wolfgang Petersen with Air Force One (1997), Steven Spielberg with Amistad (1997) are obvious examples of others Xander actively sought to work with and learn from. From obscure independent movies where Xander could play lead roles to the big budget studio movies where he might often play smaller character-driven parts, an education was taking place. Just as working with older directors like Mihalis Kakogiannis on La cerisaie (1999) and Robert M. Young on Human Error (2004) (aka \"Human Error\") brought insights to ways of working that are being lost in pop cultures tendency to slide toward slickness. Not to mention bringing him to places like Bulgaria and China along the way. Perhaps because a life in the foreign services, or espionage was seen as a road not taken, living on location in foreign countries, working as an actor, has somewhat fulfilled the impulse. As early as 1987, a film took Xander to Nicaragua while the Contra War was taking place. It was during this three month shoot on the film Walker (1987) (starring Ed Harris) that Xander got an offer to do a film with his friend, director Jon Hess, in Chile for the following three months. Taking him straight from the revolutionary left-wing Sandanistas to Pinochet's fascist, right-wing regime. In 2001, an offer came in to play a part on a TV pilot called 24 (2001). It was another shady agent-type, and reluctant to repeat his performance from Air Force One (1997) as the turncoat secret serviceman, Xander almost passed on the job. Fortunately for him, he said yes. He met his future wife, Sarah Clarke during the first day of filming. His character, \"George Mason\", was just a guest star in the pilot, but the producers liked what Xander brought to it and continued to write more episodes for him. By the second season, it had become perhaps the most interesting, leveled character Xander had ever gotten to play. Sarah and Xander were married in 2002 and had their daughters, Olwyn in 2006 and Rowan in 2010. Other favorite roles of late have been \"Arlen Pavich\", the middle management dweeb, in Niki Caro's North Country (2005), and the Irish hooligan/railway foreman in David Von Ancken's Seraphim Falls (2006) and, more recently, \"The King of Sodom\" in Harold Ramis' Year One (2009), \"Sonny\" in David Pomes' Cook County (2009), the recovering meth head coming out of prison to discover the life he had left (and destroyed), and crazy \"Uncle Doug\" in David Wike's Out There (2006) (aka \"Out There\").","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0075359","name":"Xander Berkeley","idIMDB":"nm0075359"},"actorId":"nm0075359","character":"Stuart","urlCharacter":"http://www.imdb.com/character/ch0130214","main":true},{"actorName":"Olivier Rabourdin","urlProfile":"http://www.imdb.com/name/nm0705005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjU2MDI3MF5BMl5BanBnXkFtZTcwOTk3MDE1Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Olivier Rabourdin is an actor and writer, known for Taken (2008), Midnight in Paris (2011) and Des hommes et des dieux (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjU2MDI3MF5BMl5BanBnXkFtZTcwOTk3MDE1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0705005","name":"Olivier Rabourdin","idIMDB":"nm0705005"},"actorId":"nm0705005","character":"Jean-Claude","urlCharacter":"http://www.imdb.com/character/ch0128243","main":true},{"actorName":"Gérard Watkins","urlProfile":"http://www.imdb.com/name/nm0914313","urlPhoto":"","biography":{"dateOfBirth":"4 July 1965","placeOfBirth":" London, England, UK","bio":"Gérard Watkins was born on July 4, 1965 in London, England. He is an actor, known for Taken (2008), The Diving Bell and the Butterfly (2007) and Love Me If You Dare (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0914313","name":"Gérard Watkins","idIMDB":"nm0914313"},"actorId":"nm0914313","character":"St-Clair","urlCharacter":"http://www.imdb.com/character/ch0134852","main":true},{"actorName":"Famke Janssen","urlProfile":"http://www.imdb.com/name/nm0000463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ5MjU2NTQ0OV5BMl5BanBnXkFtZTcwNzAzODU1Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1964","placeOfBirth":" Amstelveen, Noord-Holland, Netherlands","birthName":"Famke Beumer Janssen","height":"5' 11½\" (1.82 m)","bio":"Famke Janssen was born on November 5, 1964 in Amstelveen, Netherlands, and has two siblings, director Antoinette Beumer and actress Marjolein Beumer. She studied economics for a year at the University of Amsterdam. Moving to America in 1984, Famke modeled for Chanel in New York City. Later, taking a break from modeling, she majored in writing and literature at Columbia University and studied acting with Harold Guskin. She then went to Los Angeles, California, where she continued to study acting under Roy London. Her first film was the crime drama Fathers & Sons (1992), where she played the love interest of Jeff Goldblum. Later, she became James Bond's enemy in GoldenEye (1995) opposite Pierce Brosnan. Famke received strong critical acclaim for her electrifying performance as the femme fatale Xenia Onatopp. Her career has bloomed since then with her starring in such films as House on Haunted Hill (1999), a reoccurring role on FX's Nip/Tuck (2003) and the blockbuster trilogy X-Men (2000), X-Men 2 (2003), and X-Men: L'affrontement final (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ5MjU2NTQ0OV5BMl5BanBnXkFtZTcwNzAzODU1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000463","name":"Famke Janssen","idIMDB":"nm0000463"},"actorId":"nm0000463","character":"Lenore","urlCharacter":"http://www.imdb.com/character/ch0059438","main":true},{"actorName":"Marc Amyot","urlProfile":"http://www.imdb.com/name/nm0025509","urlPhoto":"","biography":{"bio":"Marc Amyot is an actor and director, known for Taken (2008), Amélie (2001) and The City of Lost Children (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0025509","name":"Marc Amyot","idIMDB":"nm0025509"},"actorId":"nm0025509","character":"Pharmacist","urlCharacter":"http://www.imdb.com/character/ch0135698","main":true},{"actorName":"Arben Bajraktaraj","urlProfile":"http://www.imdb.com/name/nm0048076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTI4Mjg0MV5BMl5BanBnXkFtZTcwNzg5OTA5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Arben Bajraktaraj is an actor, known for Taken (2008), Harry Potter and the Deathly Hallows: Part 1 (2010) and Harry Potter and the Order of the Phoenix (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTI4Mjg0MV5BMl5BanBnXkFtZTcwNzg5OTA5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048076","name":"Arben Bajraktaraj","idIMDB":"nm0048076"},"actorId":"nm0048076","character":"Marko","urlCharacter":"http://www.imdb.com/character/ch0128242","main":true},{"actorName":"Radivoje Bukvic","urlProfile":"http://www.imdb.com/name/nm1366568","urlPhoto":"","biography":{"dateOfBirth":"20 November 1979","placeOfBirth":" Sombor, Serbia, Yugoslavia","height":"6' 3¼\" (1.91 m)","bio":"Radivoje Bukvic was born on November 20, 1979 in Sombor, Serbia, Yugoslavia. He is an actor, known for Taken (2008), A Good Day to Die Hard (2013) and Our Kind of Traitor (2016). He has been married to Marija Bergam since September 2015. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1366568","name":"Radivoje Bukvic","nicknames":["Rasa"],"idIMDB":"nm1366568"},"actorId":"nm1366568","character":"Anton","urlCharacter":"http://www.imdb.com/character/ch0129062","main":true},{"actorName":"Mathieu Busson","urlProfile":"http://www.imdb.com/name/nm0688550","urlPhoto":"","biography":{"bio":"Mathieu Busson is an actor and director, known for Taken (2008), 8 fois debout (2009) and Une bonne affaire (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0688550","name":"Mathieu Busson","idIMDB":"nm0688550"},"actorId":"nm0688550","character":"Undercover Agent","urlCharacter":"http://www.imdb.com/character/ch0135703","main":true}],"seasons":[],"idIMDB":"tt0936501","urlIMDB":"http://www.imdb.com/title/tt0936501","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$24,717,037","country":"USA","day":"01","month":"02","year":"2009","remarks":"3,183 Screens"},{"money":"£1,165,986","country":"UK","day":"28","month":"09","year":"2008","remarks":"396 Screens"},{"money":"PHP 4,522,977","country":"Philippines","day":"15","month":"03","year":"2009","remarks":"30 Screens"}],"gross":[{"money":"$145,000,989","country":"USA","day":"05","month":"07","year":"2009","remarks":""},{"money":"$144,989,009","country":"USA","day":"28","month":"06","year":"2009","remarks":""},{"money":"$144,977,147","country":"USA","day":"21","month":"06","year":"2009","remarks":""},{"money":"$144,924,285","country":"USA","day":"07","month":"06","year":"2009","remarks":""},{"money":"$144,783,869","country":"USA","day":"24","month":"05","year":"2009","remarks":""},{"money":"$144,540,399","country":"USA","day":"17","month":"05","year":"2009","remarks":""},{"money":"$144,197,013","country":"USA","day":"10","month":"05","year":"2009","remarks":""},{"money":"$143,623,907","country":"USA","day":"03","month":"05","year":"2009","remarks":""},{"money":"$142,607,741","country":"USA","day":"26","month":"04","year":"2009","remarks":""},{"money":"$142,088,804","country":"USA","day":"19","month":"04","year":"2009","remarks":""},{"money":"$141,107,779","country":"USA","day":"12","month":"04","year":"2009","remarks":""},{"money":"$139,416,323","country":"USA","day":"05","month":"04","year":"2009","remarks":""},{"money":"$137,068,886","country":"USA","day":"29","month":"03","year":"2009","remarks":""},{"money":"$133,096,403","country":"USA","day":"22","month":"03","year":"2009","remarks":""},{"money":"$126,752,054","country":"USA","day":"15","month":"03","year":"2009","remarks":""},{"money":"$117,933,922","country":"USA","day":"08","month":"03","year":"2009","remarks":""},{"money":"$107,796,273","country":"USA","day":"01","month":"03","year":"2009","remarks":""},{"money":"$95,034,161","country":"USA","day":"22","month":"02","year":"2009","remarks":""},{"money":"$80,496,557","country":"USA","day":"15","month":"02","year":"2009","remarks":""},{"money":"$53,610,944","country":"USA","day":"08","month":"02","year":"2009","remarks":""},{"money":"$47,487,241","country":"USA","day":"06","month":"02","year":"2009","remarks":""},{"money":"$24,717,037","country":"USA","day":"01","month":"02","year":"2009","remarks":""},{"money":"£6,277,639","country":"UK","day":"02","month":"11","year":"2008","remarks":""},{"money":"£5,525,386","country":"UK","day":"19","month":"10","year":"2008","remarks":""},{"money":"£4,527,090","country":"UK","day":"12","month":"10","year":"2008","remarks":""},{"money":"£3,104,042","country":"UK","day":"05","month":"10","year":"2008","remarks":""},{"money":"£1,165,986","country":"UK","day":"28","month":"09","year":"2008","remarks":""},{"money":"$226,830,568","country":"Worldwide","day":"05","month":"07","year":"2009","remarks":""},{"money":"PHP 7,110,684","country":"Philippines","day":"22","month":"03","year":"2009","remarks":""},{"money":"PHP 4,522,977","country":"Philippines","day":"15","month":"03","year":"2009","remarks":""}],"weekendGross":[{"money":"$9,048","country":"USA","day":"05","month":"07","year":"2009","remarks":"15 Screens"},{"money":"$4,842","country":"USA","day":"28","month":"06","year":"2009","remarks":"15 Screens"},{"money":"$10,218","country":"USA","day":"21","month":"06","year":"2009","remarks":"27 Screens"},{"money":"$33,394","country":"USA","day":"07","month":"06","year":"2009","remarks":"71 Screens"},{"money":"$173,722","country":"USA","day":"24","month":"05","year":"2009","remarks":"154 Screens"},{"money":"$239,966","country":"USA","day":"17","month":"05","year":"2009","remarks":"250 Screens"},{"money":"$448,375","country":"USA","day":"10","month":"05","year":"2009","remarks":"385 Screens"},{"money":"$896,888","country":"USA","day":"03","month":"05","year":"2009","remarks":"494 Screens"},{"money":"$355,149","country":"USA","day":"26","month":"04","year":"2009","remarks":"450 Screens"},{"money":"$584,153","country":"USA","day":"19","month":"04","year":"2009","remarks":"609 Screens"},{"money":"$1,083,022","country":"USA","day":"12","month":"04","year":"2009","remarks":"872 Screens"},{"money":"$1,544,471","country":"USA","day":"05","month":"04","year":"2009","remarks":"1,355 Screens"},{"money":"$2,695,342","country":"USA","day":"29","month":"03","year":"2009","remarks":"1,961 Screens"},{"money":"$4,057,695","country":"USA","day":"22","month":"03","year":"2009","remarks":"2,661 Screens"},{"money":"$6,568,651","country":"USA","day":"15","month":"03","year":"2009","remarks":"2,858 Screens"},{"money":"$7,334,814","country":"USA","day":"08","month":"03","year":"2009","remarks":"3,016 Screens"},{"money":"$9,864,197","country":"USA","day":"01","month":"03","year":"2009","remarks":"3,091 Screens"},{"money":"$11,281,262","country":"USA","day":"22","month":"02","year":"2009","remarks":"3,102 Screens"},{"money":"$21,821,805","country":"USA","day":"15","month":"02","year":"2009","remarks":"3,109 Screens"},{"money":"$20,547,346","country":"USA","day":"08","month":"02","year":"2009","remarks":"3,184 Screens"},{"money":"$24,717,037","country":"USA","day":"01","month":"02","year":"2009","remarks":"3,183 Screens"},{"money":"£54,499","country":"UK","day":"02","month":"11","year":"2008","remarks":"112 Screens"},{"money":"£530,578","country":"UK","day":"19","month":"10","year":"2008","remarks":"334 Screens"},{"money":"£790,670","country":"UK","day":"12","month":"10","year":"2008","remarks":"363 Screens"},{"money":"£1,096,324","country":"UK","day":"05","month":"10","year":"2008","remarks":"398 Screens"},{"money":"£1,165,986","country":"UK","day":"28","month":"09","year":"2008","remarks":"396 Screens"},{"money":"PHP 2,215,053","country":"Philippines","day":"22","month":"03","year":"2009","remarks":"30 Screens"},{"money":"PHP 4,522,977","country":"Philippines","day":"15","month":"03","year":"2009","remarks":"30 Screens"}],"admissions":[{"money":"90,910","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 2007 Europacorp - M6 Films - Grive Productions"},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Genesis HD Camera, Panavision Primo Lenses","Panavision Panaflex Millennium XL2, Panavision Primo Lenses","Panavision Panaflex Millennium, Panavision Primo Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA","Digital Factory (digital color timing)","Eclair Numérique (digital color grading)","Laboratoires Éclair, Paris, France"],"filmLength":["2,584 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision2 500T 5218)","Video (HDTV)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (1080p/24) (source format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision Premier 2393)","D-Cinema"]},"rating":"7.8","metascore":"50","filmingLocations":[{"location":"Avenue des Champs-Élysées, Paris 8, Paris, France"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best International Film","names":[]}]}]},{"award":"BMI Film & TV Awards 2009","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Nathaniel Méchaly","id":"nm1166319","role":null}]}]}]},{"award":"Golden Schmoes Awards 2009","titlesAwards":[{"titleAwardOutcome":"Won Golden Schmoes","categories":[{"category":"Best Line of the Year","names":[]}]},{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Biggest Surprise of the Year","names":[]}]}]}],"votes":"500,363","type":"Movie","companyCreditsSimple":[{"idCompany":"co0048273","name":"EuropaCorp"},{"idCompany":"co0069340","name":"M6 Films"},{"idCompany":"co0240248","name":"Grive Productions"}],"keywords":{"keywords":["cia","france","rescue","cellphone call","woman in jeopardy","teenage abduction","stabbing","sex trafficking","revenge","agent","one man army","albanian","prostitution","stepfather","die hard scenario","protective father","sexual violence","sex slave","dark hero","albanian mafia","secret agent","forced prostitution","unsubtitled foreign language","teenage daughter","karaoke machine","electric torture","violence","teenage girl","slaughter","ex cia agent","human trafficking","sex trade","father daughter relationship","abduction","kidnapping","female exploitation","misogynist","woman trafficking","one against many","neo noir","beer","reflection","bed","taxi","cult film","first part","protective male","mini dress","voyeur","sexual assault","white slavery","lasciviousness","bound and gagged","girl in panties","white panties","blonde","bikini","lingerie","scantily clad female","cleavage","killed in an elevator","panties","tied to a chair","horse","thong","woman crying","arc de triomphe paris","blood splatter","car crashes into building","hit with a fire extinguisher","wrapping a present","syringe","sony","shot multiple times","horse riding","milkshake","product placement","private jet","poker","orchid","lunch date","loud music","listening device","kiss on the cheek","intravenous","id badge","hot wiring a car","home movie","government corruption","eiffel tower paris","driving through fire","construction site","city night scape","chinese carryout food","cherry","birthday song","birthday present","binoculars","barbecue","audi","vigilantism","shooting","politics","paris france","obscene finger gesture","neck breaking","jacket","international politics","gun","french secret service","flashback","fight","fearlessness","disappearance","determination","degradation","death","chase","cell phone","brothel","blood","tortured to death","female in bra and panties","righteous rage","virginity","trapped in an elevator","translation","tied to a bedpost","thrown off a balcony","tattoo","tape recorder","surveillance","strangulation","stealing a car","stabbed in the leg","stabbed in the chest","stabbed in the arm","spit in the face","shot to death","shot through a window","shot in the stomach","shot in the shoulder","shot in the leg","shot in the forehead","shot in the chest","shot in the back","shot in the arm","shootout","screaming","punched in the face","prostitute","pop star","pistol whip","overturning car","needle","murder","knife","kicked in the face","kicked in the crotch","kicking in a door","karaoke","jumping off a bridge","jumping through a window","impersonating a police officer","immigrant","hit in the throat","hit by a truck","hiding under a bed","held at gunpoint","handcuffed to a pipe","foot chase","falling from height","extortion","explosion","ex husband ex wife relationship","elevator","electrocution","drug addiction","dragging a dead body","slamming a door","divorced couple","deception","cut arm","corruption","corpse","concert","climbing through a window","chase on a boat","champagne","car crash","car chase","camera phone","broken mirror","boat","birthday party","auction","attempted murder","torture","bodyguard","voyeurism","sexploitation","firearm pointed at the camera","shot at the camera","tough guy","martial arts","one word title","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:57:41"}}