{"data":{"movies":[{"title":"Death Proof","originalTitle":"","year":"2007","releaseDate":"20070606","directors":[{"name":"Quentin Tarantino","id":"nm0000233"}],"writers":[{"name":"Quentin Tarantino","id":"nm0000233"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdmZmY3Y2QtNjU5NC00OGUxLTg3MWQtMmE2ODM5Mzg3MzcyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller"],"plot":"In Austin, Texas, the girlfriends Julia, Arlene and Shanna meet in a bar to drink, smoke and make out with their boyfriends before traveling alone to Lake LBJ to spend the weekend together. They meet the former Hollywood stuntman Mike, who takes Pam out in his \"death-proof\" stunt car. Fourteen months later, Mike turns up in Lebanon, Tennessee and chase Abernathy, Zoë and Kim, but these girls are tough and decide to pay-back the attack.","simplePlot":"Two separate sets of voluptuous women are stalked at different times by a scarred stuntman who uses his \"death proof\" cars to execute his murderous plans.","actors":[{"actorName":"Kurt Russell","urlProfile":"http://www.imdb.com/name/nm0000621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjkxNzQwMV5BMl5BanBnXkFtZTYwNDk4ODM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1951","placeOfBirth":" Springfield, Massachusetts, USA","birthName":"Kurt Vogel Russell","height":"5' 11\" (1.8 m)","bio":"Kurt Russell was born Kurt Vogel Russell in Springfield, Massachusetts, to Louise Julia (Crone), a dancer, and actor Bing Russell (Neil Oliver Russell). He is of English, German, Scottish, and Irish descent. His first roles were as a child in television series, including a lead role in the Western series The Travels of Jaimie McPheeters (1963). Russell landed a part in the Elvis Presley movie, It Happened at the World's Fair (1963), when he was ten years old. Walt Disney himself signed Russell to a 10-year contract, and, according to Robert Osborne, he became the studio's top star of the 1970s. Having voiced adult Copper in the animated Disney film The Fox and the Hound (1981), Russell is one of the few famous child stars in Hollywood who has been able to continue his acting career past his teen years. Kurt spent the early 1970s playing minor league baseball. In 1979, he gave a classic performance as Elvis Presley in John Carpenter's ABC TV movie Elvis (1979), and married the actress who played Priscilla Presley in the film, Season Hubley. He was nominated for an Emmy Award for the role. He followed with roles in a string of well-received films, including Used Cars (1980) and Silkwood (1983), for which he was nominated for the Golden Globe Award for Best Supporting Actor - Motion Picture. During the 1980s, he starred in several films by director Carpenter; they created some of his best-known roles, including anti-hero army-turned-robber Snake Plissken in the futuristic action film Escape from New York (1981) (and later in its 1996 sequel Escape from L.A. (1996)), Antarctic helicopter pilot R.J. MacReady in the horror film The Thing (1982), and Jack Burton in the fantasy film Big Trouble in Little China (1986), all of which have since become cult classics. The Thing was based on the short story Who Goes There? by John W. Campbell, Jr., which had been interpreted on film before, albeit loosely, in 1951's The Thing from Another World (1951). In Big Trouble in Little China, Russell played a truck driver caught in an ancient Chinese war. In 1983, he became reacquainted with Goldie Hawn (who appeared with him in The One and Only, Genuine, Original Family Band (1968)) when they worked together on Swing Shift (1984). The two have lived together ever since. They made another film together, Garry Marshall's comedy Overboard (1987). His other 1980s titles include The Best of Times (1986), Winter People (1989), and the hit Tango & Cash (1989). In 1991, he headlined the firefighter drama Backdraft (1991), in 1993, he starred as Wyatt Earp in the western film Tombstone (1993), and in 1994, had a starring role in the military science fiction film Stargate - La porte des étoiles (1994). In the mid-2000s, his portrayal of U.S. Olympic hockey coach Herb Brooks in Miracle (2004) won the praise of critics. In 2006, he appeared in the disaster-thriller Poseidon (2006), and in 2007, in Quentin Tarantino's Death Proof (2007) segment from the film Grindhouse (2007). Russell appeared in The Battered Bastards of Baseball (2014), a documentary about his father and the Portland Mavericks, which debuted at the Sundance Film Festival in 2014. He co-starred in the action thriller Furious 7 (2015). In 2015, Russell starred in the western films Bone Tomahawk (2015) and The Hateful Eight (2015), and in 2016, he had a leading role in the dramatization Deepwater (2016). Russell and Goldie Hawn live on a 72-acre retreat, Home Run Ranch, outside of Aspen. He has two sons, Boston Russell (from his marriage to Hubley) and Wyatt Russell (with Hawn). He also raised Hawn's children, actors Oliver Hudson and Kate Hudson, who just call him dad.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjkxNzQwMV5BMl5BanBnXkFtZTYwNDk4ODM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000621","name":"Kurt Russell","idIMDB":"nm0000621"},"actorId":"nm0000621","character":"Stuntman Mike","urlCharacter":"http://www.imdb.com/character/ch0026722","main":true},{"actorName":"Zoë Bell","urlProfile":"http://www.imdb.com/name/nm1057928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzk4MjQ4MF5BMl5BanBnXkFtZTcwMTQwOTMzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1978","placeOfBirth":" Waiheke Island, Auckland, New Zealand","height":"5' 8\" (1.73 m)","bio":"As an established and extremely talented stunt double and actress, Zoe Bell has made a name for herself through her unparalleled dedication, skills, and focus. Zoe Bell was born on Waiheke Island, New Zealand, to Tish, a nurse, and Andrew Bell, a doctor. She has a background in gymnastics and martial arts. She began working as a stunt woman when she doubled Lucy Lawless on the cult favorite TV series Xena: Warrior Princess (1995). Bell also appeared as a double in the ABC thriller Alias (2001) and on an episode of Cleopatra 2525 in 2000 as a double for Vicki Pratti. In the action packed-documentary Double Dare (2004), Bell, along with legendary stunt-woman Jeannie Epper, give an insight into the career of women who take falls and punches for a living. Double Dare also gives a glimpse into the struggles of stunt-women to stay thin, employed, and sane in a male-dominated career. After the cancellation of Alias, Bell's next gig was working with Quentin Tarantino in Kill Bill: Vol. 1 (2003) and Kill Bill: Vol. 2 (2004), playing the stunt double for Uma Thurman's role, The Bride. Bell was nominated for her work in Kill Bill, Vol. 1 in the categories of Best Stunt by a Stunt Woman and Best Fight for the Taurus World Stunt Awards, both of which she would win the following year for Kill Bill: Vol. 2. Bell also showed off her stunt-woman skills as a double for Sharon Stone in Halle Barry's Catwoman (2004). Bell was injured in the final days of filming, requiring surgery, but she has since recovered and returned to work. Bell appeared along with legendary stunt woman Jeannie Epper in Amanda Micheli's acclaimed documentary Double Dare (2004), which offers a glimpse at the lives and careers of both women, as well as the friendship they share. Bell debuted her acting career, with her already famous stunt skills, in the double feature Grindhouse (2007) written by Quentin Tarantino and Robert Rodriguez. She was hand-picked, by Tarentino himself, to star in his segment of the double feature, Death Proof, about four women working on the movie set of their next big hit. All seems to be going well on set until a psychotic killer begins to stalk them. Bell, a native of New Zealand, resides in Los Angeles but hopes to someday own a home in New Zealand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzk4MjQ4MF5BMl5BanBnXkFtZTcwMTQwOTMzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1057928","name":"Zoë Bell","nicknames":["Zoe the Cat"],"idIMDB":"nm1057928"},"actorId":"nm1057928","character":"Zoë Bell","urlCharacter":"http://www.imdb.com/character/ch0515217","main":true},{"actorName":"Rosario Dawson","urlProfile":"http://www.imdb.com/name/nm0206257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1979","placeOfBirth":" New York City, New York, USA","birthName":"Rosario Isabel Dawson","height":"5' 7\" (1.7 m)","bio":"This stunning and resourceful actress has been primarily a film player thus far. Only recently has she been opening herself up more to doing television (the series Gemini Division (2008), which she executive-produced), and animated voice-overs. Dawson's powerhouse talent stands out the most in edgy, urban filming that dates back to 1995 when she was only sixteen. A rags-to-riches article entitled \"Rosario Dawson: From Tenement to Tinseltown\" probably says it all. Rosario was born in New York City on May 9, 1979. Her mother, Isabel Celeste, of Puerto Rican and Afro-Cuban descent, is a singer, and her stepfather, who raised her, Greg Dawson, of Irish descent, is a construction laborer. Her parents, who married when both were teenagers, eventually divorced. Rosario and her younger brother, Clay Dawson, had it hard while growing up and was cared for by family members, most of whom were poverty-stricken and some of whom were HIV-positive. Her career actually started as a child when she made a minor showing on the children's show, Sesame Street (1969). As the story goes, she was \"discovered\" as an adolescent on her front porch step by two photographers. One of them, Harmony Korine, was an aspiring screenwriter who thought the inexperienced sixteen-year-old was ideal for the controversial cult film Kids (1995), in which she would portray a sexually active adolescent. It took time for Rosario's film career to kick in after that, but by the late 1990s, she had nabbed several independent films. Since then, she has moved into main-stream hits (and misses) and has surprised viewers with her earthy, provocative, uninhibited approach to her roles. Reflecting New York's tougher, tawdrier side as assorted streetwalkers, homeless mothers, drug addicts, etc., her film highlights have included Light It Up (1999), Edward Burns' Sidewalks of New York (2001), Spike Lee's 25th Hour (2002) and Shattered Glass (2003). For Oliver Stone, she portrayed the duped bride of Colin Farrell's famed B.C. Macedonian warrior, Alexander (2004) (as in \"...the Great\"), which featured a notoriously violent-tinged nude/sex scene. Expanding her horizons beyond film, she has always expressed interest in singing. She hooked up with Prince for the re-release of his 1980s hit \"1999\" and appeared in The Chemical Brothers' video for the song \"Out of Control\" from the album \"Surrender\". She is also featured on the Outkast track, \"She Lives in My Lap\". On stage, she co-starred as Julia in a revival of \"Two Gentlemen of Verona\" at the Public Theater's \"Shakespeare in the Park\" and appeared in \"The Vagina Monologues\". She lucked into and got to show off her singing chops in the film adaptation of the hit New York musical Rent (2005), when Daphne Rubin-Vega, the original Mimi, became pregnant and was unable to reprise her exotic dancer role. Rosario also appeared as a prostitute in the adaptation of the graphic novel Sin City (2005). Of late, she has turned to producing. One of those, Descent (2007), had her playing a college coed who is brutally attacked and raped by a fellow student. Her more popular ventures have thus far included the role of Valerie Brown in the live-action version of the comic strip Josie et les Pussycats (2001), the Will Smith starrer Men in Black II (2002), Eagle Eye (2008) with Shia LaBeouf and Seven Pounds (2008), again with Smith, in which she offered one of her more tender-hearted performances as a woman with a potentially fatal heart condition. Off-camera, the still-single Dawson is highly active in political, social and environmental causes and has been involved with such organizations/charities/campaigns as the Lower East Side Girls Club, Global Cool, the O.N.E. Campaign, Oxfam, Amnesty International, Parents, Families and Friends of Lesbians and Gays, Control Arms, International Rescue Committee, Voto Latino (which she founded), Conservation International, Doctors Without Borders, National Geographic Society, The Nature Conservancy and Save the Children. In October 2008, she lent her voice to the RESPECT! Campaign, a movement aimed at preventing domestic violence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206257","name":"Rosario Dawson","idIMDB":"nm0206257"},"actorId":"nm0206257","character":"Abernathy","urlCharacter":"http://www.imdb.com/character/ch0031198","main":true},{"actorName":"Vanessa Ferlito","urlProfile":"http://www.imdb.com/name/nm1089685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkwMDIzMjcwMl5BMl5BanBnXkFtZTgwMTk3Mzk1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1977","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"Vanessa Ferlito was born on December 28, 1977 in Brooklyn, New York City, New York, USA. She is an actress, known for Death Proof (2007), Spider-Man 2 (2004) and Grindhouse (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkwMDIzMjcwMl5BMl5BanBnXkFtZTgwMTk3Mzk1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1089685","name":"Vanessa Ferlito","idIMDB":"nm1089685"},"actorId":"nm1089685","character":"Arlene","urlCharacter":"http://www.imdb.com/character/ch0031201","main":true},{"actorName":"Sydney Tamiia Poitier","urlProfile":"http://www.imdb.com/name/nm0688624","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjE0NTgyNV5BMl5BanBnXkFtZTcwMTI0Njg1NA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1973","placeOfBirth":" Los Angeles, California, USA","height":"5' 9½\" (1.77 m)","bio":"Sydney Tamiia Poitier was born on November 15, 1973 in Los Angeles, California, USA. She is an actress and producer, known for Death Proof (2007), Grindhouse (2007) and True Crime (1999). She has been married to Dorian Heartsong since June 2012. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjE0NTgyNV5BMl5BanBnXkFtZTcwMTI0Njg1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0688624","name":"Sydney Tamiia Poitier","idIMDB":"nm0688624"},"actorId":"nm0688624","character":"Jungle Julia","urlCharacter":"http://www.imdb.com/character/ch0033384","main":true},{"actorName":"Tracie Thoms","urlProfile":"http://www.imdb.com/name/nm1139632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTk5Nzc2OF5BMl5BanBnXkFtZTcwMjEyODUzNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1975","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Tracie Nicole Thoms","height":"5' 5\" (1.65 m)","bio":"Tracie Thoms was born on August 19, 1975 in Baltimore, Maryland, USA as Tracie Nicole Thoms. She is an actress and producer, known for The Devil Wears Prada (2006), Looper (2012) and Death Proof (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTk5Nzc2OF5BMl5BanBnXkFtZTcwMjEyODUzNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1139632","name":"Tracie Thoms","idIMDB":"nm1139632"},"actorId":"nm1139632","character":"Kim","urlCharacter":"http://www.imdb.com/character/ch0035704","main":true},{"actorName":"Rose McGowan","urlProfile":"http://www.imdb.com/name/nm0000535","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTQzODM3OF5BMl5BanBnXkFtZTgwMzc0NjM0ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1973","placeOfBirth":" Florence, Tuscany, Italy","birthName":"Rose Arianna McGowan","height":"5' 4\" (1.63 m)","bio":"Rose McGowan is an American actress and director, known for her contribution to independent film. Since the age of nineteen, she has appeared in acclaimed films by Gregg Araki, Wes Craven, Brian De Palma, Robert Rodriguez and Quentin Tarantino. In 2014, her directorial debut Dawn (2014) was nominated for the Short Film Grand Jury Prize at the Sundance Film Festival. Rose Arianna McGowan was born on September 5, 1973 in Florence, Tuscany, Italy, to American parents Terri and Daniel Patrick McGowan. She is the second eldest of six siblings, and has Irish, French, and English ancestry. As a young child, she was raised within the Italian chapter of the Children of God. During the early 1980s, her family severed ties with the community and migrated to Eugene, Oregon, USA. Following the divorce of her parents, Rose relocated to Gig Harbor, Washington, to live with her grandmother. At age 14, McGowan was accused of drug use by a family friend and committed to rehabilitation. She has consistently maintained the decision was unjustified. Upon release, she spent a year without a home and was emancipated from her parents by the age of 15. McGowan's career as an actor began with The Doom Generation (1995). Originally intended for Jordan Ladd, the character of Amy Blue was, coincidentally, awarded to McGowan by an associate of director Gregg Araki. For her performance, she was nominated at the 1995 Independent Spirit Awards for Best Debut Performance. Subsequently cast in Wes Craven's Scream (1996), she experienced further success when the project defied expectations to become one of the highest grossing films of the year. The innovative career of McGowan was overshadowed throughout much of the 1990s by her high-profile relationship with musician Brian Warner (aka Marilyn Manson). Strong performances in Going All the Way (1997), Lewis & Clark & George (1997), Southie (1998) and Jawbreaker (1999) were largely unseen by the general public. When the relationship ended between Rose and Manson in 2001, she remarked: \"There is great love, but our lifestyle difference is, unfortunately, even greater\". Rose continued to work solidly, appearing in a string of soft-sounding studio and independent films. Performances from this period included: a political activist in Showtime's The Killing Yard (2001), a grifter in Strange Hearts (2002) and a factory worker in \"Stealing Bess\" (aka Vacuums (2003)). She was re-introduced to the mainstream as Paige Matthews in Aaron Spelling's Charmed (1998), a popular television series for which she devoted five consecutive years. When \"Charmed\" finished its run in 2006, McGowan emerged in top form. Critics praised her efforts in Robert Rodriguez's Planet Terror (2007), and Quentin Tarantino's Death Proof (2007). In several interviews, McGowan has expressed a general apathy and disdain for Hollywood. Despite this, her work ethic remains strong. Following her recent marriage to LA-based artist Davey Detail, the actress has resolved to purse further projects as a director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTQzODM3OF5BMl5BanBnXkFtZTgwMzc0NjM0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000535","name":"Rose McGowan","idIMDB":"nm0000535"},"actorId":"nm0000535","character":"Pam","urlCharacter":"http://www.imdb.com/character/ch0037843","main":true},{"actorName":"Jordan Ladd","urlProfile":"http://www.imdb.com/name/nm0480465","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMjg2MDI0OF5BMl5BanBnXkFtZTYwNDg4MTY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1975","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Jordan Elizabeth Ladd","height":"5' (1.52 m)","bio":"Jordan Ladd was born on January 14, 1975 in Hollywood, Los Angeles, California, USA as Jordan Elizabeth Ladd. She is an actress, known for Cabin Fever (2002), Death Proof (2007) and Grindhouse (2007). She was previously married to Conor O'Neill.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMjg2MDI0OF5BMl5BanBnXkFtZTYwNDg4MTY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0480465","name":"Jordan Ladd","idIMDB":"nm0480465"},"actorId":"nm0480465","character":"Shanna","urlCharacter":"http://www.imdb.com/character/ch0037844","main":true},{"actorName":"Mary Elizabeth Winstead","urlProfile":"http://www.imdb.com/name/nm0935541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MTU2NjU0OF5BMl5BanBnXkFtZTgwNjgwNzgwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1984","placeOfBirth":" Rocky Mount, North Carolina, USA","height":"5' 8\" (1.73 m)","bio":"Mary Elizabeth Winstead is a gifted actress, known for her versatile work in a variety of film and television projects. Possibly most known for her role as Ramona Flowers in Scott Pilgrim vs. the World (2010), she has also starred in critically acclaimed independent films such as Smashed (2012), for which she received an Independent Spirit Award nomination, as well as genre fare like Destination finale 3 (2006) and Quentin Tarantino's Death Proof (2007). Winstead was born in Rocky Mount, North Carolina but largely raised in Sandy, Utah which is where she discovered a love for the performing arts. She grew up training to be a ballerina and attended the Joffrey Ballet School training program at the age of 12. It was also around this time that she began to pursue a career in acting and soon started working steadily in television and film. Winstead is also a recording artist and performs under the name \"Got a Girl\" alongside producer Dan the Automotor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MTU2NjU0OF5BMl5BanBnXkFtZTgwNjgwNzgwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935541","name":"Mary Elizabeth Winstead","nicknames":["MEW","Mary"],"idIMDB":"nm0935541"},"actorId":"nm0935541","character":"Lee","urlCharacter":"http://www.imdb.com/character/ch0031025","main":true},{"actorName":"Quentin Tarantino","urlProfile":"http://www.imdb.com/name/nm0000233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjI3ODA3Nl5BMl5BanBnXkFtZTcwNzY2MDYxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1963","placeOfBirth":" Knoxville, Tennessee, USA","birthName":"Quentin Jerome Tarantino","height":"6' 1\" (1.85 m)","bio":"Quentin Jerome Tarantino was born in Knoxville, Tennessee. His father, Tony Tarantino, is an Italian-American actor and musician from New York, and his mother, Connie (McHugh), is a nurse from Tennessee. Quentin moved with his mother to Torrance, California, when he was four years old. In January of 1992, first-time writer-director Tarantino's Reservoir Dogs (1992) appeared at the Sundance Film Festival. The film garnered critical acclaim and the director became a legend immediately. Two years later, he followed up Dogs success with Pulp Fiction (1994) which premiered at the Cannes film festival, winning the coveted Palme D'Or Award. At the 1995 Academy Awards, it was nominated for the best picture, best director and best original screenplay. Tarantino and writing partner Roger Avary came away with the award only for best original screenplay. In 1995, Tarantino directed one fourth of the anthology Four Rooms (1995) with friends and fellow auteurs Alexandre Rockwell, Robert Rodriguez and Allison Anders. The film opened December 25 in the United States to very weak reviews. Tarantino's next film was From Dusk Till Dawn (1996), a vampire/crime story which he wrote and co-starred with George Clooney. The film did fairly well theatrically. Since then, Tarantino has helmed several critically and financially successful films, including Jackie Brown (1997), Kill Bill: Vol. 1 (2003), Kill Bill: Vol. 2 (2004), Inglourious Basterds (2009), Django Unchained (2012) and The Hateful Eight (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjI3ODA3Nl5BMl5BanBnXkFtZTcwNzY2MDYxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000233","name":"Quentin Tarantino","nicknames":["QT","Q"],"idIMDB":"nm0000233"},"actorId":"nm0000233","character":"Warren","urlCharacter":"http://www.imdb.com/character/ch0028905","main":true},{"actorName":"Marcy Harriell","urlProfile":"http://www.imdb.com/name/nm1292612","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4MzMxNDYwMF5BMl5BanBnXkFtZTcwOTk2MzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Marcy Harriell is an actress, known for Death Proof (2007), Grindhouse (2007) and Queens Supreme (2003). She has been married to Robert Harriell since November 4, 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4MzMxNDYwMF5BMl5BanBnXkFtZTcwOTk2MzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1292612","name":"Marcy Harriell","idIMDB":"nm1292612"},"actorId":"nm1292612","character":"Marcy","urlCharacter":"http://www.imdb.com/character/ch0038023","main":true},{"actorName":"Eli Roth","urlProfile":"http://www.imdb.com/name/nm0744834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDExMzM3NF5BMl5BanBnXkFtZTcwMzA0MTMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1972","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Eli Raphael Roth","height":"6' (1.83 m)","bio":"Eli Raphael Roth was born in Newton, Massachusetts, to Cora (Bialis), a painter, and Sheldon H. Roth, a psychoanalyst, psychiatrist, and clinical professor. His family is Jewish (from Austria, Hungary, Russia, and Poland). He began shooting Super 8 films at the age of eight, after watching Ridley Scott's Alien (1979) and vomiting, and deciding he wanted to be a producer/director. With his brothers and friends, ketchup for blood and his father's power tools, he made over fifty short films before attending film school at N.Y.U., where he won a student Academy Award and graduated Summa Cum Laude in 1994. Eli worked in film and theater production in New York City for many years, doing every job from production assistant to assistant editor to assistant to the director. At the age of 20 Roth was development head for producer Fred Zollo, a position he soon left to write full time. To earn a living, Roth did budgets and schedules for the films A Price Above Rubies (1998) and Illuminata (1998) and often worked as a stand-in, where he could watch directors work with the actors. In 1995, Roth co-wrote the script that would eventually become Cabin Fever (2002) with friend Randy Pearlstein, and the two spent many years unsuccessfully trying to get the film financed. Roth left New York in 1999 to live in Los Angeles, and within four months got funding for his animation series Chowdaheads (1999). Roth and friend Noah Belson (Cabin Fever (2002)'s Guitar Man) wrote and voiced the episodes, which Roth produced, directed and designed. The episodes were due to run on W.C.W.'s #1 rated series WCW Monday Nitro (1995) but the C.E.O. was fired a day before they were scheduled to air, and the episodes never ran. Roth used the episodes to set up a stop motion series called The Rotten Fruit (2003) which he produced, directed and animated, as well as co-wrote and voiced with friend Belson. Between the two animated series, Roth worked closely with director David Lynch, producing content for the website davidlynch.com. In 2001, Roth filmed Cabin Fever (2002) on a shoestring budget of $1.5 million, with private equity he and his producers raised from friends and family. The film was the subject of a bidding war at the 2002 Toronto Film Festival, eventually won by Lion's Gate, instantly doubling their investors' money. It went on to not only be the highest grossing film for Lion's Gate in 2003, but the most profitable horror film released that year, garnering critical acclaim from The New York Times, Rolling Stone, Empire Magazine, and such filmmakers as Peter Jackson, Quentin Tarantino and Tobe Hooper. Roth used the film's success to launch a slew of projects, including The Box (2009), a horror thriller he co-wrote with Richard Kelly. In May of 2003, Roth joined forces with filmmakers Boaz Yakin, Scott Spiegel, and Greenestreet Films in New York to form Raw Nerve, LLC, a horror film production company. In 2014, Eli married Chilean model and actress Lorenza Izzo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDExMzM3NF5BMl5BanBnXkFtZTcwMzA0MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0744834","name":"Eli Roth","nicknames":["Gorilka"],"idIMDB":"nm0744834"},"actorId":"nm0744834","character":"Dov","urlCharacter":"http://www.imdb.com/character/ch0038024","main":true},{"actorName":"Omar Doom","urlProfile":"http://www.imdb.com/name/nm2374829","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY5Mjg3ODYtMGFiMS00YWM0LWE5YTAtY2UzZWQ1MThhZDc3XkEyXkFqcGdeQXVyMzgyODA2MTU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1976","placeOfBirth":" Easton, Pennsylvania, USA","birthName":"Omar Makhdoomi","bio":"Omar Doom was born on June 29, 1976 in Easton, Pennsylvania, USA as Omar Makhdoomi. He is an actor, known for Inglourious Basterds (2009), Death Proof (2007) and Grindhouse (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY5Mjg3ODYtMGFiMS00YWM0LWE5YTAtY2UzZWQ1MThhZDc3XkEyXkFqcGdeQXVyMzgyODA2MTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2374829","name":"Omar Doom","idIMDB":"nm2374829"},"actorId":"nm2374829","character":"Nate","urlCharacter":"http://www.imdb.com/character/ch0038025","main":true},{"actorName":"Michael Bacall","urlProfile":"http://www.imdb.com/name/nm0045209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2ODg5OTE4MF5BMl5BanBnXkFtZTcwMTM0Mjk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1973","placeOfBirth":" Los Angeles, California, USA","birthName":"Michael Stephen Buccellato","height":"5' 5\" (1.65 m)","bio":"Michael Bacall was born on April 19, 1973 in Los Angeles, California, USA as Michael Stephen Buccellato. He is an actor and writer, known for 21 Jump Street (2012), 22 Jump Street (2014) and Project X (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2ODg5OTE4MF5BMl5BanBnXkFtZTcwMTM0Mjk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045209","name":"Michael Bacall","idIMDB":"nm0045209"},"actorId":"nm0045209","character":"Omar","urlCharacter":"http://www.imdb.com/character/ch0038026","main":true},{"actorName":"Monica Staggs","urlProfile":"http://www.imdb.com/name/nm0821400","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODA3NjE0NV5BMl5BanBnXkFtZTcwODQxODkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1970","placeOfBirth":" Boulder, Colorado, USA","birthName":"Monica Anne Staggs","height":"5' 9\" (1.75 m)","bio":"Monica Staggs was born on February 24, 1970 in Boulder, Colorado, USA as Monica Anne Staggs. She is known for her work on Star Trek: Voyager (1995), Kill Bill: Vol. 2 (2004) and Collision (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODA3NjE0NV5BMl5BanBnXkFtZTcwODQxODkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0821400","name":"Monica Staggs","idIMDB":"nm0821400"},"actorId":"nm0821400","character":"Lanna Frank","urlCharacter":"http://www.imdb.com/character/ch0037845","main":true}],"seasons":[],"idIMDB":"tt1028528","urlIMDB":"http://www.imdb.com/title/tt1028528","business":{"budget":null,"openingWeekend":[{"money":"£407,525","country":"UK","day":"23","month":"09","year":"2007","remarks":"286 Screens"},{"money":"$11,420","country":"Estonia","day":"17","month":"06","year":"2007","remarks":"2 Screens"},{"money":"€71,727","country":"Netherlands","day":"10","month":"06","year":"2007","remarks":"30 Screens"}],"gross":[{"money":"£707,262","country":"UK","day":"30","month":"09","year":"2007","remarks":""},{"money":"£407,525","country":"UK","day":"23","month":"09","year":"2007","remarks":""},{"money":"€71,727","country":"Netherlands","day":"10","month":"06","year":"2007","remarks":""}],"weekendGross":[{"money":"£79,277","country":"UK","day":"30","month":"09","year":"2007","remarks":"172 Screens"},{"money":"£407,525","country":"UK","day":"23","month":"09","year":"2007","remarks":"286 Screens"},{"money":"€71,727","country":"Netherlands","day":"10","month":"06","year":"2007","remarks":"30 Screens"}],"admissions":[{"money":"490,193","country":"Germany","day":"19","month":"08","year":"2007","remarks":""},{"money":"448,557","country":"Germany","day":"12","month":"08","year":"2007","remarks":""},{"money":"377,341","country":"Germany","day":"05","month":"08","year":"2007","remarks":""},{"money":"281,737","country":"Germany","day":"29","month":"07","year":"2007","remarks":""},{"money":"130,036","country":"Germany","day":"22","month":"07","year":"2007","remarks":""},{"money":"56,656","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Copyright © 2007 The Weinstein Company, LLC. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 53 min (113 min) (Japan)","1 hr 54 min (114 min) (international)","1 hr 27 min (87 min) (Grindhouse) (USA)","2 hr 1 min (121 min) (extended)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color","Black and White"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 435 ES, Panavision Primo Lenses","Panavision Panaflex Millennium XL2, Panavision Primo Lenses","Panavision Panaflex Millennium, Panavision Primo Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,100 m (Portugal, 35 mm)","3,102 m (Sweden)"],"negativeFormat":["35 mm (Fuji Eterna 500T 8573)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (Fuji)"]},"rating":"7.1","filmingLocations":[{"location":"Texas Chili Parlor, 1409 Lavaca St, Austin, Texas, USA"}],"rated":"NOT RATED","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD Special Edition Release","names":[]}]}]},{"award":"Cannes Film Festival 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Quentin Tarantino","id":"nm0000233","role":null}]}]}]},{"award":"Empire Awards, UK 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Horror","names":[]}]}]},{"award":"IGN Summer Movie Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Movie Blu-Ray","names":[{"name":"Reservoir Dogs","id":"tt0105236","role":null},{"name":"True Romance","id":"tt0108399","role":null},{"name":"Pulp Fiction","id":"tt0110912","role":null},{"name":"Jackie Brown","id":"tt0119396","role":null},{"name":"Kill Bill: Vol. 1","id":"tt0266697","role":null},{"name":"Kill Bill: Vol. 2","id":"tt0378194","role":null},{"name":"Inglourious Basterds","id":"tt0361748","role":null}]}]}]},{"award":"Italian Online Movie Awards (IOMA) 2008","titlesAwards":[{"titleAwardOutcome":"Nominated IOMA","categories":[{"category":"Best Editing (Miglior montaggio)","names":[{"name":"Sally Menke","id":"nm0579673","role":null}]}]}]},{"award":"Key Art Awards 2013","titlesAwards":[{"titleAwardOutcome":"3rd place Key Art Award","categories":[{"category":"Best Trailer - Audio/Visual","names":[{"name":"Miramax","id":null,"role":null},{"name":"Weinstein Company, The","id":null,"role":null},{"name":"Warner Bros.","id":null,"role":null},{"name":"Lionsgate","id":null,"role":null},{"name":"Universal Pictures","id":null,"role":null},{"name":"Giaranamo Productions","id":null,"role":null},{"name":"Reservoir Dogs","id":"tt0105236","role":null},{"name":"Pulp Fiction","id":"tt0110912","role":null},{"name":"True Romance","id":"tt0108399","role":null},{"name":"Jackie Brown","id":"tt0119396","role":null},{"name":"Kill Bill: Vol. 1","id":"tt0266697","role":null},{"name":"Kill Bill: Vol. 2","id":"tt0378194","role":null},{"name":"Inglourious Basterds","id":"tt0361748","role":null}]}]}]}],"votes":"218,730","type":"Movie","companyCreditsSimple":[{"idCompany":"co0019626","name":"Dimension Films"},{"idCompany":"co0035848","name":"Troublemaker Studios"},{"idCompany":"co0200397","name":"Rodriguez International Pictures"}],"keywords":{"keywords":["slasher","stuntman","woman fights man","serial killer","lap dance","drinking","car chase","car accident","2000s","comic relief","black & white to color","reference to lindsay lohan","multiple perspectives","car movie","hot pants","carsploitation","talking while driving","dark humor","black comedy","reference to woody woodpecker","directed by co star","death in title","director cameo","black and white scene","foot fetish","grindhouse","title spoken by character","f rated","female friendship","friendship","sexism against men","severed limb","deliberate crash","same shot repeated from different angles","repeated scene","repeated scene from a different perspective","cleavage","cheerleader uniform","group of friends","evil man","villain","violence","gore","sadism","psychopathic killer","psycho killer","psycho","maniac","homicidal maniac","killer","killing spree","human monster","marijuana","tears","crying","cowardice","woman killer","misogynist","leg cut off","sadist","on hood of moving car","killer car","jukebox","stalker","shot in the arm","sex talk","revenge","psychopath","multiple homicide","dead woman","dangerous driving","crushed head","broken windshield","broken glass","beating","lesbian interest","lesbian innuendo","female victim","female bonding","car stunt","car obsession","text messaging","stuntwoman","severed leg","beaten to death","vehicular homicide","face ripped off","stuntman mike","scantily clad female","upskirt","white panties","panties","sexual violence","redneck","breaking the fourth wall","villain played by lead actor","intentional goof","wilhelm scream"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:58:05"}}