{"data":{"movies":[{"title":"Good Intentions","originalTitle":"","year":"2010","releaseDate":"20100309","directors":[{"name":"Jim Issa","id":"nm1122549"}],"writers":[{"name":"Michael Lucker","id":"nm0524710"},{"name":"Anthony Stephenson","id":"nm2721072"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwOTE3MDU0Nl5BMl5BanBnXkFtZTcwMDIzNjExMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Meet Etta Milford. Loving Wife. Doting Mother. Armed Robber. Etta's husband constantly blows their money on make-shift inventions. When she decides to secretly take \"investment\" matters into her own hands - things quickly go awry! With their savings gone, her husband suspicious, and their children out of control, Etta concocts a scheme to get back their money and save her family. There are just a few things she has to do first, including blackmailing the sheriff and holding up the grocery store. Starring Luke Perry, Elaine Hendrix and Grammy award-winner, LeAnn Rimes.","simplePlot":"Meet Etta Milford. Loving Wife. Doting Mother. Armed Robber. Etta's husband constantly blows their money on make-shift inventions. When she decides to secretly take \"investment\" matters ... ","actors":[{"actorName":"Luke Perry","urlProfile":"http://www.imdb.com/name/nm0000580","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzk4NDE5MjdeQTJeQWpwZ15BbWU3MDI3MDg2NTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1966","placeOfBirth":" Mansfield, Ohio, USA","birthName":"Coy Luther Perry III","height":"5' 10\" (1.78 m)","bio":"Luke Perry was born on October 11, 1966 in Mansfield, Ohio, USA as Coy Luther Perry III. He is an actor and producer, known for Beverly Hills, 90210 (1990), The Fifth Element (1997) and Jeremiah (2002). He was previously married to Rachel Sharp.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzk4NDE5MjdeQTJeQWpwZ15BbWU3MDI3MDg2NTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000580","name":"Luke Perry","idIMDB":"nm0000580"},"actorId":"nm0000580","character":"Chester Milford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elaine Hendrix","urlProfile":"http://www.imdb.com/name/nm0005006","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDc3NzgwMV5BMl5BanBnXkFtZTgwNzMxNzM2OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1970","placeOfBirth":" Oak Ridge, Tennessee, USA","birthName":"Katherine Elaine Hendrix","height":"5' 8\" (1.73 m)","bio":"Born in Oak Ridge, Tennessee, Elaine Hendrix spent her early years in nearby Knoxville and Morristown. At 15 she moved with her divorced mother to Atlanta, Georgia, where she attended the Northside School of Performing Arts. She started her professional career as a dancer and model but gave up dance after she was hit by a car while bicycling. She officially moved to Los Angeles in 1992 and had an agent within a month. She worked her way from commercials to TV guest shots to a starring role on the 1995 Fox revival of Get Smart (1995) to features. A member of Women in Film, Women in Theatre and Women of Los Angeles, Hendrix has written a short film that she plans to direct at the end of 1999/beginning of 2000 (as soon as she can take a break from her acting schedule). She has two birds and two turtles and in September 1999 added a dog named Tiloc to her family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDc3NzgwMV5BMl5BanBnXkFtZTgwNzMxNzM2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005006","name":"Elaine Hendrix","idIMDB":"nm0005006"},"actorId":"nm0005006","character":"Etta Milford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Gries","urlProfile":"http://www.imdb.com/name/nm0340973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTkwNjg0NV5BMl5BanBnXkFtZTYwNzg2Njc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1957","placeOfBirth":" Glendale, California, USA","birthName":"Jonathan Francis Gries","height":"5' 11\" (1.8 m)","bio":"Jon Gries was born on June 17, 1957 in Glendale, California, USA as Jonathan Francis Gries. He is an actor, known for Taken (2008), Napoleon Dynamite (2004) and Men in Black (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTkwNjg0NV5BMl5BanBnXkFtZTYwNzg2Njc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340973","name":"Jon Gries","idIMDB":"nm0340973"},"actorId":"nm0340973","character":"Sherriff Ernie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"LeAnn Rimes","urlProfile":"http://www.imdb.com/name/nm0005361","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQyNDA1MTc4M15BMl5BanBnXkFtZTcwMzU3NDI5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1982","placeOfBirth":" Jackson, Mississippi, USA","birthName":"Margaret LeAnn Rimes","height":"5' 5\" (1.65 m)","bio":"LeAnn started singing at age 3, and has sold over 20 million records since. She was born August 28, 1982 in Jackson, Mississippi. By age 7, LeAnn made her stage debut in a Dallas musical production of \"A Christmas Carol\". Later, she would sing \"The Star Spangled Banner\" to open Dallas Cowboys football games. By age 11, LeAnn recorded her first album on an independent label only available in local stores in Dallas: \"All That\" which featured her signature song \"Blue\". This got the attention of Curb Records. In 1996, 14-year-old LeAnn recorded a major-label album. In 1997, LeAnn released \"You Light Up My Life: Inspirational Songs\" which debuted on 3 Billboard Magazine charts at the same time: Pop, Country, and Contemporary Christian (that had never been achieved before by a country singer). That year, LeAnn released \"How Do I Live\" which would set a record by staying #1 on Billboard Magazine's \"Hot 100\" chart for 69 weeks. LeAnn starred in the TV-movie Holiday in Your Heart (1997), based on a book which she had co-authored. Capping a great year for the 15-year-old LeAnn, she won an American Music Award, 2 Grammy awards, 3 Academy of Country Music Awards, and 4 Billboard Music Awards. In 1998, LeAnn won a Lone Star Film & Television Special Award for Rising Star Actress. In 1999, LeAnn released a namesake CD, offering her interpretations of 11 Country standards, including \"Crazy\" and \"I Fall to Pieces\" (originally recorded by Patsy Cline in 1960). LeAnn made a cameo in Coyote Ugly (2000) (the low budget movie that raked in big bucks) and she also recorded 4 Diane Warren songs, including \"Can't Fight the Moonlight\", for the movie soundtrack. An amazing career and, since she is only 18, I am sure there will have to be mini-bio updates in the future.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQyNDA1MTc4M15BMl5BanBnXkFtZTcwMzU3NDI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005361","name":"LeAnn Rimes","idIMDB":"nm0005361"},"actorId":"nm0005361","character":"Pam","urlCharacter":"http://www.imdb.com/character/ch0137999","main":true},{"actorName":"Jimmi Simpson","urlProfile":"http://www.imdb.com/name/nm0801051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwOTgzNjI1N15BMl5BanBnXkFtZTgwOTI0MTM2MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1975","placeOfBirth":" Hackettstown, New Jersey, USA","birthName":"James Raymond Simpson","height":"5' 11¼\" (1.81 m)","bio":"Jimmi Simpson is an American actor. He was born in Hackettstown, New Jersey, the youngest of three brothers. After graduating from Bloomsburg University with a Bachelor of Arts in theater, he acted for four seasons at the Williamstown Theatre Festival in Massachusetts. Simpson made his film debut in the teen comedy Loser (2000). He is best known for his television work, which includes roles in Netflix political drama series House of Cards (2013), and the HBO television series Westworld (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwOTgzNjI1N15BMl5BanBnXkFtZTgwOTI0MTM2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0801051","name":"Jimmi Simpson","nicknames":["Jim-ster"],"idIMDB":"nm0801051"},"actorId":"nm0801051","character":"Kyle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Grubbs","urlProfile":"http://www.imdb.com/name/nm0344196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1949","placeOfBirth":" Amory, Mississippi, USA","birthName":"Jon Gary Grubbs","height":"6' 4\" (1.93 m)","bio":"Gary and his wife Glenda, moved to Los Angeles in 1977 for Gary to pursue a writing career. He went on an open call as an actor, got the part, and now two hundred parts later Gary is still acting. Gary and Glenda now have a home in Mississippi and an apartment in Los Angeles and Gary works both the southern and L.A. markets. In the last few years Gary has devoted much of his time to writing and has successfully sold two pilot scripts to CBS, two screenplays and had his first full length equity play, \"As The Crow Flies,\" receive it's world premier. The production was both a creative and financial success and received many positive reviews. Currently he has a project in development at Warner Horizon. In 2008 Gary can be seen in \"In The Electric Mist\" with Tommie Lee Jones,\" \"Deal\" with Burt Reynolds, \"Good Intentions\" with Elaine Hendrix, \"Major Movie Star\" with Jessica Simpson, and \"My Mom's New Boyfriend\" with Meg Ryan and Antonio Banderas. Gary has worked as an actor for some of the most distinguished film directors of our time in a number of motion pictures, including \"JFK\" (Oliver Stone), \"Silkwood\" (Mike Nichols), \"Nadine\" (Robert Benton), \"Honkytonk Man\" (Clint Eastwood), and \"The Border\" (Tony Richardson). Other feature credits include \"X-Files The Movie,\" \"Doubletake,\" and \"Astronaut's Wife\". On television, Grubbs made a name for himself by portraying attorneys in two of the highest rated programs in television history, \"The Burning Bed\" and \"Fatal Vision\". He has also starred in numerous Movies-of-the-Week and Mini-series, including \"Canal Street Brothel,\" \"For One Night\" \"Foxfire,\" and many others. Gary's recent series and episodic work includes appearances on ER, Angel, NCIS, K-ville, Will & Grace and The O.C. Gary and Glenda have a daughter Molly who is employed at Team One Advertising in Los Angeles, and their son Logan is a grad student at The University of Southern Mississippi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0344196","name":"Gary Grubbs","idIMDB":"nm0344196"},"actorId":"nm0344196","character":"Zachary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Alan Williams","urlProfile":"http://www.imdb.com/name/nm0930707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDQ5ODE1NV5BMl5BanBnXkFtZTgwMzYwNDA5OTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1956","placeOfBirth":" Des Moines, Iowa, USA","bio":"Gregory Alan Williams was born on June 12, 1956 in Des Moines, Iowa, USA. He is an actor and writer, known for Baywatch (1989), Terminator Genisys (2015) and In the Line of Fire (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDQ5ODE1NV5BMl5BanBnXkFtZTgwMzYwNDA5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930707","name":"Gregory Alan Williams","idIMDB":"nm0930707"},"actorId":"nm0930707","character":"Buck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randy McDowell","urlProfile":"http://www.imdb.com/name/nm1816154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkzODQ4MTIxN15BMl5BanBnXkFtZTgwMjg3Njc5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1977","placeOfBirth":" Warsaw, Indiana, USA","height":"5' 11\" (1.8 m)","bio":"Randy McDowell was raised by his father, a Baptist minister and former police officer, after he lost his mother to cancer in 1980. His dad provided much of the attention he needed when he was young, fueling his desire to entertain. Despite his early enthusiasm for performance, McDowell explored other careers before he focused on his real passion. He attempted professional baseball, which he failed at miserably, and a brief study of law enforcement before he committed to acting full-time. Randy began his career in show-business as an actor and comedian. He made his mainstream film debut in Elvis, the Emmy nominated and Golden Globe award-winning miniseries, where he starred in the title-credit supporting role of Gene Smith. Elvis was the largest marketing campaign ever produced by CBS/Showtime and was seen by over 30million people. He also appeared as one of the lead roles in Sam Raimi's (Spiderman) Dance of the Dead (Lionsgate) which has gone on to win awards worldwide. He has made appearances in such television shows as \"The Tonight Show with Jay Leno\", \"Foxworthy's Big Night Out\" and most notably starred in the hero role of Phil in Fed Ex's $5million dollar Super bowl Commercial \"Moon Office\" which was seen by over 95 million people worldwide. In addition to performing stand up comedy and stage comedy, McDowell partnered with comedian Dale Williams for eight years and toured around the country as the comedy team of \"N2O\" performing all over the US, Europe and on television both nationally and internationally. Here they brought their unique brand of sketch comedy intertwined with short films giving their stage routines a complete multimedia showcase. In 2004 McDowell started The DiXiE FiLM FeSTiVaL in Atlanta, Georgia, where it has become a globally recognized premiere film festival that is held annually every October. The festival has welcomed Emmy Award winning directors, Oscar nominated films and been notably recognized for its \"Lifetime Achievement Award\" which has been honored to Screen Legends Brian Dennehy, James Best and Andy Griffith. In 2008 F.A. Entertainment went on to branch off with its successful festival and McDowell founded and executive directs the Prince Edward Island International Film Festival located in the Maritime Provinces of Eastern Canada in Charlottetown, Prince Edward Island. In 2004, McDowell decided to try his hand at producing MotionPictures. He quickly pulled together a team and produced the award-winning short \"The Perfect Proposal\". The short soon became a calling card for his new production company, F.A. Entertainment. In January of 2006, McDowell moved his new production company to its current offices in Burbank, CA. And branched out the company into a new division called 77 Entertainment which specializes in feature film development and production. McDowell's appreciation for the creative process has made 77 Entertainment a company where new screenwriters with a fresh perspective can join in developing future feature films and television projects based on original ideas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkzODQ4MTIxN15BMl5BanBnXkFtZTgwMjg3Njc5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1816154","name":"Randy McDowell","idIMDB":"nm1816154"},"actorId":"nm1816154","character":"Rob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tyler Case","urlProfile":"http://www.imdb.com/name/nm1658262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcwMzM1N2QtOGIyYi00ZGU0LWFiYzEtYzJmYmE5NzQyYTQyXkEyXkFqcGdeQXVyMTk5NDk2NDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Tyler Case, a born Floridian (Fort Lauderdale), was raised in Peachtree City, GA where he discovered his passion for acting. Tyler began to work in front of the camera at 5 years old doing print advertisement for different companies including Fisher-Price. From there, Tyler branched into commercials. At six years old, Tyler landed his first ever national commercial for Bounce Fabric Softer. Seeing himself on television was like adding coal to an already blazing fire - Tyler was burning with passion. By the time Tyler was 10 years old, he already had two trips to Los Angeles under his belt with many more to come. Tyler was educated in Los Angeles when he was in town for extensive periods of time, but got the majority of his education in his Georgian hometown. Tyler excelled in school and was enrolled in Gifted & Advanced Placement classes throughout his academic career. In addition to Acting and Academics, Tyler was able to play soccer for his local club team and High School's team (Starr's Mill High School). For well over a decade, Tyler has worked wherever he could in Print, Commercial, Film, Television, Theater, and Voice Over. Tyler resides in Los Angels where he further pursues his acting career as well as a new-found knack for song writing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcwMzM1N2QtOGIyYi00ZGU0LWFiYzEtYzJmYmE5NzQyYTQyXkEyXkFqcGdeQXVyMTk5NDk2NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1658262","name":"Tyler Case","idIMDB":"nm1658262"},"actorId":"nm1658262","character":"Shane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael May","urlProfile":"http://www.imdb.com/name/nm2729847","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4NDQ0MTUwNl5BMl5BanBnXkFtZTgwNjMyMDA3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1999","placeOfBirth":"","height":"5' 10\" (1.78 m)","bio":"Michael May, was born in Atlanta, GA on April 29, 1999. He began his acting career at the age of 3 when he sang his first solo on stage in the play \"Bye-Bye Birdie.\" At the age of 5, he attended an \"Open-Call\" audition in Atlanta, Ga where he was discovered by Joy Pervis of J Pervis Talent Agency. After booking several commercials such as 790 the Zone, Belk, and a Tommy Hilfiger Runway show. Michael booked his first movie \"Good Intentions\" at the age of 6, co-starring with LeAnn Rhimes, Elaine Hendrix and Luke Perry. At the age of 7, Michael booked his second feature film \"The Lost and Found Family\", where he played the foster brother of Lucas Till. Several months later he booked the feature film \"Blood Done Sign My Name\" starring Rick Schroder, Lela Richon, and Nate Parker. Unbeknownst to Michael, in this film, he would be playing the brother of two of his future television co-stars Lee Norris and Cullen Moss. Michael landed his first television role at the age of 8, on the hit show \"One Tree Hill\". Originally cast as \"Chuck Scolnik\", he started as a day-player and \"schoolyard bully\" to co-star Jackson Brundage. Michael was cast in, and eventually guest starred in over thirty episodes across four One Tree Hill seasons. Playing this role enabled Michael to share the screen with amazing people such as NFL hall-of-famer, Jerry Rice, and Quinton Aaron, from the Academy Award Winning movie, \"The Blindside\". While filming late one night, the producers of OTH discovered that Michael was not only an actor, but that he also was a singer/song writer. He performed his original song not only on the episode of \"One Tree Hill\" but also on stage with fellow co-star and Warner Brothers recording artist, Tyler Hilton. They performed live at such venues as Eddies Attic in Atlanta, GA and the Soapbox Lounge in Wilmington, NC. Other notable roles include the voice of Taylor McTuttle in the animated Christmas movie \"An Elf's Story\" based on the book \"The Elf on the Shelf\", as well as the epic role of \"Young Stifler\" in the new movie form the \"American Pie\" dynasty, \"American Reunion\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4NDQ0MTUwNl5BMl5BanBnXkFtZTgwNjMyMDA3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2729847","name":"Michael May","nicknames":["Joe"],"idIMDB":"nm2729847"},"actorId":"nm2729847","character":"Chris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Cody Williams","urlProfile":"http://www.imdb.com/name/nm0930908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDA2MzcxNF5BMl5BanBnXkFtZTcwNDUxMTYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Jim Cody Williams is known for his work on Pirates of the Caribbean: Dead Man's Chest (2006), Dodgeball: A True Underdog Story (2004) and Bill & Ted's Excellent Adventure (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDA2MzcxNF5BMl5BanBnXkFtZTcwNDUxMTYzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930908","name":"Jim Cody Williams","idIMDB":"nm0930908"},"actorId":"nm0930908","character":"Bo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted Manson","urlProfile":"http://www.imdb.com/name/nm0361381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3Mzg0OTk5OF5BMl5BanBnXkFtZTcwODcwMzMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1926","placeOfBirth":" Columbus, Ohio, USA","bio":"Ted Manson was born on October 23, 1926 in Columbus, Ohio, USA. He was an actor, known for The Curious Case of Benjamin Button (2008), Deja Vu (2006) and Talladega Nights: The Ballad of Ricky Bobby (2006). He died on June 1, 2008 in Atlanta, Georgia, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3Mzg0OTk5OF5BMl5BanBnXkFtZTcwODcwMzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0361381","name":"Ted Manson","idIMDB":"nm0361381"},"actorId":"nm0361381","character":"Mr. Simmons","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valyn Hall","urlProfile":"http://www.imdb.com/name/nm1783208","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDUyNTcwMF5BMl5BanBnXkFtZTgwNzcxMjA1OTE@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1985","placeOfBirth":"","height":"5' 1\" (1.55 m)","bio":"Valyn Hall was born on September 4 in Atlanta, Georgia, to parents Ed and Lisa Hall. She has an older sister (also an aspiring actress) Amber Chaney, and a younger sister (an aspiring musician) Lindsey. she was brought up in Marietta, Georgia. She chose to home school for high school knowing she could finish earlier that way. When she turned 17 she won the Wilhelmina top actress award in Miami, Florida, and there gained representation. After that it was off to New York. After a year there she then went to L.A. and spends her time split between Atlanta and L.A.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDUyNTcwMF5BMl5BanBnXkFtZTgwNzcxMjA1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1783208","name":"Valyn Hall","idIMDB":"nm1783208"},"actorId":"nm1783208","character":"Marcy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Bowman","urlProfile":"http://www.imdb.com/name/nm1578011","urlPhoto":"","biography":{"bio":"Helen Bowman is an actress, known for Hustle & Flow (2005), Away (A)wake (2005) and The Glassed Eye (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1578011","name":"Helen Bowman","idIMDB":"nm1578011"},"actorId":"nm1578011","character":"Antique Buyer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marc McPherson","urlProfile":"http://www.imdb.com/name/nm2613718","urlPhoto":"","biography":{"bio":"Marc McPherson is an actor, known for The Signal (2007), Good Intentions (2010) and Sweatshop (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2613718","name":"Marc McPherson","idIMDB":"nm2613718"},"actorId":"nm2613718","character":"Uncle Donnie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1070781","urlIMDB":"http://www.imdb.com/title/tt1070781","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"07","year":"2007","remarks":null},{"money":null,"country":null,"day":"25","month":"08","year":"2007","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.2","filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"rated":"PG-13","awards":[],"votes":"558","type":"Movie","companyCreditsSimple":[{"idCompany":"co0622371","name":"Second Unit Services"},{"idCompany":"co0198530","name":"Shadowlight Pictures"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:54:05"}}