{"data":{"movies":[{"title":"I Love You, Beth Cooper","originalTitle":"","year":"2009","releaseDate":"20090710","directors":[{"name":"Chris Columbus","id":"nm0001060"}],"writers":[{"name":"Larry Doyle","id":"nm0236421"},{"name":"Larry Doyle","id":"nm0236421"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTc2NDM3NF5BMl5BanBnXkFtZTcwNjU3Mzg0Mg@@._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"When Dennis Cooverman gives the commencement speech at his graduation, his friend tells him to let it all out. So he proclaims his love for Beth Cooper the head cheerleader, and says things about everyone in the graduating class as well as some other people. Later Beth confronts him and he invites her to a graduation party at his house. And to his surprise she and two of her friends show up. But also some of the people he offended with his speech, who want to tear him apart. And one of them is Beth's boyfriend whom she just broke up with. So they all get in Beth's car and drive away. And what follows is a wild adventure.","simplePlot":"A nerdy valedictorian proclaims his love for the hottest and most popular girl in school - Beth Cooper - during his graduation speech. Much to his surprise, Beth shows up at his door that very night and decides to show him the best night of his life.","actors":[{"actorName":"Hayden Panettiere","urlProfile":"http://www.imdb.com/name/nm0659363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2OTI1NzA0NV5BMl5BanBnXkFtZTcwOTczMTA2Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1989","placeOfBirth":" Palisades, New York, USA","birthName":"Hayden Leslie Panettiere","height":"5' 0¼\" (1.53 m)","bio":"Hayden Leslie Panettiere was born on 21st August 1989 in Palisades, New York, to actress Lesley Vogel and fire department captain Skip Panettiere. Her younger brother is actor Jansen Panettiere. She has Italian, and some English and German, ancestry. Her mother got her started in the business by doing commercials when she was just 11 months old. Then, at only 4 1/2, she was cast on the soap opera One Life to Live (1968), where she remained until 1997. Since then, she has gone on to appear in many feature films and TV movies. But she is probably best known in the United States for her role as \"Claire\" on the hit TV show, Heroes (2006). As for movies, Hayden starred in Remember the Titans (2000) with Denzel Washington and Joe Somebody (2001) with Tim Allen. When Hayden isn't working, she enjoys singing, dancing, horseback riding, gymnastics, taking piano lessons, and swimming. She has been involved with many animated movies, beginning with A Bug's Life (1998) as \"Dot\", later to follow was Dinosaur (2000), the video game Kingdom Hearts (2002), and The Mark of Kri (2002). Her next movie is Racing Stripes (2005), a partly animated film, but Hayden will star in the human role; other cast members include the voices of Whoopi Goldberg, Dustin Hoffman, Joshua Jackson and Mandy Moore. In 2003, she joined the likes of Jessica Lange, Tom Wilkinson and Clancy Brown in Jane Anderson's Normal (2003), a film about a Midwestern husband and father who announces his plans to have a sex-change operation. In July of the same year, Hayden appeared in a John Guare play, \"Landscape of the Body\", for the Williamstown theater festival in Williamstown, Massachusetts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2OTI1NzA0NV5BMl5BanBnXkFtZTcwOTczMTA2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659363","name":"Hayden Panettiere","nicknames":["Mushroom","Hayd"],"idIMDB":"nm0659363"},"actorId":"nm0659363","character":"Beth Cooper","urlCharacter":"http://www.imdb.com/character/ch0143509","main":true},{"actorName":"Paul Rust","urlProfile":"http://www.imdb.com/name/nm1770256","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2NzIyMDYxMF5BMl5BanBnXkFtZTcwODUwMTc3Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1981","placeOfBirth":" Le Mars, Iowa, USA","height":"5' 7¼\" (1.71 m)","bio":"Paul Rust was born on April 12, 1981 in Le Mars, Iowa, USA. He is a writer and actor, known for Love (2016), Inglourious Basterds (2009) and Comedy Bang! Bang! (2012). He has been married to Lesley Arfin since 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2NzIyMDYxMF5BMl5BanBnXkFtZTcwODUwMTc3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1770256","name":"Paul Rust","idIMDB":"nm1770256"},"actorId":"nm1770256","character":"Denis Cooverman","urlCharacter":"http://www.imdb.com/character/ch0143199","main":true},{"actorName":"Jack Carpenter","urlProfile":"http://www.imdb.com/name/nm2358430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3Njg2NDYwMF5BMl5BanBnXkFtZTcwMzk0ODk5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1984","placeOfBirth":"","height":"6' 1\" (1.85 m)","bio":"Jack Carpenter was born on September 18, 1984. He is an actor and producer, known for I Love You, Beth Cooper (2009), The Good Wife (2009) and Gilmore Girls: A Year in the Life (2016). He has been married to Michelle Cohen since August 26, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3Njg2NDYwMF5BMl5BanBnXkFtZTcwMzk0ODk5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2358430","name":"Jack Carpenter","idIMDB":"nm2358430"},"actorId":"nm2358430","character":"Rich Munsch","urlCharacter":"http://www.imdb.com/character/ch0151431","main":true},{"actorName":"Lauren London","urlProfile":"http://www.imdb.com/name/nm1988575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTkzNTg4M15BMl5BanBnXkFtZTYwMjUzMTE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1984","placeOfBirth":" Los Angeles, California, USA","birthName":"Lauren Nicole London","height":"5' 2\" (1.57 m)","bio":"Lauren London first appeared in the film, ATL, opposite actor and recording artist, Tip \"TI\" Harris. Due to London's breakout success in ATL, she received an offer to star in the film, This Christmas, with Loretta Devine, Idris Elba and Regina King. Her next film role was in the teen romantic comedy, I Love You, Beth Cooper, opposite Hayden Panettiere. London made her television debut on Everybody Hates Chris. Her other television credits include a recurring guest star role on HBO's Entourage, a recurring guest star role on CW's 90210 and a special guest star role in the VH1 series, Singles Ladies, executive produced by Queen Latifah. London's next feature film is Madea's Big Happy Family, directed by Tyler Perry. She is a Los Angeles native.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTkzNTg4M15BMl5BanBnXkFtZTYwMjUzMTE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1988575","name":"Lauren London","nicknames":["L-Boogie"],"idIMDB":"nm1988575"},"actorId":"nm1988575","character":"Cammy","urlCharacter":"http://www.imdb.com/character/ch0151434","main":true},{"actorName":"Lauren Storm","urlProfile":"http://www.imdb.com/name/nm1478996","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTM0NzYzMV5BMl5BanBnXkFtZTcwNjU3Njk5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1987","placeOfBirth":" Chicago, Illinois, USA","height":"5' 3\" (1.6 m)","bio":"Lauren Storm is on the Board of Directors with Kids With A Cause and Olive Crest, both charity orginaztions. She graduated at age 16 from the Excelsior School of Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTM0NzYzMV5BMl5BanBnXkFtZTcwNjU3Njk5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1478996","name":"Lauren Storm","idIMDB":"nm1478996"},"actorId":"nm1478996","character":"Treece","urlCharacter":"http://www.imdb.com/character/ch0151433","main":true},{"actorName":"Shawn Roberts","urlProfile":"http://www.imdb.com/name/nm0731575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzEzMTQzOF5BMl5BanBnXkFtZTcwMjUzNDY4Mw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1984","placeOfBirth":" Stratford, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"The year 1994 marked the beginning of the career for Canadian actor Shawn Roberts. Born in Stratford, Ontario, Canada on April 2, Shawn lucked upon a life-changing break while he was portraying the part of the Wolf in a school play version of Little Red Riding Hood. Award-winning screenwriter Robert Forsyth, father of one of Shawn's friends, spotted Roberts while attending this play. Through Forsythe's efforts, Shawn was then recommended to a Toronto acting agency. He had a guest appearance on the TV series Sirènes (1993) in 1994 before landing a regular role in 1996 on the new series Émilie de la nouvelle lune (1998). Throughout the rest of the 1990s, Shawn generally remained on television, showing up on various series before striking gold with his first movie appearance. In 2000, he gained a part in the first X-Men (2000) movie, playing Rogue's boyfriend Cody. Since 2000, the career of Shawn Roberts thus balanced out appropriately well between television and film work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzEzMTQzOF5BMl5BanBnXkFtZTcwMjUzNDY4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0731575","name":"Shawn Roberts","idIMDB":"nm0731575"},"actorId":"nm0731575","character":"Kevin","urlCharacter":"http://www.imdb.com/character/ch0166484","main":true},{"actorName":"Jared Keeso","urlProfile":"http://www.imdb.com/name/nm1742119","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTE5NTM5NV5BMl5BanBnXkFtZTgwODgwMDY2ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1984","placeOfBirth":" Listowel, Ontario, Canada","bio":"Jared Keeso was born on July 1, 1984 in Listowel, Ontario, Canada. He is an actor and writer, known for Godzilla (2014), Elysium (2013) and I Love You, Beth Cooper (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTE5NTM5NV5BMl5BanBnXkFtZTgwODgwMDY2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1742119","name":"Jared Keeso","idIMDB":"nm1742119"},"actorId":"nm1742119","character":"Dustin","urlCharacter":"http://www.imdb.com/character/ch0166485","main":true},{"actorName":"Brendan Penny","urlProfile":"http://www.imdb.com/name/nm1638242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODc3Nzg4Nl5BMl5BanBnXkFtZTgwNTg3NzE2MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Brendan James Penny","bio":"Brendan Penny was born in Ottawa, Ontario, Canada as Brendan James Penny. He is an actor, known for Motive (2013), The A-Team (2010) and I Love You, Beth Cooper (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODc3Nzg4Nl5BMl5BanBnXkFtZTgwNTg3NzE2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1638242","name":"Brendan Penny","idIMDB":"nm1638242"},"actorId":"nm1638242","character":"Sean","urlCharacter":"http://www.imdb.com/character/ch0166486","main":true},{"actorName":"Marie Avgeropoulos","urlProfile":"http://www.imdb.com/name/nm2955595","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzODcyMzk5MF5BMl5BanBnXkFtZTgwNTE2NDkyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1986","placeOfBirth":" Thunder Bay, Ontario, Canada","height":"5' 5\" (1.65 m)","bio":"Marie Avgeropoulos currently stars as \"Octavia Blake\" in the CW's post-apocalyptic drama series THE 100. The Emmy nominated series chronicles the surviving population living on a space station called the ARK who send a group of 100 delinquents down to earth. THE 100 set out to see if earth might still be inhabitable as supplies are running low on the ARK. Marie recently wrapped production on three independent films: ISOLATION, NUMB and A REMARKABLE LIFE slated for release in early 2016. Earlier this year, Marie was seen opposite Taylor Lautner in the Lionsgate thriller TRACERS. Other film credits for Marie include the 2011 Golden Globe nominated 50/50 alongside movie veterans Seth Rogan & Joseph Gordan-Levitt, as well as her memorable premiere film role in the 2009 comedy I LOVE YOU BETH COOPER, starring opposite Hayden Panettiere. Marie has also become a go-to TV actress with several guest appearances on hit shows such as SUPERNATURAL, FRINGE, EUREKA and HUMAN TARGET. In 2013, Marie landed her break-out role in television in The CW's CULT opposite Matthew Davis and Robert Knepper Born and raised on the shores of Lake Superior in Thunder Bay, Ontario, Canada Marie grew up fishing, hunting and camping spending most of her free time outdoors. She learned to play the drums at a young age, which has helped land her roles in various national commercials. Marie currently resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzODcyMzk5MF5BMl5BanBnXkFtZTgwNTE2NDkyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2955595","name":"Marie Avgeropoulos","idIMDB":"nm2955595"},"actorId":"nm2955595","character":"Valli Wooley","urlCharacter":"http://www.imdb.com/character/ch0166483","main":true},{"actorName":"Josh Emerson","urlProfile":"http://www.imdb.com/name/nm1961527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUwMjcwNzMyMl5BMl5BanBnXkFtZTgwNTI5NjA0ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"Joshua Gordon Emerson","height":"6' 3\" (1.91 m)","bio":"Josh was born in Edmonton, Alberta, Canada. His father Gordon was born in Biggar, SK, and worked as a Bio Med Technician and his mother Judy was born and raised in Montreal and works as a secretary. At the age of twelve Josh moved to Spruce Grove, Alberta, where he attended High School. It was a tough change going from a Christian Elementary School to a public Junior High School. He played sports including football, basketball for his junior high school, but he soon found hockey was the sport for him. He took acting classes with Elizabeth Ebbels, who initially took pity on him and later became his first real agent. He wasn't very popular in high school; he was overweight and not exactly the hottest guy in school. In his Senior year of high school he just decided to make a real change and started going to a local gym 2-3 hours everyday. This dramatic change later drove him to get involved with the wrong crowd on numerous occasions. After seeing quite a bit and getting sick of the life he was living, he decided to turn his life around and got focused on acting. He entered Red Deer College and enrolled in the Motion Picture Arts Bachelor Program, graduating with a 3.67 GPA. The highlight for him was meeting his primary instructor and mentor Larry Reese, who had been in Unforgiven, Brokeback Mountain, and many other films. A highlight for him was when Larry Reese took him as his personal reader on his auditions. One day he advised him on a move and two and half weeks later Josh moved to Vancouver and signed with Debbie Mahood at Lukas Talent, one of Canada's leading agencies. Debbie soon had him working on many of Canada's leading television shows and on more than a few American movies crossing the border. American audiences first saw him in Lifetime movies and in the CW series Aliens In America. Josh's big break came when he was cast as Greg Saloga on I Love You, Beth Cooper directed by Chris Columbus and Jonas Konelle on Jennifer's Body with Megan Fox. With his amazing resume he plans to join the many other well-known Canadian actors in the US and has been scouting places in West Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUwMjcwNzMyMl5BMl5BanBnXkFtZTgwNTI5NjA0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1961527","name":"Josh Emerson","idIMDB":"nm1961527"},"actorId":"nm1961527","character":"Greg Saloga","urlCharacter":"http://www.imdb.com/character/ch0166482","main":true},{"actorName":"Alan Ruck","urlProfile":"http://www.imdb.com/name/nm0001688","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTc0NDE2MF5BMl5BanBnXkFtZTcwMzQzNzQzMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1956","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Alan Douglas Ruck","height":"6' (1.83 m)","bio":"Alan Ruck was born on July 1, 1956 in Cleveland, Ohio, and has made over 100 appearances in films and television, and on stage. He is best known for his role as the friend of Matthew Broderick and hopeless hypochondriac Cameron Frye, in John Hughes's Ferris Bueller's Day Off (1986). During the 1980s he appeared in films such as Class (1983) with Rob Lowe and Andrew McCarthy and Three for the Road (1987) with Charlie Sheen. The 1990s included Young Guns II (1990) with Emilio Estevez and Lou Diamond Phillips, Star Trek: Generations (1994), Speed (1994) with Keanu Reeves and Twister (1996) (the latter two films are directed by Jan de Bont). Ruck's television appearances include Tales from the Crypt (1989) opposite Lou Diamond Philips, Mad About You (1992) with Helen Hunt (his co-star in Twister), and Spin City (1996) with Michael J. Fox. Ruck made an appearance in the HBO miniseries From the Earth to the Moon (1998) which reunited him with his Twister co-star Cary Elwes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTc0NDE2MF5BMl5BanBnXkFtZTcwMzQzNzQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001688","name":"Alan Ruck","idIMDB":"nm0001688"},"actorId":"nm0001688","character":"Mr. C","urlCharacter":"http://www.imdb.com/character/ch0244497","main":true},{"actorName":"Cynthia Stevenson","urlProfile":"http://www.imdb.com/name/nm0828906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODEyMDA2NV5BMl5BanBnXkFtZTgwMjIxNDA0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1962","placeOfBirth":" Piedmont, California, USA","birthName":"Cynthia C. Stevenson","bio":"Cynthia Stevenson was born in Oakland, California, to Al Stevenson, an upholstery warehouse owner and Gayle Stevenson née Boniface, an editor. She moved north with her mother and brother, Gregory, to Bellevue, Washington and then to Vancouver, British Columbia, where she spent most of her childhood. Cynthia took her first step toward an acting career in the University of Victoria's Phoenix Theatre Program. Cynthia returned to California to complete her training, attending the renowned American Conservatory Theatre (ACT) in San Francisco, and the Drama Studio London at Berkeley. After arriving in Los Angeles Cynthia found roles with an improv group and in two local theatre productions, one of which was a long-running hit, The Ladies Room, written and directed by Robin Schiff and produced by Aaron Spelling, which brought Cynthia critical acclaim for her comedic skills. Because of this work, she landed an immediate job on a TV sketch comedy, Off the Wall, where she was featured in 26 episodes. Cynthia quickly built her resume with guest parts on popular sitcoms, including Empty Nest, Teddy Z., Newhart, Major Dad and others. Next came her first starring role as Jennifer Bass in My Talk Show, an original, offbeat nightly series, described as \"the first cult hit\" of the 1990s. It proved to be Cynthia's big break, as director Robert Altman noticed and cast her as Bonnie Sherow, playing opposite Tim Robbins, in his Oscar nominated film, The Player. Legendary TV producers, Cherie and Bill Steinkellner, chose her for a recurring guest spot on their iconic hit series, Cheers. The producers then tapped her for a co-starring role in their next sitcom, Bob, playing Bob Newhart's daughter. That performance inspired the production team to create a new show - Hope & Gloria - especially for Cynthia. Cynthia was the center of a talented cast, including Jessica Lundy, Alan Thicke and Rico Colantoni. When talking about her career path, Cynthia is quick to point out that it was the Steinkellners who gave it direction. With a versatility that moves easily between TV and film, Cynthia had leading roles in character-driven ensemble features, such as the David Brown produced Watch It, Julianna Lavin's Live Nude Girls, Jodie Foster's Home for the Holidays, Billy Crystal's Forget Paris and Todd Solondz's Happiness. She's been a recurring guest on network and cable shows, including Ally McBeal, Monk, Six Feet Under, According to Jim and The L Word. When Lifetime decided to enter into the half hour comedy business, they tapped Cynthia for the lead role in Susan Beavers' Oh Baby, an innovative, first-person take on single motherhood which ran for two years. She then relocated to Vancouver (known as \"Hollywood North\"), where she starred as the troubled Joy Lass in the long-running Showtime favorite Dead Like Me. While working in Vancouver, Cynthia was featured in several family films, including Agent Cody Banks, Agent Cody Banks 2: Destination London and six Air Bud comedies for Disney and in Richard Benjamin's A Little Thing Called Murder opposite Judy Davis. Her roster also expanded with roles in independent films such as Neverwas, Case 39 and Reunion. Before returning to Southern California in 2008, Cynthia was a series regular, playing the feisty female sheriff on ABC's Men in Trees, and also starred in Lifetime TV's Christmas comedy, Will You Merry Me, I Love You Beth Cooper, Jennifer's Body, and the long-awaited Dead Like Me (The Movie). Since relocating back to Los Angeles Cynthia has had guest and recurring roles on such shows as Life Unexpected, Grey's Anatomy and Off the Map as well as co-starring in the ABC series, Surviving Suburbia. Cynthia recently completed the soon to be released feature film Tiger Eyes. Cynthia lives in the Los Angeles area with her husband and son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODEyMDA2NV5BMl5BanBnXkFtZTgwMjIxNDA0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828906","name":"Cynthia Stevenson","idIMDB":"nm0828906"},"actorId":"nm0828906","character":"Mrs. C","urlCharacter":"http://www.imdb.com/character/ch0244498","main":true},{"actorName":"Pat Finn","urlProfile":"http://www.imdb.com/name/nm0278156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTYwNTMyMV5BMl5BanBnXkFtZTcwNzQ3ODQyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1965","placeOfBirth":" Evanston, Illinois, USA","birthName":"Patrick Cassidy Finn","height":"6' (1.83 m)","bio":"Pat Finn was born on July 31, 1965 in Evanston, Illinois, USA as Patrick Cassidy Finn. He is an actor, known for The Middle (2009), It's Complicated (2009) and I Am Chris Farley (2015). He has been married to Donna Crowley since September 29, 1990. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTYwNTMyMV5BMl5BanBnXkFtZTcwNzQ3ODQyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0278156","name":"Pat Finn","idIMDB":"nm0278156"},"actorId":"nm0278156","character":"Coach Raupp","urlCharacter":"http://www.imdb.com/character/ch0166479","main":true},{"actorName":"Andrea Savage","urlProfile":"http://www.imdb.com/name/nm0767242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTg4MTYxMV5BMl5BanBnXkFtZTgwNzk0MzEwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1973","placeOfBirth":" Santa Monica, California, USA","birthName":"Andrea Kristen Savage","height":"5' 8\" (1.73 m)","bio":"Andrea Savage was born on February 20, 1973 in Santa Monica, California, USA as Andrea Kristen Savage. She is an actress and writer, known for Veep (2012), Step Brothers (2008) and The Hotwives of Las Vegas (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTg4MTYxMV5BMl5BanBnXkFtZTgwNzk0MzEwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0767242","name":"Andrea Savage","idIMDB":"nm0767242"},"actorId":"nm0767242","character":"Dr. Gleason","urlCharacter":"http://www.imdb.com/character/ch0166478","main":true},{"actorName":"Violet Columbus","urlProfile":"http://www.imdb.com/name/nm0173390","urlPhoto":"","biography":{"dateOfBirth":"1994","placeOfBirth":"","bio":"Violet Columbus was born in 1994. She is an actress and assistant director, known for Harry Potter and the Prisoner of Azkaban (2004), Harry Potter and the Chamber of Secrets (2002) and Percy Jackson & the Olympians: The Lightning Thief (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0173390","name":"Violet Columbus","idIMDB":"nm0173390"},"actorId":"nm0173390","character":"Sullen Girl","urlCharacter":"http://www.imdb.com/character/ch0166477","main":true}],"seasons":[],"idIMDB":"tt1032815","urlIMDB":"http://www.imdb.com/title/tt1032815","business":{"budget":{"money":"$18,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,919,433","country":"USA","day":"12","month":"07","year":"2009","remarks":"1,858 Screens"}],"gross":[{"money":"$14,793,904","country":"USA","day":"27","month":"09","year":"2009","remarks":""},{"money":"$14,787,109","country":"USA","day":"20","month":"09","year":"2009","remarks":""},{"money":"$14,772,068","country":"USA","day":"13","month":"09","year":"2009","remarks":""},{"money":"$14,747,977","country":"USA","day":"06","month":"09","year":"2009","remarks":""},{"money":"$14,706,744","country":"USA","day":"30","month":"08","year":"2009","remarks":""},{"money":"$14,652,611","country":"USA","day":"23","month":"08","year":"2009","remarks":""},{"money":"$14,555,781","country":"USA","day":"16","month":"08","year":"2009","remarks":""},{"money":"$14,430,096","country":"USA","day":"09","month":"08","year":"2009","remarks":""},{"money":"$14,191,592","country":"USA","day":"02","month":"08","year":"2009","remarks":""},{"money":"$13,377,333","country":"USA","day":"26","month":"07","year":"2009","remarks":""},{"money":"$10,363,239","country":"USA","day":"19","month":"07","year":"2009","remarks":""},{"money":"$4,919,433","country":"USA","day":"12","month":"07","year":"2009","remarks":""}],"weekendGross":[{"money":"$5,568","country":"USA","day":"27","month":"09","year":"2009","remarks":"17 Screens"},{"money":"$10,739","country":"USA","day":"20","month":"09","year":"2009","remarks":"19 Screens"},{"money":"$19,700","country":"USA","day":"13","month":"09","year":"2009","remarks":"28 Screens"},{"money":"$30,839","country":"USA","day":"06","month":"09","year":"2009","remarks":"35 Screens"},{"money":"$28,315","country":"USA","day":"30","month":"08","year":"2009","remarks":"77 Screens"},{"money":"$51,931","country":"USA","day":"23","month":"08","year":"2009","remarks":"111 Screens"},{"money":"$78,545","country":"USA","day":"16","month":"08","year":"2009","remarks":"140 Screens"},{"money":"$79,149","country":"USA","day":"09","month":"08","year":"2009","remarks":"144 Screens"},{"money":"$283,365","country":"USA","day":"02","month":"08","year":"2009","remarks":"304 Screens"},{"money":"$719,468","country":"USA","day":"26","month":"07","year":"2009","remarks":"730 Screens"},{"money":"$2,766,863","country":"USA","day":"19","month":"07","year":"2009","remarks":"1,872 Screens"},{"money":"$4,919,433","country":"USA","day":"12","month":"07","year":"2009","remarks":"1,858 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Copyright © 2009 Twentieth Century Fox Film Corporation and Dune Entertainment III LLC in all territories except Brazil, Italy, Japan, Korea and Spain. Copyright © 2009 TCF Hungary Film Rights Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation and Dune Entertainment III LLC in Brazil, Italy, Japan, Korea and Spain."},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Dolby","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe (prints)","EFilm (digital intermediate)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm"]},"rating":"5.3","metascore":"32","filmingLocations":[{"location":"Golden Ears Provincial Park, British Columbia, Canada"}],"rated":"PG-13","awards":[{"award":"Teen Choice Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Summer Movie Star: Female","names":[{"name":"Hayden Panettiere","id":"nm0659363","role":null}]}]}]},{"award":"World Stunt Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Taurus Award","categories":[{"category":"Hardest Hit","names":[{"name":"Rob Hayter","id":"nm0371690","role":null}]}]}]}],"votes":"29,210","type":"Movie","companyCreditsSimple":[{"idCompany":"co0176225","name":"Fox Atomic"},{"idCompany":"co0046151","name":"1492 Pictures"},{"idCompany":"co0236770","name":"Bece Canada Productions"}],"keywords":{"keywords":["speech","popular girl","cheerleader","party","valedictorian","five word title","scantily clad female","hot pants","white panties","panties","upskirt","popularity","convenience store","film buff","underwear","threesome","teenager","teenage sexuality","teen love","tampon","suspected homosexual","sunrise","summer","social life","shower","reckless driving","raccoon","punched in the face","possessive boyfriend","poncho","nosebleed","nerd","making out in a car","kiss","kicked in the face","insult","implied nudity","house party","hit in the face","hit in the eye","hit by a car","high school","high school friends","gym teacher","girls locker room","geek","flashback","fight","falling off a roof","fake id","escape","erection","blonde stereotype","drivers ed","dead brother","confession of love","condom","coming out","champagne","cellular phone trace","car accident","bully","awkward silence","advice","military","cow","cow tipping","bad driver","underage drinking","teen movie","punctuation in title","high school crush","comma in title","claim in title","boyfriend girlfriend relationship","high school graduation","embarrassment","based on novel","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:56:50"}}