{"data":{"movies":[{"title":"Ivory","originalTitle":"","year":"2010","releaseDate":"2010","directors":[{"name":"Andrew W. Chan","id":"nm1793317"}],"writers":[{"name":"Laurence Gingold","id":"nm0320007"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzQ0Mjc0OF5BMl5BanBnXkFtZTgwODAzMDEwMDE@._V1.jpg","countries":["Hungary","USA"],"languages":["English"],"genres":["Drama","Music"],"plot":"Ivory centers on a young man's struggle between success versus fulfillment, and chronicles the exploration of an artist: the passion, dedication, and the immovable faith in one's talents. Andreas must train with a Russian piano teacher to win a piano competition.","simplePlot":"Ivory centers on a young man's struggle between success versus fulfillment, and chronicles the exploration of an artist: the passion, dedication, and the immovable faith in one's talents. ... ","actors":[{"actorName":"Travis Fimmel","urlProfile":"http://www.imdb.com/name/nm1379938","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0NjU0NzczN15BMl5BanBnXkFtZTcwMTc3MjMyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1979","placeOfBirth":" nr. Echuca, Victoria, Australia","height":"6' (1.83 m)","bio":"Travis Fimmel was born near Echuca, Victoria, Australia, to Jennie, a recreation officer for the disabled, and Chris, a cattle farmer. He was raised on a 5500-acre farm located between Melbourne and Sydney. Until the age of seventeen, his life was spent at school and working on the family farm, morning and night-something he continues to relish on his trips back home. After high school, higher education called and he was accepted to Melbourne University. It was not long until his intense curiosity led him to begin his global adventures. While bar-tending in London, giving away almost as much beer as he sold, he met his would-be manager, David Seltzer. David saw a spark in Travis and suggested he move to the United States to become an actor and nurture his talent. Easily enticed by the arts, it was not long before Travis made the move to Los Angeles, and within a week began studying with renowned acting coach Ivana Chubbuck. The teaching veteran, in addition to Travis, has mentored Jake Gyllenhaal, Eva Mendes, Halle Berry, Brad Pitt and Charlize Theron. Years of struggling and hard work continue to pay off and Travis has chalked up starring roles in several projects including Rocky Point (with Lauren Holly), Southern Comfort (with Madeleine Stowe and Eric Roberts), Restraint (with True Blood's Stephen Moyer), Ivory (with Martin Landau and Peter Stomare), Surfer Dude (with Matthew McConaughey and Woody Harrelson), and AE's The Beast (with Patrick Swayze). Production has taken Travis all over the world but, between roles, he travels back to his family's farm as much as possible. Travis is quick to point out that it is his love for Australian Rules (AKA \"No\" Rules) Football, the countryside, his two older brothers, and a hard working lifestyle that keeps his feet firmly planted on the ground.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0NjU0NzczN15BMl5BanBnXkFtZTcwMTc3MjMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1379938","name":"Travis Fimmel","nicknames":["Rangi"],"idIMDB":"nm1379938"},"actorId":"nm1379938","character":"Jake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Stormare","urlProfile":"http://www.imdb.com/name/nm0001780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUyMDQ0MTEyNF5BMl5BanBnXkFtZTYwNDYxMDkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1953","placeOfBirth":" Kumla, Örebro län, Sweden","birthName":"Peter Ingvar Storm","height":"6' 2\" (1.88 m)","bio":"Peter Stormare was born in Arbrå, Gävleborgs län, Sweden, to Gunhild (Holm) and Karl Ingvar Storm. He began his acting career at the Royal National Theatre of Sweden, performing for eleven years. In 1990 he became the Associate Artistic Director at the Tokyo Globe Theatre and directed productions of many Shakespeare plays, including \"Hamlet\". In 1993 he moved to New York, where he appeared in English productions. He continues to work in both the United States and his his homeland of Sweden. He resides in Los Angeles, California, USA, with his wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUyMDQ0MTEyNF5BMl5BanBnXkFtZTYwNDYxMDkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001780","name":"Peter Stormare","idIMDB":"nm0001780"},"actorId":"nm0001780","character":"David Strauss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beau Garrett","urlProfile":"http://www.imdb.com/name/nm1683768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ3NTcyMTgxMV5BMl5BanBnXkFtZTcwMDc2ODI2OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1982","placeOfBirth":" Beverly Hills, California, USA","birthName":"Beau Jesse Garrett","height":"5' 10\" (1.78 m)","bio":"Hired by GUESS! in the late 1990s as one of their new, fresh faces, Beau Jesse Garrett was born in Beverly Hills, California and grew up in Topanga Canyon. She was discovered, as many are, by a scout who saw her in a local shopping mall. She has one sister. Recently, she has played a quite sensual character on the HBO comedy series Entourage (2004), and had a role on the FOX soap opera North Shore (2004). She has also appeared in the horror film Turistas (2006), Fantastic 4: Rise of the Silver Surfer (2007), and the science fiction sequel TRON: Legacy (2010). She is currently a spokesmodel for Revlon cosmetics along with Halle Berry, Jennifer Connelly, Jessica Alba and Jessica Biel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ3NTcyMTgxMV5BMl5BanBnXkFtZTcwMDc2ODI2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1683768","name":"Beau Garrett","idIMDB":"nm1683768"},"actorId":"nm1683768","character":"Alicia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Landau","urlProfile":"http://www.imdb.com/name/nm0001445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzkxNzg0OF5BMl5BanBnXkFtZTcwNDUzOTc5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1928","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Oscar-winning character actor Martin Landau was born on June 20, 1928 in Brooklyn, New York. At age 17, he was hired by the New York Daily News as a staff cartoonist and illustrator. In his five years on the paper, he served as the illustrator for Billy Rose's \"Pitching Horseshoes\" column. He also worked for cartoonist Gus Edson on \"The Gumps\" comic strip. Landau's major ambition was to act, and in 1951, he made his stage debut in \"Detective Story\" at the Peaks Island Playhouse in Peaks Island, Maine. He made his off-Broadway debut that year in \"First Love\". Landau was one of 2000 applicants who auditioned for Lee Strasberg's Actors Studio in 1955 - only he and Steve McQueen were accepted. Landau was a friend of James Dean and McQueen, in a conversation with Landau, mentioned that he knew Dean and had met Landau. When Landau asked where they had met, McQueen informed him he had seen Landau riding into the New York City garage where he worked as a mechanic on the back of Dean's motorcycle. He acted during the mid-1950s in the television anthologies Playhouse 90 (1956), Studio One in Hollywood (1948), The Philco-Goodyear Television Playhouse (1948), Kraft Theatre (1947), Goodyear Playhouse (1951) and Omnibus (1952). He began making a name for himself after replacing star Franchot Tone in the 1956 off-Broadway revival of Anton Chekhov's \"Uncle Vanya\", a famous production that helped put off-Broadway on the New York theatrical map. In 1957, he made a well-received Broadway debut in the play \"Middle of the Night\". As part of the touring company with star Edward G. Robinson, he made it to the West Coast. He made his movie debut in Pork Chop Hill (1959) but scored on film as the heavy in Alfred Hitchcock's classic thriller North by Northwest (1959), in which he was shot on top of Mount Rushmore while sadistically stepping on the fingers of Cary Grant, who was holding on for dear life to the cliff face. He also appeared in the blockbuster Cleopatra (1963), the most expensive film ever made up to that time, which nearly scuttled 20th Century-Fox and engendered one of the great public scandals, the Elizabeth Taylor-Richard Burton love affair that overshadowed the film itself. Despite the difficulties with the film, Landau's memorable portrayal in the key role of Rufio was highly favored by the audience and instantly catapulted his popularity. In 1963, Landau played memorable roles on two episodes of the science-fiction anthology series The Outer Limits (1963), \"The Bellero Shield\" and \"The Man Who Was Never Born\". He was Gene Roddenberry's first choice to play Mr. Spock on Star Trek (1966), but the role went to Leonard Nimoy, who later replaced Landau on Mission: Impossible (1966), the show that really made Landau famous. He originally was not meant to be a regular on the series, which co-starred his wife Barbara Bain, whom he had married in 1957. His character, Rollin Hand, was supposed to make occasional, though recurring appearances, on Mission: Impossible (1966), but when the producers had problems with star Steven Hill, Landau was used to take up the slack. Landau's characterisation was so well-received and so popular with the audience that he was made a regular. Landau received Emmy nominations as Outstanding Lead Actor in a Drama Series for each of the three seasons he appeared. In 1968, he won the Golden Globe award as Best Male TV Star. Eventually, he quit the series in 1969 after a salary dispute when the new star, Peter Graves, was given a contract that paid him more than Landau, whose own contract stated he would have parity with any other actor on the show who made more than he did. The producers refused to budge and he and Bain, who had become the first actress in the history of television to be awarded three consecutive Emmy Awards (1967-69) while on the show, left the series, ostensibly to pursue careers in the movies. The move actually held back their careers, and Mission: Impossible (1966) went on for another four years with other actors. Landau appeared in support of Sidney Poitier in They Call Me Mister Tibbs! (1970), the less successful sequel to the Oscar-winning In the Heat of the Night (1967), but it did not generate more work of a similar caliber. He starred in the television movie Welcome Home, Johnny Bristol (1972) on CBS, playing a prisoner of war returning to the United States from Vietnam. The following year, he shot a pilot for NBC for a proposed show, \"Savage\". Though it was directed by emerging wunderkind Steven Spielberg, NBC did not pick up the show. Needing work, Landau and Bain moved to England to play the leading roles in the syndicated science-fiction series Space: 1999 (1975). Landau's and Bain's careers stalled after Space: 1999 (1975) went out of production, and they were reduced to taking parts in the television movie The Harlem Globetrotters on Gilligan's Island (1981). It was the nadir of both their careers, and Bain's acting days, and their marriage, soon were over. Landau, one of the most talented character actors in Hollywood, and one not without recognition, had bottomed out career-wise. In 1983, he was stuck in low-budget sci-fi and horror movies like The Being (1983), a role far beneath his talent. His career renaissance got off to a slow start with a recurring role in the NBC sitcom Buffalo Bill (1983), starring Dabney Coleman. On Broadway, he took over the title role in the revival of \"Dracula\" and went on the road with the national touring company. Finally, his career renaissance began to gather momentum when Francis Ford Coppola cast him in a critical supporting role in his Tucker: The Man and His Dream (1988), for which Landau was nominated for an Academy Award as Best Supporting Actor. He won his second Golden Globe for the role. The next year, he received his second consecutive Best Supporting Actor Oscar nomination for his superb turn as the adulterous husband in Woody Allen's Crimes and Misdemeanors (1989). He followed this up by playing famed Nazi hunter Simon Wiesenthal in the TNT movie Max and Helen (1990). However, the summit of his post-\"Mission: Impossible\" carer was about to be scaled. He portrayed Bela Lugosi in Tim Burton's biopic Ed Wood (1994) and won glowing reviews. For his performance, he won the Best Supporting Actor Oscar. Martin Landau, the superb character actor, finally had been recognized with his profession's ultimate award. His performance, which also won him his third Golden Globe, garnered numerous awards in addition to the Oscar and Golden Globe, including top honors from the New York Film Critics Circle and the National Society of Film Critics. Landau continued to play a wide variety of roles in motion pictures and on television, turning in a superb performance in a supporting role in The Majestic (2001). He received his fourth Emmy nomination in 2004 as Outstanding Guest Actor in a Drama Series for Without a Trace (2002). Martin Landau was honored with his own star on the Hollywood Walk of Fame, located at 6801 Hollywood Boulevard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzkxNzg0OF5BMl5BanBnXkFtZTcwNDUzOTc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001445","name":"Martin Landau","nicknames":["Marty"],"idIMDB":"nm0001445"},"actorId":"nm0001445","character":"Leon Spencer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlotte Salt","urlProfile":"http://www.imdb.com/name/nm1083395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MzQzNDEzMF5BMl5BanBnXkFtZTcwNjI0NzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1985","placeOfBirth":" Newcastle-under-Lyme, Staffordshire, England, UK","birthName":"Charlotte Leah Salt","height":"5' 5\" (1.65 m)","bio":"Charlotte Salt was born on August 12, 1985 in Newcastle-under-Lyme, Staffordshire, England as Charlotte Leah Salt. She is an actress, known for Beowulf (2007), Casualty (1986) and The Chamber (2016). She has been married to Oliver Coleman since July 31, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MzQzNDEzMF5BMl5BanBnXkFtZTcwNjI0NzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1083395","name":"Charlotte Salt","idIMDB":"nm1083395"},"actorId":"nm1083395","character":"Nadia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Draxl","urlProfile":"http://www.imdb.com/name/nm1039877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1NjEwNDM1OV5BMl5BanBnXkFtZTgwOTY2MjIwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1981","placeOfBirth":" Sydney, Australia","bio":"Tim Draxl was born on October 8, 1981 in Sydney, Australia. He is an actor, known for Swimming Upstream (2003), In My Sleep (2010) and My Best Men (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1NjEwNDM1OV5BMl5BanBnXkFtZTgwOTY2MjIwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1039877","name":"Tim Draxl","idIMDB":"nm1039877"},"actorId":"nm1039877","character":"Andreas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erika Marozsán","urlProfile":"http://www.imdb.com/name/nm0549629","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY3MzYzMzM1MF5BMl5BanBnXkFtZTcwNjA3NjM5Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1972","placeOfBirth":" Újfehértó, Hungary","height":"5' 7\" (1.7 m)","bio":"Hungarian beauty Erika Marozsán was born in Újfehértó, a small town in the Eastern part of the country, on 3 August 1972. She had her first appearance in the successful Hungarian movie \"Béketárgyalás, avagy az évszázad csütörtökig tart\" and has played primarily in Hungarian movies so far. She has also starred in several German TV productions and some international productions. Previously, Erika was trained at the Hungarian Ballet Academy for 10 years and later attended the Academy for Movies and Acting in Budapest, where she gradated in 1995. Only a little time later she became a member of the \"Új Színház\" (\"New Theater\") acting group of Hungary's capital. Later she changed to the Kaposvár Theater, where she still works.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY3MzYzMzM1MF5BMl5BanBnXkFtZTcwNjA3NjM5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0549629","name":"Erika Marozsán","nicknames":["Katzenfrau"],"idIMDB":"nm0549629"},"actorId":"nm0549629","character":"Olga Primakova","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Adam Goff","urlProfile":"http://www.imdb.com/name/nm2986418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MTg4NzQxMV5BMl5BanBnXkFtZTgwMjg0ODIyNzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Mark Adam Goff is an American film actor. One evening back in 1961, Mark Adam Goff was born above a movie theatre in Edmond, Oklahoma. Mark was the fourth child and second son of Vinton Isaac Goff II and Lorean Virginia Aldridge. Mark's mother, having a fondness for Pernell Robert's character \"Adam Cartwright\" on the ever popular \"Bonanza\" t.v. series at the time, gave Mark his middle name. Little did Mark know that these omens would come back forty-some years later to stare him in the face.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MTg4NzQxMV5BMl5BanBnXkFtZTgwMjg0ODIyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2986418","name":"Mark Adam Goff","idIMDB":"nm2986418"},"actorId":"nm2986418","character":"Judge #5","urlCharacter":"http://www.imdb.com/character/ch0153303","main":true},{"actorName":"Sean Frost","urlProfile":"http://www.imdb.com/name/nm0426839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODUyOTc1OV5BMl5BanBnXkFtZTgwMTA4MzQzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1969","placeOfBirth":" St. Paul, Minnesota, USA","height":"5' 7\" (1.7 m)","bio":"Sean Frost is a film actor and screenwriter currently based in Tulsa, Oklahoma. He often appears in short films as the heavy, the terrorist, the vengeful father, the corrupt politician, although he knows nothing about any of those except the heavy, because, well, frankly, he is kinda fat. Onstage, he played 'The Executioner' in \"Revenge of the Space Pandas\" with the Actor's Company of Tulsa. He has also written, acted in and at times directed or co-directed several short films of his own. One of these, \"Commitment\", garnered him a nomination for Best Actor in a Non-Feature Movie at the BareBones International Film Festival in 2012. He has also appeared in commercials for such companies as Nike and Gatorade. Sean continues to further his acting career via YouTube monologues and scenes and through collaborating with others as a screenwriter, writing great movies and, of course, parts for which he would be remarkably well-suited in those movies. He is SAG-AFTRA Eligible.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODUyOTc1OV5BMl5BanBnXkFtZTgwMTA4MzQzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0426839","name":"Sean Frost","idIMDB":"nm0426839"},"actorId":"nm0426839","character":"Party-goer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Gibbons","urlProfile":"http://www.imdb.com/name/nm3180477","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUwOTIwNjg0NF5BMl5BanBnXkFtZTgwMjcwOTM5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Michael Gibbons is an actor, known for The Killer Inside Me (2010), The Long Drive Home (2013) and This Christmas (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUwOTIwNjg0NF5BMl5BanBnXkFtZTgwMjcwOTM5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3180477","name":"Michael Gibbons","idIMDB":"nm3180477"},"actorId":"nm3180477","character":"Judge","urlCharacter":"http://www.imdb.com/character/ch0153303","main":true},{"actorName":"Tiger Sheu","urlProfile":"http://www.imdb.com/name/nm2080556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTEwNDE4OF5BMl5BanBnXkFtZTcwNTI1ODIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Tiger Sheu was born and raised in Dallas, Texas. Along with acting, Tiger Sheu is very passionate about martial arts. He is an avid practioner of both traditional and modern Wushu (kung fu). So much so he has spent time living overseas in China training at the Beijing Wushu Academy at Shi shang Hai, The Songjiang Wushu Academy in Shandong China, The Huo Yuan Jiao Wushu Academy in Tiajin China, and Wu Bin Wushu Academy in Beijing China with Jet Li's former coach Wu Bin. Although he considers kung fu his base style, Tiger has trained in a variety of martial arts including tae kwan do and sport karate. He is currently studying Muay Thai kickboxing, boxing, Brazillian Jiu Jitsu, and Mixed Martial Arts under former UFC Champ Guy Mezger. As a child Tiger was incredibly overweight and borderline obese. However through his dedication, training and discipline learned through Chinese Kung Fu Tiger whipped his body into shape.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTEwNDE4OF5BMl5BanBnXkFtZTcwNTI1ODIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2080556","name":"Tiger Sheu","idIMDB":"nm2080556"},"actorId":"nm2080556","character":"Wang Jing Wu - Competitor #7","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Lim","urlProfile":"http://www.imdb.com/name/nm2691091","urlPhoto":"","biography":{"bio":"Brandon hails from Brookfield, Wisconsin. He graduated from the School of Theatre at The University of Southern California. Brandon has also been an acting student at The Theatre School at DePaul University, The British American Drama Academy, Interlochen Center for the Arts, and Milwaukee High School of the Arts. He has appeared in commercials, for Kohl's, McDonald's, and Mountain Dew.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2691091","name":"Brandon Lim","idIMDB":"nm2691091"},"actorId":"nm2691091","character":"Scott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marlon Ladd","urlProfile":"http://www.imdb.com/name/nm2913179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDgxNDgyODAtZTUxZS00Zjg1LTgxZWYtMzVmZjA1NjJhMTY1XkEyXkFqcGdeQXVyNzE0MzEwODg@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Marlon Ladd is an actor and editor, known for Bad to the Jones (2011), The Jones' (2009) and Recoil (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDgxNDgyODAtZTUxZS00Zjg1LTgxZWYtMzVmZjA1NjJhMTY1XkEyXkFqcGdeQXVyNzE0MzEwODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2913179","name":"Marlon Ladd","idIMDB":"nm2913179"},"actorId":"nm2913179","character":"Security Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Rivas","urlProfile":"http://www.imdb.com/name/nm3667291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDAyNTY0Ml5BMl5BanBnXkFtZTgwNDkzODEzNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1988","placeOfBirth":" Oklahoma City, Oklahoma, USA","height":"5' 9\" (1.75 m)","bio":"Thomas Miguel Rivas was born July 9, 1988 in Oklahoma City to Julio and Christina Rivas. He started acting at the age of five, has starred in numerous plays through his school-years. In high-school he starred in The Rainmaker, Bye Bye Birdie, Edgar Allen Poe's Nevermore , The Day they Shot John Lennon, Night of the Living Dead, and eventually as Romeo in Romeo And Juliet. He has won various acting awards such as the Marilyn Moon Foundation Acting Award, OECU Fine Arts Award, (2) All-Star Cast Awards in regional competitions. He is the oldest of four children, two sisters (Alexia Rivas, and Ariel Rivas) one brother (Cesar Rivas). At the age 16 he attended at acting convention called Reel to Real 2005 were he met actor Rex Linn in a workshop, and decided it was time to get an agent! He walked into Magna Talent Agency founded by Margie Madden and asked for representation. She wanted him to take a class called Intro to Film Acting. That class is were he found his long time friend and Manager Michelle Delong. He went on to graduate from Northwest Classen HighSchool in 2006 with a Certificate of Distinction and GPA of 3.9875. Two weeks after becoming represented by Magna Thomas landed a training video for 7-eleven convenience stores. It seemed to have a snowball effect for Thomas because he went on to film a training video for Express Personnel Services then a big break came when he booked a principal role in a regional video and commercial for Gear Up. This new found stardom continued with radio voice overs and magazine print ads , Internet , and billboards! He was the face of Gear Up and continued landing roles for various commercials OSRH Education, WIC Psa Tv, Micheal Brooks Jiminez, I-35 Auto Mall, Joey Chiaf, Ocean Dental,Riverwind Casino,Winstar Casino, Remington Park Casino, Hard Rock Casino, Spokies, Kevin Durants MVP Speech, Bob Moore Honda and many more. He had his first chance to be in a big budget production on the set of Ivory. A film starring Beau Garret (Turistas,Fantastic four 2: Rise of Silver Surfer) Travis Fimmel (Calvin Klein Model). Upon his acting success Thomas landed a principal role in a television film Another Family Show produced by Freestyle Productions. Later on he landed a principal role in the U.S Army film Danger Close, and two years later a role in Backbone of the Army. His more recent ventures include an interview with Univision Network, Videos for Oklahoma City Public Schools produced by Almeida Productions, and also the film America directed by John Sullivan. He also graduated from Oklahoma Community College with a degree in Film and Video Production. He is now 27 years old and is married to Lorena Rivas, has 2 daughters the oldest named Eliana Rivas which is 5 years old and started her acting career as the promo figure for Life Church and has a web show on YOUTUBE, and his youngest daughter is Evelynn Sofia Rivas and a step-son named Josue Valle . He still resides in Oklahoma City and is finished working on his directorial debut called: Dawn of a New Age: The Day Walkers: a zombie film that shows the bond and struggle for survival that people make in a post-apocalyptic world. In December of 2014, Thomas started up a production company called Rivas Enterprise Films and has produced a short film called Labyrinth of Horror, and is working on a feature film called No Mans Land set to hit theaters in 2017! His company was hired in late 2015 to film behind the scenes of the film Gosnell. Also, he played the Lead DEA agent and just wrapped the film Gosnell starring Dean Cain. They will attend the Red Carpet Premier in Los Angeles in summer or fall of 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDAyNTY0Ml5BMl5BanBnXkFtZTgwNDkzODEzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3667291","name":"Thomas Rivas","nicknames":["Tommy"],"idIMDB":"nm3667291"},"actorId":"nm3667291","character":"Movie theatre Patron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Pinckard","urlProfile":"http://www.imdb.com/name/nm2365982","urlPhoto":"","biography":{"bio":"Paul Pinckard is known for his work on Dancing with the Stars (2005), Without Paris (2008) and Ivory (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2365982","name":"Paul Pinckard","idIMDB":"nm2365982"},"actorId":"nm2365982","character":"Iago","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1051340","urlIMDB":"http://www.imdb.com/title/tt1051340","business":{"budget":{"money":"$1,300,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.66 : 1"],"camera":["Arriflex 416, Cooke S4 Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":null,"negativeFormat":["16 mm (Kodak Vision2 500T 7218)"],"cinematographicProcess":["Digital Intermediate (master format)","Super 16 (source format)"],"printedFilmFormat":null},"rating":"6.7","filmingLocations":[{"location":"Budapest, Hungary"}],"awards":[{"award":"Montréal World Film Festival 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Zenith","categories":[{"category":"","names":[{"name":"Andrew W. Chan","id":"nm1793317","role":null}]}]}]}],"votes":"64","type":"Movie","companyCreditsSimple":[{"idCompany":"co0213381","name":"Ivory Tower Productions"}],"keywords":{"keywords":["pubic hair","male pubic hair","male nudity","piano competition","oberlin conservatory of music","refrence to vladimir samoylovich horowitz","sun tzu quotation","close up of hands"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:50:54"}}