{"data":{"movies":[{"title":"Direct Contact","originalTitle":"","year":"2009","releaseDate":"20090820","directors":[{"name":"Danny Lerner","id":"nm0503600"}],"writers":[{"name":"Danny Lerner","id":"nm0503600"},{"name":"Les Weldon","id":"nm0002659"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NjQwNjEwNF5BMl5BanBnXkFtZTcwODQxOTU1Mg@@._V1.jpg","countries":["Bulgaria","Germany"],"languages":["English","Bulgarian"],"genres":["Action","Thriller"],"plot":"Mike Riggins, an imprisoned ex-US Special forces operative in Eastern Europe, is offered his freedom and money to rescue an American woman, Ana Gale, who has been kidnapped by a ruthless warlord. But, shortly after freeing her, Mike discovers that the kidnap story was just a ruse to bring Ana out into the open. Our hero suddenly finds himself and his charge being hunted by ruthless government, para-military, and underworld organizations - all who want him dead and Ana under their control. With no one to turn to, and the enemies closing in, Mike must uncover the truth about Ana and bring her to the safety of the U.S. Embassy.","simplePlot":"An American prisoner in a Russian jail is given a chance at freedom if he can rescue a kidnapped American woman.","actors":[{"actorName":"Dolph Lundgren","urlProfile":"http://www.imdb.com/name/nm0000185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1957","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Hans Lundgren","height":"6' 5\" (1.96 m)","bio":"Dolph Lundgren was born in Stockholm, Sweden, to Sigrid Birgitta (Tjerneld), a language teacher, and Karl Johan Hugo Lundgren, an engineer and economist for the Swedish government. He lived in Stockholm until the age of 13, when he moved in with his grandparents in Nyland, Ångermanland, Sweden. Despite an early interest in music and the fine arts, Dolph decided to follow in his father's footsteps and pursue an Engineering degree. After having completed his military service, he enrolled at the Royal Institute of Technology in Stockholm. It was in the military when Dolph first came in contact with the martial arts. Five years later, Dolph had become a World-Class competitor in Japanese Karate and was deeply involved with a discipline that was to become an important part of his life. After graduating High School, Dolph spent considerable time studying in the United States and abroad on various academic scholarships. He attended Washington State University and Clemson University in South Carolina. In 1982, he received a scholarship to complete his Masters Degree in Chemical Engineering at the University of Sydney, Australia. In 1983, he was awarded a Fulbright scholarship to the Massachusetts Institute of Technology in Boston, one of the world's top engineering schools. That same year, Dolph decided to move to New York City and take up acting. He started studying drama at the Warren Robertson Theatre Workshop in Manhattan, not knowing how quickly his life was about to change. Dolph's motion picture debut came in the \"James Bond\" feature, A View to a Kill (1985). However, it was his performance in Rocky IV (1985) later that year that definitely got him noticed. After a 9-month audition process among 5,000 hopefuls, he was cast opposite writer-director Sylvester Stallone, as his Russian opponent, \"Ivan Drago\". Following the success of Rocky IV (1985), Lundgren moved to Los Angeles and has since starred in more than thirty feature films. Lundgren portrayed the classic action-heroic lead in such films as Gary Goddard's Masters of the Universe (1987), Showdown in Little Tokyo (1991) co-starring Brandon Lee and Blackjack (1998), by Hong-Kong action legend, John Woo. Lundgren has also continued to turning in memorable performances as the main adversary to other action-stars, most notably in Universal Soldier (1992) opposite Jean-Claude Van Damme, directed by Roland Emmerich, as well as Robert Longo's Johnny Mnemonic (1995) opposite Keanu Reeves. In February 2004, Dolph Lundgren directed his first feature film, the thriller The Defender (2004), in which he also starred. In 2005, he directed and starred in yet another feature, The Russian Specialist (2005) (a.k.a \"The Russian Specialist\"). In January 2006, he finished principal photography of The Final Inquiry (2006), an Italian/American/Spanish co-production, directed by Giulio Base, in which he played against, amongst others, Daniele Liotti, Max von Sydow and F. Murray Abraham. In the fall 2006, Lundgren starred in Diamond Dogs (2007), a Chinese/American co-production filmed on location in Mongolia. In the Spring 2007, he directed a modern day western shot in Texas, Missionary Man (2007). In 2009, he completed two new directorial efforts, the action-packed Command Performance (2009), which showcases Lundgren's longtime musical talents as a drummer; and the neo-noir thriller The Killing Machine (2010). Lundgren also reunited with co-stars Jean-Claude Van Damme and Sylvester Stallone for Universal Soldier: Regeneration (2009) and the highly anticipated action blockbuster, The Expendables (2010). Dolph has managed to not let his Hollywood career stand in the way of his athletic background. He has been awarded his Third Degree Black Belt by the World Karate Organization in Tokyo. His accomplishments include being the Captain of the Swedish National Karate Team, as well as a Champion of the Swedish, European and Australian Heavyweight Division titles. Lundgren still regularly performs Karate exhibitions at international tournaments worldwide. In addition to his Karate expertise, Dolph was selected by the U.S. Olympic Committee to serve as the Team Leader of the 1996 U.S. Olympic Pentathlon Team during the Atlanta Games. He is actively involved in promoting the image of this sport. Lundgren's production company, Thor Pictures, is developing several projects in which he will produce, star and/or direct. He is also a founding member of \"Group of Eight\", a New York theater group started in 1994. Lundgren has also been working on a fitness book and sports wear line for men, the creation and launch of a new Dolph Lundgren brand, a licensing, media and publishing program and the development of future entertainment and media projects. Lundgren is married to Anette Qviberg-Lundgren, an interior decorator and fashion designer. The couple, along with their two daughters, resides in Marbella, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000185","name":"Dolph Lundgren","idIMDB":"nm0000185"},"actorId":"nm0000185","character":"Mike Riggins","urlCharacter":"http://www.imdb.com/character/ch0217049","main":true},{"actorName":"Gina May","urlProfile":"http://www.imdb.com/name/nm0561956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWRjNGJjNGUtYTM1Ny00ZDkyLTg1MDgtZTg0ZGNmYjRmZDFkL2ltYWdlXkEyXkFqcGdeQXVyMTUwNDQxMzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1974","placeOfBirth":" USA","birthName":"Gina Marie May","height":"5' 8\" (1.73 m)","bio":"Gina May was born on November 30, 1974 in the USA as Gina Marie May. She is an actress, known for Malibu, CA (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWRjNGJjNGUtYTM1Ny00ZDkyLTg1MDgtZTg0ZGNmYjRmZDFkL2ltYWdlXkEyXkFqcGdeQXVyMTUwNDQxMzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0561956","name":"Gina May","idIMDB":"nm0561956"},"actorId":"nm0561956","character":"Ana Gale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Paré","urlProfile":"http://www.imdb.com/name/nm0001595","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzNDQxNjI1OF5BMl5BanBnXkFtZTcwMjA1OTE3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1958","placeOfBirth":" Brooklyn, New York, USA","birthName":"Michael Kevin Pare","height":"6' 1\" (1.85 m)","bio":"Michael Kevin Paré was born on October 9, 1958 in Brooklyn, New York City, to Joan (Moroney) and Francis Paré, who owned print shops. His father died of leukemia when Paré was five, leaving his mother to raise their large family of children. Paré was working as a chef in New York City when an agent, Yvette Bikoff, convinced him to try acting. Paré's first starring role was as Tony Villcana on the television series The Greatest American Hero (1981). His well-known film roles were as Eddie Wilson in Eddie and the Cruisers (1983) and its sequel Eddie and the Cruisers II: Eddie Lives! (1989), as well as Streets of Fire (1984) and The Philadelphia Experiment (1984). Other films include Moon 44 (1990), Village of the Damned (1995), Bad Moon (1996), Hope Floats (1998) and The Virgin Suicides (1999). On television, Paré starred with Michael Beck on the CBS police drama Houston Knights (1987), as well as the short lived science fiction series Starhunter (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzNDQxNjI1OF5BMl5BanBnXkFtZTcwMjA1OTE3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001595","name":"Michael Paré","idIMDB":"nm0001595"},"actorId":"nm0001595","character":"Clive Connelly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bashar Rahal","urlProfile":"http://www.imdb.com/name/nm0706666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgzODQ2NTY5N15BMl5BanBnXkFtZTcwODcxMDIwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1974","placeOfBirth":" Dubai, United Arab Emirates","height":"6' (1.83 m)","bio":"Bashar Mounzer Rahal is the second child to a Bulgarian mother Mariana Rahal - an interior designer and Lebanese father Mounzer Rahal - an OB/GYN. The family moved back to Bulgaria when Bashar was only 6 years old. He first started acting in TV sketches when he was 12. At the age of 14 he became a member of a professional theater group, called \"Tears and Laughs\", with which he took part in more than 15 performances including Shakespeare and Chekhov. He attended numerous international festivals, including the ones in Avignon, France and Thun, Switzerland among others. His first big screen role at the age of 15 was in 1952: Ivan i Aleksandra (1989) which was followed by more TV and Film appearances. After graduating from The First English Language High School in Sofia, Bashar attended the National Academy of Theater and Film Art, where he received his Masters in Dramatic Arts. Shortly after graduation he was accepted as a permanent member of the national youth theatre and was a guest actor at The National Theatre Sofia Bulgaria. For the next couple of years Bashar appeared in over 25 different TV comedy shows, but became most popular with the hit TV show \"It Can't Be\"equivalent of SNL ,created & directed by Nellie Andreeva .The show won \" Golden Melon\", for best comedy show - the most prestigious TV award in Bulgaria. In 1997 Bashar hosted \"The Late Night Show\" on Channel 3 Sofia , where he met his co-host and future wife Kalina Rahal. In 1999 the couple moved to California so that Bashar could pursue his acting career. He was granted Alien of Extra Ordinary ability as an actor. He is a graduate from the Lee Strasberg Theatre and Film Institute in Los Angeles. For a long time he was considered to play Azamat Bagatov in Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan. Initially Bashar was not considered to play in Joshua Seftel's Political Satire War ,Inc. but the producers Danny Lerner and Les Weldon convinced both John Cusack and the Director Seftel that he is the best choice for the part. After the end of the shooting Cusack and Seftel admitted that Bashar had developed the best character. Later Danny Lerner casted Bashar as a lead in his upcoming action movie Direct Contact. Recently he was casted to play Boris in Dominic Sena's \"Whiteout\",starring Kate Beckinsale.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgzODQ2NTY5N15BMl5BanBnXkFtZTcwODcxMDIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0706666","name":"Bashar Rahal","idIMDB":"nm0706666"},"actorId":"nm0706666","character":"General Drago","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Chalke","urlProfile":"http://www.imdb.com/name/nm0149949","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmFjZWZlYmItYmE1MS00NGUyLTgxNDUtYjNlOTQ0NWMwYTY1XkEyXkFqcGdeQXVyMTQ5MDEyOTY@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"birthName":"James Grenville Chalke","height":"6' 4\" (1.93 m)","bio":"James Grenville Chalke was born in India and raised in England. Growing up he was schooled in London and graduated with a college degree. After graduating, he joined the British Special Forces where he spent most of his time in the Middle-East. Following his military tour, he pursued multiple avenues of the entertainment business, focusing on restaurants and night clubs. James excelled in this field and eventually found himself the owner of five restaurant / night clubs in London and northern England. In 1981, James decided to make the move to the United States, more specifically Los Angeles. It was this move that made it possible for him to pursue his long time passion for acting. He started his studies under various renowned instructors, concentrating on theatre and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmFjZWZlYmItYmE1MS00NGUyLTgxNDUtYjNlOTQ0NWMwYTY1XkEyXkFqcGdeQXVyMTQ5MDEyOTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0149949","name":"James Chalke","idIMDB":"nm0149949"},"actorId":"nm0149949","character":"Trent Robbins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vladimir Vladimirov","urlProfile":"http://www.imdb.com/name/nm1152382","urlPhoto":"","biography":{"bio":"Vladimir Vladimirov is known for his work on The Expendables 2 (2012), The Expendables 3 (2014) and Undisputed 3: Redemption (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1152382","name":"Vladimir Vladimirov","idIMDB":"nm1152382"},"actorId":"nm1152382","character":"Vlado Karadjov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raicho Vasilev","urlProfile":"http://www.imdb.com/name/nm0890501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY3MTUwMzA0OV5BMl5BanBnXkFtZTgwNjg4NTA2MTE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1975","placeOfBirth":" Smolian, Bulgaria","height":"6' 0½\" (1.84 m)","bio":"Raicho Vasilev is a Bulgarian stuntman and actor best known for his appearances in high profile screen projects as Conan the Barbarian (2011) and both Roman period television dramas Spartacus: Gods of the Arena (2011) and Spartacus: War of the Damned (2010). Born September 17, 1975 in Smolian, Bulgaria, the 24-year-old Raicho Vasilev started his film career with stunt work for the film Operation Delta Force 4: Deep Fault (1999). From that point on, Vasilev has made an impressive career between stunt work and acting, often using his tough, athletic presence to portray guards, soldiers and villains. Films in which Raicho has contributed stunt work or acting time to include Undisputed 2: Last Man Standing (2006), The Chronicles of Narnia: Prince Caspian (2008), Ninja (2009) and The Expendables 2 (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY3MTUwMzA0OV5BMl5BanBnXkFtZTgwNjg4NTA2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0890501","name":"Raicho Vasilev","idIMDB":"nm0890501"},"actorId":"nm0890501","character":"Boris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nikolay Stanoev","urlProfile":"http://www.imdb.com/name/nm2889301","urlPhoto":"","biography":{"bio":"Nikolay Stanoev is an actor, known for The Way Back (2010), The Expendables 3 (2014) and Conan the Barbarian (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2889301","name":"Nikolay Stanoev","idIMDB":"nm2889301"},"actorId":"nm2889301","character":"Gun Dealer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Straub","urlProfile":"http://www.imdb.com/name/nm2467178","urlPhoto":"","biography":{"dateOfBirth":"24 March 1977","placeOfBirth":" Oviedo, Florida, USA","birthName":"Michael Gene Straub","height":"6' (1.83 m)","bio":"Mike Straub was born on March 24, 1977 in Oviedo, Florida, USA as Michael Gene Straub. He is an actor, known for The Grudge 3 (2009), The Hills Run Red (2009) and Wrong Turn 3: Left for Dead (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2467178","name":"Mike Straub","idIMDB":"nm2467178"},"actorId":"nm2467178","character":"Lead Marine Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Les Weldon","urlProfile":"http://www.imdb.com/name/nm0002659","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODY4MDA2N15BMl5BanBnXkFtZTcwOTQyODQ5MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Les Weldon (producer) Writer/producer whose diverse portfolio includes action films, thrillers, comedies, sci-fi, fantasy, and family movies. His writing and producing credits include more than 45 films starring such actors as Robert DeNiro, John Travolta, Sylvester Stallone, Arnold Schwarzenneger, Gerrard Butler, Bruce Willis, Jason Statham, Chuck Norris, Sir Ben Kingsley, Morgan Freeman, John Cusack, Antonio Banderas, Dolph Lundgren, Jean-Claude Van Damme and Jet Li among others. Born and raised in Brazil, Les came to America when he was fifteen and graduated from Laguna Beach High School in Southern California. Les attended the University of Southern California where he majored in Business Administration, with electives in Film. Les' notable productions include the $800 million world-wide box-office franchise of \"Expendables 1, 2 & 3\", \"London Has Fallen\", starring Gerrard Butler, \"Conan, the Barbarian\", \"Hercules\", \"The Code\" starring Morgan Freeman and Antonio Banderas, \"War, Inc.\" with John Cusack and Sir Ben Kingsley, and \"Automata\" starring Antonio Banderas. Les is currently filming \"The Hitman's Bodyguard\", starring Ryan Reynolds, Samuel Jackson, and Gary Oldman. Up next is \"Hunter Killer\", starring Gerrard Butler. Les lives in Sofia, Bulgaria. As of 5/10/2016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODY4MDA2N15BMl5BanBnXkFtZTcwOTQyODQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002659","name":"Les Weldon","idIMDB":"nm0002659"},"actorId":"nm0002659","character":"Anchorman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yoan Petrov","urlProfile":"http://www.imdb.com/name/nm2547586","urlPhoto":"","biography":{"bio":"Yoan Petrov is an actor, known for Direct Contact (2009) and Trois femmes (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2547586","name":"Yoan Petrov","idIMDB":"nm2547586"},"actorId":"nm2547586","character":"Vlado's Son","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Uti Bachvarov","urlProfile":"http://www.imdb.com/name/nm1714644","urlPhoto":"","biography":{"bio":"Uti Bachvarov is an actor, known for Company of Heroes (2013), Direct Contact (2009) and Boa vs. Python (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1714644","name":"Uti Bachvarov","idIMDB":"nm1714644"},"actorId":"nm1714644","character":"Zoran Posternoff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Kadiev","urlProfile":"http://www.imdb.com/name/nm3079324","urlPhoto":"","biography":{"bio":"Alexander Kadiev is an actor, known for Zift (2008), Direct Contact (2009) and Glass Home (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3079324","name":"Alexander Kadiev","idIMDB":"nm3079324"},"actorId":"nm3079324","character":"Chopper Pilot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teodor Tsolov","urlProfile":"http://www.imdb.com/name/nm1352136","urlPhoto":"","biography":{"dateOfBirth":"7 March 1980","placeOfBirth":" Sofia, Bulgaria","birthName":"Teodor Tzolov","height":"5' 6½\" (1.69 m)","bio":"Teodor Tsolov was born on March 7, 1980 in Sofia, Bulgaria as Teodor Tzolov. He is known for his work on Mission: Impossible - Rogue Nation (2015), Inferno (2016) and 300: Rise of an Empire (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1352136","name":"Teodor Tsolov","idIMDB":"nm1352136"},"actorId":"nm1352136","character":"Janitor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marianne Stanicheva","urlProfile":"http://www.imdb.com/name/nm0821988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjM5NDcwNV5BMl5BanBnXkFtZTcwMTc2OTkxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Marianne Stanicheva is a casting director and actress, known for The Expendables 2 (2012), The Expendables 3 (2014) and London Has Fallen (2016). She has been married to John Cappilla since December 8, 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjM5NDcwNV5BMl5BanBnXkFtZTcwMTc2OTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0821988","name":"Marianne Stanicheva","idIMDB":"nm0821988"},"actorId":"nm0821988","character":"Screaming Woman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1182609","urlIMDB":"http://www.imdb.com/title/tt1182609","business":{"budget":{"money":"$6,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":"13","month":"09","year":"2009","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2008/\">2008</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arricam Cameras, Zeiss and Angenieux Lenses"],"laboratory":["Boyana Film Laboratory, Sofia, Bulgaria"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm (spherical)"]},"rating":"4.3","filmingLocations":[{"location":"Bulgaria"}],"rated":"R","awards":[],"votes":"2,405","type":"Movie","companyCreditsSimple":[{"idCompany":"co0024720","name":"Nu Image / Millennium Films"},{"idCompany":"co0024720","name":"Nu Image / Millennium Films"},{"idCompany":"co0164504","name":"Höger Human Service Medien & Personal GmbH"}],"keywords":{"keywords":["american","rescue","hero","police brutality","fighting","traitor","blood","kickboxing","karate kick","karate","cult film","prison brawl","prison cell","prison violence","combat","hand to hand combat","mixed martial arts","fistfight","brawl","semiautomatic pistol","pump action shotgun","disarming someone","gunfight","showdown","tough guy","one against many","one man army","action hero","evil man","violence","corrupt businessman","rogue agent","car accident","car crash","product placement","overturning car","father daughter relationship","exploding truck","exploding building","exploding car","breaking a bottle over someone's head","knocked out with a gun butt","taxi","rocket launcher","grenade launcher","oil tycoon","billionaire","patricide","limousine","gas station","bus","train","train station","general","stadium","restaurant","helicopter","tank","body in trunk","sniper rifle","sniper","pistol","kicked in the crotch","shot in the face","shot in the arm","shot in the shoulder","shot to death","shot in the chest","exploding body","neck breaking","shootout","machine gun","ak 47","tracking device","cell phone","military","soldier","kidnapping","barbed wire","shot in the head","shot in the forehead","flashlight","bomb","military base","double cross","betrayal","arms dealer","american embassy","cia","government agent","eye patch","held at gunpoint","nightclub","kicked in the face","beaten to death","punched in the face","stabbed in the eye","kicked in the chest","bare chested male","martial arts","prison fight","prison","on the run","murder","motorcycle","mercenary","heiress","hand grenade","fight","explosion","ex marine","car chase","balkan","surprise ending","karate chop"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:09:48"}}