{"data":{"movies":[{"title":"Gym Teacher: The Movie","originalTitle":"","year":"2008","releaseDate":"20080912","directors":[{"name":"Paul Dinello","id":"nm0227576"}],"writers":[{"name":"Daniel Altiere","id":"nm1662741"},{"name":"Steven Altiere","id":"nm1662742"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MDkyNTk5OF5BMl5BanBnXkFtZTcwMzU4MjgyMg@@._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Comedy"],"plot":"Roland (\"iCarly's\" Nathan Kress) is the new kid at Hamm Lake Middle School and there's just no hiding he's a super geek with no athletic ability. Dave Stewie (Emmy? Award-Nominee Christopher Meloni) is the school's beloved gym teacher who once represented the U.S. in the Seoul Games, but his disastrous go-for-the-gold vault became one of sport's biggest bloopers. After pressure to compete in th...","simplePlot":"Roland (\"iCarly's\" Nathan Kress) is the new kid at Hamm Lake Middle School and there's just no hiding he's a super geek with no athletic ability. Dave Stewie (Emmy? Award-Nominee ... ","actors":[{"actorName":"Christopher Meloni","urlProfile":"http://www.imdb.com/name/nm0005221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODc0MTI2N15BMl5BanBnXkFtZTcwNDYwMjk3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1961","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Christopher Peter Meloni","height":"6' (1.83 m)","bio":"Blessed with a piercing, blue-eyed glint, brawny looks, cocky \"tough guy\" stance and effortless charisma, TV's Christopher Meloni has grabbed audiences' attention, male and female alike, finding breakthrough small screen stardom playing both sides of the law. Audiences first were taken in by his sexually arresting portrayal of a sociopathic killer in the gripping prison drama Oz (1997) on cable TV. Although his small screen roots were in 90s situation comedy, the network powers-that-be wisely discovered his power and allure as a dramatic star and quickly handed him his own prime-time crime series, Law & Order: Special Victims Unit (1999), as a not-quite-by-the-book crime detective. This one-two punch of \"Oz\" and \"Law & Order: SVU\" put Meloni, who seems to grow sexier with age, on the map and well on top, where he remains today. Christopher Peter Meloni was born on April 2, 1961, in Washington, D.C., the son of Cecile (Chagnon) and Robert Meloni, an endocrinologist. Of Italian and French-Canadian parentage, he attended St. Stephen's School and played quarterback for his high school team. Developing an interest in acting rather early in life, he attended the University of Colorado at Boulder following high school graduation. He initially majored in acting but wound up earning a degree in history in 1983. Acting won out in the long run, however, and Chris relocated to New York where he studied with acting guru Sanford Meisner at the renowned Neighborhood Playhouse. Supplementing his income during these lean years by taking advantage of his powerful physique (as construction worker, bouncer, personal trainer), Meloni worked his way up the acting ladder via parts in commercials. With a full head of hair in the early days, he broke into series TV in 1989, the first being the already-established cable football comedy 1st & Ten: The Championship (1984). In this sitcom, which was HBO's very first back in 1984, Chris played ex-con quarterback Vito Del Greco (aka \"Johnny Gunn\"). The series' star Delta Burke had already left the cast by the time Chris came aboard in its final season. A second sitcom arrived almost immediately with the stereotypical Italian family sitcom The Fanelli Boys (1990) featuring Chris as dim-eyed, skirt-chasing Frankie Fanelli, one of the four \"dees, dem and dos\" sons of Brooklynite widow Theresa Fanelli (Ann Morgan Guilbert). Despite a strong, boisterous cast, the show was painfully obvious and met an early demise. True to nature, Chris gave voice and added to the fun as a cocky, mooching high school teen who knows the \"how to's\" of attracting pretty girl dinos in the animated prehistoric series Dinosaurs (1991). He also made a manly mark in mini-movies with co-starring roles in such \"women\" dramas as In a Child's Name (1991) starring Valerie Bertinelli, Something to Live for: The Alison Gertz Story (1992), which top-lined Molly Ringwald, Without a Kiss Goodbye (1993) as the caring husband of Lisa Hartman, and the Connie Sellecca starrer A Dangerous Affair (1995). An interchangeable ability to convey both heartfelt sympathy and virile menace did not go by unnoticed. After minor parts on the big screen with Clean Slate (1994), Junior (1994) and Twelve Monkeys (1995), Chris drew strong notices in the featured role of gangster Johnnie Marzzone in the classic neo-noir Bound (1996), which earned cult status for its sexually-charged lesbian sub-storyline. A tough recurring part on \"NYPD Blue\", a typical mafia role in the mini-series The Last Don (1997) and another short-lived comedic series lead (Leaving L.A. (1997)) finally led to a big payoff in the brutal and brilliant cable series Oz (1997). Christopher's introduction to the Oz prison as bisexual psychopath Chris Keller was powerhouse casting and he drew immediate notice and critical applause into the show's second season. Unflinching in its blood-soaked presentation of life behind bars, Chris' raw animal magnetism was unparalleled on the show and his steamy, erotic couplings with another male prisoner on screen promoted him swiftly to gay icon status. Undaunted by the possible career-damaging effects that could occur, Chris' frank acceptance and acknowledgment was admirable indeed and his outright support of human rights causes earned him high marks. The father of two (daughter Sophia Eva Pietra (born March 23, 2001), and son Dante Amadeo (born January 2, 2004), he has been married since 1995 to production designer 'Sherman Williams' (The Dark Backward (1991)). Chris' sudden burst of cable notoriety earned him his own prime time NBC series. With the veteran \"Law & Order\" program developing a sister spin-off, Law & Order: Special Victims Unit (1999), Meloni raised the bar with his trenchant pairing with co-star Mariska Hargitay as partners of a special victims crime unit. Despite the show's reality-driven approach, Meloni and Hargitay's dynamite chemistry carried the show to a new level. Allowing their characters' more serious flaws to surface, Meloni, in particular, managed to convey Detective Stabler's private pain and personal turmoil with a raw poignancy. Both he and Hargitay have been honored with Emmy award nominations for their work here (she has won). Occasionally appearing on stage, Chris' theater credits include \"The Rainmaker\" (as Starbuck) (1998) and \"Comers\" (1998), both at the Williamstown Theatre Festival. He earned standout reviews as Eddie Carbone in Arthur Miller's \"A View from the Bridge,\" which he performed at Dublin's Gate Theatre in 2005. In 2006 he joined the campy proceedings at an Actors' Fund of America Benefit of the soap opera spoof \"Die, Mommie Die!\" starring drag illusionist and \"Oz\" alumnus Charles Busch. Going well over a decade's worth of service to the series that made him a household name, Meloni finally retired his TV detective in 2011. Throughout the show's run he continued to flaunt his humorous side, showing up on such parody shows as \"Mad TV\" and cracking up on the various night time TV haunts. On film he continues to shatter his dramatic image in such fare as The Souler Opposite (1998), Wet Hot American Summer (2001), Harold & Kumar Go to White Castle (2004) and its sequel Harold & Kumar Escape from Guantanamo Bay (2008). While he has not found outright stardom on the big screen (he has nominally played \"other man\" roles in such popular films as Runaway Bride (1999) and Nights in Rodanthe (2008)), Chris has more than proved his staying power since he left the popular series. More recently, he moved forward as a writer/producer/director/star of the comedy film Dirty Movie (2011), which also has in its cast \"L&O: SVU\" co-star Diane Neal. In addition, Chris supplied the voice of DC Comics classic character Hal Jordan (aka Green Lantern) in the animated movie Green Lantern: First Flight (2009). He also has held regular roles on the series True Blood (2008) in 2012 and Surviving Jack (2014) as well as strong cinematic parts in the Superman film Man of Steel (2013) and in Small Time (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODc0MTI2N15BMl5BanBnXkFtZTcwNDYwMjk3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005221","name":"Christopher Meloni","idIMDB":"nm0005221"},"actorId":"nm0005221","character":"Dave Stewie","urlCharacter":"http://www.imdb.com/character/ch0190172","main":true},{"actorName":"Nathan Kress","urlProfile":"http://www.imdb.com/name/nm0470941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcwMTk4NzY5N15BMl5BanBnXkFtZTgwNTM3MjUwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1992","placeOfBirth":" Glendale, California, USA","birthName":"Nathan Karl Kress","height":"5' 6½\" (1.69 m)","bio":"Known around the world for his lead role on Nickelodeon's hit show \"iCarly\", Nathan plays Freddie Benson, Carly's smitten next-door neighbor and technical producer of her web show. Now that iCarly has ended its stellar run, Nathan is breaking out into feature films, as a lead in \"Into the Storm,\" a Steve Quale tornado thriller for New Line Cinema, due to be released in August 2014. Born in Glendale, California, Nathan began acting at the age of three and quickly landed a feature film role as the voice of Easy the Chimp in \"Babe: Pig in the City.\" By fifth grade, he had landed a recurring role as a sketch performer on \"The Jimmy Kimmel Show\" playing various characters; one of his favorite being a young Simon Cowell of \"American Idol.\" Shortly thereafter, Nathan began to book guest-starring roles on such shows as \"Without a Trace,\" \"Standoff,\" \"The Suite Life of Zack and Cody,\" \"House MD,\" and \"Notes from the Underbelly.\" However, it was his guest role on Nickelodeon's top-rated show \"Drake and Josh\" that led the show's creator, Dan Schneider, to cast him in \"iCarly.\" Since then, Nathan has starred alongside Christopher Meloni in Nickelodeon's \"Gym Teacher: The Movie\" and has guest-starred on \"True Jackson, VP\" and \"CSI: Crime Scene Investigation.\" Recently, Nathan starred in NBC's movie for television, \"Game of Your Life,\" which revolved around college students studying video game design. His future plans are to continue acting and to attend college. As he is a die-hard Bruin fan, his number-one choice school is UCLA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcwMTk4NzY5N15BMl5BanBnXkFtZTgwNTM3MjUwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0470941","name":"Nathan Kress","idIMDB":"nm0470941"},"actorId":"nm0470941","character":"Roland","urlCharacter":"http://www.imdb.com/character/ch0067815","main":true},{"actorName":"Chelah Horsdal","urlProfile":"http://www.imdb.com/name/nm1319098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODA1NzI4Nl5BMl5BanBnXkFtZTgwNzAyOTY0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1973","placeOfBirth":" Vancouver Island, British Columbia, Canada","birthName":"Chelah P. Horsdal","height":"5' 9\" (1.75 m)","bio":"Chelah grew up in the Vancouver community of Kitsilano. At eighteen, by-way of modeling, Chelah appeared in a couple of locally shot TV shows and commercials before packing her bags and moving to the Caribbean for a year. Upon returning home to Canada, Chelah took the long route back to acting...restaurant management, interior design, creative director of a magazine, event production, voice agent....until finally returning to acting in 2002. Chelah then committed herself to full-fledged study of her chosen craft at Lyric School of Acting and immersed herself as a student in all there was to read, watch & soak up. She has since appeared in multiple films, television movies, TV series & over 75 commercials. Highlights have been numerous but, at the top of the list, has been working with Sir Ben Kinsley, Mandy Patinkin, Laurie Metcalf, Jean Reno, Jennifer Love Hewitt, John Lithgow & Paul Dinello....the list goes on and on. Despite a busy work schedule, Chelah continues to study whenever she can find the time. Teachers Larry Moss, John Cassini, Ben Ratner & Ivana Chubbuck, among others, offer inspiration and new approaches for the moving target of art. Although often working out of town, Chelah continues to proudly call Vancouver home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODA1NzI4Nl5BMl5BanBnXkFtZTgwNzAyOTY0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1319098","name":"Chelah Horsdal","idIMDB":"nm1319098"},"actorId":"nm1319098","character":"Winnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Sedaris","urlProfile":"http://www.imdb.com/name/nm0781238","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyNDE5NDg2OV5BMl5BanBnXkFtZTcwMDc0NDU5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1961","placeOfBirth":" Endicott, New York, USA","birthName":"Amy Louise Sedaris","height":"5' 1½\" (1.56 m)","bio":"Amy Sedaris was born on March 29, 1961 in Endicott, New York, USA as Amy Louise Sedaris. She is an actress and writer, known for Puss in Boots (2011), BoJack Horseman (2014) and Strangers with Candy (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyNDE5NDg2OV5BMl5BanBnXkFtZTcwMDc0NDU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781238","name":"Amy Sedaris","idIMDB":"nm0781238"},"actorId":"nm0781238","character":"Principal Hoffman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Dinello","urlProfile":"http://www.imdb.com/name/nm0227576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTAyMTYxM15BMl5BanBnXkFtZTYwNjQ1NDkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1962","placeOfBirth":" Chicago, Illinois, USA","height":"5' 9\" (1.75 m)","bio":"Paul Dinello was born on November 28, 1962 in Oak Park, Illinois. He is one of 5 children (one brother and three sisters). After graduating from DePaul University, he enrolled in the Second City Improvisation Troupe in Chicago. After taking a few classes, he auditioned to be in the touring company, where he met Stephen Colbert and Amy Sedaris. After Second City, he moved to New York, with Colbert and Sedaris, where they created the sketch comedy series Exit 57 (1995), for Comedy Central, with Mitch Rouse and Jodi Lennon. The show was on for two seasons (1995-1996). The show was nominated for five CableAce nominations for best writing, performing and best comedy series. Later he, Colbert, Sedaris, and Rouse created Strangers with Candy (1999) for Comedy Central. It spoofed after-school specials, where a problem would arise and be solved in a single show, with the twist that, on Strangers with Candy (1999), they learned all the wrong lessons. The show lasted for three seasons. Dinello directed and co-starred in the movie version, Strangers with Candy (2005). Dinello has appeared in several movies including Plump Fiction (1997) and Straight Talk (1992). He has also been on the New York stage, most notable was The Talent Family's \"Stitches\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTAyMTYxM15BMl5BanBnXkFtZTYwNjQ1NDkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0227576","name":"Paul Dinello","idIMDB":"nm0227576"},"actorId":"nm0227576","character":"Mr. Tipple","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brenna O'Brien","urlProfile":"http://www.imdb.com/name/nm1378650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwMjA2MDg2NV5BMl5BanBnXkFtZTgwMDAzMTg4ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1991","placeOfBirth":" Brampton, Ontario, Canada","bio":"Brenna O'Brien was born on March 9, 1991 in Brampton, Ontario, Canada. She is known for her work on Supernatural (2005), X-Men: L'affrontement final (2006) and Charlie St. Cloud (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwMjA2MDg2NV5BMl5BanBnXkFtZTgwMDAzMTg4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1378650","name":"Brenna O'Brien","idIMDB":"nm1378650"},"actorId":"nm1378650","character":"Morgan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Avan Jogia","urlProfile":"http://www.imdb.com/name/nm2240326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg4Mjg3MTQ4NV5BMl5BanBnXkFtZTgwNzU0Njc4OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1992","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Avan Tudor Jogia","height":"5' 10\" (1.78 m)","bio":"Vancouver native, Avan Jogia landed his first acting role as 'Danny Araujo 'on the award-winning TV movie drama \"A Girl like Me: The Gwen Araujo Story,\" directed by Oscar nominee Agnieszka Holland. Jogia followed up with a recurring role on the SyFy Channel hit series \"Caprica,\" as well as becoming series regular role the CW's \"Aliens in America.\" Recently receiving notice amongst a wide audience with his lead role as Beck on Nickelodeon's Emmy nominated series \"Victorious,\" Avan can now be seen as Danny Desai on ABC Family's \"Twisted.\" Having a special interest in youth human rights and equality, Avan lends his support to many charitable organizations: as a Peace First Ambassador for Peacefirst.org, host of the PBS series \"Reel Works,\" and founder of the national charitable organization Straight But Not Narrow.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg4Mjg3MTQ4NV5BMl5BanBnXkFtZTgwNzU0Njc4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2240326","name":"Avan Jogia","idIMDB":"nm2240326"},"actorId":"nm2240326","character":"Champ","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jordan Becker","urlProfile":"http://www.imdb.com/name/nm1158397","urlPhoto":"","biography":{"dateOfBirth":"12 December 1985","placeOfBirth":" Rosthern, Saskatchewan, Canada","height":"5' 11\" (1.8 m)","bio":"Jordan Becker was born on December 12, 1985 in Rosthern, Saskatchewan, Canada. He is an actor, known for Red Riding Hood (2011), Says Who? (2012) and The Incredible Elephant (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1158397","name":"Jordan Becker","idIMDB":"nm1158397"},"actorId":"nm1158397","character":"Derek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Kattan","urlProfile":"http://www.imdb.com/name/nm0441592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTEzOTU5OV5BMl5BanBnXkFtZTcwOTg2ODY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1970","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Lee Kattan","height":"5' 5½\" (1.66 m)","bio":"Christopher Lee Kattan was born in Sherman Oaks, California, to model Hajni Joslyn and actor Kip King. Chris moved to Mt. Baldy when he turned five, and resided there until the age of fifteen, when he moved to Bainbridge Island, Washington for high school. After he graduated from high school, Chris moved to the L.A. area to join up with the improv/sketch comedy group \"The Groundlings\". He became a featured player on Saturday Night Live (1975) in March of 1996, and a cast member in September of the same year. He remained on the show until May 2003. Chris lives in the Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTEzOTU5OV5BMl5BanBnXkFtZTcwOTg2ODY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441592","name":"Chris Kattan","idIMDB":"nm0441592"},"actorId":"nm0441592","character":"Sploopers Show Host","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted Whittall","urlProfile":"http://www.imdb.com/name/nm0926471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjc5MTI3OV5BMl5BanBnXkFtZTgwMTQyNDcyNjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Ted Whittall is an actor, known for Suicide Squad (2016), Wicker Park (2004) and The Bone Collector (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjc5MTI3OV5BMl5BanBnXkFtZTgwMTQyNDcyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926471","name":"Ted Whittall","idIMDB":"nm0926471"},"actorId":"nm0926471","character":"The President","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stefanie Samuels","urlProfile":"http://www.imdb.com/name/nm1077843","urlPhoto":"","biography":{"bio":"Stefanie Samuels is an actress, known for The Day the Earth Stood Still (2008), Four Brothers (2005) and Kal Ho Naa Ho (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1077843","name":"Stefanie Samuels","idIMDB":"nm1077843"},"actorId":"nm1077843","character":"Bartender #1 - Chin-Up Bar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Pickett","urlProfile":"http://www.imdb.com/name/nm0681918","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTMzNTAxMV5BMl5BanBnXkFtZTgwNDg0ODEyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Tom Pickett is an actor, known for Percy Jackson & the Olympians: The Lightning Thief (2010), Love Happens (2009) and Ramona and Beezus (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTMzNTAxMV5BMl5BanBnXkFtZTgwNDg0ODEyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0681918","name":"Tom Pickett","idIMDB":"nm0681918"},"actorId":"nm0681918","character":"Mr. Chesterfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ellie Harvie","urlProfile":"http://www.imdb.com/name/nm0367762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjE5MjIxN15BMl5BanBnXkFtZTgwMjE0Mjc1MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1965","placeOfBirth":" Belleville, Ontario, Canada","birthName":"Elinor Anne Harvie","height":"5' 8½\" (1.74 m)","bio":"Ellie Harvie was born on April 7, 1965 in Belleville, Ontario, Canada as Elinor Anne Harvie. She is an actress and writer, known for La nouvelle famille Addams (1998), The Cabin in the Woods (2012) and Happy Gilmore (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjE5MjIxN15BMl5BanBnXkFtZTgwMjE0Mjc1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367762","name":"Ellie Harvie","idIMDB":"nm0367762"},"actorId":"nm0367762","character":"Ms. Schoenborn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Alan Grier","urlProfile":"http://www.imdb.com/name/nm0004979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTg4OTU0OF5BMl5BanBnXkFtZTYwMjUyMDE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1955","placeOfBirth":" Detroit, Michigan, USA","height":"6' 1½\" (1.87 m)","bio":"David Alan Grier was born in Detroit, Michigan, to Aretas Ruth (Dudley), a schoolteacher, and William Henry Grier, a psychiatrist and writer. He trained in Shakespeare at Yale University, where he received an MFA from the Yale School of Drama. Grier began his professional career on Broadway as Jackie Robinson in \"The First\", for which he earned a Tony nomination for Best Featured Actor in a Musical and won the Theatre World Award (1981). He then joined the Broadway cast of \"Dreamgirls\", before going on to star opposite Denzel Washington in \"A Soldier's Play\", for which both actors reprised their roles in the film adaptation titled A Soldier's Story (1984). He appeared in Robert Altman's Streamers (1983) as \"Roger\", a role for which he won the Golden Lion for Best Actor at the Venice Film Festival (1983). His television work is highlighted by a turn as a principal cast member on the Emmy Award-winning In Living Color (1990) (1990-1994), where he helped to create some of the show's most memorable characters, \"DAG\" (2000-2001) and \"Life with Bonnie\" (2002-2004), for which he earned Image and Golden Satellite nominations. David also created, wrote and executive-produced a show for Comedy Central called Chocolate News (2008). Grier also won America's votes as a smooth, debonair, and outrageously irreverent contestant on ABC's smash hit, Dancing with the Stars (2005), in 2009. But Grier didn't hang up his dance shoes just then - he later appeared in the Wayans Brothers' spoof movie, Dance Flick (2009), which hit theaters in May 2009. In Grier's first book, \"Barack Like Me: The Chocolate Covered Truth\" (Touchstone / Simon & Schuster; October 6, 2009), the acclaimed comedian expounds on politics, culture and race while recounting his own life story in this edgy, timely, timeless, and hilarious memoir and look at all things Barack Obama. Grier returned to his theatrical roots 2009/2010; he starred in David Mamet's acclaimed play, \"Race\", opposite James Spader and Kerry Washington, at the Ethel Barrymore Theatre on Broadway for which he received a Tony Award nomination. He has been named one of Comedy Central's \"100 Greatest Stand-ups of All Time\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTg4OTU0OF5BMl5BanBnXkFtZTYwMjUyMDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004979","name":"David Alan Grier","nicknames":["DAG","D.A.G."],"idIMDB":"nm0004979"},"actorId":"nm0004979","character":"Shelly Bragg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daran Norris","urlProfile":"http://www.imdb.com/name/nm0358460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMDI5NzgxODReQTJeQWpwZ15BbWU3MDY3MzY0MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1964","placeOfBirth":" Ferndale, Washington, USA","birthName":"Daran Morrison Nordland","height":"6' 2\" (1.88 m)","bio":"Daran Norris was born on November 1, 1964 in Ferndale, Washington, USA as Daran Morrison Nordland. He is an actor, known for The Fairly OddParents (2001), Team America: World Police (2004) and The Replacements (2006). He was previously married to Mary Elizabeth McGlynn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMDI5NzgxODReQTJeQWpwZ15BbWU3MDY3MzY0MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0358460","name":"Daran Norris","idIMDB":"nm0358460"},"actorId":"nm0358460","character":"Announcer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1167490","urlIMDB":"http://www.imdb.com/title/tt1167490","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":["Laser Pacific Media Corporation, Los Angeles (CA), USA (high definition laboratory) (as LaserPacific Media Corporation)"],"filmLength":["85 m"],"negativeFormat":["Digital"],"cinematographicProcess":["HDTV"],"printedFilmFormat":["Digital"]},"rating":"5.9","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"awards":[],"votes":"470","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0268859","name":"Pacific Bay Entertainment Canada"},{"idCompany":"co0265187","name":"Pacific Bay Entertainment"},{"idCompany":"co0317372","name":"Gym Teacher Productions"}],"keywords":{"keywords":["middle school","gym","gym teacher","victory","sports injury","doctor","mother son relationship","love","english teacher","rope climbing","gymnastics team","competition","gymnastics"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:50:00"}}