{"data":{"movies":[{"title":"The Five-Year Engagement","originalTitle":"","year":"2012","releaseDate":"20120427","directors":[{"name":"Nicholas Stoller","id":"nm0831557"}],"writers":[{"name":"Jason Segel","id":"nm0781981"},{"name":"Nicholas Stoller","id":"nm0831557"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDE1NTA3M15BMl5BanBnXkFtZTcwNDcwNTMxNw@@._V1.jpg","countries":["USA","Japan"],"languages":["English","Spanish"],"genres":["Comedy","Romance"],"plot":"In San Francisco, after a year's relationship, Tom proposes to Violet; she accepts. She's an experimental psychologist, hoping for a post-doc at Cal. He's a sous chef who runs the kitchen when the chef is away. When Cal falls through and she gets an offer in Ann Arbor, Tom agrees to support the move, turning down a job as chef at a new restaurant. The move requires postponing the wedding. At Michigan, Violet is in her element, but Tom is underemployed and frustrated; he's Stoic for a while, but when two years in Michigan become four, Tom's frustrations boil over, and on the eve of yet another wedding date, they must make a choice. Is there any other alternative?","simplePlot":"One year after meeting, Tom proposes to his girlfriend, Violet, but unexpected events keep tripping them up as they look to walk down the aisle together.","actors":[{"actorName":"Jason Segel","urlProfile":"http://www.imdb.com/name/nm0781981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzcxNzM1Nl5BMl5BanBnXkFtZTgwNzA5NzU4MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Jason Jordan Segel","height":"6' 4\" (1.93 m)","bio":"Multi-talented Jason Jordan Segel was born in Los Angeles, California, where he was raised by his parents, Jillian (Jordan), a homemaker, and Alvin Segel, a lawyer. His mother is of English, Scottish, and Irish ancestry, and his father is of Ashkenazi Jewish descent. He was educated at St. Matthew's Parish School in Pacific Palisades, before moving on to Harvard-Westlake School in Los Angeles. During his education he showed an interest in acting and often performed in plays at the Palisades Playhouse. His major break came in 1999, when he was cast as Nick Andopolis in Judd Apatow's well-regarded series Freaks and Geeks (1999). Further TV and film roles followed, notably in How I Met Your Mother (2005) and Knocked Up (2007). His film breakthrough, however, came in 2008's hit Forgetting Sarah Marshall (2008) which he wrote and starred in. Segel also went on to co-write and star in The Muppets (2011). Segel is also a musician and songwriter, with his songs appearing in many projects including Freaks and Geeks (1999), Forgetting Sarah Marshall (2008), I Love You, Man (2009), How I Met Your Mother (2005) and Get Him to the Greek (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzcxNzM1Nl5BMl5BanBnXkFtZTgwNzA5NzU4MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781981","name":"Jason Segel","idIMDB":"nm0781981"},"actorId":"nm0781981","character":"Tom Solomon","urlCharacter":"http://www.imdb.com/character/ch0283364","main":true},{"actorName":"Emily Blunt","urlProfile":"http://www.imdb.com/name/nm1289434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY4MTMzM15BMl5BanBnXkFtZTcwMjg5NzM2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1983","placeOfBirth":" Roehampton, London, England, UK","birthName":"Emily Olivia Leah Blunt","height":"5' 7\" (1.7 m)","bio":"Emily Olivia Leah Blunt is a British actress known for her roles in The Young Victoria (2009) and The Devil Wears Prada (2006). Blunt was born on February 23, 1983, in Roehampton, South West London, England, the second of four children in the family of Joanna Mackie, a former actress and teacher, and Oliver Simon Peter Blunt, a barrister. Her grandfather was Major General Peter Blunt, and her uncle is MP Crispin Blunt. Emily received a rigorous education at Ibstock Place School, a co-ed private school at Roehampton. However, young Emily Blunt had a stammer, since she was a kid of 8. Her mother took her to relaxation classes, which did not do anything. She reached a turning point at 12, when a teacher cleverly asked her to play a character with a different voice and said, \"I really believe in you\". Blunt ended up using a northern accent, and it did the trick, her stammer disappeared. From 1999 - 2001, Blunt went to Hurtwood House, the top co-ed boarding school where she would excel at sport, cello and singing. She also had two years of drama studies at Hurtwood's theatre course. In August 2000, she was chosen to perform at the Edinburgh Festival. She was signed up by an agent, Kenneth Mcreddie, who led her to the West End and the BBC, scoring her roles in several period dramas on stage as well as on TV productions, such as Foyle's War (2002), Henry VIII (2003) and Empire (2005). In 2001, she appeared as \"Gwen Cavendish\" opposite Dame Judi Dench in Sir Peter Hall's production of \"The Royal Family\" at Haymarket Theatre. For that role, she won the Evening Standard Award for Best Newcomer. In 2002, she played \"Juliet\" in \"Romeo and Juliet\" at the prestigious Chichester Festival. Blunt's career ascended to international fame after she starred as \"Isolda\" opposite Alex Kingston in Warrior Queen (2003). A year later, she won critical acclaim for her breakout performance as \"Tamsin\", a well-educated, cynical and deceptive 16-year-old beauty in My Summer of Love (2004), a story of two lonely girls from the opposite ends of the social heap. Emily Blunt and her co-star, Natalie Press, shared an Evening Standard British Film award for Most Promising Newcomer. In 2005, she spent a few months in Australia filming Irresistible (2006) with Susan Sarandon and Sam Neill. Blunt gave an impressive performance as \"Mara\", a cunning young destroyer who acts crazy and surreptitiously provokes paranoia in others. She also continued her work on British television, starring as \"Natasha\" in Stephen Poliakoff's Gideon's Daughter (2005), opposite Bill Nighy, a role that won her a 2007 Golden Globe Award for Best Performance by an Actress in a Supporting Role. She continued the line of playing manipulative characters as \"Emily\", a caustic put-upon assistant to Meryl Streep's lead in The Devil Wears Prada (2006). Blunt's performance with a neurotic twist added a dimension of sarcasm to the comedy, and gained her much attention as well as new jobs: in two dramas opposite Tom Hanks, then in the title role in the period drama, The Young Victoria (2009). Her most recent works include appearances as antiques dealer \"Gwen Conliffe\" in The Wolfman (2010) and as the ballerina in The Adjustment Bureau (2011). Emily Blunt is a highly versatile actress and a multifaceted person. Her talents include singing and playing cello; she is also skilled at horseback riding. She was in a relationship with Canadian singer Michael Bublé, whom she met at the Australian Logie Awards in 2005 and, again, a few months later, backstage at his Los Angeles concert. Their relationship ended in 2008. Blunt's friend, Anne Hathaway, introduced her to John Krasinski, and they have been together since November 2008. On August 28, 2009, Blunt and Krasinski announced their engagement. The couple married on July 10, 2010, at the estate of their friend, George Clooney, on Lake Como in Italy. Emily Blunt and John Krasinski are living in the Los Angeles area, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY4MTMzM15BMl5BanBnXkFtZTcwMjg5NzM2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1289434","name":"Emily Blunt","nicknames":["Em"],"idIMDB":"nm1289434"},"actorId":"nm1289434","character":"Violet Barnes","urlCharacter":"http://www.imdb.com/character/ch0277350","main":true},{"actorName":"Chris Pratt","urlProfile":"http://www.imdb.com/name/nm0695435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3MTgwOTgzMV5BMl5BanBnXkFtZTgwODIxMTUwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1979","placeOfBirth":" Virginia, Minnesota, USA","birthName":"Christopher Michael Pratt","height":"6' 2\" (1.88 m)","bio":"Christopher Michael Pratt is an American film and television actor. He came to prominence from his television roles, including Bright Abbott in Everwood (2002), Ché in The O.C. (2003), and Andy Dwyer and Parks and Recreation (2009), and notable film roles in Moneyball (2011), The Five-Year Engagement (2012), Zero Dark Thirty (2012), Delivery Man (2013), and Her (2013). In 2014, he broke out as a leading man after headlining two of the year's biggest films: he voiced Emmet Brickowoski, in The Lego Movie (2014), and starred as Peter Quill / Star-Lord in Guardians of the Galaxy (2014). In 2015, he headlined the sci-fi thriller Jurassic World (2015), the fourth installment in the Jurassic Park franchise and his most financially successful film. In 2016, he co-starred in the remake The Magnificent Seven (2016), with Denzel Washington and Ethan Hawke, and appeared with Jennifer Lawrence in the sci-fi drama Passengers (2016). In the near future, he returns as Star-Lord for Guardians of the Galaxy Vol. 2 (2017), with Untitled Jurassic World Sequel (2018) not far behind. He was born in Virginia, Minnesota, to Kathleen Louise (Indahl), who worked at a supermarket, and Daniel Clifton Pratt, who remodeled houses. His mother is of Norwegian descent and his father had English, German, Swiss, and French-Canadian ancestry. Chris grew up in Lake Stevens, Washington state. He is married to fellow Washington State native, Anna Faris, whom he met on the film set of Take Me Home Tonight (2011), and with whom he has one child, Jack Pratt. Chris's hobbies include fishing, hunting and working on cars. He has two older siblings, Cully and Angie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3MTgwOTgzMV5BMl5BanBnXkFtZTgwODIxMTUwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0695435","name":"Chris Pratt","nicknames":["Monkeyboy"],"idIMDB":"nm0695435"},"actorId":"nm0695435","character":"Alex Eilhauer","urlCharacter":"http://www.imdb.com/character/ch0292849","main":true},{"actorName":"Alison Brie","urlProfile":"http://www.imdb.com/name/nm1555340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDc2NjY1NF5BMl5BanBnXkFtZTcwMDY2MjE3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1982","placeOfBirth":" Los Angeles County, California, USA","birthName":"Alison Brie Schermerhorn","height":"5' 3\" (1.6 m)","bio":"Alison Brie was born in Hollywood, California, to Joanne (Brenner), who worked at a non-profit child care agency, and Charles Terry Schermerhorn, a musician and entertainment reporter. Her mother is Jewish and her father has Scottish, Dutch, English, German, and Norwegian ancestry. Brie grew up in the Los Angeles suburb of South Pasadena. Interested in acting at an early age, she began her career performing in community theater shows at the Jewish Community Center in Los Feliz. Her very first role was \"Toto\" in the Wizard of Oz. After graduating from South Pasadena High School in 2001; Alison attended California Institute of the Arts where she received her BFA in Acting. While there, she was one of the original cast members in the world premiere of The Peach Blossom Fan, performed as the inaugural theater production at Disney's REDCAT Theater in Downtown LA. During that time, Alison also studied at the Royal Scottish Academy of Music and Drama in Glasgow, Scotland. Since graduating, she has continued to work in all forms of media, including film, television, and theater. She has performed in the Blank Theater Company's Young Playwright's festival and in shows at the Odyssey, Write-Act, and Rubicon Theaters, receiving an Indy Award for her haunting performance as \"Ophelia\" in the Rubicon's production of Hamlet. She had performed guest spots for Comedy Central and Disney's Hannah Montana (2006) as well as leading roles in some independent films before landing her role on Mad Men (2007). Since then, she has continued to work in film and TV. Alison lives in South Pasadena.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDc2NjY1NF5BMl5BanBnXkFtZTcwMDY2MjE3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1555340","name":"Alison Brie","idIMDB":"nm1555340"},"actorId":"nm1555340","character":"Suzie Barnes-Eilhauer","urlCharacter":"http://www.imdb.com/character/ch0302355","main":true},{"actorName":"Lauren Weedman","urlProfile":"http://www.imdb.com/name/nm1017348","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgyNDQ4NTU0M15BMl5BanBnXkFtZTgwOTM5OTI5MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1969","placeOfBirth":" Seattle, Washington, USA","bio":"Lauren is an award winning comedic actress, playwright and author. Her first show, HOMECOMING began as a 15 minute performance art piece at Seattle's On the Boards and went on to go off-Broadway in NYC. BUST, about her work in the LA county jail was awarded a Macdowell fellowship for playwriting by the Alpert Awards as well as several 'best of the arts' across the nation. She has written and performed 9 solo plays. HOMECOMING, AMSTERDAM, IF ORNAMENTS HAD LIPS, HUU, RASH, WRECKAGE, BUST, NO...YOU SHUTUP-a piece commissioned by Boise Contemporary Theater and directed by Jeff Weatherford. Most recently THE PEOPLE'S REPUBLIC OF PORTLAND for Portland Center Stage. Her television credits include The Daily Show, True Blood, United States of Tara, Reno 911, Curb Your Enthusiasm, New Girl, Arrested Development, Horny Patty on HBO's HUNG. Film credits include Imagine That, Date Night and Judd Apatows \"A Five Year Engagement\" starring Jason Segal. Weedman's first book, A Woman Trapped in a Woman's Body: (Tales from a Life of Cringe), is a collection of comedic essays and was named by Kirkus Review as a top ten Indie book for 2007 and currently she is working on a second book of essays about for Plume due out 2014. Weedman lives in Santa Monica and is the host of the popular Moth Storytelling series in LA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgyNDQ4NTU0M15BMl5BanBnXkFtZTgwOTM5OTI5MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1017348","name":"Lauren Weedman","idIMDB":"nm1017348"},"actorId":"nm1017348","character":"Chef Sally","urlCharacter":"http://www.imdb.com/character/ch0443706","main":true},{"actorName":"Mimi Kennedy","urlProfile":"http://www.imdb.com/name/nm0448252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTE3NzU4OF5BMl5BanBnXkFtZTcwMjg4OTIzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1948","placeOfBirth":" Rochester, New York, USA","birthName":"Mary Claire Kennedy","bio":"Mimi Kennedy began her acting career on stage opposite famed TV comedian Sid Caesar. Her theater credits also include her work as Jan in both the national tour and the original Broadway production of \"Grease\". Work on television has been plentiful for Kennedy following her leading role on the critically acclaimed series, 3 Girls 3 (1977). She went on to star in Homefront (1991), for which she earned an American Television Award nomination for Best Supporting Actress. She's also worked behind the cameras as story editor for Knots Landing (1979). Kennedy has co-starred in a number of made-for-television movies and miniseries including Robert Kennedy and His Times (1985), Walt Disney's Wonderful World of Color: Mr. Boogedy (1986) and Walt Disney's Wonderful World of Color: Bride of Boogedy (1987) and the Peabody Award-winning adaptation of Beverly Cleary's _Mouse and the Motorcycle, The (1986) (TV)_. Feature film credits include Buddy (1997) and Death Becomes Her (1992). A graduate of Smith College, Kennedy is married and the mother of two. Her 1996 memoir, \"Taken to the Stage: The Education of an Actress\", continues to receive good notices from literary and entertainment critics.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTE3NzU4OF5BMl5BanBnXkFtZTcwMjg4OTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448252","name":"Mimi Kennedy","idIMDB":"nm0448252"},"actorId":"nm0448252","character":"Carol Solomon","urlCharacter":"http://www.imdb.com/character/ch0443707","main":true},{"actorName":"David Paymer","urlProfile":"http://www.imdb.com/name/nm0001601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjAwOTA5MF5BMl5BanBnXkFtZTYwODU4MjA1._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1954","placeOfBirth":" Oceanside, Long Island, New York, USA","birthName":"David Charles Paymer","height":"5' 7\" (1.7 m)","bio":"One of modern TV and moviedom's most sturdy and reliable character actors, David Paymer dreamed of being an actor from early childhood. Although he came from a traditional middle-class Jewish family that urged him to become a doctor or lawyer, Paymer felt more at home in the world of the thespian. At 14, he used a fake I.D. to see The Graduate, which starred a young Dustin Hoffman. He grew up in Oceanside, New York, where his father was in the scrap metal business. His mother, a homemaker, had fled Belgium with her family to escape the Nazis. When his father quit the scrap metal business to pursue music, it inspired young Paymer to give his acting dream a try. His aborted big break came when he was cast in the TV series, St. Elsewhere, as \"Dr. Wayne Fiscus\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjAwOTA5MF5BMl5BanBnXkFtZTYwODU4MjA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001601","name":"David Paymer","idIMDB":"nm0001601"},"actorId":"nm0001601","character":"Pete Solomon","urlCharacter":"http://www.imdb.com/character/ch0443708","main":true},{"actorName":"Jacki Weaver","urlProfile":"http://www.imdb.com/name/nm0915865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYyOTg4NjkxN15BMl5BanBnXkFtZTcwMjA4NDU5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1947","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Jacqueline Ruth Weaver","height":"4' 11½\" (1.51 m)","bio":"Jacki Weaver was born on May 25, 1947 in Sydney, New South Wales, Australia as Jacqueline Ruth Weaver. She is an actress, known for Silver Linings Playbook (2012), Animal Kingdom (2010) and The Voices (2014). She has been married to Sean Taylor since 2003. She was previously married to Derryn Hinch, Max Hensser and David Price.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYyOTg4NjkxN15BMl5BanBnXkFtZTcwMjA4NDU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915865","name":"Jacki Weaver","idIMDB":"nm0915865"},"actorId":"nm0915865","character":"Sylvia Dickerson-Barnes","urlCharacter":"http://www.imdb.com/character/ch0306359","main":true},{"actorName":"Jim Piddock","urlProfile":"http://www.imdb.com/name/nm0682063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk3MTA0ODIxNl5BMl5BanBnXkFtZTcwMTIxNjM4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1956","placeOfBirth":" Rochester, Kent, England, UK","birthName":"James Anthony Piddock","height":"5' 10\" (1.78 m)","bio":"Jim Piddock is an actor, writer, and producer, who co-wrote, produced, and co-stars in the current Netflix original film \"Mascots\". He also co-created and co-starred in the 2013 HBO and BBC 2 series Family Tree with Christopher Guest. He was born in Rochester, Kent, England, to Celia Mary (O'Callaghan) and Charles Frederick Piddock. He began his career on the stage in England, before emigrating to the U.S. in his early twenties. He was educated at Worth Abbey, a Benedictine boarding school, in the south of England. He gained an Honors degree in English literature at London University. He made his theatrical debut in the U.S. in The Boy's Own Story, a one-man show about a soccer goalkeeper, at the Julian Theatre in San Francisco. The show was an instant success with critics and audiences, winning Piddock the Bay Area Critics' Best Actor Award. The show was then produced Off-Broadway and he quickly gained the attention of the New York theatre scene. That same year (1982), he was cast in Noel Coward's Present Laughter by George C. Scott, who directed/starred in the revival, which also featured Nathan Lane, Christine Lahti, Dana Ivey, and Kate Burton. The show was a big hit on Broadway and Piddock soon found himself appearing in a string of Broadway and Off-Broadway shows, including the original US production of Noises Off, The Knack at the Roundabout Theatre, and Make and Break with Peter Falk at the Kennedy Center. After replacing Frank Langella in Design For Living at the Circle-In-The-Square theatre, he moved to Los Angeles and has since appeared in a long succession of tv shows, such as The Tracey Ullman Show, Coach, Max Headroom, The Twilight Zone, Murder She Wrote, Mad About You, Angel, ER, Friends, Crossing Jordan, The Drew Carey Show, Lost, Monk, Without A Trace, Dollhouse, Chuck, Law And Order:LA, Castle, Party Down, Two and a Half Men, Up All Night, Touch, and Children's Hospital. He has also starred in several notable tv movies and mini-series, like From The Earth To The Moon, A Mom For Christmas, She Creature on HBO, and The Women Of Windsor. He appeared in his first movie in the top-grossing film of 1989, Lethal Weapon 2, in which one of his lines, \"But...you're black\" in answer to Danny Glover's request to emigrate to South Africa, became a catchphrase for the film. Other feature film roles soon followed, including notable appearances in Independence Day, Traces Of Red, Multiplicity, Burn Hollywood Burn, Austin Powers 3, A Different Loyalty, Love For Rent, See This Movie, The Prestige, Epic Movie, Who's Your Caddy?, The Seeker: The Dark Is Rising, Meet The Spartans, Falling Up, You Will Meet A Tall Dark Stranger, Get Him To The Greek, The Cold Light Of Day, and The Five Year Engagement. But it is probably his memorable performances in the improvised Christopher Guest comedies Best In Show (as the Dog Show commentator with Fred Willard), A Mighty Wind, and For Your Consideration that he has gained the most attention as an impeccable, chameleon character actor, who is barely recognizable from role to role. In November, 2007, Jim's reputation as one of the UK's most notable exports was cemented at the Ricardo Montalban Theatre in Hollywood, when he co-starred with Billy Connolly, Tim Curry, Eric Idle, Eddie Izzard, Jane Leeves, Emily Mortimer, and Tracey Ullman in What About Dick?. The show was revived in April, 2012, at the Orpheum Theatre with the addition of Russell Brand and Sophie Winkleman, for a limited-run and was also filmed for a DVD release. Jim also starred on Broadway and in L.A. in 2009 in An Evening Without Monty Python, a limited-run celebration of the 40th anniversary of Monty Python's Flying Circus, directed by Eric Idle. As a voice actor, he is most notable for providing the voice of Major Zero in the English version of the video game Metal Gear Solid 3: Snake Eater, Bolero the Bull in the movie Garfield 2, and the fictional artistic director of Forever Young Films, Kenneth Loring, doing the hilarious commentary in the directors' cut of the Coen Brothers' Blood Simple. In 1990, he also began another career as a screenplay writer, selling his first spec script, co-written with Margaret Oberman, for a mid six-figure sum. Since then, he has pursued multiple careers as an actor, writer, and producer, having had a diverse collection of films made, crossing all genres, such as Traces Of Red (Samuel Goldwyn Company), One Good Turn, A Different Loyalty (starring Rupert Everett and Sharon Stone), New Line's The Man (starring Samuel Jackson and Eugene Levy), and The Tooth Fairy (which he also executive produced) for Fox, starring Dwayne Johnson, Ashley Judd, Billy Crystal, Steven Merchant, and Julie Andrews. He also created, wrote and produced the BBC series Too Much Sun, starring Mark Addy, Alex Jennings, and Lee Majors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk3MTA0ODIxNl5BMl5BanBnXkFtZTcwMTIxNjM4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0682063","name":"Jim Piddock","idIMDB":"nm0682063"},"actorId":"nm0682063","character":"George Barnes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Campbell","urlProfile":"http://www.imdb.com/name/nm0968405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDM4MTQ5OV5BMl5BanBnXkFtZTgwNjY4ODkzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1980","placeOfBirth":" Bath, Somerset, England, UK","birthName":"Adam Jones","height":"5' 7½\" (1.71 m)","bio":"Adam Campbell was born on August 19, 1980 in Bath, Somerset, England as Adam Jones. He is an actor and writer, known for Epic Movie (2007), Date Movie (2006) and The Five-Year Engagement (2012). He has been married to Jayma Mays since October 28, 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDM4MTQ5OV5BMl5BanBnXkFtZTgwNjY4ODkzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0968405","name":"Adam Campbell","idIMDB":"nm0968405"},"actorId":"nm0968405","character":"Gideon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Scott Cooper","urlProfile":"http://www.imdb.com/name/nm2635230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODUxNDEyMl5BMl5BanBnXkFtZTcwNDI5MjI4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10½\" (1.79 m)","bio":"Eric Scott Cooper is an actor, known for Argo (2012), The Five-Year Engagement (2012) and Chez Upshaw (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODUxNDEyMl5BMl5BanBnXkFtZTcwNDI5MjI4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2635230","name":"Eric Scott Cooper","idIMDB":"nm2635230"},"actorId":"nm2635230","character":"B&B Manager","urlCharacter":"http://www.imdb.com/character/ch0443710","main":true},{"actorName":"Dakota Johnson","urlProfile":"http://www.imdb.com/name/nm0424848","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTcxMjg0OV5BMl5BanBnXkFtZTgwMjg1Mjg1NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1989","placeOfBirth":" Austin, Texas, USA","birthName":"Dakota Mayi Johnson","height":"5' 7½\" (1.71 m)","bio":"Dakota Mayi Johnson is an American actress and fashion model. She was born in Austin, Texas, and is the daughter of actors Don Johnson and Melanie Griffith. Her maternal grandmother is actress Tippi Hedren. In 1999, she made her film debut in La tête dans le carton à chapeaux (1999), where she and her half-sister, Stella Banderas, played the daughters to their real-life mother, Melanie Griffith. The film was directed by her stepfather, Antonio Banderas, but it wasn't a hit. Dakota resumed her schooling and waited several years before she decided to become a professional actress and model. In 2006, she was voted Miss Golden Globe, a launching pad bestowed on off-spring of famous parents. She served as the first second-generation Miss Golden Globe in the Globes' history, since her mother was Miss Golden Globe in 1975. She also signed with IMG Models. In 2009, she modeled for MANGO brand's jeans line. Dakota traveled to Sydney, Australia, where she shot the \"Rising Star\" campaign for fashion label, \"Wish\". Once she graduated from high school, she signed with the William Morris Agency and started her acting career. She had her first box office hit in 2010 with David Fincher's film, The Social Network (2010), in which she had a scene with Justin Timberlake. The film received eight Oscar nominations, including one for Best Picture. She also appeared in three additional films: Beastly (2011), alongside Vanessa Hudgens and Mary-Kate Olsen; Ezna Sands' film, Chloe and Theo (2015); and So Yong Kim's film, For Ellen (2012); She had roles in several 2012 films: Christopher Neil's film, Goats (2012), with David Duchovny; Nicholas Stoller's film, The Five-Year Engagement (2012), for producer Judd Apatow, and the hit feature film version of the 1987 television show, 21 Jump Street (1987) that made Johnny Depp a star. She also won the female lead in Chris Nelson's, film Date and Switch (2014), written by Alan Yang. Her first television show, Ben and Kate (2012), where she played \"Kate\", aired on Fox during the Fall 2012 season. It was canceled in 2013, and she quickly resumed her feature film career with three high-profile films: Need for Speed (2014), Cymbeline (2014), the modern-day adaptation of the William Shakespeare play, \"Cymbeline\", and the starring role of \"Anastasia Steele\" in Fifty Shades of Grey (2015), the adaptation of the best-selling erotic novel, \"Fifty Shades of Grey\". She beat out many young actresses for the coveted role of Anastasia, and the film became a worldwide hit, making her a star. She won the People's Choice Award for Favorite Dramatic Movie Actress for \"Fifty Shades of Grey\". She has continued to seek challenging roles, such as of a young mother who loses her son in Black Mass (2015) opposite her \"21 Jump Street\" castmate Johnny Depp, and of a temptress in A Bigger Splash (2015). She has balanced her dramatic career by doing comedies as well, such as How to Be Single (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTcxMjg0OV5BMl5BanBnXkFtZTgwMjg1Mjg1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424848","name":"Dakota Johnson","idIMDB":"nm0424848"},"actorId":"nm0424848","character":"Audrey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Carr","urlProfile":"http://www.imdb.com/name/nm0139732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTUzNTMyNF5BMl5BanBnXkFtZTgwMzkxNjM0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1950","placeOfBirth":" Loughton, Essex, England, UK","height":"5' 7½\" (1.71 m)","bio":"Since the late 1980s, American audiences have embraced the \"veddy British\" talents of character actress Jane Carr -- she with the close-set eyes, lilting voice, trowel jaw and bubbly disposition. It helps, of course, having natural comedic timing and the necessary vocal skills to be in constant demand. She was born Ellen Jane Carr on August 13, 1950, in Loughton, Essex. The daughter of Patrick Carr, a steel erector, and Gwendoline Rose (née Clark), a postal employee, an innate gift for performing was discovered early on by a teacher. As a result, she took acting classes at the Arts Educational School and Corona Stage School, both in London. Jane made her stage debut at age 14 in a production of \"The Spider's Web\", then went on to appear as the impressionable, ill-fated student \"Mary McGregor\" in \"The Prime of Miss Jean Brodie\", starring Vanessa Redgrave at the Wyndham's Theatre in 1966. Earning smashing reviews, Jane recreated her shy, stuttering misfit with a delicate mixture of pathos and poignancy in the film version of The Prime of Miss Jean Brodie (1969), this time with Oscar-winning Maggie Smith at the helm as the dangerously influential schoolteacher. A year later, Jane displayed just how extensive her range is projecting devilish menace and merriment in the little known but excellent cult black comedy Something for Everyone (1970), which became a cinematic highlight in the careers of both Michael York and Angela Lansbury, as well. In the early 70s, Jane made fine use of her prim, \"plain Jane\" looks for comic effect on several British TV series and in guest appearances. Loftier moments came with the superb series Upstairs, Downstairs (1971) and a production of Daphne Laureola (1978), that starred esteemed acting couple Laurence Olivier and Joan Plowright. Never far from the stage, Jane appeared in \"Spring Awakening\" in 1974 and earned a 1977 Laurence Olivier nomination for her work in \"Once a Catholic\". In 1978, she became a member of the Royal Shakespeare Company (RSC) and added a solid body of classics to her theatrical resumé, including \"A Midsummer Night's Dream\" (Olivier nomination), \"The Tempest\", \"As You Like It\", \"Much Ado About Nothing\", \"The Merchant of Venice\" (with Alec Guinness) and \"The Merry Wives of Windsor\". She also reconnected with her \"Jean Brodie\" co-star Maggie Smith in a production of \"The Way of the World\" in 1985. It was not until 1986 that Jane came to the States playing multiple key roles in the epic RSC revival of \"The Life and Adventures of Nicholas Nickleby\" on Broadway. When the touring company returned to England, Jane elected to stay in Los Angeles. The following year, she married Chicago-born actor Mark Arnott. They have a son, Dash Arnott (aka Dashiel James Arnott). Jane proceeded to develop an American fanbase after being cast in the role of warm and fizzy Louise Mercer in the sitcom Dear John (1988), which lasted four seasons. With her chirpy British tones, she also managed to carve a career for herself in animated voicework. While she continues to appear occasionally on TV and in films, she hasn't found quite the showcase she did with Dear John (1988), but has enhanced a number of such off-kiltered shows as Curb Your Enthusiasm (2000) and Monk (2002) with her unique brand of comedy. Recent plays have included \"The Cider House Rules\", \"Noises Off\", \"Blithe Spirit\" (as \"Madame Arcati\"), \"Habeas Corpus\" and David Hare's \"Stuff Happens (as \"First Lady Laura Bush\" opposite Keith Carradine's bemused \"President Bush\"). Jane's latest venture on Broadway has been as \"Mrs. Brill\" in the musical, \"Mary Poppins\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTUzNTMyNF5BMl5BanBnXkFtZTgwMzkxNjM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0139732","name":"Jane Carr","idIMDB":"nm0139732"},"actorId":"nm0139732","character":"Grandma Katherine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clement von Franckenstein","urlProfile":"http://www.imdb.com/name/nm0820527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTYwNTkwOF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1944","placeOfBirth":" Sunninghill, Buckingham, England, UK","birthName":"Clement George Freiherr von und zu Franckenstein","height":"5' 11\" (1.8 m)","bio":"Clement George Freiherr von und zu Franckenstein is the son of Georg Freiherr von und zu Franckenstein, born in 1878, later Sir George Franckenstein, the former Austrian Ambassador to the Court of St. James. George Franckenstein had been the Austrian Minister in London for eighteen years when the Nazis took over Austria (1938) and recalled him. Instead he stayed in London, was naturalized a British subject, and knighted on 26 July 1938. There he met and married Editha King on 31 July 1939, by whom he had Clement George. His parents were killed together in a plane crash on 15 October 1953, after which he was raised by British friends. He was educated at Eton College and served for three years as a lieutenant in the Royal Scots Greys in the Middle East and Germany. He holds both British and Austrian citizenship. he studied opera for about three years, was baritone going up to tenor, was good but not really good enough to be a professional, so he decided to become an actor. Until the time he came to US, he sang in nightclubs and had a lot of performing experience before getting into acting at age 27. His first job was in the mini-series QB VII (1974) starring Ben Gazzara and Lee Remick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTYwNTkwOF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0820527","name":"Clement von Franckenstein","idIMDB":"nm0820527"},"actorId":"nm0820527","character":"Grandpa Baba","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Ensign","urlProfile":"http://www.imdb.com/name/nm0258117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTg5ODU1OV5BMl5BanBnXkFtZTcwMzUwNDE1OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1944","placeOfBirth":" Safford, Arizona, USA","height":"6' 1\" (1.85 m)","bio":"Born in Arizona, he is of British/American descent;living extensively in both the USA and the UK. He trained as an actor at The London Academy of Music and Dramatic Art. He spent the first eleven years of his professional career in the theatre in Britain. He was a member of the Royal Shakespeare Company from 1972 to 1975. He played the leading man (Donald) in the musical, 'Irene', at London's Adelphi Theatre in 1978. He appeared in the London productions of The Curse Of The Starving Class (Royal Court Theatre), The Red Devil Battery Sign (Phoenix Theatre) and numerous English Repertory Theatres. His film and television work has been primarily in the USA. In 2009 he was awarded the Distinguished Alumnus Award by the College of Fine Arts, University of Utah, Salt Lake City, Utah. Michael Ensign is a member of the Academy of Motion Picture Arts and Sciences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTg5ODU1OV5BMl5BanBnXkFtZTcwMzUwNDE1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0258117","name":"Michael Ensign","idIMDB":"nm0258117"},"actorId":"nm0258117","character":"Grandpa Harold","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1195478","urlIMDB":"http://www.imdb.com/title/tt1195478","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,610,060","country":"USA","day":"29","month":"04","year":"2012","remarks":"2,936 Screens"}],"gross":[{"money":"$28,700,285","country":"USA","day":"21","month":"06","year":"2012","remarks":""},{"money":"$28,644,770","country":"USA","day":"17","month":"06","year":"2012","remarks":""},{"money":"$28,490,225","country":"USA","day":"10","month":"06","year":"2012","remarks":""},{"money":"$28,284,600","country":"USA","day":"03","month":"06","year":"2012","remarks":""},{"money":"$28,012,860","country":"USA","day":"27","month":"05","year":"2012","remarks":""},{"money":"$27,103,010","country":"USA","day":"20","month":"05","year":"2012","remarks":""},{"money":"$24,623,420","country":"USA","day":"13","month":"05","year":"2012","remarks":""},{"money":"$19,133,015","country":"USA","day":"06","month":"05","year":"2012","remarks":""},{"money":"$10,610,060","country":"USA","day":"29","month":"04","year":"2012","remarks":""},{"money":"$53,774,508","country":"Worldwide","day":"21","month":"06","year":"2012","remarks":""}],"weekendGross":[{"money":"$92,440","country":"USA","day":"17","month":"06","year":"2012","remarks":"168 Screens"},{"money":"$121,625","country":"USA","day":"10","month":"06","year":"2012","remarks":"175 Screens"},{"money":"$179,845","country":"USA","day":"03","month":"06","year":"2012","remarks":"218 Screens"},{"money":"$294,555","country":"USA","day":"27","month":"05","year":"2012","remarks":"274 Screens"},{"money":"$1,110,375","country":"USA","day":"20","month":"05","year":"2012","remarks":"1,175 Screens"},{"money":"$3,314,010","country":"USA","day":"13","month":"05","year":"2012","remarks":"2,569 Screens"},{"money":"$5,029,110","country":"USA","day":"06","month":"05","year":"2012","remarks":"2,941 Screens"},{"money":"$10,610,060","country":"USA","day":"29","month":"04","year":"2012","remarks":"2,936 Screens"}],"admissions":[{"money":"15,616","country":"Portugal","day":"30","month":"05","year":"2012","remarks":""},{"money":"15,195","country":"Portugal","day":"23","month":"05","year":"2012","remarks":""},{"money":"8,479","country":"Portugal","day":"16","month":"05","year":"2012","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 2012 Universal Studios"},"technical":{"runtime":["2 hr 4 min (124 min)","2 hr 4 min (124 min) (USA)","2 hr 11 min (131 min) (extended)"],"soundMix":["Dolby Digital","Datasat","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa, Zeiss Master Prime Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA (color)"],"filmLength":["3,398 m (Portugal, 35 mm)"],"negativeFormat":["Codex","Digital"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.2","metascore":"62","filmingLocations":[{"location":"Beltane Ranch, Glen Ellen, California, USA"}],"rated":"R","awards":[],"votes":"81,626","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0142678","name":"Relativity Media"},{"idCompany":"co0073081","name":"Apatow Productions"}],"keywords":{"keywords":["kitchen","kissing while having sex","reference to princess diana","wedding band","wedding ring","singing on a horse carriage","shot in the leg","crossbow","hunting","wedding cake","foot chase","male rear nudity","justice of the peace","taco truck","san francisco california","reference to chewbacca","sex talk","sex scene","postponed wedding","wedding proposal","funeral","wedding rehearsal","f word","reference to wham","wedding plans","wedding date","restaurant","sous chef","masturbation","reference to tom hanks","bed and breakfast","little girl","wedding ceremony","detroit michigan","restaurant hostess","older man younger woman","break up","sandwich shop","ex husband ex wife relationship","sister sister relationship","englishwoman abroad","kitchen accident","heavy rain","profanity","brother brother relationship","fiance fiancee relationship","slide show","reference to chumbawamba","reference to pet shop boys","reference to metallica","reference to motley crue","punctuation in title","hyphen in title","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:53:54"}}