{"data":{"movies":[{"title":"Jeff Dunham: Spark of Insanity","originalTitle":"","year":"2007","releaseDate":"20070917","directors":[{"name":"Michael Simon","id":"nm0800301"}],"writers":[{"name":"Jeff Dunham","id":"nm0242278"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDhiY2EyZmEtY2U0ZS00YmVmLWIyMDMtOTI3MzNmMmU1MGZmXkEyXkFqcGdeQXVyMjA5MDMyMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Jeff Dunham and his socially reckless \"suitcase posse\" are back in this highly anticipated follow-up to Arguing with Myself, his breakthrough television special! What's next? An ALL NEW show that is Bigger... Better... and Funnier than ever! This time, Dunham welcomes two never-before-seen partners \"Achmed the Dead Terrorist,\" and \"Melvin the Superhero.\" Long-time favorites \"Peanut,\" \"Walter\" and Jose Jalapeno...On a STEEK! are back in an entirely original show for everyone!","simplePlot":"Jeff Dunham and his socially reckless \"suitcase posse\" are back in this highly anticipated follow-up to Arguing with Myself, his breakthrough television special! What's next? An ALL NEW ... ","actors":[{"actorName":"Jeff Dunham","urlProfile":"http://www.imdb.com/name/nm0242278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDcxNzM3Nl5BMl5BanBnXkFtZTcwNzI5MDk4Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1962","placeOfBirth":" Dallas, Texas, USA","birthName":"Jeffrey Dunham","bio":"Jeff Dunham was born on April 18, 1962 in Dallas, Texas, USA as Jeffrey Dunham. He is an actor and writer, known for Jeff Dunham: Spark of Insanity (2007), Jeff Dunham: Arguing with Myself (2006) and Jeff Dunham's Very Special Christmas Special (2008). He has been married to Audrey Dunham since October 12, 2012. They have two children. He was previously married to Paige Dunham.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDcxNzM3Nl5BMl5BanBnXkFtZTcwNzI5MDk4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242278","name":"Jeff Dunham","idIMDB":"nm0242278"},"actorId":"nm0242278","character":"Himself / Walter / Achmed the Dead Terrorist / Melvin the Superhero Guy / Peanut / José Jalapeño on a Stick","urlCharacter":"http://www.imdb.com/character/ch0088408","main":true},{"actorName":"Paige Dunham","urlProfile":"http://www.imdb.com/name/nm2838862","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTcwMDI3Ml5BMl5BanBnXkFtZTcwNzI1MTI4OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1968","placeOfBirth":" West Palm Beach, Florida, USA","birthName":"Paige Brown","bio":"Businesswoman, philanthropist, mother, and advocate for divorced women, Paige Dunham has made a name for herself over the years through her work with various charity organizations, her business savvy skills, and her advice for people of all ages going through break-ups and divorce. In 2013, Paige will take on the role of Executive Producer with the feature film The Face of Love (2013) [Mockingbird Pictures.] Starring Robin Williams, Ed Harris, and Annette Bening, the film tells the story of a widow who falls for a man who bears a striking resemblance to her late husband. Born in Savannah, Georgia and raised on Amelia Island, Florida, Paige grew up dancing at her family run dance studio. By middle school, her family had moved to West Palm Beach Florida, where she finished high school. Paige attended Clemson University in South Carolina, where she majored in business. In 1991, her first daughter Bree Aleece was born. She moved back to West Palm Beach for her daughters birth and there, met her soon to be husband comedian and entertainer Jeff Dunham. The couple were engaged three months after meeting, trekked to Los Angeles, and after a year long engagement tied the knot. In 1995 Paige gave birth to her second daughter, Ashlyn Evelyn and in 1997 had her third daughter, Makenna Paige. Although Paige chose to stay home full time with her daughters, she also became a key player in her husband's growing success as a comedian. For the next 14 years Paige would help with writing material, aid in pitch meetings for show ideas, and ran the merchandise side of the Jeff Dunham empire. Many of Jeff's stories from home came to life when he was on stage and in his numerous DVD's. In 1994 Paige began the database for his online fan club. The database became a key component to Jeff's win at the 1997 American Comedy Awards, where he won for Best Male Stand Up Comic. In addition to the running the fan club, Paige put together newsletters, managed and created Jeff Dunham merchandise, and introduced an online store. Looking to continue to expand the family business, Paige launched Brasma Publications in 1999, where she hired an illustrator and published \"Dear Walter...\" in 2003. The book showcased a collection of questions asked by Jeff's audiences and answered by their favorite curmudgeon, Walter, at live performances. In 2006 Paige initiated the Jeff and Paige Dunham Foundation. The purpose of the foundation was to take a portion of the proceeds of Jeff's stand up shows across the U.S. and use the money to benefit people in need. $1.00 from every ticket sale and 100% of the sales from eBay went into the foundation. Paige utilized eBay to sell meet & greets for fans at Jeff's nationwide shows, and she sold memorabilia. The year the organization was established, they presented a check to Hurricane Katrina Relief with Ronald McDonald House of Houston, for $35,000.00. Just as the foundation started to take off, the marriage began to crumble. Years of infidelities took its toll, Jeff filed for a separation in 2008, and Paige counter filed for divorce, which was finalized in 2012. Now called the 'marriage whisperer' by friends, Paige dedicates her time to speaking with other women going through divorce, and giving advice based off of her own experiences, to help the healing process. When not working, Paige dedicates her time to various children's charities. She is also passionate about teaching parents to show their children how to give back, just as she has done with her three daughters. Running has become a therapeutic hobby for her, she recently ran the half marathon in San Francisco where she raised $6,000.00 for the National Institution for Mental Health. Paige has held onto The Paige Dunham Foundation, and she looks forward to continuing to give back through this outlet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTcwMDI3Ml5BMl5BanBnXkFtZTcwNzI1MTI4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2838862","name":"Paige Dunham","idIMDB":"nm2838862"},"actorId":"nm2838862","character":"Herself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1143143","urlIMDB":"http://www.imdb.com/title/tt1143143","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Jeff Dunham"},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.1","filmingLocations":[{"location":"Warner Theater - 1299 Pennsylvania Ave NW, Washington, District of Columbia, USA"}],"rated":"NOT RATED","awards":[],"votes":"3,426","type":"TV Special","companyCreditsSimple":[{"idCompany":"co0163193","name":"Levity Productions"}],"keywords":{"keywords":["toyota prius","tv special","live audience","reference to rosie o'donnell","ventriloquist","ventriloquist dummy","ventriloquist and dummy","stand up comedy","reference to lindsay lohan","reference to home depot"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:43:36"}}