{"data":{"movies":[{"title":"Post Grad","originalTitle":"","year":"2009","releaseDate":"20090821","directors":[{"name":"Vicky Jenson","id":"nm0421776"}],"writers":[{"name":"Kelly Fremon Craig","id":"nm2609807"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzg0NDQ4NF5BMl5BanBnXkFtZTcwMzM2Njg0Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Ryden Malby has planned her academic life since she was in high school to get a college scholarship; now she has just graduated in English and in her master plan she expects to get a job as assistant editor in the publishing house Happerman & Browning, in Los Angeles. Her platonic best friend is Adam Davis, who has a crush on her and is frequently close to her. However, her arrogant classmate Jessica Bard gets the position and Ryden is forced to return home in the suburb to live with her family: her optimistic father Walter, who wants to do everything by himself; her careful mother Carmella who administrates the short resources of her family; her eccentric grandmother Maureen; and her weird little brother Hunter, who wants to race in a boxcar derby. Ryden unsuccessfully seeks a job and feels frustrated, but is emotionally supported by Adam. When Walter accidentally runs over the cat of his next-door neighbor David Santiago with Ryden's car, they visit him to give their sympathies. ...","simplePlot":"Ryden Malby graduates from college and is forced to move back into her childhood home with her eccentric family, while she attempts to find a job, the right guy, and just a hint of where her life is headed.","actors":[{"actorName":"Alexis Bledel","urlProfile":"http://www.imdb.com/name/nm0088127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTg4ODU0Ml5BMl5BanBnXkFtZTgwOTA1MjUwNDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1981","placeOfBirth":" Houston, Texas, USA","birthName":"Kimberly Alexis Bledel","height":"5' 7\" (1.7 m)","bio":"Kimberly Alexis Bledel was born in Houston, Texas, to Nanette (Dozier) and Martin Bledel. Her parents are both Spanish-speakers (her mother was born in Arizona and raised in Mexico, and her father was born in Argentina), and Alexis's ancestry includes Danish, German, English, Scottish, Irish, and French. Alexis made her television debut in Gilmore Girls (2000), after spending years in front of the camera as a model. Bledel's parents encouraged her to try community theater in Houston when she was 8 years old, hoping it would help their daughter overcome her shyness. She went on to perform in productions of Our Town, The Wizard of Oz and Aladdin, and later was scouted in a local mall to model. She began her modeling career while still in high school, traveling all over to locations like Tokyo, Milan, New York and Los Angeles. After graduating, she enrolled at NYU as a film major. In the Spring of 2000, Bledel landed a manager through her modeling agency and headed to Los Angeles for her first pilot season, where she quickly landed the coveted role of Rory on Gilmore Girls (2000). When she's not working, Bledel enjoys writing, reading, shooting photography, going to the movies and spending time with her family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTg4ODU0Ml5BMl5BanBnXkFtZTgwOTA1MjUwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0088127","name":"Alexis Bledel","idIMDB":"nm0088127"},"actorId":"nm0088127","character":"Ryden Malby","urlCharacter":"http://www.imdb.com/character/ch0101577","main":true},{"actorName":"Zach Gilford","urlProfile":"http://www.imdb.com/name/nm1472917","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MDc0NjQyMV5BMl5BanBnXkFtZTgwNTkyMTIzMDE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1982","placeOfBirth":" Evanston, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Zach Gilford was born on January 14, 1982 in Evanston, Illinois, USA. He is an actor, known for American Nightmare 2: Anarchy (2014), Friday Night Lights (2006) and The Last Stand (2013). He has been married to Kiele Sanchez since December 29, 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MDc0NjQyMV5BMl5BanBnXkFtZTgwNTkyMTIzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1472917","name":"Zach Gilford","idIMDB":"nm1472917"},"actorId":"nm1472917","character":"Adam Davies","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Keaton","urlProfile":"http://www.imdb.com/name/nm0000474","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE2MzczOF5BMl5BanBnXkFtZTYwNTM4MjYz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1951","placeOfBirth":" Coraopolis, Pennsylvania, USA","birthName":"Michael John Douglas","height":"5' 9\" (1.75 m)","bio":"Quirky, inventive and handsome American actor Michael Keaton first achieved major fame with his door-busting performance as fast-talking ideas man Bill Blazejowski, alongside a nerdish morgue attendant (Henry Winkler), in Night Shift (1982). He played further comedic roles in Mr. Mom (1983), Johnny Dangerously (1984), and Beetlejuice (1988), earned further acclaim for his dramatic portrayal of Bruce Wayne / Batman in Tim Burton's Batman (1989) and Batman Returns (1992), and since then, has moved easily between film genres, ranging from drama and romantic comedy to thriller and action. Keaton was born Michael John Douglas on September 5, 1951 in Coraopolis, Pennsylvannia, to Leona Elizabeth (Loftus), a homemaker, and George A. Douglas, a civil engineer and surveyor. He is of Irish, as well as English, Scottish, and German, descent. Michael studied speech for two years at Kent State, before dropping out and moving to Pittsburgh. An unsuccessful attempt at stand-up comedy led Keaton to working as a TV cameraman in a cable station, and he came to realize he wanted to work in front of the cameras. Keaton first appeared on TV in several episodes of Mister Rogers' Neighborhood (1968). He left Pittsburgh and moved to Los Angeles to begin auditioning for TV. He began cropping up in popular TV shows including Maude (1972) and The Mary Tyler Moore Hour (1979). Around this time, Keaton decided to use an alternative surname to remove confusion with better-known actor Michael Douglas. After reading an article on actress Diane Keaton, he decided that Michael Keaton sounded good. His next break was scoring a co-starring role alongside Jim Belushi in the short-lived comedy series Working Stiffs (1979), which showcased his comedic talent and led to his co-starring role in Night Shift (1982). Keaton next scored the lead in the comedy hits Mr. Mom (1983), Johnny Dangerously (1984) , Gung Ho (1986), the Tim Burton horror-comedy Beetlejuice (1988), and The Dream Team (1989). Keaton's career was given another major boost when he was again cast by Tim Burton, this time as the title comic book superhero, millionaire playboy / crime-fighter Bruce Wayne, in Batman (1989). Burton cast him because he thought that Keaton was the only actor who could portray someone who has the kind of darkly obsessive personality that the character demands. To say there were howls of protest by fans of the caped crusader comic strip is an understatement! Warner Bros. was deluged with thousands of letters of complaint commenting that comedian Keaton was the wrong choice for the Caped Crusader, given his prior work and the fact that he lacked the suave, handsome features and tall, muscular physicality often attributed to the character in the comic books. However, their fears were proven wrong when Keaton turned in a sensational performance, and he held his own on screen with opponent Jack Nicholson, playing the lunatic villain, \"The Joker\". Keaton's dramatic work earned widespread acclaim from critics and audiences alike, and Batman (1989) became one of the most successful films of the year. Keaton remained active during the 1990s, appearing in a wide range of films. Keen to diversify his work, Keaton starred as a psychotic tenant in Pacific Heights (1990), as a hard-working cop in One Good Cop (1991), and then donned the black cape and cowl once more for Batman Returns (1992). He remained in demand during the 1990s, appearing in a wide range of films, including the star-studded Shakespearian Much Ado About Nothing (1993), the drama My Life (1993), another Ron Howard comedy The Paper (1994), with sexy Andie MacDowell in Multiplicity (1996), twice in the same role, dogged Elmore Leonard character Agent Ray Nicolette, in Jackie Brown (1997) and Out of Sight (1998). He also played a killer in the mediocre thriller Desperate Measures (1998). In the 2000s, Keaton appeared in several productions with mixed success, including Live from Baghdad (2002), First Daughter (2004), and Herbie Fully Loaded (2005). He also provided voices for characters in the animated films Cars (2006), Toy Story 3 (2010), and Minions (2015). He returned to major film roles in the 2010s, co-starring in The Other Guys (2010), RoboCop (2014) and Need for Speed (2014). Also that year, Keaton starred alongside Zach Galifianakis, Edward Norton, Emma Stone, and Naomi Watts in Birdman or (The Unexpected Virtue of Ignorance) (2014), a film by 21 Grams (2003) and Biutiful (2010) director Alejandro González Iñárritu. In the film, Keaton plays Riggan Thomson, a screen actor, famous for playing the iconic titular superhero, who puts on a Broadway play based on a Raymond Carver short story, to regain his former glory. Keaton's critically praised lead performance earned him a Golden Globe Award for Best Actor in a Musical or Comedy, the Critics' Choice Award for Best Actor and Best Actor in a Comedy, and nominations for the Screen Actors Guild Award, British Academy Film Award, and Academy Award for Best Actor. In 2015, he played a journalist in Spotlight (2015), which, like Birdman, won the Academy Award for Best Picture. In 2016, he starred as Ray Kroc, the developer of McDonald's, in the drama The Founder (2016). He is a visiting scholar at Carnegie Mellon University.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE2MzczOF5BMl5BanBnXkFtZTYwNTM4MjYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000474","name":"Michael Keaton","nicknames":["Michael Douglas"],"idIMDB":"nm0000474"},"actorId":"nm0000474","character":"Walter Malby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Lynch","urlProfile":"http://www.imdb.com/name/nm0528331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDcwOTA1M15BMl5BanBnXkFtZTcwNTQ2Njg0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1960","placeOfBirth":" Dolton, Illinois, USA","birthName":"Jane Marie Lynch","height":"6' (1.83 m)","bio":"Jane Lynch was born on July 14, 1960 in Dolton, Illinois, USA as Jane Marie Lynch. She is an actress, known for Glee (2009), Wreck-It Ralph (2012) and The 40-Year-Old Virgin (2005). She was previously married to Lara Embry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDcwOTA1M15BMl5BanBnXkFtZTcwNTQ2Njg0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528331","name":"Jane Lynch","idIMDB":"nm0528331"},"actorId":"nm0528331","character":"Carmella Malby","urlCharacter":"http://www.imdb.com/character/ch0164405","main":true},{"actorName":"Bobby Coleman","urlProfile":"http://www.imdb.com/name/nm1544100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MjE0Nzg4MF5BMl5BanBnXkFtZTcwNjE1ODE0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1997","placeOfBirth":" Pasadena, California, USA","birthName":"Robert Moorhouse Coleman III","height":"5' 5\" (1.65 m)","bio":"Bobby Coleman was born on May 5, 1997 in Pasadena, California, USA as Robert Moorhouse Coleman III. He is known for his work on The Last Song (2010), Martian Child (2007) and Post Grad (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MjE0Nzg4MF5BMl5BanBnXkFtZTcwNjE1ODE0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1544100","name":"Bobby Coleman","idIMDB":"nm1544100"},"actorId":"nm1544100","character":"Hunter Malby","urlCharacter":"http://www.imdb.com/character/ch0208744","main":true},{"actorName":"Carol Burnett","urlProfile":"http://www.imdb.com/name/nm0000993","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE2OTQxODkyMV5BMl5BanBnXkFtZTYwODM5MzQz._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1933","placeOfBirth":" San Antonio, Texas, USA","birthName":"Carol Creighton Burnett","height":"5' 6½\" (1.69 m)","bio":"The entertainment world has enjoyed a five-decade love affair with comedienne/singer Carol Burnett. A peerless sketch performer and delightful, self-effacing personality who rightfully succeeded Lucille Ball as the carrot-topped \"Queen of Television Comedy,\" it was Burnett's traumatic childhood that set the stage for her comedy. Carol's rags-to-riches story started out in San Antonio, Texas, on April 26, 1933, where she was born to Jodie and Louise Burnett, both of whom suffered from acute alcoholism. As a child, she was left in the care of a beloved grandmother, who shuttled the two of them off to Hollywood, California, where they lived in a boarding house and shared a great passion for the Golden Age of movies. The plaintive, loose-limbed, highly sensitive Carol survived her wallflower insecurities by grabbing attention as a cut-up at Hollywood High School. A natural talent, she attended the University of California and switched majors from journalism to theater. Scouting out comedy parts on TV and in the theater, she first had them rolling in the aisles in the mid-1950s performing a lovelorn novelty song called \"I Made a Fool of Myself Over John Foster Dulles\" (then Secretary of State) in a nightclub act. This led to night-time variety show appearances with Jack Paar and Ed Sullivan and where the career ball really started rolling. Carol's first big TV breaks came at age 22 and 23 as a foil to a ventriloquist's dummy on the already-established The Paul Winchell Show (1950) in 1955, and as Buddy Hackett's gawky girlfriend on the short-lived sitcom Stanley (1956). She also developed an affinity for game shows and appeared as a regular on one of TV earliest, Stump the Stars (1947) in 1958. While TV would bring Carol fans by the millions, it was Broadway that set her on the road to stardom. She began as the woebegone Princess Winnifred in the 1959 Broadway musical \"Once Upon a Mattress\" which earned her first Tony Award nomination. [She would later appear in three TV adaptations - Once Upon a Mattress (1964), Once Upon a Mattress (1972) and The Wonderful World of Disney: Once Upon a Mattress (2005).] This, in turn, led to the first of an armful of Emmy Awards as a repertoire player on the popular variety series The Garry Moore Show (1958) in 1959. Burnett invented a number of scene-stealing characters during this time, most notably her charwoman character. With the phenomenal household success of the Moore show, she moved up quickly from second banana to headliner and appeared in a 1962 Emmy-winning special Julie and Carol at Carnegie Hall (1962) co-starring close friend Julie Andrews. She earned the Outer Critics Circle Award for the short-lived musical \"Fade Out, Fade In\" (1964); and made her official film debut opposite Bewitched (1964) star Elizabeth Montgomery and Dean Martin in the lightweight comedy Who's Been Sleeping in My Bed? (1963). Not surprisingly, fellow redhead Lucille Ball, who had been Carol's treasured idol growing up, subsequently became a friend and mentor to the rising funny girl. Hilarious as a guest star on The Lucy Show (1962), Carol appeared as a painfully shy (natch) wallflower type who suddenly blooms in jaw-dropping fashion. Ms. Ball was so convinced of Carol's talent that she offered Carol her own Desilu-produced sitcom, but Burnett had her heart set on fronting a variety show. With her own team of second bananas, including character crony Harvey Korman, handsome foil Lyle Waggoner, and lookalike \"kid sister\" type Vicki Lawrence, the The Carol Burnett Show (1967) became an instant sensation, and earned 22 Emmy Awards during its 11-year run. It allowed Carol to fire off her wide range of comedy and musical ammunition--whether running amok in broad sketch comedy, parodying movie icons such as Gloria Swanson, Shirley Temple, Vivien Leigh or Joan Crawford, or singing/gushing alongside favorite vocalists Jim Nabors, Steve Lawrence, Peggy Lee, Sammy Davis Jr., Ella Fitzgerald and Mel Tormé. She managed to bring in huge stars not known at all for slapstick comedy, including Rock Hudson and even then-Governor Ronald Reagan while providing a platform for such up-and-coming talent as Bernadette Peters and The Pointer Sisters In between, Carol branched out with supporting turns in the films Pete 'n' Tillie (1972), The Front Page (1974) and Robert Altman's A Wedding (1978). Her program, whose last episode aired in March of 1978, was the last truly successful major network variety show to date. Carol took on new challenges to display her unseen dramatic mettle, and accomplished this amazingly in TV-movie showcases. She earned an Emmy nomination for her gripping portrayal of anti-Vietnam War activist Peg Mullen in Friendly Fire (1979), and convincingly played a woman coming to terms with her alcoholism in Life of the Party: The Story of Beatrice (1982). Neither character bore any traces of the usual Burnett comedy shtick. Though she proved she could contain herself for films, Carol was never able to acquire crossover success into movies, despite trouper work in The Four Seasons (1981), Annie (1982) (as the hammy villainess Miss Hannigan), and Noises Off... (1992). The last two roles had been created onstage by Broadway's Dorothy Loudon. Carol would return from time to time to the stage and concert forums with productions of \"Plaza Suite\", \"I Do! I Do\", \"Follies\", \"Company\" and \"Putting It Together\". A second Tony nomination came for her comedy work in \"Moon Over Buffalo\" in 1995. Carol has made frequent appearances on her own favorite TV shows too, such as Password All-Stars (1961) (along with Elizabeth Montgomery, Carol was considered one of the show's best players) and the daytime soaper, All My Children (1970). During the early 1990s, Carol attempted a TV comeback of sorts, with a couple of new variety formats in Carol & Company (1990) and The Carol Burnett Show (1991), but neither could recreate the magic of the original. She has appeared, sporadically, on various established shows such as \"Magnum, P.I.,\" \"Touched by an Angel,\" \"Mad About You\" (for which she won an Emmy), \"Desperate Housewives,\" \"Law & Order: Special Victims Unit (Emmy nomination), \"Hawaii Five-0,\" \"Glee\" and \"Hot in Cleveland.\" Befitting such a classy clown, she has received a multitude of awards over time, including the 2003 Kennedy Center Honors and the Presidential Medal of Freedom in 2005. She was inducted into the Television Hall of Fame in 1985. Her personal life has been valiant--tears in between the laughs. Married three times, her second union with jazz-musician-turned-variety-show-producer Joe Hamilton produced three daughters. Eldest girl, Carrie Hamilton, an actress and former teen substance abuser, tragically died of lung and brain cancer at age 38. Shortly before Carrie's death, mother and daughter managed to write a play, together, entitled \"Hollywood Arms\", based on Carol's 1986 memoir, \"One More Time\". The show subsequently made it to Broadway. Today, at age 80 plus, Carol has been seen less frequently but still continues to make appearances, especially on TV. Most recently she has guested on the shows \"Hot in Cleveland\" and the new \"Hawaii Five-0\". As always she signs off a live appearance with her signature ear tug (acknowledging her late grandmother), reminding us all, between the wisecracks and the songs, how glad and lucky we all are to still have some of \"this time together\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE2OTQxODkyMV5BMl5BanBnXkFtZTYwODM5MzQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000993","name":"Carol Burnett","idIMDB":"nm0000993"},"actorId":"nm0000993","character":"Grandma Maureen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rodrigo Santoro","urlProfile":"http://www.imdb.com/name/nm0763928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTQzMDcxMl5BMl5BanBnXkFtZTcwNTEwNTYyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1975","placeOfBirth":" Petrópolis, Rio de Janeiro, Brazil","birthName":"Rodrigo Junqueira dos Reis Santoro","height":"6' 2½\" (1.89 m)","bio":"One of Brazil's most talented and famous actors, Rodrigo Junqueira dos Reis Santoro was born in Petrópolis, Rio de Janeiro, Brazil, to Maria José Junqueira dos Reis, an artist, and Francesco Santoro, an engineer. His father is Italian, while his mother, who is Brazilian, has Portuguese ancestry. Santoro is known for his performance in Warner Bros. 300, based on the Frank Miller's graphic novel, which broke box office records throughout the world. Rodrigo starred as Xerxes, the Persian King who sent his massive army to conquer Greece in 480 B.C. He was nominated for an MTV Movie Award for Best Villain. Rodrigo has also gained attention for his role of Paulo in ABC's hit series Lost. In 2008, Santoro was featured in writer/director David Mamet's film Redbelt, the story of Mike Terry, a Jiu-jitsu master who has avoided the prize fighting circuit, instead choosing to pursue a life by operating a self-defense studio in Los Angeles. Also in 2008, Rodrigo was honored to receive the Ischia award for International Contribution at the 2008 Ischia Global Film Festival in Italy. In 2007, at the Cancun International Film Festival Rodrigo received a Best Actor award for his portrayal of an obsessive photographer in the Brazilian film \"Nao por acaso\" (Not By Chance). Santoro can be seen as Raul Castro, in Steve Soderbergh's film, Che. He can also be seen in Lion's Den by Pablo Trapero, which competed against Che at the Cannes Film Festival. In 2009, Rodrigo starred in Fox Searchlights' Post Grad along side Michael Keaton and Carol Burnett. You will also see Rodrigo in I Love You Phillip Morris with Jim Carrey and Ewan McGregor as Jim Carrey's first love. Rodrigo was part of the star-studded ensemble cast of Universal's romantic comedy Love Actually, starring alongside Hugh Grant, Emma Thompson, Colin Firth and Liam Neeson. In the role of Karl, he starred opposite Laura Linney as co-workers grappling with the dicey protocol of an office romance. Prior to this film, Rodrigo made his American debut in the highly sought after role of Randy Emmers in Charlie's Angels: Full Throttle, directed by McG, starring Cameron Diaz, Drew Barrymore and Lucy Liu. Rodrigo has also been seen starring as the \"mystery man\" opposite Nicole Kidman in the Baz Luhrmann directed commercial for Chanel. In 2004 Rodrigo's starred in the Brazilian film, Carandiru, directed by Hector Babenco, which broke all Brazilian box office records for Brazil's entry in the Foreign Film category for the Academy Awards. Carandiru premiered at the Cannes Film Festival where Rodrigo received the Chopard Award for Male Revelation of the year. For his role in Carandiru he was also nominated for the Cinema Brazil Grand Prize of Best Actor and won for Best Supporting Actor at the Cartagena Film Festival. The movie was distributed in the US by Sony Pictures Classics and was a groundbreaking portrayal of the largest penitentiary in Latin America, the Sao Paulo House of Detention, and the lives of the people in it. Dr. Dráuzio Varella based the movie on the best-selling book \"Carandiru Station\". Rodrigo has won a total of eight Best Actor awards, including the first ever award for Best Actor from the Brazilian Academy of Arts and Film, for his portrayal of a young man forced into a mental institution by his parents in Brainstorm, the critically acclaimed film by director Lais Bodansky. For Rodrigo's role in Bicho de Sete Cabecas (2001) he won five of his eight Best Actor awards including, Best Actor for the Brazilia Festival of Brazilian Cinema, Best Actor for the Cartagena Film Festival, Best Actor for Cinema Brazil Grand Prize, Best Actor for Recife Cinema Festival, and Best Actor for the Sao Paulo Association of Art Critics Awards. He has also been celebrated for his performance in the Miramax film Behind the Sun directed by Walter Salles (Central Station), in which he played Tonio, the middle son of a Brazilian family caught in the middle of an age-old family feud in 1910. He is forced by tradition and honor to kill a member of the neighboring family, positioning him next in line to be killed. The heart of the movie finds Tonio and his little brother discovering a world outside their family and home. Behind the Sun was nominated for a Golden Globe in 2002 for Best Foreign Language Film. Previous to that Rodrigo appeared opposite Helen Mirren, Olivier Martinez and Anne Bancroft in The Roman Spring of Mrs. Stone, directed by Robert Allan Ackerman, for Showtime. Based on the novella by Tennessee Williams, The Roman Spring of Mrs. Stone was nominated for five Emmy Awards in 2003. Rodrigo Santoro resides in Rio De Janeiro, Brazil.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTQzMDcxMl5BMl5BanBnXkFtZTcwNTEwNTYyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0763928","name":"Rodrigo Santoro","idIMDB":"nm0763928"},"actorId":"nm0763928","character":"David Santiago","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Catherine Reitman","urlProfile":"http://www.imdb.com/name/nm0718642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDFmYWNkMzAtMTViZi00MjQ2LThhYTAtNWJkOGRiOGIxMTZhL2ltYWdlXkEyXkFqcGdeQXVyMTc2MzkwMTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1981","placeOfBirth":" Los Angeles, California, USA","birthName":"Catherine Marcelle Reitman","height":"5' 5\" (1.65 m)","bio":"Catherine Reitman was born on April 28, 1981 in Los Angeles, California, USA as Catherine Marcelle Reitman. She is an actress and writer, known for Workin' Moms (2017), It's Always Sunny in Philadelphia (2005) and Black-ish (2014). She has been married to Philip Sternberg since August 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDFmYWNkMzAtMTViZi00MjQ2LThhYTAtNWJkOGRiOGIxMTZhL2ltYWdlXkEyXkFqcGdeQXVyMTc2MzkwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0718642","name":"Catherine Reitman","nicknames":["Cat"],"idIMDB":"nm0718642"},"actorId":"nm0718642","character":"Jessica Bard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Anne McGarry","urlProfile":"http://www.imdb.com/name/nm0566911","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg1NTYwMTc3MV5BMl5BanBnXkFtZTgwOTEzNzgzNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Mary Anne McGarry holds both US and EU passports: she was born to Irish-American parents in Cincinnati, Ohio. She began acting when she was 14 years old; and her first professional role was Irena in Chekhov's \"Three Sisters\" at St. Louis' Gaslight Theater. She describes theater as her drug of choice: in order to assure a steady supply, she acted, directed, wrote, and produced theater across the US. For years, she had parallel careers in theater and academia: she studied at Quebec's Universite Laval, Cambridge University in Great Britain, St. Louis University (US), and has a theater/film Ph.D from Northwestern University. She is the former head of the MFA acting program at UC Irvine. Theater credits include 6 seasons with the Tony award-winning South Coast Repertory; the Mark Taper Forum of Los Angeles, the Pasadena Playhouse, Steppenwolf, Northlight Rep, and Court Theaters of Chicago; DC's Folger Theater, NYC's Public Theater, People's Light & Theater Co (PA), Sacramento Theater Company, and her own summer Shakespeare Festival in Geneva, IL. In 1988, she began working in TV and film. She has the distinction of being fired, along with George Clooney, from the first season of \"Roseanne\", for reasons known only to Roseanne Barr. After that temporary setback, she worked with many wonderful people, including Ryan Murphy, Emily Mortimer, John C Reilly, Joan Allen, Anthony Hopkins, Paris Barclay, Aza Jacobs, Will Ferrell, Amy Brenneman, Alexis Bledel, Sacha Gervasi, Whoopi Goldberg, Tony Goldwyn Jr., Ted Griffin, Glenne Headley, Vicky Jensen, Matthew McConaughey, Mary Louise Parker, Estelle Parsons, Brett Ratner, Gary Sinise, Christian Slater, John Slattery, John Spencer, David McWhirter, John Stamos, Alan Taylor, Matt Weiner, and her pal, Jonelle Allen. Mary Anne's one-woman show \"Honeymoon in Galway\" was named \"Best of the Year\" by the Los Angeles Times, and is in development for film, with Arthur Lappin as Exec Producer. Her screenplay, \"Craving for That Kind of Love,\" set in Harlem and London in the 20's, is in development for UK television. Her first mystery novel, \"Homicide Nun\", features an Irish nun as a reluctant homicide detective, transplanted to Riverside, CA. She has three siblings, a daughter and 3 grandchildren, living in New Orleans.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg1NTYwMTc3MV5BMl5BanBnXkFtZTgwOTEzNzgzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566911","name":"Mary Anne McGarry","idIMDB":"nm0566911"},"actorId":"nm0566911","character":"Barbara Snaff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.K. Simmons","urlProfile":"http://www.imdb.com/name/nm0799777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2NTI5NzQ1MV5BMl5BanBnXkFtZTgwNjI1NDEwMDI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1955","placeOfBirth":" Detroit, Michigan, USA","birthName":"Jonathan Kimble Simmons","height":"5' 10¾\" (1.8 m)","bio":"J.K. Simmons is an American actor. He was born Jonathan Kimble Simmons in Grosse Pointe, Michigan, to Patricia (Kimble), an administrator, and Donald William Simmons, a music teacher. He attended the Ohio State University, Columbus, OH; University of Montana, Missoula, MT (BA in Music). He had originally planned to be a singer and studied at the University of Montana to become a composer. He starred as Captain Hook and Mr. Darling opposite gymnastics champ Cathy Rigby in the Broadway and touring revivals of Peter Pan. He played Benny South-street in the 1992 Broadway revival of Guys and Dolls and can be heard on the cast recording. He did a commercial voice-over work, including the voice of the yellow M&M in the candy's TV ads. He appeared as police psychiatrist Emil Skoda on Law & Order (1990), Law & Order: Special Victims Unit (1999) and Law & Order: Criminal Intent (2001). As of 2011, has made five films with director Sam Raimi: For Love of the Game (1999); The Gift (2000); Spider-Man (2002); Spider-Man 2 (2004); and Spider-Man 3 (2007). He won many awards from 2005 to 2007 in Screen Actors Guild Awards. In 2014 won Oscar for Best Performance by an Actor in a Supporting Role. 2015 won a Golden Globe for his Best Performance as an Actor in a Supporting Role in a Motion Picture, BAFTA Film Awards Best Supporting Actor, Independent Spirit Awards Best Supporting Male.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2NTI5NzQ1MV5BMl5BanBnXkFtZTgwNjI1NDEwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0799777","name":"J.K. Simmons","idIMDB":"nm0799777"},"actorId":"nm0799777","character":"Roy Davies","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Arce","urlProfile":"http://www.imdb.com/name/nm0033556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NTkxMzc0MF5BMl5BanBnXkFtZTgwOTg3Mjg4ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Robert Arce is an actor, known for Post Grad (2009), Drowning Mona (2000) and The Broken Hearts Club: A Romantic Comedy (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NTkxMzc0MF5BMl5BanBnXkFtZTgwOTg3Mjg4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0033556","name":"Robert Arce","idIMDB":"nm0033556"},"actorId":"nm0033556","character":"Chancellor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeanie Hackett","urlProfile":"http://www.imdb.com/name/nm0352464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTM0NDYwOF5BMl5BanBnXkFtZTgwMDQwODUwNDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Jeanie is an actor / director / teacher / author / artistic director. She writes about all things acting + creative process + theater art & management. She has acted on Broadway, regional and Los Angeles theater, and in television & film. She's been the artistic director of two vibrant Los Angeles theater companies, and has directed at The Wallis Annenberg Center, L.A. Theatre Works & The Antaeus Company and The Williamstown Theatre Festival. She's the author of two books on acting: \"The Actor's Chekhov\" & \"Toward Mastery.\" both based on the work of the late director and teacher, Nikos Psacharopoulos. Jeanie is an acting teacher & private acting coach and also teaches for the SAG-AFTRA Academy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTM0NDYwOF5BMl5BanBnXkFtZTgwMDQwODUwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0352464","name":"Jeanie Hackett","idIMDB":"nm0352464"},"actorId":"nm0352464","character":"Woman at Graduation","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oscar Dillon","urlProfile":"http://www.imdb.com/name/nm0227046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNzM4MzMwNF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Oscar Dillon is known for his work on Batman Forever (1995), Walk Hard: The Dewey Cox Story (2007) and The Wood (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNzM4MzMwNF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0227046","name":"Oscar Dillon","idIMDB":"nm0227046"},"actorId":"nm0227046","character":"Security Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vanessa Branch","urlProfile":"http://www.imdb.com/name/nm0104376","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzg1MzUxMF5BMl5BanBnXkFtZTcwMDQzNzg1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1973","placeOfBirth":" London, England, UK","birthName":"Vanessa Lynn Branch","height":"5' 8\" (1.73 m)","bio":"Vanessa Branch was born on March 21, 1973 in London, England as Vanessa Lynn Branch. She is an actress and producer, known for Pirates of the Caribbean: The Curse of the Black Pearl (2003), Pirates of the Caribbean: At World's End (2007) and Pirates of the Caribbean: Dead Man's Chest (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzg1MzUxMF5BMl5BanBnXkFtZTcwMDQzNzg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0104376","name":"Vanessa Branch","idIMDB":"nm0104376"},"actorId":"nm0104376","character":"Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shirley Jordan","urlProfile":"http://www.imdb.com/name/nm0430186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ4MDA4MTcxMV5BMl5BanBnXkFtZTgwMDUzNTg3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Shirley hails from a small Connecticut town on the border of CT and Rhode Island. (So small, Pawcatuck had to borrow a RI zip code because it didn't even have a post office!) Right after graduating from UCONN (Go Huskies!), she took the road most traveled to New York City and enjoyed various odd jobs such as a waitress at the Empire State Building, receptionist at 20th Century Fox, cocktail waitress at the popular disco Visage, as well as a stand-in for 2 years on The Cosby Show. The first year she stood in for Rudy, the second she was grateful to trade in her knee pads to stand-in for the much taller Lisa Bonet. Bet you'll never guess who was Mr. Cosby's stand-in! She is known for portraying the former veterinarian now forensic specialist Tanya, the consummate lover and hater of all things zombie in We're Alive, a multi-award winning audio podcast (over 40 million downloads worldwide), as well as a deeply conflicted mother in Marriage of Inconvenience, a timely film exploring gay marriage, which has been well received at various festivals. Making her own earrings started out of necessity, after finding nothing on hand for a last minute outing. Feverishly tearing apart and reconfiguring a pile of her broken and unused jewelry soon became a hobby that satisfies her creative soul (and pocketbook) between gigs. She now rescues and upcycles jewelry from yard sales and thrift shops to keep her one-woman factory going.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ4MDA4MTcxMV5BMl5BanBnXkFtZTgwMDUzNTg3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0430186","name":"Shirley Jordan","idIMDB":"nm0430186"},"actorId":"nm0430186","character":"Interviewer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1142433","urlIMDB":"http://www.imdb.com/title/tt1142433","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$6,373,693","country":"USA","day":"04","month":"10","year":"2009","remarks":""},{"money":"$6,359,252","country":"USA","day":"27","month":"09","year":"2009","remarks":""},{"money":"$6,334,699","country":"USA","day":"20","month":"09","year":"2009","remarks":""},{"money":"$6,290,448","country":"USA","day":"13","month":"09","year":"2009","remarks":""},{"money":"$6,203,444","country":"USA","day":"06","month":"09","year":"2009","remarks":""},{"money":"$5,307,922","country":"USA","day":"30","month":"08","year":"2009","remarks":""}],"weekendGross":[{"money":"$11,076","country":"USA","day":"04","month":"10","year":"2009","remarks":"43 Screens"},{"money":"$17,098","country":"USA","day":"27","month":"09","year":"2009","remarks":"54 Screens"},{"money":"$32,021","country":"USA","day":"20","month":"09","year":"2009","remarks":"74 Screens"},{"money":"$48,196","country":"USA","day":"13","month":"09","year":"2009","remarks":"104 Screens"},{"money":"$366,778","country":"USA","day":"06","month":"09","year":"2009","remarks":"673 Screens"},{"money":"$1,467,947","country":"USA","day":"30","month":"08","year":"2009","remarks":"1,959 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"12","year":"2007","remarks":null},{"money":null,"country":null,"day":"14","month":"02","year":"2008","remarks":null}],"copyrightHolder":"Twentieth Century Fox Film Corporation, Cold Spring Pictures LLC and Dune Entertainment III LLC in all territories except Brazil, Italy, Japan, Korea and Spain; TCF Hungary Film Rights Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation, Cold Spring Pictures LLC and Dune Entertainment III LLC in Brazil, Italy, Japan, Korea and Spain"},"technical":{"runtime":["1 hr 28 min (88 min) (USA)","1 hr 28 min (88 min) (Argentina)","1 hr 28 min (88 min) (approx) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Kodak Vision3 500T 5219)"],"cinematographicProcess":null,"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"5.3","metascore":"35","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[],"votes":"12,079","type":"Movie","companyCreditsSimple":[{"idCompany":"co0176225","name":"Fox Atomic"},{"idCompany":"co0199880","name":"Cold Spring Pictures"},{"idCompany":"co0118469","name":"Montecito Picture Company, The"}],"keywords":{"keywords":["title directed by female","unemployment","tv studio","graduation","graduation speech"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:38:27"}}