{"data":{"movies":[{"title":"Date Night","originalTitle":"","year":"2010","releaseDate":"20100409","directors":[{"name":"Shawn Levy","id":"nm0506613"}],"writers":[{"name":"Josh Klausner","id":"nm0458441"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgwMjM2ODE4M15BMl5BanBnXkFtZTcwMTU2MDcyMw@@._V1.jpg","countries":["USA"],"languages":["English","Hebrew"],"genres":["Comedy","Crime","Romance","Thriller"],"plot":"Phil and Claire Foster are a couple who have been married for several years. Their days consists of them taking care of their children and going to work and coming home and going to bed. But they find time to have a date night wherein they go out and spend some time together. When another couple they know announce that they're separating because they're in a rut, Phil feels that he and Claire could be too. So when date night comes Phil decides to do something different. So they go into the city and try to get into a new popular restaurant. But when it's full and still wanting to do this, Phil decides to take the reservation of a couple who doesn't show up. While they're having dinner two men approach them and instructs them to stand up and go with them. They think the men are with the restaurant and want to talk to them about taking someone else's reservation. But it appears the couple whose reservation they took crossed someone and the two men work for this person. The men are after ...","simplePlot":"In New York City, a case of mistaken identity turns a bored married couple's attempt at a glamorous and romantic evening into something more thrilling and dangerous.","actors":[{"actorName":"Steve Carell","urlProfile":"http://www.imdb.com/name/nm0136797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMjkzNzA0M15BMl5BanBnXkFtZTcwNzMyNjU3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1962","placeOfBirth":" Concord, Massachusetts, USA","birthName":"Steven John Carell","height":"5' 9\" (1.75 m)","bio":"Steve Carell, one of America's most versatile comics, was born Steven John Carell on August 16, 1962, in Concord, Massachusetts. He is the son of Harriet T. (Koch), a psychiatric nurse, and Edwin A. Carell, an electrical engineer. His mother is of Polish descent and his father is of Italian and German ancestry (Steve's grandfather had changed the surname from \"Caroselli\" to \"Carrell\"). He was educated at The Fenn School, an all-boys private school in Concord, Massachusetts, then at Middlesex School in Concord. After graduating from Denison University in Granville, Ohio, he moved to Chicago where he taught an improvisational comedy class and performed with The Second City troupe, alongside Stephen Colbert. Carell made his film debut as \"Tesio\" in Curly Sue (1991). In 1996, he became a cast member of The Dana Carvey Show (1996), and provided the voice for Gary, opposite Colbert in \"The Ambiguously Gay Duo\". This animated short series produced by Robert Smigel continued on Saturday Night Live (1975), but Carell has joked that he auditioned for SNL and lost the job to Will Ferrell. Carell made a number of guest appearances on such shows as Come to Papa (2004), Just Shoot Me! (1997), and Watching Ellie (2002), before landing a regular stint as a correspondent on The Daily Show (1996) from 1999 until 2005. Carell played Evan Baxter opposite Jim Carrey in Bruce Almighty (2003), and Uncle Arthur opposite Nicole Kidman and Will Ferrell in Bewitched (2005). He broke out as a leading man after starring in the summer box-office hit The 40-Year-Old Virgin (2005), which he also co-wrote; the film was chosen as one of the Top Ten movies of 2006 by the American Film Institute. He next starred in the critically acclaimed Little Miss Sunshine (2006), an indie dark comedy which became a surprise hit and earned four Oscar nominations, and won two (Best Supporting Actor for Alan Arkin and Best Screenplay for Michael Arndt). In 2007, Carell reprised his role as Evan Baxter, filling Jim Carrey's leading-man shoes as a politician asked by God to build a giant ark in Evan Almighty (2007), the second installment of the \"Almighty\" franchise, co-starring Lauren Graham and Morgan Freeman. In 2008, he re-united with Jim Carrey in the highly successful animation hit Horton Hears a Who! (2008), then appeared as Agent Maxwell Smart in the popular comedy Get Smart (2008). Throughout this time, Carell maintained a successful career in television, starring as Michael Scott in the American remake of the Britain's existential comedy, The Office (2005). He received the Golden Globe Award for Best Actor in Television Comedy for this leading role in 2006, and earned both Emmy and Golden Globe nominations each consecutive show until he departed in 2011. In 2010, Carell announced he was leaving \"The Office\" to concentrate on his film career, and has made steady appearance in such films as Date Night (2010), Despicable Me (2010), Crazy, Stupid, Love. (2011), and Seeking a Friend for the End of the World (2012). Carell's most recent roles are the comedies Despicable Me 2 (2013), Anchorman 2: The Legend Continues (2013), and Alexander and the Terrible, Horrible, No Good, Very Bad Day (2014), and the drama Foxcatcher (2014). Steve Carell has been enjoying a happy family life with his wife, actress Nancy Carell, whom he met when she was a student in an improv class he was teaching at The Second City comedy troupe in Chicago. The couple have two children, daughter Elisabeth (born in May 2001), and son John (born in June 2004). Steve Carell lives with his family in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMjkzNzA0M15BMl5BanBnXkFtZTcwNzMyNjU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0136797","name":"Steve Carell","idIMDB":"nm0136797"},"actorId":"nm0136797","character":"Phil Foster","urlCharacter":"http://www.imdb.com/character/ch0184110","main":true},{"actorName":"Tina Fey","urlProfile":"http://www.imdb.com/name/nm0275486","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzMwMDI2MF5BMl5BanBnXkFtZTcwNDk0MzcyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1970","placeOfBirth":" Upper Darby, Pennsylvania, USA","birthName":"Elizabeth Stamatina Fey","height":"5' 4½\" (1.64 m)","bio":"Elizabeth Stamatina Fey was born in 1970 in Upper Darby, Pennsylvania, just west of Philadelphia, to Xenobia \"Jeanne\" (Xenakes), a brokerage employee, and Donald Henry Fey, who wrote grant proposals for universities. Her mother is Greek, born in Piraeus, while her father had German, Northern Irish, and English ancestry. Going by the name of Tina, Fey considered herself a \"supernerd\" during her high school and college years. She studied drama at the University of Virginia, and after graduating in 1992, she headed to Chicago, the ancestral home of American comedy. While working at a YMCA to support herself, she started Second City's first set of courses. After about nine months, a teacher told her to just skip ahead and audition for the more selective Second City Training Center. She failed but about eight weeks later, she re-auditioned and got into the year-long program. She ended up spending many years at The Second City in Chicago where many SNL cast members first started out. Then in 1995, Saturday Night Live (1975) came to The Second City's cast, including Fey's friend, Adam McKay, as a writer, searching for new talent. What they found was Tina Fey. When Adam was made Head writer, he suggested Fey should send a submission packet over the summer with six sketches, 10 pages each. Tina took the advice and sent them. After Lorne Michaels met her and saw her work she was offered a job a week later. She admitted that she was extremely nervous working in the legendary Studio 8H; being a foot shorter than everyone else, younger, and being one of the only female writers at the time. After a few years, Tina made history by becoming the first female head writer in the show's history. Tina also made her screen debut as a featured player during the 25th season by co-anchoring Weekend Update with Jimmy Fallon. Since Tina and Jimmy have taken over Weekend Update it has been considered the best ever. This year she made it to full fledged star by becoming a regular cast member, though she is hardly on the show, besides Update. And during the past two summers, Tina and Rachel Dratch performed their two-woman show to critical acclaim in both Chicago (1999) and New York (2000) and made their Aspen Comedy Festival Debut. Tina is married to Jeff Richmond, a Second City director and lives in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzMwMDI2MF5BMl5BanBnXkFtZTcwNDk0MzcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0275486","name":"Tina Fey","idIMDB":"nm0275486"},"actorId":"nm0275486","character":"Claire Foster","urlCharacter":"http://www.imdb.com/character/ch0186161","main":true},{"actorName":"Mark Wahlberg","urlProfile":"http://www.imdb.com/name/nm0000242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjYwNTE2M15BMl5BanBnXkFtZTYwNTI0NjI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1971","placeOfBirth":" Dorchester, Boston, Massachusetts, USA","birthName":"Mark Robert Michael Wahlberg","height":"5' 8\" (1.73 m)","bio":"American actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to acclaimed actor. A Best Supporting Actor Oscar nominee for The Departed (2006) who went on to receive positive critical reviews for his performance in The Fighter (2010), Wahlberg also is a solid comedy actor, proven by his starring role in Ted (2012). Mark Robert Michael Wahlberg was born June 5, 1971 in a poor working class district, Dorchester, of Boston, Massachusetts. He is the son of Alma Elaine (Donnelly), a nurse's aide and clerk, and Donald Edward Wahlberg, a delivery driver. Wahlberg is the youngest of nine children. He is of Irish, Swedish (from his paternal grandfather), and more distant French-Canadian, English, and Scottish, descent. The large Wahlberg brood didn't have a lot growing up, especially after his parents divorced when he was eleven. The kids crammed into a three bedroom apartment, none of them having very much privacy. Mark's mother has said that after the divorce, she became very self-absorbed with her own problems. She has blamed herself for her son's subsequent problems and delinquency. Wahlberg dropped out of high school at age 14 (but later got his GED) to pursue a life of petty crime and drugs. He'd spend his days scamming and stealing, working on the odd drug deal before treating himself to the substances himself. The young man also had a violent streak - one which was often aimed at minorities. At age sixteen, he was convicted of assault against two Vietnamese men after he had tried to rob them. As a result of his assault conviction, he was sentenced to serve 50 days in prison at Deer Island penitentiary. Whilst there, he began working out to pass time and, when he emerged at the end of his sentence, he had gone from being a scrawny young kid to a buff young man. Wahlberg also credits jail time as being his motivation to improve his lifestyle and leave crime behind him. Around this time, his older brother Donnie Wahlberg had become an overnight teen idol as a member of the 1980s boy band New Kids on the Block. A precursor to the boy-band craze, the group was dominating the charts and were on top of their game. Mark himself had been an original member of the band but had backed out early on - uncomfortable with the squeaky clean image of the group. Donnie used his connections in the music business to help his little brother secure a recording contract, and soon the world was introduced to Marky Mark and the Funky Bunch, with Wahlberg as a bad-boy rapper who danced in his boxers. Despite a lack of singing ability, promoters took to his dance moves and a physique they knew teenage girls would love. Donnie scripted some easy songs for Mark, who collected a troupe of dancers and a DJ to become his \"Funky Bunch\" and \"Marky Mark and the Funky Bunch\" was born. His debut album, \"Music for the People\", was a smash hit, which was propelled along by the rapper's willingness to disrobe down to boxer-briefs on stage, not to mention several catchy tunes. Teenage girls thrilled to the rapping \"bad boy\". Record producer David Geffen saw in Wahlberg a cash-cow of marketing ability. After speaking to designer Calvin Klein, Marky Mark was set up as the designer's chief underwear model. His scantily clad figure soon adorned billboards across the nation. Ironically, while the New Kids on the Block's fame was dwindling as audiences tired of their syrupy lyrics, \"Marky Mark's\" bad boy image was becoming even more of a commodity. He was constantly in the headlines (often of the tabloids) after multiple scandals. In 1992, he released a book dedicated to his penis. Wahlberg was constantly getting into rumored fights, most memorably with Madonna and her entourage at a Los Angeles party. While things were always intense, they were relatively harmless and made for enjoyable reading for the public. However, when the story of his arrest for assault (and the allegations of racism) broke in the press, things took on a decidedly darker note. People were not amused. Soon after, while on a British talk show along with rapper Shabba Ranks, he got into even more trouble. After Ranks made the statement that gays should be crucified, Wahlberg was accused of condoning the comments by his silence. Marky Mark was suddenly surrounded by charges of brutality, homophobia and racial hatred. His second album, \"You Gotta Believe\", had not been faring well and, after the charges surfaced, it plummeted from the charts. Adding to the hoopla, Wahlberg was brought to court for allegedly assaulting a security guard. He was ordered to make amends by appearing in a series of anti-bias advertisements. Humbled and humiliated by his fall from grace in the music world, Wahlberg decided to pursue another angle, acting. He dropped the \"Marky Mark\" moniker and became known simply as Mark Wahlberg. His first big screen role came in Penny Marshall's Renaissance Man (1994). Despite the name change, many people snickered at the idea of the has-been rapper thinking he could make it as an actor. From the get-go, he was proving them wrong. In Renaissance Man (1994), he gave an utterly charming performance as a simple but sincere army recruit. What naysayers remained found it increasingly difficult to write Mark Wahlberg off as he delivered one fine performance after another. He blew them away in the controversial The Basketball Diaries (1995) and chilled them in Fear (1996) as every father's worst nightmare. The major turning point in Wahlberg's career came with the role of troubled porn star Dirk Diggler in Paul Thomas Anderson's Boogie Nights (1997). Since then, Wahlberg has chosen roles that demonstrate a wide range of dramatic ability, starring in critically acclaimed dramas such as Three Kings (1999) and The Perfect Storm (2000), popcorn flicks like Planet of the Apes (2001) and Contraband (2012), and even indies such as I Heart Huckabees (2004). Wahlberg was the executive producer of such television series as Boardwalk Empire (2010), In Treatment (2008) and the highly successful comedy Entourage (2004), which was partly based on his experiences in Hollywood. Wahlberg and his wife Rhea Durham have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjYwNTE2M15BMl5BanBnXkFtZTYwNTI0NjI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000242","name":"Mark Wahlberg","nicknames":["Marky Mark","Monk D"],"idIMDB":"nm0000242"},"actorId":"nm0000242","character":"Holbrooke","urlCharacter":"http://www.imdb.com/character/ch0186162","main":true},{"actorName":"Taraji P. Henson","urlProfile":"http://www.imdb.com/name/nm0378245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NDQ2MTUwMl5BMl5BanBnXkFtZTcwODA2NDY3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1970","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Taraji Penda Henson","height":"5' 4\" (1.63 m)","bio":"Taraji P. Henson was born on September 11, 1970 in Washington, District of Columbia, USA as Taraji Penda Henson. She is an actress and producer, known for Hidden Figures (2016), Person of Interest (2011) and The Curious Case of Benjamin Button (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NDQ2MTUwMl5BMl5BanBnXkFtZTcwODA2NDY3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0378245","name":"Taraji P. Henson","idIMDB":"nm0378245"},"actorId":"nm0378245","character":"Detective Arroyo","urlCharacter":"http://www.imdb.com/character/ch0187231","main":true},{"actorName":"Jimmi Simpson","urlProfile":"http://www.imdb.com/name/nm0801051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwOTgzNjI1N15BMl5BanBnXkFtZTgwOTI0MTM2MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1975","placeOfBirth":" Hackettstown, New Jersey, USA","birthName":"James Raymond Simpson","height":"5' 11¼\" (1.81 m)","bio":"Jimmi Simpson is an American actor. He was born in Hackettstown, New Jersey, the youngest of three brothers. After graduating from Bloomsburg University with a Bachelor of Arts in theater, he acted for four seasons at the Williamstown Theatre Festival in Massachusetts. Simpson made his film debut in the teen comedy Loser (2000). He is best known for his television work, which includes roles in Netflix political drama series House of Cards (2013), and the HBO television series Westworld (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwOTgzNjI1N15BMl5BanBnXkFtZTgwOTI0MTM2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0801051","name":"Jimmi Simpson","nicknames":["Jim-ster"],"idIMDB":"nm0801051"},"actorId":"nm0801051","character":"Armstrong","urlCharacter":"http://www.imdb.com/character/ch0188434","main":true},{"actorName":"Common","urlProfile":"http://www.imdb.com/name/nm0996669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg4MTk5NDM1MV5BMl5BanBnXkFtZTcwMTM5OTQzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1972","placeOfBirth":" Chicago, Illinois, USA","birthName":"Lonnie Rashid Lynn","height":"6' 0½\" (1.84 m)","bio":"First known as a rapper who became one of the more prominent voices in hip-hop's new millennium renaissance, Common later transitioned into acting. He was born in Chicago, and is the son of educator Dr. Mahalia Ann Hines and Lonnie Lynn, an ABA basketball player turned youth counselor. On October 6, 1992, Common released his first LP, \"Can I Borrow A Dollar?\" under the Common Sense moniker. Tracks like \"Charm's Alarm\" and \"Breaker 1-9\" established him as a lyricist with wit, street-smarts, and love for extended similes, while tracks like \"Heidi Hoe\" would touch on the misogyny that would surface sparingly on future work. In 1994 he released \"Resurrection\", notable for the smooth 'Large Professor' produced title cut as well as \"I Used To Love H.E.R.\", an ode to hip-hop. This album further increased his underground reputation while giving the hip-hop nation a new solid conscientious voice in a year that was excellent for underground artists (Nas, Kendrick Davis, Digable Planet, et al.) After a name change brought on by a lawsuit, Common reemerged in 1997 with \"One Day It'll All Make Sense\". With guests ranging from Erykah Badu to Canibus to De La Soul and production help from mainstays No I.D. and Dug Infinite, the album had a distinctly underground flair. His big mainstream breakthrough album was yet to come. After an appearance on The Roots smash 1999 album, \"Things Fall Apart,\" Common moved to MCA Records. He soon was in the studio collaborating with the Okayplayer collective and with help from the forward-thinking production troupe Ahmir-Khalib Thompson(aka ?uestlove),James 'Jay Dee' Yancey,James Poyser, et al) he released his fourth album, \"Like Water For Chocolate\" in the spring of 2000. With its varied sonic plateau (Afrobeat, funk, and old-school soul) it was much different from previous outings. On the strength of tracks like the 'DJ Premier' produced banger \"The 6th Sense\", the album was a success, becoming a worthy addition to \"The Next Movement\". In 2003 he released \"Electric Circus\". The album, a hip-hop/funk/soul/rock/psychedelia hybrid, polarized hip-hop fans like no other album has in recent memory. Common has also chosen to redefine himself, swearing off the alcohol, marijuana, and fornication that he had once indulged in. Also in 2003 he appeared in a TV sitcom episode. With only a couple minor roles between 2003 and 2004, in January of 2007 he made his big screen debut.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg4MTk5NDM1MV5BMl5BanBnXkFtZTcwMTM5OTQzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0996669","name":"Common","idIMDB":"nm0996669"},"actorId":"nm0996669","character":"Collins","urlCharacter":"http://www.imdb.com/character/ch0188435","main":true},{"actorName":"William Fichtner","urlProfile":"http://www.imdb.com/name/nm0001209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTI3MzcxMF5BMl5BanBnXkFtZTcwNzIwNzQ3OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1956","placeOfBirth":" Mitchell Field Air Force Base, East Meadow, Long Island, New York, USA","birthName":"William Edward Fichtner","height":"6' 0½\" (1.84 m)","bio":"A small-town guy with a big heart, William Fichtner has been captivating the hearts of Western New Yorkers for decades. Bill was born in 1956 on Long Island, New York, to Patricia A. (Steitz) and William E. Fichtner. He is of German, Irish, and English descent. Fichtner was raised in Cheektowaga, and graduated from Maryvale High School in 1974. His first roles were in soap operas such as As the World Turns (1956) and sitcoms like Grace Under Fire (1993). He has also been in films such as Armageddon (1998), Empire Falls (2005), as The Marriage Counselor, uncredited, in Mr. & Mrs. Smith (2005), and in The Dark Knight (2008). A fan of the Buffalo Sabres, Bill always stays true to his roots. He is married to actress Kymberly Kalil.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTI3MzcxMF5BMl5BanBnXkFtZTcwNzIwNzQ3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001209","name":"William Fichtner","nicknames":["Bill"],"idIMDB":"nm0001209"},"actorId":"nm0001209","character":"DA Frank Crenshaw","urlCharacter":"http://www.imdb.com/character/ch0165324","main":true},{"actorName":"Leighton Meester","urlProfile":"http://www.imdb.com/name/nm1015262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3ODQzMzQ3OV5BMl5BanBnXkFtZTgwNTg3MjI5NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1986","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Leighton Marissa Meester","height":"5' 4½\" (1.64 m)","bio":"Leighton Marissa Meester was born in Fort Worth, Texas, to Constance (Haas) and Douglas Meester. Although born in Texas when her mother was serving a jail sentence for her part in a marijuana-smuggling ring, Meester spent her early years in Marco Island, Florida with her grandparents. There, she became involved with the local playhouse and made her stage debut in a production of \"The Wizard of Oz\". She moved to New York with her mother at the age of 11 and was soon working as a model and appearing in TV commercials. A few years later, at age 14, she and her mother moved again, this time to Los Angeles where she soon began to pick up TV work, making her debut in Law & Order: Disciple (1999). A steady stream of TV work followed until in 2007 she landed the role in Gossip Girl (2007) which made her famous. This led to more TV and movie work, and in 2009 she launched a recording career with a single entitled, \"Somebody to Love\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3ODQzMzQ3OV5BMl5BanBnXkFtZTgwNTg3MjI5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1015262","name":"Leighton Meester","idIMDB":"nm1015262"},"actorId":"nm1015262","character":"Katy","urlCharacter":"http://www.imdb.com/character/ch0098247","main":true},{"actorName":"J.B. Smoove","urlProfile":"http://www.imdb.com/name/nm1356578","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI1NjI3NDQzOF5BMl5BanBnXkFtZTcwMzYzMDQ1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1965","placeOfBirth":" Plymouth, North Carolina, USA","birthName":"Jerry Brooks","height":"6' 2\" (1.88 m)","bio":"J.B. Smoove was born on December 16, 1965 in Plymouth, North Carolina, USA as Jerry Brooks. He is an actor and writer, known for Date Night (2010), The Sitter (2011) and We Bought a Zoo (2011). He is married to Shahidah Omar.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI1NjI3NDQzOF5BMl5BanBnXkFtZTcwMzYzMDQ1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1356578","name":"J.B. Smoove","idIMDB":"nm1356578"},"actorId":"nm1356578","character":"Cabbie","urlCharacter":"http://www.imdb.com/character/ch0458003","main":true},{"actorName":"Kristen Wiig","urlProfile":"http://www.imdb.com/name/nm1325419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTA0MDA5NF5BMl5BanBnXkFtZTgwODMyMjA1NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1973","placeOfBirth":" Canandaigua, New York, USA","birthName":"Kristen Carroll Wiig","height":"5' 5\" (1.65 m)","bio":"Kristen Carroll Wiig was born on August 22, 1973 in Canandaigua, New York, to Laurie J. (Johnston), an artist, and Jon J. Wiig, a lake marina manager. She is of Norwegian (from her paternal grandfather), Irish, English, and Scottish descent. The family moved to Lancaster, Pennsylvania, before settling in Rochester, New York. When Wiig was 9 years old, her parents divorced and she lived with her mother and older brother Erik. After graduating from Brighton High School in Rochester, Wiig attended the University of Arizona as an art student. She took her first acting class, as an elective, and was soon encouraged by her teacher to pursue acting. Years later, she moved to Los Angeles and Wiig worked as a main company member of the Los Angeles-based improv and sketch-comedy troupe The Groundlings. As a Groundlings alumna, she joins the ranks of such SNL cast mates as Maya Rudolph, Will Ferrell, Phil Hartman, and Jon Lovitz. Wiig made her big-screen debut to universal high praise as Katherine Heigl's passive-aggressive boss in Judd Apatow's smash-hit comedy Knocked Up (2007). Additional film credits include Drew Barrymore's directorial debut, Whip It (2009), starring Ellen Page; Greg Mottola's Adventureland (2009), with Ryan Reynolds, Kristen Stewart and Jesse Eisenberg; David Koepp's Ghost Town (2008), with Ricky Gervais; and Jake Kasdan's Walk Hard: The Dewey Cox Story (2007), another Apatow-produced film, in which she starred opposite John C. Reilly. She has also guest-starred on the Emmy-winning NBC series 30 Rock (2006), the HBO series Bored to Death (2009), with Jason Schwartzman, and Flight of the Conchords (2007). Wiig joined the cast of Saturday Night Live (1975) in 2008, and was known for playing such memorable characters as the excitable Target clerk, Lawrence Welk singer Doonese, the hilarious one-upper Penelope, House Speaker Nancy Pelosi, and Suze Orman, among others. Wiig earned two Emmy nominations for Outstanding Supporting Actress in a Comedy Series for her work on the show. She left the show in the spring of 2012. In 2011, Wiig co-wrote and starred in Bridesmaids (2011), along with Melissa McCarthy, Maya Rudolph, and Rose Byrne. The film was a box office hit and won several awards, plus earned two Oscar nominations (Best Supporting Actress and Best Original Screenplay), and two Golden Globes nominations (Best Motion Picture - Comedy or Musical and Best Actress). Wiig also appeared in such notable films as Greg Mottola's Paul (2011), opposite Simon Pegg and Nick Frost; Andrew Jarecki's All Good Things (2010), opposite Ryan Gosling, Kirsten Dunst and Frank Langella; DreamWorks Animation's How to Train Your Dragon (2010), with Gerard Butler and Jay Baruchel; the Universal Pictures' animated feature film Despicable Me (2010), starring Steve Carell and Jason Segel; and Jennifer Westfeldt's Friends with Kids (2011), opposite Jon Hamm, Megan Fox, Adam Scott, Maya Rudolph and Westfeldt.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTA0MDA5NF5BMl5BanBnXkFtZTgwODMyMjA1NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1325419","name":"Kristen Wiig","idIMDB":"nm1325419"},"actorId":"nm1325419","character":"Haley Sullivan","urlCharacter":"http://www.imdb.com/character/ch0186163","main":true},{"actorName":"Mark Ruffalo","urlProfile":"http://www.imdb.com/name/nm0749263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1967","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Mark Alan Ruffalo","height":"5' 8\" (1.73 m)","bio":"Mark Ruffalo was born in Kenosha, Wisconsin, to Marie Rose (Hebert), a stylist and hairdresser, and Frank Lawrence Ruffalo, a construction painter. His father's ancestry is Italian, and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles. He took classes at the Stella Adler Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume. Bartending for nearly nine years to make ends meet and ready to give it all up, a chance meeting and resulting collaboration with playwright/screenwriter Kenneth Lonergan changed everything. Ruffalo won NY success in Lonergan's play \"This Is Our Youth\", which led to the male lead in Lonergan's film You Can Count on Me (2000), playing the ne'er-do-well brother of Laura Linney. The performance drew rave reviews and invited comparisons to an early Marlon Brando. Notable roles in The Last Castle (2001), XX/XY (2002), and Windtalkers (2002) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite Meg Ryan in In the Cut (2003) and the love interest of Gwyneth Paltrow in the comedy View from the Top (2003). Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 - We Don't Live Here Anymore (2004), Eternal Sunshine of the Spotless Mind (2004), 13 Going on 30 (2004), and Collateral (2004) - which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama. After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: Just Like Heaven (2005), Les fous du roi (2006), Zodiac (2007), Reservation Road (2007), and The Brothers Bloom (2008). In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film Sympathy for Delicious (2010), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple Annette Bening and Julianne Moore in The Kids Are All Right (2010). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor. High-profile roles in Martin Scorsese's Shutter Island (2010) and 'Kenneth Longeran''s long-delayed Margaret (2011) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in Joss Whedon's blockbuster The Avengers (2012). Garnering highly positive reviews for a role in which actors Eric Bana and Edward Norton could not find success in previous films made Ruffalo a box office star in addition to a critically-acclaimed actor. He is expected to reprise the role in the upcoming 2015 sequel, and reunited with former co-star Gywneth Paltrow in the sex-addiction comedy-drama Thanks for Sharing (2012); Ruffalo also will take the lead in Ryan Murphy's adaptation of Larry Kramer's AIDS-drama play The Normal Heart (2014). Ruffalo has been married to actress Sunrise Coigney since 2000; the couple have three children, a son and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749263","name":"Mark Ruffalo","idIMDB":"nm0749263"},"actorId":"nm0749263","character":"Brad Sullivan","urlCharacter":"http://www.imdb.com/character/ch0186164","main":true},{"actorName":"James Franco","urlProfile":"http://www.imdb.com/name/nm0290556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTc0MjE5NV5BMl5BanBnXkFtZTcwNjgyODQwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1978","placeOfBirth":" Palo Alto, California, USA","birthName":"James Edward Franco","height":"5' 11\" (1.8 m)","bio":"Known for his breakthrough starring role on Freaks and Geeks (1999), James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James's mother, a writer, has occasionally acted. Growing up with his two younger brothers, Dave Franco, also an actor, and Tom Franco, James graduated from Palo Alto High School in 1996 and went on to attend UCLA, majoring in English. To overcome his shyness, he got into acting while studying there, which, much to his parents' dismay, he left after only one year. After fifteen months of intensive study at Robert Carnegie's Playhouse West, James began actively pursuing his dream of finding work as an actor in Hollywood. In that short time, he landed himself a starring role on Freaks and Geeks (1999). The show, however, was not a hit to its viewers at the time, and was canceled after its first year. Now, it has become a cult-hit. Prior to joining Freaks and Geeks (1999), Franco starred in the TV miniseries To Serve and Protect (1999). After that, he had a starring role in Whatever It Takes (2000). Although he'd been working steadily, it wasn't until the TNT made-for-television movie, James Dean (2001) that James rose to fan-magazine fame and got to show off his talent. Since then, he has been working non-stop. After losing the lead role to Tobey Maguire, James settled for the part of \"Harry Osborne\", Spider-Man's best friend in the summer 2002 major hit Spider-Man (2002). He returned to the Osborne role for the next two films in the trilogy. Next was Deuces Wild (2002) and City by the Sea (2002), in which Robert De Niro personally had him cast, after viewing his performance in James Dean (2001). He was recently seen in David Gordon Green's Pineapple Express (2008) opposite Seth Rogen, in George C. Wolfe's Nights in Rodanthe (2008), starring Richard Gere and Diane Lane and in Paul Haggis' In the Valley of Elah (2007), starring Tommy Lee Jones. Also starring opposite Sean Penn in Gus Van Sant's Milk (2008) in which his performance earned him an Independent Spirit Award for Best Supporting Actor. Definitely growing out of his shyness, James Franco is turning into a legend of his own.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTc0MjE5NV5BMl5BanBnXkFtZTcwNjgyODQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0290556","name":"James Franco","nicknames":["Ted, Teddy"],"idIMDB":"nm0290556"},"actorId":"nm0290556","character":"Taste","urlCharacter":"http://www.imdb.com/character/ch0186165","main":true},{"actorName":"Mila Kunis","urlProfile":"http://www.imdb.com/name/nm0005109","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyNTQyNzY4MV5BMl5BanBnXkFtZTcwODg5MDA3MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1983","placeOfBirth":" Chernovtsy, Ukrainian SSR, USSR [now Chernivtsi, Ukraine]","birthName":"Milena Markovna Kunis","height":"5' 4\" (1.63 m)","bio":"The talented Milena \"Mila\" Markovna Kunis was born to a Jewish family in Chernivtsi, Ukraine, USSR (now independent Ukraine). Her mother, Elvira, is a physics teacher, her father, Mark Kunis, is a mechanical engineer, and she has an older brother named Michael. After attending one semester of college between gigs, she realized that she wanted to act for the rest of her life. She started acting when she was just 9 years old, when her father heard about an acting class on the radio and decided to enroll Mila in it. There, she met her future agent. Her first gig was in 1995, in which she played a character named Melinda in Make a Wish, Molly (1995). From there, her career skyrocketed into big-budget films. Although she is mostly known for playing Jackie Burkhart in That '70s Show (1998), she has shown the world that she can do so much more. Her breakthrough film was Forgetting Sarah Marshall (2008), in which she played a free-spirited character named Rachel Jensen. She has since starred or co-starred in the films The Book of Eli (2010), Black Swan (2010), Friends with Benefits (2011) and Ted (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyNTQyNzY4MV5BMl5BanBnXkFtZTcwODg5MDA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005109","name":"Mila Kunis","nicknames":["Goldfish"],"idIMDB":"nm0005109"},"actorId":"nm0005109","character":"Whippit","urlCharacter":"http://www.imdb.com/character/ch0186166","main":true},{"actorName":"Bill Burr","urlProfile":"http://www.imdb.com/name/nm0122987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDgwODg3NV5BMl5BanBnXkFtZTcwMTY5OTM3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1968","placeOfBirth":" Canton, Massachusetts, USA","height":"5' 10\" (1.78 m)","bio":"Bill Burr was born on June 10, 1968 in Canton, Massachusetts, USA. He is an actor and writer, known for Date Night (2010), Daddy's Home (2015) and Walk of Shame (2014). He has been married to Nia Renee Hill since October 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDgwODg3NV5BMl5BanBnXkFtZTcwMTY5OTM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122987","name":"Bill Burr","idIMDB":"nm0122987"},"actorId":"nm0122987","character":"Detective Walsh","urlCharacter":"http://www.imdb.com/character/ch0188436","main":true},{"actorName":"Jonathan Morgan Heit","urlProfile":"http://www.imdb.com/name/nm2384128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDhiMjBhNmUtY2I4Mi00OGI4LWFjODYtYmNmYjJhMGU5ZmY5XkEyXkFqcGdeQXVyMTc3NDg0ODE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 2000","placeOfBirth":" California, USA","height":"5' 8\" (1.73 m)","bio":"Jonathan Morgan Heit was born on July 16, 2000 in California, USA. He is an actor and director, known for Jake and the Never Land Pirates (2011), Bedtime Stories (2008) and Date Night (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDhiMjBhNmUtY2I4Mi00OGI4LWFjODYtYmNmYjJhMGU5ZmY5XkEyXkFqcGdeQXVyMTc3NDg0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2384128","name":"Jonathan Morgan Heit","idIMDB":"nm2384128"},"actorId":"nm2384128","character":"Oliver Foster","urlCharacter":"http://www.imdb.com/character/ch0188437","main":true}],"seasons":[],"idIMDB":"tt1279935","urlIMDB":"http://www.imdb.com/title/tt1279935","business":{"budget":{"money":"$55,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$25,207,599","country":"USA","day":"11","month":"04","year":"2010","remarks":"3,374 Screens"},{"money":"£1,272,405","country":"UK","day":"25","month":"04","year":"2010","remarks":"400 Screens"}],"gross":[{"money":"$98,711,404","country":"USA","day":"05","month":"09","year":"2010","remarks":""},{"money":"$98,700,494","country":"USA","day":"29","month":"08","year":"2010","remarks":""},{"money":"$98,684,123","country":"USA","day":"22","month":"08","year":"2010","remarks":""},{"money":"$98,656,335","country":"USA","day":"15","month":"08","year":"2010","remarks":""},{"money":"$98,608,430","country":"USA","day":"08","month":"08","year":"2010","remarks":""},{"money":"$98,537,862","country":"USA","day":"01","month":"08","year":"2010","remarks":""},{"money":"$98,428,001","country":"USA","day":"25","month":"07","year":"2010","remarks":""},{"money":"$98,258,664","country":"USA","day":"18","month":"07","year":"2010","remarks":""},{"money":"$98,002,746","country":"USA","day":"11","month":"07","year":"2010","remarks":""},{"money":"$97,697,723","country":"USA","day":"04","month":"07","year":"2010","remarks":""},{"money":"$97,320,419","country":"USA","day":"27","month":"06","year":"2010","remarks":""},{"money":"$96,883,257","country":"USA","day":"20","month":"06","year":"2010","remarks":""},{"money":"$96,266,718","country":"USA","day":"13","month":"06","year":"2010","remarks":""},{"money":"$95,334,452","country":"USA","day":"06","month":"06","year":"2010","remarks":""},{"money":"$94,005,365","country":"USA","day":"30","month":"05","year":"2010","remarks":""},{"money":"$90,748,818","country":"USA","day":"23","month":"05","year":"2010","remarks":""},{"money":"$86,522,622","country":"USA","day":"16","month":"05","year":"2010","remarks":""},{"money":"$81,002,725","country":"USA","day":"09","month":"05","year":"2010","remarks":""},{"money":"$73,604,361","country":"USA","day":"02","month":"05","year":"2010","remarks":""},{"money":"$63,471,596","country":"USA","day":"25","month":"04","year":"2010","remarks":""},{"money":"$63,332,819","country":"USA","day":"25","month":"04","year":"2010","remarks":""},{"money":"$48,666,799","country":"USA","day":"18","month":"04","year":"2010","remarks":""},{"money":"$25,207,599","country":"USA","day":"11","month":"04","year":"2010","remarks":""},{"money":"£3,795,016","country":"UK","day":"16","month":"05","year":"2010","remarks":""},{"money":"£3,520,884","country":"UK","day":"09","month":"05","year":"2010","remarks":""},{"money":"£2,625,161","country":"UK","day":"02","month":"05","year":"2010","remarks":""},{"money":"£1,272,405","country":"UK","day":"25","month":"04","year":"2010","remarks":""},{"money":"$152,263,880","country":"Worldwide","day":"09","month":"09","year":"2010","remarks":""}],"weekendGross":[{"money":"$7,159","country":"USA","day":"05","month":"09","year":"2010","remarks":"11 Screens"},{"money":"$10,205","country":"USA","day":"29","month":"08","year":"2010","remarks":"13 Screens"},{"money":"$15,026","country":"USA","day":"22","month":"08","year":"2010","remarks":"23 Screens"},{"money":"$24,387","country":"USA","day":"15","month":"08","year":"2010","remarks":"33 Screens"},{"money":"$29,879","country":"USA","day":"08","month":"08","year":"2010","remarks":"46 Screens"},{"money":"$60,265","country":"USA","day":"01","month":"08","year":"2010","remarks":"76 Screens"},{"money":"$83,632","country":"USA","day":"25","month":"07","year":"2010","remarks":"108 Screens"},{"money":"$133,391","country":"USA","day":"18","month":"07","year":"2010","remarks":"166 Screens"},{"money":"$188,563","country":"USA","day":"11","month":"07","year":"2010","remarks":"205 Screens"},{"money":"$250,435","country":"USA","day":"04","month":"07","year":"2010","remarks":"242 Screens"},{"money":"$241,385","country":"USA","day":"27","month":"06","year":"2010","remarks":"286 Screens"},{"money":"$360,904","country":"USA","day":"20","month":"06","year":"2010","remarks":"345 Screens"},{"money":"$601,291","country":"USA","day":"13","month":"06","year":"2010","remarks":"430 Screens"},{"money":"$775,810","country":"USA","day":"06","month":"06","year":"2010","remarks":"658 Screens"},{"money":"$2,307,657","country":"USA","day":"30","month":"05","year":"2010","remarks":"1,126 Screens"},{"money":"$2,913,504","country":"USA","day":"23","month":"05","year":"2010","remarks":"1,869 Screens"},{"money":"$3,823,515","country":"USA","day":"16","month":"05","year":"2010","remarks":"2,481 Screens"},{"money":"$5,448,257","country":"USA","day":"09","month":"05","year":"2010","remarks":"2,734 Screens"},{"money":"$7,577,352","country":"USA","day":"02","month":"05","year":"2010","remarks":"3,093 Screens"},{"money":"$10,600,000","country":"USA","day":"25","month":"04","year":"2010","remarks":"3,294 Screens"},{"money":"$10,461,223","country":"USA","day":"25","month":"04","year":"2010","remarks":"3,294 Screens"},{"money":"$16,720,038","country":"USA","day":"18","month":"04","year":"2010","remarks":"3,380 Screens"},{"money":"$25,207,599","country":"USA","day":"11","month":"04","year":"2010","remarks":"3,374 Screens"},{"money":"£127,785","country":"UK","day":"16","month":"05","year":"2010","remarks":"236 Screens"},{"money":"£336,345","country":"UK","day":"09","month":"05","year":"2010","remarks":"330 Screens"},{"money":"£783,393","country":"UK","day":"02","month":"05","year":"2010","remarks":"403 Screens"},{"money":"£1,272,405","country":"UK","day":"25","month":"04","year":"2010","remarks":"400 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)","1 hr 41 min (101 min) (extended)"],"soundMix":["Dolby","DTS","SDDS","Dolby SR"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Genesis HD Camera"],"laboratory":["DeLuxe","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["2.39 m (35 mm)"],"negativeFormat":["Video (HDTV)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (1080p/24) (source format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"6,3","metascore":"56","filmingLocations":[{"location":"608 Vallombrosa Dr, Pasadena, California, USA"}],"rated":"PG-13","awards":[{"award":"AARP Movies for Grownups Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Movies for Grownups Award","categories":[{"category":"Best Comedy","names":[]}]}]},{"award":"Broadcast Film Critics Association Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Comedy Movie","names":[]}]}]},{"award":"Casting Society of America, USA 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Big Budget Feature - Comedy","names":[{"name":"Donna Isaacson","id":"nm0410583","role":null}]}]}]},{"award":"Central Ohio Film Critics Association 2011","titlesAwards":[{"titleAwardOutcome":"Won COFCA Award","categories":[{"category":"Actor of the Year","names":[{"name":"James Franco","id":"nm0290556","role":null},{"name":"127 Hours","id":"tt1542344","role":null},{"name":"Eat Pray Love","id":"tt0879870","role":null},{"name":"Howl","id":"tt1049402","role":null}]}]}]},{"award":"People's Choice Awards, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite On-Screen Team","names":[{"name":"Steve Carell","id":"nm0136797","role":null},{"name":"Tina Fey","id":"nm0275486","role":null}]},{"category":"Favorite Comedy Movie","names":[]}]}]},{"award":"Teen Choice Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Choice Movie: Comedy","names":[]},{"category":"Choice Movie Actress: Comedy","names":[{"name":"Tina Fey","id":"nm0275486","role":null}]}]},{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actor: Comedy","names":[{"name":"Steve Carell","id":"nm0136797","role":null}]},{"category":"Choice Movie: Dance","names":[{"name":"Tina Fey","id":"nm0275486","role":null},{"name":"Steve Carell","id":"nm0136797","role":null}]},{"category":"Choice Movie: Male Scene Stealer","names":[{"name":"Mark Wahlberg","id":"nm0000242","role":null}]}]}]},{"award":"World Stunt Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won Taurus Award","categories":[{"category":"Best Work with a Vehicle","names":[{"name":"Erik Solky","id":"nm0813138","role":null},{"name":"Debbie Evans","id":"nm0262700","role":null},{"name":"Corey Michael Eubanks","id":"nm0262277","role":null},{"name":"Jalil Jay Lynch","id":"nm0528324","role":null},{"name":"Katie Eischen","id":"nm2603844","role":null}]}]}]}],"votes":"132 170","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0158853","name":"21 Laps Entertainment"},{"idCompany":"co0174373","name":"Dune Entertainment"}],"keywords":{"keywords":["reservation","city","night","restaurant","new york city","mistaken identity","woman wearing glasses","vomiting","suburb","eyeglasses","dating","black comedy","tracksuit","xbox 360","cartoon on tv","2010s","thong","urban setting","threat","prostitute","policewoman","broken windshield","running","gun","shot at the camera","firearm pointed at the camera","one night","sexual humor","car driving","car","talking while driving","kiss","marriage","locked bumpers","soccer mom","writing on hand","wedding ring","tax adviser","motorcycle","sports car","israeli","investigation","surveillance footage","surveillance","security camera","burglary","female detective","police officer","police","boat","knocked out","chase","alley","brooklyn bridge","chrysler building manhattan new york city","real estate agent","irs agent","lawyer","cell phone","family relationships","brother sister relationship","montage","father daughter relationship","father son relationship","mother daughter relationship","mother son relationship","surprise after end credits","scene after end credits","surprise during end credits","diner","dressing room","bouncer","train","hit by a car","photograph","arrest","farce","time lapse photography","mexican standoff","corrupt official","italian american","crime boss","gangster","payphone","tattoo","apartment","pole dancer","videotape","thief","boyfriend girlfriend relationship","rooftop","scene during end credits","coincidence","standoff","babysitter","breaking a window","antique gun","times square manhattan new york city","news report","corruption","cameo","camera phone","walking into a door","foot chase","wine","swat team","police raid","wearing a sound wire","outtakes during end credits","book club","tattoo on chest","on the run","broom","stripper","wig","subtitled scene","bare chested male","stealing a car","car chase","car crash","car accident","alarm","shooting","corrupt cop","corrupt politician","video camera","bar","estranged couple","held at gunpoint","pistol","nanny","helicopter","roof","pole dance","disguise","subway","car falls into water","taxi driver","taxi","argument","breaking and entering","strip club","security expert","central park manhattan new york city","mobster","detective","police station","lake","escape","paddle","boathouse","central park chase","flash drive","steakhouse","dinner date","manhattan new york city","new jersey","husband wife relationship","district attorney","police chase","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:58:51"}}