{"data":{"movies":[{"title":"A Good Old Fashioned Orgy","originalTitle":"","year":"2011","releaseDate":"20111027","directors":[{"name":"Alex Gregory","id":"nm0339733"},{"name":"Peter Huyck","id":"nm0404752"}],"writers":[{"name":"Alex Gregory","id":"nm0339733"},{"name":"Peter Huyck","id":"nm0404752"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQwNzAxNjA1MF5BMl5BanBnXkFtZTcwNjI2MzcxNQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"A group of 30-year-olds who have been friends since high school attempt to throw an end-of-summer orgy.","simplePlot":"A group of 30-year-olds who have been friends since high school attempt to throw an end-of-summer orgy.","actors":[{"actorName":"Jason Sudeikis","urlProfile":"http://www.imdb.com/name/nm0837177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjIyNjExMV5BMl5BanBnXkFtZTgwOTQ4NzcyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1975","placeOfBirth":" Fairfax, Virginia, USA","birthName":"Daniel Jason Sudeikis","height":"6' 1\" (1.85 m)","bio":"Daniel Jason Sudeikis was born on September 18, 1975 in Fairfax, Virginia, to Kathryn (Wendt), a former travel agent at Brennco and president of the American Society of Travel Agents, and Daniel Joseph Sudeikis, a vice president of business development. He is of Lithuanian and Irish descent on his father's side, and German and Irish ancestry on his mother's. As a child, he moved with his family to Overland Park, Kansas, which he has described as his hometown. He attended Brookridge Elementary School before transferring to Holy Cross Catholic School; both are located in Overland Park. He began high school at the Jesuit Rockhurst High School in 1990, later transferring due to academic reasons to Shawnee Mission West High School. He began performing at ComedySportz (now Comedy City) in Kansas City. After moving to Chicago, he studied at the Annoyance Theatre and ImprovOlympic, where he was one of the founding members of the long-form team J.T.S. Brown. He was later cast in The Second City's National Touring Company, and also performed with Boom Chicago in Amsterdam. In the early 2000s, he became a founding member of Second City Las Vegas. He continues to frequently perform at the Upright Citizens Brigade Theatre's weekly improv show ASSSCAT 3000 in New York City. In 2003, while a regular performer at Second City Las Vegas, he was hired as a sketch writer for NBC's Saturday Night Live (1975) and would occasionally make bit appearances as audience members or extras. In May 2005, he became a featured player and was upgraded to repertory status in 2006. In July 2013, he announced that he was leaving SNL. In 2007-2010, he had a recurring role as Floyd on NBC's 30 Rock (2006), playing the love interest of Liz Lemon (played by friend Tina Fey) and appearing in 12 episodes. His voice-over work include video-game Grand Theft Auto IV (2008), playing the role of right-wing radio host Richard Bastion. In 2008, he also appeared in the comedy What Happens in Vegas (2008), playing the role of Cameron Diaz's character's ex-fiancé, in The Rocker (2008) as David Marshall, opposite Rainn Wilson, Emma Stone, and Josh Gad, in Semi-Pro (2008) as Nacho Fan, in Childrens Hospital (2008) as Dr. Robert 'Bobby' Fiscus, and co-starred with Bill Hader and Joe Lo Truglio in the Lorne Michaels-produced web-series \"The Line on Crackle\". In 2010, he appeared in The Bounty Hunter (2010), alongside Jennifer Aniston and Gerard Butler, playing a colleague of Aniston's character, who falls in love with her, in Going the Distance (2010) as Box, and also co-hosted WWE Raw: Episode #18.33 (2010) with his \"Going the Distance\" co-stars Charlie Day and Justin Long at the Staples Center in Los Angeles. He also worked with Day on It's Always Sunny in Philadelphia (2005) playing Schmitty on two episodes. In FOX's animated comedy The Cleveland Show (2009), he provided the voices of Holt Richter and Terry Kimple in almost all of episodes until the series' end in 2013, and had a recurring role on the cult comedy Eastbound & Down (2009). His first lead film role, alongside Owen Wilson, was in Farrelly brothers comedy Hall Pass (2011). That year, he also appeared in Seth Gordon comedy Horrible Bosses (2011), opposite Jamie Foxx, Kevin Spacey, Jennifer Aniston, Colin Farrell, Charlie Day, and Jason Bateman, and in A Good Old Fashioned Orgy (2011). He also hosted 2011 MTV Movie Awards (2011). His other movies include The Campaign (2012), opposite Will Ferrell and Zach Galifianakis, Movie 43 (2013), Drinking Buddies (2013), Epic (2013), and We're the Millers (2013). He also starred in Horrible Bosses 2 (2014), and in Sleeping with Other People (2015). He can also be seen in the romantic comedy, Tumbledown (2015) opposite Rebecca Hall and in La couleur de la victoire (2016) as Larry Snyder, Jesse Owens' coach. He is also Henry, a widowed and introverted architect, in The Book of Love (2016), in Mother's Day (2016), opposite Jennifer Aniston for the fifth time, is the voice of Red in The Angry Birds Movie (2016), and is playing a recurring character, Mike Miller, on The Last Man on Earth (2015). He is also starring in Masterminds (2016), opposite Zach Galifianakis, Owen Wilson, and Kristen Wiig, in Colossal (2016), opposite Anne Hathaway, in Permission (2017), again with Rebecca Hall, in Son of Zorn (2016) as the voice of Zorn, and in Alexander Payne's Downsizing (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjIyNjExMV5BMl5BanBnXkFtZTgwOTQ4NzcyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0837177","name":"Jason Sudeikis","nicknames":["Suds"],"idIMDB":"nm0837177"},"actorId":"nm0837177","character":"Eric","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leslie Bibb","urlProfile":"http://www.imdb.com/name/nm0004753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzAzNzE5N15BMl5BanBnXkFtZTcwMjMyODM0MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1974","placeOfBirth":" Bismarck, North Dakota, USA","birthName":"Leslie Louise Bibb","height":"5' 9\" (1.75 m)","bio":"Leslie Louise Bibb was born in Bismarck, North Dakota, on November 17, 1974, and raised in Nelson County, Virginia. Later she and her mother, along with her three older sisters, moved to Richmond, where Leslie attended an all-girls Catholic high school, St. Gertrude. In 1990 The Oprah Winfrey Show (1986) and the Elite Agency held a nationwide modeling search; Leslie's mother took photos of her then 16-year-old daughter and sent them in. Although Leslie wasn't impressed with the photos, the judges--John Casablancas, Naomi Campbell, Linda Evangelista and Iman--were, and they picked her as the winner. After finishing her junior year, Leslie flew to New York City and signed a contract with Elite. She modeled over the summer, and went on a trip to Japan. She returned home for her senior year and graduated in 1992, then decided to forgo a full-time modeling career to attend the University of Virginia. After a single semester, however, she dropped out and moved to New York City. She attended the William Esper acting studio for three years and took nine months off in which she did more modeling in Europe. Her photographs have appeared in such magazine as Maxim and FHM. Leslie had her first film role in the comedy Private Parts (1997), which was followed by her first television series (where she replaced the departed Susan Walters as the female lead) in the second season of The Big Easy (1996) on USA. Unfortunately, the show was canceled just months later. In 1999 she appeared as the lead character on the WB Network television series Popular (1999). The show was a success among teenagers, and led Leslie to more recognizable film roles, such as The Skulls (2000) and See Spot Run (2001). Most recently she has appeared as intern Erin Harkins in ER (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzAzNzE5N15BMl5BanBnXkFtZTcwMjMyODM0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004753","name":"Leslie Bibb","nicknames":["The Bibbster, Lulu"],"idIMDB":"nm0004753"},"actorId":"nm0004753","character":"Kelly","urlCharacter":"http://www.imdb.com/character/ch0303562","main":true},{"actorName":"Lake Bell","urlProfile":"http://www.imdb.com/name/nm1128572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMzMzMDk5NV5BMl5BanBnXkFtZTgwNTEzODY3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1979","placeOfBirth":" New York City, New York, USA","birthName":"Lake Caroline Siegel Bell","height":"5' 8\" (1.73 m)","bio":"Lake Bell was born on March 24, 1979 in New York City, New York, USA as Lake Caroline Siegel Bell. She is an actress and director, known for In a World... (2013), What Happens in Vegas (2008) and No Strings Attached (2011). She has been married to Scott Campbell since June 1, 2013. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMzMzMDk5NV5BMl5BanBnXkFtZTgwNTEzODY3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1128572","name":"Lake Bell","idIMDB":"nm1128572"},"actorId":"nm1128572","character":"Alison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Borth","urlProfile":"http://www.imdb.com/name/nm1218924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0Mjc4MTE5N15BMl5BanBnXkFtZTYwODk5MzEy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1978","placeOfBirth":" Secaucus, New Jersey, USA","height":"5' 6\" (1.68 m)","bio":"Michelle Borth was born on August 19, 1978 in Secaucus, New Jersey, USA. She is an actress and producer, known for Hawaii Five-0 (2010), A Good Old Fashioned Orgy (2011) and The Forgotten (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0Mjc4MTE5N15BMl5BanBnXkFtZTYwODk5MzEy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1218924","name":"Michelle Borth","idIMDB":"nm1218924"},"actorId":"nm1218924","character":"Sue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Kroll","urlProfile":"http://www.imdb.com/name/nm1802209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NTUwODA4OF5BMl5BanBnXkFtZTcwMjk3MzU0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1978","placeOfBirth":" New York City, New York, USA","birthName":"Nicholas J. Kroll","height":"5' 9\" (1.75 m)","bio":"Nick Kroll was born on June 5, 1978 in New York City, New York, USA as Nicholas J. Kroll. He is an actor and writer, known for The League (2009), I Love You, Man (2009) and Sausage Party (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NTUwODA4OF5BMl5BanBnXkFtZTcwMjk3MzU0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1802209","name":"Nick Kroll","idIMDB":"nm1802209"},"actorId":"nm1802209","character":"Adam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tyler Labine","urlProfile":"http://www.imdb.com/name/nm0479527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM1NDQxMDAzNF5BMl5BanBnXkFtZTcwMDUxNjc1Ng@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1978","placeOfBirth":" Brampton, Ontario, Canada","height":"6' (1.83 m)","bio":"Tyler Labine was born on April 29, 1978 in Brampton, Ontario, Canada. He is an actor and producer, known for Tucker & Dale fightent le mal (2010), Rise of the Planet of the Apes (2011) and Monsters University (2013). He has been married to Carrie Ruscheinsky since June 2, 2007. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM1NDQxMDAzNF5BMl5BanBnXkFtZTcwMDUxNjc1Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0479527","name":"Tyler Labine","idIMDB":"nm0479527"},"actorId":"nm0479527","character":"McCrudden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angela Sarafyan","urlProfile":"http://www.imdb.com/name/nm1494168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzZiZTZkYjUtNDRlNi00N2JlLWIzODAtYWUwM2ViMDhmOGY2XkEyXkFqcGdeQXVyMjc5ODg5NTc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1983","placeOfBirth":" Yerevan, Armenian SSR, USSR [now Armenia]","height":"5' 8\" (1.73 m)","bio":"Angela Sarafyan is an Armenian American actress. She has appeared as a guest-star in several television series such as Judging Amy (1999) and Buffy the Vampire Slayer (1997). Sarafyan has acted in the feature films: On the Doll (2007), Kabluey (2007), The Informers (2008), A Beautiful Life (2008), The Twilight Saga: Breaking Dawn - Part 2 (2012), A Good Old Fashioned Orgy (2011), and Lost and Found in Armenia (2012). In 2016 she starred as Clementine Pennyfeather in HBO's Westworld (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzZiZTZkYjUtNDRlNi00N2JlLWIzODAtYWUwM2ViMDhmOGY2XkEyXkFqcGdeQXVyMjc5ODg5NTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1494168","name":"Angela Sarafyan","idIMDB":"nm1494168"},"actorId":"nm1494168","character":"Willow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lindsay Sloane","urlProfile":"http://www.imdb.com/name/nm0005441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY4ODkxN15BMl5BanBnXkFtZTcwMjc4NjE4MQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1977","placeOfBirth":" Long Island, New York, USA","birthName":"Lindsay Sloane Leikin","height":"5' 4\" (1.63 m)","bio":"Admitting to her own lively nature as a child, Sloane took up acting as an outlet for her energy. She developed a real love for the art and signed with an agent at the tender age of 8. Sloane was a television series regular on Mr. Rhodes (1996) and had a recurring role on The Wonder Years (1988). She has also appeared on Dharma & Greg (1997), Working (1997) and My So-Called Life (1994), as well as the made-for-television movie, CBS Schoolbreak Special: Between Mother and Daughter (1995). Sloane's theater experience included \"Emperor's New Clothes\", \"Say Yo Ho Ho\", \"Rumors\" and \"Cabaret\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY4ODkxN15BMl5BanBnXkFtZTcwMjc4NjE4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005441","name":"Lindsay Sloane","idIMDB":"nm0005441"},"actorId":"nm0005441","character":"Laura","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Starr","urlProfile":"http://www.imdb.com/name/nm0771414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NzY3NzAxMl5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1982","placeOfBirth":" Santa Monica, California, USA","height":"6' 1\" (1.85 m)","bio":"Martin Starr was born on July 30, 1982 in Santa Monica, California, USA. He is an actor, known for Knocked Up (2007), This Is the End (2013) and Superbad (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NzY3NzAxMl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0771414","name":"Martin Starr","idIMDB":"nm0771414"},"actorId":"nm0771414","character":"Duquez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rhys Coiro","urlProfile":"http://www.imdb.com/name/nm1711052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzODExMzY1MF5BMl5BanBnXkFtZTcwNjA2NDIzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1979","placeOfBirth":" Calabria, Italy","height":"6' 2\" (1.88 m)","bio":"As a teenager, Coiro, a talented visual artist, spent summers building sets and operating lights at the New Jersey Shakespeare Festival. Inspired by numerous productions, including Julie Taymor's \"Titus Andronicus\" at Theater For A New Audience, Coiro decided to study theater at Carnegie Mellon University, where he eventually graduated with a BFA. He also spent time studying at The Moscow Art Theater in Russia. Coiro got his first professional gig as an understudy to three roles in the American premiere of Conor McPherson's off-Broadway play \"This Lime Tree Bower\" directed by Harris Yulin at Primary Stages. Within a month of graduating from CMU, Coiro landed the role of Eddie the Bellhop in the Lincoln Center revival of George S. Kauffman's \"Dinner at Eight\", directed by the late Gerald Gutierrez. Coiro then moved to Los Angeles and began working in construction, including a stint building a house with Nick Offerman. As recounted on Jerry Ferrara's podcast \"Bad 4 Business\", Coiro received the call that he'd landed his first on-screen acting gig, as Billy Walsh on \"Entourage\", while digging a hole for a deck in Echo Park. The role of Walsh was originally meant to be a guest star but soon evolved into an iconic character that has defined Coiro's career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzODExMzY1MF5BMl5BanBnXkFtZTcwNjA2NDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1711052","name":"Rhys Coiro","idIMDB":"nm1711052"},"actorId":"nm1711052","character":"Marcus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Forte","urlProfile":"http://www.imdb.com/name/nm0287182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE5ODkwNTg4Nl5BMl5BanBnXkFtZTcwODcwMTY1OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1970","placeOfBirth":" Alameda County, California, USA","birthName":"Orville Willis Forte IV","height":"5' 9\" (1.75 m)","bio":"Forte was age 32 before he came to the public's attention on Saturday Night Live (1975), but had been working in comedy since 1997. Forte is the son of artist Patricia (Stivers) and financial broker Orville Willis Forte III (divorced), and has one older sister, Michelle. A creative and artistic child, he was an athlete (football and swimming) in high school and voted Best Personality at Acalanes High School. After graduating from UCLA with a degree in History, Forte had a brief career at a brokerage house before deciding to try comedy. Although he rarely performed stand-up, he joined the world-famous \"Groundlings\" and was hired as a writer for the series The Jenny McCarthy Show (1997), The Army Show, and The David Letterman Show. He eventually caught the attention of Carsey-Werner executive Tom Werner when he wrote a pilot about two childlike idiot brothers (eventually turned into the film, The Brothers Solomon (2007)) and was hired for the shows 3rd Rock from the Sun (1996) and That '70s Show (1998). In 2002, Forte moved from his home state of California to New York City to join Saturday Night Live (1975) as a writer and cast member. Although known as shy and reserved in his personal life, Forte was one of the individuals responsible for the shows move to absurd, surrealist comedy. Along with voice-over acting, guest appearances on television and small roles in films, Forte had his biggest opportunities to be a movie star with films he wrote. Forte wrote the screenplay for The Brothers Solomon (2007) (and had the leading role of childlike \"Dean Solomon\") and played the title role and co-wrote the SNL film MacGruber (2010). Both films were given small budgets ($10,000,000 each) and they were both considered box-office and critical failures, although they do have a cult following. After MacGruber's theatrical release, Forte left SNL for personal and professional reasons, although he has returned as a guest performer. Forte has had a recurring role on the series 30 Rock and made numerous other guest appearances on other TV comedies. Since leaving SNL, he has also increased his work as a voice artist and appeared in 5 movies (A Good Old Fashioned Orgy (2011), Tim and Eric's Billion Dollar Movie (2012), Rock of Ages (2012), That's My Boy (2012), and The Watch (2012)). Since 2012, he has moved into dramatic and straight roles on a television pilot titled Rebounding by the producers of Modern Family and Irish film Run and Jump. In August 2012, he was cast (and first choice) in the Alexander Payne film Nebraska, despite rumors that higher profile actors such as Casey Affleck and Paul Rudd were interested in the role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE5ODkwNTg4Nl5BMl5BanBnXkFtZTcwODcwMTY1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0287182","name":"Will Forte","idIMDB":"nm0287182"},"actorId":"nm0287182","character":"Glenn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Haas","urlProfile":"http://www.imdb.com/name/nm4568069","urlPhoto":"","biography":{"bio":"Kelly Haas is an actress, known for A Good Old Fashioned Orgy (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4568069","name":"Kelly Haas","idIMDB":"nm4568069"},"actorId":"nm4568069","character":"Ice Cream Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Harding","urlProfile":"http://www.imdb.com/name/nm0362268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU2NzY1NjU4M15BMl5BanBnXkFtZTcwNzQ4OTg0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Michael Harding is an actor, known for Shock and Awe (2017), The Walking Dead (2010) and Criminal Minds (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU2NzY1NjU4M15BMl5BanBnXkFtZTcwNzQ4OTg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362268","name":"Michael Harding","idIMDB":"nm0362268"},"actorId":"nm0362268","character":"Mr. Weber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jan Harrelson","urlProfile":"http://www.imdb.com/name/nm1169029","urlPhoto":"","biography":{"height":"6' (1.83 m)","bio":"Jan Harrelson is an actor, known for A Good Old Fashioned Orgy (2011), Parental Guidance (2012) and Sea Odyssey (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1169029","name":"Jan Harrelson","idIMDB":"nm1169029"},"actorId":"nm1169029","character":"Emcee / DJ","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Hungerford","urlProfile":"http://www.imdb.com/name/nm0402235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NTczODQ4M15BMl5BanBnXkFtZTgwMjM5MzczMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Bob Hungerford is an actor and producer, known for The Secret Life of Bees (2008), A Good Old Fashioned Orgy (2011) and Deceiver (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NTczODQ4M15BMl5BanBnXkFtZTgwMjM5MzczMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0402235","name":"Bob Hungerford","idIMDB":"nm0402235"},"actorId":"nm0402235","character":"Farmer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1231586","urlIMDB":"http://www.imdb.com/title/tt1231586","business":{"budget":null,"openingWeekend":[{"money":"$117,564","country":"USA","day":"04","month":"09","year":"2011","remarks":"145 Screens"}],"gross":[{"money":"$154,604","country":"USA","day":"04","month":"09","year":"2011","remarks":""}],"weekendGross":[{"money":"$117,564","country":"USA","day":"04","month":"09","year":"2011","remarks":"145 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"18","month":"05","year":"2008","remarks":null},null],"copyrightHolder":"GOF Productions LLC"},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby Digital","DTS (as Datasat Digital Sound)","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Cameras, Panavision Primo Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm","Digital","Digital (Digital Cinema Package DCP)"]},"rating":"6.2","metascore":"44","filmingLocations":[{"location":"11125 Hwy 17 N. Wilmington, North Carolina, USA"}],"rated":"R","awards":[],"votes":"18,616","type":"Movie","companyCreditsSimple":[{"idCompany":"co0112971","name":"Endgame Entertainment"},{"idCompany":"co0308369","name":"Aura Film Partnership"},{"idCompany":"co0095383","name":"Fierce Entertainment"}],"keywords":{"keywords":["orgy","female nudity","pegging","friend","30 year old","bikini","pubic hair","male pubic hair","kama sutra","absinthe","sex shop","growing up","summer home","father son relationship","male nudity","lawnmower race","strap on dildo","male full frontal nudity","hamptons long island new york","party","beach","inflatable raft","raft","pushed into water","pushed into a swimming pool","cow","t shirt","drunkenness","reference to the goonies","labor day","swimming","group of friends","friendship","swimming pool","summer","sex scene","kiss","gay kiss","rubbing noses","house","long title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:42:22"}}