{"data":{"movies":[{"title":"Jesse Jane: Sexy Hot","originalTitle":"","year":"2008","releaseDate":"2008","directors":[{"name":"Bunny Luv","id":"nm0527644"}],"runtime":"119 min","countries":["USA"],"languages":["English"],"genres":["Adult"],"simplePlot":"","actors":[{"actorName":"Jesse Jane","urlProfile":"http://www.imdb.com/name/nm1377478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjQ0NzQyN15BMl5BanBnXkFtZTcwNDk4MjIzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1980","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Cindy Taylor","height":"5' 3\" (1.6 m)","bio":"A \"military brat\", Jesse Jane grew up on military bases and was somewhat of a tomboy. She combined her love of sports with her long training in dance and became a top cheerleader in high school. After graduation she began doing TV commercials, including one for the \"Hooters\" restaurant chain. She won several \"Hawaiian Tropics\" beauty contests and managed to snag a role in Baywatch: Hawaiian Wedding (2003). She was named \"Miss Photogenic\" by the American Dreams Pageant, and soon afterwards embarked on a career as a top bikini model. Her desire to break into the film business led her to sign a contract with adult-film production company Digital Playground. The films the company put her in have proved extremely popular, as has her line of sex toys. Her films have been nominated for numerous AVN awards, as has she herself, and in 2004 AFW put her on the cover of its directory.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjQ0NzQyN15BMl5BanBnXkFtZTcwNDk4MjIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1377478","name":"Jesse Jane","idIMDB":"nm1377478"},"actorId":"nm1377478","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eva Angelina","urlProfile":"http://www.imdb.com/name/nm1617461","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjM1MDUzMF5BMl5BanBnXkFtZTcwOTAyMTg2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1985","placeOfBirth":" Huntington Beach, California, USA","birthName":"Nicole Frances Clyne","height":"5' 3\" (1.6 m)","bio":"Tiny (5'3\"), but busty and shapely hazel-eyed brunette knockout Eva Angelina was born Nicole Clyne on March 14, 1985 in Huntington Beach, California. She's of Irish, English, Cuban, and Chinese descent. Angelina spent the first two years of her life in Madrid, Spain. After her father was hired by the Swiss military to build airplanes for the country when she was eight years old, Eva lived in Switzerland for two years. Angelina grew up as a teenager in Orange County, California, where she attended Foothill High School. Eva did her first hardcore sex scene three months after her 18th birthday. Angelina is well known for wearing glasses in many of her adult movies. From May to November in 2004 Eva took a temporary hiatus from adult cinema; during this time she returned to school and worked at the Macaroni Grill. Angelina was the Pet of the Month in the June, 2010 issue of Penthouse magazine. She was named one of the top 12 stars in porn by Maxim magazine that same year. Among the awards Eva has won for her work in adult films are a XRCO Award for Single Performance - Actress and an AVN Award for Best Actress - Video in 2008, a XRCO Award for Orgasmic Analist and an AVN Award for Best All-Girl Group Sex Scene in 2010, and an AVN Award for Best Tease Performance in 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjM1MDUzMF5BMl5BanBnXkFtZTcwOTAyMTg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1617461","name":"Eva Angelina","idIMDB":"nm1617461"},"actorId":"nm1617461","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marco Banderas","urlProfile":"http://www.imdb.com/name/nm1588274","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyZDFjMGQtODVmYy00MGZlLWFjNWMtYWQ1M2FhZDNjMzhlXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1967","placeOfBirth":" Montevideo, Uruguay","height":"6' 2\" (1.88 m)","bio":"Tall, muscular and exotic, Marco Banderas is another one of the veterans in the adult industry, today. Debuting in 2003, at age 36, Marco wasted no time in showing how well he can perform on camera and how dedicated he is to the business he loves so much. In addition to his on-screen appearances, Marco Banderas also lent his hand in the directorial capacity of the porn world. His credits as a performer top well over 1,000 since his starting year and they continue to grow as time marches on. The product of Uruguay, gave to the porn industry a versatile performer, director and singer who obviously has longevity in whatever business he chooses to be apart of.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyZDFjMGQtODVmYy00MGZlLWFjNWMtYWQ1M2FhZDNjMzhlXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1588274","name":"Marco Banderas","idIMDB":"nm1588274"},"actorId":"nm1588274","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Audrey Bitoni","urlProfile":"http://www.imdb.com/name/nm2483560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGM3Yzk3NzUtYTM0ZS00ZGY2LWEzYzAtYzlkOTU5ZTlhODExXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Audrey Arroyo","height":"5' 4¼\" (1.63 m)","bio":"Buxom, gorgeous, and curvaceous brunette knockout Audrey Bitoni was born Audrey Arroyo on August 16, 1986 in Anaheim, Los Angeles, California. She's of German, Spanish, and Italian descent. Bitoni grew up in Chicago, Illinois. Audrey attended Arizona State University, where she graduated with a B.A. in Communications in 2006. Moreover, it was while attending Arizona State University that Bitoni answered a Playboy magazine call for a college newsstand special edition which she eventually wound up gracing the cover of. Audrey first began performing in explicit hardcore movies in 2006. Bitoni was nominated for an AVN Award for Best New Starlet in 2008. In addition, Audrey was the cover girl for and featured centerfold in the November, 2008 issue of Club International magazine as well as the Pet of the Month in the November, 2008 issue of Penthouse magazine. Bitoni has not only worked for various adult websites that include Twistys, Brazzers, and Aziani Models, but also has modeled for noted adult photographers Suze Randall and Holly Randall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGM3Yzk3NzUtYTM0ZS00ZGY2LWEzYzAtYzlkOTU5ZTlhODExXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2483560","name":"Audrey Bitoni","idIMDB":"nm2483560"},"actorId":"nm2483560","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Deen","urlProfile":"http://www.imdb.com/name/nm1776976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAzMzI5MDleQTJeQWpwZ15BbWU3MDY0NDE3MTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1986","placeOfBirth":" Pasadena, California, USA","birthName":"Bryan Matthew Sevilla","height":"5' 7\" (1.7 m)","bio":"At the age of 12, James was first called \"James Deen\" due to the way he smoked. As a teenager he listened to an interview with Jenna Jameson on the nationally syndicated radio program, \"Loveline.\" When a male caller asked Jenna how he could become a porn star. She responded that he needed to be able to masturbate in a room full of 20 of his best friends. Taking this advice to heart, James began having sex at parties and Raves. He credits this exhibitionist behavior with helping him perform in front of the camera. At the age of 17, James was attending a community college in Pasadena. While there, he decided to break into the adult film industry by meeting girls who had connections to the porn industry. Through these connections, James was introduced to Pamela Peaks who helped him choose his old nickname as his stage name (other options included Clint Cullingus). Deen was represented at that time by World Modeling. However, it was difficult for him to find work due to only being 18 and having no on-screen experience. Deen's first big break came in 2004 when Eon McKai cast him in Art School Sluts (2004). During the first year of his adult film career, James Deen worked on nearly 500 scenes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAzMzI5MDleQTJeQWpwZ15BbWU3MDY0NDE3MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1776976","name":"James Deen","idIMDB":"nm1776976"},"actorId":"nm1776976","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Manuel Ferrara","urlProfile":"http://www.imdb.com/name/nm1279296","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDQyODAwN15BMl5BanBnXkFtZTcwMzc1MDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1975","placeOfBirth":" Gagny, Seine-Saint-Denis, France","birthName":"Manuel Jeannin","height":"6' (1.83 m)","bio":"Manuel Ferrara was born on November 1, 1975 in Gagny, Seine-Saint-Denis, France as Manuel Jeannin. He is an actor and director. He is married to Kayden Kross. They have one child. He was previously married to Dana Vespoli.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDQyODAwN15BMl5BanBnXkFtZTcwMzc1MDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1279296","name":"Manuel Ferrara","idIMDB":"nm1279296"},"actorId":"nm1279296","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Gunn","urlProfile":"http://www.imdb.com/name/nm0348237","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTM3Nzk1NF5BMl5BanBnXkFtZTcwNTQ2ODUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1967","placeOfBirth":" Cherry Hill, New Jersey, USA","birthName":"Thomas Joseph Strada","height":"5' 8\" (1.73 m)","bio":"Veteran porn actor Tommy Gunn was born Thomas Joseph Strada in Cherry Hill, New Jersey. A self-described \"hyper kid\" who needed a great deal of attention due to his small stature, he often asked his mother, \"When will I grow up?\" During his early years Tommy grew interested in sports, BMX bicycles and motorcycles, in addition to soccer. He was shy around girls for quite some time until he noticed how girls were interested in bigger and \"buffer\" guys, so he took up bodybuilding. He entered a \"hot body\" contest in a local bar, and although he lost the contest, he met a man who offered him work as a stripper. For ten years Tommy worked as a male stripper, traveling all over the country and the world. One of his girlfriends, who was also a stripper, asked him to join her on a trip to Los Angeles to become a porn star. While out there he met Brad Armstrong, another porn actor, who took Tommy under his wing and helped him establish what turned into a thriving career. For his work Tommy has won the AVN Best Supporting Actor (2006) and in 2007 won the AVN Male Performer of the Year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTM3Nzk1NF5BMl5BanBnXkFtZTcwNTQ2ODUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0348237","name":"Tommy Gunn","idIMDB":"nm0348237"},"actorId":"nm0348237","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Sins","urlProfile":"http://www.imdb.com/name/nm2356225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmYxZGQyMGYtZWYwZC00ZTI0LWE0ZTQtMDA4OThjZTAzNjQwXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1978","placeOfBirth":" Pennsylvania, USA","birthName":"Steve Wolfe","height":"6' (1.83 m)","bio":"Undoubtedly, one of the most popular performers in porn as far as the Millenium-class are concerned, is Johnny Sins. Tall, muscular and well-endowed as often talked about by his fans, Johnny made his entrance into the porn industry in 2006. He has been working ever since and has worked with top production companies and studios. It is said, he maintains a consistent regimen which is proof of his chiseled physique and helps keep his performance quality always top-notch. He has filmed with the industries most popular performers, most notably Lisa Ann. Johnny has undoubtedly been deemed as what women love and what men want to be like.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmYxZGQyMGYtZWYwZC00ZTI0LWE0ZTQtMDA4OThjZTAzNjQwXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2356225","name":"Johnny Sins","idIMDB":"nm2356225"},"actorId":"nm2356225","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sarah Vandella","urlProfile":"http://www.imdb.com/name/nm2770048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDI2OWMyMGYtODVlZS00YWZkLWE2YjMtMDEwMWQ4ZTZkOTAwXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1983","placeOfBirth":" Hauppauge, Long Island, New York, USA","height":"5' 3\" (1.6 m)","bio":"Extremely cute, buxom, and shapely 5'3\" blonde bombshell Sarah Vandella was born on December 2 in Long Island, New York. The daughter of hippie parents, Sarah grew up in the suburbs of Long Island. She started in the adult entertainment industry as a dancer in clubs at age 22. Sarah first began performing in explicit hardcore movies March 2007, she has appeared in X-rated features for such notable companies as Vivid, Hustler, Naughty America, Reality Kings, Brazzers, and Adam & Eve. In October 2009, Sarah signed an exclusive contract with Zero Tolerance Entertainment under the name Sara Sloane performing in a little more than 20 titles for ZT. She has nominated for several AVN Awards that include Best Couples Sex Scene in 2010 and Best Tease Performance, Best Supporting Actress, and Best All-Girl Group Sex Scene in 2011. Moreover, Sloane was nominated for both a F.A.M.E. Award for Favorite Oral Sex Starlet and a XRCO Deep Throat Award in 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDI2OWMyMGYtODVlZS00YWZkLWE2YjMtMDEwMWQ4ZTZkOTAwXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2770048","name":"Sarah Vandella","nicknames":["Sarah Sloane","Sarah Sloan","Sara Sloane","Sara Vandella","Sarah Vandela","Sara Vandela"],"idIMDB":"nm2770048"},"actorId":"nm2770048","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1268229","urlIMDB":"http://www.imdb.com/title/tt1268229","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 59 min (119 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["Video"]},"rating":"6.6","filmingLocations":[],"rated":"X","awards":[],"votes":"10","type":"Video","companyCreditsSimple":[],"keywords":{"keywords":["sex","hardcore"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:11:28"}}