{"data":{"movies":[{"title":"Warrior","originalTitle":"","year":"2011","releaseDate":"20110909","directors":[{"name":"Gavin O'Connor","id":"nm0640334"}],"writers":[{"name":"Gavin O'Connor","id":"nm0640334"},{"name":"Anthony Tambakis","id":"nm3294574"}],"runtime":"140 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODk5MTMyNV5BMl5BanBnXkFtZTcwMDMyNTg0Ng@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Action","Drama","Sport"],"plot":"Two brothers face the fight of a lifetime - and the wreckage of their broken family - within the brutal, high-stakes world of Mixed Martial Arts (MMA) fighting in Lionsgate's action/drama, WARRIOR. A former Marine, haunted by a tragic past, Tommy Riordan returns to his hometown of Pittsburgh and enlists his father, a recovered alcoholic and his former coach, to train him for an MMA tournament awarding the biggest purse in the history of the sport. As Tommy blazes a violent path towards the title prize, his brother, Brendan, a former MMA fighter unable to make ends meet as a public school teacher, returns to the amateur ring to provide for his family. Even though years have passed, recriminations and past betrayals keep Brendan bitterly estranged from both Tommy and his father. But when Brendan's unlikely rise as an underdog sets him on a collision course with Tommy, the two brothers must finally confront the forces that tore them apart, all the while waging the most intense, ...","simplePlot":"The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision course with his estranged, older brother.","actors":[{"actorName":"Joel Edgerton","urlProfile":"http://www.imdb.com/name/nm0249291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODI1ODk4NzdeQTJeQWpwZ15BbWU3MDkwNjkzOTY@._V1._SX214_SY317_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1974","placeOfBirth":" Blacktown, New South Wales, Australia","height":"5' 11\" (1.8 m)","bio":"Joel Edgerton was born on June 23, 1974 in Blacktown, New South Wales, Australia, to Marianne and Michael Edgerton, who is a solicitor and property developer. His brother is filmmaker Nash Edgerton. He went to Hills Grammar School in the Western Suburbs of Sydney, and after leaving, he attended Nepean Drama School in 1994. Joel has done many projects on stage and off, but most people will recognize him from his work on the Australian television series The Secret Life of Us (2001), in which he played William McGill. This gave him his first big break through in the television industry. For this role, he was nominated in 2001 for an AFI Award. As well as \"The Secret Life of Us\", he has also appeared in other television projects such as The Three Stooges (2000), Dossa and Joe (2002), Secret Men's Business (1999), Never Tell Me Never (1998) and Saturn's Return (2001). Joel has done a lot of work on the theatrical stage having played King Henry in \"Henry V\", Prince Hal in \"Henry III\", and others including \"Road\", \"Third World Blues\" and \"Dead White Males\". As well as acting, he has also starred, co-written and produced the short movie Bloodlock (1998). His first international break came from when he played Uncle Owen Lars in Star Wars: Episode II - Attack of the Clones (2002). Since then, he has also starred in Ned Kelly (2003), King Arthur (2004), Star Wars: Episode III - Revenge of the Sith (2005) and Kinky Boots (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODI1ODk4NzdeQTJeQWpwZ15BbWU3MDkwNjkzOTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249291","name":"Joel Edgerton","idIMDB":"nm0249291"},"actorId":"nm0249291","character":"Brendan Conlon","urlCharacter":"http://www.imdb.com/character/ch0190164","main":true},{"actorName":"Tom Hardy","urlProfile":"http://www.imdb.com/name/nm0362766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1977","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Edward Thomas Hardy","height":"5' 9\" (1.75 m)","bio":"With his breakthrough performance as Eames in Christopher Nolan's science fiction thriller Inception (2010), English actor Tom Hardy has been brought to the attention of mainstream audiences worldwide. However, the versatile actor has been steadily working on both stage and screen since his television debut in the miniseries Band of Brothers (2001). After being cast in the World War II drama, Hardy left his studies at the prestigious Drama Centre in London and was subsequently cast as Twombly in Ridley Scott's Black Hawk Down (2001) and as the villain Shinzon in Star Trek: Nemesis (2002). Tom was born on September 15, 1977 in Hammersmith, London; his mother, Elizabeth Anne (Barrett), is an artist and painter, and his father, Edward Hardy, is a writer. He is of English and Irish descent. Hardy was brought up in East Sheen, London, and first studied at Reed's School. His education continued at Tower House School, then at Richmond Drama School, and subsequently at the Drama Centre London, along with fellow Oscar nominee Michael Fassbender. After winning a modeling competition at age 21, he had a brief contract with the agency Models One. Tom spent his teens and early twenties battling delinquency, alcoholism and drug addiction; after completing his work on Star Trek: Nemesis (2002), he sought treatment and has also admitted that his battles with addiction ended his 5-year marriage to Rachael Speed. Returning to work in 2003, Hardy was awarded the Evening Standard Most Promising Newcomer Award for his theatre performances in the productions of \"In Arabia, We'd All Be Kings\" and \"Blood\". In 2003, Tom also co-starred in the play \"The Modernists\" with Paul Popplewell, Jesse Spencer and Orlando Wells. During the next five years, Hardy worked consistently in film, television and theatre, playing roles as varied as Robert Dudley in the BBC's The Virgin Queen (2005), Bill Sikes in Oliver Twist (2007) and starring in \"The Man of Mode\" at the National Theatre. On the silver screen, he appeared in the crime thriller Layer Cake (2004) with Daniel Craig, Sofia Coppola's Marie Antoinette (2006), and the romp Scenes of a Sexual Nature (2006). In 2006, Hardy created \"Shotgun\", an underground theatre company along with director Robert Delamere, and directed a play, penned by his father for the company, called \"Blue on Blue\". In 2007, Hardy received a best actor BAFTA nomination for his touching performance as Stuart Shorter in the BBC adaptation of Alexander Masters' bestselling biography Stuart: A Life Backwards (2007). Hardy, hailed for his transformative character acting, was lauded for his emotionally and physically convincing portrayal in the ill-fated and warmhearted tale of Shorter, a homeless and occasionally violent man suffering from addiction and muscular dystrophy. The following year, he appeared as gay hoodlum Handsome Bob in the Guy Ritchie film RocknRolla (2008), but this would be his next transformation that would prove his extensive range and stun critics. In the film Bronson (2008), Hardy played the notorious Charles Bronson (given name, Michael Peterson), the \"most violent prisoner in Britain\". Bald, pumped-up, and outfitted with Bronson's signature strongman mustache, Hardy is unrecognizable and gives a harrowing performance that is physically fearless and psychologically unsettling. Director Nicolas Winding Refn breaks the fourth wall with Hardy retelling his tales directly to viewers as well as performing them outright before an audience of his own imagining. The performance mixes terrifying brutality, vaudevillian showmanship, wry humor, and an alarming amount of commitment, and won Hardy a British Independent Film Award for Best Actor. The performance got Hollywood's attention, and in 2009, Hardy was named one of Variety's \"10 Actors to Watch\". That year, he continued to garner praise for his starring role in The Take (2009), a four-part adaptation of Martina Cole's bestselling crime novel, as well as for his performance as Heathcliff in a version of Wuthering Heights (2009). Recent work includes the aforementioned breakthrough appearance in Inception (2010) alongside Leonardo DiCaprio, Joseph Gordon-Levitt, Cillian Murphy, Tom Berenger, Ken Watanabe, Michael Caine, Marion Cotillard and Ellen Page. The movie was released in July 2010 and became one of top 25 highest grossing films of all time, collecting eight Oscar nominations (including Best Picture) and winning four. Other films include Warrior (2011), opposite Joel Edgerton, the story of two estranged brothers facing the fight of a lifetime from director Gavin O'Connor, and This Means War (2012), directed by McG and co-starring Reese Witherspoon and Chris Pine. Tom also starred in the heralded Cold War thriller, La taupe (2011) with Colin Firth and Gary Oldman. Hardy rejoined Christopher Nolan for The Dark Knight Rises (2012); he played the villain role of Bane opposite Christian Bale, Anne Hathaway, Joseph Gordon-Levitt and Gary Oldman. Hardy's menacing physique and his character's scrambled, hard-to-distinguish voice became a major discussion point as the film was released. Outside of performing, Hardy is the patron for the charity \"Flack\", which is an organization to aid the recovery of the homeless in Cambridge. And in 2010, Hardy was named an Ambassador for The Prince's Trust, which helps disadvantaged youth. On the recent stage, he starred in the Brett C. Leonard play \"The Long Red Road\" in early 2010. Written for Hardy and directed by Philip Seymour Hoffman, the play was staged at Chicago's Goodman Theater. In 2015, Hardy starred as the iconic Mad Max in George Miller's reboot of his franchise, Mad Max: Fury Road (2015). He also collected a British Independent Film Award for his portrayal of both the Kray twins, Ronnie and Reggie, in Legend (2015), and an Oscar nomination for Best Supporting Actor for his role as John Fitzgerald in The Revenant (2015). He has an outlaw biker story among other projects in development. In 2010, Hardy became engaged to fellow English actress Charlotte Riley, whom he starred with in The Take (2009) and Wuthering Heights (2009), and is raising a young son, Louis, with ex-girlfriend Rachael Speed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362766","name":"Tom Hardy","idIMDB":"nm0362766"},"actorId":"nm0362766","character":"Tommy Conlon","urlCharacter":"http://www.imdb.com/character/ch0259188","main":true},{"actorName":"Nick Nolte","urlProfile":"http://www.imdb.com/name/nm0000560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODAzMDk3Ml5BMl5BanBnXkFtZTYwOTEzMzE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1941","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Nicholas King Nolte","height":"6' (1.83 m)","bio":"Nick Nolte was born in Omaha, Nebraska, to Helen (King) and Franklin Arthur Nolte, who worked in irrigation pump sales. He has German and British Isles ancestry. Nolte began his career on stage at the Pasadena (California) Playhouse and in regional theatre productions. His breakthrough role was in the TV mini-series Rich Man, Poor Man (1976), playing the role of \"Tom/Tommy Jordache\". Nick Nolte said that when he played a young man in the early scenes of the project, he weighed about 160 pounds. When he played a middle aged man in the later scenes, he weighed over 180 pounds.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODAzMDk3Ml5BMl5BanBnXkFtZTYwOTEzMzE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000560","name":"Nick Nolte","idIMDB":"nm0000560"},"actorId":"nm0000560","character":"Paddy Conlon","urlCharacter":"http://www.imdb.com/character/ch0158666","main":true},{"actorName":"Jennifer Morrison","urlProfile":"http://www.imdb.com/name/nm0607185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjMwODQ5M15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1979","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jennifer Marie Morrison","height":"5' 5¼\" (1.66 m)","bio":"Jennifer Marie Morrison was born in Chicago, Illinois, the oldest child of teachers David and Judy Morrison. She was raised in Arlington Heights, IL, with a younger sister and brother. She attended the same school her parents taught at, Prospect High School. As a child, she did some work as a model. After graduating from high school, she attended Loyola University in Chicago, where she studied Theater and English. She then moved on to study at the Steppenwolf Theater Company, before relocating to Los Angeles, California to pursue her acting career. Morrison's movie debut came in 1994, playing the daughter of Richard Gere and Sharon Stone in Intersection (1994). Success followed with various film and television roles, including the lead in Urban Legend 2: Coup de grâce (2000). She came to wide scale public attention in 2004 for her role as Dr. Allison Cameron in the television series House (2004), for which she was nominated for a prestigious Screen Actors Guild Award. Since leaving \"House M.D.\", her career has continued to progress with roles in Star Trek (2009), How I Met Your Mother (2005) and Warrior (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjMwODQ5M15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607185","name":"Jennifer Morrison","nicknames":["Jen","J-mo"],"idIMDB":"nm0607185"},"actorId":"nm0607185","character":"Tess Conlon","urlCharacter":"http://www.imdb.com/character/ch0161503","main":true},{"actorName":"Frank Grillo","urlProfile":"http://www.imdb.com/name/nm0342029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTk3Nzc4OF5BMl5BanBnXkFtZTcwNDcwNTA1Mw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1965","placeOfBirth":" New York City, New York, USA","birthName":"Frank Anthony Grillo","height":"5' 10½\" (1.79 m)","bio":"The oldest of three children, Frank Grillo was born in New York City, to an Italian-American family. He grew up in upstate New York, and got his first taste of acting in high school where he was in many plays. Frank was also a gifted athlete and his dream was to play sports professionally. Frank graduated from New York University with a business degree.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTk3Nzc4OF5BMl5BanBnXkFtZTcwNDcwNTA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342029","name":"Frank Grillo","nicknames":["Kiki"],"idIMDB":"nm0342029"},"actorId":"nm0342029","character":"Frank Campana","urlCharacter":"http://www.imdb.com/character/ch0290475","main":true},{"actorName":"Kevin Dunn","urlProfile":"http://www.imdb.com/name/nm0242656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTk4MTAwOF5BMl5BanBnXkFtZTcwODA4OTMwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1956","placeOfBirth":" Chicago, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Kevin Dunn was born in Chicago, Illinois, in 1956. He is an American actor who has made over 100 appearances in both TV and film. One of his earliest roles was in the Alan Parker film Mississippi Burning (1988) with Gene Hackman and Willem Dafoe. He followed this up with Kathryn Bigelow's Blue Steel (1990), Ghostbusters II (1989), and the Brian De Palma hit The Bonfire of the Vanities (1990). He has since appeared in a number of box office hits, such as Hot Shots! (1991), Chain Reaction (1996), and Godzilla (1998). He also appeared in the Oliver Stone epic, Nixon (1995) and the Ridley Scott fantasy film 1492: Christophe Colomb (1992). Dunn is able to fit into various roles in diverse genres with ease, whether the role in question be a political thriller like 'Robert Redford (I)'s Lions for Lambs (2007), an action film such as Tony Scotts Unstoppable (2010), or a romantic drama like Woody Allen's Vicky Cristina Barcelona (2008). He is an established and reliable supporting - and character - actor. He has gained considerable notoriety as the father in the hit movies Transformers (2007), Transformers: Revenge of the Fallen (2009), and Transformers: Dark of the Moon (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTk4MTAwOF5BMl5BanBnXkFtZTcwODA4OTMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242656","name":"Kevin Dunn","idIMDB":"nm0242656"},"actorId":"nm0242656","character":"Principal Zito","urlCharacter":"http://www.imdb.com/character/ch0441107","main":true},{"actorName":"Maximiliano Hernández","urlProfile":"http://www.imdb.com/name/nm0380073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAyOTQ3MDg3OV5BMl5BanBnXkFtZTcwNjQ0NTcyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Maximiliano Hernandez was born in Brooklyn, NY. He is the middle of three children born to Honduran immigrants Jose Maximiliano & Maria Elena Hernandez. He began acting at Bishop Ford High School in order to get out of detention. He continued acting in college where he auditioned and was accepted into the BFA program at the Leonard Davis Center For The Performing Arts in Harlem. He left the program when he was asked to join the Workhouse Theatre in Tribeca. He later was a founding member of the experimental troupe Axis Theatre Company as well as The Hot Box Theatre and Room 203. He's preformed at countless venues around NY including The Public, The Lucile Lortell, The Cherry Lane and many others. Though Theatre was his first love, Film and TV paid the bills. Max has worked with directors Joss Whedon, Mira Nair, Gavin O'Connor, Kenneth Branagh, The Russo Brothers, Denis Villeneuve and many others. He has a son named Diego and lives in Los Angeles with his Wife Holly Eve Hernández.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAyOTQ3MDg3OV5BMl5BanBnXkFtZTcwNjQ0NTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0380073","name":"Maximiliano Hernández","idIMDB":"nm0380073"},"actorId":"nm0380073","character":"Colt Boyd","urlCharacter":"http://www.imdb.com/character/ch0441108","main":true},{"actorName":"Bryan Callen","urlProfile":"http://www.imdb.com/name/nm0130437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU2ODM4MV5BMl5BanBnXkFtZTcwOTc2ODE3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1967","placeOfBirth":" Manila, Philippines","birthName":"Bryan Christopher Callen","height":"5' 11\" (1.8 m)","bio":"Born in Manila, Philippines, Bryan Callen made his television debut as a series regular on MADtv (1995) and the HBO prison series Oz (1997). He was recently seen as Kirstie Alley's wisecracking assistant on Showtime's comedy series Fat Actress (2005). Callen has appeared on several television series including Sex and the City (1998), 7th Heaven (1996), Stacked (2005), The King of Queens (1998), Las Vegas (2003), Significant Others (1998), The West Wing (1999), CSI: Crime Scene Investigation (2000), Law & Order: Special Victims Unit (1999), NYPD Blue (1993), Suddenly Susan (1996), Frasier (1993) and NewsRadio (1995), among others. In addition, Callen has appeared in such feature films as Bad Santa (2003) and Old School (2003) and has performed stand up comedy on several TV shows including Late Night with David Letterman (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU2ODM4MV5BMl5BanBnXkFtZTcwOTc2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0130437","name":"Bryan Callen","idIMDB":"nm0130437"},"actorId":"nm0130437","character":"Bryan Callen","urlCharacter":"http://www.imdb.com/character/ch0443689","main":true},{"actorName":"Sam Sheridan","urlProfile":"http://www.imdb.com/name/nm3085077","urlPhoto":"","biography":{"bio":"Sam Sheridan is an actor, known for Warrior (2011), Mankind Decoded (2013) and Mankind the Story of All of Us (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3085077","name":"Sam Sheridan","idIMDB":"nm3085077"},"actorId":"nm3085077","character":"Sam Sheridan","urlCharacter":"http://www.imdb.com/character/ch0441109","main":true},{"actorName":"Fernando Chien","urlProfile":"http://www.imdb.com/name/nm0157312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI2NTg0MDA3Nl5BMl5BanBnXkFtZTgwNDkwMjY2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1974","placeOfBirth":" Taipei, Taiwan","birthName":"Chien Fu-Nan","height":"5' 8\" (1.73 m)","bio":"Born in Taipei, Taiwan and who's real name is Chien Fu-Nan. Fernando was given his \"Western\" name when he immigrated to Canada. Fernando's passion for acting began in Canada, performing on stage in musical theater productions in college which lead to various roles in TV and Film. In 2002 he moved to Los Angeles to pursue the film business full-time and is where he resides today. Bouncing between stunt and acting roles for 11 years in Los Angeles he honed his skills through his action team Reel Kick, whose members are currently some of Hollywood's most sought after action artists and stunt performers. While simultaneously studying acting at some of LA's best schools such as Michael Beach's Actors Gym, Groundlings, Howard Fine Acting Studio and Lee Strasberg Studio. Starting Tae Kwon Do and Karate at the age of 6, Fernando never really took martial arts seriously until his 20's where he studied Hung-Gar Kung Fu in Montreal, Quebec. After moving to Los Angeles he was introduced to Wushu and eventually Jiu-Jitsu and Muay Thai. Favoring the contact sports more than the performance martial arts he studied under Gokor Chivichyan and Sensei Gene LeBell at the Hayastan MMA Academy and currently at the Werdum Combat Team under Master Fabricio Werdum (Brazilian Jiu Jitsu) and Andrew Hagar (Dutch Style Kickboxing).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI2NTg0MDA3Nl5BMl5BanBnXkFtZTgwNDkwMjY2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0157312","name":"Fernando Chien","idIMDB":"nm0157312"},"actorId":"nm0157312","character":"Fenroy","urlCharacter":"http://www.imdb.com/character/ch0457494","main":true},{"actorName":"Jake McLaughlin","urlProfile":"http://www.imdb.com/name/nm2474864","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDc1MDc4NF5BMl5BanBnXkFtZTgwMzg0MDc0MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1982","placeOfBirth":" Paradise, California, USA","birthName":"Jacob Adam McLaughlin","height":"6' 1\" (1.85 m)","bio":"Jake McLaughlin was born on October 7, 1982 in Paradise, California, USA as Jacob Adam McLaughlin. He is an actor, known for Warrior (2011), Quantico (2015) and In the Valley of Elah (2007). He has been married to Stephanie McLaughlin since 2004. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDc1MDc4NF5BMl5BanBnXkFtZTgwMzg0MDc0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2474864","name":"Jake McLaughlin","idIMDB":"nm2474864"},"actorId":"nm2474864","character":"Mark Bradford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vanessa Martinez","urlProfile":"http://www.imdb.com/name/nm0553737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzA4Njc5MV5BMl5BanBnXkFtZTcwNDkxMDk3Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1979","placeOfBirth":" Chicago, Illinois, USA","height":"4' 11\" (1.5 m)","bio":"Vanessa Martinez was born on June 19, 1979 in Chicago, Illinois, USA. She is an actress, known for Warrior (2011), Limbo (1999) and The Neon Demon (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzA4Njc5MV5BMl5BanBnXkFtZTcwNDkxMDk3Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0553737","name":"Vanessa Martinez","idIMDB":"nm0553737"},"actorId":"nm0553737","character":"Pilar Fernandez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denzel Whitaker","urlProfile":"http://www.imdb.com/name/nm1091701","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzExNjg2OV5BMl5BanBnXkFtZTgwNzM4MjU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1990","placeOfBirth":" Torrance, California, USA","birthName":"Denzel Dominique Whitaker","height":"5' 10\" (1.78 m)","bio":"Denzel Whitaker was born on June 15, 1990 in Torrance, California, USA as Denzel Dominique Whitaker. He is known for his work on Warrior (2011), The Great Debaters (2007) and Training Day (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzExNjg2OV5BMl5BanBnXkFtZTgwNzM4MjU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1091701","name":"Denzel Whitaker","nicknames":["Dz"],"idIMDB":"nm1091701"},"actorId":"nm1091701","character":"Stephon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos Miranda","urlProfile":"http://www.imdb.com/name/nm3163793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjQ1ODk0MF5BMl5BanBnXkFtZTgwNzkwMjMzNTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Carlos Miranda is an actor and director, known for Warrior (2011), The Bling Ring (2013) and Grandma (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjQ1ODk0MF5BMl5BanBnXkFtZTgwNzkwMjMzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3163793","name":"Carlos Miranda","idIMDB":"nm3163793"},"actorId":"nm3163793","character":"Tito","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Manuel Espinosa","urlProfile":"http://www.imdb.com/name/nm0261011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk0OTMwMDg1OV5BMl5BanBnXkFtZTgwNTkwMDkxNDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Manuel Espinosa is an actor, known for Warrior (2011), Miami Vice (1984) and The Insomniac (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk0OTMwMDg1OV5BMl5BanBnXkFtZTgwNTkwMDkxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0261011","name":"Manuel Espinosa","idIMDB":"nm0261011"},"actorId":"nm0261011","character":"Warden Perez","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1291584","urlIMDB":"http://www.imdb.com/title/tt1291584","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,242,107","country":"USA","day":"11","month":"09","year":"2011","remarks":"1,869 Screens"},{"money":"€429,627","country":"Italy","day":"06","month":"11","year":"2011","remarks":"151 Screens"},{"money":"PHP 788,483","country":"Philippines","day":"02","month":"10","year":"2011","remarks":"22 Screens"}],"gross":[{"money":"$13,657,115","country":"USA","day":"03","month":"11","year":"2011","remarks":""},{"money":"$13,651,662","country":"USA","day":"30","month":"10","year":"2011","remarks":""},{"money":"$13,632,517","country":"USA","day":"23","month":"10","year":"2011","remarks":""},{"money":"$13,572,543","country":"USA","day":"16","month":"10","year":"2011","remarks":""},{"money":"$13,427,854","country":"USA","day":"09","month":"10","year":"2011","remarks":""},{"money":"$13,082,667","country":"USA","day":"02","month":"10","year":"2011","remarks":""},{"money":"$12,210,126","country":"USA","day":"25","month":"09","year":"2011","remarks":""},{"money":"$10,002,625","country":"USA","day":"18","month":"09","year":"2011","remarks":""},{"money":"$5,242,107","country":"USA","day":"11","month":"09","year":"2011","remarks":""},{"money":"$23,057,115","country":"Worldwide","day":"03","month":"11","year":"2011","remarks":""},{"money":"$24,215,385","country":"Worldwide","day":"03","month":"11","year":"2011","remarks":""},{"money":"€953,902","country":"Italy","day":"13","month":"11","year":"2011","remarks":""},{"money":"€429,627","country":"Italy","day":"06","month":"11","year":"2011","remarks":""},{"money":"PHP 788,483","country":"Philippines","day":"02","month":"10","year":"2011","remarks":""}],"weekendGross":[{"money":"$7,736","country":"USA","day":"30","month":"10","year":"2011","remarks":"31 Screens"},{"money":"$28,575","country":"USA","day":"23","month":"10","year":"2011","remarks":"65 Screens"},{"money":"$68,436","country":"USA","day":"16","month":"10","year":"2011","remarks":"135 Screens"},{"money":"$170,753","country":"USA","day":"09","month":"10","year":"2011","remarks":"319 Screens"},{"money":"$460,263","country":"USA","day":"02","month":"10","year":"2011","remarks":"707 Screens"},{"money":"$1,119,835","country":"USA","day":"25","month":"09","year":"2011","remarks":"1,411 Screens"},{"money":"$2,860,325","country":"USA","day":"18","month":"09","year":"2011","remarks":"1,883 Screens"},{"money":"$5,242,107","country":"USA","day":"11","month":"09","year":"2011","remarks":"1,869 Screens"},{"money":"PHP 788,483","country":"Philippines","day":"02","month":"10","year":"2011","remarks":"22 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"2011 Lions Gate Films Inc."},"technical":{"runtime":["2 hr 20 min (140 min)"],"soundMix":["Dolby Digital","Datasat","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 235, Panavision Primo, Super Speed Z-Series MKII and Ultra Speed Z-Series MKII Lenses","Panavision Panaflex Millennium XL2, Panavision Primo, Super Speed Z-Series MKII and Ultra Speed Z-Series MKII Lenses","Panavision Panaflex Platinum, Panavision Primo, Super Speed Z-Series MKII and Ultra Speed Z-Series MKII Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Laser Pacific Media Corporation, Los Angeles (CA), USA (digital intermediate)","Technicolor, Hollywood (CA), USA (dailies)"],"filmLength":["3,818 m (Portugal)"],"negativeFormat":["35 mm (Kodak Vision3 500T 5219, Vision2 Expression 500T 5229, Vision2 500T 5260, Fuji Reala 500D 8592)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3514DI)","D-Cinema"]},"rating":"8.2","metascore":"71","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Performance by an Actor in a Supporting Role","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Screen Actors Guild Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Performance by a Male Actor in a Supporting Role","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Black Film Critics Circle Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won BFCC Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"Broadcast Film Critics Association Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Cinema Bloggers Awards, Portugal 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Cinema Bloggers Award","categories":[{"category":"Best Supporting Actor - International Competition","names":[{"name":"Nick Nolte","id":"nm0000560","role":"actor"}]},{"category":"Best Supporting Actor - International Competition","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Denver Film Critics Society 2012","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Gay and Lesbian Entertainment Critics Association (GALECA) 2012","titlesAwards":[{"titleAwardOutcome":"Won Dorian Award","categories":[{"category":"Unsung Film of the Year","names":[]}]}]},{"award":"Golden Schmoes Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won Golden Schmoes","categories":[{"category":"Most Underrated Movie of the Year","names":[]}]},{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Best Supporting Actor of the Year","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Favorite Movie of the Year","names":[]},{"category":"Biggest Surprise of the Year","names":[]}]}]},{"award":"IGN Summer Movie Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Drama Movie","names":[]}]}]},{"award":"Las Vegas Film Critics Society Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Sierra Award","categories":[{"category":"Best Picture","names":[]}]}]},{"award":"MTV Movie Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Fight","names":[{"name":"Tom Hardy","id":"nm0362766","role":null},{"name":"Joel Edgerton","id":"nm0249291","role":null}]}]}]},{"award":"Nevada Film Critics Society 2012","titlesAwards":[{"titleAwardOutcome":"Won NFCS Award","categories":[{"category":"Best Actor","names":[{"name":"Tom Hardy","id":"nm0362766","role":null}]}]}]},{"award":"Online Film & Television Association 2012","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Online Film Critics Society Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated OFCS Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Prism Awards 2012","titlesAwards":[{"titleAwardOutcome":"Won Prism Award","categories":[{"category":"Feature Film - Substance Use","names":[]}]},{"titleAwardOutcome":"Nominated Prism Award","categories":[{"category":"Performance in a Feature Film","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"San Diego Film Critics Society Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won SDFCS Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]}]}]},{"award":"Satellite Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Actor in a Motion Picture","names":[{"name":"Tom Hardy","id":"nm0362766","role":null}]},{"category":"Best Actor in a Supporting Role","names":[{"name":"Nick Nolte","id":"nm0000560","role":null}]},{"category":"Best Film Editing","names":[{"name":"Aaron Marshall","id":"nm0550719","role":null},{"name":"John Gilroy","id":"nm0319673","role":null},{"name":"Matt Chesse","id":"nm0156276","role":null},{"name":"Sean Albertson","id":"nm0006366","role":null}]}]}]},{"award":"Teen Choice Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actor: Action","names":[{"name":"Tom Hardy","id":"nm0362766","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated WFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Tom Hardy","id":"nm0362766","role":null},{"name":"Tinker Tailor Soldier Spy","id":"tt1340800","role":null}]}]}]}],"votes":"352,898","type":"Movie","companyCreditsSimple":[{"idCompany":"co0173285","name":"Lionsgate"},{"idCompany":"co0272027","name":"Mimran Schur Pictures"},{"idCompany":"co0018083","name":"Solaris"}],"keywords":{"keywords":["tournament","mixed martial arts","alcoholic","return home","underdog","trainer","high school","warrior","self injury","masculinity","self harm","grudge","reconciliation","forgiveness","protective brother","protective male","hairy chest","fighting movie","f word","kicked in the face","dislocated shoulder","cassette player","alcoholic relapse","reference to moby dick","choke hold","knocked out","war hero","beach","news report","montage","split screen","el paso texas","pittsburgh pennsylvania","character repeating someone else's dialogue","youtube","iraq","black eye","kicked in the chest","punched in the stomach","punched in the face","reference to isaac newton","character says i love you","philadelphia pennsylvania","prize fighter","bare chested male","muscleman","strongman","training","martial arts","violence","war widow","pseudonym","estranged brother","husband wife relationship","absence from work","drive in theater","drug addiction","high school principal","beethoven","u.s. marine","awol","slot machine","casino","physics teacher","high school teacher","brother brother relationship","cellphone video","gym","bank foreclosure","bank","birthday party","atlantic city new jersey","ex soldier","alcoholics anonymous","father son relationship","one word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:53:52"}}