{"data":{"movies":[{"title":"Get Him to the Greek","originalTitle":"","year":"2010","releaseDate":"20100604","directors":[{"name":"Nicholas Stoller","id":"nm0831557"}],"writers":[{"name":"Nicholas Stoller","id":"nm0831557"},{"name":"Jason Segel","id":"nm0781981"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzQ0MjExNV5BMl5BanBnXkFtZTcwMzkyMzgxMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Music"],"plot":"English rock star Aldous Snow relapses into drugs and booze after a break up and a disastrous record. In L.A., Aaron Green works for a record company stuck in recession. Aaron's boss gives him a career making task - to bring Aldous from London to L.A. for a concert in 72 hours. That day, Aaron's girlfriend Daphne tells him she wants to finish her medical residency in Seattle. Aaron's sure this ends their relationship. In London, things aren't much better: Aldous delays their departure several times, plies Aaron with vices, and alternates between bad behavior and trenchant observations. Can Aaron moderate Aldous's substance abuse and get him to the Greek? What about Daphne?","simplePlot":"A record company intern is hired to accompany out-of-control British rock star Aldous Snow to a concert at L.A.'s Greek Theater.","actors":[{"actorName":"Russell Brand","urlProfile":"http://www.imdb.com/name/nm1258970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMzA2Nzk0N15BMl5BanBnXkFtZTcwMDgwMTEwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1975","placeOfBirth":" Grays, Essex, England, UK","birthName":"Russell Edward Brand","height":"6' 1½\" (1.87 m)","bio":"Russell Brand was born on June 4, 1975, in Grays, Essex, England, the son of Barbara Elizabeth (Nichols) and Ronald Henry Brand, a photographer. An only child, his parents divorced when he was only six months old, and he was subsequently raised by his mother. Enduring a difficult childhood that saw him living with relatives while his mother was treated for cancer and only sporadically visited by his father, Brand left home at age 16. Accepted by the Italia Conti Academy of Theatre Arts in 1991, he was expelled during his first year for bad behaviour and drug use; by his own admission, he used a variety of illegal drugs and became addicted to heroin. After being expelled from the Drama Centre London during his final term in 1995, he switched his focus primarily to comedy from acting. Brand's first significant stand-up appearances came in 2000, the same year he also became a video journalist for MTV, a job which he was subsequently fired from. Continuing to work both in TV and stand-up, he debuted his one-man show Better Now, an account of his heroin addiction, at the Edinburgh Festival in 2004. Brand became a popular British television star by appearing on Big Brother and hosting his own talk show and numerous other series, and in 2008 shot to fame worldwide as the rocker Aldous Snow in the hit comedy Forgetting Sarah Marshall (2008). After an appearance in the Adam Sandler comedy Bedtime Stories (2008), he reprised the character of Aldous in the comedy Get Him to the Greek (2010), opposite Jonah Hill. Brand also starred in the remake Arthur (2011), opposite Helen Mirren, with whom he also starred in The Tempest (2010), and lent his voice to the Easter Bunny in Hop (2011) and to Dr. Nefario in the animated feature film Despicable Me (2010). He is reprising the role in Despicable Me 2 (2013), and will also co-star in a drama written and directed by Diablo Cody, starring alongside Julianne Hough and Holly Hunter. He also played Lonny in the all-star cast of the big-screen adaptation of the Broadway musical Rock of Ages (2012). Brand's writing debut, My Booky Wook: A Memoir of Sex, Drugs, and Stand-Up, became a huge success in the United Kingdom. Subsequently published in the U.S. in 2009, it stayed on the New York Times' bestseller list for five weeks in a row. The follow up, My Booky Wook 2: This Time it's Personal, was published in October, 2010. In 2010, Brand received the British Comedy Award for Outstanding Contribution to Comedy and was honored in 2011 with the ShoWest Award for Comedy Star of the Year. Brand married the pop star Katy Perry in 2010 in a traditional Hindu ceremony in Rajasthan, India; after 14 months, Brand filed for a divorce, which was officially granted in 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMzA2Nzk0N15BMl5BanBnXkFtZTcwMDgwMTEwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1258970","name":"Russell Brand","nicknames":["Russ"],"idIMDB":"nm1258970"},"actorId":"nm1258970","character":"Aldous Snow","urlCharacter":"http://www.imdb.com/character/ch0071205","main":true},{"actorName":"Rose Byrne","urlProfile":"http://www.imdb.com/name/nm0126284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1979","placeOfBirth":" Balmain, Sydney, New South Wales, Australia","birthName":"Mary Rose Byrne","height":"5' 6¼\" (1.68 m)","bio":"Rose Byrne was born in Balmain, Sydney, Australia. She is the daughter of Jane, a primary school administrator, and Robin Byrne, a semi-retired statistician and market researcher. She landed her first role in a movie, Dallas Doll (1994), when she was 15 years old. Since then, Rose has appeared in a variety of Australian televisions shows including Hartley, coeurs à vif (1994), Echo Point (1995), and the film Two Hands (1999) alongside Heath Ledger. After this, she appeared in various movies like The Date (1999), My Mother Frank (2000), and Clara Law's The Goddess of 1967 (2000) for which she obtained the Female Volpi Cup at the Venice Festival in 2000. Her first experience on a big-budget movie came when she played handmaiden, Dormé, to Natalie Portman, Padmé Amidala, in Star Wars: Episode II - Attack of the Clones (2002). In 2003, she starred, coincidentally, as Rose Mortmain in the adaptation of Dodie Smith's I Capture the Castle (2003). In 2004, she acted in Wicker Park (2004) with Diane Kruger and Josh Hartnett. Here, she heard Wolfgang Petersen was looking for an actress for Briseis in his next movie Troy (2004) with Brad Pitt, she got the part and was recognised as one of the most promising actresses in Hollywood. After Troy (2004), she played Edith in a TV adaptation of Casanova (2005). In September 2005, she started to act in Sunshine (2007), a Danny Boyle movie, where she plays the pilot in a space mission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126284","name":"Rose Byrne","nicknames":["Rosie"],"idIMDB":"nm0126284"},"actorId":"nm0126284","character":"Jackie Q","urlCharacter":"http://www.imdb.com/character/ch0188104","main":true},{"actorName":"Tyler McKinney","urlProfile":"http://www.imdb.com/name/nm2706787","urlPhoto":"","biography":{"bio":"Tyler McKinney is an actor, known for Get Him to the Greek (2010), I Now Pronounce You Chuck & Larry (2007) and That's So Raven (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2706787","name":"Tyler McKinney","idIMDB":"nm2706787"},"actorId":"nm2706787","character":"African Child in Video","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zoe Salmon","urlProfile":"http://www.imdb.com/name/nm1658552","urlPhoto":"","biography":{"dateOfBirth":"7 January 1980","placeOfBirth":" Bangor, County Down, Northern Ireland, UK","height":"5' 7\" (1.7 m)","bio":"Zoe Salmon was born on January 7, 1980 in Bangor, County Down, Northern Ireland. She is an actress, known for Blue Peter (1958), Angela and Friends (2009) and Get Him to the Greek (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1658552","name":"Zoe Salmon","idIMDB":"nm1658552"},"actorId":"nm1658552","character":"Zoe Salmon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lino Facioli","urlProfile":"http://www.imdb.com/name/nm2996220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MjE4Mjc5NF5BMl5BanBnXkFtZTcwOTM4NzQ4OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 2000","placeOfBirth":" Ribeirão Preto, São Paulo, Brazil","birthName":"Lino Schmidek Facioli","height":"5' 11\" (1.8 m)","bio":"Lino was born in Brazil, where he used to live until moving to London in 2005 (aged 4) with both his parents. His father is a graphic artist and animator, his mother an architect and jewellery designer. Being brewed in a creative environment, Lino always showed a very inquisitive nature, and has had since tender age an unusually strong interest in wearing costumes and performing characters. Aged 7 he said that he wanted to become an actor and take part in films to his mother, who then enrolled him at a drama school where he got an agent. Following this he was invited to audition for a major film by director Charles Shyer, who was so taken with Lino that he wrote a special part for him as an additional leading role. So far Lino was lucky enough to have got a wide range of roles in various different projects: from comedy to drama, feature and short films, TV and stage (where he performed opposite Imogen Stubbs, playing her son and title character of Henrik Ibsen's \"Little Eyolf\"). Appart from acting, Lino loves reading, writing, drawing, riding, traveling and photography. He also loves roller skating and is enjoying his Aikido classes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MjE4Mjc5NF5BMl5BanBnXkFtZTcwOTM4NzQ4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2996220","name":"Lino Facioli","idIMDB":"nm2996220"},"actorId":"nm2996220","character":"Naples","urlCharacter":"http://www.imdb.com/character/ch0228218","main":true},{"actorName":"Lars Ulrich","urlProfile":"http://www.imdb.com/name/nm0005515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc1MjQ3NjI0OF5BMl5BanBnXkFtZTcwNTgzOTA1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 December 1963","placeOfBirth":" Gentofte, Denmark","height":"5' 5¼\" (1.66 m)","bio":"Lars Ulrich was born on December 26, 1963 in Gentofte, Denmark. He is married to Jessica Miller. He was previously married to Skylar Satenstein and Debbie Jones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc1MjQ3NjI0OF5BMl5BanBnXkFtZTcwNTgzOTA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005515","name":"Lars Ulrich","idIMDB":"nm0005515"},"actorId":"nm0005515","character":"Lars Ulrich","urlCharacter":"http://www.imdb.com/character/ch0187078","main":true},{"actorName":"Mario Lopez","urlProfile":"http://www.imdb.com/name/nm0530249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NTcyNTA2NV5BMl5BanBnXkFtZTcwODkyMDY0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1973","placeOfBirth":" San Diego, California, USA","birthName":"Mario Lopez Jr.","height":"5' 10\" (1.78 m)","bio":"Born in San Diego, California, on October 10th, 1973, to Mario Sr. and Elvira, Mario Lopez's first professional role was on the series, a.k.a. Pablo (1984). Mario is probably best known to youngsters, however, as A.C. Slater from NBC's popular 1980s teen comedy series Saved by the Bell (1989). Among Mario's other credits are several other popular television series, such as Pacific Blue (1996) and the movies Colors (1988), Depraved (1996) and Eastside (1999). Mario has also proven himself as a talented presenter and has already hosted such series as Name Your Adventure (1993), The Other Half (2001) and Pet Star (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NTcyNTA2NV5BMl5BanBnXkFtZTcwODkyMDY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0530249","name":"Mario Lopez","idIMDB":"nm0530249"},"actorId":"nm0530249","character":"Mario Lopez","urlCharacter":"http://www.imdb.com/character/ch0421116","main":true},{"actorName":"Pink","urlProfile":"http://www.imdb.com/name/nm0600877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkxMzE0MDg1MV5BMl5BanBnXkFtZTcwNjc2MjYxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1979","placeOfBirth":" Doylestown, Pennsylvania, USA","birthName":"Alecia Beth Moore","height":"5' 4\" (1.63 m)","bio":"Pink was born Alecia Beth Moore in Doylestown, Pennsylvania, and was later raised in Philadelphia. Her parents, Judith Moore (née Kugel), a nurse, and Jim Moore, a Vietnam veteran, divorced when she was very young. Her mother is from an Ashkenazi Jewish family, while her father has Irish, German, and English ancestry. As a child, all Pink wanted was to become a singer, and she was driven by the music of Madonna, Mary J. Blige, 4 Non Blondes, Janis Joplin, Billy Joel and Whitney Houston. Pink was a very unique teenager, and went through phases as a skateboarder, hip-hopper and gymnast. She spent several years as part of the club scene in Philadelphia, singing guest spots and performing for talent shows. At the age of 13, she was asked by a local DJ to sing back-up for his rap group, Schools of Thought. A short time later, she was discovered by a record executive and joined a female R&B group, Choice. When that didn't work out, she signed with LaFace Records and began her solo career. In spring 2000, she released her debut, \"Can't Take Me Home\". She co-wrote many songs and watched it go multi-platinum by the year's end. Her debut included the Top 10 hit, \"There You Go\", which was certified a gold single.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkxMzE0MDg1MV5BMl5BanBnXkFtZTcwNjc2MjYxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0600877","name":"Pink","idIMDB":"nm0600877"},"actorId":"nm0600877","character":"Pink","urlCharacter":"http://www.imdb.com/character/ch0392609","main":true},{"actorName":"Billy Bush","urlProfile":"http://www.imdb.com/name/nm1129362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzI4ODEzM15BMl5BanBnXkFtZTgwMjAzNzM5ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1971","placeOfBirth":" Los Angeles, California, USA","birthName":"William Hall Bush","height":"5' 9\" (1.75 m)","bio":"Billy Bush was born on October 13, 1971 in Los Angeles, California, USA as William Hall Bush. He has been married to Sydney Davis since April 4, 1998. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzI4ODEzM15BMl5BanBnXkFtZTgwMjAzNzM5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1129362","name":"Billy Bush","nicknames":["Bushy"],"idIMDB":"nm1129362"},"actorId":"nm1129362","character":"Billy Bush","urlCharacter":"http://www.imdb.com/character/ch0364594","main":true},{"actorName":"Kurt Loder","urlProfile":"http://www.imdb.com/name/nm0517064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODE5Mjg0M15BMl5BanBnXkFtZTcwMDc1ODM4OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1945","placeOfBirth":" New Jersey, USA","bio":"Author and former Rolling Stone editor Kurt Loder is MTV News' Anchor. As MTV's chief news correspondent, his responsibilities include celebrity interviews, in-depth coverage of the music scene and writing and reporting the MTV News updates seen each hour. Loder is the host of MTV News 1515, MTV's weekly program that takes a look at music, entertainment and pop culture issues. He also anchored \"Week In Rock\" and \"MTV News Presents,\" a weekly showcase for MTV News special programming. He also hosts numerous MTV News specials covering a wide array of subjects relevant to young people, including \"Straight Dope,\" \"Hate Rock,\" \"The Cult Question,\" and \"Smashed.\" Raised in New Jersey, Loder lived in Europe for several years, working as a journalist and, occasionally, a musician. Returning to the States, he wound up as an editor at Circus Magazine in the late seventies, and in 1979, moved to Rolling Stone. (Much of his other work for that magazine is featured in Rolling Stone Interviews Of The Eighties, a book which he also annotated.) He has been a contributing editor to both Rolling Stone and Esquire, and is a member of the nominating committee of the Rock & Roll Hall of Fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODE5Mjg0M15BMl5BanBnXkFtZTcwMDc1ODM4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0517064","name":"Kurt Loder","idIMDB":"nm0517064"},"actorId":"nm0517064","character":"Kurt Loder","urlCharacter":"http://www.imdb.com/character/ch0392621","main":true},{"actorName":"Christina Aguilera","urlProfile":"http://www.imdb.com/name/nm0004694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTgxMDM1Ml5BMl5BanBnXkFtZTcwNTU5MzQzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1980","placeOfBirth":" Staten Island, New York City, New York, USA","birthName":"Christina Maria Aguilera","height":"5' 2\" (1.57 m)","bio":"Christina Maria Aguilera was born on December 18, 1980, in Staten Island, New York, to Shelly Loraine (Fidler) and Fausto Wagner Xavier Aguilera. Her father is Ecuadorian and her mother, who is American-born, has English, Scots-Irish, and German ancestry. Her parents divorced when she was young and she lived with her mother, although they moved around quite a bit. Christina's goal almost since birth was to be a singer, and at age 12 she was invited to audition for The All New Mickey Mouse Club (1989). She wound up getting the part and stayed there for a few years, until the show ended. In 1999 she had her breakthrough hit, \"Genie in a Bottle\". Since then she's made millions of fans, sold millions of records and has won many awards, including a Grammy for best new female artist. She has even made a Latin album and released a Christmas album. Aguilera is a bilingual singer. She has received many honors including Grammy Nominations and a win for Best New Artist. 2 MTV Video Music Awards, a Radio Music Awards, 2 VH1 Awards, and a Teen Choice Award with Lil' Kim, Mya and Pink and the smash hit \"Lady Maramalade\". She was on The All New Mickey Mouse Club (1989) with *NSYNC's Justin Timberlake and J.C. Chasez, Britney Spears, Ryan Gosling and Keri Russell. Her musical influences include Mariah Carey, Whitney Houston and Janet Jackson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTgxMDM1Ml5BMl5BanBnXkFtZTcwNTU5MzQzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004694","name":"Christina Aguilera","nicknames":["Chrissy","X-Tina","Baby Jane","Candy","Madam X","Xtina"],"idIMDB":"nm0004694"},"actorId":"nm0004694","character":"Christina Aguilera","urlCharacter":"http://www.imdb.com/character/ch0106966","main":true},{"actorName":"Colm Meaney","urlProfile":"http://www.imdb.com/name/nm0000538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDMzMTQ4N15BMl5BanBnXkFtZTcwMjMyNjQ0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1953","placeOfBirth":" Dublin, Ireland","height":"5' 11\" (1.8 m)","bio":"Colm Meaney was born on May 30, 1953 in Dublin, Ireland. He is an actor, known for Star Trek: Deep Space Nine (1993), Con Air (1997) and Law Abiding Citizen (2009). He has been married to Ines Glorian since March 15, 2007. He was previously married to Bairbre Dowling.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDMzMTQ4N15BMl5BanBnXkFtZTcwMjMyNjQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000538","name":"Colm Meaney","idIMDB":"nm0000538"},"actorId":"nm0000538","character":"Jonathan Snow","urlCharacter":"http://www.imdb.com/character/ch0228220","main":true},{"actorName":"Ray Siegle","urlProfile":"http://www.imdb.com/name/nm0797075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTAwMDkyM15BMl5BanBnXkFtZTgwOTkwNzQwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Ray Siegle is known for his work on Six (2017), Limitless (2011) and The Dark Knight Rises (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTAwMDkyM15BMl5BanBnXkFtZTgwOTkwNzQwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0797075","name":"Ray Siegle","idIMDB":"nm0797075"},"actorId":"nm0797075","character":"Paparazzo in LA","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chad Cleven","urlProfile":"http://www.imdb.com/name/nm1265475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTIwNjYzN15BMl5BanBnXkFtZTcwNjc2MTQzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Chad Cleven is known for his work on Spider-Man 2 (2004), Memoirs of a Geisha (2005) and Spider-Man 3 (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTIwNjYzN15BMl5BanBnXkFtZTcwNjc2MTQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1265475","name":"Chad Cleven","nicknames":["The Chad"],"idIMDB":"nm1265475"},"actorId":"nm1265475","character":"Paparazzo in LA","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Chris Lopez","urlProfile":"http://www.imdb.com/name/nm3926637","urlPhoto":"","biography":{"bio":"Jonathan Chris Lopez is an actor, known for Get Him to the Greek (2010) and A Haunting on Gabriel Street (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3926637","name":"Jonathan Chris Lopez","idIMDB":"nm3926637"},"actorId":"nm3926637","character":"Paparazzo in LA","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1226229","urlIMDB":"http://www.imdb.com/title/tt1226229","business":{"budget":null,"openingWeekend":[{"money":"$17,570,955","country":"USA","day":"06","month":"06","year":"2010","remarks":"2,697 Screens"},{"money":"£1,569,556","country":"UK","day":"27","month":"06","year":"2010","remarks":"389 Screens"}],"gross":[{"money":"$60,923,325","country":"USA","day":"08","month":"08","year":"2010","remarks":""},{"money":"$60,758,865","country":"USA","day":"01","month":"08","year":"2010","remarks":""},{"money":"$60,498,010","country":"USA","day":"25","month":"07","year":"2010","remarks":""},{"money":"$60,129,930","country":"USA","day":"18","month":"07","year":"2010","remarks":""},{"money":"$59,424,055","country":"USA","day":"11","month":"07","year":"2010","remarks":""},{"money":"$57,965,435","country":"USA","day":"04","month":"07","year":"2010","remarks":""},{"money":"$54,616,495","country":"USA","day":"27","month":"06","year":"2010","remarks":""},{"money":"$47,844,275","country":"USA","day":"20","month":"06","year":"2010","remarks":""},{"money":"$36,400,720","country":"USA","day":"13","month":"06","year":"2010","remarks":""},{"money":"$17,570,955","country":"USA","day":"06","month":"06","year":"2010","remarks":""},{"money":"£6,946,757","country":"UK","day":"01","month":"08","year":"2010","remarks":""},{"money":"£6,809,659","country":"UK","day":"25","month":"07","year":"2010","remarks":""},{"money":"£6,472,238","country":"UK","day":"18","month":"07","year":"2010","remarks":""},{"money":"£5,348,823","country":"UK","day":"11","month":"07","year":"2010","remarks":""},{"money":"£3,861,613","country":"UK","day":"04","month":"07","year":"2010","remarks":""},{"money":"£1,569,556","country":"UK","day":"27","month":"06","year":"2010","remarks":""}],"weekendGross":[{"money":"$71,515","country":"USA","day":"08","month":"08","year":"2010","remarks":"110 Screens"},{"money":"$137,185","country":"USA","day":"01","month":"08","year":"2010","remarks":"155 Screens"},{"money":"$170,175","country":"USA","day":"25","month":"07","year":"2010","remarks":"221 Screens"},{"money":"$294,175","country":"USA","day":"18","month":"07","year":"2010","remarks":"287 Screens"},{"money":"$711,625","country":"USA","day":"11","month":"07","year":"2010","remarks":"442 Screens"},{"money":"$1,723,840","country":"USA","day":"04","month":"07","year":"2010","remarks":"884 Screens"},{"money":"$3,140,780","country":"USA","day":"27","month":"06","year":"2010","remarks":"2,189 Screens"},{"money":"$6,104,810","country":"USA","day":"20","month":"06","year":"2010","remarks":"2,592 Screens"},{"money":"$9,942,405","country":"USA","day":"13","month":"06","year":"2010","remarks":"2,702 Screens"},{"money":"$17,570,955","country":"USA","day":"06","month":"06","year":"2010","remarks":"2,697 Screens"},{"money":"£44,001","country":"UK","day":"01","month":"08","year":"2010","remarks":"66 Screens"},{"money":"£119,424","country":"UK","day":"25","month":"07","year":"2010","remarks":"195 Screens"},{"money":"£440,282","country":"UK","day":"18","month":"07","year":"2010","remarks":"316 Screens"},{"money":"£610,705","country":"UK","day":"11","month":"07","year":"2010","remarks":"395 Screens"},{"money":"£1,048,898","country":"UK","day":"04","month":"07","year":"2010","remarks":"390 Screens"},{"money":"£1,569,556","country":"UK","day":"27","month":"06","year":"2010","remarks":"389 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"04","year":"2009","remarks":null},{"money":null,"country":null,"day":"12","month":"05","year":"2009","remarks":null}],"copyrightHolder":"Copyright © 2010 Universal Studios"},"technical":{"runtime":["1 hr 49 min (109 min)","1 hr 54 min (114 min) (unrated)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex 235, Panavision Primo Lenses","Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Company 3 (digital intermediate)"],"filmLength":["3,010 m (Portugal)"],"negativeFormat":["35 mm (Kodak Vision3 250D 5207, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6.4","metascore":"65","filmingLocations":[{"location":"550 S. Flower St, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Black Reel Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Best Supporting Actor","names":[{"name":"Sean Combs","id":"nm0004835","role":null}]}]}]},{"award":"Broadcast Film Critics Association Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Comedy Movie","names":[]}]}]},{"award":"Empire Awards, UK 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Comedy","names":[]}]}]},{"award":"Golden Schmoes Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Comedy of the Year","names":[]}]}]},{"award":"Houston Film Critics Society Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Best Original Song","names":[{"name":"Dan Bern","id":"nm2345464","role":null},{"name":"Mike Viola","id":"nm0899196","role":null}]}]}]},{"award":"IGN Summer Movie Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Comedy","names":[]}]}]},{"award":"MTV Movie Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Comedic Performance","names":[{"name":"Russell Brand","id":"nm1258970","role":null}]}]}]},{"award":"Teen Choice Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Comedy","names":[]},{"category":"Choice Movie Actor: Comedy","names":[{"name":"Russell Brand","id":"nm1258970","role":null}]},{"category":"Choice Movie Actor: Comedy","names":[{"name":"Jonah Hill","id":"nm1706767","role":null}]},{"category":"Choice Movie: Hissy Fit","names":[{"name":"Sean Combs","id":"nm0004835","role":null}]},{"category":"Choice Movie: Fight","names":[{"name":"Russell Brand","id":"nm1258970","role":null},{"name":"Jonah Hill","id":"nm1706767","role":null},{"name":"Sean Combs","id":"nm0004835","role":null}]},{"category":"Choice Movie: Liplock","names":[{"name":"Russell Brand","id":"nm1258970","role":null},{"name":"Jonah Hill","id":"nm1706767","role":null}]},{"category":"Choice Movie: Male Scene Stealer","names":[{"name":"Sean Combs","id":"nm0004835","role":null}]}]}]}],"votes":"151,464","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0142678","name":"Relativity Media"},{"idCompany":"co0031181","name":"Spyglass Entertainment"}],"keywords":{"keywords":["concert","record company","rock star","recession","drugs","intern","loud sex","jealousy","cigarette smoking","split screen","scantily clad female","stripper pole","nudity","bare breasts","topless female nudity","female nudity","stripper","watching a music video","strip club","cocktail","bar","slow motion scene","pot smoking","running late","late night","alcohol","casual sex","sex in toilet","coitus","woman initiating sex","comedic sex scene","fully clothed sex","thong","black american","casino","swinging london","drug reference","telephone call","10th anniversary","falling into a swimming pool","record executive","quitting a job","falling from height","jumping from height","infidelity","drug mule","greek theatre los angeles","ex boyfriend ex girlfriend relationship","falling off the wagon","africa","racism reference","reference to sammy davis jr.","reference to frank sinatra","impersonator","rat pack","mother son relationship","cell phone","seattle washington","medical student","medical intern","boyfriend girlfriend relationship","african american","travel","airport","illegal drugs","female orgasm","cunnilingus","friendship","injury","suicide attempt","heroin","upskirt","mini skirt","female frontal nudity","rock concert","cameo","combat","string quartet","eyelash extensions","f word","depravity","record industry","intoxication","imperative in title","promiscuity","shot","toilet","swimming pool","eccentric","flight","surprise after end credits","vomit","gay kiss","oral sex","dildo","sex scene","kiss","absinthe","sex in a toilet stall","pixilated nudity","masturbation","father son relationship","business executive","drunkenness","superficiality","road trip","airplane trip","musician","threesome","despair","illegitimate son","music industry","comeback","music video","doctor","los angeles california","drug smuggling","male rape","party","rock music","spin off","groupie","cardiac injection","meaning of life","lap dancer","adrenaline","las vegas nevada","new york city"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:47:46"}}