{"data":{"movies":[{"title":"Universal Soldier: Regeneration","originalTitle":"","year":"2009","releaseDate":"201001","directors":[{"name":"John Hyams","id":"nm0404882"}],"writers":[{"name":"Richard Rothstein","id":"nm0745330"},{"name":"Christopher Leitch","id":"nm0500609"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMDc3MjgyMV5BMl5BanBnXkFtZTcwODg0MjYxMw@@._V1.jpg","countries":["USA"],"languages":["English","Bulgarian"],"genres":["Action","Adventure","Sci-Fi","Thriller"],"plot":"With stolen top-secret technology, terrorists have created a next-generation Universal Soldier - an elite fighter genetically altered into a programmable killing machine. With this \"UniSol\" (Former UFC Heavyweight Champion Andrei \"The Pit Bull\" Arlovski) leading the way, they seize the crippled Chernobyl nuclear reactor, threatening to unleash a lethal radioactive cloud. The only one who can stop them is Luc Deveraux (Jean-Claude Van Damme), a UniSol who's been decommissioned for years. Reactivated and retrained, Deveraux must make a full-out assault on the heavily armed fortress. But inside, he'll discover not one but two of these virtually indestructible warriors. Andrew Scott (Dolph Lundgren), Deveraux's vicious UniSol enemy from the original Universal Soldier, has been secretly reanimated and upgraded. Now, these elite fighters are locked, loaded and programmed to kill; and the fate of millions hinges on this high-action showdown.","simplePlot":"With stolen top-secret technology, terrorists have created a next-generation Universal Soldier - an elite fighter genetically altered into a programmable killing machine. With this \"UniSol\"... ","actors":[{"actorName":"Jean-Claude Van Damme","urlProfile":"http://www.imdb.com/name/nm0000241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1960","placeOfBirth":" Berchem-Sainte-Agathe, Brussels, Belgium","birthName":"Jean-Claude Camille François Van Varenberg","height":"5' 9¾\" (1.77 m)","bio":"Van Damme was born Jean-Claude Camille François Van Varenberg in Berchem-Sainte-Agathe, Brussels, Belgium, to Eliana and Eugène Van Varenberg, an accountant. \"The Muscles from Brussels\" started martial arts at the age of eleven. His father introduced him to martial arts when he saw his son was physically weak. At the age of 12, Van Damme began his martial arts training at Centre National De Karate (National Center of Karate) under the guidance of Master Claude Goetz in Ixelles, Belgium. Van Damme trained for 4 years and earned a spot on the Belgium Karate Team. He won the European professional karate association's middleweight championship as a teenager, and also beat the 2nd best karate fighter in the world. His goal was to be number one but got sidetracked when he left his hometown of Brussels. In 1976 at the age of sixteen, Jean-Claude started his Martial Arts fight career. Over the next 6-years, he competed in both full-contact and semi-contact matches. He debuted under his birth name of Jean Claude Van Varenberg. In his first match, Jean-Claude was staggered by a round-house kick thrown by fellow countryman, Toon Van Oostrum in Brussels, Belgium. Van Damme was badly stunned, but came back to knockout Van Oostrum moments later. In 1977, at the WAKO Open International in Antwerp, Belgium, Jean-Claude lost a decision to fellow team mate Patrick Teugels in a semi-contact match. At the 1978 Challenge De Espoirs Karate Tournament (1st Trials),Jean-Claude placed 2nd in the semi-contact division. He defeated twenty-five opponents during the week long tournament, but lost in the finals to Angelo Spataro from the Naha Club. Later in 1978, Jean-Claude lost a 3-round match for the Belgium Lightweight Championship (semi-contact) to his fellow team-mate to Patrick Teugels. In 1979, Jean-Claude traveled to the United States of America, to Tampa, Florida. In his first and only match against a United States opponent, Van Damme faced 'Sherman 'Big Train'Bergman', a kick-boxer from Miami Beach, Florida. For the first and only time in his career, Jean-Claude was knocked to the canvas after absorbing a powerful left hook from Bergman. However, Jean-Claude climbed off the canvas and with a perfectly timed ax-kick, knocked Bergman out in 56 seconds of the first round. Jean-Claude was a member of the Belgium team which competed on December 26, 1979 at the La Coupe Fancois Persoons Karate Tournament which was sanctioned by the Federation bruxelloise de Karate. Van Damme's final match victory enabled his team to win the European Team Karate Championship. In Full-Contact karate, Jean-Claude knocked out England's Micheal Heming in 46 seconds of the first round. In 1980, Van Damme knocked out France's Georges Verlugels in 2 rounds of a match fought under kick-boxing rules. Jean-Claude wanted to defeat his rival Patrick Teugels. At the Forest Nationals in Brussels, on March 8, 1980, Jean-Claude knocked Teugels down and Teugels suffered a nose injury and was unable to continue. Jean-Claude was awarded a first round victory. Jean-Claude retired from martial arts in 1982, following a knockout over Nedjad Gharbi in Brussels,Belgium. Jean-Claude posted a 18-1 (18 knockouts) Kickboxing record, and a Semi-Contact record of 41-4. He came to Hong Kong at the age of 19 for the first time and felt insured to do action movies in Hong Kong. In 1981 Van Damme moved to Los Angeles. He took English classes while working as carpet layer, pizza delivery man, limo driver, and thanks to Chuck Norris he got a job as a bouncer at a club. Norris gave Van Damme a small role in the movie Missing in Action (1984), but it wasn't good enough to get anybody's attention. Then in 1984 he got a role as a villain named Ivan in the low-budget movie No Retreat, No Surrender (1986). Then one day, while walking on the streets, Jean-Claude spotted a producer for Cannon Pictures, and showed some of his martial arts abilities which led to a role in Bloodsport (1988). But the movie, filmed in Hong Kong, was so bad when it was completed, it was shelved for almost two years. It might have never been released if Van Damme did not help them to recut the film and begged producers to release it. They finally released the film, first in Malaysia and France and then into the U.S. Shot on a meager 1.5 million dollar budget, it became a U.S box-office hit in the spring of 1988. It made about 30 million worldwide and audiences supported this film for its new sensational action star Jean-Claude Van Damme. His martial arts assets, highlighted by his ability to deliver a kick to an opponent's head during a leaping 360-degree turn, and his good looks led to starring roles in higher budgeted movies like Cyborg (1989), Lionheart (1990), Double Impact (1991) and Universal Soldier (1992). In 1994, he scored with his big breakthrough $100 million worldwide hit Timecop (1994). But in the meantime, his personal life was coming apart. A divorce, followed by a new marriage, followed by another divorce. It began to show up in his career when his projects began to tank at the box office - The Quest (1996), which he directed; Maximum Risk (1996) and Double Team (1997). The three films made less than $50 million combined. In 1999 he remarried his ex-wife Gladys Portugues and restarted his lost career to attain new goals. With help from his family he faced his problems and made movies like Replicant (2001), Derailed (2002), and In Hell (2003) which did averagely in box office terms, but he tried to give his fans the best, his acting in those movies got better, more emotional and each movie was basically in different action tones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000241","name":"Jean-Claude Van Damme","nicknames":["Muscles from Brussels","J.C."],"idIMDB":"nm0000241"},"actorId":"nm0000241","character":"Luc Deveraux","urlCharacter":"http://www.imdb.com/character/ch0012802","main":true},{"actorName":"Dolph Lundgren","urlProfile":"http://www.imdb.com/name/nm0000185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1957","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Hans Lundgren","height":"6' 5\" (1.96 m)","bio":"Dolph Lundgren was born in Stockholm, Sweden, to Sigrid Birgitta (Tjerneld), a language teacher, and Karl Johan Hugo Lundgren, an engineer and economist for the Swedish government. He lived in Stockholm until the age of 13, when he moved in with his grandparents in Nyland, Ångermanland, Sweden. Despite an early interest in music and the fine arts, Dolph decided to follow in his father's footsteps and pursue an Engineering degree. After having completed his military service, he enrolled at the Royal Institute of Technology in Stockholm. It was in the military when Dolph first came in contact with the martial arts. Five years later, Dolph had become a World-Class competitor in Japanese Karate and was deeply involved with a discipline that was to become an important part of his life. After graduating High School, Dolph spent considerable time studying in the United States and abroad on various academic scholarships. He attended Washington State University and Clemson University in South Carolina. In 1982, he received a scholarship to complete his Masters Degree in Chemical Engineering at the University of Sydney, Australia. In 1983, he was awarded a Fulbright scholarship to the Massachusetts Institute of Technology in Boston, one of the world's top engineering schools. That same year, Dolph decided to move to New York City and take up acting. He started studying drama at the Warren Robertson Theatre Workshop in Manhattan, not knowing how quickly his life was about to change. Dolph's motion picture debut came in the \"James Bond\" feature, A View to a Kill (1985). However, it was his performance in Rocky IV (1985) later that year that definitely got him noticed. After a 9-month audition process among 5,000 hopefuls, he was cast opposite writer-director Sylvester Stallone, as his Russian opponent, \"Ivan Drago\". Following the success of Rocky IV (1985), Lundgren moved to Los Angeles and has since starred in more than thirty feature films. Lundgren portrayed the classic action-heroic lead in such films as Gary Goddard's Masters of the Universe (1987), Showdown in Little Tokyo (1991) co-starring Brandon Lee and Blackjack (1998), by Hong-Kong action legend, John Woo. Lundgren has also continued to turning in memorable performances as the main adversary to other action-stars, most notably in Universal Soldier (1992) opposite Jean-Claude Van Damme, directed by Roland Emmerich, as well as Robert Longo's Johnny Mnemonic (1995) opposite Keanu Reeves. In February 2004, Dolph Lundgren directed his first feature film, the thriller The Defender (2004), in which he also starred. In 2005, he directed and starred in yet another feature, The Russian Specialist (2005) (a.k.a \"The Russian Specialist\"). In January 2006, he finished principal photography of The Final Inquiry (2006), an Italian/American/Spanish co-production, directed by Giulio Base, in which he played against, amongst others, Daniele Liotti, Max von Sydow and F. Murray Abraham. In the fall 2006, Lundgren starred in Diamond Dogs (2007), a Chinese/American co-production filmed on location in Mongolia. In the Spring 2007, he directed a modern day western shot in Texas, Missionary Man (2007). In 2009, he completed two new directorial efforts, the action-packed Command Performance (2009), which showcases Lundgren's longtime musical talents as a drummer; and the neo-noir thriller The Killing Machine (2010). Lundgren also reunited with co-stars Jean-Claude Van Damme and Sylvester Stallone for Universal Soldier: Regeneration (2009) and the highly anticipated action blockbuster, The Expendables (2010). Dolph has managed to not let his Hollywood career stand in the way of his athletic background. He has been awarded his Third Degree Black Belt by the World Karate Organization in Tokyo. His accomplishments include being the Captain of the Swedish National Karate Team, as well as a Champion of the Swedish, European and Australian Heavyweight Division titles. Lundgren still regularly performs Karate exhibitions at international tournaments worldwide. In addition to his Karate expertise, Dolph was selected by the U.S. Olympic Committee to serve as the Team Leader of the 1996 U.S. Olympic Pentathlon Team during the Atlanta Games. He is actively involved in promoting the image of this sport. Lundgren's production company, Thor Pictures, is developing several projects in which he will produce, star and/or direct. He is also a founding member of \"Group of Eight\", a New York theater group started in 1994. Lundgren has also been working on a fitness book and sports wear line for men, the creation and launch of a new Dolph Lundgren brand, a licensing, media and publishing program and the development of future entertainment and media projects. Lundgren is married to Anette Qviberg-Lundgren, an interior decorator and fashion designer. The couple, along with their two daughters, resides in Marbella, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000185","name":"Dolph Lundgren","idIMDB":"nm0000185"},"actorId":"nm0000185","character":"Andrew Scott","urlCharacter":"http://www.imdb.com/character/ch0012805","main":true},{"actorName":"Andrei Arlovski","urlProfile":"http://www.imdb.com/name/nm1844999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4OTU2NjM5OV5BMl5BanBnXkFtZTgwMzI2MTczNzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1979","placeOfBirth":" Minsk, Byelorussian SSR, USSR [now Belarus]","height":"6' 4\" (1.93 m)","bio":"Andrei Arlovski was born on February 4, 1979 in Minsk, Byelorussian SSR, USSR. He is an actor, known for UFC 55: Fury (2005), UFC 59: Reality Check (2006) and UFC 47: It's On! (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4OTU2NjM5OV5BMl5BanBnXkFtZTgwMzI2MTczNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1844999","name":"Andrei Arlovski","nicknames":["The Pit Bull"],"idIMDB":"nm1844999"},"actorId":"nm1844999","character":"NGU","urlCharacter":"http://www.imdb.com/character/ch0435917","main":true},{"actorName":"Mike Pyle","urlProfile":"http://www.imdb.com/name/nm3046541","urlPhoto":"","biography":{"bio":"Mike Pyle is known for his work on Men in Black 3 (2012), Universal Soldier: Regeneration (2009) and Safe (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3046541","name":"Mike Pyle","idIMDB":"nm3046541"},"actorId":"nm3046541","character":"Captain Kevin Burke","urlCharacter":"http://www.imdb.com/character/ch0496761","main":true},{"actorName":"Corey Johnson","urlProfile":"http://www.imdb.com/name/nm0424819","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODIxMTI2N15BMl5BanBnXkFtZTgwMjE4MTIyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1961","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"John Johnson","height":"5' 11\" (1.8 m)","bio":"Corey Johnson was born on May 17, 1961 in New Orleans, Louisiana, USA as John Johnson. He is an actor, known for Captain Phillips (2013), Jackie (2016) and The Bourne Ultimatum (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODIxMTI2N15BMl5BanBnXkFtZTgwMjE4MTIyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424819","name":"Corey Johnson","idIMDB":"nm0424819"},"actorId":"nm0424819","character":"Colonel John Coby","urlCharacter":"http://www.imdb.com/character/ch0496762","main":true},{"actorName":"Garry Cooper","urlProfile":"http://www.imdb.com/name/nm0178041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzgyMjQ2N15BMl5BanBnXkFtZTgwODQwNzc2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1955","placeOfBirth":" Hull, East Yorkshire, England, UK","bio":"Garry Cooper was born in 1955 in Hull, East Yorkshire, England. He is an actor, known for My Beautiful Laundrette (1985), Caravaggio (1986) and Universal Soldier: Regeneration (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzgyMjQ2N15BMl5BanBnXkFtZTgwODQwNzc2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0178041","name":"Garry Cooper","idIMDB":"nm0178041"},"actorId":"nm0178041","character":"Dr. Porter","urlCharacter":"http://www.imdb.com/character/ch0496763","main":true},{"actorName":"Emily Joyce","urlProfile":"http://www.imdb.com/name/nm0431521","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDg2MTE1N15BMl5BanBnXkFtZTcwNzQ0NDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1969","placeOfBirth":" Woolwich, London, England, UK","birthName":"Emily Sian Joyce","bio":"Emily Joyce is the youngest of three sisters, all of whom are in the entertainment business in the UK. Their mother loved the theater, took the three girls to shows constantly, and Emily auditioned for, and was accepted into, the National Youth Theatre when she was 15. After working at British Vogue, she went to drama school, while singing lead in a rock band called \"In Spite of All That.\" Eventually she decided to focus on acting, and left her singing career behind. After drama school Joyce performed for a season with the Royal Shakespeare Company and had a guest role, as a murderer, in the ITV drama Cracker (1993). Since then she has worked in English television, and has played the female lead in My Hero (2000) since 2000.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDg2MTE1N15BMl5BanBnXkFtZTcwNzQ0NDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0431521","name":"Emily Joyce","idIMDB":"nm0431521"},"actorId":"nm0431521","character":"Dr. Sandra Flemming","urlCharacter":"http://www.imdb.com/character/ch0496764","main":true},{"actorName":"Zachary Baharov","urlProfile":"http://www.imdb.com/name/nm1707712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NzcxMzYxMF5BMl5BanBnXkFtZTgwNDc5MTQzMTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1980","placeOfBirth":" Bulgaria","height":"6' 4\" (1.93 m)","bio":"Zachary Baharov was born in Sofia, Bulgaria. He studied acting at the National Academy for Theatre and Film Arts. He is acting on stage with the National Theatre \"Ivan Vazov\" Company since 2003. Notable theatrical performances include King Lear (2006), Don Juan (2007), and The Cherry Orchard (2009). His first major role in a feature film was in Zift, followed by Command Performance and Universal Soldier Regeneration. In 2010, he appeared in Peter Weir's The Way Back. Baharov is best known for his role of Ivo Andonov in the Bulgarian TV series \"Undercover\" (\"Pod prikritie\"). He most recently participated in HBO's popular production - \"Game of Thrones\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NzcxMzYxMF5BMl5BanBnXkFtZTgwNDc5MTQzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1707712","name":"Zachary Baharov","idIMDB":"nm1707712"},"actorId":"nm1707712","character":"General Topov","urlCharacter":"http://www.imdb.com/character/ch0496765","main":true},{"actorName":"Aki Avni","urlProfile":"http://www.imdb.com/name/nm0043259","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMjk4MDQ3MTleQTJeQWpwZ15BbWU4MDM3OTMzMTQx._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1967","placeOfBirth":" Israel","bio":"Aki Avni was born on April 27, 1967 in Israel. He is an actor, known for Time of Favor (2000), Universal Soldier: Regeneration (2009) and Free Zone (2005). He was previously married to Sendi Bar.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMjk4MDQ3MTleQTJeQWpwZ15BbWU4MDM3OTMzMTQx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0043259","name":"Aki Avni","idIMDB":"nm0043259"},"actorId":"nm0043259","character":"General Boris","urlCharacter":"http://www.imdb.com/character/ch0496767","main":true},{"actorName":"Kerry Shale","urlProfile":"http://www.imdb.com/name/nm0787715","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MzgzODcyMl5BMl5BanBnXkFtZTgwNDU3OTE0NDE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1958","placeOfBirth":" Winnipeg, Manitoba, Canada","bio":"Kerry Shale is a North American actor, based in London, England since 1978. He has worked on stage in the West End and at the Royal National Theater as well as the Almeida, Hampstead, the Donmar Warehouse and the Royal Court theaters, appearing in plays by Garcia Lorca and Wallace Shawn, Neil Simon and Woody Allen. His first film was Barbra Streisand's Yentl. Recent work (2016) includes Undercover and New Blood (BBC TV) and Final Portrait (directed by Stanley Tucci).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MzgzODcyMl5BMl5BanBnXkFtZTgwNDU3OTE0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0787715","name":"Kerry Shale","idIMDB":"nm0787715"},"actorId":"nm0787715","character":"Dr. Colin","urlCharacter":"http://www.imdb.com/character/ch0496768","main":true},{"actorName":"Yonko Dimitrov","urlProfile":"http://www.imdb.com/name/nm3758875","urlPhoto":"","biography":{"bio":"Yonko Dimitrov is an actor, known for Universal Soldier: Regeneration (2009) and Crystal Inferno (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3758875","name":"Yonko Dimitrov","idIMDB":"nm3758875"},"actorId":"nm3758875","character":"Dimitri","urlCharacter":"http://www.imdb.com/character/ch0496770","main":true},{"actorName":"Violeta Markovska","urlProfile":"http://www.imdb.com/name/nm0548701","urlPhoto":"","biography":{"dateOfBirth":"24 April 1987","placeOfBirth":" Sofia, Bulgaria","bio":"Violeta Markovska was born on April 24, 1987 in Sofia, Bulgaria. She is an actress, known for Stolichani v poveche (2011), Universal Soldier: Regeneration (2009) and Undisputed 2: Last Man Standing (2006). She has been married to Ivaylo Angarski since 2012.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0548701","name":"Violeta Markovska","idIMDB":"nm0548701"},"actorId":"nm0548701","character":"Ivana","urlCharacter":"http://www.imdb.com/character/ch0496772","main":true},{"actorName":"Stanislav Pishtalov","urlProfile":"http://www.imdb.com/name/nm1169343","urlPhoto":"","biography":{"bio":"Stanislav Pishtalov is an actor, known for The Way Back (2010), Automata (2014) and Conan the Barbarian (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1169343","name":"Stanislav Pishtalov","idIMDB":"nm1169343"},"actorId":"nm1169343","character":"P.M. Musayev","urlCharacter":"http://www.imdb.com/character/ch0496771","main":true},{"actorName":"Marianne Stanicheva","urlProfile":"http://www.imdb.com/name/nm0821988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjM5NDcwNV5BMl5BanBnXkFtZTcwMTc2OTkxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Marianne Stanicheva is a casting director and actress, known for The Expendables 2 (2012), The Expendables 3 (2014) and London Has Fallen (2016). She has been married to John Cappilla since December 8, 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjM5NDcwNV5BMl5BanBnXkFtZTcwMTc2OTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0821988","name":"Marianne Stanicheva","idIMDB":"nm0821988"},"actorId":"nm0821988","character":"Olga","urlCharacter":"http://www.imdb.com/character/ch0496773","main":true},{"actorName":"John Laskowski","urlProfile":"http://www.imdb.com/name/nm2965944","urlPhoto":"","biography":{"dateOfBirth":"5 November 1961","placeOfBirth":" New Jersey, USA","bio":"John Laskowski was born on November 5, 1961 in New Jersey, USA. He is an actor and director, known for Universal Soldier: Regeneration (2009), Branded (2012) and Lake Placid 3 (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2965944","name":"John Laskowski","idIMDB":"nm2965944"},"actorId":"nm2965944","character":"Captain","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1288403","urlIMDB":"http://www.imdb.com/title/tt1288403","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"€14,250","country":"Italy","day":"06","month":"06","year":"2010","remarks":""},{"money":"$19,338","country":"Malaysia","day":"24","month":"01","year":"2010","remarks":"20 Screens"},{"money":"$31,304","country":"Philippines","day":"10","month":"01","year":"2010","remarks":"17 Screens"}],"gross":[{"money":"$845,197","country":"non-USA","day":"28","month":"09","year":"2010","remarks":""},{"money":"$17,061","country":"Italy","day":"09","month":"06","year":"2010","remarks":""},{"money":"$7,455","country":"Lebanon","day":"04","month":"04","year":"2010","remarks":""},{"money":"$93,154","country":"Philippines","day":"17","month":"01","year":"2010","remarks":""},{"money":"$305,503 (United","country":"Arab","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$17,061","country":"Italy","day":"06","month":"06","year":"2010","remarks":""},{"money":"$800","country":"Lebanon","day":"04","month":"04","year":"2010","remarks":"1 Screen"},{"money":"$5,196","country":"Lebanon","day":"28","month":"03","year":"2010","remarks":"5 Screens"}],"admissions":[{"money":"10,216 (Italy)","country":"","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"02","year":"2009","remarks":null},null],"copyrightHolder":"© 2009 Unisol 3 Distribution, LLC"},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red One Camera"],"laboratory":null,"filmLength":["2,652 m"],"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.2","filmingLocations":[{"location":"Bulgaria"}],"rated":"R","awards":[],"votes":"22,502","type":"Movie","companyCreditsSimple":[{"idCompany":"co0139768","name":"Foresight Unlimited"},{"idCompany":"co0119730","name":"Signature Pictures"},{"idCompany":"co0191075","name":"Baumgarten Management and Productions (BMP)"}],"keywords":{"keywords":["soldier","terrorist","showdown","u.s. army","suspense","machismo","2000s","guerrilla army","bullet ballet","gun","blood splatter","gun battle","gun duel","gun fu","fight to the death","cyborg","mixed martial arts","kickboxing","fistfight","brawl","hand to hand combat","one man army","one against many","action hero","hero","foot chase","chase","gash in the face","hijacking","self mutilation","treadmill","human experiment","knocked out with a gun butt","head butt","transmitter","rehabilitation","anti hero","good versus evil","cult film","cabin","bare chested male","gunfight","slow motion scene","shot through a window","falling from height","subtitled scene","kicking in a door","insubordination","race against time","revenge","superhuman","hook","corpse","cigarette smoking","child in peril","bleeding mouth","lifting someone into the air","ghost town","returning character killed off","shot through a wall","crashing through a wall","back from the dead","death","murder","crashing through a window","jumping through a window","falling down stairs","long take","inhumanity","training","target practice","hypodermic needle","injection","body count","massacre","suicide","self sacrifice","apprentice","held at gunpoint","genetic engineering","coming out of retirement","exploding body","hand grenade","bulletproof vest","rorschach inkblot","eye gouging","battering ram","impalement","beaten to death","1960s","archive footage","jumping from height","super strength","invulnerability","severed arm","prosthetic arm","circular saw","operation","cryogenics","antenna","camera","smoke grenade","gas mask","home invasion","snow","punched in the face","punched in the stomach","kicked in the stomach","kicked in the head","kicked in the face","martial arts","fight","strong man","tough guy","restaurant","dog","amnesia","british","psychologist","mad scientist","doctor","scientist","recovery","blood on camera lens","gore","blood","prime minister","nuclear reactor","power plant","nuclear threat","timebomb","dynamite","filmed killing","video","surveillance footage","surveillance","montage","mercenary","virginia","commander","general","captain","colonel","terrorism","mother daughter relationship","father daughter relationship","father son relationship","mother son relationship","brother sister relationship","husband wife relationship","silencer","escape","rescue","hostage","kidnapping","helicopter","strangulation","throat slitting","neck breaking","stabbed in the leg","stabbed in the back","stabbed in the crotch","stabbed in the chest","stabbed in the throat","stabbed in the head","stabbed in the face","stabbed in the eye","blade","knife","shot in the crotch","shot in the leg","shot in the shoulder","head blown off","shot in the forehead","shot in the face","shot in the head","shot in the back","shot to death","police car","uzi","pistol","machine gun","car chase","shootout","overturning car","flipping car","car accident","car crash","body slam","hit by a car","museum","villain played by lead actor","soldier shot","shot in the chest","soldier killed","police officer","shooting a police officer","police officer shot in the chest","murder of a police officer","police chase","dead soldier","super soldier","chernobyl ukraine","explosive","violence","sequel","secret mission","mind control","military","meltdown","fifth part","explosion","clone","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:25:55"}}