{"data":{"movies":[{"title":"Red Riding: The Year of Our Lord 1980","originalTitle":"","year":"2009","releaseDate":"20091111","directors":[{"name":"James Marsh","id":"nm1016428"}],"writers":[{"name":"Tony Grisoni","id":"nm0342617"},{"name":"David Peace","id":"nm3030961"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NTY0ODM4MV5BMl5BanBnXkFtZTcwNzMzMzExMw@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"With a serial killer claiming victim 13 and rumors of corruption in their force, the West Yorkshire cops are told to cooperate with a team from outside - Peter Hunter and two hand-picked associates. Hunter gets little help but plunges ahead, discovering that one of the 13 victims may have a different killer. This part of the investigation leads to late-night calls, another murder, and bureaucratic moves to push Hunter aside: he may be getting close, not to the serial killer but to bad apples in the force. Christmas approaches.","simplePlot":"A team of investigators attempt to stop a serial killer known as the Yorkshire Ripper from claiming his next victim, but uncover something far more terrifying.","actors":[{"actorName":"Warren Clarke","urlProfile":"http://www.imdb.com/name/nm0165049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc1MDAxM15BMl5BanBnXkFtZTcwMzYzMDgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1947","placeOfBirth":" Oldham, Lancashire, England, UK","birthName":"Alan James Clarke","height":"5' 10½\" (1.79 m)","bio":"Lancashire-born Warren Clarke was an actor of immense presence and considerable versatility who turned his wide-shouldered, robust appearance and lived-in, hangdog facial features into an asset. For more than two and a half decades he had toiled in a wide variety of supporting roles before finding international success as the often crude, irascible, heavy-drinking Superintendant Andy Dalziel in TV's Dalziel and Pascoe (1996). When the series began, Clarke had summed up Dalziel as 'a beer-swilling chauvinist pig', but the character evolved and became more complex and endearing (in a curmudgeonly sort of way) over the show's eleven-year duration. There were also commonalities between the actor and his creation: impatience, a reputation for not tolerating fools gladly; a humorous, irreverent nature and a shared dislike for political correctness. In private life, Clarke was passionate about football (a lifelong Manchester City supporter) and golf. The son of a hard-working stained glass maker, Clarke developed his love for the performing arts while in his teens. A frequent visitor to the cinema for Saturday morning and matinée screenings (\"Flash Gordon\" seemed to have been a particular favourite), he was actively encouraged by his parents to follow his chosen vocation. He performed in amateur theatrics, meanwhile earning his money as a copy boy, running errands for the Manchester Evening News, then working in a fruit and vegetable market before securing his first acting gig with Huddersfield Rep at the age of eighteen. Clarke once recalled his first performance, as an elderly German academic, which was marred by a make-up malfunction when the self-raising flour he had put in his hair to make it appear white mixed with perspiration, turned to dough and ran down his face. He would eventually master the stage (enacting, among other parts, Caligula in John Mortimer's 1972 adaptation of \"I, Claudius\" and Winston Churchill in \"Three Days in May\" at the West End, a performance the reviewer of The Guardian described as \"utterly persuasive\"). From the late 1960's, Clarke found more or less regular television work, at first with Granada in series like The Avengers (1961) and Callan (1967). For years he remained a struggling actor, earning barely enough to make ends meet. He performed on stage at the Royal Court in London, and, to improve his situation, earned a second income as a van driver. He finally attracted attention on the big screen as a violent, bowler-hatted thug in Stanley Kubrick's A Clockwork Orange (1971). The turning point in Clarke's career was his role as a pig-headed manager of an engineering firm involved in a chalk-and-cheese relationship with a liberal-minded academic in Nice Work (1989). In the years between, his expressive features graced a succession of diverse leading and supporting parts in both comedy and drama: Churchill in ITV's Jennie: Lady Randolph Churchill (1974); Quasimodo in the 1976 television version of \"The Hunchback of Notre Dame\"; a mutinous Roman soldier in the epic miniseries Masada (1981); a surly East German STASI officer in the uproarious parody Top Secret! (1984); a pig-fixated Regency period industrialist in Black Adder the Third (1987); stalwart, bewhiskered Lawrence Boythorne in BBC's outstanding production of Bleak House (2005); \"pathetically nice\" market gardener Brian Addis in the first two seasons of Down to Earth (2000). Clarke's guest appearances were prolific: from Elsie Tanner's nephew in Coronation Street (1960) to a querulous diabetic patient in Call the Midwife (2012). Always a welcome presence in period drama, he had been cast in Poldark (2015), a remake of the popular 1975 miniseries, based on the novels by Winston Graham. Filming had already begun in Bristol and Cornwall when Clarke died in his sleep at the age of 67.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc1MDAxM15BMl5BanBnXkFtZTcwMzYzMDgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0165049","name":"Warren Clarke","idIMDB":"nm0165049"},"actorId":"nm0165049","character":"Bill Molloy","urlCharacter":"http://www.imdb.com/character/ch0140018","main":true},{"actorName":"Paddy Considine","urlProfile":"http://www.imdb.com/name/nm0175916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU1ODIxMzgyMF5BMl5BanBnXkFtZTYwMTU1NzE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1974","placeOfBirth":" Burton-on-Trent, Staffordshire, England, UK","height":"5' 11\" (1.8 m)","bio":"Paddy (Patrick) Considine was born on September 5, 1974 in Burton-on-Trent, Staffordshire in the U.K. As a teenager, Considine studied a drama course at Burton College where he met with now friend and director Shane Meadows, who cast Considine in his first role in a feature film as the disturbed character Morell in A Room for Romeo Brass (1999). Considine's performance in that movie got him cast in Pawel Pawlikowski's Last Resort (2000) the following year. Further roles ensued, including an acclaimed turn as Johnny in Jim Sheridan's In America (2002). Along with his lead roles, Considine has had a number of scene-stealing supporting roles in films such as 24 Hour Party People (2002), Born Romantic (2000), and The Martins (2001). Considine has been noticed for his performance as Richard the revengeful brother in the applauded film Dead Man's Shoes (2004), which he co-wrote with Shane Meadows, and for his role as Phil the Born again Christian in Pawlikowski's My Summer of Love (2004). In 2005, Considine co-starred with Russell Crowe and Renée Zellweger in Cinderella Man (2005). Other notable roles in recent years include small-but-memorable turns in Hot Fuzz (2007) and The Bourne Ultimatum (2007), along with bigger roles in Red Riding: The Year of Our Lord 1980 (2009) and Submarine (2010). Considine has also recently tried his hand at writing and directing. His feature-length directing debut, Tyrannosaur (2011), won Considine a BAFTA Award for Outstanding Debut by a British Writer, Director, or Producer. Considine has one child, Joseph, with wife Shelley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU1ODIxMzgyMF5BMl5BanBnXkFtZTYwMTU1NzE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175916","name":"Paddy Considine","idIMDB":"nm0175916"},"actorId":"nm0175916","character":"Peter Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Fox","urlProfile":"http://www.imdb.com/name/nm0289038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDIzNDg1M15BMl5BanBnXkFtZTgwOTY5ODMzMjE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1939","placeOfBirth":" London, England, UK","birthName":"William Fox","height":"6' 1\" (1.86 m)","bio":"James Fox is the second of three sons, born to the theatrical agent Robin Fox and his actress wife Angela Worthington - aka Angela Fox. His brothers are the actor Edward Fox and the producer Robert Fox. He started acting as a child actor and used his real name, until he reached his early 20s. He trained at the Central School of Speech and Drama. He left for nine years from 1970 to 1979 to pursue Christian vocational work. His niece is the actress Emilia Fox and he has a half-brother to the actor Daniel Chatto. From his marriage to Mary Piper, he has four sons: Thomas Fox, born 1975; Robin Fox, born 1976; the actors Laurence Fox, born 1978; Jack Fox, born 1985, and one daughter, Lydia Fox, born 1979. He published a book, \"Comeback: An Actor's Direction\", in 1983.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDIzNDg1M15BMl5BanBnXkFtZTgwOTY5ODMzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0289038","name":"James Fox","idIMDB":"nm0289038"},"actorId":"nm0289038","character":"Philip Evans","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Calder","urlProfile":"http://www.imdb.com/name/nm0129464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk5OTAxOTM0OV5BMl5BanBnXkFtZTcwMTU0MDQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1946","placeOfBirth":" Portsmouth, England, UK","bio":"Classically-trained veteran actor David Calder was born on August 1, 1946 in Portsmouth, England. Possesses an impressive resume of accomplished work in acting since 1968. White-haired David Calder often appears as a wise, scholarly old gentleman in almost any film or television appearance he makes. Undoubtedly an accomplished and easily-recognizable face to British audiences, David perhaps is better known to American audiences with his appearances in high profile movies such as the James Bond spy-action film The World Is Not Enough (1999) as Sir Robert King, the on-screen father of Sophie Marceau; and then in the Mummy trilogy subtitled The Mummy: Tomb of the Dragon Emperor (2008). During the 2010s, Calder has appeared in such further A-list films and television series, including the Ron Howard-directed race car-driving film drama Rush (2013), starring 'Chris Hemsworth'. His continued work in British television includes appearances on \"The Wrong Mans\" (2013) and \"Casualty\" (1986). Recently Calder appeared in the 2016 miniseries The Moonstone (2016) and guest starred in \"Emerald City\" (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk5OTAxOTM0OV5BMl5BanBnXkFtZTcwMTU0MDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0129464","name":"David Calder","idIMDB":"nm0129464"},"actorId":"nm0129464","character":"Sir John Marsden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Woodeson","urlProfile":"http://www.imdb.com/name/nm0940245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDczMDQ1NzEwOV5BMl5BanBnXkFtZTcwNzI3NjAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1949","placeOfBirth":" England, UK","height":"5' 4\" (1.63 m)","bio":"Nicholas - or Nick - Woodeson, born in 1949 in England to British parents - spent his early childhood in Haifa in Israel in line with his parents' diplomatic postings and recalls that his first taste of thespian glory was reciting A.A. Milne poems to family friends at the age of six. Nick's strong affinity and regard for the Middle East has meant that, in the 2000s, he has written several heart-felt letters to English broadsheet newspapers expressing his views on the Middle East crisis and American involvement therein. Sent back to England to complete a boarding school education, he went on to Sussex University where his interest in drama re-surfaced and he engaged in competitive productions for the British National Student Drama Festival. As a consequence he was noticed by, and obtained his first acting job for, the theatrical repertory company at Crewe in Cheshire, England, ruefully noting in hindsight that he was usually a prompter or assistant stage manager, rather than a player. However, he soon obtained a scholarship to the Royal Academy of Dramatic Arts, and later joined the prestigious Royal Shakespeare Company, in 1981, remaining with them intermittently until 1990. He has consequently appeared in other media including films like 'Topsy-Turvy' and television dramas like 'Midsomer Murders' in 1998, where he played one of several murder suspects, along with actress Angela Pleasence. A year later, Angela and Nick played a mother and son in the stage play 'The Late Middle Classes', notwithstanding the fact that there was only an eight year age gap between them. From 2007, he reached a global audience as Julius Caesar's clever and loyal \"body slave\" Posca, in the BBC/HBO TV blockbuster, 'Rome'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDczMDQ1NzEwOV5BMl5BanBnXkFtZTcwNzI3NjAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940245","name":"Nicholas Woodeson","idIMDB":"nm0940245"},"actorId":"nm0940245","character":"Michael Warren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Cook","urlProfile":"http://www.imdb.com/name/nm0177267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjY2OTMwMl5BMl5BanBnXkFtZTcwMTM2MDgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1948","placeOfBirth":" South Shields, Tyne and Wear, England, UK","bio":"Ron Cook was born in 1948 in South Shields, Tyne and Wear, England. He is an actor, known for Chocolat (2000), Hot Fuzz (2007) and Secrets & Lies (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjY2OTMwMl5BMl5BanBnXkFtZTcwMTM2MDgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177267","name":"Ron Cook","idIMDB":"nm0177267"},"actorId":"nm0177267","character":"Clement Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maxine Peake","urlProfile":"http://www.imdb.com/name/nm0668845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTY5NTAwNF5BMl5BanBnXkFtZTcwMzY5NTYxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1974","placeOfBirth":" Westhoughton, Bolton, Lancashire, England, UK","height":"5' 7\" (1.7 m)","bio":"Maxine Peake is an English stage, radio, film and television actress, who made her name as Twinkle in Victoria Wood's sitcom Dinnerladies. She has since played Veronica in Channel 4's Manchester-based drama series Shameless, barrister Martha Costello in the BBC legal drama Silk and Grace Middleton in The Village. She is also an accomplished stage actress, having played the title role in Hamlet, and had a role in the 2014 film The Theory of Everything. Peake has appeared in a number of television and stage productions including Victoria Wood's Dinnerladies, Channel 4's Shameless, in the lead role of barrister Martha Costello in the BBC's legal drama Silk and alongside John Simm in the BBC drama The Village, depicting life in a Derbyshire village during the First World War. Following career advice from Victoria Wood, between the two series of Dinnerladies, Peake lost so much weight that an explanation had to be written into the script for her character, Twinkle. Peake portrayed the Moors murderer Myra Hindley in See No Evil: The Moors Murders. Broadcast in May 2006, it was met with mixed reactions; soon after this Peake announced that she was leaving Shameless. January 2009 saw Peake appear in her first major feature film role, as Angela, in the film Clubbed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTY5NTAwNF5BMl5BanBnXkFtZTcwMzY5NTYxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0668845","name":"Maxine Peake","idIMDB":"nm0668845"},"actorId":"nm0668845","character":"Helen Marshall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Pitts","urlProfile":"http://www.imdb.com/name/nm0686029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDc0NTUxN15BMl5BanBnXkFtZTgwMTk4MzczMDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1962","placeOfBirth":" Sheffield, South Yorkshire, England, UK","height":"6' (1.83 m)","bio":"Tony Pitts was born on October 10, 1962 in Sheffield, South Yorkshire, England. He is an actor and writer, known for Rogue One (2016), War Horse (2011) and Red Riding: The Year of Our Lord 1980 (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDc0NTUxN15BMl5BanBnXkFtZTgwMTk4MzczMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0686029","name":"Tony Pitts","idIMDB":"nm0686029"},"actorId":"nm0686029","character":"John Nolan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Carter","urlProfile":"http://www.imdb.com/name/nm0141697","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTIzOTk2MF5BMl5BanBnXkFtZTcwMjk1ODI1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1948","placeOfBirth":" Harrogate, Yorkshire, England, UK","birthName":"James Edward Carter","height":"6' 2\" (1.88 m)","bio":"Jim Carter was born on August 19, 1948 in Harrogate, Yorkshire, England as James Edward Carter. He is an actor, known for Downton Abbey (2010), The Golden Compass (2007) and Shakespeare in Love (1998). He has been married to Imelda Staunton since October 1983. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTIzOTk2MF5BMl5BanBnXkFtZTcwMjk1ODI1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0141697","name":"Jim Carter","idIMDB":"nm0141697"},"actorId":"nm0141697","character":"Harold Angus","urlCharacter":"http://www.imdb.com/character/ch0136999","main":true},{"actorName":"David Morrissey","urlProfile":"http://www.imdb.com/name/nm0607375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTM4NjQzMV5BMl5BanBnXkFtZTgwOTk3MTY3MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1964","placeOfBirth":" Everton, Liverpool, England, UK","height":"6' 3\" (1.91 m)","bio":"David Morrissey started acting at Everyman's Youth Theatre in Liverpool, where he was born and raised. He made an auspicious debut in One Summer (1983), a series about two Liverpool runaways. Following a degree at RADA, he worked with the theatre company Cheek By Jowl. He has also worked at theatre such as the Manchester Royal Exchange and the National Theatre. He is married to novelist Esther Freud, the great-granddaughter of Sigmund Freud and daughter of artist Lucian Freud.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTM4NjQzMV5BMl5BanBnXkFtZTgwOTk3MTY3MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607375","name":"David Morrissey","idIMDB":"nm0607375"},"actorId":"nm0607375","character":"Maurice Jobson","urlCharacter":"http://www.imdb.com/character/ch0123563","main":true},{"actorName":"Eddie Marsan","urlProfile":"http://www.imdb.com/name/nm0550371","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjk0MTAxNV5BMl5BanBnXkFtZTcwMTA2NjQ0Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1968","placeOfBirth":" Stepney, London, England, UK","birthName":"Edward Maurice Charles Marsan","height":"5' 8½\" (1.74 m)","bio":"Eddie Marsan was born in Bethnal Green, East London, to a lorry driver father and a school employee mother. He served an apprenticeship as a printer before becoming an actor twenty years ago. During this time he has worked with directors such as Martin Scorsese, Michael Mann, Steven Spielberg, Terrence Malick, Woody Allen, Alejandro González Iñárritu, J.J. Abrams, Peter Berg, Guy Ritchie and Richard Linklater. He has collaborated with Mike Leigh on three films: Vera Drake (2004), for which he won the British Independent Film Award for best supporting actor; Happy-Go-Lucky (2008), for which he also won a BIFA for best supporting actor as well as the London Film Critics Circle Award and the National Society Of Film Critics; and he has just completed Mike Leigh's latest film, A Running Jump (2012). He was nominated for an Evening Standard Film Award for best actor for The Disappearance of Alice Creed (2009). He is a patron for the School of the Science of Acting and Kazzum, a children's theatre company that promotes the acceptance of Diversity. He is married to the make-up artist Janine Schneider (aka Janine Schneider-Marsan) and they have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjk0MTAxNV5BMl5BanBnXkFtZTcwMTA2NjQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0550371","name":"Eddie Marsan","idIMDB":"nm0550371"},"actorId":"nm0550371","character":"Jack Whitehead","urlCharacter":"http://www.imdb.com/character/ch0136996","main":true},{"actorName":"Sean Harris","urlProfile":"http://www.imdb.com/name/nm0365317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NTI1NzI4MF5BMl5BanBnXkFtZTcwODU1MTg4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1966","placeOfBirth":" Bethnal Green, London, England, UK","height":"6' (1.83 m)","bio":"Sean Harris was born in 1966 in Bethnal Green, London, England. He is an actor and writer, known for Prometheus (2012), Mission: Impossible - Rogue Nation (2015) and Harry Brown (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NTI1NzI4MF5BMl5BanBnXkFtZTcwODU1MTg4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0365317","name":"Sean Harris","idIMDB":"nm0365317"},"actorId":"nm0365317","character":"Bob Craven","urlCharacter":"http://www.imdb.com/character/ch0136994","main":true},{"actorName":"Tony Mooney","urlProfile":"http://www.imdb.com/name/nm0600781","urlPhoto":"","biography":{"dateOfBirth":"10 June 1965","placeOfBirth":"","bio":"Tony Mooney was born on June 10, 1965. He is known for his work on Scott & Bailey (2011), The Tournament (2009) and Red Riding: The Year of Our Lord 1983 (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0600781","name":"Tony Mooney","idIMDB":"nm0600781"},"actorId":"nm0600781","character":"Tommy Douglas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shaun Dooley","urlProfile":"http://www.imdb.com/name/nm0233215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjU2MDA4Ml5BMl5BanBnXkFtZTgwNjAzNzY5MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1974","placeOfBirth":" Barnsley, Yorkshire, England, UK","height":"6' (1.83 m)","bio":"Shaun was born in Barnsley, South Yorkshire, to Ann and Denis Dooley. He has two younger sisters, Stephanie Dooley and Kimberly Dooley. Shaun is married to Polly Cameron. Despite living in London, Shaun still attends all of Barnsley FC's home games. Shaun won the RTS Northwest award for best actor in the award-winning film The Mark of Cain (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjU2MDA4Ml5BMl5BanBnXkFtZTgwNjAzNzY5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0233215","name":"Shaun Dooley","idIMDB":"nm0233215"},"actorId":"nm0233215","character":"Dick Alderman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Oxtoby","urlProfile":"http://www.imdb.com/name/nm0654608","urlPhoto":"","biography":{"bio":"Ken Oxtoby is an actor, known for Red Riding: The Year of Our Lord 1980 (2009), The Curse of Steptoe (2008) and O Lucky Man! (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0654608","name":"Ken Oxtoby","idIMDB":"nm0654608"},"actorId":"nm0654608","character":"Hotel Receptionist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1260581","urlIMDB":"http://www.imdb.com/title/tt1260581","business":{"budget":null,"openingWeekend":[{"money":"$14,526","country":"USA","day":"07","month":"02","year":"2010","remarks":"1 Screen"}],"gross":[{"money":"$148,826","country":"USA","day":"25","month":"04","year":"2010","remarks":""},{"money":"$141,140","country":"USA","day":"18","month":"04","year":"2010","remarks":""},{"money":"$131,715","country":"USA","day":"11","month":"04","year":"2010","remarks":""},{"money":"$126,004","country":"USA","day":"04","month":"04","year":"2010","remarks":""},{"money":"$117,115","country":"USA","day":"28","month":"03","year":"2010","remarks":""},{"money":"$105,074","country":"USA","day":"21","month":"03","year":"2010","remarks":""},{"money":"$79,444","country":"USA","day":"07","month":"03","year":"2010","remarks":""},{"money":"$67,418","country":"USA","day":"28","month":"02","year":"2010","remarks":""},{"money":"$55,745","country":"USA","day":"21","month":"02","year":"2010","remarks":""},{"money":"$14,526","country":"USA","day":"07","month":"02","year":"2010","remarks":""}],"weekendGross":[{"money":"$4,469","country":"USA","day":"25","month":"04","year":"2010","remarks":"7 Screens"},{"money":"$6,415","country":"USA","day":"18","month":"04","year":"2010","remarks":"9 Screens"},{"money":"$3,474","country":"USA","day":"11","month":"04","year":"2010","remarks":"8 Screens"},{"money":"$3,775","country":"USA","day":"04","month":"04","year":"2010","remarks":"7 Screens"},{"money":"$8,140","country":"USA","day":"28","month":"03","year":"2010","remarks":"8 Screens"},{"money":"$10,349","country":"USA","day":"21","month":"03","year":"2010","remarks":"7 Screens"},{"money":"$6,738","country":"USA","day":"07","month":"03","year":"2010","remarks":"5 Screens"},{"money":"$7,516","country":"USA","day":"28","month":"02","year":"2010","remarks":"4 Screens"},{"money":"$7,253","country":"USA","day":"21","month":"02","year":"2010","remarks":"3 Screens"},{"money":"$14,526","country":"USA","day":"07","month":"02","year":"2010","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Zeiss Master Prime Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Fuji Super F-64D 8522, Eterna 250T 8553, Eterna 500T 8573)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Techniscope (source format)"],"printedFilmFormat":["35 mm (anamorphic)","Video (HDTV)"]},"rating":"7.2","filmingLocations":[],"rated":"NOT RATED","awards":[{"award":"Broadcasting Press Guild Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Broadcasting Press Guild Award","categories":[{"category":"Best Actor","names":[{"name":"David Morrissey","id":"nm0607375","role":null},{"name":"Red Riding: The Year of Our Lord 1974","id":"tt1259574","role":null},{"name":"Red Riding: The Year of Our Lord 1983","id":"tt1259573","role":null}]}]}]},{"award":"Crime Thriller Awards, UK 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Dagger","categories":[{"category":"Best Leading Actor","names":[{"name":"Paddy Considine","id":"nm0175916","role":null}]}]}]}],"votes":"7,021","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0103747","name":"Channel Four Film"},{"idCompany":"co0087854","name":"Lipsync Productions"},{"idCompany":"co0103733","name":"Revolution Films"}],"keywords":{"keywords":["serial killer","yorkshire","christmas","murder","death","urination","black and white photograph","criminal act","conspiracy","frightened man","hotel","infidelity","police informant","dead prostitute","double murder","corrupt cop","firebomb","double cross","shot in the chest","leaving flowers on a grave","cemetery","false confession","cremation","fired from the job","casket","house fire","nose to nose","mens room","eavesdropping","press conference","audio tape","girlie magazine","year 1980","graffiti","camera shot of feet","second part","part of trilogy","sequel","year in title","based on novel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:21:41"}}