{"data":{"movies":[{"title":"Dear Prudence","originalTitle":"","year":"2009","releaseDate":"20080823","directors":[{"name":"Paul Schneider","id":"nm0004621"}],"writers":[{"name":"Les Alexander","id":"nm0018573"},{"name":"Rob Gilmer","id":"nm0319484"}],"countries":["USA","Canada"],"languages":["English"],"genres":["Drama"],"plot":"Prudence MacIntyre, the 'New York home tips' TV show presenter, is sent on holiday, by studio boss Jeffrey Symcox, to a secluded lodge in Tassajero, Wyoming. The lodge was built on the last remnant of Indian land preserved by the Andrews family. Her celebrity status and sassy charm help quickly getting acquainted with local notables, including French heir Jean Phillipe Andrews, his land trust lawyer Doug Craig and police detective Eddie Duncan. Pru is with lodge caretaker Ruth Vigil when she discovers her estranged son JR is missing from his home after leaving a message. Pru finds blood, and although it's not JR's insists he must have been murdered. After her research assent, a computer whiz with a minor criminal record, joins her, and they soon get in danger snooping ahead of the incredulous authorities to discover several linked crimes.","simplePlot":"Prudence McCoy is the host of a successful helpful hints TV show, who discovers a hidden talent for crime solving.","actors":[{"actorName":"Jane Seymour","urlProfile":"http://www.imdb.com/name/nm0005412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTk2Njk1Nl5BMl5BanBnXkFtZTcwMTk2MTA0Mg@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1951","placeOfBirth":" Hayes, Hayes and Harlington, Middlesex, England, UK","birthName":"Joyce Penelope Wilhelmina Frankenberg","height":"5' 4\" (1.63 m)","bio":"Jane Seymour was born on February 15, 1951 in Hayes, Hayes and Harlington, Middlesex, England as Joyce Penelope Wilhelmina Frankenberg. She is an actress and producer, known for Dr. Quinn, Medicine Woman (1993), Wedding Crashers (2005) and Live and Let Die (1973). She was previously married to James Keach, David Flynn, Victor Geoffrey Planer and Michael Attenborough.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTk2Njk1Nl5BMl5BanBnXkFtZTcwMTk2MTA0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005412","name":"Jane Seymour","idIMDB":"nm0005412"},"actorId":"nm0005412","character":"Prudence McCoy","urlCharacter":"http://www.imdb.com/character/ch0322756","main":true},{"actorName":"Jamey Sheridan","urlProfile":"http://www.imdb.com/name/nm0792177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NjY3ODU1MF5BMl5BanBnXkFtZTYwNjU5MzYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1951","placeOfBirth":" Pasadena, California, USA","birthName":"James Patrick Sheridan","height":"6' 0½\" (1.84 m)","bio":"Virile, fair-haired, set-jawed actor Jamey Sheridan was born in 1951 and raised in Pasadena, California. He turned to acting after a knee injury ended his pursuit of a dancing career. Beginning professionally on stage in 1978, he gained some momentum into the next decade and eventually reached Broadway where he earned a Tony Award nomination in 1987 for his potent performance in the revival of Arthur Miller's \"All My Sons.\" He made his feature-film debut in Jumpin' Jack Flash (1986) starring Whoopi Goldberg and started making the TV guest star rounds on such series as \"Spenser: For Hire\" and \"The Equalizer\" at around the same time. Sheridan received his first big on-camera break when he was cast in the title role of Shannon's Deal (1990) gaining quirky notice for two seasons. as a highly unconventional attorney. From this series he moved to the already established Chicago Hope (1994) set wherein he played a sympathetic role. Into the millennium, his best known role resides with the series Law & Order: Criminal Intent (2001) in the long-running (five seasons), less showy role of a police captain. Other support roles in the movies include Stanley & Iris (1990) with Jane Fonda, A Stranger Among Us (1992) opposite with Melanie Griffith and Ice Storm (1997) and Life as a House (2001) both starring Kevin Kline followed, while more recent work includes Nothing But the Truth (2008) with Kate Beckinsale and Matt Dillon, the title role in Handsome Harry (2009) and The East (2013) with Ellen Page. While commanding some attention as a villain in the Stephen King miniseries The Stand (1994), he also turned in an interesting performance as actor/director Ozzie Nelson in the TV movie Ricky Nelson: Original Teen Idol (1999). He has been a steadfast presence these days in such series as Homeland (2011), Arrow (2012) and \"Smash\" (2013)_. Success and satisfaction always came from the stage. Having never left the theater lights for long, Sheridan playing Brutus in \"Julius Caesar\" at New York's Shakespeare-in-the-Park that also featured his wife, actress Colette Kilroy. Over the years he has continued to grace the Broadway boards with stimulating performances in such sterling revivals of \"Biloxi Blues,\" \"Ah, Wilderness!\" \"The Man Who Came to Dinner,\" \"Long Day's Journey Into Night,\" \"The Moon for the Misbegotten\" and \"The Shadow Box.\" He also appeared in \"God of Hell\" in 2004. A versatile actor to be sure, Sheridan is the father of three.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NjY3ODU1MF5BMl5BanBnXkFtZTYwNjU5MzYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0792177","name":"Jamey Sheridan","idIMDB":"nm0792177"},"actorId":"nm0792177","character":"Eddie Duncan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Cartwright","urlProfile":"http://www.imdb.com/name/nm0142206","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1MjYyODMyMV5BMl5BanBnXkFtZTgwMTE5MTY2ODE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1981","placeOfBirth":" Erdington, Birmingham, England, UK","height":"6' (1.83 m)","bio":"Ryan Cartwright was born on March 14, 1981 in Erdington, Birmingham, England. He is known for his work on Vacation (2015), Alphas (2011), Mad Men (2009) and Bones (2008-2011). After working for many years in England on shows like Hardware (2003-2004), Donovan (2005-2006) and The Grimleys (1999-2001) Ryan moved to Los Angeles to enjoy the sunshine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1MjYyODMyMV5BMl5BanBnXkFtZTgwMTE5MTY2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0142206","name":"Ryan Cartwright","idIMDB":"nm0142206"},"actorId":"nm0142206","character":"Nigel Forsythe III","urlCharacter":"http://www.imdb.com/character/ch0321691","main":true},{"actorName":"Tantoo Cardinal","urlProfile":"http://www.imdb.com/name/nm0001987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MTIwNDIyNTNeQTJeQWpwZ15BbWU2MDk0MzczMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1950","placeOfBirth":" Fort McMurray, Alberta, Canada","birthName":"Rose Marie Cardinal","bio":"Actress Tantoo Cardinal, a Member of the Order of Canada, one of the country's highest civilian honors. The Order of Canada recognizes Cardinal for her contributions to the growth and development of Aboriginal performing arts in Canada. Arguably the most widely recognized Native Actress of her generation; Tantoo has appeared in numerous plays, television programs, and films, including Legends of the Fall, Dances With Wolves, Black Robe, Loyalties, Luna, Spirit of the Whale, Unnatural & Accidental, Marie-Anne, Sioux City, Silent Tongue, Mother's & Daughter's and Smoke Signals. Recent work includes the films Eden, Maina, Shouting Secrets and From Above. Her stirring performance in Loyalties earned her a Genie nomination, American Indian Film Festival Best Actress Award, the People's choice Award at the Toronto Film Festival, plus Best Actress Awards at International Film Festivals in Zimbabwe and Portugal. Cardinal was just honored with the 2015 ACTRA Award of Excellence, other honors include Best Actress - Elizabeth Sterling Award in Theatre for All My Relations, First Americans in the Arts Totem Award for her portrayal of the character Katrina in Widows at the Forum Stage in Los Angeles. She won the American Indian Film Festival's Best Actress Award as well as the first Rudy Martin Award for Outstanding Achievement by a Native American in Film for Where the Rivers Flow North, a Gemini Award for North of 60 and a Leo Award for Blackstone. Her television credits include recurring roles on the series: Blackstone, The Killing, Arctic Air, Strange Empire,The Guard, North of 60, Dr. Quinn Medicine Woman, The Lightening Field, Street Legal, The Campbell's, Gunsmoke, Tom Stone, Myth Quest, Lonesome Dove and Renegade Press.com. MOW's include Full Flood, The Englishman's Boy, Dreamkeeper and the PBS documentary Nobody's Girls. For her contributions to the Native Artistic community, Cardinal won the Eagle Spirit Award. She has also been honored with the MacLeans' magazine Honor Roll as Actress of the Year, the Outstanding Achievement Award from the Toronto Women in Film and Television, an International Women in Film Award for her lasting contribution to the arts, and induction to the CBC/Playback Hall of Fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MTIwNDIyNTNeQTJeQWpwZ15BbWU2MDk0MzczMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001987","name":"Tantoo Cardinal","idIMDB":"nm0001987"},"actorId":"nm0001987","character":"Ruth Vigil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Stewart","urlProfile":"http://www.imdb.com/name/nm0829767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDE4MDUwM15BMl5BanBnXkFtZTgwODY3NjM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1961","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Robert Thomas Stewart","height":"6' (1.83 m)","bio":"Rob was born in Canada in 1961 and when he was still a child he loved to play hockey and dreamed of becoming a professional player. However at the age of 17 he became badly injured while playing hockey and he lost a kidney. He had to give up his dream of becoming a professional hockey player and so he in fact fell into the entertainment business by accident. The injury forced him to turn down a number of athletic scholarships he had been offered. So, to put himself through the University of Waterloo, where he majored in Latin and English he took up his guitar, set some poems to music and sang in local restaurants. In the summers, he did stunts and acrobatics at Canada's Wonderland Amusement Park. Soon afterwards he found out his love for writing and while aspiring to be a writer, Rob held a variety of jobs, from bar tending to cowboy to maintenance man. He soon formed a writing partnership with his cousin and began his film career by writing, directing and starring in three television dramas: Come Spy With Me, Where There's A Will and Mark Of The Beast. Rob subsequently guested on various television series like for instance: Mount Royal and Hot Shots. He was the lead in the television pilot: Soulsearching Mystery Face. Internationally he became known for his part of Nick Slaughter in the series Tropical Heat a.k.a. Sweating Bullets. Rob wrote several episodes of the series ofwhich some together with James Gordon and he also directed a number of episodes. 'I took the biggest gamble of my life when I turned down the offer to play the lead role in the TV sitcom Scoop before my part in Tropical Heat was confirmed. It was the best decision I have ever made!' Rob summarized. 'The part of Nick was tailor-made for me', smiles Rob. Since Tropical Heat came to an end Rob has honed his skills with a number of independent films, TV guest appearances, more writing and directing!! He married a girl he'd met during the shooting of Tropical Heat and in 1996 he became father of a son. He and his family now live in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDE4MDUwM15BMl5BanBnXkFtZTgwODY3NjM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829767","name":"Rob Stewart","idIMDB":"nm0829767"},"actorId":"nm0829767","character":"Doug Craig","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Brown","urlProfile":"http://www.imdb.com/name/nm0113357","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MTE5MDY2M15BMl5BanBnXkFtZTgwNTUxNjI2NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"David Lawrence Brown","height":"5' 11\" (1.8 m)","bio":"Dave Brown was completing his Education degree at the University of Winnipeg when he discovered his love for acting. He then added Dramatic Arts to his post-secondary focus. His first professional stage audition led to his first lead acting role, and film and television roles quickly followed with Supporting roles in \"For Those Who Hunt the Wounded Down\" (1994) and \"The Arrow\" (1996). Over his career, Dave has developed a reputation as a \"chameleon\" performer, proving adept at delivering a wide range of cinematic performances, evidenced by his chilling portrayal of real-life psychopathic serial killer Gary Ridgway in \"The Riverman\" to his comedic turn as the inept mayor Al Lipinski in \"Freezer Burn\". His attention to detail in performance has allowed him to bring a nuanced believability to characters with various accents including Scottish (Passchendaele), Minnesotan (Fargo) and the mid-west USA (The 19th Wife). Dave has shared the screen with many notable performers including Robert Downey Jr., Ian MacKellan, Matt Czuchry, Carey Elwes, Tom Green, Crispin Glover, Dan Ackroyd, Callum Keith Rennie and Rufus Sewell. He has performed in both feature film and television productions, and recently played Sheriff Larry Logan in the first two seasons of the western detective series \"The Pinkertons\" and Tim Hazel in the horror drama \"Channel Zero: Candle Cove\". Dave is also a singer-songwriter and musician, and is completing a Master's degree in Fine Arts with a focus on New Media (Film). He has written and directed his own original feature film, to be released in 2017.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MTE5MDY2M15BMl5BanBnXkFtZTgwNTUxNjI2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0113357","name":"David Brown","idIMDB":"nm0113357"},"actorId":"nm0113357","character":"Les Jillson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Kot","urlProfile":"http://www.imdb.com/name/nm3052296","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU3Mzg3NDMyNl5BMl5BanBnXkFtZTgwNjA0Mjk1NDE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"bio":"James Kot's first Feature Film role came as the young soldier 'Skinner' in Paul Gross' World War I drama, Passchendaele. Passchendaele was the premiere film of the 2008 Toronto International Film Festival and remains the biggest budget Canadian production of all time. James Kot graduated from the University of Victoria with a Degree in Acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU3Mzg3NDMyNl5BMl5BanBnXkFtZTgwNjA0Mjk1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3052296","name":"James Kot","idIMDB":"nm3052296"},"actorId":"nm3052296","character":"Jean Phillipe Andrews","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colin A. Campbell","urlProfile":"http://www.imdb.com/name/nm1152550","urlPhoto":"","biography":{"bio":"Colin A. Campbell is an actor, known for Angels Crest (2011), Colony (2007) and Forsaken, retour à Fowler City (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1152550","name":"Colin A. Campbell","idIMDB":"nm1152550"},"actorId":"nm1152550","character":"Jack Flagg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mandie Vredegoor","urlProfile":"http://www.imdb.com/name/nm2771991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjkxNDcxN15BMl5BanBnXkFtZTgwODA5MDIxMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6½\" (1.69 m)","bio":"You can take the girl off the farm, but you can't take the farm out of the girl. Born and raised in Lethbridge Alberta, Mandie Vredegoor is a country girl at heart who dreamed of the big city. By 19 she took her first leap, relocating to Calgary; Stampede City, to begin her training. By 25, she felt she had acquired all she could from her beloved studio, Company of Rogues. Having signed a few credits to her name, and having starred opposite some of her childhood heroes, she had gathered enough courage to move to Hollywood North. She continues to live there, attending classes and pursuing the dream. She is best known for her brief stint on CBCs Heartland, season one, recently syndicated in the United States and Dear Prudence, opposite Jane Seymour, the Murder she Wrote like dramedy.The camera loves her for her quirky offbeat charm, however, those who know her love her for her ethereal wisdom, seemingly beyond her years. It is this side to her personality that garnered her critical acclaim in Calgary's debut performance of \"Cowtown\"; a darker look at the oil franchises that spiked Alberta's economic boom in which she starred opposite football's former quarterback Khari Jones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjkxNDcxN15BMl5BanBnXkFtZTgwODA5MDIxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2771991","name":"Mandie Vredegoor","idIMDB":"nm2771991"},"actorId":"nm2771991","character":"Caitlin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dakota House","urlProfile":"http://www.imdb.com/name/nm0396643","urlPhoto":"","biography":{"dateOfBirth":"17 February 1974","placeOfBirth":" Manning, Alberta, Canada","height":"5' 6½\" (1.69 m)","bio":"Dakota was born in a small town in Northern Alberta, he now resides in Edmonton, Alberta. He has been acting from age eighteen and has worked with such people as Graham Greene, Tom Jackson, David Duchovny from X-Files and many others who Dakota credits for his learning and knowledge in the film industry. This young man has also traveled Canada extensively, doing workshops in acting and facilitating motivation, empowerment and self-esteem workshops as well as public appearances. Dakota has written one children's book called Dancers in the sky and is currently writing his second. He has just finished filming the 5th 'North of 60' movie that will be airing in the early months of 2004.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0396643","name":"Dakota House","nicknames":["D.J."],"idIMDB":"nm0396643"},"actorId":"nm0396643","character":"JR Vigil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rod Padmos","urlProfile":"http://www.imdb.com/name/nm0655812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1Njc3MDgwNl5BMl5BanBnXkFtZTYwMTA1MTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1949","placeOfBirth":" Calgary, Alberta, Canada","birthName":"Rodney Martin Padmos","bio":"Rod Padmos was born on November 4, 1949 in Calgary, Alberta, Canada as Rodney Martin Padmos. He is known for his work on Rad (1986), A Father's Choice (2000) and Angel Flight Down (1996). He died on June 13, 2010 in Calgary.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1Njc3MDgwNl5BMl5BanBnXkFtZTYwMTA1MTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0655812","name":"Rod Padmos","idIMDB":"nm0655812"},"actorId":"nm0655812","character":"Jeffrey Symcox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grant Linneberg","urlProfile":"http://www.imdb.com/name/nm0513050","urlPhoto":"","biography":{"bio":"Grant Linneberg is an actor, known for The Claim (2000), Anatomy of a Hate Crime (2001) and Once Upon a Christmas (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0513050","name":"Grant Linneberg","idIMDB":"nm0513050"},"actorId":"nm0513050","character":"Shift officer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1249299","urlIMDB":"http://www.imdb.com/title/tt1249299","business":{"budget":{"money":"$2,800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.9","filmingLocations":[],"awards":[],"votes":"199","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0181866","name":"Alberta Film Entertainment"},{"idCompany":"co0241249","name":"Alexander/ Mitchell Productions"},{"idCompany":"co0246464","name":"Granada America"}],"keywords":{"keywords":["fall","kissing","drinking","false identity","embarrassment"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:41:24"}}