{"data":{"movies":[{"title":"Battlestar Galactica: The Plan","originalTitle":"The Plan","year":"2009","releaseDate":"20091027","directors":[{"name":"Edward James Olmos","id":"nm0001579"}],"writers":[{"name":"Jane Espenson","id":"nm0260870"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODE2MjY2OF5BMl5BanBnXkFtZTcwMjQxMTI5Mg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Drama","Romance","Sci-Fi"],"plot":"The number One Cylon brothers Cavil organize a massive coordinate simultaneous attack to destroy the twelve colonies, but it fails to wipe out human life or break the human spirit. They now orchestrate deceptive actions, infiltrating surviving communities, notably aboard flagship Battlestar Galactica and Samuel Anders's human trainees class on planet colony Caprica. Both sides must confront existential as well as pragmatical challenges to battle for survival.","simplePlot":"When the initial Cylon attack against the Twelve Colonies fails to achieve complete extermination of human life as planned, twin Number Ones (Cavils) embedded on Galactica and Caprica must improvise to destroy the human survivors.","actors":[{"actorName":"Edward James Olmos","urlProfile":"http://www.imdb.com/name/nm0001579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODQzODQ4OF5BMl5BanBnXkFtZTcwMDczMTkxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1947","placeOfBirth":" Los Angeles, California, USA","height":"5' 8½\" (1.74 m)","bio":"Edward James Olmos was born in Los Angeles, California, to Eleanor (Huizar) and Pedro Olmos, who was a mail carrier and welder. His family was of Mexican descent. If Olmos had followed the first love of his life, he would have been a professional baseball player. But by age 13, another love entered his life: rock music. By age 15, he was already an experienced rock singer, forming and reforming several \"garage bands\" along the way. During the late 1960s and early 1970s, he played the most famous clubs on Sunset Strip, including Gazzarri's and The Factory. But a friend suggested that, with his flair for the dramatic, he consider a career in acting. Throughout the 1970s, he divided his time between rock music gigs, acting classes, bit parts in television, Off-off-off Broadway plays and his business of moving fine furniture (which kept body, soul and family together). His first big break was a starring role in Luis Valdez's play, \"Zoot Suit\", in 1978. The play moved to Broadway and led to a Tony Award nomination and great critical acclaim. Perhaps best known for his role as Lt. Martin Castillo in the NBC television series Miami Vice (1984) (1984-1989), Olmos has been seen in numerous film and television productions. He received an Academy Award nomination for Best Actor for his starring role in Stand and Deliver (1988). Most notable of his recent offerings is American Me (1992), which was also his directing debut. But acting, directing and screenwriting are only parts of what he does. Olmos contends he would much rather be known as an activist than an actor. He devotes much of his time to causes, particularly those focusing on the needs and rights of children. He makes, on average, some 150 personal appearances a year to places where he can reach kids at risk; juvenile halls, detention centers, boys/girls clubs, schools. Anywhere he can get across his message that \"we all have a choice\" about where life takes us. Olmos stresses the importance of education, the risks of gang life and tries to promote the notion of taking responsibility for one's own actions and one's own happiness in life. Using his own \"disadvantaged background\" as an example (he grew up in East Los Angeles, infamous for its gang problems), he tells the kids, \"If I can do it, so can you\". And he tries to point them in a positive direction. He has served as an ambassador for UNICEF and has received numerous accolades for his activism. He will long be remembered for getting out in the thick of the Los Angeles Riots of 1992 with his broom: one calm, reasonable presence in the midst of chaos and gunfire. Edward James Olmos was married to actress Lorraine Bracco. Between them they have 6 children, ages 10 - 25.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODQzODQ4OF5BMl5BanBnXkFtZTcwMDczMTkxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001579","name":"Edward James Olmos","nicknames":["EJO","Ed","Eddie"],"idIMDB":"nm0001579"},"actorId":"nm0001579","character":"Commander William Adama","urlCharacter":"http://www.imdb.com/character/ch0008081","main":true},{"actorName":"Dean Stockwell","urlProfile":"http://www.imdb.com/name/nm0001777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3NTk3OTcwOV5BMl5BanBnXkFtZTcwNTUzNzgwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1936","placeOfBirth":" North Hollywood, Los Angeles, California, USA","birthName":"Robert Dean Stockwell","height":"5' 7\" (1.7 m)","bio":"Photogenic American child actor of the 1940s, popular due in no small measure to his air of innocence and his beautiful, cherubic face with its dimples and his sparkling eyes, topped with a crown of curls. Still an actor in demand while well into his middle years, he is one of the few juvenile performers to succeed lifelong in films. Considering child actors who matured gracefully, his career can be likened perhaps only to that of Natalie Wood, excepting her degree of stardom.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3NTk3OTcwOV5BMl5BanBnXkFtZTcwNTUzNzgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001777","name":"Dean Stockwell","idIMDB":"nm0001777"},"actorId":"nm0001777","character":"Brother Cavil","urlCharacter":"http://www.imdb.com/character/ch0008093","main":true},{"actorName":"Michael Trucco","urlProfile":"http://www.imdb.com/name/nm0873998","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjM2ODQ1Ml5BMl5BanBnXkFtZTgwNTkzOTA1MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1970","placeOfBirth":" San Mateo, California, USA","birthName":"Edward Michael Trucco","height":"6' 3\" (1.91 m)","bio":"Born and raised in San Mateo, California, he graduated from Santa Clara University with a BA in Theatre Arts and was quickly headed to Los Angeles to pursue his dream of a career in Film and Television. He didn't have to wait long. A recurring role on \"BEVERLY HILLS 90210\" brought Michael the recognition he sought and he followed that with a starring role on the CBS Series \"PENSACOLA: WINGS OF GOLD\" opposite James Brolin for two seasons. After that, he landed notable recurring roles on shows such as \"ARLI$$\", \"ONE TREE HILL\", \"CASTLE\", \"HOW I MET YOUR MOTHER\" and \"REVENGE\" and the animated series \"YOUNG JUSTICE\" as 'Adam Strange'. Some of his most memorable guest appearances include \"THE BIG BANG THEORY\", \"LAW & ORDER: SVU\", \"CRIMINAL MINDS\", \"V\", \"PSYCH\" and \"SCANDAL\". He can be seen recurring on \"GRANDFATHERED\" on the FOX network. But he is perhaps best known for his portrayal of 'Samuel T. Anders' on the critically acclaimed Sci-Fi series \"BATTLESTAR GALACTICA\" and for 'Justin Patrick' on the USA Network series \"FAIRLY LEGAL\". He can be seen in the upcoming thriller/horror films \"HUSH\" and \"THE BYE BYE MAN\" both of which will be released in theatres later this year. And this summer he will begin shooting in London and Bulgaria for the Millennium Pictures feature film \"HUNTER/KILLER\" with Gerard Butler and Gary Oldman due out in theaters in 2017. He lives in Los Angeles with his wife, actress Sandra Hess and their 2 dogs and 2 cats.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjM2ODQ1Ml5BMl5BanBnXkFtZTgwNTkzOTA1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0873998","name":"Michael Trucco","idIMDB":"nm0873998"},"actorId":"nm0873998","character":"Samuel Anders","urlCharacter":"http://www.imdb.com/character/ch0008110","main":true},{"actorName":"Grace Park","urlProfile":"http://www.imdb.com/name/nm0661825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTg1MjI0MF5BMl5BanBnXkFtZTcwODgyMjU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1974","placeOfBirth":" Los Angeles, California, USA","height":"5' 9\" (1.75 m)","bio":"Grace Park (born March 14, 1974) is an American-Canadian actress. She gained recognition as Sharon \"Boomer\" Valerii and Sharon \"Athena\" Agathon on Battlestar Galactica, as well as Shannon Ng in the Canadian television series teen soap Edgemont. Park stars as Officer Kono Kalakaua in the CBS television series Hawaii Five-0, which debuted on September 20, 2010. Born in Los Angeles, Park moved with her family to Canada when she was 22 months old. She was raised in the Vancouver neighbourhood of Kerrisdale. Park is of Korean heritage and she graduated from Magee Secondary School in 1992 and holds a degree in psychology from the University of British Columbia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTg1MjI0MF5BMl5BanBnXkFtZTcwODgyMjU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0661825","name":"Grace Park","idIMDB":"nm0661825"},"actorId":"nm0661825","character":"Lt. Sharon 'Boomer' Valerii","urlCharacter":"http://www.imdb.com/character/ch0008091","main":true},{"actorName":"Michael Hogan","urlProfile":"http://www.imdb.com/name/nm0389581","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTk1ODE0MV5BMl5BanBnXkFtZTcwMTc5MTM5Mg@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"height":"5' 11½\" (1.82 m)","bio":"Michael Hogan, a prospector's son, was born in Northern Ontario. He trained at the National Theatre School of Canada, where he met his future wife, actress Susan Hogan (nee King). They worked as a package until their their children, Jennie Rebecca Hogan (actress), Gabriel Hogan (actor), and Charlie Hogan (audience member), came along. Over the years, Hogan has appeared in countless plays, films, TV series, and radio dramas, and even an opera. Some of his favorite feature film experiences include La vengeance du loup (1991), with his good friend, Graham Greene, shot in the bush north of Lake Superior Road to Saddle River, shot in the Badlands of Alberta; Klondike Fever (1980), with Rod Steiger, Lorne Greene, Angie Dickinson and Gordon Pinsent, shot in and around Barkerville, B.C. in the winter; A Simple Curve (2005), shot in Slocan Valley, B.C. His most rewarding television experiences include his work on Jake and the Kid (1995), Monk (2002), African Skies (1992), La loi du colt (1997), Lifeline to Victory (1993), Nights Below Station Street (1997), _Secret in Giving (1999) (TV) (aka \"Calico Christmas\"), _For Those Who Hunt The Wounded Down (1996) (TV)_ and, of course, his all-time favorite, Battlestar Galactica (2004). Among his numerous live theater performances are the title role in \"Cowboy King\", performed on horseback at the Caravan Farm Theatre in the interior of B.C.; \"Biff Loman\" in \"Death of a Salesman\", then 19 years later, \"Willy Loman\" in the same play; \"Red Mango Blues\", a one-man show (with guitar virtuoso Harris Van Berkel), written by poet/playwright Charles Tidler; and \"Petruchio\" in \"Taming of the Shrew\", with wife Susan Hogan as \"Kate\". Hogan has performed on several radio shows, including \"Pocket City Blues\", a radio series about a blues DJ who stumbles into a different crime every week. Hogan's distinctive voice has also been heard over CBC Radio as the narrator of many books, poems, and short stories. His award nominations are numerous and include a Blizzard Award for Best Leading Actor (feature length) for his role in Nights Below Station Street (1997), from Manitoba Film; and a Genie for Best Supporting Actor (feature length) in Solitaire (1991). The Hogans live on an island with son Charlie, a couple of dogs, cats, bikes, skis, and a few kayaks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTk1ODE0MV5BMl5BanBnXkFtZTcwMTc5MTM5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0389581","name":"Michael Hogan","idIMDB":"nm0389581"},"actorId":"nm0389581","character":"Colonel Saul Tigh","urlCharacter":"http://www.imdb.com/character/ch0008107","main":true},{"actorName":"Aaron Douglas","urlProfile":"http://www.imdb.com/name/nm0234928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI0OTc1MzQ5NF5BMl5BanBnXkFtZTcwNDU0MzM1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1971","placeOfBirth":" New Westminster, British Columbia, Canada","height":"6' (1.83 m)","bio":"Aaron Douglas was born on August 23, 1971 in New Westminster, British Columbia, Canada. He is an actor, known for Battlestar Galactica (2004), Dirk Gently's Holistic Detective Agency (2016) and The Bridge (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI0OTc1MzQ5NF5BMl5BanBnXkFtZTcwNDU0MzM1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234928","name":"Aaron Douglas","idIMDB":"nm0234928"},"actorId":"nm0234928","character":"Chief Galen Tyrol","urlCharacter":"http://www.imdb.com/character/ch0008105","main":true},{"actorName":"Callum Keith Rennie","urlProfile":"http://www.imdb.com/name/nm0719678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1960","placeOfBirth":" Sunderland, Tyne-and-Wear, England, UK","height":"5' 11\" (1.8 m)","bio":"Callum Keith Rennie was born in England, raised in Alberta, Canada and came late to acting - he discovered theatre in Edmonton at the age of 25. Starting out in university radio and working his way to the renowned Shaw Festival, Callum moved to Vancouver and quickly caught the eye of producers and directors. Currently he lives in Vancouver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719678","name":"Callum Keith Rennie","idIMDB":"nm0719678"},"actorId":"nm0719678","character":"Leoben Conoy","urlCharacter":"http://www.imdb.com/character/ch0008094","main":true},{"actorName":"Kate Vernon","urlProfile":"http://www.imdb.com/name/nm0894690","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzMxMTk5MV5BMl5BanBnXkFtZTgwMDgwMjg2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1961","placeOfBirth":" Canada","birthName":"Katherine Vernon","height":"5' 8\" (1.73 m)","bio":"Kate Vernon was born to the celebrated actor John Vernon. As her father's career began to take off in the USA, the family moved from their home in Canada to Hollywood when Kate was 7 years old. With the ever growing career success of the late John Vernon (Dirty Harry (1971), Animal House (1978), The Outlaw Josey Wales (1976)), Kate's childhood enabled her to be influenced and surrounded by many of Hollywood's leading actors, writers and artists. With these early experiences and influences, her decision to study to become an actress came as no surprise. After successfully completing her acting school studies, Kate's beautiful features, zest for life, easy-going and fun personality coupled with her dedicated work approach to her profession did not go unnoticed. During the early 80's, doors began to open for Kate as she secured a number of roles. It was during the mid-1980's that Kate landed her first feature film break with her role as \"Benny\" in the box office hit, Pretty in Pink (1986). In its success, it led to more TV work, box office and independent movie roles allowing Kate to star alongside some of Hollywood's leading men such as Denzel Washington, Willem Dafoe, Edward James Olmos, Christopher Lee and Richard Thomas. To date, Kate's long career as a busy actress has enabled her to play an engaging and wide variety of roles from the beautiful, funny, the love interest, dramatic, comedic, the misunderstood, the mistress, the mother and the dynamic. With her most recent roles in movies including the box office smash The Last Song (2010) which features Miley Cyrus, Greg Kinnear, Liam Hemsworth, Kelly Preston and the comedy, National Lampoon's Snatched (2011), which is due for imminent release, sees her alongside Andrew McCarthy and the acclaimed film legend Ernest Borgnine. Her versatility as an actress has seen Kate recently star in the hit TV series Heroes (2006), Bones (2005), as well as CSI: Crime Scene Investigation (2000), The Mentalist (2008), Saving Grace (2007) and her recurring role as \"Ellen Tigh\" (2004-2009) in the award-winning Battlestar Galactica (2004) (2004-2009) has won her an international fan base. Never one to be typecast, Kate's career has allowed her to work alongside many of TV and Film Industry leading writers, directors & producers such as Spike Lee, Peter Medak, Ronald D. Moore, David Eick, Joe Cacaci, David Weddle, Michael Nankin and John Woo. Her 20-year career has allowed her to feature in regular, recurring and guest roles in a number of major TV series including Heroes (2006) (2010), CSI: Crime Scene Investigation (2000) (2004-2009), Star Trek: Voyager (1995) (1995), Nash Bridges (1996) (1996-1997), Battlestar Galactica (2004) (2004-2009), L.A. Law (1986) (1994), Bones (2005) (2010), Tales from the Crypt (1989) (1993), Who's the Boss? (1984) (1990) and many others. Some of her TV & Box Office Movies credits include The Last Song (2010), Malcolm X (1992), Roadhouse 66 (1985), National Lampoon's Snatched (2011), Blackjack (1998), Pretty in Pink (1986), Dangerous Touch (1994), Last Chance Cafe (2006) and Battlestar Galactica: The Plan (2009) to name but a few. With a timeless beauty and meticulous approach to her characters, these qualities have enhanced Kate's reputation not only as an on-screen beauty, but as an actress with experience to adapt to any kind of role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzMxMTk5MV5BMl5BanBnXkFtZTgwMDgwMjg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0894690","name":"Kate Vernon","idIMDB":"nm0894690"},"actorId":"nm0894690","character":"Ellen Tigh","urlCharacter":"http://www.imdb.com/character/ch0008108","main":true},{"actorName":"Rick Worthy","urlProfile":"http://www.imdb.com/name/nm0941796","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTE4NWEwYTktZTljZS00NDYxLTgxNzAtZDI5YWM2ZmVkMWVkL2ltYWdlXkEyXkFqcGdeQXVyNTU4NjY5MzM@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1967","placeOfBirth":" Detroit, Michigan, USA","height":"6' 2½\" (1.89 m)","bio":"A native Detroiter, Rick graduated from Southfield Senior High in 1985, and then from the University of Michigan in 1990. He then moved to Chicago where he performed at several prestigious theaters including Chicago Dramatists Workshop, The Goodman Theatre, and Victory Gardens Theater. Rick's father is a retired United Auto Workers (UAW) executive, and his mother owns and operates Studio One, a photo restoration company. Rick lives in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTE4NWEwYTktZTljZS00NDYxLTgxNzAtZDI5YWM2ZmVkMWVkL2ltYWdlXkEyXkFqcGdeQXVyNTU4NjY5MzM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0941796","name":"Rick Worthy","idIMDB":"nm0941796"},"actorId":"nm0941796","character":"Simon","urlCharacter":"http://www.imdb.com/character/ch0065744","main":true},{"actorName":"Lymari Nadal","urlProfile":"http://www.imdb.com/name/nm1317082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI2MzQ5NDA4Nl5BMl5BanBnXkFtZTYwNTk1Njc4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1978","placeOfBirth":" Ponce, Puerto Rico","height":"5' 8\" (1.73 m)","bio":"Lymari came to Los Angeles in 2001, and at 22 years old finished her Masters degree in Chemistry at the University of Puerto Rico, where she also took acting classes. After graduating, she went on to work in theater in San Juan. Her first TV show, a sitcom based on her own experiences in grad school, was developed by ABC but was never screened, and she is now in the process of re-writing the show.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI2MzQ5NDA4Nl5BMl5BanBnXkFtZTYwNTk1Njc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1317082","name":"Lymari Nadal","idIMDB":"nm1317082"},"actorId":"nm1317082","character":"Giana O'Neill","urlCharacter":"http://www.imdb.com/character/ch0230815","main":true},{"actorName":"Matthew Bennett","urlProfile":"http://www.imdb.com/name/nm0071922","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNTYwODg4Ml5BMl5BanBnXkFtZTgwNzc0NTUxNzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1968","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 8\" (1.73 m)","bio":"Born and raised in Toronto, Matthew Bennett switched schools in grade 11 to attend Northern Secondary with the intent of pursuing a career in graphic arts. It was there that he happened upon the theatre program and quickly discovered his passion for acting and writing. After taking a year to work in a record store and to sell clothes in Yorkville, Bennett then went to Vancouver to start his formal training. Known mostly for his role on the critically acclaimed science fiction series, Battlestar Galactica, (where he played ruthless Cylon #5, Aaron Doral), Matthew Bennett has starred in over 150 hours of network television, and received two best actor nominations for his work as Detective Len Harper on the award winning police drama, Cold Squad. Along with his work in TV, Matthew has appeared in over thirty films, working alongside such incredible talents as John Cusack, Edward James Almos, Joan Rivers, and Academy Award winners Brenda Fricker and Sissy Spacek. Having lived in Vancouver for 15 years, Matthew now resides in his home town of Toronto where he runs two businesses with his wife, fellow actor Brittaney Bennett. He practices Krav Maga, and has keen interests in writing, real estate, film making, and cycling through the streets of Toronto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNTYwODg4Ml5BMl5BanBnXkFtZTgwNzc0NTUxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071922","name":"Matthew Bennett","idIMDB":"nm0071922"},"actorId":"nm0071922","character":"Aaron Doral","urlCharacter":"http://www.imdb.com/character/ch0008124","main":true},{"actorName":"Rekha Sharma","urlProfile":"http://www.imdb.com/name/nm0788907","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjU0ODkzMV5BMl5BanBnXkFtZTcwNjM5ODg4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Rekha Shanti Sharma","height":"5' 2\" (1.57 m)","bio":"Rekha Sharma was born in Vancouver, British Columbia, Canada as Rekha Shanti Sharma. She is an actress, known for The Core (2003), Battlestar Galactica (2004) and Aliens vs. Predator: Requiem (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjU0ODkzMV5BMl5BanBnXkFtZTcwNjM5ODg4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0788907","name":"Rekha Sharma","idIMDB":"nm0788907"},"actorId":"nm0788907","character":"Tory Foster","urlCharacter":"http://www.imdb.com/character/ch0008112","main":true},{"actorName":"Tricia Helfer","urlProfile":"http://www.imdb.com/name/nm1065454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTI4MzAzNl5BMl5BanBnXkFtZTcwNTEyNzQ1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 April 1974","placeOfBirth":" Donalda, Alberta, Canada","birthName":"Tricia Janine Helfer","height":"5' 10½\" (1.79 m)","bio":"Tricia Helfer was born on April 11, 1974 in Donalda, Alberta, Canada as Tricia Janine Helfer. She is an actress and producer, known for Battlestar Galactica (2004), Burn Notice (2007) and Dark Blue (2009). She has been married to Jonathan Marshall since 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTI4MzAzNl5BMl5BanBnXkFtZTcwNTEyNzQ1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1065454","name":"Tricia Helfer","idIMDB":"nm1065454"},"actorId":"nm1065454","character":"Number Six / Shelly Godfrey","urlCharacter":"http://www.imdb.com/character/ch0008086","main":true},{"actorName":"Alisen Down","urlProfile":"http://www.imdb.com/name/nm0235888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjAzNzUwNl5BMl5BanBnXkFtZTcwODkwMDEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1976","placeOfBirth":" Langley, British Columbia, Canada","birthName":"Alisen Elizabeth Jean Down","height":"5' 8\" (1.73 m)","bio":"Alisen Down was born and raised in British Columbia, Canada. After graduating high school, she attended the American Academy of Dramatic Arts in Los Angeles, California and from there went to England to study with the British American Academy in Oxford. Since then has had lead, recurring and guest star roles on several Television series and movies, such as \"Cold Squad\" for which she won both a Leo and a Gemini award, \"DaVinci's Inquest\", \"The Dead Zone\", \"Stargate SG-1\" and \"Stargate Universe\", \"Smallville\", \"Flashpoint\", \"Shattered\", \"The 'L' Word\",\"The Life\" for which she was nominated for another Gemini, \"The Killing\", \"Murdoch Mysteries\", CBC's \"Cracked\", R.L. Stein's \"The Haunting Hour\", \"Lost Girl\" as Trick's Wife, 'Isabeau', and \"Supernatural\" among many others. She also had a two year run on \"Mysterious Ways\" as 'Miranda' for NBC and PAX which earned her a Leo nomination and recurred for 2 seasons on \"Battlestar Galactica\" as 'Jean Barolay'. Alisen starred for three years in \"Robson Arms\" as 'Sault Ste. Marie', a character that was nominated for another two Leos. She currently lives in Toronto with her husband, son and their \"family\" of animals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjAzNzUwNl5BMl5BanBnXkFtZTcwODkwMDEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235888","name":"Alisen Down","idIMDB":"nm0235888"},"actorId":"nm0235888","character":"Jean Barolay","urlCharacter":"http://www.imdb.com/character/ch0008116","main":true},{"actorName":"Tiffany Lyndall-Knight","urlProfile":"http://www.imdb.com/name/nm0461101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQyNDExMTk5MF5BMl5BanBnXkFtZTcwNzQ3NTIxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1972","placeOfBirth":" Toronto, Canada","height":"5' 9\" (1.75 m)","bio":"Canadian-born and Australian-bred, Tiffany Lyndall Knight is at home on both stage and screen. Nominated for four Jessie Theatre Richardson awards, her theatre credits span eight seasons with Vancouver's Bard on the Beach Shakespeare Festival. Highlights include \"Ariel\" in \"The Tempest\", \"Olivia\" in \"Twelfth Night\", \"Helena\" in \"A Midsummer Night's Dream\" and \"Regan\" in \"King Lear\". A graduate of Toronto's acclaimed George Brown Theatre School, Tiffany has taught and created theatre with young people throughout her career. She has developed programs for Bard on the Beach's education division, was a founder of the Gateway Academy of Performing Arts at the Gateway Theatre in Richmond BC, and has taught at the William Davis Centre for Performing Arts, the University of British Columbia, Adelaide Centre for the Arts, and Flinders University Drama Centre, South Australia. On screen, she has appeared in many lead and recurring roles, including the popular television series, Battlestar Galactica (2004), Da Vinci's City Hall (2005), Stargate SG-1 (1997) and Supernatural (2005). She was a co-creator and actor in the feature film, Mothers&Daughters (2008), which screened at the Toronto International Film Festival and won Most Popular Canadian Film at the Vancouver International Film Festival in 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQyNDExMTk5MF5BMl5BanBnXkFtZTcwNzQ3NTIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0461101","name":"Tiffany Lyndall-Knight","idIMDB":"nm0461101"},"actorId":"nm0461101","character":"Hybrid","urlCharacter":"http://www.imdb.com/character/ch0230817","main":true}],"seasons":[],"idIMDB":"tt1286130","urlIMDB":"http://www.imdb.com/title/tt1286130","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 52 min (112 min)","1 hr 30 min (90 min) (TV)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.0","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"awards":[{"award":"Cinema Audio Society, USA 2010","titlesAwards":[{"titleAwardOutcome":"Nominated C.A.S. Award","categories":[{"category":"Outstanding Achievement in Sound Mixing for DVD Original Programming","names":[{"name":"Mike Olman","id":"nm0647406","role":"re-recording mixer"},{"name":"Ken Kobett","id":"nm0944601","role":"re-recording mixer"},{"name":"Rick Bal","id":"nm0049291","role":"production mixer"}]}]}]}],"votes":"15,244","type":"Video","companyCreditsSimple":[{"idCompany":"co0176813","name":"David Eick Productions"},{"idCompany":"co0140197","name":"R&D TV"}],"keywords":{"keywords":["cylon","battle","shower","fight","false identity","scolding","brother brother relationship","competition","space opera","d box motion code","sex","nudity","nude body double","male nudity","hand job","girl in bra and panties","female nudity","clip show","brief female frontal nudity","body double","black panties","black bra","black bra and panties","bare butt","robot","fictional war","vengeance","suicide bomber","spy","spaceship","spaceship setting","space crew","space colony","space battle","sleeper agent","shooting","robot suicide","resistance","prostitute","prisoner of war","military fleet","marriage","judgment","interracial relationship","humanoid","human robot hybrid","human heart","human fallibility","human extinction","human android relationship","genocide","frame up","fighter pilot","fake priest","explosion","execution","evolution","evacuation","escape","doctor","coworker relationship","commander","clone","bomb","attack on planet","assassination plot","assassination attempt","android","advanced technology"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:10:10"}}