{"data":{"movies":[{"title":"Brooklyn's Finest","originalTitle":"","year":"2009","releaseDate":"20100305","directors":[{"name":"Antoine Fuqua","id":"nm0298807"}],"writers":[{"name":"Michael C. Martin","id":"nm2130654"}],"runtime":"132 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTI5MTY5MV5BMl5BanBnXkFtZTcwNzAyOTMwMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"plot":"In Brooklyn, amid drug deals, violence, casual racism, poverty, housing projects, and corrupt cops, we follow three officers: Tango, African-American, working undercover, believing he's earned a promotion to a desk job but told he has to set up the bust of an ex-con who saved his life; Sal, who'll commit murder to get cash; and, Eddie, the precinct's oldest beat cop, a week to go before retirement, assigned to mentor an earnest rookie. Can this end well for any of the three?","simplePlot":"Three unconnected Brooklyn cops wind up at the same deadly location after enduring vastly different career paths.","actors":[{"actorName":"Richard Gere","urlProfile":"http://www.imdb.com/name/nm0000152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1949","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Richard Tiffany Gere","height":"5' 10\" (1.78 m)","bio":"Humanitarian and actor Richard Gere was born on August 31, 1949, in Philadelphia, the second of five children of Doris Ann (Tiffany), a homemaker, and Homer George Gere, an insurance salesman, both Mayflower descendants. Richard started early as a musician, playing a number of instruments in high school and writing music for high school productions. He graduated from North Syracuse Central High School in 1967, and won a gymnastics scholarship to the University of Massachusetts in Amherst, where he majored in philosophy. He left college after two years to pursue acting, landing a lead role in the London production of the rock musical \"Grease\" in 1973. The following year he would be in other plays, such as \"Taming of the Shrew.\" Onscreen, he had a few roles, and gained recognition in Looking for Mr. Goodbar (1977). Offscreen, he spent 1978 meeting Tibetans when he traveled to Nepal, where he spoke to many monks and lamas. Returning to the US, on Broadway he portrayed a concentration-camp prisoner in \"Bent,\" for which he received the 1980 Theatre World Award. Back in Hollywood, he played the title role in American Gigolo (1980), establishing himself as a major star; this status was reaffirmed by An Officer and a Gentleman (1982). In the early 1980s, Richard went to Honduras, Nicaragua and El Salvador (amidst ongoing wars and political violence); he traveled with a doctor and visited refugee camps. It is said that he was romantically linked with lovely Brazilian painter Sylvia Martins. In 1990 Richard teamed up with Julia Roberts to star in the blockbuster Pretty Woman (1990); his cool reserve was the perfect complement to Julia's bubbling enthusiasm. The film captured the nation's heart, and won the People's Choice award for Best Movie. Fans clamored for years for a sequel, or at least another pairing of Julia and Richard. They got that with Runaway Bride (1999), which was a runaway success (Richard got $12 million, Julia made $17 million, the box office was $152 million, which shows what happens when you give the public what it wants!). Offscreen, Richard and Cindy Crawford got married December 12, 1991 (they were divorced in 1995). Afterwards, Richard started dating actress Carey Lowell. They had a son, Homer James Jigme Gere, on February 6, 2000. Richard was picked by People magazine as one of the 50 Most Beautiful People in the world in 1991, and as their Sexiest Man Alive in 1999. He is an accomplished pianist and music writer. Above all, Richard is a humanitarian. He's a founding member of \"Tibet House,\" a nonprofit organization dedicated to the preservation of Tibetan culture. He has been an active supporter of \"Survival International\" for several years, a worldwide organization supporting tribal peoples, affirming their right to decide their own future and helping them protect their lives, lands and human rights (these tribes are global, including the natives of the Amazon, the Maasai of East Africa, the Wichi of Argentina, and others). In 1994 Richard went to London to open Harrods' sale, donating his £50,000 appearance fee to Survival. He has been prominent in their charity advertising campaigns.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000152","name":"Richard Gere","idIMDB":"nm0000152"},"actorId":"nm0000152","character":"Eddie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Cheadle","urlProfile":"http://www.imdb.com/name/nm0000332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1964","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Donald Frank Cheadle","height":"5' 8½\" (1.74 m)","bio":"Donald Frank Cheadle was born in Kansas City, Missouri on November 29, 1964. His childhood found him moving from city to city with his family: mother Bettye (North), a teacher, father Donald Frank Cheadle, Sr., a clinical psychologist, sister Dawn, and brother Colin. After graduating high school in Denver, Colorado, Cheadle attended and graduated from the California Institute of the Arts with a Bachelor¹s Degree in Fine Arts. Encouraged by his college friends, he attended a variety of auditions and landed a recurring role on the hit series Fame (1982), which led to feature film roles in Dennis Hopper's Colors (1988) and John Irvin's Hamburger Hill (1987). Early in his career, Cheadle was named Best Supporting Actor by the Los Angeles Film Critics for his breakout performance opposite Denzel Washington in Devil in a Blue Dress (1995). His subsequent film credits include: Traitor (2008), an international thriller which he produced, starring opposite Guy Pearce; Kasi Lemmons's Talk to Me (2007), with Chiwetel Ejiofor; the 2006 Oscar-winning Best Picture, Collision (2004), which Cheadle also produced; Hotel Rwanda (2004), for which his performance garnered Oscar, Golden Globe, Broadcast Film Critics and Screen Actors Guild award nominations for Best Actor; Steven Soderbergh's Ocean's Eleven (2001), Ocean's Twelve (2004) and Ocean's Thirteen (2007), starring Brad Pitt and George Clooney; Mike Binder's Reign Over Me (2007) with Adam Sandler; the Academy Award-winning Traffic (2000) and Out of Sight (1998), with George Clooney and Jennifer Lopez, both films also directed by Soderbergh; Paul Thomas Anderson's acclaimed Boogie Nights (1997) with Julianne Moore and Mark Wahlberg; Bulworth (1998), directed by and starring Warren Beatty; Swordfish (2001), with John Travolta and Halle Berry; Mission to Mars (2000) with Tim Robbins and Gary Sinise; John Singleton's Rosewood (1997), for which Cheadle earned an NAACP Image Award nomination; Brett Ratner's The Family Man (2000), starring Nicolas Cage; and the independent features Manic (2001) and Things Behind the Sun (2001). Cheadle was honored by the CineVegas Film Festival and the Los Angeles Film Festival and received ShoWest's Male Star of the Year award. He is also well-recognized for his television work, including his portrayal of Sammy Davis Jr. in HBO's The Rat Pack (1998), for which he received a Golden Globe Award and a Best Supporting Actor Emmy nomination. That same year, he also received an Emmy nomination for his starring role in HBO's adaptation of the best-selling novel A Lesson Before Dying (1999), opposite Cicely Tyson and Mekhi Phifer. He also starred for HBO in Eriq La Salle's Rebound: The Legend of Earl 'The Goat' Manigault (1996). Cheadle's TV series credits include his two-year stint in David E. Kelley's acclaimed series Picket Fences (1992), a guest-starring role on ER (1994) (earning yet another Emmy nomination) and a regular role on The Golden Palace (1992) He also starred in the live television broadcast of Fail Safe (2000) opposite George Clooney, James Cromwell, Brian Dennehy, Richard Dreyfuss and Harvey Keitel. He also co-executive produced the TV version of Crash (2008). His most recent big screen appearances have been in Antoine Fuqua's ensemble crime thriller Brooklyn's Finest (2009) and Jon Favreau's Iron Man 2 (2010), another mainstream breakthrough where he played Lt. Col. James 'Rhodey' Rhodes, replacing Terrence Howard from the first film. L'Irlandais (2011), an art-house hit directed by John Michael McDonagh and co-starring Brendan Gleeson, followed. Cheadle stars in House of Lies (2012) on Showtime. Late in 2012, he was seen in Flight (2012), Robert Zemeckis's return to live-action filmmaking. In 2013, he reprised his role as Rhodey in Iron Man 3 (2013). Among his projects in development is a movie based on the life of jazz legend Miles Davis. A talented musician who plays saxophone, writes music and sings, he is also an accomplished stage actor and director and was nominated for a Grammy Award in 2004 for Best Spoken Word Album for his narration/dramatization of the Walter Mosley novel \"Fear Itself\". Other notable off-stage achievements include the 2007 BET Humanitarian Award for the cause of the people of Darfur and Rwanda, and sharing the Summit Peace Award by the Nobel Peace Prize Laureates in Rome with George Clooney for their work in Darfur.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000332","name":"Don Cheadle","idIMDB":"nm0000332"},"actorId":"nm0000332","character":"Tango","urlCharacter":"http://www.imdb.com/character/ch0102861","main":true},{"actorName":"Ethan Hawke","urlProfile":"http://www.imdb.com/name/nm0000160","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NDMxMTI0MF5BMl5BanBnXkFtZTYwMjE3ODE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1970","placeOfBirth":" Austin, Texas, USA","birthName":"Ethan Green Hawke","height":"5' 10¾\" (1.8 m)","bio":"Ethan Green Hawke was born on November 6, 1970 in Austin, Texas, to Leslie Carole (Green), a charity worker, and James Steven Hawke, an insurance actuary. His parents were students at the University of Texas at the time but divorced when Ethan was 5 years old. His mother raised him alone for the next five years, moving around the country, until she remarried in 1981 and the family settled in Princeton Junction, New Jersey. He attended West Windsor-Plainsboro High School and then transferred to the Hun School of Princeton and it was while he was there that he began taking acting classes at the McCarter Theatre on the Princeton campus. His early ambition had been to be a writer, but as a result of the acting lessons and appearances in student productions he persuaded his mother to allow him to attend an audition for a role in a sci-fi adolescent adventure, Explorers (1985). He got the part (along with River Phoenix) but although the movie was favourably reviewed, it met with little commercial success which discouraged Hawke from pursuing further movie roles for a few years. He was admitted to the prestigious Carnegie-Mellon University to study theatre but his studies were interrupted when he won his break-through role opposite Robin Williams in Dead Poets Society (1989) and he didn't complete his degree. His subsequent acting career was a mix of theatre work (earning a number of awards and nominations, including a Tony nomination for his role in The Coast of Utopia at the Lincoln Center in New York), and a mix of \"serious\" and more commercial movies, notably Gattaca (1997) (where he met his first wife, Uma Thurman) and Training Day (2001). Meanwhile, he also pursued his childhood ambition and has written two novels and several screenplays.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NDMxMTI0MF5BMl5BanBnXkFtZTYwMjE3ODE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000160","name":"Ethan Hawke","idIMDB":"nm0000160"},"actorId":"nm0000160","character":"Sal","urlCharacter":"http://www.imdb.com/character/ch0468399","main":true},{"actorName":"Wesley Snipes","urlProfile":"http://www.imdb.com/name/nm0000648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4Mzk4MDk2NV5BMl5BanBnXkFtZTYwODgxNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1962","placeOfBirth":" Orlando, Florida, USA","birthName":"Wesley Trent Snipes","height":"5' 9\" (1.75 m)","bio":"Wesley Trent Snipes was born in Orlando, Florida, to Maryann (Long), a teacher's assistant, and Wesley Rudolph Snipes, an aircraft engineer. He grew up on the streets of the South Bronx in New York City, where he very early decided that the theater was to be his career. He attended the High School for the Performing Arts (popularized in Fame (1980)). But dreams of the musical theater (and maybe a few commercials) faded when his mother moved to Orlando, Florida before he could graduate from high school. But after graduation from a Florida high school he appeared in local dinner theaters and regional productions. An agent saw him in a competition and got him his first movie role with Goldie Hawn in Wildcats (1986). Athletic roles such as that gave way to tough guy roles as in New Jack City (1991), and to the action hero in Passenger 57 (1992). Wesley feels that at least with the Hollywood heavyweights he must be doing something right - Sylvester Stallone, Robert De Niro, Dennis Hopper and Sean Connery all had veto power over casting and all approved his role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4Mzk4MDk2NV5BMl5BanBnXkFtZTYwODgxNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000648","name":"Wesley Snipes","idIMDB":"nm0000648"},"actorId":"nm0000648","character":"Caz","urlCharacter":"http://www.imdb.com/character/ch0152663","main":true},{"actorName":"Will Patton","urlProfile":"http://www.imdb.com/name/nm0001599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTEzNzMxMV5BMl5BanBnXkFtZTYwNTk2Njc3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1954","placeOfBirth":" Charleston, South Carolina, USA","birthName":"William Rankin Patton","height":"5' 9½\" (1.77 m)","bio":"Will Patton was born in Charleston, South Carolina. His father, Bill Patton, is a playwright, acting/directing instructor, and Lutheran minister. Patton attended the North Carolina School of the Arts. He has won two OBIE awards for best actor for the off-Broadway plays, Sam Shepard's \"Fool for Love\" and the Public Theatre production of \"What Did He See?\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTEzNzMxMV5BMl5BanBnXkFtZTYwNTk2Njc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001599","name":"Will Patton","idIMDB":"nm0001599"},"actorId":"nm0001599","character":"Lt. Bill Hobarts","urlCharacter":"http://www.imdb.com/character/ch0183149","main":true},{"actorName":"Lili Taylor","urlProfile":"http://www.imdb.com/name/nm0000666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNzAyMzA1ODZeQTJeQWpwZ15BbWU4MDAzNDQxNjkx._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1967","placeOfBirth":" Glencoe, Illinois, USA","birthName":"Lili Anne Taylor","height":"5' 2\" (1.57 m)","bio":"Lili Taylor is a well-known and successful American actress. She acts in film, TV and stage. She was born in Glencoe, Illinois, to Marie (Lecour) and George Park Taylor, an artist and hardware store operator. Lili graduated from New Trier High School in 1985. Then, she attended the Theatre School at DePaul University and the Piven Theatre Workshop. Lili first earned fame for acting in the 1988 movie, Mystic Pizza (1988), which co-starred Julia Roberts. Then, she acted in a number of successful movies, including Dogfight (1991) and Short Cuts (1993). But, she was more highly recognized for appearing in the 1996 film, I Shot Andy Warhol (1996), for which she was nominated for several awards. Lili's notable works for television include the TV series, Six Feet Under (2001), and in the television movies, Anne Frank (2001) and Live from Baghdad (2002). In 2009, she played \"Sheriff Lillian Holley\" in the movie, Public Enemies (2009). The movie co-starred Johnny Depp, with whom Lili also appeared in the 1993 movie, Arizona Dream (1993). Lili is also a successful stage actress. She has appeared in a number of plays staged on Broadway, including \"The Three Sisters\" (1997). Lili Taylor continues to act in stage, TV and film. She is married to Nick Flynn and they have a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNzAyMzA1ODZeQTJeQWpwZ15BbWU4MDAzNDQxNjkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000666","name":"Lili Taylor","idIMDB":"nm0000666"},"actorId":"nm0000666","character":"Angela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Kenneth Williams","urlProfile":"http://www.imdb.com/name/nm0931324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTg2NjA1Nl5BMl5BanBnXkFtZTcwMjQ4NzY5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1966","placeOfBirth":" Flatbush, Brooklyn, New York City, New York, USA","birthName":"Michael Kenneth Williams","height":"5' 10\" (1.78 m)","bio":"Born in Brooklyn, to an African American father from South Carolina and a Bahamian mother from Nassau, Michael K. Williams was raised in the Vandaveer housing projects in East Flatbush, Brooklyn, New York City and attended George Westinghouse Career and Technical Education High School. According to a DNA analysis, he is descended partly from the Mende people of Sierra Leone. After getting in some trouble as a youth, he enrolled at the National Black Theatre in New York City. He later got a job at a pharmaceutical company. Inspired by Janet Jackson's Rhythm Nation 1814, he left school and quit his job, against the wishes of his family, to pursue a career as a dancer. During a year in which he was intermittently homeless, Williams visited record labels and dance studios looking for work. He got a job as a background dancer on a music tour for Akym Sims' dance anthem Too Blind To See It, which led to more work appearing as a dancer in videos and on tours, such as with George Michael, Madonna, as well as some modelling work. He also choreographed Crystal Waters' 1994 single \"100% Pure Love\". He is an established actor and producer, perhaps best-known for his role on the highly-acclaimed HBO Television series The Wire (2002) where he played Omar Little. Other notable works he performed in have included The Road (2009) Boardwalk Empire (2010), 12 Years a Slave (2013) and RoboCop (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTg2NjA1Nl5BMl5BanBnXkFtZTcwMjQ4NzY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931324","name":"Michael Kenneth Williams","idIMDB":"nm0931324"},"actorId":"nm0931324","character":"Red","urlCharacter":"http://www.imdb.com/character/ch0183153","main":true},{"actorName":"Brían F. O'Byrne","urlProfile":"http://www.imdb.com/name/nm0639928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Mjk3Mjg3Ml5BMl5BanBnXkFtZTYwNjkxMjE0._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1967","placeOfBirth":" Mullagh, County Cavan, Ireland","birthName":"Brían Flynn O'Byrne","height":"6' 2\" (1.88 m)","bio":"Brían F. O'Byrne was born on May 16, 1967 in Mullagh, County Cavan, Ireland as Brían Flynn O'Byrne. He is an actor, known for Million Dollar Baby (2004), The International (2009) and Bandits (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Mjk3Mjg3Ml5BMl5BanBnXkFtZTYwNjkxMjE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639928","name":"Brían F. O'Byrne","idIMDB":"nm0639928"},"actorId":"nm0639928","character":"Ronny Rosario","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shannon Kane","urlProfile":"http://www.imdb.com/name/nm2000144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjQ3NTgzMF5BMl5BanBnXkFtZTcwNDQ3NDUxNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Shannon Kane is an actress, known for All My Children (1970), Brooklyn's Finest (2009) and The Collection (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjQ3NTgzMF5BMl5BanBnXkFtZTcwNDQ3NDUxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2000144","name":"Shannon Kane","idIMDB":"nm2000144"},"actorId":"nm2000144","character":"Chantel","urlCharacter":"http://www.imdb.com/character/ch0183155","main":true},{"actorName":"Ellen Barkin","urlProfile":"http://www.imdb.com/name/nm0000289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTk3MTgxNl5BMl5BanBnXkFtZTcwMTMxNDkxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1954","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Ellen Rona Barkin","height":"5' 6\" (1.68 m)","bio":"Offbeat, unconventionally pretty, and utterly mesmerizing, Ellen Barkin was born in 1954 in the Bronx, New York, to Evelyn (Rozin), a hospital administrator, and Sol Barkin, a chemical salesman. Her parents were both from Russian Jewish families. Raised in the South Bronx and Queens, New York area, she wanted to be an actress as early as her teens and was eventually accepted into Manhattan's High School of the Performing Arts. Barkin then attended Hunter College and received her degree after double majoring in history and drama. At one point she wanted to teach ancient history, but instead turned her thoughts back to her first love: acting. Barkin then continued her education at New York's Actor's Studio. Fearful of the auditioning process, she studied acting for seven years before finally landing her first audition. While continuing her studies, she worked as a waitress at the avant-garde Ocean Club. Performing off-Broadway in such plays \"Shout Across the River\" (1979), \"Extremities\" (1983), \"Fool for Love\" (1984) and \"Eden Court\" (1985), she was applauded across the board for her first film lead in Diner (1982) opposite Mickey Rourke and Daniel Stern, and pursued sexy tough-cookie status thereafter with such quirky roles in The Big Easy (1986) starring Dennis Quaid and Siesta (1987) with Irish actor Gabriel Byrne, whom she married in 1987 and separated from in 1993 after producing a son and daughter. She and Byrne divorced in 1999. With trademark squinting eyes and slightly off-kilter facial features, Barkin continued the fascination of her seamy/steamy girl-from-the-wrong-side-of-the-tracks status most notably opposite Al Pacino in the thriller Sea of Love (1989). In addition, she was well cast as Robert De Niro's abused wife in This Boy's Life (1993), and portrayed \"Calamity Jane\" in Wild Bill (1995) with earnest. Other impressionable offbeat projects included roles in Fear and Loathing in Las Vegas (1998), Belles à mourir (1999) and Mercy (2000). On TV, she was well-cast in the mini-movie Clinton and Nadine (1988) and won an Emmy award for her gripping performance in Before Women Had Wings (1997) opposite Oprah Winfrey as another abused wife who, in this case, turns her violent anger on her own daughters. In 2000, Barkin married billionaire Ronald O. Perelman, eleven years her senior and chairman of the Revlon company, and put her career relatively on hold, appearing sporadically in edgy films like She Hate Me (2004) and Palindromes (2004). Barkin and Perelman went through an acrimonious divorce in 2006. Just prior to her divorce in late 2005, Barkin ventured into independent film production with Applehead Pictures, a company she set up with her brother George Barkin, who is a scriptwriter and former editor-in-chief of National Lampoon and High Times, and former Independent Film Channel executive Caroline Kaplan. In her first major acting appearance since her divorce from Perelman, Barkin co-starred in Ocean's Thirteen (2007) with George Clooney, Matt Damon, Brad Pitt and former co-star Pacino. She followed up Ocean's with a supporting role in Antoine Fuqua's Brooklyn's Finest (2009), Happy Tears (2009) with Parker Posey and Demi Moore, and Twelve (2010). Recently, Barkin has produced features, including Letters to Juliet (2010) and Another Happy Day (2011) (she also starred in the latter project). On the small screen, she appeared in an episode of Modern Family (2009) and her new NBC show, The New Normal (2012), got a sneak peek during the Olympics. She lives with her two teenage children in Manhattan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTk3MTgxNl5BMl5BanBnXkFtZTcwMTMxNDkxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000289","name":"Ellen Barkin","idIMDB":"nm0000289"},"actorId":"nm0000289","character":"Agent Smith","urlCharacter":"http://www.imdb.com/character/ch0183150","main":true},{"actorName":"Vincent D'Onofrio","urlProfile":"http://www.imdb.com/name/nm0000352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1959","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Vincent Phillip D'Onofrio","height":"6' 3½\" (1.92 m)","bio":"Vincent Phillip D'Onofrio was born on June 30, 1959 in Brooklyn, New York, to Phyllis, a restaurant manager and server, and Gene D'Onofrio, a theater production assistant and interior designer. He is of Italian descent and has two older sisters. He studied at the Actors Studio and the American Stanislavski Theatre. Vincent D'Onofrio is known as an \"actor's actor\". The wide variety of roles he has played and the quality of his work have earned him a reputation as a versatile talent. His first paid role was in Off-Broadway's \"This Property Is Condemned\". He continued appearing in plays and worked as a bouncer, a bodyguard and a delivery man. In 1984, he made his Broadway debut in \"Open Admissions\", followed by work in numerous other stage plays. In 2012, D'Onofrio returned to teach at the Lee Strasberg Theater & Film Institute. As a film actor, D'Onofrio's career break came when he played a mentally unbalanced recruit in Full Metal Jacket (1987), directed by the renowned Stanley Kubrick. For this role D'Onofrio gained nearly 70 pounds. He had a major role in Dying Young (1991), and appeared prominently in the box-office smash Men in Black (1997) as the bad guy (Edgar \"The Bug\"). Other films of note in which he has appeared are Mystic Pizza (1988), JFK (1991), The Player (1992), Ed Wood (1994), The Cell (2000), The Break-Up (2006) and Jurassic World (2015). In 1996, D'Onofrio garnered critical acclaim along with co-star Renée Zellweger for The Whole Wide World (1996), which he helped produce. He also made a guest appearance in Homicide: Life on the Street: The Subway (1997), where he played an accident victim who could not be rescued and was destined to die. For this performance he won an Emmy nomination. In 2000, he both produced and starred in Steal This Movie (2000), a biopic of radical leader Abbie Hoffman. In 2001, D'Onofrio took the role which has likely given him his greatest public recognition: Det. Robert Goren, the lead character in the TV series Law & Order: Criminal Intent (2001). Goren is based on Sherlock Holmes but, instead of relying upon physical evidence like Holmes, D'Onofrio's character focuses on psychology to identify the perpetrators, whom he often draws into confessing or yielding condemning evidence. He played the part for 10 years. In his career D'Onofrio's various film characters have included a priest, a bisexual former porn star, a hijacker, a serial killer, Orson Welles, a space alien, a 1960s radical leader, a pulp fiction writer, an ingenious police investigator and Stuart Smalley's dope-head brother. His on-screen love interests have included Julia Roberts, Cameron Diaz, Renée Zellweger, Marisa Tomei, Tracey Ullman, Rebecca De Mornay and Lili Taylor. One of his latest roles is in Marvel's Daredevil (2015) as Daredevil's nemesis, Wilson Fisk. He lives in Manhattan with his wife and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000352","name":"Vincent D'Onofrio","nicknames":["The Human Chameleon","Noffy"],"idIMDB":"nm0000352"},"actorId":"nm0000352","character":"Carlo","urlCharacter":"http://www.imdb.com/character/ch0183152","main":true},{"actorName":"Wass Stevens","urlProfile":"http://www.imdb.com/name/nm0828840","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjExOTY0N15BMl5BanBnXkFtZTcwNDk1NDQ1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1970","placeOfBirth":" Brooklyn, New York, USA","bio":"Wass Stevens was born in 1970 in Brooklyn, New York, USA. He is an actor, known for Public Morals (2015), House of Cards (2013) and The Wrestler (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjExOTY0N15BMl5BanBnXkFtZTcwNDk1NDQ1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828840","name":"Wass Stevens","idIMDB":"nm0828840"},"actorId":"nm0828840","character":"Det. Patrick Leary","urlCharacter":"http://www.imdb.com/character/ch0183058","main":true},{"actorName":"Armando Riesco","urlProfile":"http://www.imdb.com/name/nm1269976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAxNTgwM15BMl5BanBnXkFtZTgwOTk1MDg1MTE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1977","placeOfBirth":" Mayaguez, Puerto Rico","bio":"Armando Riesco is a versatile NYC based actor with credits in film, TV, and the stage. He graduated from Northwestern University's theater department and has been working consistently in multiple genres with some of the best directors in the business, including Spike Lee, Oliver Stone, Steven Soderbergh, Jonathan Demme, and many others. He has appeared in over a dozen films (Garden State, Adult World, Bella, World Trade Center etc.), and regular, recurring, and guest starring spots on television (Power, The Family, Vinyl, Kings). He has voiced and done motion capture for several video games, most recently playing \"Mario Frigo\" in Avalanche Studios \"Just Cause 3\". His voice can also be heard in national and international publicity campaigns for major companies such as Macy's, Chase, Garnier, McDonalds, and many others. On stage he was most notably the title character in the Elliot Trilogy, which includes the Pulitzer Prize winning \"Water by the Spoonful\" by Quiara Hudes, for which he received a Lucille Lortel nomination for outstanding lead actor in a play. He is sought after for his unique portrayals of characters across the board. From anger fueled Marine, to hilarious trans-sexual, to bored, suburban, and supremely wealthy, Riesco has managed to submerge himself seamlessly into his roles. As a director and writer/producer, his 1st short \"Remember\" was an official selection at LA Shorts,The NYHBO Latino Film Festival, LALIFF, and the Soho Film Festival. His second short \"The Lost Flowers\" (2016) is on the festival circuit having premiered at the Rincón International Film Festival in PR. He is also in development for a film adaptation/translation of Romeo and Juliet starring Ruben Blades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAxNTgwM15BMl5BanBnXkFtZTgwOTk1MDg1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1269976","name":"Armando Riesco","idIMDB":"nm1269976"},"actorId":"nm1269976","character":"Det. George Montress","urlCharacter":"http://www.imdb.com/character/ch0182505","main":true},{"actorName":"Wade Allain-Marcus","urlProfile":"http://www.imdb.com/name/nm0019860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI5MzEwNzgxOF5BMl5BanBnXkFtZTgwOTIzNTYwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Wade Allain-Marcus is an actor and producer, known for Insecure (2016), French Dirty (2015) and Brooklyn's Finest (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI5MzEwNzgxOF5BMl5BanBnXkFtZTgwOTIzNTYwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019860","name":"Wade Allain-Marcus","idIMDB":"nm0019860"},"actorId":"nm0019860","character":"C-Rayz","urlCharacter":"http://www.imdb.com/character/ch0136985","main":true},{"actorName":"Logan Marshall-Green","urlProfile":"http://www.imdb.com/name/nm1334869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTY2OTI3MF5BMl5BanBnXkFtZTcwNDc1MTg4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1976","placeOfBirth":" Charleston, South Carolina, USA","height":"5' 11\" (1.8 m)","bio":"Logan is a native of Charleston, South Carolina. His parents are both drama teachers. His mother, Lowry Marshall, is the artistic director of Brown University's repertory-theater department. Logan graduated with a Master's in Fine Arts from New York University's Graduate Acting Program at the Tisch School of the Arts. He made a few appearances in Law and Order, before landing recurring roles on The O.C. (2003) and 24 (2001). His breakthrough role came in Ridley Scott's Prometheus (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTY2OTI3MF5BMl5BanBnXkFtZTcwNDc1MTg4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1334869","name":"Logan Marshall-Green","idIMDB":"nm1334869"},"actorId":"nm1334869","character":"Melvin Panton","urlCharacter":"http://www.imdb.com/character/ch0183157","main":true}],"seasons":[],"idIMDB":"tt1210042","urlIMDB":"http://www.imdb.com/title/tt1210042","business":{"budget":{"money":"$17,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,350,299","country":"USA","day":"07","month":"03","year":"2010","remarks":"1,936 Screens"},{"money":"$468,279","country":"UK","day":"13","month":"06","year":"2010","remarks":"310 Screens"}],"gross":[{"money":"$27,154,426","country":"USA","day":"16","month":"05","year":"2010","remarks":""},{"money":"$27,122,020","country":"USA","day":"09","month":"05","year":"2010","remarks":""},{"money":"$27,062,081","country":"USA","day":"02","month":"05","year":"2010","remarks":""},{"money":"$26,997,217","country":"USA","day":"25","month":"04","year":"2010","remarks":""},{"money":"$26,967,407","country":"USA","day":"18","month":"04","year":"2010","remarks":""},{"money":"$26,905,697","country":"USA","day":"11","month":"04","year":"2010","remarks":""},{"money":"$26,746,443","country":"USA","day":"04","month":"04","year":"2010","remarks":""},{"money":"$26,228,372","country":"USA","day":"28","month":"03","year":"2010","remarks":""},{"money":"$24,821,335","country":"USA","day":"21","month":"03","year":"2010","remarks":""},{"money":"$21,351,472","country":"USA","day":"14","month":"03","year":"2010","remarks":""},{"money":"$13,350,299","country":"USA","day":"07","month":"03","year":"2010","remarks":""},{"money":"£1,252,604","country":"UK","day":"04","month":"07","year":"2010","remarks":""},{"money":"£1,125,050","country":"UK","day":"27","month":"06","year":"2010","remarks":""},{"money":"£935,868","country":"UK","day":"20","month":"06","year":"2010","remarks":""},{"money":"£468,279","country":"UK","day":"13","month":"06","year":"2010","remarks":""}],"weekendGross":[{"money":"$15,572","country":"USA","day":"16","month":"05","year":"2010","remarks":"64 Screens"},{"money":"$31,329","country":"USA","day":"09","month":"05","year":"2010","remarks":"113 Screens"},{"money":"$58,206","country":"USA","day":"02","month":"05","year":"2010","remarks":"146 Screens"},{"money":"$15,545","country":"USA","day":"25","month":"04","year":"2010","remarks":"37 Screens"},{"money":"$30,746","country":"USA","day":"18","month":"04","year":"2010","remarks":"72 Screens"},{"money":"$72,672","country":"USA","day":"11","month":"04","year":"2010","remarks":"131 Screens"},{"money":"$173,783","country":"USA","day":"04","month":"04","year":"2010","remarks":"301 Screens"},{"money":"$766,098","country":"USA","day":"28","month":"03","year":"2010","remarks":"739 Screens"},{"money":"$1,640,703","country":"USA","day":"21","month":"03","year":"2010","remarks":"1,311 Screens"},{"money":"$4,290,000","country":"USA","day":"14","month":"03","year":"2010","remarks":"1,939 Screens"},{"money":"$13,350,299","country":"USA","day":"07","month":"03","year":"2010","remarks":"1,936 Screens"},{"money":"£38,973","country":"UK","day":"04","month":"07","year":"2010","remarks":"103 Screens"},{"money":"£76,274","country":"UK","day":"27","month":"06","year":"2010","remarks":"191 Screens"},{"money":"£203,204","country":"UK","day":"20","month":"06","year":"2010","remarks":"268 Screens"},{"money":"£468,279","country":"UK","day":"13","month":"06","year":"2010","remarks":"310 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 2010 Brooklyn's Finest Productions, Inc. (on print); Brooklyn's Finest Productions, Inc.; 30 August 2010; PA1695372 (in copyright registry)"},"technical":{"runtime":["2 hr 12 min (132 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Zeiss Master Prime and Angenieux Optimo Lenses","Arriflex 435, Zeiss Master Prime and Angenieux Optimo Lenses","Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital dailies)","Company 3, New York (NY), USA (digital dailies)","Technicolor, New York (NY), USA (processing: film dailies)"],"filmLength":["3,656 m (Portugal)"],"negativeFormat":["35 mm (Kodak Vision2 250D 5205, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format) (three shots)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3513DI, Eterna-CP 3521XD)","D-Cinema"]},"rating":"6.7","metascore":"43","filmingLocations":[{"location":"Avenue R & East 15th Street, Brooklyn, New York City, New York, USA"}],"rated":"R","awards":[{"award":"BET Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actor","names":[{"name":"Don Cheadle","id":"nm0000332","role":null}]}]}]},{"award":"Black Reel Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won Black Reel","categories":[{"category":"Best Supporting Actor","names":[{"name":"Wesley Snipes","id":"nm0000648","role":null}]}]},{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Best Actor","names":[{"name":"Don Cheadle","id":"nm0000332","role":null}]},{"category":"Best Director","names":[{"name":"Antoine Fuqua","id":"nm0298807","role":null}]},{"category":"Best Screenplay, Original or Adapted","names":[{"name":"Michael C. Martin","id":"nm2130654","role":null}]},{"category":"Best Original Score","names":[{"name":"Marcelo Zarvos","id":"nm0953616","role":null}]},{"category":"Best Song","names":[{"name":"Jay Z","id":"nm0419650","role":"Performer, Writer"},{"name":"Rihanna","id":"nm1982597","role":"Performer, Writer"},{"name":"Kanye West","id":"nm1577190","role":"Performer, Writer"},{"name":"Ernest D. Wilson","id":"nm1615907","role":"Writer"},{"name":"Jeff Bhasker","id":"nm2521575","role":"Writer"}]},{"category":"Best Film","names":[{"name":"Elie Cohn","id":"nm0169896","role":null},{"name":"Basil Iwanyk","id":"nm0412588","role":null},{"name":"John Langley","id":"nm0486524","role":null},{"name":"John Thompson","id":"nm0860315","role":null}]},{"category":"Best Ensemble","names":[{"name":"Suzanne Smith","id":"nm0189792","role":"Casting Director"},{"name":"Mary Vernieu","id":"nm0894611","role":"Casting Director"}]}]}]},{"award":"Image Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Supporting Actor in a Motion Picture","names":[{"name":"Don Cheadle","id":"nm0000332","role":null}]},{"category":"Outstanding Writing in a Motion Picture (Theatrical or Television)","names":[{"name":"Michael C. Martin","id":"nm2130654","role":null}]}]}]}],"votes":"54,360","type":"Movie","companyCreditsSimple":[{"idCompany":"co0002572","name":"Millennium Films"},{"idCompany":"co0172670","name":"Thunder Road Pictures"},{"idCompany":"co0024720","name":"Nu Image / Millennium Films"}],"keywords":{"keywords":["corrupt cop","catholic","new york city","police detective","police officer killed","confession booth","brooklyn new york city","undercover","detective","family man","retirement","murder","blood splatter","breasts","narcotics cop","police corruption","police officer shot by a police officer","money problems","expecting twins","ends with freeze frame","nypd","thoughts of retirement","reference to god","drive by shooting","hail mary","murder by gunshot","murdered in a car","apathy","neo noir","lens flare","bmw","working in the nude","drug raid","ironing money","bedtime prayer","razor blade","briefing","confessional","shot point blank","reference to gregory hines","police","corruption","freeze frame","police badge","kidnapping","missing person poster","sex slave","priest","betrayal","flashback","bag of money","driveby shooting","blood on shirt","punched in the face","strangulation","trail of blood","shot in the stomach","racial slur","handcuffed to a pipe","ensemble cast","revenge","redemption","police station","gold watch","fellatio","blow job","female rear nudity","female frontal nudity","prostitute","police officer shot","shot through a door","shootout","foot chase","swat team","police raid","drug dealer","police brutality","man slaps a woman","coughing blood","blood","suicidal","gun in mouth","ex marine","rookie cop","deception","undercover cop","tattoo on back","held at gunpoint","robbery","stealing money","card game","gambling","cigarette smoking","desperation","hospital","asthma","mold","pregnant wife","father daughter relationship","father son relationship","husband wife relationship","bare chested male","corpse","blood in car","church","guilt","pistol","shot to death","shot in the shoulder","shot in the back","shot in the chest","shot in the head","place name in title","death of friend","two word title","f word","punctuation in title","apostrophe in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:13:21"}}