{"data":{"movies":[{"title":"Edge of Darkness","originalTitle":"","year":"2010","releaseDate":"20100129","directors":[{"name":"Martin Campbell","id":"nm0132709"}],"writers":[{"name":"William Monahan","id":"nm1184258"},{"name":"Andrew Bovell","id":"nm0100597"}],"runtime":"117 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMDk5MTg5Ml5BMl5BanBnXkFtZTcwOTYyMjE5Mg@@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"Thomas Craven is a detective who has spent years working the streets of Boston. When his own daughter is killed outside his own home, Craven soon realizes that her death is only one piece of an intriguing puzzle filled with corruption and conspiracy, and it falls to him to discover who is behind the crime.","simplePlot":"As homicide detective Thomas Craven investigates the death of his activist daughter, he uncovers not only her secret life, but a corporate cover-up and government collusion that attracts an agent tasked with cleaning up the evidence.","actors":[{"actorName":"Mel Gibson","urlProfile":"http://www.imdb.com/name/nm0000154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1956","placeOfBirth":" Peekskill, New York, USA","birthName":"Mel Columcille Gerard Gibson","height":"5' 9¾\" (1.77 m)","bio":"Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York, USA, as the sixth of eleven children of Hutton Gibson, a railroad brakeman, and Anne Patricia (Reilly) Gibson (who died in December of 1990). His mother was Irish, from County Longford, while his American-born father is of mostly Irish descent. Mel and his family moved to Australia in the late 1960s, settling in New South Wales, where Mel's paternal grandmother, contralto opera singer Eva Mylott, was born. After high school, Mel studied at the University of New South Wales in Sydney, performing at the National Institute of Dramatic Arts alongside future film thespians Judy Davis and Geoffrey Rush. After college, Mel had a few stints on stage and starred in a few TV shows. Eventually, he was chosen to star in Mad Max (1979) and in a movie called Tim (1979), co-starring Piper Laurie. The small budgeted movie Mad Max (1979) made him known worldwide, while Tim (1979) garnered him an award for Best Actor from the Australian Film Institute (equivalent to the Oscar). Later, he went on to star in Gallipoli (1981), which earned him a second award for Best Actor from the AFI. In 1980, he married Robyn Moore and had seven children. In 1984, Mel made his American debut in The Bounty (1984), which co-starred Anthony Hopkins. Then in 1987, Mel starred in what would become his signature series, Lethal Weapon (1987), in which he played \"Martin Riggs\". In 1990, he took on the interesting starring role in Hamlet (1990), which garnered him some critical praise. He also made the more endearing Forever Young (1992) and the somewhat disturbing The Man Without a Face (1993). 1995 brought his most famous role as \"Sir William Wallace\" in Braveheart (1995), for which he won two Oscars for Best Picture and Best Director. From there, he made such box office hits as The Patriot (2000), Ransom (1996), and Payback (1999). Today, Mel remains an international superstar mogul, continuously topping the Hollywood power lists as well as the Most Beautiful and Sexiest lists.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000154","name":"Mel Gibson","idIMDB":"nm0000154"},"actorId":"nm0000154","character":"Craven","urlCharacter":"http://www.imdb.com/character/ch0177993","main":true},{"actorName":"Ray Winstone","urlProfile":"http://www.imdb.com/name/nm0935653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTM2MTU1OV5BMl5BanBnXkFtZTcwNDAzNTQyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1957","placeOfBirth":" Hackney, London, England, UK","birthName":"Raymond Andrew Winstone","height":"5' 10\" (1.78 m)","bio":"Ray Winstone was born on February 19, 1957, in Hackney Hospital in London, England, to Margaret (Richardson) and Raymond J. Winstone. He moved to Enfield, at age seven, where his parents had a fruit and vegetable business. He started boxing at the age of twelve at the famous Repton Amateur Boxing Club, was three times London Schoolboy Champion and fought twice for England, UK. In ten years of boxing, he won over 80 medals and trophies. Ray studied acting at the Corona School before being cast by director Alan Clarke as Carlin in the BBC Play production of Scum (1979). He has appeared in numerous TV series over the past 20 years including Robin Hood (1984), Palmer (1991), Birds of a Feather (1989), Between the Lines (1992), Ghostbusters of East Finchley (1995), Births, Marriages and Deaths (1999), and Vincent (2005). His film career has burgeoned since his award-winning role in Gary Oldman's Nil by Mouth (1997), and he has appeared in multiple films including Fanny and Elvis (1999), Tim Roth's The War Zone (1999), The Departed (2006), Hugo (2011), and Snow White and the Huntsman (2012). Known for his signature gritty voice, Winstone has also done a number of voiceover roles including Rango (2011), The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005), as well as the Beowulf (2007) film and video games. He married Elaine Winstone in 1979, and the couple have three children: Lois Winstone (born 1982), a singer with the London-based hip-hop group \"Crack Village\" who also played his on-screen daughter in Last Orders (2001) and got a part in four episodes of The Bill (1984), Jaime Winstone (born 1985) also an actress with ambitions to be a director, and Ellie Rae Winstone (born 2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTM2MTU1OV5BMl5BanBnXkFtZTcwNDAzNTQyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935653","name":"Ray Winstone","idIMDB":"nm0935653"},"actorId":"nm0935653","character":"Jedburgh","urlCharacter":"http://www.imdb.com/character/ch0158646","main":true},{"actorName":"Danny Huston","urlProfile":"http://www.imdb.com/name/nm0396812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MTk4NDA0NjZeQTJeQWpwZ15BbWU3MDQ5NzIzNTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1962","placeOfBirth":" Rome, Lazio, Italy","height":"6' 2\" (1.88 m)","bio":"Danny Huston is an American actor and director who has worked with Academy award-nominated actors from the very start of his career. No surprise for a man who was born into a legendary Hollywood family whose most noted members included his half-sister, his father, his grandfather, his nephew, and of course, himself. Born in Rome, Huston's parents were Zoe Sallis and John Huston. Sallis was an established author in her own right. John Huston was, by that point, famous for his many high caliber films, and notorious for his personal life, which included five marriages, two children, another adopted child, and many affairs, one of which resulted in Danny's conception. Like his half-sister, Anjelica Huston, Danny Huston chose to follow his father into the world of film. His birthright served as a blessing, so that his first film appearance as an actor was in The 'Human' Factor (1975), a revenge film directed by and starring men who already had Oscar nominations under their belts. Following that small appearance, Huston turned to directing for the next few years. It wasn't until the late 1980s that Huston directed his first made-for-television film, Mister Corbett's Ghost (1987). Based on a novella by Leon Garfied, the film starred such screen legends as Paul Scofield and Burgess Meredith. It is also notable for being the final acting project of Huston's father John, who spent his final years assisting his children in their own budding film careers. Shortly before his death, John helped produce his son's first feature length film, Mr. North (1988). The film was directed by Huston, and included his half-sister Anjelica in the cast, as well as Virginia Madsen, whom Huston would marry for a few years. Huston followed this up with the sexual drama Becoming Colette (1991), starring Klaus Maria Brandauer, and the horror film The Maddening (1995), starring Burt Reynolds. Neither film made a huge impact, and it was around this time, twenty years after his last acting role, that Huston returned to appearing in front of the camera. Starting modestly as a barman in the highly acclaimed Leaving Las Vegas (1995), Huston followed up with a supporting role in Anna Karenina (1997), alongside such would-be thespians as Sean Bean, Sophie Marceau, and Alfred Molina. The film was unfortunately a flop, as were Huston's next few film roles. In 2000, however, the tide finally turned, and Huston was able to break out as an established character actor. Re-uniting with his Anna Karenina director, Bernard Rose, Huston starred in the small-budget film Ivansxtc (2000), which was an adaptation of a book by Leo Tolstoy. While not a financial triumph, the film received very positive reactions from critics. The same fate awaited the film Hotel (2001), which included Huston in a diverse cast which included Lucy Liu, Rhys Ifans, Salma Hayek, and John Malkovich. It was also around this time that Huston met and married his second wife, Katie Jane Evans, though this marriage would end in great tragedy several years later. For now, though, Huston's career as an actor was just getting started. It was 21 Grams (2003) which secured Huston his first bona fide financial and critical success. Starring such names as Sean Penn and Benicio Del Toro, the film follows a non-linear storyline dealing with the lives of several people who are affected by an automobile accident. Huston followed up this success by appearing in John Sayle's Silver City (2004), the controversial feature film Birth (2004), and Martin Scorsese's wildly successful film about Howard Hughes known as Aviator (2004). Nominated for many awards, the film was also a success financially. But nothing Huston had done up to this point would equal to what he did next. John Hillcoat's Australian western The Proposition (2005) is a very dark film set mostly in a small community in the Australian Outback during the 19th century. A criminal is dispatched by the local law enforcement to hunt down his older brother, Arthur Burns, and kill him. As played by Huston, Burns is a psychopath who cares nothing for the various rapes and murders that he has committed. He does, however, find some chasm of his heart to enjoy music, poetry, and the glorious beauty of the Australian sunsets. This layered performance as the film's villain arguably ranks as Huston's greatest performance to date. That same year, Huston played in the highly acclaimed film The Constant Gardener (2005), which tackled corruption, love, and humanitarian efforts by the West in Africa. Huston moved from Oscar-winning film to Oscar-winning film the following year with the films Marie Antoinette (2006) and Children of Men (2006). In the former, Huston portrays the Holy Roman Emperor, Joseph II, as a cautious and thoughtful monarch who warns Marie Antoinette of her excessive lifestyle. He proves to be prophetic when the French mobs storm the Bastille and launch a revolution. In the latter film, set in a dystopian world of global human infertility, Huston portrays Nigel, a government official who uses his position to preserve famous artwork. Both films were highly successful, and further cemented Huston as a noted actor. Huston proceeded to play Orson Welles in the thriller Fade to Black (2006), and also acted in the financially successful war film The Kingdom (2007) and the poorly received The Number 23 (2007). From this point onward, Huston would appear in many films, portraying characters of various importance. Among the more noted examples would be the superhero film X-Men Origins: Wolverine (2009), where Huston played the villainous role of William Stryker, the man who imprisons Wolverine and is responsible for his experimentation with adamantium. Huston also portrayed the Greek god Poseidon in Clash of the Titans (2010), as well as its sequel two years later. Whether the crime film Edge of Darkness (2010), the historical epic Robin Hood (2010), the biographical Hitchcock (2012), or the comedy 2 Jacks (2012) (which was another adaptation of Leo Tolstoy's work, again directed by Bernard Rose and also starred Huston's nephew Jack Huston ), Huston has constantly showed his range of accents, characters, and genres. More recently, Huston has continued to appear in films, including the upcoming Tim Burton -directed biopic Big Eyes (2014) and \"Frankenstein\", which will once again reunite him with Bernard Rose. Huston has also moved into the world of television with such series as \"Magic City\" (which earned him a Golden Globe nomination), \"American Horror Story\", and \"Masters of Sex\". As busy and talented as he always has been through nearly four decades of work in the film industry, Danny Huston continues to work as one of Hollywood's veteran character actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MTk4NDA0NjZeQTJeQWpwZ15BbWU3MDQ5NzIzNTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0396812","name":"Danny Huston","idIMDB":"nm0396812"},"actorId":"nm0396812","character":"Jack Bennett","urlCharacter":"http://www.imdb.com/character/ch0158874","main":true},{"actorName":"Bojana Novakovic","urlProfile":"http://www.imdb.com/name/nm0636942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM0NDIzOTMyNV5BMl5BanBnXkFtZTcwMDk3MzU1OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1981","placeOfBirth":" Belgrade, Serbia, Yugoslavia","height":"5' 3½\" (1.61 m)","bio":"Novakovic was born on 17 November 1981 in Belgrade, Serbia, Yugoslavia. She moved to Australia in 1988, at the age of seven. Novakovic was initially interested in becoming a social worker or doctor, but after a significant set of events, she changed her mind and decided to pursue performing arts. Novakovic studied at The McDonald College in Sydney,(where she was Dux of 1999) and graduated from NIDA with a BA in Dramatic Arts in 2002. She has a younger sister, Valentina Novakovic, who is also an actress, famous for having performed in the Australian soap opera, Neighbours. In 2003, Novakovic played Randa in the ABC mini-series Marking Time, a role which won her an AFI Award for \"Best Actress in a Leading Role in a Television Drama or Comedy\". As an actor, Novakovic's film credits in Australia include Blackrock (1996), Strange Fits of Passion (1998), The Monkey's Mask (1999), Thunderstruck (2004), Solo (2005), and the Serbian movies Optimisti (2005) and Skinning (2010). From 2007 to 2009, she played Tippi in the TV series Satisfaction for Showtime Australia. Other breakout roles include: Drag Me to Hell (2009), Edge of Darkness (2009), Devil (2010), Burning Man (2011) and Generation Um(2012). Theatre credits in Australia include These People, Away and Strange Fruit at the Sydney Theatre Company; The Female of the Species at the Melbourne Theatre Company; Woyzeck (Helpmann award nomination for best supporting actress in 2009), Criminology (Green Room award nomination for best actress 2007), Eldorado (Helpmann nomination for best supporting actress, 2006) and Necessary Targets at the Malthouse Theatre in Melbourne, Death Variations and Loveplay (Ride On) for B Sharp, Romeo and Juliet with Bell Shakespeare Company and Debris for Ride On Theatre (which received a Green Room nomination for best Independent production and best actress in 2006). Novakovic also runs her own independent theatre company, Ride On Theatre Sydney and Melbourne) with co-director Tanya Goldberg. She was a producer and performer for the 2004 Ride On Theatre sell out season of LOVEPLAY at the Downstairs Belvoir Street Theatre, and the 2006 Green Room nominated production of Debris (in which she was also nominated for best actress). In 2008, she translated, adapted and directed Fake Porno in Melbourne, which was invited to be part of the Powerhouse season in Brisbane in 2009, and also received three Green Room nominations including best production. Outside of Ride On, she wrote and directed with Melbourne's Black Lung Theatre for the critically acclaimed production of Sugar at the 2007 Adelaide Fringe Festival. In 2010, Novakovic received an AFI nomination for International Award for Best Actress for her role in Edge of Darkness. Novakovic landed the part of a beautiful prostitute-turned-law-student in Fox's series, Rake, starring Greg Kinnear. The show was canceled in May, 2014. She portrayed Clare Hitchens in The Hallow, a horror film set in Ireland and directed by Corin Hardy. Earlier this year [2015], The Toronto Film Festival premiered her feature film The Little Death. Novakovic can be seen playing the lead in the ABC pilot Agatha, and has also booked a recurring role in Showtime dramedy Shameless. She's repped by CAA, Management 360, Lisa Mann Creative Management in Australia and attorney Bob Wallerstein.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM0NDIzOTMyNV5BMl5BanBnXkFtZTcwMDk3MzU1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636942","name":"Bojana Novakovic","idIMDB":"nm0636942"},"actorId":"nm0636942","character":"Emma Craven","urlCharacter":"http://www.imdb.com/character/ch0158871","main":true},{"actorName":"Shawn Roberts","urlProfile":"http://www.imdb.com/name/nm0731575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzEzMTQzOF5BMl5BanBnXkFtZTcwMjUzNDY4Mw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1984","placeOfBirth":" Stratford, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"The year 1994 marked the beginning of the career for Canadian actor Shawn Roberts. Born in Stratford, Ontario, Canada on April 2, Shawn lucked upon a life-changing break while he was portraying the part of the Wolf in a school play version of Little Red Riding Hood. Award-winning screenwriter Robert Forsyth, father of one of Shawn's friends, spotted Roberts while attending this play. Through Forsythe's efforts, Shawn was then recommended to a Toronto acting agency. He had a guest appearance on the TV series Sirènes (1993) in 1994 before landing a regular role in 1996 on the new series Émilie de la nouvelle lune (1998). Throughout the rest of the 1990s, Shawn generally remained on television, showing up on various series before striking gold with his first movie appearance. In 2000, he gained a part in the first X-Men (2000) movie, playing Rogue's boyfriend Cody. Since 2000, the career of Shawn Roberts thus balanced out appropriately well between television and film work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzEzMTQzOF5BMl5BanBnXkFtZTcwMjUzNDY4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0731575","name":"Shawn Roberts","idIMDB":"nm0731575"},"actorId":"nm0731575","character":"Burnham","urlCharacter":"http://www.imdb.com/character/ch0178111","main":true},{"actorName":"David Aaron Baker","urlProfile":"http://www.imdb.com/name/nm0048379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNDg3ODc1Nl5BMl5BanBnXkFtZTcwNzE1NTAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1963","placeOfBirth":" Durham, North Carolina, USA","bio":"David Aaron Baker was born on August 14, 1963 in Durham, North Carolina, USA. He is an actor, known for One Life to Live (1968), The Hoax (2006) and Edge of Darkness (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNDg3ODc1Nl5BMl5BanBnXkFtZTcwNzE1NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048379","name":"David Aaron Baker","idIMDB":"nm0048379"},"actorId":"nm0048379","character":"Millroy","urlCharacter":"http://www.imdb.com/character/ch0178171","main":true},{"actorName":"Jay O. Sanders","urlProfile":"http://www.imdb.com/name/nm0761587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjI5MjkwN15BMl5BanBnXkFtZTcwNjQ4MTg5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1953","placeOfBirth":" Austin, Texas, USA","birthName":"Jay Olcutt Sanders","height":"6' 4\" (1.93 m)","bio":"Jay O. Sanders was born on April 16, 1953 in Austin, Texas, USA as Jay Olcutt Sanders. He is known for his work on The Day After Tomorrow (2004), Green Lantern (2011) and JFK (1991). He has been married to Maryann Plunkett since October 1, 1991. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjI5MjkwN15BMl5BanBnXkFtZTcwNjQ4MTg5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761587","name":"Jay O. Sanders","idIMDB":"nm0761587"},"actorId":"nm0761587","character":"Whitehouse","urlCharacter":"http://www.imdb.com/character/ch0178172","main":true},{"actorName":"Denis O'Hare","urlProfile":"http://www.imdb.com/name/nm0641354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODM4NzU1NV5BMl5BanBnXkFtZTcwMTQwNzQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1962","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Denis Patrick Seamus O'Hare","height":"5' 8\" (1.73 m)","bio":"Denis O'Hare was born on January 17, 1962 in Kansas City, Missouri, USA as Denis Patrick Seamus O'Hare. He is an actor, known for Dallas Buyers Club (2013), The Proposal (2009) and Milk (2008). He has been married to Hugo Redwood since July 28, 2011. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODM4NzU1NV5BMl5BanBnXkFtZTcwMTQwNzQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641354","name":"Denis O'Hare","idIMDB":"nm0641354"},"actorId":"nm0641354","character":"Moore","urlCharacter":"http://www.imdb.com/character/ch0178215","main":true},{"actorName":"Damian Young","urlProfile":"http://www.imdb.com/name/nm0949433","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1Mzc1MDc1M15BMl5BanBnXkFtZTcwNzc5NjAyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Young was raised in Washington DC, and attended Kenyon College in Ohio. In 1984, Young moved to New York where he was a core member of the Cucaracha Theatre Company. Damian Young has performed in numerous on and off-Broadway venues, as well as notable regional theaters including The Vineyard, Playwright Horizons, Soho Rep, The Flea and The Atlantic Theater, ART, etc. His work in film and television includes regular roles on The Comeback (HBO), Californication (Showtime) and many others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1Mzc1MDc1M15BMl5BanBnXkFtZTcwNzc5NjAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0949433","name":"Damian Young","idIMDB":"nm0949433"},"actorId":"nm0949433","character":"Senator Jim Pine","urlCharacter":"http://www.imdb.com/character/ch0178170","main":true},{"actorName":"Caterina Scorsone","urlProfile":"http://www.imdb.com/name/nm0778741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxODUxNDA3Ml5BMl5BanBnXkFtZTgwMTMxODIwNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1981","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Caterina Reminy Scorsone","height":"5' 4\" (1.63 m)","bio":"Caterina Scorsone has been a professional actress since the age of eight, when she was a regular on the daytime children's program Mr. Dressup (1967) for Canada's CBC. A veteran of series television, her other series credits include Shock Treatment (2004), Les repentis (1996) and Power Play (1998), which garnered her a nomination for a Gemini Award, the Canadian equivalent of the Emmy. She starred with Vivica A. Fox in \"Missing\" (aka 1-800-Missing (2003)) (2003-6). She has also appeared in episodes of The Border (2008) and The Guard (2008). Scorsone's TV movies include My Horrible Year! (2001), directed by Eric Stoltz; Common Ground (1990); Rated X (2000), directed by Emilio Estevez; The Devil's Arithmetic (1999); and Rescuers: Stories of Courage: Two Families (1998). Her feature film credits include The Third Miracle (1999) with Ed Harris and Anne Heche; À la frontière du coeur (2001) and Strike! (2002). Born and raised in Toronto, Canada, Scorsone is the middle child in a family of five siblings that includes two older twin sisters and a younger brother and sister. She got her first taste of acting in the family living room, where her older sister would play director and all the other kids were in the cast. She completed the final credits in her studies toward an Arts and Science BA at the University of Toronto while filming Missing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxODUxNDA3Ml5BMl5BanBnXkFtZTgwMTMxODIwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0778741","name":"Caterina Scorsone","nicknames":["Cat","Kitten"],"idIMDB":"nm0778741"},"actorId":"nm0778741","character":"Melissa","urlCharacter":"http://www.imdb.com/character/ch0178216","main":true},{"actorName":"Frank Grillo","urlProfile":"http://www.imdb.com/name/nm0342029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTk3Nzc4OF5BMl5BanBnXkFtZTcwNDcwNTA1Mw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1965","placeOfBirth":" New York City, New York, USA","birthName":"Frank Anthony Grillo","height":"5' 10½\" (1.79 m)","bio":"The oldest of three children, Frank Grillo was born in New York City, to an Italian-American family. He grew up in upstate New York, and got his first taste of acting in high school where he was in many plays. Frank was also a gifted athlete and his dream was to play sports professionally. Frank graduated from New York University with a business degree.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTk3Nzc4OF5BMl5BanBnXkFtZTcwNDcwNTA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342029","name":"Frank Grillo","nicknames":["Kiki"],"idIMDB":"nm0342029"},"actorId":"nm0342029","character":"Agent One","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wayne Duvall","urlProfile":"http://www.imdb.com/name/nm0245145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDkzNzUzMF5BMl5BanBnXkFtZTcwNzExNzIzNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1958","placeOfBirth":" Silver Spring, Maryland, USA","height":"5' 11\" (1.8 m)","bio":"Wayne Duvall was born on May 29, 1958 in Silver Spring, Maryland, USA. He is an actor, known for Prisoners (2013), O Brother, Where Art Thou? (2000) and Apollo 13 (1995). He has been married to Denise Guillet since 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDkzNzUzMF5BMl5BanBnXkFtZTcwNzExNzIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0245145","name":"Wayne Duvall","idIMDB":"nm0245145"},"actorId":"nm0245145","character":"Chief of Police","urlCharacter":"http://www.imdb.com/character/ch0178217","main":true},{"actorName":"Gbenga Akinnagbe","urlProfile":"http://www.imdb.com/name/nm1782153","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODgzODU3MV5BMl5BanBnXkFtZTcwMzY4NjMyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1978","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 10\" (1.78 m)","bio":"Gbenga Akinnagbe was born on December 12, 1978 in Washington, District of Columbia, USA. He is an actor and producer, known for The Taking of Pelham 123 (2009), The Savages (2007) and Independence Day: Resurgence (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODgzODU3MV5BMl5BanBnXkFtZTcwMzY4NjMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1782153","name":"Gbenga Akinnagbe","idIMDB":"nm1782153"},"actorId":"nm1782153","character":"Detective Darcy Jones","urlCharacter":"http://www.imdb.com/character/ch0178168","main":true},{"actorName":"Gabrielle Popa","urlProfile":"http://www.imdb.com/name/nm3225449","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Mzc0NjU4M15BMl5BanBnXkFtZTgwMDIwNDc4ODE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Gabrielle Popa is an actress, known for Edge of Darkness (2010), Whaling City (2011) and War Flowers (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Mzc0NjU4M15BMl5BanBnXkFtZTgwMDIwNDc4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3225449","name":"Gabrielle Popa","idIMDB":"nm3225449"},"actorId":"nm3225449","character":"Young Emma","urlCharacter":"http://www.imdb.com/character/ch0158871","main":true},{"actorName":"Paul Sparks","urlProfile":"http://www.imdb.com/name/nm0817027","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWJmYjA0MTktZDQwMS00ZmY0LWE2YzAtYmJmNGViZTdiNzhkXkEyXkFqcGdeQXVyMjEyMjE1NDI@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1971","placeOfBirth":" Lawton, Oklahoma, USA","height":"6' 1\" (1.85 m)","bio":"Paul Sparks was born on October 16, 1971 in Lawton, Oklahoma, USA. He is an actor, known for Mud (2012), Boardwalk Empire (2010) and Midnight Special (2016). He is married to Annie Parisse. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWJmYjA0MTktZDQwMS00ZmY0LWE2YzAtYmJmNGViZTdiNzhkXkEyXkFqcGdeQXVyMjEyMjE1NDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0817027","name":"Paul Sparks","idIMDB":"nm0817027"},"actorId":"nm0817027","character":"Northampton Police Detective","urlCharacter":"http://www.imdb.com/character/ch0178169","main":true}],"seasons":[],"idIMDB":"tt1226273","urlIMDB":"http://www.imdb.com/title/tt1226273","business":{"budget":{"money":"$80,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$17,214,384","country":"USA","day":"31","month":"01","year":"2010","remarks":"3,066 Screens"},{"money":"£1,172,927","country":"UK","day":"31","month":"01","year":"2010","remarks":"423 Screens"}],"gross":[{"money":"$43,290,977","country":"USA","day":"04","month":"04","year":"2010","remarks":""},{"money":"$43,196,271","country":"USA","day":"28","month":"03","year":"2010","remarks":""},{"money":"$43,076,392","country":"USA","day":"21","month":"03","year":"2010","remarks":""},{"money":"$42,841,499","country":"USA","day":"07","month":"03","year":"2010","remarks":""},{"money":"$42,170,286","country":"USA","day":"28","month":"02","year":"2010","remarks":""},{"money":"$40,347,222","country":"USA","day":"21","month":"02","year":"2010","remarks":""},{"money":"$28,947,851","country":"USA","day":"07","month":"02","year":"2010","remarks":""},{"money":"$17,214,384","country":"USA","day":"31","month":"01","year":"2010","remarks":""},{"money":"£2,651,278","country":"UK","day":"07","month":"02","year":"2010","remarks":""},{"money":"£1,172,927","country":"UK","day":"31","month":"01","year":"2010","remarks":""}],"weekendGross":[{"money":"$37,260","country":"USA","day":"04","month":"04","year":"2010","remarks":"126 Screens"},{"money":"$111,213","country":"USA","day":"28","month":"03","year":"2010","remarks":"208 Screens"},{"money":"$23,484","country":"USA","day":"21","month":"03","year":"2010","remarks":"53 Screens"},{"money":"$289,242","country":"USA","day":"07","month":"03","year":"2010","remarks":"483 Screens"},{"money":"$1,017,209","country":"USA","day":"28","month":"02","year":"2010","remarks":"1,255 Screens"},{"money":"$2,243,311","country":"USA","day":"21","month":"02","year":"2010","remarks":"2,118 Screens"},{"money":"$6,855,371","country":"USA","day":"07","month":"02","year":"2010","remarks":"3,066 Screens"},{"money":"$17,214,384","country":"USA","day":"31","month":"01","year":"2010","remarks":"3,066 Screens"},{"money":"£768,013","country":"UK","day":"07","month":"02","year":"2010","remarks":"412 Screens"},{"money":"£1,172,927","country":"UK","day":"31","month":"01","year":"2010","remarks":"423 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"18","month":"08","year":"2008","remarks":null},null],"copyrightHolder":"©2010 GK FILMS, LLC. ALL RIGHTS RESERVED."},"technical":{"runtime":["1 hr 57 min (117 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["DeLuxe, New York (NY), USA (processing)","Technicolor (color)","Technicolor Creative Services (digital intermediate)","Technicolor Digital Intermediates (digital intermediate)"],"filmLength":["3,181 m (Portugal, 35 mm)","3,185 m (Sweden)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.6","metascore":"55","filmingLocations":[{"location":"68 Bradfield Ave, Boston, Massachusetts, USA"}],"rated":"R","awards":[{"award":"Australian Film Institute 2010","titlesAwards":[{"titleAwardOutcome":"Nominated AFI International Award","categories":[{"category":"Best Actress","names":[{"name":"Bojana Novakovic","id":"nm0636942","role":null}]}]}]}],"votes":"78,057","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0209646","name":"GK Films"},{"idCompany":"co0103694","name":"BBC Films"}],"keywords":{"keywords":["activist","vigilantism","father daughter relationship","investigation","detective","death","evidence","government","murder","single father","cover up","corruption","conspiracy","homicide detective","neo noir","reference to nancy pelosi","reference to hillary clinton","reference to george w. bush","reference to bill clinton","reference to diogenes","remake","hit with a door","assassination","suicide by cop","framed","shot multiple times","shaving","sleeping in a car","breaking a window","glass block window","driving in the rain","fire in 55 gallon drum","swat team","picking a lock","scattering cremated ashes","lock of hair","murder of daughter","scissors","morgue","man crying","vomiting blood","raining","eurocopter as350 squirrel","no opening credits","remake by original director","veteran","three word title","policeman","police officer","pistol","home video","handgun","gun","shot in the neck","news reporter","train station","threatened with a knife","stalking","shot through a window","shot in the throat","shot in the side","shot in the leg","shot in the hand","shot in the forehead","shot in the face","shot in the eye","severed leg","punched in the stomach","murder of a police officer","police detective","photograph","milk","latin","knocked out","held at gunpoint","handcuffs","flashback","evil corporation","wine","deception","death of protagonist","corpse","coma","cigar smoking","burning clothing","violence","betrayal","beating","beach","ash scattering","arrest","radiation poisoning","ginger ale","geiger counter","blood splatter","blood on floor","blood on face","videotape","shot in the chest","senator","ruthlessness","radioactivity","punched in the face","poison","nuclear weapons","nosebleed","memory","illegal operation","hidden truth","death of daughter","company","car crash","british man","boston massachusetts","blood","being followed","shot to death","shot in the head","shootout","revenge","nurse","news report","mysterious man","loss of daughter","hospital","hit by a car","hallucination","dead body","corrupt politician","remake of tv show","based on tv series"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:57:13"}}