{"data":{"movies":[{"title":"Ip Man 2","originalTitle":"Yip Man 2","year":"2010","releaseDate":"20100429","directors":[{"name":"Wilson Yip","id":"nm0948159"}],"writers":[{"name":"Tai-lee Chan","id":"nm5335213"},{"name":"Hiu-Yan Choi","id":"nm5540383"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MjY1NzMxOF5BMl5BanBnXkFtZTcwNzQ1NTcxNA@@._V1.jpg","countries":["Hong Kong","China"],"languages":["Cantonese","Mandarin","English"],"genres":["Action","Biography","Drama","History","Sport"],"plot":"Ip Man 2 is a 2010 Hong Kong biographical martial arts film loosely based on the life of Ip Man, a grandmaster of the martial art Wing Chun. A sequel to the 2008 film Ip Man, the film was directed by Wilson Yip, and stars Donnie Yen, who reprises the leading role. Continuing after the events of the earlier film, the sequel centers on Ip's movements in Hong Kong, which is under British colonial rule. He attempts to propagate his discipline of Wing Chun, but faces rivalry from other practitioners, including the local master of Hung Ga martial arts.","simplePlot":"Centering on Ip Man's migration to Hong Kong in 1949 as he attempts to propagate his discipline of Wing Chun martial arts.","actors":[{"actorName":"Donnie Yen","urlProfile":"http://www.imdb.com/name/nm0947447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzA0MDk0M15BMl5BanBnXkFtZTcwMTc2MjM1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1963","placeOfBirth":" Canton, China","birthName":"Zhen Zidan","height":"5' 8\" (1.73 m)","bio":"Martial artist and Hong Kong action star Donnie Yen was born to newspaper editor Klyster Yen and martial arts master Bow Sim Mark. At the age of four Yen started taking up martial arts from his mother, who taught him wushu and tai chi until the age of eleven when his family emigrated to Boston, MA. From there he continued mastering wushi and tai chi. But after developing a huge interest in martial arts he eventually began getting into various others martial art styles, such as taekwondo, kick-boxing, boxing, karate etc. When Yen was sixteen his parents sent him to Beijing Wushu Academy so he could train Chinese martial arts under Master Wu Bin, well known as the coach of Jet Li. He underwent intensive training for three years. After three years Yen was about to leave back to the US but made a side trip to Hong Kong. There he was accidentally introduced to famous Hong Kong action film-maker Woo-Ping Yuen, who was responsible for bringing Jackie Chan to super stardom and was looking for someone new to star in his films. Yen was offered a screen test - which he passed - and thereafter a 4-picture deal. Yen started out with stunt doubling duty on the magical martial arts film The Miracle Fighters (1982). From there he starred in his first film, Drunken Tai Chi (1984) at the age of 19. He continued his early film career working independently with Woo-Ping Yuen and also applied for acting lessons as well as roles in TV series at TVB to gain more acting experience. He started getting a bit of attention in the late 1980s and mid 1990s, after he was offered a contract by D&B Films Co's Dickson Poon. Poon gave Yen major roles in the action films Tiger Cage (1988), In the Line of Duty 4 (1989) and Tiger Cage 2 (1990), which became cult classics after their initial releases. These films eventually spread outside the Hong Kong film circuit and gave Yen a good reputation as a formidable onscreen action performer. But after a while, the company did not do well and in the end went bankrupt. This left Yen with no choice but to go back to TVB as well as venture into low-budget film-making making films, such as Crystal Hunt (1991) and Revenge of the Cheetah (1992). But the misfortune didn't last long. Famous director Hark Tsui had just made a successful attempt to revive the kung fu genre with Once Upon a Time in China (1991) which starred Jet Li. For the sequel La secte du lotus blanc (1992) Hark was looking for someone to play the new nemesis. Through Yen's early films and his rep as one of the most effective pound-for-pound on-screen fighters in Hong Kong, Hark became fascinated and decided to approach, discuss, and eventually cast him in the role of General Lan. The film became a turning point in Yen's career and his two fight scenes with Jet Li revolutionized the standards of Hong Kong martial arts choreography at the time, and are still regarded as among the best fight scenes ever created in Hong Kong film history. Another acclaim by critics and movie goers was Yen's acting performance. It was so outstanding that he was nominated for \"Best Supporting Actor\" at the 1992 Hong Kong Film Awards. After the excellent showcase, Yen starred in other successful and classic films, such as L'auberge du dragon (1992) for director Raymond Lee and Butterfly and Sword (1993) by Michael Mak. But he still continued to work with Woo-Ping Yuen on films including Heroes Among Heroes (1993), Iron Monkey (1993) and Wing Chun (1994). But after creative differences between them became apparent, both of them decided it was best to work on their own so they ended up going separate ways and haven't collaborated with each other ever since. During this period Yen got into TV and worked on a couple of series for ATV as actor and action director. The first was The Kung Fu Master (1994) which depicted the life of martial arts legend Hung Hei-Kwan. The TV series was a big success and Yen continued the success by action directing and starring in the second successful series; Fist of Fury (1995). It retold the story of Chen Zhen, the character made famous by Bruce Lee in the original 1972 film classic with the same title. Aside the TV work, he was offered roles by prolific director/producer Jing Wong in films such as The Saint of Gamblers (1995) and got other offers which includes Circus Kids (1994) where he co-starred with action star Biao Yuen, and High Voltage (1994) which was shot in the Philippines. In 1996 - after fulfilling his contract deal with Wong Jing and returning deposit money to refuse making more films for him - Yen signed with the independent film company My Way Film Co. This became another turning point in his career in that he started learning directing and experimenting with film cameras. In 1997, he finally made his directorial debut with Legend of the Wolf (1997) and had created a different style of martial arts choreography. The film made a huge impact within fan communities around the world for its' daring, braving, and fresh attempt of accomplishing something new for the then dying martial arts action genre in Hong Kong. There was and still is a mixture of people both admiring and looking down on this particular style. Yen continued to work as lead actor/director/action director on films such as Ballistic Kiss (1998), Shanghai Affairs (1998). In 1999, he decided to try something different and ended up flying to Germany to work on the local TV film Der Puma - Kämpfer mit Herz: La loi du Puma (1999) and its' TV series counterpart. In 2000, things took a turn for Yen once again when US-based film company Dimension Films called and offered him a major role in Highlander: Endgame (2000) as the immortal Jin Ke, making it his US debut. But sadly the film didn't perform well at the box-office and many fans consider it to be a part of its' own franchise. Nevertheless, Yen's fan-base consider his action scenes to be highlights of the film; especially his duel with Adrian Paul. To Dimension Films' credit though, offers followed shortly afterward. Yen was invited to work behind the camera on The Princess Blade (2001) for Japanese director Shinsuke Sato and Blade II (2002) by Guillermo del Toro, the latter of which he also appeared in as the mute vampire Snowman. In 2002 and 2003 respectively, Yen's career further progressed after he took on two memorable roles. Firstly, highly acclaimed Chinese director Yimou Zhang offered Yen the part of assassin Sky in Hero (2002) starring Jet Li and resulted in one of the most anticipated Chinese films of 2002 which eventually became a mega hit around Asia. Secondly, director David Dobkin casted him alongside Jackie Chan as the traitorous Wu Chow in Shanghai Knights (2003), the sequel to Shanghai Noon (2000). This film marked the first time Yen worked with Chan in his career. Both of these collaborations gave Yen more recognition in the US and in Hong Kong, which in turn gave him more opportunities as an actor and action director. In the same year Yen decided to put hold of pursuing a career in Hollywood and flew back to Hong Kong to find quality work. Through his good friend and Hong Kong cinema expert Bey Logan he signed up as action director for Vampire Effect (2003), produced by Emperor Multimedia Group Co. (EMG) and starring the pop stars Gillian Chung and Charlene Choi with in a cameo appearance by Jackie Chan. The film earned him a nomination for \"Best Action Design\" at the 2003 Hong Kong Film Awards as well as the 2003 Golden Horse Awards, both of which he won prices for. He continued to work on few films after that, including Black Rose Academy (2004) as director and action director, and Blade of Kings (2004) as actor where he once again worked with Jackie Chan on an anticipated fight scene which was satisfying enough for fans to see. Later on in 2004 Yen's career took a totally different turn when Hark Tsui offered him a leading role in Seven swords (2005) which was an adaptation of a lengthy novel written by Liang Yu-Sheng about seven warriors and their mystical swords. Despite the disappointing box-office reception when it was released locally, the film was nonetheless a great showcase for Yen as an actor and action performer unlike anything he did previously in his career. Around the same time, Yen also teamed up with acclaimed Hong Kong director Wilson Yip and together they made the highly anticipated crime drama S.P.L. (2005). The film was remarkable in that it successfully combined strong acting and unique storytelling/visuals with groundbreaking martial arts action. This concept went on to become favored by action film fans and Hong Kong Cinema fans in general after its' release. Yen's way of shooting martial arts action - which was nothing like people had already seen - earned him a nomination and a price at the 2005 Hong Kong Film Awards for \"Best Action Design\". The movie also led to a trend of similar Hong Kong action films where storytelling/visuals along with hard-hitting action scenes were to be highlighted as much as possible. After the success, Yen and Yip teamed up immediately for more projects which includes the comic book adaptation Dragon Tiger Gate (2006) and the hard-hitting action drama Flashpoint (2007), both of which were very successful at the box-office and within fan communities globally. These accomplishments made people regard Yen as the new pinnacle of Hong Kong martial arts/action films. Yen both earned the \"Best Action Design\" nomination at the 2006 Hong Kong Film Awards as well as the \"Best Action Direction\" nomination at 2006 Golden Bauhinia Awards for Dragon Tiger Gate (2006). He won a price for the latter while he was awarded for his action design on Flashpoint (2007) at both the 2007 Golden Bauhinia Awards and the 2007 Hong Kong Film Awards. From there on Yen continued to work as a lead actor and also developed an interest in improving his acting skills. He got a leading role in the battle epic Kingdom of War (2008), directed by acclaimed Hong Kong action director Siu-Tung Ching, which was a big success in Mainland China. He continued work starring in the supernatural romance film Painted Skin (2008) by Gordon Chan. Then he starred in the martial arts biopic Ip Man (2008) helmed by Wilson Yip. This film was based on the life of one of Bruce Lee's wing chun teachers, Yip Man. The film became a sensational mega success all over Asia and people within the Hong Kong film industry started taking note after Wilson Yip's matured style of film-making, Sammo Hung's fresh martial arts choreography which many action film fans consider to be a redefinition of Hung's career as action director. But most impressive about the film for the audiences and critics was Yen's acting performance. During production, people had been very skeptical about Yen being the choice for the Yip Man role. But when the film was released, all pressure from the cast and crew were gone and people eventually went on to praise Yen for his portrayal of Yip Man. The success of the film also led to other successful directors and producers approaching Yen and giving him offers to work in front of the camera. Through his progression in the Hong Kong film industry from the start - when he was just like other action performers in Hong Kong trying to make a name for themselves - to nowadays as arguably among the most offering leading Hong Kong actors and the most promising action director, as long as Donnie Yen is still active in film-making (whether working in front of or behind the camera), he will almost certainly break new grounds and create more innovative concepts of action choreography for the martial arts action genre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzA0MDk0M15BMl5BanBnXkFtZTcwMTc2MjM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0947447","name":"Donnie Yen","nicknames":["Dan Yeh"],"idIMDB":"nm0947447"},"actorId":"nm0947447","character":"Ip Man","urlCharacter":"http://www.imdb.com/character/ch0143340","main":true},{"actorName":"Xiaoming Huang","urlProfile":"http://www.imdb.com/name/nm2119781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU2MzA5ODQ2NV5BMl5BanBnXkFtZTgwMjE4OTE0MzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1977","placeOfBirth":" Qingdao, Shandong Province, China","height":"5' 10¾\" (1.8 m)","bio":"Xiaoming Huang was born on November 13, 1977 in Qingdao, Shandong Province, China. He is an actor and producer, known for Ip Man 2 (2010), American Dreams in China (2013) and The Return of the Condor Heroes (2006). He has been married to Angelababy since May 27, 2015. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU2MzA5ODQ2NV5BMl5BanBnXkFtZTgwMjE4OTE0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2119781","name":"Xiaoming Huang","idIMDB":"nm2119781"},"actorId":"nm2119781","character":"Wong Shun-Leung","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sammo Kam-Bo Hung","urlProfile":"http://www.imdb.com/name/nm0005033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTM3MzM4MzVeQTJeQWpwZ15BbWU3MDIzNjM3NzQ@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1952","placeOfBirth":" Hong Kong, British Crown Colony","birthName":"Hung Kam-Bo","height":"5' 7\" (1.7 m)","bio":"Born in Hong Kong, Sammo Hung's acting career began while he was training in acrobatics, martial arts and dance as a child at the China Drama Academy, and he received acclaim for his performance with a troupe called \"The Seven Little Fortunes.\" He made his feature film debut as an actor at the age of 12, and has worked in numerous martial arts films as an actor, director, producer and/or choreographer, collaborating with Bruce Lee and Jackie Chan, two superstars of the genre. He is now internationally renowned as a pioneer and trend-setter in Hong Kong action films. Hung's big break as a film actor came with a role as a sparring partner in the Bruce Lee film Opération dragon (1973). He established his reputation as a skilled physical comedian in several kung-fu comedies, beginning with \"Enter the Fat Dragon\" (Enter the Fat Dragon (1978)). He also produced and starred in numerous successful films throughout the 1970s and 1980s for Hong Kong's leading film studio, Golden Harvest. Hung collaborated in the 1980s with long-time friend Jackie Chan in a highly successful series of action comedies that cemented Hung's reputation as a consummate actor/director and launched Chan's career as an international star. For a while, Hung also starred in an American TV series, Martial Law (1998). He directed Once Upon a Time in China and America (1997), his first film shot in the US. He and his wife, Mina, now divide their time between homes in Hong Kong and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTM3MzM4MzVeQTJeQWpwZ15BbWU3MDIzNjM3NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005033","name":"Sammo Kam-Bo Hung","nicknames":["Yuen Chu","Big Brother"],"idIMDB":"nm0005033"},"actorId":"nm0005033","character":"Master Hung Chun-Nam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lynn Hung","urlProfile":"http://www.imdb.com/name/nm3237713","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTAyMzQ2Ml5BMl5BanBnXkFtZTcwMzIwNzMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1981","placeOfBirth":" Nanjing, Jiangsu, China","birthName":"Xiong Dai Ling","height":"5' 10\" (1.78 m)","bio":"Lynn Hung was born on October 10, 1981 in Nanjing, Jiangsu, China as Xiong Dai Ling. She is an actress, known for Ip Man (2008), Ip Man 2 (2010) and Ip Man 3 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTAyMzQ2Ml5BMl5BanBnXkFtZTcwMzIwNzMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3237713","name":"Lynn Hung","idIMDB":"nm3237713"},"actorId":"nm3237713","character":"Cheung Wing-Sing","urlCharacter":"http://www.imdb.com/character/ch0528402","main":true},{"actorName":"Kent Cheng","urlProfile":"http://www.imdb.com/name/nm0155587","urlPhoto":"","biography":{"dateOfBirth":"22 May 1951","placeOfBirth":"","birthName":"Kent Cheng Juk-Si","bio":"Kent Cheng was born on May 22, 1951 as Kent Cheng Juk-Si. He is an actor and director, known for Ip Man 2 (2010), Once Upon a Time in China (1991) and Crime story (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0155587","name":"Kent Cheng","idIMDB":"nm0155587"},"actorId":"nm0155587","character":"Fatso","urlCharacter":"http://www.imdb.com/character/ch0528403","main":true},{"actorName":"Darren Shahlavi","urlProfile":"http://www.imdb.com/name/nm0004540","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjEzNjk5Nl5BMl5BanBnXkFtZTYwNTM3MTgy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1972","placeOfBirth":" Stockport, Cheshire, England, UK","birthName":"Darren Majian Shahlavi","height":"5' 11\" (1.8 m)","bio":"Darren Shahlavi started his training at the age of 7. He traveled to Hong Kong where he began his movie career, mostly as an actor, stunt double and later as a villain in the early 1990s. Later he made the step from Hong Kong to Western cinema. His resume is growing and now he has had the opportunity to be a good guy. Besides being an actor, he was also a bodyguard for some of Hollywood's greatest stars, such as Patrick Stewart and Bruce Willis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjEzNjk5Nl5BMl5BanBnXkFtZTYwNTM3MTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004540","name":"Darren Shahlavi","nicknames":["Daz","Dash"],"idIMDB":"nm0004540"},"actorId":"nm0004540","character":"Mr. Miller / Twister","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yu-Hang To","urlProfile":"http://www.imdb.com/name/nm3253626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzVjZGE1Y2QtNGQ4MC00NzcxLWJiNjItMzQwYTA2OTE0OGMxL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1981","placeOfBirth":" Hong Kong, British Crown Colony","height":"5' 9¾\" (1.77 m)","bio":"Yu-Hang To was born on January 1, 1981 in Hong Kong, British Crown Colony. He is an actor, known for Ip Man (2008), The Legend Is Born: Ip Man (2010) and Ip Man 2 (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzVjZGE1Y2QtNGQ4MC00NzcxLWJiNjItMzQwYTA2OTE0OGMxL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3253626","name":"Yu-Hang To","idIMDB":"nm3253626"},"actorId":"nm3253626","character":"Cheng Wai-Kei","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Mayer","urlProfile":"http://www.imdb.com/name/nm1885544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3ODUwOTQ2OF5BMl5BanBnXkFtZTgwODM1MzAxMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1970","placeOfBirth":" Tidworth, Hampshire, England, UK","bio":"Charles served in the British Army 1991-2002, an officer in The Welsh Guards. He left the army to be an actor, and was accepted into Guildhall School of Music & Drama, where he received BA (Hons) Acting. He has lived in England, Kenya, Northern Ireland, China and Australia. His sons are Theodore (2012) and Harlequin (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3ODUwOTQ2OF5BMl5BanBnXkFtZTgwODM1MzAxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1885544","name":"Charles Mayer","nicknames":["Charlie"],"idIMDB":"nm1885544"},"actorId":"nm1885544","character":"Superintendent Wallace","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ka-nin Ngo","urlProfile":"http://www.imdb.com/name/nm2350173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzMTE1YjgtNzFkOS00NzcwLWJlMWUtODg0NWQ5Y2E4ZWU4L2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1976","placeOfBirth":" Hong Kong, British Crown Colony","bio":"Ka-nin Ngo was born on September 26, 1976 in Hong Kong, British Crown Colony. He is an actor, known for Ip Man 2 (2010), Ghost Dragon of Cold Mountain (2014) and Kan kwok hiu hung chi Yee hoi ho ching (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzMTE1YjgtNzFkOS00NzcwLWJlMWUtODg0NWQ5Y2E4ZWU4L2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2350173","name":"Ka-nin Ngo","idIMDB":"nm2350173"},"actorId":"nm2350173","character":"Leung Kan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Calvin Ka-Sing Cheng","urlProfile":"http://www.imdb.com/name/nm3841713","urlPhoto":"","biography":{"bio":"Calvin Ka-Sing Cheng is an actor, known for Ip Man (2008), Ip Man 2 (2010) and Le roi singe (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3841713","name":"Calvin Ka-Sing Cheng","idIMDB":"nm3841713"},"actorId":"nm3841713","character":"Chow Kong-Yiu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siu-Wong Fan","urlProfile":"http://www.imdb.com/name/nm0266658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NjkzMjg0NjNeQTJeQWpwZ15BbWU3MDQzNTA5MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1973","placeOfBirth":" Hong Kong, China","height":"5' 9¾\" (1.77 m)","bio":"Siu-Wong Fan was born in Hong Kong in 1973, the son of 1970s kung fu film actor Mei-Sheng Fan. At the age of 14, Siu-Wong traveled to Xushou on the request of his father to take up martial arts because he was virtually a toothpick. There, Siu-Wong studied gymnastics, kung fu, and taekwondo. Fan made his film debut as a teen in Zhi fa xian feng (1986), aka Righting Wrongs, alongside Biao Yuen, Cynthia Rothrock, and Corey Yuen. However, his breakout role came in 1991 when he starred as the titled character in Lik wong (1991), aka The Story of Ricky. By then, Siu-Wong has emerged into a true action star with the muscles to match. He continues to work in films today, although they are not exactly the big Hong Kong blockbusters everyone goes out to see.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NjkzMjg0NjNeQTJeQWpwZ15BbWU3MDQzNTA5MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0266658","name":"Siu-Wong Fan","idIMDB":"nm0266658"},"actorId":"nm0266658","character":"Jin Shan Zhao / Kam Shan-Chau","urlCharacter":"http://www.imdb.com/character/ch0143342","main":true},{"actorName":"Simon Yam","urlProfile":"http://www.imdb.com/name/nm0945189","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDUyNDEzMl5BMl5BanBnXkFtZTcwMTk4NjAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Hong Kong","height":"5' 11\" (1.8 m)","bio":"Simon Yam was born 19 March, 1955, also known as Yam Tat-wah, is a veteran Hong Kong-based actor and film producer. He started off as a supermodel before becoming an actor in the mid 1970s. He then signed with the Hong Kong television network TVB, starring and co-starring in a number of television series prior to \"apply his trades\" in the film industry in 1987. His elder brother is Yam Tak-wing, a retired former Deputy Commissioner of Hong Kong Police. In 1989, he starred in the Japanese-Hong Kong co-production of Bloodfight (1989). This was the first of its kind in which English was spoken throughout the entire film. In 1992, Yam gained critical acclaim for his role as the maniacal Judge in the crime film Full Contact (1992), where he faced off in a bloody battle against Yun-Fat Chow's character. In 1993, he starred as \"Dhalsim\" in the action-comedy film Future Cops (1993), a parody of Street Fighter directed by Jing Wong. In 1996, Yam began his role as Chiang Tin-Sung, the leader of the Hung Hing triads in the first three installments of the Young and Dangerous (1996) film series. In 2000, Yam starred as Cheung-sun, the progenitor of all vampires, in the television series Ngo wo geun see yau gor yue wui II (2000), produced by ATV. In 2003, Yam made his Hollywood film debut in Lara Croft Tomb Raider: The Cradle of Life (2003) as Shaolin crime lord. Yam received international acclaim for his performances in international film festival hits and box offices such as Naked Killer (1992), S.P.L. (2005), Election (2005), Triad Election (2006), Exilé (2006), Lara Croft Tomb Raider: The Cradle of Life (2003), The Thieves (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDUyNDEzMl5BMl5BanBnXkFtZTcwMTk4NjAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0945189","name":"Simon Yam","idIMDB":"nm0945189"},"actorId":"nm0945189","character":"Chow Ching-Chuen","urlCharacter":"http://www.imdb.com/character/ch0530256","main":true},{"actorName":"Christian 'Kang' Bachini","urlProfile":"http://www.imdb.com/name/nm3985011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjgwMDM2N15BMl5BanBnXkFtZTcwNDgzMTI2NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Italy's first martial arts action star Christian Bachini, growing up watching Hong Kong martial arts films and inspired by his childhood idols such as Jackie Chan and the late great Bruce Lee, determined to make an impact on the martial arts genre, left everything behind and moved to China in 2009 to write his own legacy in action cinema. As a professional actor combined with over 14 years of training in traditional kung fu, modern wushu, extreme martial arts, Tae Kwon Do, Capoeira, and many other combat styles, after starring in several independent action movies produced by local production houses and his experience acting on the set of the Hong Kong action hit film, Ip Man 2, Christian begins to launch a new wave for the action genre in Shanghai. Incorporating stylized and visual dazzling Asian martial arts with western fighting styles as well as extreme martial arts, parkour, Jujitsu, and Capoeira, he gave birth to a new mix of fighting arts. His Star Vehicle short movie Kang: The New Legend Begins (2010), written and directed by Richard Chung, represented his most recent victory as it won the \"Best Action Sequence Martial Arts Short\" award at the \"Action On Film International Film Festival 2010\" in Pasadena, California. To match with his strong self confidence and never say die attitude, Christian adopted the name \"Kang\" which means \"to counter and resist\" in Chinese, to show his dedication and determination to create a new action style that showcase the efficient and hard hitting Western style of fighting with Chinese kung fu's visually impressive fight choreography that uses no wires, stunt doubles, or use of CGI.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjgwMDM2N15BMl5BanBnXkFtZTcwNDgzMTI2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3985011","name":"Christian 'Kang' Bachini","nicknames":["Italian Dragon"],"idIMDB":"nm3985011"},"actorId":"nm3985011","character":"Twister Supporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Thomas Burrell","urlProfile":"http://www.imdb.com/name/nm3337338","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzQ5MTA4NF5BMl5BanBnXkFtZTgwODQ3MzUyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Brian Thomas Burrell is an actor, known for Ip Man 2 (2010), My Lucky Star (2013) and Come on, Cousin (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzQ5MTA4NF5BMl5BanBnXkFtZTgwODQ3MzUyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3337338","name":"Brian Thomas Burrell","idIMDB":"nm3337338"},"actorId":"nm3337338","character":"Emcee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Li Chak","urlProfile":"http://www.imdb.com/name/nm4202593","urlPhoto":"","biography":{"bio":"Li Chak is an actor, known for Ip Man (2008) and Ip Man 2 (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4202593","name":"Li Chak","idIMDB":"nm4202593"},"actorId":"nm4202593","character":"Yip Chun","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1386932","urlIMDB":"http://www.imdb.com/title/tt1386932","business":{"budget":null,"openingWeekend":[{"money":"$61,057","country":"USA","day":"30","month":"01","year":"2011","remarks":"20 Screens"}],"gross":[{"money":"$204,380","country":"USA","day":"01","month":"05","year":"2011","remarks":""},{"money":"$202,947","country":"USA","day":"24","month":"04","year":"2011","remarks":""},{"money":"$202,252","country":"USA","day":"17","month":"04","year":"2011","remarks":""},{"money":"$198,850","country":"USA","day":"10","month":"04","year":"2011","remarks":""},{"money":"$194,586","country":"USA","day":"03","month":"04","year":"2011","remarks":""},{"money":"$191,391","country":"USA","day":"27","month":"03","year":"2011","remarks":""},{"money":"$190,088","country":"USA","day":"20","month":"03","year":"2011","remarks":""},{"money":"$181,879","country":"USA","day":"06","month":"03","year":"2011","remarks":""},{"money":"$176,453","country":"USA","day":"27","month":"02","year":"2011","remarks":""},{"money":"$149,677","country":"USA","day":"13","month":"02","year":"2011","remarks":""},{"money":"$111,357","country":"USA","day":"06","month":"02","year":"2011","remarks":""},{"money":"$61,057","country":"USA","day":"30","month":"01","year":"2011","remarks":""}],"weekendGross":[{"money":"$1,433","country":"USA","day":"01","month":"05","year":"2011","remarks":"2 Screens"},{"money":"$139","country":"USA","day":"24","month":"04","year":"2011","remarks":"1 Screen"},{"money":"$1,214","country":"USA","day":"17","month":"04","year":"2011","remarks":"2 Screens"},{"money":"$3,181","country":"USA","day":"10","month":"04","year":"2011","remarks":"3 Screens"},{"money":"$2,421","country":"USA","day":"03","month":"04","year":"2011","remarks":"4 Screens"},{"money":"$386","country":"USA","day":"27","month":"03","year":"2011","remarks":"2 Screens"},{"money":"$1,994","country":"USA","day":"20","month":"03","year":"2011","remarks":"4 Screens"},{"money":"$2,659","country":"USA","day":"06","month":"03","year":"2011","remarks":"3 Screens"},{"money":"$4,610","country":"USA","day":"27","month":"02","year":"2011","remarks":"6 Screens"},{"money":"$21,340","country":"USA","day":"13","month":"02","year":"2011","remarks":"13 Screens"},{"money":"$31,236","country":"USA","day":"06","month":"02","year":"2011","remarks":"21 Screens"},{"money":"$61,057","country":"USA","day":"30","month":"01","year":"2011","remarks":"20 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 435 Advanced, Zeiss Ultra Prime, Cooke Varotal and Angenieux Optimo Lenses","Moviecam Compact, Zeiss Ultra Prime, Cooke Varotal and Angenieux Optimo Lenses"],"laboratory":["Kantana, Bangkok, Thailand","Mandarin Laboratory (International) Ltd., Hong Kong (also prints)"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision2 200T 5217, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"7.6","metascore":"67","filmingLocations":[],"rated":"R","awards":[{"award":"Asian Film Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won Asian Film Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Sammo Kam-Bo Hung","id":"nm0005033","role":null}]}]}]},{"award":"Beijing Student Film Festival 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Jury Award","categories":[{"category":"Best Visual Effect","names":[]}]}]},{"award":"Golden Horse Film Festival 2010","titlesAwards":[{"titleAwardOutcome":"Won Golden Horse Award","categories":[{"category":"Best Action Choreography","names":[{"name":"Sammo Kam-Bo Hung","id":"nm0005033","role":null}]}]}]},{"award":"Hong Kong Film Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won Hong Kong Film Award","categories":[{"category":"Best Film Editing","names":[{"name":"Ka-Fai Cheung","id":"nm0156496","role":null}]},{"category":"Best Action Choreography","names":[{"name":"Sammo Kam-Bo Hung","id":"nm0005033","role":null}]}]},{"titleAwardOutcome":"Nominated Hong Kong Film Award","categories":[{"category":"Best Picture","names":[]},{"category":"Best Director","names":[{"name":"Wilson Yip","id":"nm0948159","role":null}]},{"category":"Best Cinematography","names":[{"name":"Hang-Sang Poon","id":"nm0690940","role":null}]},{"category":"Best Art Direction","names":[{"name":"Kenneth Mak","id":"nm0538335","role":null}]},{"category":"Best Original Film Score","names":[{"name":"Kenji Kawai","id":"nm0442766","role":null}]},{"category":"Best Sound Design","names":[{"name":"George Yiu-Keung Lee","id":"nm1806462","role":null},{"name":"Kinson Tsang","id":"nm0874686","role":null}]},{"category":"Best Visual Effects","names":[{"name":"Henri Wong","id":"nm2744255","role":null}]},{"category":"Best New Performer","names":[{"name":"Yu-Hang To","id":"nm3253626","role":null}]}]}]},{"award":"Huading Award 2011","titlesAwards":[{"titleAwardOutcome":"Won Huading Award","categories":[{"category":"Best Actor in a Motion Picture","names":[{"name":"Donnie Yen","id":"nm0947447","role":null}]}]}]}],"votes":"76,014","type":"Movie","companyCreditsSimple":[{"idCompany":"co0323668","name":"Henan Film & TV Production Group Henan Film Studio"},{"idCompany":"co0039100","name":"Mandarin Films Distribution"},{"idCompany":"co0263566","name":"Beijing ShengShi HuaRei Film Investment & Management Co."}],"keywords":{"keywords":["martial arts","master","hong kong","wing chun","school","british","sequel","rivalry","martial arts master","grandmaster","honor","martial arts school","tuition","1950s","migration","flowerpot","chain fight","muscleman","prizefighting","karate kick","karate chop","wire fu","illegal fistfight","combat","fictional war","shot point blank","foreigner","assassination","stick fight","chop socky","tai chi","wu shu","stylized violence","tough guy","prize fighter","actor performing own stunts","brutality","violence","nose pushed into brain","ambush","mixed martial arts","disarming someone","hand to hand combat","fistfight","one against many","mandarin","turf","afterlife","turf war","gash in the face","hit with a board","handcuffs","prohibition","boy","kindness","hero","hope","redemption","betrayal","establishment","reluctant hero","compassion","tragedy","ceremony","corrupt cop","sepia","punching bag","martial arts tournament","unusual method of training","training montage","lifted by the throat","semi autobiographical","respect","superiority","challenger","press conference","british flag","prayer","funeral","showdown","repeated scene","nosebleed","blackmail","mentor","police","loyalty","weapon","child labor","what happened to epilogue","young version of character","bad reputation","childbirth","mentally challenged","asthma","protection racket","eye injury","character repeating someone else's dialogue","custody","culture clash","lollipop","fight","blood","social commentary","title appears in text","vandalism","wink","standing on a table","rebellion","dunked in water","immortality","begging for mercy","racism","battle","rice","boxing match","beaten to death","newspaper","photographer","kicked in the stomach","police station","year 1949","pregnant wife","pregnancy","wooden dummy","breaking a table","epic","translator","englishman","husband wife relationship","fish market","knife","punched in the face","bruce lee","good versus evil","water","newspaper owner","bully","teacup","hypocrisy","life after death","heroism","swarm tactic","legend","stool","sarcastic clapping","repeated line","tragic villain","childhood friend","brawl","water torture","family dinner","death","rooftop","stalemate","medication","storytelling","punched on the nose","rascal","propagation","flash camera","character arc","christ allegory","boxing training","championship","labor","radio broadcasting","split lip","poverty","fate","kung fu","friendship","one man army","boxer","super villain","sect","candlelight","young man","robbery","coming of age","responsibility","mouth guard","kicked in the face","time lapse photography","beating","wuxia fiction","righteous rage","spirituality","energy","family relationships","uncle nephew relationship","unsubtitled foreign language","hostage","beggar","revenge","competition","threatened with a knife","bail","humiliation","divine retribution","salaryman","tournament","roast duck","father son relationship","thief","tea","brother","bravery","british man","knocked out","hit in the throat","master criminal","bare chested male","room for rent","warrior","laundry drying on clothes line","flashback","children","ransom","authority","shot in the head","faked death","shot in the shoulder","sifu","second part","numbered sequel","martial artist","disciple","digit in title","actor shares first name with character","number in title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:15:32"}}