{"data":{"movies":[{"title":"Lee Daniels' The Butler","originalTitle":"The Butler","year":"2013","releaseDate":"20130816","directors":[{"name":"Lee Daniels","id":"nm0200005"}],"writers":[{"name":"Danny Strong","id":"nm0834960"},{"name":"Wil Haygood","id":"nm1665973"}],"runtime":"132 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NDY3MjkyMF5BMl5BanBnXkFtZTcwMDM5Nzg5OQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama"],"plot":"Cecil Gaines was a sharecropper's son who grew up in the 1920s as a domestic servant for the white family who casually destroyed his. Eventually striking out on his own, Cecil becomes a hotel valet of such efficiency and discreteness in the 1950s that he becomes a butler in the White House itself. There, Cecil would serve numerous US Presidents over the decades as a passive witness of history with the American Civil Rights Movement gaining momentum even as his family has troubles of its own. As his wife, Gloria, struggles with her addictions and his defiant eldest son, Louis, strives for a just world, Cecil must decide whether he should take action in his own way.","simplePlot":"As Cecil Gaines serves eight presidents during his tenure as a butler at the White House, the civil rights movement, Vietnam, and other major events affect this man's life, family, and American society.","actors":[{"actorName":"Forest Whitaker","urlProfile":"http://www.imdb.com/name/nm0001845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDI3NTg2OV5BMl5BanBnXkFtZTcwNTgwMzg5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1961","placeOfBirth":" Longview, Texas, USA","birthName":"Forest Steven Whitaker","height":"6' 2\" (1.88 m)","bio":"Forest Steven Whitaker has packaged a king-size talent into his hulking 6' 2\", 220 lb. frame. He won an Academy Award for his performance as Ugandan dictator Idi Amin in the 2006 film The Last King of Scotland (2006), and has also won a Golden Globe and a BAFTA. He is the fourth African-American male to win an Academy Award for Best Actor, following in the footsteps of Sidney Poitier, Denzel Washington, and Jamie Foxx. Whitaker was born on July 15, 1961 in Longview, Texas, to Laura Francis (Smith), a special education teacher, and Forest Steven Whitaker, an insurance salesman. His family moved to South Central Los Angeles in 1965. The athletically-inclined Whitaker initially found his way into college via a football scholarship. Later, however, he transferred to USC where he set his concentration on music and earned two more scholarships training as an operatic tenor. This, in turn, led to another scholarship at Berkeley with a renewed focus on acting and the performing stage. Whitaker made his film debut at the age of 21 in the raucous comedy Fast Times at Ridgemont High (1982) wherein he played, quite naturally, a footballer. He went on to play another sports-oriented student, a wrestler, in his second film Vision Quest (1985). He gained experience on TV as well with featured spots on such varied shows as Diff'rent Strokes (1978) and Cagney & Lacey (1981), not to mention the TV-movie Civil War epic North and South (1985) and its sequel. The movie that truly put him on the map was The Color of Money (1986). His one big scene as a naive-looking pool player who out-hustles Paul Newman's Fast Eddie Felson was pure electricity. This led to more visible roles in the \"A\" class films Platoon (1986), Stakeout (1987), and Good Morning, Vietnam (1987), which culminated in his breakout lead portrayal of the tortured jazz icon 'Charlie \"Bird\" Parker' in Clint Eastwood's passion project Bird (1988), for which Whitaker won the Cannes Film Festival award for \"best actor\" and a Golden Globe nomination. Whitaker continued to work with a number of well-known directors throughout the 1990s. While his \"gentle giant\" characters typically display innocence, indecision, and timidity along with a strong underlying humanity, he has certainly not shied away from the edgier, darker corners of life as his occasional hitmen and other menacing streetwise types can attest. Although in only the first section of the film, he was memorable as the IRA-captured British soldier whose bizarre relationship with a mysterious femme fatale serves as the catalyst for the critically-lauded drama The Crying Game (1992). Always a willing participant to push the envelope, he's gone on to enhance a number of lesser films. Among those was his plastic surgeon in Johnny Handsome (1989), gay clothing designer in Robert Altman's Ready to Wear (1994), alien hunter in Species (1995), absentee father confronted by his estranged son in Smoke (1995), and Mafia hitman who models himself after the samurai warrior in Ghost Dog, la voie du samouraï (1999), among many others. As would be expected, he's also had his share of epic-sized bombs, notoriously the L. Ron Hubbard sci-fi disaster Battlefield Earth (2000). On the TV front, he was the consulting producer and host of a revamped Rod Serling's cult series classic La treizième dimension (2002), which lasted a disappointing one season. In the early 1990s, Whitaker widened his horizons to include producing/directing and has since gained respect behind the camera as well. He started things off co-producing the violent gangster film A Rage in Harlem (1991), in which he co-starred with Gregory Hines and Robin Givens, and then made his successful directorial debut with the soulful Waiting to Exhale (1995), showcasing a legion of distaff black stars. He also directed co-star Whitney Houston's music video of the movie's theme song (\"Shoop Shoop\"). He also helmed the fluffy romantic comedy First Daughter (2004) with Katie Holmes and Michael Keaton. Whitaker also served as an executive producer on First Daughter. He had previously executive produced several made-for-television movies, most notably the 2002 Emmy-award winning Door to Door, starring William H. Macy. He produced these projects through his production company, Spirit Dance Entertainment, which he shut down in 2005 to concentrate on his acting career. In 2002, he co-starred in Joel Schumacher's thriller, Phone Booth, with Kiefer Sutherland and Colin Farrell. That year, he also co-starred with Jodie Foster in Panic Room. Whitaker's greatest success to date is the 2006 film, The Last King of Scotland. His performance earned him the 2007 Academy Award for Best Actor in a Leading Role, For that same role, he also received the Golden Globe Award, the Screen Actors Guild Award, a BAFTA Award, and many critical accolades. He has also received several other honors. In September 2006, the 10th Annual Hollywood Film Festival presented him with its \"Hollywood Actor of the Year Award,\" He was also honored at the Santa Barbara International Film Festival 2007, receiving the American Riviera Award. Previously, in 2005, the Deauville Festival of American Film paid tribute to him. In 2007, Forest Whitaker won the Cinema for Peace Award 2007. In 2007, Whitaker co-starred in The Great Debaters with fellow Oscar winner Denzel Washington, and in 2008, Whitaker played opposite Keanu Reeves in Street Kings and Dennis Quaid in Vantage Point. In 2009, Forest co-starred in the Warner Bros. film \"Where the Wild Things Are,\" directed by Spike Jonze, which was a mix of live-action, animation and puppetry as an adaptation of the Maurice Sendak classic children's book. Around the same time, he also starred in \"Repossession Mambo\", with Jude Law, \"Hurricane Season\", \"Winged Creatures\", and \"Powder Blue\". He appeared in the Olivier Dahan film \"My Own Love Song\", opposite Renée Zellweger, and was part of the Africa Movie Academy Awards in 2009, in Nigeria. He is married to former model Keisha Whitaker and has three children by her. His younger brothers Kenn Whitaker and Damon Whitaker are both actors as well. Forest was given a star on the Hollywood Walk in April of 2007. In November 2007, Whitaker was the creative mind behind DEWmocracy.com, a website that let people decide the next flavor of Mountain Dew in a \"People's Dew\" poll. He directed a short film and created the characters for the video game. Whitaker has done extensive humanitarian work, he has been involved with organizations like, Penny Lane, an organization that provides assistance to abused teenagers. PETA and Farm Sanctuary, organizations that protect animals' rights. Close friends with Neurosurgeon Dr. Keith Black, Forest has helped raise awareness and funds for Dr. Blacks research. During the last couple of years, he has become a spokesperson for Hope North Ugandan orphanage and Human Rights Watch. In the year 2001 Forest received a Humanitas Prize. He was recently honored by The City of Los Angeles with the Hope of Los Angeles Award. And his entire clan received the LA BEST Family Focus Award. Last year he joined forces with \"Idol Gives Back\" and \"Malaria No More\"; he has become a GQ Ambassador supporting and fundraising for Hope North. He was a Surrogate for Barrack Obama's campaign supporting him across the United States. Whitaker's multimedia company, Spirit Dance Entertainment, includes film, television and music production. He works closely with a number of charitable organizations, giving back to his community by serving as an Honorary Board Members for Penny Lane, an organization that provides assistance to abused teenagers, the Human Rights Watch and The Hope North organization.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDI3NTg2OV5BMl5BanBnXkFtZTcwNTgwMzg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001845","name":"Forest Whitaker","idIMDB":"nm0001845"},"actorId":"nm0001845","character":"Cecil Gaines","urlCharacter":"http://www.imdb.com/character/ch0320042","main":true},{"actorName":"David Banner","urlProfile":"http://www.imdb.com/name/nm1755886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NDczMDg1OF5BMl5BanBnXkFtZTcwMzg0OTI5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Lavelle Crump","height":"6' 2\" (1.88 m)","bio":"Lavell William Crump (born April 11, 1974), better known by his stage name David Banner, is an American rapper, record producer, and actor. Banner's music career first began as a member of the rap duo, Crooked Lettaz. He became a solo artist in 2000, releasing his first title \"Them Firewater Boyz, Vol. 1\". Since 2000, Banner went on to release several successful titles including the 2003 album title \"Mississippi: The Album\", followed up by a sequel title \"MTA2: Baptized in Dirty Water\" released after the success of the first MTA album. He went on to release titles including \"Certified\", in 2005. Three years later, Banner returned with a new title \"The Greatest Story Ever Told\". In 2006, Banner made his first film appearance in Black Snake Moan (2006), starring Christina Ricci and Samuel L. Jackson. He also executive produced that Adult Swim show That Crook'd 'Sipp (2007). Other film appearances include Stomp the Yard 2: Homecoming (2010) and The Last Punch (2016). He also provided rap songs for movies including 2 Fast 2 Furious (2003) and See No Evil (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NDczMDg1OF5BMl5BanBnXkFtZTcwMzg0OTI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1755886","name":"David Banner","nicknames":["Mr. Mississippi"],"idIMDB":"nm1755886"},"actorId":"nm1755886","character":"Earl Gaines","urlCharacter":"http://www.imdb.com/character/ch0437998","main":true},{"actorName":"Michael Rainey Jr.","urlProfile":"http://www.imdb.com/name/nm3691729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5Mzc3NTgwODReQTJeQWpwZ15BbWU4MDA0Mzk4NTgx._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Actor Michael Rainey Jr. plays Tariq St. Patrick on Starz network's hit drama series, \"Power.\" Michael plays the son of the lead, Ghost. The show stars, Omari Hardwick, Naturi Naughton and Curtis \"50 Cent\" Jackson, who also is the shows' producer. Seasons 1-3 2014-2016 Michael stars opposite Ice Cube, Cedric The Entertainer and Nick Minaj in the third installment of the comedy franchise Barbershop for Warner Brothers Pictures entitled Barbershop 3: The Next Cut. In the movie, Michael plays the role of 'Jalen,' the teenage son to Ice Cube's character. April 15, 2016. Michael's first film in America is LUV 2011, where he starred alongside Common and worked with others such as Danny Glover, Dennis Haysbert, Meagan Good and Charles Dutton and was directed by Sheldon Candis. Michael was also featured in Lee Daniels: The Butler 2012 starring Forest Whitaker and Oprah Winfrey, where he played the 'Butler' as a child. Michael was also featured in Orange Is The New Black from season 1-3, 2013-2015. He starred in TV1's movie Second Chance Christmas directed by Alton Glass 2014. Born September 22 in Louisville, Kentucky and raised in Staten Island, New York where he currently lives. Michael made his first on-screen appearance being cast in \"Sesame Street\" and doing commercials and music videos. In 2009, the 9 year old made his way to the big screen in the film that kicked off his acting career entitled, Un Altro Mondo 2010 and directed by Silvio Muccino. Michael played the lead character 'Charlie' alongside Silvio Muccino. Michael, who is American, lived in Italy for some time to prepare for this film and went from speaking only English to speaking fluent Italian for his role. In his spare time, Michael gives back to the community through his involvement in Find and Feed, an organization dedicated to helping the homeless, which is based in Indiana. He also does independent work shopping for the less fortunate during Christmas time, supplying coats for the homeless and feeding them. Michael enjoys playing the piano and making music, playing basketball, playing video games, and playing with his two terriers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5Mzc3NTgwODReQTJeQWpwZ15BbWU4MDA0Mzk4NTgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3691729","name":"Michael Rainey Jr.","idIMDB":"nm3691729"},"actorId":"nm3691729","character":"Cecil Gaines","urlCharacter":"http://www.imdb.com/character/ch0320042","main":true},{"actorName":"LaJessie Smith","urlProfile":"http://www.imdb.com/name/nm4772555","urlPhoto":"","biography":{"height":"4' 3½\" (1.31 m)","bio":"LaJessie Smith is an actor and composer, known for Lee Daniels' The Butler (2013), Daddy's Home (2015) and Bad Moms (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4772555","name":"LaJessie Smith","nicknames":["Do You"],"idIMDB":"nm4772555"},"actorId":"nm4772555","character":"Abraham","urlCharacter":"http://www.imdb.com/character/ch0437996","main":true},{"actorName":"Mariah Carey","urlProfile":"http://www.imdb.com/name/nm0001014","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTQzOTM0OF5BMl5BanBnXkFtZTcwNTI4MTMxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1970","placeOfBirth":" Huntington, New York, USA","birthName":"Mariah Carey","height":"5' 8\" (1.73 m)","bio":"Mariah Carey was born in Long Island, New York. She is the daughter of Patricia (Hickey), a singer and vocal coach, who is of Irish descent, and Alfred Roy Carey, an engineer, who was of Afro-Cuban ancestry. Mariah attended Greenlawn's Harborfields High School. In June of 1990, Mariah made her debut with \"Mariah Carey\" which entered at #73, but on August 4, 1990, it reached #1. Her 1990 self-titled debut album went multi-platinum and spawned an extraordinary four consecutive #1 singles: \"Vision of Love,\" \"Love Takes Time,\" \"Someday\" and \"I Don't Wanna Cry,\" and led to Grammy Awards for Best New Artist and Best Female Vocalist. Her 1993 album titled Music Box went ten-times platinum. On September 30, 1995, she made music history. Her single \"Fantasy\" from her 1995 Daydream album debuted at #1 on the Billboard Hot 100, making her the first female artist to accomplish a number one debut in the U.S. Her other Daydream's single \"One Sweet Day\" remained for 16 weeks at the top of the charts. She is the only artist since The Beatles to have so many #1 singles and albums. With \"Heartbreaker\", the first single from her 1999 album Rainbow and also her 14 #1 single, she became the only artist to top the charts in each year of the 1990s, and with \"Heartbreaker\" at its 60th week atop the Billboard's charts, she pushed ahead of The Beatles's 59-week record as the only artist with the most cumulative weeks spent atop Billboard's Hot 100 Singles chart. Following \"Heartbreaker,\" her second single \"Thank God I Found You\" also from her Rainbow album became her 15th #1. \"We Belong Together\" from her 2005 album The Emancipation of Mimi became her 16th #1 single and was also her first #1 without any guest artists since her song \"My All\" (also a #1 single) captured the top spot in May 1998. The single \"Don't Forget About Us\" also from her 2005 album Emancipation of Mimi became her 17th #1 single, tying her with Elvis Presley's 17 #1 singles. Three more Grammy Awards were gained from The Emancipation of Mimi album. She is the most successful selling female artist in music history and is the only female artist to have the most #1 singles and albums and also holds the record for straight #1 singles and albums each year. Along with numerous awards and incredible vocal range, she also composes all of her own material, with the exception of song covers. In April 2008, the single \"Touch My Body\" became her 18th #1 single, pushing her ahead of Elvis Presley's 17 #1 singles. Now she is the only artist since The Beatles to have as many number one singles and the only singer alive likely to succeed them.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTQzOTM0OF5BMl5BanBnXkFtZTcwNTI4MTMxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001014","name":"Mariah Carey","nicknames":["Songbird","MC","Mirage","Mimi","The Voice"],"idIMDB":"nm0001014"},"actorId":"nm0001014","character":"Hattie Pearl","urlCharacter":"http://www.imdb.com/character/ch0403828","main":true},{"actorName":"Alex Pettyfer","urlProfile":"http://www.imdb.com/name/nm1641117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDIxNTY0M15BMl5BanBnXkFtZTgwODM0MDUzODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1990","placeOfBirth":" Stevenage, Hertfordshire, England, UK","birthName":"Alexander Richard Pettyfer","height":"5' 11¼\" (1.81 m)","bio":"Alexander Richard Pettyfer was born in Hertfordshire and raised in Windsor. His mother, Lee (Robinson), is an interior designer. His father, Richard Pettyfer, is a fellow actor. His parents divorced and Alex now has a younger half-brother, James, from his mother's re-marriage to a property developer, Michael Ireland. James is a junior tennis player. At age 7, Alex started modeling for Gap's children range. He also appeared in TV commercials for other brands. When he was older, he modeled for Burberry to fund his traveling adventures. Alex attended various private schools. During this time, he enjoyed performing in school plays. At age 13, he auditioned and won a role in the TV movie Tom Brown's Schooldays (2005). At age 15, he went to Los Angeles and was cast as \"Alex Rider\", the main character in Alex Rider: Operation Stormbreaker (2006) (aka \"Alex Rider: Operation Stormbreaker\"). This was his breakthrough role and he was nominated for a Young Artist Award and an Empire Award for this role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDIxNTY0M15BMl5BanBnXkFtZTgwODM0MDUzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1641117","name":"Alex Pettyfer","idIMDB":"nm1641117"},"actorId":"nm1641117","character":"Thomas Westfall","urlCharacter":"http://www.imdb.com/character/ch0316635","main":true},{"actorName":"Vanessa Redgrave","urlProfile":"http://www.imdb.com/name/nm0000603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjE0OTgzNF5BMl5BanBnXkFtZTcwOTQ3ODMwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1937","placeOfBirth":" Greenwich, London, England, UK","height":"5' 11\" (1.81 m)","bio":"On January 30, 1937, renowned theatre actor Michael Redgrave was performing in a production of Hamlet in London. During the curtain call, the show's lead, Laurence Olivier, announced to the audience: \"tonight a great actress was born\". This was in reference to his co-star's newborn daughter, Vanessa Redgrave. Vanessa was born in Greenwich, London, to Michael Redgrave and Rachel Kempson, both thespians. Three quarters of a century after her birth (despite numerous ups and down) this rather forward expectation has definitely been lived up to with an acclaimed actress that has won (among many others) an Academy Award, two Emmys, two Golden Globes, two Cannes Best Actress awards, a Tony, a Screen Actors Guild award, a Laurence Olivier theatre award and a BAFTA fellowship. Growing up with such celebrated theatrical parents, great expectations were put on both herself, her brother Corin Redgrave and sister Lynn Redgrave at an early age. Shooting up early and finally reaching a height just short of 6 foot, Redgrave initially had plans to dance and perform ballet as a profession. However she settled on acting and entered the Central School of Speech and Drama in 1954 and four years later made her West End debut. In the decade of the 1960s she developed and progressed to become one of the most noted young stars of the English stage and then film. Performances on the London stage included the classics: 'A Touch of Sun', 'Coriolanus', 'A Midsummer's Night Dream', 'All's Well that Ends Well', 'As You Like It', 'The Lady from the Sea', 'The Seagull' and many others. By the mid 1960s, she had booked various film roles and matured into a striking beauty with a slim, tall frame and attractive face. In 1966 she made her big screen debut as the beautiful ex-wife of a madman in an Oscar nominated performance in the oddball comedy Morgan! (1966), as well as the enigmatic woman in a public park in desperate need of a photographer's negatives in the iconic Blow-Up (1966) and briefly appeared in an unspoken part of Anne Boleyn in the Best Picture winner of the year A Man for All Seasons (1966). She managed to originate the title role in \"The Prime of Miss Jean Brodie\" the same year on the London stage (which was then adapted for the big screen a few years later, but Maggie Smith was cast instead and managed to win an Oscar for her performance). Her follow up work saw her play the lead in the box office hit adaptation Camelot (1967), a film popular with audiences but dismissed by critics, and her second Academy Award nominated performance as Isadora Duncan in the critically praised Isadora (1968). Her rise in popularity on film also coincided with her public political involvement, she was one of the lead faces in protesting against the Vietnam war and lead a famous march on the US embassy, was arrested during a Ban-the-Bomb demonstration, publicly supported Yasar Arafat's Palestine Liberation Organization (PLO) and fought for various other human rights and particularly left wing causes. Despite her admirably independent qualities, most of her political beliefs weren't largely supported by the public. In 1971 after 3 films back to back, Redgrave suffered a miscarriage (it would have been her fourth, after Natasha Richardson, Joely Richardson and Carlo Gabriel Nero) and a break up with her then partner and father of her son, Franco Nero. This was around the same time her equally political brother Corin introduced her to the Workers Revolutionary Party, a group who aimed to destroy capitalism and abolish the monarchy. Her film career began to suffer and take the back seat as she became more involved with the party, twice unsuccessfully attempting to run as a party member for parliament, only obtaining a very small percentage of votes. In terms of her film career at the time, she was given probably the smallest part in the huge ensemble who-dunnit hit, Murder on the Orient Express (1974) and given another thankless small part as Lola Deveraux in the Sherlock Holmes adventure The Seven-Per-Cent Solution (1976). After a celebrated Broadway debut, she created further controversy in 1977 with her involvement in two films, firstly in Julia (1977) where she acted opposite Jane Fonda as a woman fighting Nazi oppression and narrated and featured in the documentary The Palestinian (1977) where she famously danced holding a Kalashnikov rifle. She publicly stated her condemnation of what she termed \"Zionist hudlums\", which outraged Jewish groups and as a result a screening of her documentary was bombed and Redgrave was personally threatened by the Jewish Defense League (JDL). Julia (1977) happened to be a huge critical success and Redgrave herself was nominated for a Best Supporting Actress Oscar, but Jewish support groups demanded her nomination to be dropped and at the event of the Academy Awards burned effigies of Redgrave and protested and picketed. Redgrave was forced to enter the event via a rear entrance to avoid harm and when she won the award she famously remarked on the frenzy causes as \"Zionist hoodlums\" which caused the audience to audibly gasp and boo. The speech reached newspapers the next morning and her reputation was further damaged. It came as a surprise when CBS hired her for the part of real life Nazi camp survivor Fania Fenelon in Playing for Time (1980), despite more controversy and protesting (Fenelon herself didn't even want Redgrave to portray her) she won an Emmy for the part and the film was one of the highest rating programs of the year. Her follow up film work to her Oscar had been mostly low key but successful, performances in films such as Yanks (1979), Agatha (1979), The Bostonians (1984), Wetherby (1985) and Prick Up Your Ears (1987) further cemented her reputation as a fine actress and she received various accolades and nominations. However mainly in the 1980s, she focused on TV films and high budget mini-series as well as theatre in both London and New York. She made headlines in 1984 when she sued the Boston Symphony Orchestra for $5 million for wrongful cancellation of her contract because of her politics (she also stated her salary was significantly reduced in Agatha (1979) for the same reason). She became more mainstream in the 1990s where she appeared in a string of high profile films but the parts often underused Redgrave's abilities or they were small cameos/5-minute parts. Highlights included Howards End (1992), Little Odessa (1994), Mission: Impossible (1996) and Cradle Will Rock (1999), as well as her leading lady parts in A Month by the Lake (1995) and Mrs Dalloway (1997). In 2003 she finally won the coveted Tony award for her performance in 'The Long Day's Journey Into Night' and followed up with another two Tony nominated performances on Broadway, her one woman show 'The Year of Magical Thinking' in 2007 and 'Driving Miss Daisy' in 2010 which not only was extended due to high demand, but was also transferred to the West End for an additional three months in 2011. Vanessa continues to lend her name to causes and has been notable for donating huge amounts of her own money for her various beliefs. She has publicly opposed the war in Iraq, campaigned for the closure of Guantanamo Bay, supported the rights of gays and lesbians as well as AIDs research and many other issues. She released her autobiography in 1993 and a few years later she was elected to serve as a UNICEF Goodwill Ambassador. She also famously declined the invitation to be made a Dame for her services as an actress. Many have wondered the possible heights her career could have reached if it wasn't for her outspoken views, but being a celebrity and the artificial lifestyle usually attached doesn't seem to interest Redgrave in the slightest. Vanessa has worked with all three of her children professionally on numerous occasions (her eldest daughter, Natasha Richardson tragically died at the age of 45 due to a skiing accident) and in her mid 70s she still works regularly on television, film and theatre, delivering time and time again great performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjE0OTgzNF5BMl5BanBnXkFtZTcwOTQ3ODMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000603","name":"Vanessa Redgrave","idIMDB":"nm0000603"},"actorId":"nm0000603","character":"Annabeth Westfall","urlCharacter":"http://www.imdb.com/character/ch0378788","main":true},{"actorName":"Aml Ameen","urlProfile":"http://www.imdb.com/name/nm1543989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzQ0MjMzMl5BMl5BanBnXkFtZTgwNjE1MDUyOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1985","placeOfBirth":" London, England, UK","height":"5' 7\" (1.7 m)","bio":"Aml Ameen is a British actor in film, theatre and television. Hailing from North London, the son of Caribbean parents, Aml burst onto UK cinema screens with his standout performance as \"Trife\" in the cult classic, feature indie film, Kidulthood. His performance earned him a nomination for 'Best Newcomer\" 2006 Screen Nation Awards, as well as a spot in The London Times list of \"Best New Actors of the Year\". Off the success of Kidulthood, Ameen landed a series regular role on the BAFTA Award winning hit TV series, The Bill. His portrayal of \"Officer Lewis Hardy\" earned him not only an enthusiastic fan base, but the \"Screen Nation Award for Best Actor\" in 2007. His continued success in the UK, along with landing a role in George Lucas' Red Tails, ignited Aml's career in Hollywood. He was cast in his first American indie film, Evidence, starring opposite Radha Mitchell and Stephen Moyer. David E. Kelley took notice of his talent and offered him the first role of his cast for Harry's Law at NBC, playing young lawyer \"Malcom Davies\". The show also starred Kathy Bates. In 2013, Screen International named Ameen as one of their \"Brits to Watch\". He then landed the role of \"Cecil Gaines\" (young Forrest Whitaker) in Lee Daniel's critically acclaimed and award winning feature film, The Butler. This year, Aml has appeared in the Relativity feature film, Beyond the Lights and was a lead in Fox's blockbuster hit, The Maze Runner. He also co-stars with Jennifer Lopez and Viola Davis in the feature film, Lila & Eve which premiered this year at the Sundance Film Festival. Next up for Ameen, a leading role in the Wachowskis' highly anticipated Netflix series, Sense 8. Aml spends his time between Los Angeles and London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzQ0MjMzMl5BMl5BanBnXkFtZTgwNjE1MDUyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1543989","name":"Aml Ameen","idIMDB":"nm1543989"},"actorId":"nm1543989","character":"Cecil Gaines","urlCharacter":"http://www.imdb.com/character/ch0320042","main":true},{"actorName":"Clarence Williams III","urlProfile":"http://www.imdb.com/name/nm0929934","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MzY0MTM5OF5BMl5BanBnXkFtZTYwMDg0ODQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1939","placeOfBirth":" New York City, New York, USA","bio":"As the son of a displaced musician, Harlem-born African-American actor Clarence Williams III was raised by his musical grandparents, the legendary jazz and boogie-woogie composer/pianist Clarence Williams, who wrote such classics as \"T'Aint Nobody's Business If I Do\" and \"Baby, Won't You Please Come Home,\" and blues singer Eva Taylor (1895-1977). While attending a local YMCA as a teen, Williams became interested in dramatics. After a two-year hitch with the U.S. Air Force, he started up his acting career, making a minor New York stage debut with \"The Long Dream\" in 1960. He continued impressively with roles in \"Walk in Darkness\" (1963), \"Sarah and the Sax\" (1964) and \"Doubletalk\" (1964), and capped his early career with a Theatre World Award and Tony-nomination for the three-person play \"Slow Dance on the Killing Ground\" (1964). Continuing on with powerful work in \"Does a Tiger Wear a Necktie?\" (1966) and \"King John,\" Vietnam-era Hollywood finally began to take notice of his \"angry young man\" charisma. His casting as former delinquent-turned-undercover cop Linc Hayes on the highly popular TV cop series Mod Squad (1968) along with fellow white partners Michael Cole and Peggy Lipton was a huge break for all three relative unknowns. Sporting a huge Afro, paisley shirts, dark shades and spouting hip language like \"dig it\" and \"solid\", the trio showed the requisite anti-establishment defiance and coolness to attract the angry, young generation--while still playing the good guys. Following the series' demise in 1973, he purposely avoided the \"blaxploitation\" Hollywood scene and returned to the stage, notably on Broadway opposite Maggie Smith in Tom Stoppard's play \"Night and Day\" (1979). In the 80s he launched an enviable character career in films, often playing a cool, streetwise character or threatening menace. Among his better-known on-screen assignments is the role of Prince's abusive father in Purple Rain (1984), a burnt-out political activist in the spoof I'm Gonna Git You Sucka (1988), the recurring part of Roger Hardy in the twisted cult TV series Twin Peaks (1990), a good-guy cop in Deep Cover (1992), an rioter in the Attica-themed mini-series Against the Wall (1994) and Wesley Snipes heroin-addicted dad in Sugar Hill (1993), among others. Powerful roles on such shows as \"Law & Order,\" \"Profiler\" and \"Judging Amy\" has kept him newsworthy but not strongly in the limelight. Once married to actress Gloria Foster, they appeared together in the movie The Cool World (1963). Following their divorce, they remained friendly and upon her death in 2001, it was he who made the formal announcement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MzY0MTM5OF5BMl5BanBnXkFtZTYwMDg0ODQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0929934","name":"Clarence Williams III","idIMDB":"nm0929934"},"actorId":"nm0929934","character":"Maynard","urlCharacter":"http://www.imdb.com/character/ch0404557","main":true},{"actorName":"John P. Fertitta","urlProfile":"http://www.imdb.com/name/nm0275183","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MjExMzE1NV5BMl5BanBnXkFtZTYwOTQ5MDEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"John Fertitta began his film career in the mid 1970's. He worked behind the scenes as Boom Operator, Casting Assistant, and Grip, in addition to working in front of the camera on films produced by Independent Filmmakers Charles B. Pierce and Jim McCullough. He contuined to land small roles that led to the opportunity to replace one of the lead actors in the direct-to-video, low budget feature, Video Murders. That role led to an audition for the Oscar nominated Best Picture, Mississippi Burning. John got the part and has since been fortunate to work with directors Walter Hill, Ron Shelton, Lee Daniels, Alan Parker, Christopher Reeve and Gary Ross. He has shared scenes with Academy Award winning actors Paul Newman in Blaze, Anna Paquin in Straight A's, Matthew McConaughey in The Paperboy, and Forest Whitaker in Lee Daniels \"The Butler.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MjExMzE1NV5BMl5BanBnXkFtZTYwOTQ5MDEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0275183","name":"John P. Fertitta","idIMDB":"nm0275183"},"actorId":"nm0275183","character":"Mr. Jenkins","urlCharacter":"http://www.imdb.com/character/ch0437997","main":true},{"actorName":"Jim Gleason","urlProfile":"http://www.imdb.com/name/nm0322282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgwNzA3Njk2N15BMl5BanBnXkFtZTgwMzY0NDU4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"James Joseph Gleason, IV was born on May 30, 1964 in New Orleans, Louisiana to Shirley Faris Gleason and James Joseph Gleason, III an attorney, magistrate judge and City Councilman in the Mandeville/Covington areas of Louisiana. Jim grew up with a passion for acting. After performing in plays in his youth, Gleason decided as a young adult to make it his profession. Classically trained and earning a Bachelor of Arts Degree in Theatre from Tulane University in 1986, Jim began to work in film and television in New Orleans for 10 years while the industry was still in its infancy. In late 1997, Gleason moved to Los Angeles to go where New Orleans couldn't take him. Jim worked extensively on screen, mostly in episodic television. In 2002, Jim began working as an instructor at The Margie Haber Studio in Los Angeles, and has continued the passion of instructing through The Working Actors' Studio with Jim Gleason where he thoroughly enjoys helping other actors achieve their dreams as he has. Then in 2012, Gleason moved home to marry his wonderful wife, Lydia, and recreate his Los Angeles success in his hometown. Jim credits his success to God's guidance and support. Jim was chosen as St. Tammany Parish President's Arts Award, 2015 Performing Artist of the Year. Jim looks forward to bigger and better roles in the growing Louisiana film industry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgwNzA3Njk2N15BMl5BanBnXkFtZTgwMzY0NDU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322282","name":"Jim Gleason","idIMDB":"nm0322282"},"actorId":"nm0322282","character":"R.D. Warner","urlCharacter":"http://www.imdb.com/character/ch0437991","main":true},{"actorName":"Oprah Winfrey","urlProfile":"http://www.imdb.com/name/nm0001856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODE3MzYxNF5BMl5BanBnXkFtZTYwMzEyNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1954","placeOfBirth":" Kosciusko, Mississippi, USA","birthName":"Orpah Gail Winfrey","height":"5' 6½\" (1.69 m)","bio":"Oprah Winfrey was born Orpah Gail Winfrey in Kosciusko, Mississippi, to Vernita Lee, a former maid, and Vernon Winfrey, a coal miner, barber, and city councilman. While Winfrey has been cited as the richest African American of the 20th century, she does not come from a rich, or even middle class, family. She was born in an economically troubled neighborhood and raised by a single-teenaged mother in the city of Milwaukee. Orpah, named after a biblical character, had a name no one could pronounce, so her family and friends starting calling her Oprah. Shortly after Oprah's birth, Vernita Lee left her daughter and traveled north. Oprah was then raised by her grandmother,Hatti Mae Lee. Oprah while being raised by her grandmother lived in terrible conditions. Oprah's only friends were farm animals,however even at that age Oprah had a very imaginative mind. Oprah would frequently give the animals dramatic parts and included them in games. This was perhaps where she had gotten the craze for acting, and would soon be seen in legendary masterpieces such as The Color Purple (1985). Oprah because of her grandmother's values, had religion and God instilled in herself at a very young age. Oprah because of her grandmother knew how to read,and write before the age of three. Oprah during church would recite poems,and verses from the bible. Soon the church, and the entire neighborhood knew she had a gift and was nicknamed,\"The Little Speaker\". This would soon prompt her to become a woman with a strong perspective, which millions across the world would want to have insight on. This prepared her for The Oprah Winfrey Show (1986). Due to her ability to read and write before the age of three, when enrolled in school she was often promoted several grades ahead of her age. Oprah at the age of six went to live with her mother, Vernita Lee. Vernita worked as a maid, so Oprah was often left alone at home with her cousins. Oprah due to her busy mother was paid little attention to at home, this is what prompted Oprah to started misbehaving and talking back to her mother. Vernita Lee then decided it was best Oprah live with her father in Nashville Tennessee. Oprah while living in Tennessee, found out her mother was pregnant and her mother requested for her to come back to Milwaukee to live with her mother and half-sister. When Oprah was nine she was raped by her nineteen year old cousin who was baby sitting her. This wouldn't be the only time she was sexually abused she would then be sexually abused by her cousin, a family friend,her mother's boyfriend, and her uncle during her stay in Milwaukee. Toward all these incidents, she never told a soul because the predators swore her to silence. At the age of thirteen Oprah ran away from home, this was due to her years of abuse and at the age of fourteen she became pregnant with an ill son who died shortly after birth. Oprah took the death of her son as she was given a second chance in life. Oprah's mother sent her to live once again with her father in Nashville,Tennessee. Oprah's father was very strict and made education the number-one priority for Oprah. Oprah attended Nashville East High School. Oprah during high-school wasn't precisely certain toward what she wanted to do, however she knew it was something with speaking or drama. Oprah was also elected school president and met with president Richard Nixon being apart of public speaking classes in her high-school. Oprah during the last year of high-school was rehearsing with her drama class when a local radio station, WVOL spotted her and asked her if she would like to read on radio. Oprah was then given a job reading the news on the radio. Oprah soon entered into a public speaking contest where the grand prize was a scholarship to Tennessee State University. Oprah won the contest and received a scholarship to Tennessee State University where she majored in Speech Communications and Performing Arts. Oprah during her college education was offered a job as a co-anchor on the CBS television station, she declined several times before she was convinced by her speech professor that it may be the ultimate step to launch her career. Oprah wanted to find work outside of Nashville Tennessee and was soon offered a job in Baltimore,Maryland. The job offer came up a few months before her graduation, she had to choose between the job and graduating, so she decided to choose the job in Maryland as the offer was very tempting. At the job in Maryland she wasn't a very good reporter and was shortly fired. Oprah's boss set her up as a talk show host on a morning talk show called, People Are Talking (1978). Immediately after the first show Oprah knew this is what she wanted to do for the rest of her life. Oprah strengthened the talk show for seven years and then she decided it was time to move on. In 1981 Oprah sent recorded tapes of the show to a talk-show in Chicago called A.M. Chicago. They immediately offered her the job and in September of 1985 she changed the name of the show to, \"The Oprah Winfrey Show\". The first broadcast of The Oprah Winfrey Show was on September 8,1986 it broadcast nationally. The Oprah Winfrey show first targeted woman, however soon due to controversial topics and intriguing topics Oprah brought on to the show it appealed to people of all genders,ethnics,and ages. Oprah promoted many things on her show such as books, movie releases all of which people were eager to know what her opinions were of them. Oprah helped broaden not just woman's point of view and significance but Oprah helped to realize that every human has an importance in this world. From it's first broadcast The Oprah Winfrey show went on to receive multiple Day Time Emmy Awards and several other prestigious awards.Winfrey expanded the Oprah Winfrey show and started releasing a monthly magazine which was called, O:The Oprah Magazine. The first issue was in 2000. The series finale of the Oprah Winfrey Show as on it's twenty-fifth season and it aired on May,25,2011. Concluding a segment of her career toward which she used as a device to inspire millions and help thousands to lead a better life. Oprah's made her debut as a film actress in the 1985 period drama film, The Color Purple. Oprah played a troubled housewife named Sofia. Oprah was nominated for an Academy Award for Best Supporting Actress. This movie went on to become a Broadway musical adaptation. In 1998 Oprah starred in the movie, Beloved which she also produced. Winfrey played the character Sethe who was a former slave. Winfrey has also acted in several movies such as Charlotte's Web (2006), Bee Movie (2007), and The Princess and the Frog (2009). Oprah Winfrey in 1998 received an Achievement Award from the National Academy of Television Arts and Sciences. In 2011 Oprah Winfrey received a Jean Hersholt Humanitarian Award from the Academy Of Motion Pictures Arts And Sciences. Oprah Winfrey will forever be remembered as an innovator through the landmarks she made, becoming the first female African American to host a television show. Inspiring millions of people across the world, discussing significant issues on her show such as equal rights toward genders,racism,poverty, and many others. Oprah will be seen as an icon someone who paved the way for others to become successful.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODE3MzYxNF5BMl5BanBnXkFtZTYwMzEyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001856","name":"Oprah Winfrey","nicknames":["O","Deepak Oprah","Lady O"],"idIMDB":"nm0001856"},"actorId":"nm0001856","character":"Gloria Gaines","urlCharacter":"http://www.imdb.com/character/ch0394096","main":true},{"actorName":"Isaac White","urlProfile":"http://www.imdb.com/name/nm0924888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1OTM0MzM5Nl5BMl5BanBnXkFtZTcwMTUyMDQxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Isaac White is an actor, known for Lee Daniels' The Butler (2013), Sex Ed (2014) and Queen Sugar (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1OTM0MzM5Nl5BMl5BanBnXkFtZTcwMTUyMDQxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0924888","name":"Isaac White","idIMDB":"nm0924888"},"actorId":"nm0924888","character":"Charlie Gaines","urlCharacter":"http://www.imdb.com/character/ch0438003","main":true},{"actorName":"David Oyelowo","urlProfile":"http://www.imdb.com/name/nm0654648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzdiMzljMWEtZjg0ZC00ZWUzLTkxNjktMmNiMDhlOGJmNjlkL2ltYWdlXkEyXkFqcGdeQXVyOTkyMDQ2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1976","placeOfBirth":" Oxford, England, UK","height":"5' 9\" (1.75 m)","bio":"David Oyelowo (pronounced - \"oh-yellow-oh\"), is a classically trained stage actor who has quickly become one of Hollywood's most sought-after talents. He graduated from the London Academy of Music and Dramatic Art (LAMDA), and received the \"Scholarship for Excellence\" from Nicholas Hytner in 1998. David starred as Martin Luther King Jr. in Paramount's drama \"Selma\". Directed by Ava DuVernay and produced by Oprah Winfrey and Brad Pitt's Plan B, the film follows Dr. King's struggle to secure voting rights for black people culminating in the march from Selma to Montgomery, Alabama and President Lyndon Johnson's signing of the Voting Rights Act of 1965. Oyelowo received Golden Globe Award, Film Independent Spirit Award nominations and won the NAACP Image Award for Best Actor for his portrayal of Dr. King and the film received an Oscar nomination for Best Picture. David was also recently seen in Christopher Nolan's sci-fi adventure \"Interstellar\", J.C. Chandor's crime drama \"A Most Violent Year\", and Simon Brand's thriller \"Default\". David recently wrapped production on Paramount's \"Captive\", a true-life crime thriller about a drug-addicted single mother (Kate Mara) who finds herself taken hostage in her apartment by an escaped convict (Oyelowo) after he murders the judge overseeing his trial, and the independent drama, \"Five Nights in Maine\". He serves as a producer on both films as well. David will also star in \"Nina\", a biographical drama focused on late musician, Nina Simone (played by Zoe Saldana) and her relationship with her manager, Clifton Henderson (Oyelowo) and \"Nightingale\", a psychological drama in which David plays the solitary character, Peter Snowden, an Iraq war veteran who suffers a mental breakdown, which will premiere on HBO on May 29th. His next project is \"The Queen of Katwe\" opposite Lupita Nyong'o. Additional film credits include Lee Daniel's The \"Butler\",Steven Spielberg's Academy Award nominated drama \"Lincoln\", with Daniel Day-Lewis, Sally Field and Tommy Lee Jones, the critically acclaimed independent drama, \"The Middle of Nowhere\", which earned David individual NAACP Image Awards and Independent Spirit Awards nominations, \"Jack Reacher\", opposite Tom Cruise, Lee Daniels' \"The Paperboy\", opposite Nicole Kidman, Matthew McConaughey and Zac Efron, the British made for television movie, \"Complicit\", George Lucas' produced WWII drama, \"Red Tails\", which won \"Best Motion Picture\" at the 2013 NAACP Image Awards, \"Rise of the Planet of the Apes\", alongside James Franco and Frieda Pinto, the Academy Award nominated drama \"The Help\", \"96 Minutes\", which premiered at the 2011 SXSW Film Festival, Kevin MacDonald's \"The Last King of Scotland\" opposite Forrest Whittaker and James MacAvoy, \"Who Do You Love\", in which he played the iconic Muddy Waters, \"A Sound of Thunder\" for Warner Bros, \"Derailed\" for Miramax, and \"Shoot the Messenger\" for BBC2. Oyelowo first impressed audiences on the stage when he starred in \"The Suppliants\" at the Gate Theatre playing King Palasgus, for which he received the Ian Charleson award commendation. Following this he played the title role of \"Henry VI\", becoming the first black actor to play an English king for the RSC (Royal Shakespeare Company). The role won him The Ian Charleson Award and an Evening Standard award nomination. Other theatre credits include an acclaimed performance in Richard Bean's \"The God Botherers\" at the Bush Theatre and the title role in Aeschylus' \"Prometheus Bound\", which was off-Broadway for which David received rave reviews. Beyond theatre, David starred in the BAFTA award winning series Spooks/MI:5 playing Danny Hunter. MI:5 also aired in the US on BBC America. Additionally, he won the Royal Television Society Award for Best Actor and was also nominated for a BAFTA for the same role for his work on \"Small Island\". David also starred in the BBC1 original television movie \"Born Equal\", opposite Colin Firth as well as ABC's 2008 production of \"A Raisin in the Sun\", alongside Sanaa Lathan and Sean Combs. David made his US debut in two HBO productions. First starring in the Kenneth Branagh directed \"As You Like It\", in which he played Orlando opposite Bryce Dallas Howard, which aired in August 2006. In October of the same year he was again seen on HBO as the lead in the mini-series \"Five Days\", for which he won the Satellite Award for Best Actor in a Mini-Series or Motion Picture Made for Television for his performance. In 2008, David starred in the acclaimed adaptation of the Alexander McCall Smith novel, \"The No.1 Ladies Detective Agency\", directed by the late Anthony Minghella. David currently resides in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzdiMzljMWEtZjg0ZC00ZWUzLTkxNjktMmNiMDhlOGJmNjlkL2ltYWdlXkEyXkFqcGdeQXVyOTkyMDQ2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654648","name":"David Oyelowo","idIMDB":"nm0654648"},"actorId":"nm0654648","character":"Louis Gaines","urlCharacter":"http://www.imdb.com/character/ch0395001","main":true},{"actorName":"Joe Chrest","urlProfile":"http://www.imdb.com/name/nm0159609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTQ4NDQ5M15BMl5BanBnXkFtZTgwMzU5ODY3NTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"A veteran of over 100 screen roles, and over 60 plays and musicals, Joe holds a BFA Degree in Directing from Marshall University in his home state of West Virginia, and an MFA Degree from Louisiana State University. He is a founding member of the regional theatre, Swine Palace, with RSC Director Emeritus Barry Kyle, and is the Founding Artistic Director of Ignition Film Repertory Company -- a company dedicated to nurturing and producing original works for the screen. Joe first appeared as the malevolent bellhop, Ben, in Steven Soderbergh's, \"King of the Hill\" and followed that with the widely acclaimed performance as Mr. Rodman in Soderbergh's,\"The Underneath.\" Nearly unrecognizable in many of his roles, Joe continues the chameleon-like range of these early performances to the widely different characters of recent films, from the steely quiet sharpshooter, Mitchell, in \"Mockingjay Part 2\" to Jonah Hill's nerdy dad, David Schmidt in \"21 Jump Street\" to the despicable Southern aristocrat, Amos Deason in \"Free State of Jones.\" Joe has also performed on stages from The Kennedy Center in Washington, D.C. to The Ahmanson Theatre in Los Angeles, working with Tony winning directors, Gordon Davidson and Jerry Zaks, and London Theatre Award winner and Olivier nominee, Barry Kyle. Joe served in The United States Air Force where he was recognized for \"Cold War\" service and expert marksmanship. Joe is married to choreographer (\"Pawn Shop Chronicles\") Christine Chrest. They have two kids, Nicolas and Samantha.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTQ4NDQ5M15BMl5BanBnXkFtZTgwMzU5ODY3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0159609","name":"Joe Chrest","idIMDB":"nm0159609"},"actorId":"nm0159609","character":"White Usher","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1327773","urlIMDB":"http://www.imdb.com/title/tt1327773","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$24,637,312","country":"USA","day":"18","month":"08","year":"2013","remarks":"2,933 Screens"},{"money":"£794,044","country":"UK","day":"17","month":"11","year":"2013","remarks":"284 Screens"},{"money":"HUF 4,229,685","country":"Hungary","day":"24","month":"11","year":"2013","remarks":"21 Screens"},{"money":"€1,187,000","country":"Italy","day":"06","month":"01","year":"2014","remarks":""}],"gross":[{"money":"$116,624,134","country":"USA","day":"02","month":"02","year":"2014","remarks":""},{"money":"$116,597,286","country":"USA","day":"26","month":"01","year":"2014","remarks":""},{"money":"$115,922,175","country":"USA","day":"08","month":"12","year":"2013","remarks":""},{"money":"$115,641,177","country":"USA","day":"01","month":"12","year":"2013","remarks":""},{"money":"$115,071,731","country":"USA","day":"03","month":"11","year":"2013","remarks":""},{"money":"$114,745,820","country":"USA","day":"27","month":"10","year":"2013","remarks":""},{"money":"$113,544,443","country":"USA","day":"13","month":"10","year":"2013","remarks":""},{"money":"$110,265,862","country":"USA","day":"29","month":"09","year":"2013","remarks":""},{"money":"$106,341,237","country":"USA","day":"22","month":"09","year":"2013","remarks":""},{"money":"$100,003,739","country":"USA","day":"15","month":"09","year":"2013","remarks":""},{"money":"$79,466,378","country":"USA","day":"01","month":"09","year":"2013","remarks":""},{"money":"$51,760,625","country":"USA","day":"25","month":"08","year":"2013","remarks":""},{"money":"$24,637,312","country":"USA","day":"18","month":"08","year":"2013","remarks":""},{"money":"£3,466,228","country":"UK","day":"08","month":"12","year":"2013","remarks":""},{"money":"£2,929,213","country":"UK","day":"01","month":"12","year":"2013","remarks":""},{"money":"£2,032,072","country":"UK","day":"24","month":"11","year":"2013","remarks":""},{"money":"€5,130,419","country":"Italy","day":"29","month":"06","year":"2014","remarks":""}],"weekendGross":[{"money":"$11,812","country":"USA","day":"02","month":"02","year":"2014","remarks":"52 Screens"},{"money":"$35,975","country":"USA","day":"26","month":"01","year":"2014","remarks":"101 Screens"},{"money":"$265,019","country":"USA","day":"08","month":"12","year":"2013","remarks":"1,007 Screens"},{"money":"$42,114","country":"USA","day":"01","month":"12","year":"2013","remarks":"71 Screens"},{"money":"$193,107","country":"USA","day":"03","month":"11","year":"2013","remarks":"312 Screens"},{"money":"$269,717","country":"USA","day":"27","month":"10","year":"2013","remarks":"444 Screens"},{"money":"$623,672","country":"USA","day":"13","month":"10","year":"2013","remarks":"980 Screens"},{"money":"$2,401,793","country":"USA","day":"29","month":"09","year":"2013","remarks":"2,062 Screens"},{"money":"$4,193,123","country":"USA","day":"22","month":"09","year":"2013","remarks":"2,931 Screens"},{"money":"$5,544,621","country":"USA","day":"15","month":"09","year":"2013","remarks":"3,239 Screens"},{"money":"$20,201,272","country":"USA","day":"01","month":"09","year":"2013","remarks":"3,330 Screens"},{"money":"$16,503,812","country":"USA","day":"25","month":"08","year":"2013","remarks":"3,110 Screens"},{"money":"$24,637,312","country":"USA","day":"18","month":"08","year":"2013","remarks":"2,933 Screens"},{"money":"£250,828","country":"UK","day":"08","month":"12","year":"2013","remarks":"282 Screens"},{"money":"£431,666","country":"UK","day":"01","month":"12","year":"2013","remarks":"314 Screens"},{"money":"£613,877","country":"UK","day":"24","month":"11","year":"2013","remarks":"304 Screens"},{"money":"£794,044","country":"UK","day":"17","month":"11","year":"2013","remarks":"284 Screens"}],"admissions":[{"money":"824,314","country":"Italy","day":"29","month":"06","year":"2014","remarks":""},{"money":"151,635","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""},{"money":"107,554","country":"Netherlands","day":"31","month":"12","year":"2013","remarks":""},{"money":"182,791","country":"Portugal","day":"27","month":"11","year":"2013","remarks":""},{"money":"181,760","country":"Portugal","day":"20","month":"11","year":"2013","remarks":""},{"money":"180,217","country":"Portugal","day":"13","month":"11","year":"2013","remarks":""},{"money":"177,779","country":"Portugal","day":"06","month":"11","year":"2013","remarks":""},{"money":"173,710","country":"Portugal","day":"30","month":"10","year":"2013","remarks":""},{"money":"168,029","country":"Portugal","day":"23","month":"10","year":"2013","remarks":""},{"money":"160,011","country":"Portugal","day":"16","month":"10","year":"2013","remarks":""},{"money":"149,959","country":"Portugal","day":"09","month":"10","year":"2013","remarks":""},{"money":"136,461","country":"Portugal","day":"02","month":"10","year":"2013","remarks":""},{"money":"111,909","country":"Portugal","day":"25","month":"09","year":"2013","remarks":""},{"money":"83,771","country":"Portugal","day":"18","month":"09","year":"2013","remarks":""},{"money":"47,886","country":"Portugal","day":"11","month":"09","year":"2013","remarks":""}],"productionDates":{"money":null,"country":null,"day":"05","month":"04","year":"2013","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"06","month":"08","year":"2012","remarks":null},{"money":null,"country":null,"day":"07","month":"10","year":"2012","remarks":null}],"copyrightHolder":"2013 Butler Films, LLC"},"technical":{"runtime":["2 hr 12 min (132 min)"],"soundMix":["Dolby Digital"],"color":["Color","Black and White"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex 435, Panavision Primo Lenses","Panavision Panaflex Millennium XL2, Panavision Primo Lenses","Panavision Panaflex Platinum, Panavision Primo and Angenieux Optimo Lenses"],"laboratory":["Cineworks, New Orleans (LA), USA","Technicolor PostWorks, New York (NY), USA (digital intermediate)"],"filmLength":["3,620 m (7 reels)"],"negativeFormat":["35 mm (Kodak Vision3 50D 5203, Vision3 250D 5207, Fuji Eterna Vivid 160T 8543, Eterna 250D 8563, Eterna 500T 8573)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"7.2","metascore":"66","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"rated":"PG-13","awards":[{"award":"BAFTA Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Best Make Up/Hair","names":[{"name":"Debra Denson","id":"nm0219734","role":null},{"name":"Beverly Jo Pryor","id":"nm0699385","role":null},{"name":"Candace Neal","id":"nm0623579","role":null}]}]}]},{"award":"Screen Actors Guild Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Performance by a Male Actor in a Leading Role","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null}]},{"category":"Outstanding Performance by a Female Actor in a Supporting Role","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Outstanding Performance by a Cast in a Motion Picture","names":[{"name":"Mariah Carey","id":"nm0001014","role":null},{"name":"John Cusack","id":"nm0000131","role":null},{"name":"Jane Fonda","id":"nm0000404","role":null},{"name":"Cuba Gooding Jr.","id":"nm0000421","role":null},{"name":"Terrence Howard","id":"nm0005024","role":null},{"name":"Lenny Kravitz","id":"nm0005107","role":null},{"name":"James Marsden","id":"nm0005188","role":null},{"name":"David Oyelowo","id":"nm0654648","role":null},{"name":"Alex Pettyfer","id":"nm1641117","role":null},{"name":"Vanessa Redgrave","id":"nm0000603","role":null},{"name":"Alan Rickman","id":"nm0000614","role":null},{"name":"Liev Schreiber","id":"nm0000630","role":null},{"name":"Forest Whitaker","id":"nm0001845","role":null},{"name":"Robin Williams","id":"nm0000245","role":null},{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"AARP Movies for Grownups Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Movies for Grownups Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]},{"titleAwardOutcome":"Nominated Movies for Grownups Award","categories":[{"category":"Best Actor","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null}]},{"category":"Best Grownup Love Story","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null},{"name":"Forest Whitaker","id":"nm0001845","role":null}]}]}]},{"award":"Acapulco Black Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Award","categories":[{"category":"Movie of the Year","names":[{"name":"Lee Daniels","id":"nm0200005","role":null},{"name":"Pamela Oas Williams","id":"nm0931423","role":null},{"name":"Cassian Elwes","id":"nm0255891","role":null},{"name":"Buddy Patrick","id":"nm5052148","role":null},{"name":"Laura Ziskin","id":"nm0957205","role":null}]}]},{"titleAwardOutcome":"Nominated Hollywood Award","categories":[{"category":"Artist of the Year","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null},{"name":"Out of the Furnace","id":"tt1206543","role":null},{"name":"Black Nativity","id":"tt1425922","role":null},{"name":"Fruitvale Station","id":"tt2334649","role":null}]},{"category":"Best Ensemble Cast","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null},{"name":"Terrence Howard","id":"nm0005024","role":null},{"name":"David Oyelowo","id":"nm0654648","role":null},{"name":"Oprah Winfrey","id":"nm0001856","role":null},{"name":"Michael James Madsen","id":"nm3311910","role":null},{"name":"Minka Kelly","id":"nm1310368","role":null},{"name":"Yaya DaCosta","id":"nm1861624","role":null},{"name":"Mariah Carey","id":"nm0001014","role":null},{"name":"Liev Schreiber","id":"nm0000630","role":null},{"name":"Alan Rickman","id":"nm0000614","role":null},{"name":"Robin Williams","id":"nm0000245","role":null},{"name":"Lenny Kravitz","id":"nm0005107","role":null},{"name":"Jane Fonda","id":"nm0000404","role":null},{"name":"Alex Pettyfer","id":"nm1641117","role":null},{"name":"Forest Whitaker","id":"nm0001845","role":null},{"name":"Cuba Gooding Jr.","id":"nm0000421","role":null}]},{"category":"Best Actor","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"David Oyelowo","id":"nm0654648","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Cuba Gooding Jr.","id":"nm0000421","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Best Director","names":[{"name":"Lee Daniels","id":"nm0200005","role":null}]}]}]},{"award":"African-American Film Critics Association (AAFCA) 2013","titlesAwards":[{"titleAwardOutcome":"Won AAFCA Award","categories":[{"category":"Top 10 Films","names":[]},{"category":"Best Actor","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"Alliance of Women Film Journalists 2013","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Best Ensemble Cast","names":[]}]}]},{"award":"ASCAP Film and Television Music Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"Rodrigo Leão","id":"nm0508195","role":null}]}]}]},{"award":"BET Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Movie","names":[]},{"category":"Best Actor","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null}]},{"category":"Best Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"Black Film Critics Circle Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won BFCC Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"Black Reel Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Motion Picture","names":[{"name":"Lee Daniels","id":"nm0200005","role":"Producer"},{"name":"Pamela Oas Williams","id":"nm0931423","role":"Producer"},{"name":"Laura Ziskin","id":"nm0957205","role":"Producer"},{"name":"Weinstein Company, The","id":null,"role":null}]},{"category":"Outstanding Actor, Motion Picture","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null}]},{"category":"Outstanding Supporting Actor, Motion Picture","names":[{"name":"David Oyelowo","id":"nm0654648","role":null}]},{"category":"Outstanding Supporting Actress, Motion Picture","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Outstanding Director, Motion Picture","names":[{"name":"Lee Daniels","id":"nm0200005","role":null}]},{"category":"Outstanding Ensemble","names":[{"name":"Leah Daniels Butler","id":"nm0200004","role":"Casting Director"},{"name":"Billy Hopkins","id":"nm0394119","role":"Casting Director"}]},{"category":"Outstanding Score","names":[{"name":"Rodrigo Leão","id":"nm0508195","role":null}]},{"category":"Outstanding Song","names":[{"name":"Fantasia Barrino","id":"nm1568881","role":"Performer & Writer"}]},{"category":"Outstanding Song","names":[{"name":"Gladys Knight","id":"nm0460912","role":"Performer"},{"name":"Lenny Kravitz","id":"nm0005107","role":"Writer"}]}]}]},{"award":"Broadcast Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Best Acting Ensemble","names":[]},{"category":"Best Makeup","names":[]}]}]},{"award":"Capri, Hollywood 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Capri Movie of the Year Award","categories":[{"category":"","names":[]}]}]},{"award":"Denver Film Critics Society 2014","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Golden Trailer","categories":[{"category":"Best Drama","names":[{"name":"Weinstein Company, The","id":null,"role":null},{"name":"AV Squad, The","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Most Original TV Spot","names":[{"name":"Weinstein Company, The","id":null,"role":null},{"name":"Seismic Productions","id":null,"role":null}]}]}]},{"award":"Hamptons International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Breakthrough Performer","categories":[{"category":"","names":[{"name":"David Oyelowo","id":"nm0654648","role":null}]}]}]},{"award":"Hollywood Film Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Film Award","categories":[{"category":"Director of the Year","names":[{"name":"Lee Daniels","id":"nm0200005","role":null}]}]},{"titleAwardOutcome":"Won Spotlight Award","categories":[{"category":"","names":[{"name":"David Oyelowo","id":"nm0654648","role":null}]}]}]},{"award":"Hollywood Makeup Artist and Hair Stylist Guild Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Artisan","categories":[{"category":"Best Contemporary Hair Styling - Feature Films","names":[{"name":"Candace Neal","id":"nm0623579","role":null},{"name":"Robert L. Stevenson","id":"nm0829042","role":null}]}]}]},{"award":"Houston Film Critics Society Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"Image Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Image Award","categories":[{"category":"Outstanding Actor in a Motion Picture","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null}]},{"category":"Outstanding Supporting Actor in a Motion Picture","names":[{"name":"David Oyelowo","id":"nm0654648","role":null}]}]},{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Motion Picture","names":[]},{"category":"Outstanding Supporting Actor in a Motion Picture","names":[{"name":"Terrence Howard","id":"nm0005024","role":null}]},{"category":"Outstanding Supporting Actor in a Motion Picture","names":[{"name":"Cuba Gooding Jr.","id":"nm0000421","role":null}]},{"category":"Outstanding Supporting Actress in a Motion Picture","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Outstanding Writing in a Motion Picture - (Theatrical or Television)","names":[{"name":"Danny Strong","id":"nm0834960","role":null}]},{"category":"Outstanding Directing in a Motion Picture","names":[{"name":"Lee Daniels","id":"nm0200005","role":null}]}]}]},{"award":"People's Choice Awards, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Dramatic Movie","names":[]}]}]},{"award":"Phoenix Film Critics Society Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"Prism Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Prism Award","categories":[{"category":"Performance in a Feature Film","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Feature Film - Substance Use","names":[{"name":"Weinstein Company, The","id":null,"role":null}]}]}]},{"award":"Santa Barbara International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Montecito Award","categories":[{"category":"","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"Satellite Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Actor in a Motion Picture","names":[{"name":"Forest Whitaker","id":"nm0001845","role":null}]},{"category":"Best Actress in a Supporting Role","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Best Art Direction &amp; Production Design","names":[{"name":"Diane Lederman","id":"nm0496509","role":null},{"name":"Tim Galvin","id":"nm0303472","role":null}]}]}]},{"award":"Village Voice Film Poll 2013","titlesAwards":[{"titleAwardOutcome":"Nominated VVFP Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"Washington DC Area Film Critics Association Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Joe Barber Award","categories":[{"category":"Best Portrayal of Washington, DC","names":[]}]}]},{"award":"Women Film Critics Circle Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won WFCC Award","categories":[{"category":"Hall of Shame","names":[{"name":"August: Osage County","id":"tt1322269","role":null},{"name":"Blue Jasmine","id":"tt2334873","role":null},{"name":"Nebraska","id":"tt1821549","role":null},{"name":"Only God Forgives","id":"tt1602613","role":null},{"name":"Carrie","id":"tt1939659","role":null}]}]},{"titleAwardOutcome":"Nominated WFCC Award","categories":[{"category":"Worst Female Images in a Movie","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]},{"award":"Women's Image Network Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated WIN Award","categories":[{"category":"Outstanding Actress Feature Film","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]},{"category":"Outstanding Feature Film","names":[]}]}]},{"award":"Yoga Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Yoga Award","categories":[{"category":"Worst Foreign Actress","names":[{"name":"Oprah Winfrey","id":"nm0001856","role":null}]}]}]}],"votes":"92,534","type":"Movie","companyCreditsSimple":[{"idCompany":"co0441398","name":"Follow Through Productions"},{"idCompany":"co0441397","name":"Salamander Pictures"},{"idCompany":"co0095403","name":"Laura Ziskin Productions"}],"keywords":{"keywords":["white house","butler","president","hotel","civil rights","domestic servant","civil rights movement","u.s. president","locked in jail","grave side ceremony","21 gun salute","flag draped coffin","killed in vietnam","black power","black panther","no opening credits","ku klux klan","washington d.c.","activism","1950s","united states of america","black history","woman","tie clip","holy bible","year 2008","bugler","birthday cake","gift wrapped birthday present","reference to j. edgar hoover","throwing son out of house","reference to sidney poitier","reference to john lewis","sewing machine","bombing","martin luther king assassination","bloody sunday","house negro","constipation","reference to uncle tom","president sitting on a toilet","james brown imitation","state dinner","party","125 pairs of shoes","playing poker","home aquarium","burning a bus","first lady crying","man crying","presidential speech","clothes hanger","archival footage","german shepherd","molotov cocktail","lying on the floor","riding a bus","burning cross","reference to martin luther king jr.","woman carrying a baby","year 1961","drinking fountain","segregation","scalded","drink thrown in face","spitting in face","gold flatware","setting a table","reference to mahatma gandhi","lunch counter","plate of cookies","oil painting","startled","dirty joke","louis xiii cognac","man wearing a tuxedo","handshake","working in the white house","portrait of george washington","man wearing white gloves","year 1957","waiter","martini","bandaging a wound","cut hand","breaking a store window","stealing food","hungry","caught in the rain","gold pocket watch","tear on cheek","seeing father murdered","murdering a slave","raping a slave","camera","cotton field","macon georgia","year 1926","begins with martin luther king jr. quotation","racial violence","racial tension","racial discrimination","racial prejudice","race relations","progressivism","propaganda film","liberal propaganda","race baiting","revisionist history","american president","bechdel test failed","no title at beginning","multiple time frames","white gloves","tuxedo","two word title","voice over narration","death of wife","apartheid","reference to malcolm x","freedom bus","prison","selma alabama","birmingham alabama","nashville tennessee","drinking problem","breaking and entering","cotton plantation","rape","n word","military funeral","vietnam war","kennedy assassination","2008 presidential election","reference to barack obama","student activist","estranged son","funeral","freedom rider","protest","prejudice","riot","sit in","black panther party","injustice","racism","1980s","1970s","1960s","father son relationship","marriage","african american","based on newspaper article","death of son","death of father","based on true story"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:33:18"}}