{"data":{"movies":[{"title":"If I Stay","originalTitle":"","year":"2014","releaseDate":"20140822","directors":[{"name":"R.J. Cutler","id":"nm0191712"}],"writers":[{"name":"Shauna Cross","id":"nm0189272"},{"name":"Gayle Forman","id":"nm3259208"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjkxODMyMF5BMl5BanBnXkFtZTgwODYwODQ5MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Fantasy","Music","Romance"],"plot":"Mia Hall thought the hardest decision she would ever face would be whether to pursue her musical dreams at Juilliard or follow a different path to be with the love of her life, Adam. But what should have been a carefree family drive changes everything in an instant, and now her own life hangs in the balance. Caught between life and death for one revealing day, Mia has only one decision left, which will not only decide her future but her ultimate fate.","simplePlot":"Life changes in an instant for young Mia Hall after a car accident puts her in a coma. During an out-of-body experience, she must decide whether to wake up and live a life far different than she had imagined. The choice is hers if she can go on.","actors":[{"actorName":"Chloë Grace Moretz","urlProfile":"http://www.imdb.com/name/nm1631269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODk0Mzc0Ml5BMl5BanBnXkFtZTgwNDYzMzgzMzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1997","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 4\" (1.63 m)","bio":"Chloë Grace Moretz was born in Atlanta, Georgia, to Teri (Duke), a nurse, and McCoy Lee Moretz, a plastic surgeon. She has four brothers, all older, including actor Trevor Duke-Moretz. Her ancestry is mostly German and English. Chloë's first two appearances were as Violet in two episodes of the series The Guardian (2001). Her first movie role was as Molly in Heart of the Beholder (2005), a story about a family that opened the first video rental store in 1980. This was followed by a small role in Family Plan (2005) as Young Charlie. After that, however, came Chloe's biggest role, and the one that made her famous: The Amityville Horror (2005), the remake of the famous The Amityville Horror (1979). Next she landed a small role in Today You Die (2005) as the Little Girl, and has since appeared in Room 6 (2006) and Big Momma's House 2 (2006). She filmed Wicked Little Things (2006) in Bulgaria, in which she plays Emma Tunney. In 2007 she completed The Third Nail (2007), in which she appeared as Hailey Deonte. In 2010 she appeared as Hit-Girl in director Matthew Vaughn's action film Kick-Ass (2010), based on the comic book series of the same name by Mark Millar and John Romita Jr. Although her role in the violent action film engendered some controversy, she received widespread critical acclaim for her portrayal. Moretz trained with Jackie Chan's stunt crew for three months prior to filming \"Kick-Ass\" and did most of her own stunts in the film. Also that year she played Abby, a 12-year-old vampire, in Let Me In (2010), the UK/US remake of the Swedish film Let the Right One In (2008), which was released on October 1, 2010. She played Ann Sliger in the crime thriller Texas Killing Fields (2011), released on October 14, 2011. Chloe next played Isabelle in Martin Scorsese's Hugo (2011), a film adaptation of \"The Invention of Hugo Cabret\". \"Hugo\", which was nominated for 11 Oscars, co-starred Asa Butterfield, Ben Kingsley, Sacha Baron Cohen and Helen McCrory. Moretz then starred in Hick (2011), an adaptation of the novel by Andrea Portes. She was in Tim Burton's Dark Shadows (2012), based on the iconic TV series Dark Shadows (1966), playing the role of Carolyn Stoddard, a rebellious teenage daughter. In 2013 she reprised her role as Hit-Girl in the sequel Kick-Ass 2 (2013), which received mixed reviews, but once again her performance was highly praised. The same year she also appeared in a short segment in Movie 43 (2013) and played the title character in Carrie (2013), a remake of Carrie (1976), based on a Stephen King story and directed by Kimberly Peirce. In January 2013 Moretz was chosen to play Mia in the film adaptation of Gayle Forman's If I Stay (2014), which was released in August 2014. On January 16, 2014, it was announced Moretz would appear in an off-Broadway show directed by Steven Soderbergh entitled \"The Library\". In 2014 Chloë was in six films: a cameo as a newspaper girl in Muppets Most Wanted (2014), the female lead of prostitute Teri alongside Denzel Washington in The Equalizer (2014) and teenage party girl Annika with Keira Knightley and Sam Rockwell in Laggies (2014). In December she played the role of very young Hollywood actress with a scandalous reputation Jo-Ann Ellis alongside Kristen Stewart and Juliette Binoche in Sils Maria (2014). In April it was announced that Chloë would be playing the lead role of Cassie Sullivan in The 5th Wave (2016), another adaptation similar to The Hunger Games (2012), alongside Nick Robinson and Alex Roe. It was later announced that Chloë would play the lead female role of Digger in the movie adaptation of Sam Munson's novel \"November Criminals\". Moretz's character is the best friend of Addison Schacht, played by Ansel Elgort,","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODk0Mzc0Ml5BMl5BanBnXkFtZTgwNDYzMzgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1631269","name":"Chloë Grace Moretz","nicknames":["Chloë Grace","Chloe the braniac"],"idIMDB":"nm1631269"},"actorId":"nm1631269","character":"Mia Hall","urlCharacter":"http://www.imdb.com/character/ch0402690","main":true},{"actorName":"Mireille Enos","urlProfile":"http://www.imdb.com/name/nm0257969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYyODMyOV5BMl5BanBnXkFtZTgwMzAyMDQ5MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1975","placeOfBirth":" Houston, Texas, USA","height":"5' 2\" (1.57 m)","bio":"Mireille Enos was born in Houston, Texas, to Monique, a teacher, and Jon Goree Enos. Her Texas-born American father, and French mother, met while her father was serving on a Mission for the Church of Jesus Christ of Latter Day Saints. She is the fourth of five children and grew up in Houston, Texas, where, following in her older siblings footsteps, she attended The High School for the Performing and Visual Arts. She then went to Brigham Young University. She spent ten years living in New York City during which time she was nominated for a Tony Award for her portrayal of \"Honey\" in Edward Albee's \"Who's Afraid of Virginia Woolf?\". She is now married to actor Alan Ruck.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYyODMyOV5BMl5BanBnXkFtZTgwMzAyMDQ5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0257969","name":"Mireille Enos","idIMDB":"nm0257969"},"actorId":"nm0257969","character":"Kat","urlCharacter":"http://www.imdb.com/character/ch0451848","main":true},{"actorName":"Jamie Blackley","urlProfile":"http://www.imdb.com/name/nm3284401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1Njc2OV5BMl5BanBnXkFtZTgwNzA5ODkzMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1991","placeOfBirth":" Douglas, Isle of Man, UK","birthName":"Jamie Alexander Blackley","height":"6' (1.83 m)","bio":"Jamie Blackley was born on July 8, 1991 in Douglas, Isle of Man, UK as Jamie Alexander Blackley. He is an actor, known for If I Stay (2014), Irrational Man (2015) and U Want Me 2 Kill Him? (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1Njc2OV5BMl5BanBnXkFtZTgwNzA5ODkzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3284401","name":"Jamie Blackley","idIMDB":"nm3284401"},"actorId":"nm3284401","character":"Adam","urlCharacter":"http://www.imdb.com/character/ch0471129","main":true},{"actorName":"Joshua Leonard","urlProfile":"http://www.imdb.com/name/nm0502671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ4MTc5NzY3OF5BMl5BanBnXkFtZTgwODQ5NTc0NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1975","placeOfBirth":" Houston, Texas, USA","birthName":"Joshua Granville Leonard","height":"5' 11\" (1.8 m)","bio":"A filmmaker, writer, and actor, Joshua Leonard has made an indelible mark on independent film and television throughout his career. He first came onto the scene in 1999 with lo-fi sensation The Blair Witch Project, perhaps one of the most talked about indie films of all time. As an actor, Leonard continues to work on projects that push the envelope, including 2009's Independent Spirit Award-winning Humpday, HBO's acclaimed series \"Hung,\" \"True Detective,\" and The Duplass Brothers' \"Togetherness,\" in addition to roles in the films Higher Ground by Vera Farmiga and If I Stay by RJ Cutler. Leonard's directorial debut, The Youth in Us premiered at Sundance in 2005; he followed that with the doc, Beautiful Losers. He made his narrative feature debut with The Lie (Sundance 2011), a devilish morality tale adapted from a story by acclaimed author, T.C. Boyle, which Leonard co-wrote, directed and starred in. He recently wrapped production on his sophomore feature as a director, Behold My Heart, starring Marisa Tomei and Timothy Olyphant, based on a script that he co-wrote. In addition, he's developing a one-hour television series for EPIX entitled \"Liberty,\" which he created and will EP alongside Cary Fukunaga.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ4MTc5NzY3OF5BMl5BanBnXkFtZTgwODQ5NTc0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502671","name":"Joshua Leonard","idIMDB":"nm0502671"},"actorId":"nm0502671","character":"Denny","urlCharacter":"http://www.imdb.com/character/ch0471489","main":true},{"actorName":"Liana Liberato","urlProfile":"http://www.imdb.com/name/nm1882929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDYzNzA2MV5BMl5BanBnXkFtZTgwMTU4NjA1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1995","placeOfBirth":" Galveston, Texas, USA","birthName":"Liana Daine Liberato","height":"5' 7\" (1.7 m)","bio":"Liana Liberato was born in Galveston, Texas, the daughter of Rhondelle, a former real estate agent, and George Liberato. Her first significant role came in \"Galveston: The Musical\" when she was age 7. In the summer of 2005, she attended a week-long acting camp in California, where she attracted the attention of Central Artists. Charmed by Liberato's \"great charisma and a very natural delivery,\" the agent asked Liana to travel to Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDYzNzA2MV5BMl5BanBnXkFtZTgwMTU4NjA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1882929","name":"Liana Liberato","idIMDB":"nm1882929"},"actorId":"nm1882929","character":"Kim","urlCharacter":"http://www.imdb.com/character/ch0471587","main":true},{"actorName":"Stacy Keach","urlProfile":"http://www.imdb.com/name/nm0005078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzEwODQ4Nl5BMl5BanBnXkFtZTYwMTA0NTQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1941","placeOfBirth":" Savannah, Georgia, USA","birthName":"Walter Stacy Keach Jr.","height":"5' 11½\" (1.82 m)","bio":"Stacy Keach has played to grand success a constellation of the classic and contemporary stage's greatest roles, and he is considered a pre-eminent American interpreter of Shakespeare. His SRO run as \"King Lear\" at the Shakespeare Theatre Company in Washington, D.C. received the best reviews any national leader has earned in that town for decades. Peter Marks of the Washington Post called Mr. Keach's Lear \"magnificent\". He recently accepted his third prestigious Helen Hayes Award for Leading Actor in 2010 for his stellar performance. His next stage appearance premiering January 13, 2011 at the Lincoln Center in New York is \"Other Desert Cities\" by Jon Robin Baitz and teaming him with Stockard Channing, Linda Lavin and Elizabeth Marvel. His latest television series, Lights Out (2011), on the FX network is a major new mid-season dramatic show, taking him back to the world of boxing which has been a rich setting for him before, notably in Huston's Fat City (1972) which ignited Keach's career as a film star. Versatility embodies the essence of Stacy Keach's career in film and television as well as on stage. The range of his roles is remarkable. His recent performance in Oliver Stone's \"W\" prompted fellow actor Alec Baldwin to blog an impromptu review matching Huston's amazement at Keach's power. Perhaps best known around the world for his portrayal of the hard-boiled detective, Mike Hammer, Stacy Keach is also well-known among younger generations for his portrayal of the irascible, hilarious Dad, Ken Titus, in the Fox sitcom, Titus, and more recently as Warden Henry Pope in the hit series, Prison Break. Following his triumphant recent title role performance in King Lear for the prestigious Goodman Theatre in Chicago, Keach joined the starring cast of John Sayles' recent film, Honeydripper. In the most recent of his non-stop activities, he has completed filming Deathmatch for the Spike Channel, and The Boxer for Zeitsprung Productions in Berlin, Germany. German audiences will also see him as one of the co-stars in the multi-million dollar production of Hindenburg: le géant des airs (2011), scheduled to air in January, 2011 with worldwide release thereafter. Mr. Keach co-stars in the new FX series entitled Lights Out (2011) about a boxing family, where he plays the Dad-trainer of two boxing sons played by Holt McCallany and Pablo Schreiber. The series is also scheduled to air in January, 2011. Keach returns to the New York stage at the start of the 2011 in Jon Robin Baitz's new play, \"Other Desert Cities,\" at the Lincoln Center. Capping his heralded accomplishment on the live stage of putting his own stamp on some of the theatre world's most revered and challenging roles over the past year when he headed the national touring company cast of \"Frost/Nixon,\" portraying Richard M. Nixon, bringing still another riveting characterization to the great legit stages of Los Angeles, Chicago, Boston, the nation's capitol and other major cities. He won his second Best Actor Helen Hayes Award for his outstanding performance. His second triumphant portrayal of King Lear in the past three years, this time for the Shakespeare Theatre Company in the nation's capital earned reviews heard around the world, with resulting offers for him to repeat that giant accomplishment in New York, Los Angeles and even Beijing. An accomplished pianist and composer, Mr. Keach composed the music for the film, Imbued (2009), directed by Rob Nilssen, a celebrated film festival favorite, in which Keach also starred. He has also completed composing the music for the Mike Hammer audio radio series, \"Encore For Murder\", written by Max Collins, directed by Carl Amari, and produced by Blackstone Audio. Mr. Keach began his film career in the late 1960's with _The Heart Is A Lonely Hunter_, followed by _The New Centurions_ with George C. Scott; Doc Holiday with Faye Dunaway in the film 'Doc' (1971); an over-the-hill boxer,Billy Tully in Fat City (1972); directed by John Huston, and The Long Riders (1980), which he co-produced and co-wrote with his brother, James Keach, directed by Walter Hill. On the lighter side, his characterization of Sgt. Stedenko in Cheech and Chong's Up in Smoke (1978), and the sequel, Nice Dreams (1981), gave a whole new generation a taste of Mr. Keach's comedic flair, which he also demonstrated in Robert Altman's Brewster McCloud (1970), playing the oldest living lecherous Wright Brother; and The Life and Times of Judge Roy Bean (1972) where he played a crazed albino out to kill Paul Newman. Historical roles have always attracted him. In movies he has played roles ranging from Martin Luther to Frank James. On television he has been Napoleon, Wilbur Wright, J. Robert Oppenheimer, Barabbas, Sam Houston, and Ernest Hemingway, for which he won a Golden Globe as Best Actor in a mini-series and was nominated for an Emmy in the same category. He played an eccentric painter, Mistral, in the Judith Krantz classic, Mistral's Daughter (1984), a northern spy in the civil war special, The Blue and the Gray (1982), more recently as the pirate Benjamin Hornigold in the Hallmark epic Blackbeard (2006). As a director, his production of Arthur Miller's Incident at Vichy (1973) for PBS was, according to Mr. Miller in his autobiography, Timebends, \"the most expressive production of that play he had seen.\" He won a Cine Golden Eagle Award for his work on the dramatic documentary, The Repeater, in which he starred and also wrote and directed. But it is perhaps the live theatre where Mr. Keach shines brightest. He began his professional career with the New York Shakespeare Festival in 1964, doubling as Marcellus and the Player King in a production of Hamlet directed by Joseph Papp and which featured Julie Harris as Ophelia. He rose to prominence in 1967 in the Off-Broadway political satire, MacBird, where the title role was a cross between Lyndon Johnson and Macbeth and for which he received the first of his three Obie awards. He played the title roles in Henry 5, Hamlet (which he played 3 times), Richard 3, Macbeth, and most recently as King Lear in Robert Falls' modern adaptation at Chicago's Goodman Theatre, which Charles Isherwood of the NY Times called \"terrific\" and \"a blistering modern-dress production that brings alive the morally disordered universe of the play with a ferocity unmatched by any other production I've seen.\" Mr. Keach's stage portrayals of Peer Gynt, Falstaff and Cyrano de Bergerac, and Hamlet caused the New York Times to dub him \"the finest American classical actor since John Barrymore.\" Mr. Keach's Broadway credits include his Broadway debut, Indians, where he played Buffalo Bill and was nominated for a Tony award as Best Actor. He starred in Ira Levin's Deathtrap, the Pulitzer Prize winning Kentucky Cycle (for which he won his first Helen Hayes award as Best Actor), the Rupert Holmes one-man thriller, Solitary Confinement, where Mr. Keach played no less than six roles, all unbeknownst to the audience until the end of the play. In the musical theatre, he starred in the national tour of Barnum, played the King in Camelot for Pittsburgh's Civic Light Opera, and the King in The King and I, which he also toured in Japan. He starred in the Jon Robin Baitz play, Ten Unknowns, at the Mark Taper Forum in 2003. The LA Times said: \"And then there's Keach. What a performance! How many actors can manage such thunder and such sweet pain. He's been away from the LA stage too long. Welcome back.\" In 2004, he starred as Scrooge in Boston's Trinity Rep musical production of A Christmas Carol; earlier in 2004, he starred as Phil Ochsner in Arthur Miller's last play Finishing The Picture, directed by Robert Falls at the Goodman Theatre. As a narrator his voice has been heard in countless documentaries; as the host for the Twilight Zone radio series; numerous books on tape, including the Short Stories of Ernest Hemingway. In the year 2000, he recorded a CD of all of Shakespeare's Sonnets. He recently recorded the voice of St. Paul for a new audio version of The New Testament:, The Word of Promise and Job for the Old Testament edition. He is the narrator on CNBC's new hit show, American Greed (2007), and recently narrated the award-winning documentary, The Pixar Story (2007). He has also reprised his role as Mike Hammer in the Blackstone audio series, the most recent being \"Encore for Murder\". A charter-member of LA Theatre Works, Mr. Keach recently played the title role in Bertolt Brecht's Galileo, recorded both for radio and CD. He was seen on CBS's hit show Two and a Half Men (2003) as the gay Dad of Charlie's fiance. Stacy Keach also believes strongly in 'giving back' and has been the Honorary Chair for the Cleft Palate Foundation for the past twenty-five years. He is also the national spokesman for the World Craniofacial organization. He has served on the Artist's Committee for the Kennedy Center Honors for two decades, is on the board of directors for Genesis at the Crossroads, a Chicago-based organization dedicated to bringing peoples of combatant cultures together through the shared artistic expressions of the visual and culinary arts, music, dance, and theater. He also serves on the artistic board for Washington DC's Shakespeare Theatre National Council, where he was also honored in 2000 with their prestigious Millennium Award for his contribution to classical theatre. Some years ago Hollywood honored him with a Celebrity Outreach Award for his work with charitable organizations. He has been the recipient of Lifetime Achievement Awards from Pacific Pioneer's Broadcasters, the San Diego Film Festival, the Pacific Palisades Film Festival, and The 2007 Oldenburg Film Festival in Germany. Later this year, he will be awarded the 2010 Lifetime Award from the St. Louis Film Festival. In 2008, he received the Mary Pickford Award for versatility in acting. Mr. Keach was a Fulbright scholar to the London Academy of Music and Dramatic Art, attended the University of California at Berkeley and the Yale Drama School. He has always been a star of the American stage, especially in Shakespearen roles such as Hamlet, Henry 5, Coriolanus, Falstaff, Macbeth, Richard 3, and most recently, King Lear. Of his many accomplishments, Mr. Keach claims that his greatest accomplishment is his family. He has been married to his beautiful wife Malgosia for twenty-five years, and they have two wonderful children, Shannon Keach (1988), and daughter Karolina Keach (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzEwODQ4Nl5BMl5BanBnXkFtZTYwMTA0NTQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005078","name":"Stacy Keach","idIMDB":"nm0005078"},"actorId":"nm0005078","character":"Gramps","urlCharacter":"http://www.imdb.com/character/ch0472995","main":true},{"actorName":"Gabrielle Rose","urlProfile":"http://www.imdb.com/name/nm0741388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkyNDAyNzQ3MF5BMl5BanBnXkFtZTgwODA4MzM3NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1954","placeOfBirth":" Canada","height":"5' 5\" (1.65 m)","bio":"Gabrielle Rose was born in 1954 in Canada. She is an actress, known for De beaux lendemains (1997), If I Stay (2014) and Les cinq sens (1999). She is married to Hrothgar Mathews. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkyNDAyNzQ3MF5BMl5BanBnXkFtZTgwODA4MzM3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0741388","name":"Gabrielle Rose","idIMDB":"nm0741388"},"actorId":"nm0741388","character":"Gran","urlCharacter":"http://www.imdb.com/character/ch0488794","main":true},{"actorName":"Jakob Davies","urlProfile":"http://www.imdb.com/name/nm3240434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2UxYjRhOGMtZDkwZi00MzU0LTgzNzUtMDVlMjVjMGI0NmE5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 2003","placeOfBirth":" White Rock, British Columbia, Canada","height":"5' 1\" (1.55 m)","bio":"Jakob Davies began acting in 2009 and was featured in several National and International Commercials. Jakob quickly transitioned to Television and Movies where he has been cast in 24 productions to date. He has been fortunate to portray iconic characters such as \"Lex Luther\" (Smallville) and the recurring role of \"Pinocchio\" on ABC's \"Once Upon a Time\". He has worked with Director Jean-Pierre Jeunet (Amelie) in \"The Young and Prodigious Spivet\", and co starred with Chloe Grace Moretz in the feature film \"If I Stay\". Despite his acting credits, Jakob remains grounded attending public school where he enjoys spending time with his friends. He participates in team sports (Football) and continues to love acting where strives to be his best in each and every project put before him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2UxYjRhOGMtZDkwZi00MzU0LTgzNzUtMDVlMjVjMGI0NmE5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3240434","name":"Jakob Davies","idIMDB":"nm3240434"},"actorId":"nm3240434","character":"Teddy","urlCharacter":"http://www.imdb.com/character/ch0488795","main":true},{"actorName":"Willa Milner","urlProfile":"http://www.imdb.com/name/nm4072119","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDYxODY4MGItMzU4Zi00NTI3LWIxYWYtNjc1M2Y5OWFmNmYzL2ltYWdlXkEyXkFqcGdeQXVyNDc4NzQxMDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Willa Milner is an actress, known for If I Stay (2014), A Rose for Christmas (2017) and Lost & Found Music Studios (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDYxODY4MGItMzU4Zi00NTI3LWIxYWYtNjc1M2Y5OWFmNmYzL2ltYWdlXkEyXkFqcGdeQXVyNDc4NzQxMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4072119","name":"Willa Milner","idIMDB":"nm4072119"},"actorId":"nm4072119","character":"Liz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aisha Hinds","urlProfile":"http://www.imdb.com/name/nm1490300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjU0NTA3OF5BMl5BanBnXkFtZTgwNjIyNjM2NDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1975","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7\" (1.7 m)","bio":"When Aisha Hinds' junior high school tap dance instructor observed that she needed an outlet for expression that surpassed her tap shoes, she was guided to the High School of Performing Arts in New York - where her formal acting training began. Hinds' numerous television credits include a supporting role on \"Detroit 1-8-7\", recurring roles on \"HawthoRNe\" and \"The Shield\" and guest appearances on \"Boston Legal,\" \"Medium,\" \"CSI: NY,\" \"Judging Amy,\" \"Crossing Jordan,\" \"ER\" and \"NYPD Blue.\" She also starred opposite Marcia Gay Harden in the pilot \"H.A.TE.\" Her feature film roles include \"Assault on Precinct 13,\" \"Neo Ned\" and \"Love... More Aquarium.\" On stage, her theatre credits include August Wilson's \"Fences\" and \"'Night, Mother\" at the American Theatre of Harlem; \"Tartuffe,\" \"Anything Goes\" and \"Mame\" at the Jerry Herman Ring Theatre; and George C. Wolfe's \"The Colored Museum\" and \"A Piece of My Heart\" at the Alvin Sherman Stage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjU0NTA3OF5BMl5BanBnXkFtZTgwNjIyNjM2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1490300","name":"Aisha Hinds","nicknames":["A.I.","Esh"],"idIMDB":"nm1490300"},"actorId":"nm1490300","character":"Nurse Ramirez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabrielle Cerys Haslett","urlProfile":"http://www.imdb.com/name/nm6697699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NDYzMDc0OF5BMl5BanBnXkFtZTgwNjM0NjM1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"4' 3\" (1.3 m)","bio":"Gabrielle Cerys Haslett is an actress, known for If I Stay (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NDYzMDc0OF5BMl5BanBnXkFtZTgwNjM0NjM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6697699","name":"Gabrielle Cerys Haslett","idIMDB":"nm6697699"},"actorId":"nm6697699","character":"Young Mia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lauren Lee Smith","urlProfile":"http://www.imdb.com/name/nm0809049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTUyOTA1Ml5BMl5BanBnXkFtZTcwMDMwODgyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1980","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 10\" (1.78 m)","bio":"Lauren Lee Smith was born on June 19, 1980 in Vancouver, British Columbia, Canada. She is an actress and producer, known for Lie with Me (2005), Cinemanovels (2013) and CSI: Crime Scene Investigation (2000). She has been married to Erik Lee Steingröver since April 4, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTUyOTA1Ml5BMl5BanBnXkFtZTcwMDMwODgyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0809049","name":"Lauren Lee Smith","idIMDB":"nm0809049"},"actorId":"nm0809049","character":"Willow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Solomonian","urlProfile":"http://www.imdb.com/name/nm6203757","urlPhoto":"","biography":{"bio":"Adam Solomonian is an actor, known for If I Stay (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6203757","name":"Adam Solomonian","idIMDB":"nm6203757"},"actorId":"nm6203757","character":"Henry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Emmet Tracy","urlProfile":"http://www.imdb.com/name/nm1356757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NzE4MTI0N15BMl5BanBnXkFtZTcwNDUzNTI2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1969","placeOfBirth":" Chicago, Illinois, USA","bio":"John Emmet Tracy was born on July 2, 1969 in Chicago, Illinois, USA. He is an actor, known for The BFG (2016), Olympus (2015) and Supernatural (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NzE4MTI0N15BMl5BanBnXkFtZTcwNDUzNTI2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1356757","name":"John Emmet Tracy","idIMDB":"nm1356757"},"actorId":"nm1356757","character":"Surgeon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chelah Horsdal","urlProfile":"http://www.imdb.com/name/nm1319098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODA1NzI4Nl5BMl5BanBnXkFtZTgwNzAyOTY0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1973","placeOfBirth":" Vancouver Island, British Columbia, Canada","birthName":"Chelah P. Horsdal","height":"5' 9\" (1.75 m)","bio":"Chelah grew up in the Vancouver community of Kitsilano. At eighteen, by-way of modeling, Chelah appeared in a couple of locally shot TV shows and commercials before packing her bags and moving to the Caribbean for a year. Upon returning home to Canada, Chelah took the long route back to acting...restaurant management, interior design, creative director of a magazine, event production, voice agent....until finally returning to acting in 2002. Chelah then committed herself to full-fledged study of her chosen craft at Lyric School of Acting and immersed herself as a student in all there was to read, watch & soak up. She has since appeared in multiple films, television movies, TV series & over 75 commercials. Highlights have been numerous but, at the top of the list, has been working with Sir Ben Kinsley, Mandy Patinkin, Laurie Metcalf, Jean Reno, Jennifer Love Hewitt, John Lithgow & Paul Dinello....the list goes on and on. Despite a busy work schedule, Chelah continues to study whenever she can find the time. Teachers Larry Moss, John Cassini, Ben Ratner & Ivana Chubbuck, among others, offer inspiration and new approaches for the moving target of art. Although often working out of town, Chelah continues to proudly call Vancouver home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODA1NzI4Nl5BMl5BanBnXkFtZTgwNzAyOTY0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1319098","name":"Chelah Horsdal","idIMDB":"nm1319098"},"actorId":"nm1319098","character":"Liddy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1355630","urlIMDB":"http://www.imdb.com/title/tt1355630","business":{"budget":{"money":"$11,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"HUF 6,043,125","country":"Hungary","day":"14","month":"09","year":"2014","remarks":""}],"gross":[{"money":"$49,128,389","country":"USA","day":"28","month":"09","year":"2014","remarks":""},{"money":"$29,822,000","country":"USA","day":"31","month":"08","year":"2014","remarks":""}],"weekendGross":[{"money":"$932,318","country":"USA","day":"28","month":"09","year":"2014","remarks":"1,272 Screens"},{"money":"$9,260,000","country":"USA","day":"31","month":"08","year":"2014","remarks":"3,003 Screens"}],"admissions":[{"money":"85,637","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 47 min (107 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus 4:3, Hawk V-Lite Lenses","Canon EOS C500, Cooke Speed Panchro and Angenieux Optimo Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["2,923 m (6 reels)"],"negativeFormat":["Codex ARRIRAW (2.8K)"],"cinematographicProcess":["Canon Cinema RAW (4K) (source format) (some scenes)","Digital Intermediate (2K) (master format)","Hawk Scope (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6.8","metascore":"46","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"PG-13","awards":[{"award":"People's Choice Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Dramatic Movie","names":[]}]}]},{"award":"Teen Choice Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Choice Movie: Drama","names":[]},{"category":"Choice Movie Actress: Drama","names":[{"name":"Chloë Grace Moretz","id":"nm1631269","role":null}]}]}]}],"votes":"90,883","type":"Movie","companyCreditsSimple":[{"idCompany":"co0062957","name":"DiNovi Pictures"},{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0046718","name":"New Line Cinema"}],"keywords":{"keywords":["out of body experience","coma","teenage girl","car accident","reference to the exploited","reference to skype","reference to sonic youth","grandfather granddaughter relationship","reference to the clash","halloween","reference to kim gordon","reference to joan jett","reference to patti smith","reference to debbie harry","best friend","kitchen","rock concert","aspiring musician","reference to the ramones","classical concert","high school","ambulance","reference to alice cooper","car crash","reference to ludwig van beethoven","reference to iggy pop","father daughter relationship","mother daughter relationship","boyfriend girlfriend relationship","audition","classical music","playing cello","cello","flashback","hospital","based on young adult novel","musician","lesbian kiss","teenager in love","death","halloween costume","reference to yo yo ma","no opening credits","family relationships","drummer","girlfriend in a coma","three word title","reference to the sex pistols","loss of father","loss of mother","loss of family","bonfire","labor day","break up","reference to lucinda williams","bee sting","skateboard","reference to peanuts","party","lesbian","first kiss","first date","portland oregon","gurney","snow day","reference to franz schubert","reference to the shins","winter","narration","singing in a car","indianapolis indiana","loss of brother","death of brother","loss of parents","death of parents","doctor","boyfriend","school","teenage love","juilliard school manhattan new york city","teenager","punk rock","multiple storyline"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:26:36"}}