{"data":{"movies":[{"title":"Brothers on the Line","originalTitle":"","year":"2012","releaseDate":"20120308","directors":[{"name":"Sasha Reuther","id":"nm3256240"}],"writers":[],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDQ1MDE2MF5BMl5BanBnXkFtZTcwMjgyNTA1Nw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary"],"plot":"An acclaimed documentary feature exploring the extraordinary journey of the Reuther brothers - Walter, Roy, and Victor - prolific labor statesman whose social justice movement, under the banner of the United Auto Workers union, transformed the landscape of a nation. Directed by Victor's grandson, Sasha, and narrated by Martin Sheen, the film is an in-depth study of one family's rise from auto plant organizers in 1930s Detroit to leaders in collective bargaining, Civil Rights activism, and international labor solidarity. Behind the dramatic headlines of picket line conflict, assassination attempts, heated Senate hearings, and inter-union power struggles, lies a stirring personal story of determination, sacrifice, triumph, and tragedy. This influential and often controversial 40-year crusade would contribute to lifting millions of workers to a middle-class living and compel American democracy to live up to its promise of equality.","simplePlot":"An acclaimed documentary feature exploring the extraordinary journey of the Reuther brothers - Walter, Roy, and Victor - prolific labor statesman whose social justice movement, under the ... ","actors":[{"actorName":"Walter Reuther","urlProfile":"http://www.imdb.com/name/nm0720717","urlPhoto":"","biography":{"dateOfBirth":"1 September 1907","placeOfBirth":" Wheeling, West Virginia, USA","birthName":"Walter Philip Reuther","bio":"Walter Reuther was born on September 1, 1907 in Wheeling, West Virginia, USA as Walter Philip Reuther. He is known for his work on The March (1964), Mid Century: Half Way to Where? (1950) and The March in Washington (1963). He was married to May. He died on May 9, 1970 in Pellston, Michigan, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0720717","name":"Walter Reuther","idIMDB":"nm0720717"},"actorId":"nm0720717","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Sheen","urlProfile":"http://www.imdb.com/name/nm0000640","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM1MTA5MTY0MV5BMl5BanBnXkFtZTcwMTQ4OTUzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1940","placeOfBirth":" Dayton, Ohio, USA","birthName":"Ramon Antonio Gerard Estevez","height":"5' 7\" (1.7 m)","bio":"Multiple Emmy- and Golden Globe-winner Martin Sheen is one of America's most celebrated, colorful, and accomplished actors. Moving flawlessly between artistic mediums, Sheen's acting range is striking. Sheen was born Ramón Antonio Gerard Estevez in Dayton, Ohio, to Mary-Ann (Phelan), an Irish immigrant (from Borrisokane, County Tipperary), and Francisco Estevez, a Spanish-born factory worker and machinery inspector (from Parderrubias, Galicia). On the big screen, Sheen has appeared in more than 65 feature films including a star turn as Army Captain Benjamin L. Willard in Francis Ford Coppola's landmark film Apocalypse Now (1979), which brought Sheen worldwide recognition. The film also starred Marlon Brando, Dennis Hopper and Robert Duvall. Other notable credits include Wall Street (1987) (with son Charlie Sheen and Michael Douglas), Academy Award-winning film Gandhi (1982) (with Sir Ben Kingsley), Catch Me If You Can (2002) (with Leonardo DiCaprio and Tom Hanks), The American President (1995) (with Michael Douglas and Annette Bening) and a Golden Globe nominated breakthrough performance as Timmy Cleary in The Subject Was Roses (1968), a role he originated on Broadway and for which he received a Tony Award nomination as Best Featured Actor. In 2006, the actor played ill-fated cop Oliver Queenan in Martin Scorsese's Academy Award-winning film The Departed (2006) opposite Leonardo DiCaprio, Matt Damon, Jack Nicholson, Mark Wahlberg and Alec Baldwin. The same year, Sheen joined another all-star ensemble cast for the highly acclaimed feature Bobby (2006), written and directed by his son 'Emilio Estevez'. Bobby was nominated for a Golden Globe Award and a SAG Award; and starred Anthony Hopkins, Harry Belafonte, Laurence Fishburne, Sharon Stone, William H. Macy, Elijah Wood, Demi Moore and Heather Graham. For television audiences, Sheen is best recognized for his six-time Emmy nominated performance as President Josiah Bartlet in The West Wing (1999). Sheen won six of his eight Golden Globe nominations as well as an ALMA Award; and two individual SAG Awards; for the White House series. He won the Golden Globe Award for Best Performance by an Actor TV Series Drama in 2001. Of his ten Primetime Emmy nominations, Sheen won for Outstanding Guest Actor in a Comedy Series on the long-running sitcom Murphy Brown (1988) (starring Candice Bergen) in 1994. In addition, he has garnered a Daytime Emmy Award for directing and another for performance. In 2006, Sheen was again nominated for an Emmy for Outstanding Guest Actor in a Comedy Series; this time for the CBS hit comedy Two and a Half Men (2003), starring his son Charlie Sheen. In addition to series television, Sheen has appeared in several important made-for-television movies and mini-series including playing President John F. Kennedy in the television mini-series Kennedy (1983) for which he received a Golden Globe nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM1MTA5MTY0MV5BMl5BanBnXkFtZTcwMTQ4OTUzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000640","name":"Martin Sheen","idIMDB":"nm0000640"},"actorId":"nm0000640","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Reuther","urlProfile":"http://www.imdb.com/name/nm1532822","urlPhoto":"","biography":{"dateOfBirth":"1 January 1912","placeOfBirth":" Wheeling, West Virginia, USA","bio":"Victor Reuther was born on January 1, 1912 in Wheeling, West Virginia, USA. He was married to Sofia Reuther. He died on May 27, 2004 in Washington, District of Columbia, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1532822","name":"Victor Reuther","idIMDB":"nm1532822"},"actorId":"nm1532822","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roy Reuther","urlProfile":"http://www.imdb.com/name/nm3470559","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Roy Reuther yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3470559","name":"Roy Reuther","idIMDB":"nm3470559"},"actorId":"nm3470559","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted Kennedy","urlProfile":"http://www.imdb.com/name/nm0448356","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDM0NDUzOV5BMl5BanBnXkFtZTgwMzA1MzU1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1932","placeOfBirth":" Brookline, Massachusetts, USA","birthName":"Edward Moore Kennedy","height":"5' 11\" (1.8 m)","bio":"Edward Moore Kennedy was born in Brookline, Massachusetts, on February 22, 1932. His parents were Joseph P. Kennedy and Rose Kennedy. He was the younger brother of President John F. Kennedy and Senator Robert F. Kennedy. \"Ted\" Kennedy graduated Harvard University in 1956 and the University of Virginia Law School in 1959. He campaigned for his brother John during the latter's 1960 presidential bid. Ted was elected to the U.S. Senate in 1962 and held that position until his death. As a Senator, he had served as majority whip and chaired Senate committees. His rise was hampered by the Chappaquiddick Island incident on July 18, 1969, when he accidentally drove his car off a bridge, resulting in the drowning of his passenger, Mary Jo Kopechne. He was convicted of leaving the scene of an accident. In 1980, he unsuccessfully challenged Jimmy Carter for the Democratic presidential nomination. In May of 2008, Kennedy experienced a stroke that resulted in hi being diagnosed with brain cancer. He remained active and endorsed President Barack Obama's candidacy early-on. He died at his family compound on Cape Cod in Hyannis, Massachusetts, August 25, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDM0NDUzOV5BMl5BanBnXkFtZTgwMzA1MzU1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448356","name":"Ted Kennedy","nicknames":["Lion of the Senate"],"idIMDB":"nm0448356"},"actorId":"nm0448356","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John F. Kennedy","urlProfile":"http://www.imdb.com/name/nm0448123","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyOTA5NTE5NV5BMl5BanBnXkFtZTcwNDMxNzMwNA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1917","placeOfBirth":" Brookline, Massachusetts, USA","birthName":"John Fitzgerald Kennedy","height":"6' (1.83 m)","bio":"John Fitzgerald Kennedy was born on May 29, 1917 in Brookline, Massachusetts, to Rose Kennedy (née Rose Elizabeth Fitzgerald) and Joseph P. Kennedy. John was named after his maternal grandfather, John \"HoneyFitz\" Fitzgerald, the mayor of Boston. John was very ill as a child and was given the last rites five times, the first one being when he was a new-born. He was the second of four boys born to an Irish Catholic family with nine children: Joseph Jr., John, Robert F. Kennedy (called Bobby), and Ted Kennedy (born Edward). Because Rose made Joe and Jack (the name his family called him) wear matching clothes, they fought a lot for attention. When John was young, the family moved from Boston to New York. John went to Choate, a private school. Most of the time, though, he was too sick to attend. In the late 1930s, father Joe became the ambassador to England. He took sons John and Robert with him, as well as his wife and daughters Kathleen and Rosemary Kennedy. John went to Princeton, then Harvard, and for his senior thesis, he wrote a piece about why England refused to get into the war until late. It was published in 1940 and called \"Why England Slept\". His older brother Joe was a pilot during the war, and was killed when the bombs his plane was carrying exploded. Not long after that, John's sister Kathleen and her husband died in a plane crash. In the early 1950s, John ran for Congress in Massachusetts and won. He married Jacqueline Kennedy (thirteen years his junior, born Jacqueline Lee Bouvier) on September 12, 1953. He became a father rather late in life. Their first child, Caroline Kennedy, was born on November 27, 1957 when J.F.K. was forty and their son, John Kennedy Jr., was born on November 25, 1960 when J.F.K. was forty-three. They had a son named Patrick Bouvier, but he died a few days after birth. In 1954, J.F.K. had to have back surgery and in the hospital wrote his second book, \"Profiles in Courage\". His father always said that his son Joe was going to be President of the U.S.; when he died in World War II, though, that task was passed on to John. He ran for president in 1960 against Richard Nixon and won. His administration had many conflicts, the Bay of Pigs and the Cuban Missile Crisis being key examples. In November 1963, he and Jackie (his wife's nickname) went on a trip to Texas. Everywhere they went there were signs saying \"Jack and Jackie.\" On November 22, 1963, John was to give a speech in Dallas, but on his way an assassin hidden on the sixth floor of the Texas School Book Depository opened fire at Kennedy, who was riding in an open car. Hit twice and severely wounded, Kennedy died in a local hospital at 1:00 P.M. The alleged assassin, Lee Harvey Oswald, was captured a short time later after shooting and killing a Dallas policeman, and was himself assassinated before he could be thoroughly interrogated, let alone tried. In just a little bit of irony, considering the death of Abraham Lincoln a century earlier, Kennedy was shot in a Ford Lincoln (Lincoln was in Ford's Theater when he was shot). He was laid to rest on his son's third birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyOTA5NTE5NV5BMl5BanBnXkFtZTcwNDMxNzMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448123","name":"John F. Kennedy","nicknames":["J.F.K.","Jack","Crash Kennedy","Shafty","Rat Face"],"idIMDB":"nm0448123"},"actorId":"nm0448123","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert F. Kennedy","urlProfile":"http://www.imdb.com/name/nm0448305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDI1ODc5NV5BMl5BanBnXkFtZTYwMjQyODc4._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1925","placeOfBirth":" Brookline, Massachusetts, USA","birthName":"Robert Francis Kennedy","height":"5' 9\" (1.75 m)","bio":"Robert Francis Kennedy (1925-68), US politician, was born in Brookline, Massachusetts, the third son of Ambassador Joseph P. Kennedy and wife Rose Kennedy. He studied at Harvard and at Virginia University Law School, served at sea (1944-46) in World War II, was admitted to the bar (1951), and served on the Senate Select Committee on Improper Activities (1957-59), when he prosecuted several top union leaders. An efficient manager of his brother John F. Kennedy's presidential campaign, he was an energetic Attorney General (1961-64), notably in his dealings with civil rights problems. He became senator from New York in 1965. After winning the Californian Democratic presidential primary election, he was shot at a hotel in Los Angeles. His assassin, Sirhan Sirhan, a 24-year-old Jordanian-born immigrant, was sentenced to the gas chamber in 1969, but was not executed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDI1ODc5NV5BMl5BanBnXkFtZTYwMjQyODc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448305","name":"Robert F. Kennedy","nicknames":["R.F.K.","Bobby"],"idIMDB":"nm0448305"},"actorId":"nm0448305","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lyndon Johnson","urlProfile":"http://www.imdb.com/name/nm0425696","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNTk1MDM4MjheQTJeQWpwZ15BbWU3MDYwNjEyMzg@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1908","placeOfBirth":" Stonewall, Texas, USA","birthName":"Lyndon Baines Johnson","height":"6' 3½\" (1.92 m)","bio":"Lyndon Johnson was born on August 27, 1908 in Stonewall, Texas, USA as Lyndon Baines Johnson. He was married to Lady Bird Johnson. He died on January 22, 1973 in Stonewall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNTk1MDM4MjheQTJeQWpwZ15BbWU3MDYwNjEyMzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0425696","name":"Lyndon Johnson","nicknames":["LBJ","L.B.J.","Landslide Lyndon","Johnson, Light Bulb","Lyndon B. Johnson"],"idIMDB":"nm0425696"},"actorId":"nm0425696","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Luther King","urlProfile":"http://www.imdb.com/name/nm0455052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzYyMTkwM15BMl5BanBnXkFtZTYwNjU1OTM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1929","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Michael Luther King Jr.","height":"5' 6½\" (1.69 m)","bio":"Martin Luther King Jr. was born on January 15, 1929, in Atlanta, Georgia. His father, Martin Luther King Sr., was a pastor of the Ebenezer Baptist Church in Atlanta. His mother was a schoolteacher. For Martin the civil rights movement began one summer in 1935 when he was six years old. Two of his friends did not show up to play ball with him and Martin decided to go looking for them. When he went to one of the boys' house, their mother met him at the front door and told him in a rude tone that her son would not be coming out to play with him that day or any other day because they were white and he was black. Years later, Martin admitted that those cruel words altered the direction of his life. As a teenager, Martin went through school with great distinction. He skipped ninth and 12th grades, and excelled on the violin and as as a public speaker. One evening after taking top prize in a debate tournament, he and his teacher were riding home on the bus discussing the event when the driver ordered them to give up their seats for two white passengers who had just boarded. Martin was infuriated as he recalled, \"I intended to stay right in my seat and protest,\" but his teacher convinced him to obey the law and they stood for the remainder of the 90-mile trip. \"That night will never leave my memory as long as I live. It was the angriest I had ever been in my life. Never before, or afterward, can I remember myself being so angry,\" he later recalled. Martin entered Morehouse College, his father's alma mater, when he was 15 with the intention of becoming a doctor or lawyer. After graduating from Morehouse at the age of 19, he decided to enter Crozer Theological Seminary in Chester, Pennsylvania. This private nondenominational college had only 100 students at the time, and Martin was one of six black students. This was the first time that he had lived in a community that was mostly white. He won the highest class ranking and a $1,200 fellowship for graduate school. In 1951 he entered Boston University School of Theology to to pursue his Ph.D. While at Crozer Martin had attended a lecture by Howard University President Mordecai Johnson, who spoke about Mohandas K. Gandhi, India's spiritual leader whose nonviolent protests helped to free his country from British rule, and that gave Martin the basis for positive change. It was here that he met and married his wife Coretta Scott King, who was a soprano studying at the New England Conservatory of Music. In 1954 Martin accepted a call to the Dexter Avenue Baptist Church in Montgomery, Alabama, to be its pastor. Despite Coretta's warning that it would not be safe for them in Alabama, the poorest and most racist state in the US, Martin insisted that they move there. Many local black ministers attended Martin's first sermon at the church, among them the Rev. Ralph Abernathy, who congratulated him on his speech. The two became fast friends and often discussed life in general and the challenges of desegregation in particular. Then an incident changed Martin's life forever. On the cold winter night of December 1, 1955, Rosa Parks, a 42-year-old black seamstress who worked in a downtown Montgomery department store, boarded a bus for home and sat in the back with the other black passengers. A few stops later, she was ordered to give up her seat to a white passenger who just boarded. She repeatedly refused, prompting the driver to call the police, who arrested her. In response to Mrs. Parks' courage, the town's black leaders formed the Montgomery Improvement Association and elected Martin as its leader. The first goal of the MIA was to boycott the city's bus system until public transportation laws were changed. The strike was long, bitter and violent, but eventually the city's white merchants began to complain that their businesses were suffering because of the strike, and the city responded by filing charges against Martin. While in court to appeal the charges, he learned that the U.S. Supreme Court had affirmed the decision by the Alabama Supreme Court that the local laws requiring segregation on buses were unconstitutional. The first civil rights battle was won, but for Martin it was the first of many more difficult ones. On November 29, 1959, he offered his resignation to the members of the Dexter Avenue Baptist Church, as several months earlier he had been elected leader of a new organization called the Southern Christian Leadership Conference (SCLC). He moved his family to Atlanta and began to establish a regional network of nonviolent organizations. In April 1961 he coordinated the SCLC and other civil-rights organizations to take two busloads of white and black passengers through the South on a \"freedom ride\" for publicity reasons. In Virgina and North and South Carolina there were no incidents, but in Anniston, Alabama, the ride became a rolling horror when one bus was burned and its passengers beaten by an angry racist white mob. In Birmingham, angry mobs--with some policemen joining them--greeted the bus with more violence, which was broken up when state police intervened and stopped the chaos. The violence shook Martin and he decided to abandon the freedom rides before someone was killed, but the riders insisted they complete the ride to Montgomery, where they where greeted with more violence. In January 1963 Martin arrived in Birmingham with Ralph Abernathy to organize a freedom march aimed to end segregation. Despite an injunction issued by city authorities against the gathering, the protesters marched and were attacked by the police. Three months later another march was planned with the intent to \"turn the other cheek\" in response to the violence by the city's police force. As the marchers reached downtown Birmgingham, the police attacked the crowd with high-pressure fire hoses and attack dogs. This time, however, the incident was witnessed across the entire country, as many network TV crews were there and broadcasting live footage of unarmed marchers being blasted to the ground by high-pressure hoses and others being bitten and mauled by snarling attack dogs, and it sparked a national outrage. The next day, more marchers repeated the walk and more policemen attacked with fire hoses and police dogs, leading to a total of 1,200 arrests. On the third day, Martin organized another march to the city jail. This time, when the marchers approached the police, none of them moved and some even let the marchers through to continue their march. The nonviolent strategy had worked--the strikes and boycotts were cutting deeply into the city merchants' revenues, and they called for negotiations and agreed with local black leaders to integrate lunch counters, fitting rooms, restrooms and drinking fountains within 90 days. Martin was then called for a rally in Washington, DC, near the Lincoln Memorial on August 28, 1963. Nearly 200,000 people stood in the intense heat listening to the speeches by the members and supporters of the NACCP. By the time Martin was called as the day's final speaker, the crowd was hot and tired. As he approached the podium, with his papers containing his prepared speech, he suddenly put them aside and decided to speak from the heart. He spoke of freedoms for blacks achieved and not yet achieved. He then spoke the words that echo throughout the world to this day: \"I say to you today, my friends, that in spite of the difficulties and frustrations of the moment I still have a dream. It is a dream deeply rooted in the American dream. I have a dream that one day this nation will rise up and live out the true meaning of its creed. 'We hold these truths to be self-evident that all men are created equal.' I have that dream.\" By mid-October 1964 Martin had given 350 civil rights speeches and traveled 275,000 miles across the country and worked for 20 hours a day. While in an Atlanta hospital after collapsing from exhaustion, his wife brought in his room a telegram notifying him that he had won the Nobel Peace Prize. On April 1, 1968, Martin traveled to Memphis, Tennessee to meet with two of his advisers, James Bevel and Jesse Jackson, to discuss organizing a march to Washington in support of a strike by Memphis' city's sanitation workers. In the late afternoon of April 4, he stepped out onto the balcony of the Lorraine Motel where he was staying to speak with Andrew Young. As he saw Jackson and waved to him for a moment, a gunshot rang through the air and Martin Luther King Jr. was hit in the neck and fell dead from a sniper's bullet. He was dead, but the struggle that he started to continue to bring peace and end the racial conflict in the USA continues to this day.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzYyMTkwM15BMl5BanBnXkFtZTYwNjU1OTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455052","name":"Martin Luther King","nicknames":["M.L.K."],"idIMDB":"nm0455052"},"actorId":"nm0455052","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Young","urlProfile":"http://www.imdb.com/name/nm0949258","urlPhoto":"","biography":{"dateOfBirth":"12 March 1932","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Andrew Jackson Young Jr.","bio":"Andrew Young is a prominent civil rights leader and politician. He first became a minister within the United Churches of Christ in the 1950s. Early in his career he studied Gandhi's methods of nonviolent resistance. Young became involved in voter registration drives within the civil rights movement. He became an assistant to Dr. Martin Luther King early in King's career. Young gained a reputation as a negotiator and a strategist. At the time of King's death in 1968, Young had become the executive director of King's organization (the SCLC). In the early 1970s Young was elected to Congress, representing the region of Atlanta, Georgia. During the administration of President Jimmy Carter in the late 1970s, Young was appointed to be the U.S Ambassador to the United Nations. In the 1980s he was elected to two terms as Mayor of Atlanta. In the 1990s Young was instrumental in bringing the Olympic Games to Atlanta. In the 2000s Young served as the president of the National Council of Churches, and as co-chair of GoodWorks International.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0949258","name":"Andrew Young","idIMDB":"nm0949258"},"actorId":"nm0949258","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Meany","urlProfile":"http://www.imdb.com/name/nm1827070","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for George Meany yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1827070","name":"George Meany","idIMDB":"nm1827070"},"actorId":"nm1827070","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henry Ford","urlProfile":"http://www.imdb.com/name/nm0285678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWY3Yzg5NjMtZGNkNi00Y2U2LWJjYzgtZGQzN2UxODU0YmY4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1863","placeOfBirth":" Dearborn Township, Wayne County, Michigan, USA","height":"5' 10\" (1.78 m)","bio":"Henry Ford was born on July 30, 1863 in Dearborn Township, Wayne County, Michigan, USA. He was an actor, known for Til Vesterheimen (1939), Animated Weekly, No. 40 (1916) and Mutual Weekly, No. 44 (1915). He was married to Clara Jane Bryant. He died on April 7, 1947 in Dearborn, Michigan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWY3Yzg5NjMtZGNkNi00Y2U2LWJjYzgtZGQzN2UxODU0YmY4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285678","name":"Henry Ford","nicknames":["The People's Tycoon"],"idIMDB":"nm0285678"},"actorId":"nm0285678","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Bennett","urlProfile":"http://www.imdb.com/name/nm1533556","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Harry Bennett yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1533556","name":"Harry Bennett","idIMDB":"nm1533556"},"actorId":"nm1533556","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Conyers","urlProfile":"http://www.imdb.com/name/nm0176821","urlPhoto":"","biography":{"dateOfBirth":"16 May 1929","placeOfBirth":" Detroit, Michigan, USA","birthName":"John Conyers Jr.","bio":"John Conyers was born on May 16, 1929 in Detroit, Michigan, USA as John Conyers Jr. He has been married to Monica Esters since 1990. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0176821","name":"John Conyers","idIMDB":"nm0176821"},"actorId":"nm0176821","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doug Fraser","urlProfile":"http://www.imdb.com/name/nm3488007","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Doug Fraser yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3488007","name":"Doug Fraser","idIMDB":"nm3488007"},"actorId":"nm3488007","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1344811","urlIMDB":"http://www.imdb.com/title/tt1344811","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 21 min (81 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.9","filmingLocations":[],"awards":[{"award":"Columbus International Film & Video Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Bronze Plaque Award","categories":[{"category":"Social Issues","names":[{"name":"Sasha Reuther","id":"nm3256240","role":null},{"name":"Porter Street Pictures","id":null,"role":null}]}]}]},{"award":"East Lansing Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Lake Michigan Film Competition","categories":[{"category":"Best Documentary","names":[{"name":"Sasha Reuther","id":"nm3256240","role":null},{"name":"Porter Street Pictures","id":null,"role":null}]}]}]},{"award":"Hell's Half Mile Film and Music Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Best Documentary Feature","names":[{"name":"Sasha Reuther","id":"nm3256240","role":"director"},{"name":"Porter Street Pictures","id":null,"role":"production company"}]}]}]},{"award":"Indianapolis International Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Jury Prize","categories":[{"category":"Best Documentary Feature","names":[{"name":"Sasha Reuther","id":"nm3256240","role":"director"}]}]}]},{"award":"Telly Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Silver Telly","categories":[{"category":"Non-Broadcast Production - History/Biography","names":[{"name":"Sasha Reuther","id":"nm3256240","role":"producer"},{"name":"Porter Street Pictures","id":null,"role":null}]}]}]},{"award":"Uptown Film Festival, US 2012","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Best Documentary Feature","names":[{"name":"Sasha Reuther","id":"nm3256240","role":"producer"},{"name":"Porter Street Pictures","id":null,"role":null}]}]}]},{"award":"Washington DC Filmfest 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Justice Matters Award","categories":[{"category":"","names":[{"name":"Sasha Reuther","id":"nm3256240","role":null},{"name":"Porter Street Pictures","id":null,"role":null}]}]}]}],"votes":"54","type":"Movie","companyCreditsSimple":[{"idCompany":"co0257228","name":"Porter Street Pictures"}],"keywords":{"keywords":["social justice","middle class","civil rights","trade unionist","strike","pension","labor union","healthcare","general motors","ford motor company","chrysler","auto industry"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 02:14:19"}}