{"data":{"movies":[{"title":"This Is Where I Leave You","originalTitle":"","year":"2014","releaseDate":"20140919","directors":[{"name":"Shawn Levy","id":"nm0506613"}],"writers":[{"name":"Jonathan Tropper","id":"nm2267086"},{"name":"Jonathan Tropper","id":"nm2267086"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkzNzQ2NDMyNl5BMl5BanBnXkFtZTgwMTY3MTcxMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"When their father passes away, four grown siblings, bruised and banged up by their respective adult lives, are forced to return to their childhood home and live under the same roof together for a week, along with their over-sharing mother and an assortment of spouses, exes and might-have-beens. Confronting their history and the frayed states of their relationships among the people who know and love them best, they ultimately reconnect in hysterical and emotionally affecting ways amid the chaos, humor, heartache and redemption that only families can provide-driving us insane even as they remind us of our truest, and often best, selves.","simplePlot":"When their father passes away, four grown siblings are forced to return to their childhood home and live under the same roof together for a week, along with their over-sharing mother and an assortment of spouses, exes and might-have-beens.","actors":[{"actorName":"Jason Bateman","urlProfile":"http://www.imdb.com/name/nm0000867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTQ0MDUyNF5BMl5BanBnXkFtZTcwNTQ1MzY1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1969","placeOfBirth":" Rye, New York, USA","birthName":"Jason Kent Bateman","height":"5' 11\" (1.8 m)","bio":"Jason Bateman is an American film and television actor best known for his role as Michael Bluth on the television sitcom Arrested Development (2003), as well as his role on Valerie (1986). He was born in Rye, New York, USA. His father, Kent Bateman, from a Utah-based family, is a film and television director, and founder of a Hollywood repertory stage company. His mother, Victoria Bateman, was born in England and worked as a flight attendant. His sister is actress Justine Bateman. In 1981, at the age of 12, young Bateman made his debut on television as James Cooper Ingalls in Little House on the Prairie (1974): Uncle Jed, appearing in 18 more episodes in one season. Jason also appeared in the original Knight Rider with David Hasselhoff for the season 3 episode \"Lost Knight\" (aired Dec 1984) playing the character \"Doug\" who befriends Kitt when he loses his memory. In the mid-1980s, he became the DGA's youngest-ever director when he directed three episodes of Valerie (1986) at age 18. During the 2000s, Bateman's film career has been on soaring trajectory. In 2005, he won the Golden Globe Award for Best Performance by an Actor in a Television Series, Musical or Comedy, for Arrested Development (2003), and received other awards and nominations. Bateman has been enjoying a happy family life with his wife, actress Amanda Anka (daughter of singer Paul Anka). Their first child, Francesca Nora Bateman, was born in Los Angeles on October 28, 2006. The Batemans reside in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTQ0MDUyNF5BMl5BanBnXkFtZTcwNTQ1MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000867","name":"Jason Bateman","idIMDB":"nm0000867"},"actorId":"nm0000867","character":"Judd Altman","urlCharacter":"http://www.imdb.com/character/ch0462890","main":true},{"actorName":"Tina Fey","urlProfile":"http://www.imdb.com/name/nm0275486","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzMwMDI2MF5BMl5BanBnXkFtZTcwNDk0MzcyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1970","placeOfBirth":" Upper Darby, Pennsylvania, USA","birthName":"Elizabeth Stamatina Fey","height":"5' 4½\" (1.64 m)","bio":"Elizabeth Stamatina Fey was born in 1970 in Upper Darby, Pennsylvania, just west of Philadelphia, to Xenobia \"Jeanne\" (Xenakes), a brokerage employee, and Donald Henry Fey, who wrote grant proposals for universities. Her mother is Greek, born in Piraeus, while her father had German, Northern Irish, and English ancestry. Going by the name of Tina, Fey considered herself a \"supernerd\" during her high school and college years. She studied drama at the University of Virginia, and after graduating in 1992, she headed to Chicago, the ancestral home of American comedy. While working at a YMCA to support herself, she started Second City's first set of courses. After about nine months, a teacher told her to just skip ahead and audition for the more selective Second City Training Center. She failed but about eight weeks later, she re-auditioned and got into the year-long program. She ended up spending many years at The Second City in Chicago where many SNL cast members first started out. Then in 1995, Saturday Night Live (1975) came to The Second City's cast, including Fey's friend, Adam McKay, as a writer, searching for new talent. What they found was Tina Fey. When Adam was made Head writer, he suggested Fey should send a submission packet over the summer with six sketches, 10 pages each. Tina took the advice and sent them. After Lorne Michaels met her and saw her work she was offered a job a week later. She admitted that she was extremely nervous working in the legendary Studio 8H; being a foot shorter than everyone else, younger, and being one of the only female writers at the time. After a few years, Tina made history by becoming the first female head writer in the show's history. Tina also made her screen debut as a featured player during the 25th season by co-anchoring Weekend Update with Jimmy Fallon. Since Tina and Jimmy have taken over Weekend Update it has been considered the best ever. This year she made it to full fledged star by becoming a regular cast member, though she is hardly on the show, besides Update. And during the past two summers, Tina and Rachel Dratch performed their two-woman show to critical acclaim in both Chicago (1999) and New York (2000) and made their Aspen Comedy Festival Debut. Tina is married to Jeff Richmond, a Second City director and lives in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzMwMDI2MF5BMl5BanBnXkFtZTcwNDk0MzcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0275486","name":"Tina Fey","idIMDB":"nm0275486"},"actorId":"nm0275486","character":"Wendy Altman","urlCharacter":"http://www.imdb.com/character/ch0410825","main":true},{"actorName":"Jane Fonda","urlProfile":"http://www.imdb.com/name/nm0000404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ5NTE2MDAzOV5BMl5BanBnXkFtZTgwOTQ3MTQ3MjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1937","placeOfBirth":" New York City, New York, USA","birthName":"Lady Jayne Seymour Fonda","height":"5' 8\" (1.73 m)","bio":"Born in New York City to legendary screen star Henry Fonda and New York socialite Frances Seymour Brokaw, Jane Seymour Fonda was destined early to an uncommon and influential life in the limelight. Although she initially showed little inclination to follow her father's trade, she was prompted by Joshua Logan to appear with her father in the 1954 Omaha Community Theatre production of \"The Country Girl\". Her interest in acting grew after meeting Lee Strasberg in 1958 and joining the Actors Studio. Her screen debut in Tall Story (1960) (directed by Logan) marked the beginning of a highly successful and respected acting career highlighted by two Academy Awards for her performances in Klute (1971) and Coming Home (1978), and five Oscar nominations for Best Actress in They Shoot Horses, Don't They? (1969), Julia (1977), The China Syndrome (1979), The Morning After (1986) and On Golden Pond (1981), which was the only film she made with her father. Her professional success contrasted with her personal life, which was often laden with scandal and controversy. Her appearance in several risqué movies (including Barbarella (1968)) by then-husband Roger Vadim was followed by what was to become her most debated and controversial period: her espousal of anti-establishment causes and especially her anti-war activities during the Vietnam War. Her political involvement continued with fellow activist and husband Tom Hayden in the late 1970s and early 1980s. In the 1980s she started the aerobic exercise craze with the publication of the \"Jane Fonda's Workout Book\". She and Hayden divorced, and she married broadcasting mogul Ted Turner in 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ5NTE2MDAzOV5BMl5BanBnXkFtZTgwOTQ3MTQ3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000404","name":"Jane Fonda","nicknames":["Lady Jane"],"idIMDB":"nm0000404"},"actorId":"nm0000404","character":"Hillary Altman","urlCharacter":"http://www.imdb.com/character/ch0445174","main":true},{"actorName":"Adam Driver","urlProfile":"http://www.imdb.com/name/nm3485845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0OTA0NjU0MV5BMl5BanBnXkFtZTcwMTUzNjk3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1983","placeOfBirth":" San Diego, California, USA","birthName":"Adam Douglas Driver","height":"6' 2½\" (1.89 m)","bio":"Adam Douglas Driver was born in San Diego, California. His mother, Nancy (Needham) Wright, is a paralegal from Mishawaka, Indiana, and his father, Joe Douglas Driver, who has deep roots in the American South, is from Little Rock, Arkansas. His stepfather is a Baptist minister. His ancestry includes English, as well as Dutch, German, Irish, and Scottish. Driver was raised in Mishawaka after his parents' divorce, attending Mishawaka High School, where he appeared in plays. After 9/11, he enlisted in the Marines, serving for more than two years before being medically discharged after he suffered an injury, which prevented him from being deployed. Driver attended the University of Indianapolis (for a year) and then transferred to study drama at Juilliard in New York, graduating in 2009. He began acting in plays, appearing on Broadway, before being cast in Lena Dunham's series Girls (2012), as her character's love interest, Adam Sackler. The role gained him attention, and he subsequently began a robust film career, appearing in small roles in J. Edgar (2011) and Lincoln (2012), supporting roles in Frances Ha (2012) and Inside Llewyn Davis (2013), and graduating to major parts in the comedy-drama This Is Where I Leave You (2014) and the upcoming Star Wars: The Force Awakens (2015) and Martin Scorsese's Silence (2016), the latter film opposite Andrew Garfield.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0OTA0NjU0MV5BMl5BanBnXkFtZTcwMTUzNjk3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3485845","name":"Adam Driver","idIMDB":"nm3485845"},"actorId":"nm3485845","character":"Phillip Altman","urlCharacter":"http://www.imdb.com/character/ch0475600","main":true},{"actorName":"Rose Byrne","urlProfile":"http://www.imdb.com/name/nm0126284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1979","placeOfBirth":" Balmain, Sydney, New South Wales, Australia","birthName":"Mary Rose Byrne","height":"5' 6¼\" (1.68 m)","bio":"Rose Byrne was born in Balmain, Sydney, Australia. She is the daughter of Jane, a primary school administrator, and Robin Byrne, a semi-retired statistician and market researcher. She landed her first role in a movie, Dallas Doll (1994), when she was 15 years old. Since then, Rose has appeared in a variety of Australian televisions shows including Hartley, coeurs à vif (1994), Echo Point (1995), and the film Two Hands (1999) alongside Heath Ledger. After this, she appeared in various movies like The Date (1999), My Mother Frank (2000), and Clara Law's The Goddess of 1967 (2000) for which she obtained the Female Volpi Cup at the Venice Festival in 2000. Her first experience on a big-budget movie came when she played handmaiden, Dormé, to Natalie Portman, Padmé Amidala, in Star Wars: Episode II - Attack of the Clones (2002). In 2003, she starred, coincidentally, as Rose Mortmain in the adaptation of Dodie Smith's I Capture the Castle (2003). In 2004, she acted in Wicker Park (2004) with Diane Kruger and Josh Hartnett. Here, she heard Wolfgang Petersen was looking for an actress for Briseis in his next movie Troy (2004) with Brad Pitt, she got the part and was recognised as one of the most promising actresses in Hollywood. After Troy (2004), she played Edith in a TV adaptation of Casanova (2005). In September 2005, she started to act in Sunshine (2007), a Danny Boyle movie, where she plays the pilot in a space mission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126284","name":"Rose Byrne","nicknames":["Rosie"],"idIMDB":"nm0126284"},"actorId":"nm0126284","character":"Penny Moore","urlCharacter":"http://www.imdb.com/character/ch0421144","main":true},{"actorName":"Corey Stoll","urlProfile":"http://www.imdb.com/name/nm1015684","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU5MjUwMDYzOF5BMl5BanBnXkFtZTcwMDcwOTkwOQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1976","placeOfBirth":" New York City, New York, USA","birthName":"Corey Daniel Stoll","height":"6' 2\" (1.88 m)","bio":"Corey Stoll was born on March 14, 1976 in New York City, New York, USA as Corey Daniel Stoll. He is an actor, known for Ant-Man (2015), The Bourne Legacy (2012) and The Strain (2014). He has been married to Nadia Bowers since June 21, 2015. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU5MjUwMDYzOF5BMl5BanBnXkFtZTcwMDcwOTkwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1015684","name":"Corey Stoll","idIMDB":"nm1015684"},"actorId":"nm1015684","character":"Paul Altman","urlCharacter":"http://www.imdb.com/character/ch0475601","main":true},{"actorName":"Kathryn Hahn","urlProfile":"http://www.imdb.com/name/nm1063517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTcxNDczMl5BMl5BanBnXkFtZTcwMDA1NDcyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1973","placeOfBirth":" Westchester, Illinois, USA","height":"5' 5\" (1.65 m)","bio":"Kathryn Hahn was born in Westchester, Illinois, but her family then moved to Cleveland, Ohio, where she spent most of her time growing up. She is of German, Irish, and some English, descent. She graduated with a bachelor's degree in theater from Northwestern University. She later attended Yale, where she enrolled in the school of drama and starred as \"Sally Bowles\" in \"Cabaret\" and as \"the heartless Célimène\" in Molière's play, \"The Misanthrope\". Kathryn has extensive stage experience, and appeared with the Huntington Theater Company's production of Jon Robin Baitz's \"Ten Unknowns\", with Ron Rifkin of Alias (2001) (Arvin Sloane). Kathryn got her role as \"Lily\" when she was \"discovered\" by an NBC casting director at the Williamstown Theater Festival, and the Crossing Jordan (2001) role of \"Lily\" was created for her by creator/producer Tim Kring. She lives in Los Angeles, where she paints and practices yoga when she's not busy acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTcxNDczMl5BMl5BanBnXkFtZTcwMDA1NDcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1063517","name":"Kathryn Hahn","idIMDB":"nm1063517"},"actorId":"nm1063517","character":"Annie Altman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Connie Britton","urlProfile":"http://www.imdb.com/name/nm0110168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODQ2NDIxN15BMl5BanBnXkFtZTcwNTY4ODM2MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1967","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Constance Elaine Womack","height":"5' 8\" (1.73 m)","bio":"Connie Britton began playing country music fading sensation Rayna Jaymes in Nashville (2012) after having wrapped production for the five season long Friday Night Lights (2006) alongside Kyle Chandler. She previously appeared in Universal's Friday Night Lights (2004) -the movie- directed by Peter Berg and also starring Billy Bob Thornton; and Edward Burns' independent feature Looking for Kitty (2004). Britton was born Constance Elaine Womack in Boston, Massachusetts, to Linda Jane (Cochran) and Edgar Allen Womack, Jr., a physicist and energy company executive. She is of Irish, German, and English descent. Britton received accolades for her starring roles in Edward Burns' acclaimed independent films The Brothers McMullen (1995) and No Looking Back (1998). In the former, she captivated moviegoers with her portrayal of \"Molly\", the luminous wife of a cheating husband. This popular low-budget film went on to win the Grand Jury Prize at the Sundance Film Festival. After nearly canceling her audition with director Edward Burns, this last meeting of the day turned into the role that would launch her career. Born in Boston, Massachusetts, Britton moved to Lynchburg, Virginia, at the age of seven with her family, including her fraternal twin sister. She went on to attend Dartmouth College, where she majored in Asian studies and spent a term in Beijing, China. Upon graduation, she moved to New York, where she spent two years at the Neighborhood Playhouse studying with Sanford Meisner, and an additional two years performing in regional theater and off-Broadway productions. She moved to Los Angeles after the success of The Brothers McMullen (1995). She starred in ABC's Lost at Home (2003) opposite Mitch Rouse and Gregory Hines. Her other television credits include The Fighting Fitzgeralds (2001) opposite Brian Dennehy, a recurring role in the highly-acclaimed drama The West Wing (1999) and a starring role in the award-winning comedy Spin City (1996) opposite Michael J. Fox. Additionally, Britton starred in the recent feature films The Next Big Thing (2001) and One Eyed King (2001). In her free time, Britton, who resides in both New York and Los Angeles, enjoys hiking, yoga, and doing volunteer work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODQ2NDIxN15BMl5BanBnXkFtZTcwNTY4ODM2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0110168","name":"Connie Britton","idIMDB":"nm0110168"},"actorId":"nm0110168","character":"Tracy Sullivan","urlCharacter":"http://www.imdb.com/character/ch0464327","main":true},{"actorName":"Timothy Olyphant","urlProfile":"http://www.imdb.com/name/nm0648249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzY0OTA2Ml5BMl5BanBnXkFtZTYwNDYzODgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1968","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Timothy David Olyphant","height":"6' (1.83 m)","bio":"From Timothy Olyphant's first screen appearances, such as his two-minute bit in The First Wives Club (1996), to \"Nicko\", whose presence at times dwarfed the island in A Perfect Getaway (2009), he has been a force to be reckoned with. Born in Hawaii, Timothy David Olyphant was raised in Modesto, California. He is the son of Katherine Lyon (Gideon) and John Vernon Bevan Olyphant, a college teacher who was also an executive at E & J Gallo Winery. He has an older brother, Andy, who is in A&R for Warner Bros. Records, and a younger brother, Matt Olyphant, who was the lead singer for the punk rock group, Fetish, and is also an artist. He is a descendant of the prominent Vanderbilt and Olyphant families of businesspeople, and his ancestry includes Russian Jewish (from a maternal great-grandfather), English, German, Scottish, Dutch, and Irish. Timothy quickly became Modesto's favorite son, competing as a pro swimmer and excelling at drawing. It was, by chance, that he enrolled in an acting course as an elective and decided to pursue an acting career. He took his family and headed to New York City, where he studied the craft and began auditioning for roles. From the beginning, he tried to choose diversified roles and take chances with every genre and always approached everything he did with commitment, humor and grace. Timothy is married to his college sweetheart, Alexis Knief, and, together, they raise three children, one son and two daughters in California. He has managed to keep his personal life out of the tabloids. He obviously has his priorities straight, as this is no easy task in Hollywood. Highlights of Olyphant's career include his riveting portrayal of \"Sheriff Seth Bullock\" in HBO's hit drama, Deadwood (2004). He now personifies intensity as complex Kentucky Marshal, \"Raylan Givens\", in FX's Justified (2010). On the big screen, in 2010's The Crazies (2010), he had the chance to infuse his character with doubts, fears and humaneness in an inhumane situation. Mr. Olyphant proved he could carry a major movie on his talent, alone. He recently appeared in I Am Number Four (2011), a Steven Spielberg sci-if thriller, in which Tim provided the adult mentorship, taking a back seat to the teen cast.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzY0OTA2Ml5BMl5BanBnXkFtZTYwNDYzODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0648249","name":"Timothy Olyphant","nicknames":["Olyphantastic"],"idIMDB":"nm0648249"},"actorId":"nm0648249","character":"Horry Callen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dax Shepard","urlProfile":"http://www.imdb.com/name/nm1009277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5Mzg5OTg5N15BMl5BanBnXkFtZTcwODI2MjA0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1975","placeOfBirth":" Milford, Michigan, USA","birthName":"Dax Randall Shepard","height":"6' 3\" (1.91 m)","bio":"Dax Randall Shepard was born in 1975 in Milford, a suburb of Detroit, Michigan, to Laura (LaBo), who worked at GM, and Dave Robert Shepard, Sr., a car salesman. His mother is of French-Canadian and Belgian descent. With both his parents working in the automotive industry, Dax's first love was cars. Shepard graduated from Walled Lake High School in 1993, and moved to California in 1995. He graduated magna cum laude from UCLA with a B.A. in Anthropology. While attending UCLA he trained at The Groundlings Theater for improv and sketch comedy. After eight years of auditioning, Dax booked Punk'd, his first paid acting role. Shepard is married to actress Kristen Bell, with whom he has two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5Mzg5OTg5N15BMl5BanBnXkFtZTcwODI2MjA0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1009277","name":"Dax Shepard","idIMDB":"nm1009277"},"actorId":"nm1009277","character":"Wade Beaufort","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Debra Monk","urlProfile":"http://www.imdb.com/name/nm0598213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE4NDE2MDU4NV5BMl5BanBnXkFtZTYwODgwMjY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1949","placeOfBirth":" Middletown, Ohio, USA","bio":"Debra Monk was born on February 27, 1949 in Middletown, Ohio, USA. She is an actress, known for The Devil's Advocate (1997), The Bridges of Madison County (1995) and Demolition (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE4NDE2MDU4NV5BMl5BanBnXkFtZTYwODgwMjY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0598213","name":"Debra Monk","idIMDB":"nm0598213"},"actorId":"nm0598213","character":"Linda Callen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abigail Spencer","urlProfile":"http://www.imdb.com/name/nm0817844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzOTIwNjA5OV5BMl5BanBnXkFtZTgwNTI3MTE1MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1981","placeOfBirth":" Gulf Breeze, Florida, USA","birthName":"Abigail Leigh Spencer","height":"5' 5\" (1.65 m)","bio":"A talented actress, writer and producer on both the big and small screen, Abigail Spencer is quickly making a name for herself in Hollywood. Spencer will next be seen in Sam Raimi's, Oz the Great and Powerful (2013), a prequel take on The Wizard of Oz (1939) tale. Spencer joins James Franco, Mila Kunis, Rachel Weisz and Michelle Williams. The Disney film will be released on March 8, 2013. Also upcoming, she will star in the Sundance Channels first scripted series, Rectify (2013). The series follows \"Daniel Holden\" (played by Aden Young), who must put his life back together after serving 19 years on Georgia's Death Row, before DNA evidence calls his conviction into question. The series is slated to premiere in early 2013. Spencer also recently wrapped production on the indie, Kilimanjaro (2013), opposite Brian Geraghty, and reprising her role of \"Annie\" for the online series, \"Burning Love\", on YouTube, which got picked up for a second and third season. The series was produced by Red Hour and is a funny parody of Bachelor-esque show. She will also reprieve her role on the USA hit show, Suits (2011), and will be seen in the new season of Childrens Hospital (2008) for Adult Swim. Abigail is also currently filming the lead in Daniela Amavia's cinematic piece, A Beautiful Now (2015), produced by Keith Kjarval/Unified Pictures. As a screenwriter and producer, Spencer is in development on Wrong Number, with James Franco producing through his \"Rabbit Bandini Productions\" banner. Spencer will also star in the indie romantic comedy directed by AnnaRose King. Spencer also co-wrote, with Lauren Miller, the television series, \"Teach\", which was purchased by ABC Family and deals with the life of high school teachers. Spencer recently starred, alongside Gerard Butler in Curtis Hanson's, Chasing Mavericks (2012). The film follows surfer \"Jay Moriarity\", who sets out to ride the Northern California break, known as \"Mavericks\". She was also seen, opposite Jon Hamm, on AMC's award-winning and critically-acclaimed original series, Mad Men (2007), in the series' third season as Don Draper's latest love interest, who also happens to be his daughter's school teacher. Other film credits include McG's This Means War (2012) and Jon Favreau's Cowboys & Aliens (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzOTIwNjA5OV5BMl5BanBnXkFtZTgwNTI3MTE1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0817844","name":"Abigail Spencer","nicknames":["Abby"],"idIMDB":"nm0817844"},"actorId":"nm0817844","character":"Quinn Altman","urlCharacter":"http://www.imdb.com/character/ch0476303","main":true},{"actorName":"Ben Schwartz","urlProfile":"http://www.imdb.com/name/nm2355635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjAxMzk1NF5BMl5BanBnXkFtZTgwNjU1NjgyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Ben Schwartz is known for playing Jean-Ralphio in the American comedy TV series 'Parks and Recreation.' He plays an annoying yet lovable character who thinks he is a player and a baller and often uses insurance money and his father's money to buy whatever he wants. Jean-Ralphio was created for Schwartz when he met co-creator of the show Michael Schur, and he often improvised his lines.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjAxMzk1NF5BMl5BanBnXkFtZTgwNjU1NjgyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2355635","name":"Ben Schwartz","idIMDB":"nm2355635"},"actorId":"nm2355635","character":"Rabbi Charles Grodner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aaron Lazar","urlProfile":"http://www.imdb.com/name/nm1594381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTE1M2Y0ZjUtOThlMy00ZDFjLWIyZmUtN2I0MjMwMjcxOWVhL2ltYWdlXkEyXkFqcGdeQXVyMTExNzAwMTQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Aaron S. Lazar","height":"6' 1\" (1.85 m)","bio":"Aaron Lazar was born as Aaron S. Lazar. He is an actor, known for The Wolf of Wall Street (2013), This Is Where I Leave You (2014) and J. Edgar (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTE1M2Y0ZjUtOThlMy00ZDFjLWIyZmUtN2I0MjMwMjcxOWVhL2ltYWdlXkEyXkFqcGdeQXVyMTExNzAwMTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1594381","name":"Aaron Lazar","idIMDB":"nm1594381"},"actorId":"nm1594381","character":"Barry Weissman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cade Lappin","urlProfile":"http://www.imdb.com/name/nm5629766","urlPhoto":"","biography":{"bio":"Cade Lappin is an actor, known for This Is Where I Leave You (2014), Humor Me (2017) and The Affair (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5629766","name":"Cade Lappin","idIMDB":"nm5629766"},"actorId":"nm5629766","character":"Cole","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1371150","urlIMDB":"http://www.imdb.com/title/tt1371150","business":{"budget":{"money":"$19,800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$22,441,091","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$6,894,340","country":"USA","day":"28","month":"09","year":"2014","remarks":"2,868 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Cooke S4 and Angenieux Optimo Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,829.5 m (7 reels)"],"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.6","metascore":"44","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[{"award":"Casting Society of America, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Big Budget Feature - Comedy","names":[{"name":"Cindy Tolan","id":"nm1100639","role":null},{"name":"Adam Caldwell","id":"nm2006331","role":"associate"}]}]}]}],"votes":"58,113","type":"Movie","companyCreditsSimple":[{"idCompany":"co0158853","name":"21 Laps Entertainment"},{"idCompany":"co0114242","name":"Spring Creek Productions"},{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["man child","brother sister relationship","childhood home","sibling","strong female character","vomiting","childhood sweetheart","childhood memory","touching foreheads","reference to cyndi lauper","scene during opening credits","lesbian mother","family business","waving goodbye","waving","brother brother fight","marriage problems","mother daughter hug","mother son hug","hugging","loss of husband","loss of father","flashback","electrocution","fuse box","male in shower","lesbian kiss","lesbian","mature romance","radio show","radio show host","talk radio","radio talk show","breast implant","large breasts","jewish humor","jewish mother","death in family","reunion","jewish family","mentally impaired","brain injury","sitting on a rooftop","folding bed","family gathering","overturned car","sofa bed","forehead cut","nickname","rabbi","ringing telephone","ex boyfriend ex girlfriend relationship","bar","ice skating","sporting goods store","potty training","little boy","dressing gown","cleavage","classic car","sports car","pregnancy","pregnant wife","family home","home town","ice rink","overhearing sex","trying to conceive","old flame","homecoming","basement","fire alarm","sprinkler","classroom","pot smoking","baby monitor","widow","deathbed","telephone call","cell phone","statement in title","claim in title","ultrasound","hospital","punched in the face","woman hits a man","older woman younger man relationship","porsche","convertible","rooftop","synagogue","marijuana","potty chair","caught having sex","interrupted sex","six word title","extramarital affair","infidelity","unfaithfulness","adultery","boyfriend girlfriend relationship","brother brother relationship","dysfunctional family","family reunion","dying wish","marriage","loveless marriage","cheating wife","mourning","death of husband","husband wife relationship","father daughter relationship","mother daughter relationship","father son relationship","mother son relationship","family relationships","jew","faith","death of father","based on novel","trouble conceiving"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:07:53"}}