{"data":{"movies":[{"title":"The Boondock Saints II: All Saints Day","originalTitle":"","year":"2009","releaseDate":"20091211","directors":[{"name":"Troy Duffy","id":"nm0240627"}],"writers":[{"name":"Troy Duffy","id":"nm0240627"},{"name":"Troy Duffy","id":"nm0240627"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDMxNzM2M15BMl5BanBnXkFtZTcwNjk5MzU5Mg@@._V1.jpg","countries":["USA"],"languages":["English","Italian","Spanish"],"genres":["Action","Crime","Thriller"],"plot":"For the last 8 years the brothers have been living with their father on a sheep farm deep in isolated Ireland. One day their uncle tells them that they have been framed for the murder of a Bostonian Catholic priest. The boys must return to Boston to not only clear their names but find the men who framed them.","simplePlot":"The MacManus brothers are living a quiet life in Ireland with their father, but when they learn that their beloved priest has been killed by mob forces, they go back to Boston to bring justice to those responsible and avenge the priest.","actors":[{"actorName":"Sean Patrick Flanery","urlProfile":"http://www.imdb.com/name/nm0001218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3NjA5MDcwNV5BMl5BanBnXkFtZTgwNjYyNTQ5MzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1965","placeOfBirth":" Lake Charles, Louisiana, USA","height":"5' 11\" (1.8 m)","bio":"Sean Patrick Flanery was born in Lake Charles, La. and raised in a small town outside of Houston, Texas. While attending the University of St. Thomas in Houston, he saw a beautiful girl leaving a building on campus every Monday and decided to drop an English class and sign up for \"whatever the hell they were teaching in that building\". The building was the University's theater department, and the class was acting. Through his theater studies, he penned a piece of children's theater and decided afterwards to pack up his car and head to Los Angeles with the hopes of actually producing the play. Somewhere in the process, an agent approached him and requested to represent him commercially. His first paid role in Hollywood was a Kellog's Corn Pops commercial starring alongside none other than Paul Walker. Shortly after a string of national commercials, the same agent then began representing him for TV/film roles. He very quickly landed the title role in George Lucas' \"The Young Indiana Jones Chronicles\" after shooting 2 films for the Mickey Mouse Club called \"Just Perfect\" and \"My Life As A Babysitter\". Since then, Flanery has been in numerous films and TV shows every year, including \"Powder\", \"The Dead Zone\", \"SAW3D\", \"Suicide Kings\", and the runaway cult hit \"The Boondock Saints\", and most recently, the TV show \"Powers\" for Sony, which is scheduled to be released in early 2015. Flanery is also noted for winning the Toyota celebrity race of Long Beach two years in a row, the first as an amateur, and the second after being invited back to compete as a pro. He won after qualifying on the pole both times. Off camera, Flanery is a high ranking martial artist having earned his black belt in Brazilian Jiu Jitsu from the Renzo Gracie lineage on May 4th of 2008. He owns his own BJJ academy called Hollywood Brazilian Jiu Jitsu in West Hollywood, Ca. where he trains regularly when his film schedule allows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3NjA5MDcwNV5BMl5BanBnXkFtZTgwNjYyNTQ5MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001218","name":"Sean Patrick Flanery","idIMDB":"nm0001218"},"actorId":"nm0001218","character":"Connor MacManus","urlCharacter":"http://www.imdb.com/character/ch0080309","main":true},{"actorName":"Norman Reedus","urlProfile":"http://www.imdb.com/name/nm0005342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODE4NTgzMl5BMl5BanBnXkFtZTcwODI0MjAwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1969","placeOfBirth":" Hollywood, Florida, USA","birthName":"Norman Mark Reedus","height":"5' 10\" (1.78 m)","bio":"Norman Reedus was born in Hollywood, Florida, to Marianne (Yarber), a teacher, and Norman Reedus. He is of Italian (from his paternal grandmother), English, Scottish, and Irish descent. Norman's first film was in Guillermo del Toro's 1997 horror thriller Mimic (1997), where he played the character Jeremy. He has also played roles in the films \"Floating\", Six Ways to Sunday (1997), Deuces Wild (2002), Blade II (2002), \"Gossip\", 8 mm (1999), American Gangster (2007), Hero Wanted (2008) and Moscow Chill. In 2005 he had a bit-part in Christian Alvart's Antibodies (2005) as a German policeman. In 2008 he starred in _Red Canyon_. Norman is perhaps best known for playing the role of Murphy MacManus in the 1999 movie The Boondock Saints (1999) opposite Sean Patrick Flanery and Willem Dafoe. He also starred opposite Flanery in the 2009 sequel The Boondock Saints II: All Saints Day (2009). He appeared at the 2012 Comic-Con in San Diego. As of 2010 he stars as Daryl Dixon in the AMC television series The Walking Dead (2010). The character was not originally in the comic book series of the same name, but was created specifically for Reedus after his audition for the character of Merle Dixon. The Walking Dead comic creator Robert Kirkman has stated he feels \"absolutely blessed [Reedus] has honored the show with his presence, and the way he has come in and taken over that role and defined Daryl Dixon. A lot of Norman's portrayal of the character in the first season inspired all the writers to do what we did with him in the second season. We love writing him and end up doing cool stuff with him.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODE4NTgzMl5BMl5BanBnXkFtZTcwODI0MjAwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005342","name":"Norman Reedus","idIMDB":"nm0005342"},"actorId":"nm0005342","character":"Murphy MacManus","urlCharacter":"http://www.imdb.com/character/ch0080310","main":true},{"actorName":"Billy Connolly","urlProfile":"http://www.imdb.com/name/nm0175262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzM2MTA4Ml5BMl5BanBnXkFtZTYwMzIxNTM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1942","placeOfBirth":" Anderston, Glasgow, Scotland, UK","birthName":"William Connolly","height":"6' (1.83 m)","bio":"Billy Connolly was born and raised in Glasgow, Scotland. He left school to work in the shipyards becoming a welder and joined the Territorial Army (in the parachute regiment) at around the same time. He developed an interest in folk music, eventually becoming an accomplished banjo player and a member of the band Humblebums with Gerry Rafferty (later of Baker Street fame). The jokes he told between songs eventually took over his act and he became a full-time comedian. Already a big star in Scotland, he became a household name in the UK after appearing on Parkinson (1971) in the early seventies. Billy has released many recordings and videos of his concert performances over the years. He has expanded his repertoire to include acting, appearing in a number of television dramas and films, most recently in the USA. In the 90s he made two documentary series for the BBC, about Scotland and Australia respectively, and in 1997 he starred in the award winning film Mrs Brown (1997). He is one of the UK's top comedian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzM2MTA4Ml5BMl5BanBnXkFtZTYwMzIxNTM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175262","name":"Billy Connolly","nicknames":["The Big Yin"],"idIMDB":"nm0175262"},"actorId":"nm0175262","character":"Poppa","urlCharacter":"http://www.imdb.com/character/ch0457006","main":true},{"actorName":"Clifton Collins Jr.","urlProfile":"http://www.imdb.com/name/nm0004286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODQwMTg2Ml5BMl5BanBnXkFtZTcwMDE3OTU2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1970","placeOfBirth":" Los Angeles, California, USA","birthName":"Clifton Craig Collins Jr.","height":"5' 8\" (1.73 m)","bio":"An acting chameleon who can easily lose himself in the life of his film and television characters, Clifton Collins Jr. is a native Angeleno who grew up destined to become a part of the Latino entertainment industry. His great-grandparents on his mother's side were a Mexican trumpet player and Spanish dancer who formed a traveling family act, and his grandfather was well-known character actor Pedro Gonzalez Gonzalez, most famous for his humorous sidekick roles in 1950s/1960s John Wayne westerns (he played the excitable hotel keeper in Rio Bravo (1959)) and in sitcoms. His uncle and aunt dabbled in the business at one point as well. While his famous grandfather was unable to break out of the old unflattering Latino stereotypes, Collins Jr. has done Pedro proud in the new millennium. Playing everything from policemen to boxers to serial killers, he has managed to transcend the typical racial trappings of his grandfather's era and play flesh-and-blood, three-dimensional characters. It was not always that way. Born short, lean and mean on June 16, 1970, he started his career in 1988 using his real name of Collins, but two years later began billing himself as \"Clifton Gonzales-Gonzales\" as a tribute to his aged grandfather and his early accomplishments. Pedro, who died in 2006, lived long enough to witness his grandson's achievements. Toiling in typical \"barrio\" roles at the beginning of his career, Collins Jr. found himself stuck in bit parts either as a struggling blue-collar worker or urban thug. In the mid-1990s, he began to search out and wing standout roles that enabled him to break the confines of the Latino stereotype. He slowly moved up in billing, even in mediocre material such as the futuristic prison film Fortress (1992) and the mindless 1970s rock-era comedy The Stöned Age (1994). His breakout role as Cesar, the vicious student and gangbanger in One Eight Seven (1997) opposite Los Angeles substitute teacher Samuel L. Jackson, set him on the right path. This led to a mesmerizing collection of other portrayals, both good-guy and bad-guy, in such films as The Replacement Killers (1998), The Wonderful Ice Cream Suit (1998) and Tigerland (2000). His versatility finally tested, he played everything from a gay Mexican hitman in the critically acclaimed Traffic (2000) to a psychological profiler for the FBI in the mainstream actioner Profession profiler (2004). A number of top guest appearances came his way on such series as NYPD Blue (1993) and La treizième dimension (2002) and he had recurring roles on Resurrection Blvd. (2000) and Alias (2001). A monumental shift forward in his career happened recently with his hypnotic portrayal of killer Perry Smith, the object of writer Truman Capote's obsession, in the art-house favorite Capote (2005). Decades ago, Robert Blake played the same part in the gripping Capote book-to-film In Cold Blood (1967). This heralded achievement has enabled Collins to move into the co-producer's chair of late, notably for Rampage: The Hillside Strangler Murders (2006), in which he inhabits the role of serial killer Kenneth Bianchi. Obviously, there is plenty more in the works for this major talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODQwMTg2Ml5BMl5BanBnXkFtZTcwMDE3OTU2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004286","name":"Clifton Collins Jr.","idIMDB":"nm0004286"},"actorId":"nm0004286","character":"Romeo","urlCharacter":"http://www.imdb.com/character/ch0127611","main":true},{"actorName":"Julie Benz","urlProfile":"http://www.imdb.com/name/nm0004748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyNzIyNDYyN15BMl5BanBnXkFtZTgwOTAxMTUyOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1972","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Julie M. Benz","height":"5' 4\" (1.63 m)","bio":"Julie Benz was born in Pittsburgh, Pennsylvania, USA on May 1, 1972. Julie's father is a Pittsburgh surgeon and her mother is a figure ice skater. The family settled in nearby Murrysville, when Julie was two, and she started ice skating at age three. She competed in the 1988 U.S. Championships in junior ice dancing with her partner David Schilling, coming in 13th. Her older brother and sister, Jeffrey and Jennifer, were in the 1987 U.S. Junior Champions in ice dancing and competed internationally. When Julie was 14, she had a bad stress fracture and had to take time off. By 1989, with her figure skating career over, Julie turned to acting and got involved in the local theater where she got a role in the play \"Street Law\". Her first movie role was a small, credited, speaking part in in the Black Cat episode in the Dario Argento/George A. Romero co-direction horror flick, Two Evil Eyes (1990) playing in one scene alongside Harvey Keitel. A year later, she got a role on a TV show called Hi Honey, I'm Home (1991). After graduating from high school, Julie entered New York University to study acting there. After graduation, Julie moved to Los Angeles to further pursue her career and landed some small roles in movies and TV shows including a guest appearance on Married with Children (1987) and in the Aaron Spelling TV pilot Crosstown Traffic (1995). In 1996, Julie auditioned for the role of \"Buffy\" in the series Buffy the Vampire Slayer (1997), but lost out to Sarah Michelle Gellar. However, she was offered a small role as a vampire girl in which she did such a good job that her part was expanded to a few more episodes in playing the vampire \"Darla\". With that, Julie Benz's career had finally taken off. She reprised her role as \"Darla\" in the Buffy spin-off series Angel (1999) for two years and has had several small roles in various film productions. She also had a small, but memorable, role playing a receptionist in the movie As Good as It Gets (1997). Even after her role on Angel (1999) wrapped up, Julie continued to find work on television in playing many guest staring roles in numerous popular TV shows from CSI: Crime Scene Investigation (2000), to Supernatural (2005), to playing the lead and supporting roles in various made-for-TV movies. Most recently, she landed another notable role on the TV-cable series Dexter (2006) playing \"Rita\", a troubled divorcée and lover of the title character played by Michael C. Hall. Benz played a leading role in the tv series No Ordinary Family (2010) playing Stephanie Powell along with actors Michael Chiklis, Kay Panabaker, Jimmy Bennett, Autumn Reeser, Romany Malco, and Stephen Collins.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyNzIyNDYyN15BMl5BanBnXkFtZTgwOTAxMTUyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004748","name":"Julie Benz","idIMDB":"nm0004748"},"actorId":"nm0004748","character":"Special Agent Eunice Bloom","urlCharacter":"http://www.imdb.com/character/ch0457005","main":true},{"actorName":"Bob Marley","urlProfile":"http://www.imdb.com/name/nm0549125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODEyNDAwN15BMl5BanBnXkFtZTgwODQ0NTEyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"birthName":"Robert Cochrane Marley Jr.","height":"6' 3\" (1.91 m)","bio":"Bob Marley was born in Portland, Maine, USA as Robert Cochrane Marley Jr. He is a writer and actor, known for The Boondock Saints (1999), The Boondock Saints II: All Saints Day (2009) and Worldwide! (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODEyNDAwN15BMl5BanBnXkFtZTgwODQ0NTEyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0549125","name":"Bob Marley","idIMDB":"nm0549125"},"actorId":"nm0549125","character":"Greenly","urlCharacter":"http://www.imdb.com/character/ch0006579","main":true},{"actorName":"Brian Mahoney","urlProfile":"http://www.imdb.com/name/nm0537126","urlPhoto":"","biography":{"bio":"Brian made the decision to become an actor before his 10th birthday but took another 20 years to make the journey to Hollywood to begin his formal acting training. Born in Framingham MA, Brian moved with his family to Illinois and Ohio before settling in a beautiful small town in Western Michigan. Unable to afford theater training after high school and in the middle of the Iranian hostage crisis he joined the US Army in hopes of later attending American Academy of Dramatic Arts in NYC. The Army had different plans for Brian and after 2 yrs of infantry training, accepted him into US Army flight school at Ft Rucker, Alabama. Brian loved the intense academic environment and found he had a natural ability flying helicopters. Upon flight school graduation, Brian was accepted into the attack school where he was trained as a Cobra pilot then sent to a discreet Army base in the rural fields west of Nurnberg, Germany. The only American living in the small town of Oberntief at the time, Brian treasures those years and is always trying to live up to them. While in Germany, he studied full time at the satellite campus of Embry Riddle Aeronautical University near Nurnberg, and as an avid skier, racked up over fifty lift tickets in three years from the Austrian Alps to the Italian Dolomites. If he wasn't flying, studying, or comparing stories over drinks at their remote officers club, he was traveling Europe with his fellow gun pilots. Despite an exciting and very rewarding career thus far, Brian knew it was time to become an actor soon and after seeing the movie Top Gun in Garmisch, requested his final assignment be as close to Hollywood as possible. Within a year, he was based at Ft Ord, CA and immersed himself in Monterey's busy theater community whenever he could. In Monterey, he got the part of Vince in Buried Child by falling down 'drunk' on stage during his audition and completing the scene from the stage floor. In late 1989, after 10 years of military service, Brian resigned from the Army, sold his new Saab for acting lessons in Hollywood, and made his move there. October 30th 2009 marks both the theatrical release of the new film Boondock Saints 2, All Saints Day and the 20th anniversary of Brian's arrival in Los Angeles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0537126","name":"Brian Mahoney","idIMDB":"nm0537126"},"actorId":"nm0537126","character":"Duffy","urlCharacter":"http://www.imdb.com/character/ch0006580","main":true},{"actorName":"David Ferry","urlProfile":"http://www.imdb.com/name/nm0275072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE1NjY4NTYtZWViZC00YmVjLWE0OGMtYjI5MjVjOTIxZmQxXkEyXkFqcGdeQXVyNzQ0ODUwNTM@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1951","placeOfBirth":" St John's, Newfoundland, Canada","bio":"David Ferry was born on September 6, 1951 in St John's, Newfoundland, Canada. He is an actor, known for The Boondock Saints (1999), The Boondock Saints II: All Saints Day (2009) and 3 Men and a Baby (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE1NjY4NTYtZWViZC00YmVjLWE0OGMtYjI5MjVjOTIxZmQxXkEyXkFqcGdeQXVyNzQ0ODUwNTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0275072","name":"David Ferry","idIMDB":"nm0275072"},"actorId":"nm0275072","character":"Dolly","urlCharacter":"http://www.imdb.com/character/ch0006581","main":true},{"actorName":"David Della Rocco","urlProfile":"http://www.imdb.com/name/nm0217386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5OTExODc0Ml5BMl5BanBnXkFtZTcwOTk3MzgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1952","placeOfBirth":" Norwich, Connecticut, USA","height":"6' (1.83 m)","bio":"David Della Rocco was born on May 4, 1952 in Norwich, Connecticut, USA. He is an actor, known for The Boondock Saints (1999), The Boondock Saints II: All Saints Day (2009) and Dead in 5 Heartbeats (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5OTExODc0Ml5BMl5BanBnXkFtZTcwOTk3MzgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217386","name":"David Della Rocco","idIMDB":"nm0217386"},"actorId":"nm0217386","character":"Rocco","urlCharacter":"http://www.imdb.com/character/ch0037265","main":true},{"actorName":"Peter Fonda","urlProfile":"http://www.imdb.com/name/nm0001228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4NTE5MTEwNl5BMl5BanBnXkFtZTgwMTQ0NDk3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1940","placeOfBirth":" New York City, New York, USA","birthName":"Peter Henry Fonda","height":"6' 2½\" (1.89 m)","bio":"Peter Henry Fonda was born in New York City, to legendary screen star Henry Fonda and New York socialite Frances Seymour Brokaw. He is the brother of actress Jane Fonda and the father of actress Bridget Fonda. His ancestry includes Dutch, English, Scottish, and distant French and Italian. Fonda made his professional stage debut on Broadway in 1961 in Blood, Sweat and Stanley Poole, for which he received rave reviews from the New York Critics, and won the Daniel Blum Theater World Award and the New York Critics Circle Award for Best New Actor. He began his feature film career in 1963, playing the romantic lead in Tammy and the Doctor and joined the ensemble cast of the World War II saga The Victors. Shortly thereafter, Fonda began what would become a famous association with Roger Corman, starring in Wild Angels, as the ultra-cool, iron-fisted leader of a violent biker gang, opposite Nancy Sinatra, Bruce Dern, and Diane Ladd. Fonda also starred in Corman's 1967 psychedelic film The Trip, also starring Dern and Susan Strasberg. Fonda's next project was the seminal 1969 anti-establishment film Easy Rider which he produced and co-scripted, receiving an Academy Award nomination for Best Original Screenplay. Fonda's acting credits also include the feature films Outlaw Blues, an expose of the country music business; Dirty Mary, Crazy Larry; Race with the Devil; Robert Rossen's Lilith; Split Image; Robert Wise's Two People; and the cult films Love and a .45 and Nadja. He appeared in Grace of My Heart, directed by Alison Anders, and John Carpenter's Escape from L.A., starring Kurt Russell. He also made a cameo appearance in Bodies, Heat & Motion, which starred his daughter Bridget. Fonda wowed audiences and won critical acclaim for his portrayal of Ulee Jackson, the taciturn beekeeper in the 1997 film Ulee's Gold, earning him both a Golden Globe Award for Best Actor and the New York Film Critics Award, as well as an Oscar nomination. Following this, he published his autobiography, Don't Tell Dad, and was then seen in the NBC movie The Tempest, for which he had been nominated for another Golden Globe Award for Best Actor in a Mini-Series. Fonda then appeared with Helen Mirren in the Showtime telefilm The Passion of Ayn Rand, where he won the Golden Globe for outstanding supporting actor in a mini-series or movie made for television and was nominated for both an Emmy and SAG Award. Fonda co-starred in Steven Soderbergh's 1997 film The Limey, which also starred Terrence Stamp and Lesley Ann Warren. Following this he appeared in Thomas and the Magic Railroad for director Britt Allcroft, starring Alec Baldwin. Fonda directed his first feature film, The Hired Hand, in 1971. A critically acclaimed western in which he also starred, the film debuted with a restored version at the 2001 Venice Film Festival; it then screened at the Toronto Film Festival before reopening in theaters in 2003. Other directing credits include the science fiction feature Idaho Transfer, starring Keith Carradine and Wanda Nevada in which he starred as a gambler who wins Brooke Shields in a poker game. Fonda co-starred in HBO's The Laramie Project, based on the true story of openly gay college student Matthew Shepard, killed in an act of senseless violence and cruelty, which attracted national attention. Fonda starred in The Maldonado Miracle directed by Salma Hayek for Showtime Networks, and was nominated for a Daytime Emmy Award for his role. Fonda also starred opposite Kris Kristofferson in Wooly Boys, which was released in March 2004, and the television drama Back When We Were Grownups, opposite Blythe Danner and Faye Dunaway. Fonda was seen in Soderbergh's Ocean's Twelve and can be seen in Mark Steven Johnson's Ghost Rider, opposite Nicolas Cage. Fonda's other projects include director Ron Maxwell's Civil War-era drama Copperhead, alongside actors Billy Campbell and Angus MacFadyen and The Ultimate Gift directed by Michael Landon Jr. Up next, Fonda can be seen in John McNaughton's The Harvest with Samantha Morton and Michael Shannon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg4NTE5MTEwNl5BMl5BanBnXkFtZTgwMTQ0NDk3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001228","name":"Peter Fonda","idIMDB":"nm0001228"},"actorId":"nm0001228","character":"The Roman","urlCharacter":"http://www.imdb.com/character/ch0127610","main":true},{"actorName":"Daniel DeSanto","urlProfile":"http://www.imdb.com/name/nm0220888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MjkxOTgwNV5BMl5BanBnXkFtZTcwNzczNzUzMQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"bio":"Daniel DeSanto is an actor and producer, known for Beyblade (2001), Mean Girls (2004) and Are You Afraid of the Dark? (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MjkxOTgwNV5BMl5BanBnXkFtZTcwNzczNzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0220888","name":"Daniel DeSanto","idIMDB":"nm0220888"},"actorId":"nm0220888","character":"Crew Cut","urlCharacter":"http://www.imdb.com/character/ch0163765","main":true},{"actorName":"Gerard Parkes","urlProfile":"http://www.imdb.com/name/nm0662730","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzM1OTI4NV5BMl5BanBnXkFtZTcwNjUwMjUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1924","placeOfBirth":" Dublin, Ireland","bio":"Gerard Parkes was born on October 16, 1924 in Dublin, Ireland. He is known for his work on The Boondock Saints (1999), Fraggle Rock (1983) and The Boondock Saints II: All Saints Day (2009). He was married to Sheelagh Norman. He died on October 19, 2014 in Toronto, Ontario, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzM1OTI4NV5BMl5BanBnXkFtZTcwNjUwMjUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662730","name":"Gerard Parkes","idIMDB":"nm0662730"},"actorId":"nm0662730","character":"Doc","urlCharacter":"http://www.imdb.com/character/ch0152146","main":true},{"actorName":"Matthew Lemche","urlProfile":"http://www.imdb.com/name/nm0501211","urlPhoto":"","biography":{"dateOfBirth":"31 May 1980","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Matthew Lemche","height":"5' 4\" (1.63 m)","bio":"Matthew Lemche was born in Etobicoke, Ontario and grew up in Brampton, a city just outside of Toronto. He is the second child of three, being the younger brother of actor Kris Lemche. He officially began his professional acting career in 1991 when he played a small guest role on \"The Kids in the Hall\" playing Scott Thompson as a boy. It wasn't until 1996, after being cast from an open call in Disney's \"Flash Forward,\" that Lemche began regular work as an actor.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0501211","name":"Matthew Lemche","idIMDB":"nm0501211"},"actorId":"nm0501211","character":"Noah","urlCharacter":"http://www.imdb.com/character/ch0332127","main":true},{"actorName":"Robert Mauriell","urlProfile":"http://www.imdb.com/name/nm1965257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1MjMwNzk1OF5BMl5BanBnXkFtZTcwMTUxMzQzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1981","placeOfBirth":" Woodbridge, Ontario, Canada","height":"5' 9\" (1.75 m)","bio":"Robert Mauriell was born on October 21, 1981 in Woodbridge, Ontario, Canada. He is an actor, known for The Boondock Saints II: All Saints Day (2009), Citizen Duane (2006) and Calogero (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1MjMwNzk1OF5BMl5BanBnXkFtZTcwMTUxMzQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1965257","name":"Robert Mauriell","idIMDB":"nm1965257"},"actorId":"nm1965257","character":"Louie","urlCharacter":"http://www.imdb.com/character/ch0183890","main":true},{"actorName":"Judd Nelson","urlProfile":"http://www.imdb.com/name/nm0000555","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODUwODQ5OV5BMl5BanBnXkFtZTcwMTUzNzQyMg@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1959","placeOfBirth":" Portland, Maine, USA","birthName":"Judd Asher Nelson","height":"5' 10\" (1.78 m)","bio":"Born in Portland, Maine to attorney Leonard Nelson and his wife, Merle Nelson, (attorney and state assemblywoman), Judd attended St. Paul's preparatory school in Concord, New Hampshire before majoring in philosophy at the prestigious Haverford College in Pennsylvania. The acting bug bit when he went to watch a friend's audition and was obliged to audition in order to stay. He won the role. After graduation, Judd headed for New York City and the Stella Adler Conservatory where he was believable in the role as the \"street-smart Eddie Keaton\" in the comedy Making the Grade (1984). Judd's next film role was as the stodgy ROTCer, Phil Hicks, in the ensemble comedy Fandango (1985). Important and diverse roles in the brat-pack films The Breakfast Club (1985) and St. Elmo's Fire (1985) quickly followed. With his privileged upbringing, Judd could have brought the right degree of preppy-smarmyness, (ala James Spader), to any number of vapid roles, but his intense stare and dark smoldering looks gave him a hint of danger which added to his credibility in films like the Billionaire Boys Club (1987), From the Hip (1987) and New Jack City (1991). While Judd's career has been peppered with under-promoted films and poorly-written TV appearances, critics have not been overly kind to this misunderstood actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODUwODQ5OV5BMl5BanBnXkFtZTcwMTUzNzQyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000555","name":"Judd Nelson","idIMDB":"nm0000555"},"actorId":"nm0000555","character":"Concezio Yakavetta","urlCharacter":"http://www.imdb.com/character/ch0132854","main":true}],"seasons":[],"idIMDB":"tt1300851","urlIMDB":"http://www.imdb.com/title/tt1300851","business":{"budget":{"money":"$8,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$10,244,070","country":"USA","day":"07","month":"02","year":"2010","remarks":""},{"money":"$10,210,931","country":"USA","day":"31","month":"01","year":"2010","remarks":""},{"money":"$10,179,970","country":"USA","day":"24","month":"01","year":"2010","remarks":""},{"money":"$10,150,172","country":"USA","day":"17","month":"01","year":"2010","remarks":""},{"money":"$10,082,650","country":"USA","day":"10","month":"01","year":"2010","remarks":""},{"money":"$9,744,417","country":"USA","day":"27","month":"12","year":"2009","remarks":""},{"money":"$9,365,018","country":"USA","day":"20","month":"12","year":"2009","remarks":""},{"money":"$8,475,017","country":"USA","day":"13","month":"12","year":"2009","remarks":""},{"money":"$7,218,197","country":"USA","day":"06","month":"12","year":"2009","remarks":""},{"money":"$5,722,723","country":"USA","day":"29","month":"11","year":"2009","remarks":""},{"money":"$2,495,119","country":"USA","day":"15","month":"11","year":"2009","remarks":""},{"money":"$1,244,450","country":"USA","day":"08","month":"11","year":"2009","remarks":""},{"money":"$9,957,954","country":"USA","day":"03","month":"01","year":"2009","remarks":""}],"weekendGross":[{"money":"$20,839","country":"USA","day":"07","month":"02","year":"2010","remarks":"56 Screens"},{"money":"$21,079","country":"USA","day":"31","month":"01","year":"2010","remarks":"43 Screens"},{"money":"$18,415","country":"USA","day":"24","month":"01","year":"2010","remarks":"33 Screens"},{"money":"$34,914","country":"USA","day":"17","month":"01","year":"2010","remarks":"50 Screens"},{"money":"$60,974","country":"USA","day":"10","month":"01","year":"2010","remarks":"75 Screens"},{"money":"$118,170","country":"USA","day":"03","month":"01","year":"2010","remarks":"102 Screens"},{"money":"$97,741","country":"USA","day":"27","month":"12","year":"2009","remarks":"102 Screens"},{"money":"$406,783","country":"USA","day":"20","month":"12","year":"2009","remarks":"404 Screens"},{"money":"$793,393","country":"USA","day":"13","month":"12","year":"2009","remarks":"524 Screens"},{"money":"$922,623","country":"USA","day":"06","month":"12","year":"2009","remarks":"432 Screens"},{"money":"$1,301,197","country":"USA","day":"29","month":"11","year":"2009","remarks":"373 Screens"},{"money":"$1,033,639","country":"USA","day":"15","month":"11","year":"2009","remarks":"251 Screens"},{"money":"$427,919","country":"USA","day":"08","month":"11","year":"2009","remarks":"105 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"20","month":"10","year":"2008","remarks":null},{"money":null,"country":null,"day":"09","month":"12","year":"2008","remarks":null}],"copyrightHolder":"Stage 6 Films, Inc."},"technical":{"runtime":["1 hr 58 min (118 min)","2 hr 18 min (138 min) (Director's Cut)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, USA (color)"],"filmLength":null,"negativeFormat":["35 mm (Fuji Eterna 250D 8563, Eterna 500T 8573)"],"cinematographicProcess":["Digital Intermediate (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.3","metascore":"24","filmingLocations":[{"location":"Valley Halla Estate, Rouge Park, Toronto, Ontario, Canada"}],"rated":"R","awards":[],"votes":"54,856","type":"Movie","companyCreditsSimple":[{"idCompany":"co0222021","name":"Stage 6 Films"},{"idCompany":"co0440226","name":"CB Productions"}],"keywords":{"keywords":["priest","ireland","sheep","justice","final showdown","violence","gunfight","gore","gun","gun duel","gun battle","bullet time","bullet ballet","bad taste humour","sardonic","heightism","homophobia","handgun","machine gun","organized crime","police","revolver","sunglasses","freight elevator","visible narrator","genuflecting","double barreled shotgun","twirling gun","nonlinear timeline","crashing through a window","sliding down a wire","texan accent","police tape","arsenal","arms dealer","shot multiple times","duct tape","american flag","crucifix","chewing gum","tanning bed","switch","massage","candle","shrimp cocktail","scream","drug lab","breath freshener","forklift","volkswagen beetle","handcuffs","feet","newscast","weapons cache","flock of sheep","narrated by character","gay slur","presumed dead","slow motion scene","black comedy","cult film","younger version of character","writing on someone","warehouse","vigilante","tomato","throat slitting","threatened with a knife","tattoo","tanning salon","surgery","subtitled scene","stuttering","stabbed in the back","spanish","soiling pants","silencer","shotgun","shot to death","shot through a wall","shot in the throat","shot in the stomach","shot in the shoulder","shot in the leg","shot in the head","shot in the hand","shot in the forehead","shot in the chest","shot in the back","shot in the arm","shootout","ship","sequel to cult film","russian roulette","rosary","rope","rogue agent","revenge","returning character killed off","racial slur","prison","prisoner","pool table","police station","police officer killed","police detective","pistol","pistol whip","panic room","new york city","murdered priest","massage parlor","male rear nudity","male frontal nudity","mafia","leg brace","knocked out with a gun butt","jumping through a window","janitor","italian","irish","irish catholic","hockey arena","hit with a hammer","heroin","held at gunpoint","headphones","hands tied behind back","greenhouse","grave","friendship","flashback","finger gun","fbi agent","father son relationship","fantasy sequence","falling through a glass roof","falling from height","faked death","earplug","duct tape over mouth","dream sequence","scene of the crime","corpse","copycat murder","confessional","coins on eyes","cigarette smoking","church","cameo","brother brother relationship","boston massachusetts","blood","blood splatter","bilingualism","betrayal","beaten to death","bar","bartender","bare chested male","assassin","arrest","1950s","sequel","second part","death of friend","death of father","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:13:46"}}