{"data":{"movies":[{"title":"Loving Leah","originalTitle":"","year":"2009","releaseDate":"20090125","directors":[{"name":"Jeff Bleckner","id":"nm0088121"}],"writers":[{"name":"Pnenah Goldstein","id":"nm1768277"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODU3NDkxN15BMl5BanBnXkFtZTcwNDE1NDUyMg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"When his estranged brother dies suddenly, Jake Lever is confronted with an old Jewish custom. In days past, a man was expected to marry his deceased brother's childless widow, but it is now customary to perform a ceremony releasing the pair from the obligation. During the Halizah ceremony, Jake feels uncomfortable renouncing his brother's memory. Additionally, Leah wishes to escape the confines of her orthodox community and avoid her mother's matchmaking. On the spur of the moment, Leah and Jake decide to enter into a platonic marriage of convenience.","simplePlot":"A quirky love story revolving around the unexpected wedding and unconventional married life of a 26-year-old widow and her late husband's brother, a handsome 30-year-old cardiologist.","actors":[{"actorName":"Lauren Ambrose","urlProfile":"http://www.imdb.com/name/nm0024404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NzI1NzkyOF5BMl5BanBnXkFtZTYwNTgwNDE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1978","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Lauren Anne D'Ambruoso","height":"5' 6\" (1.68 m)","bio":"Lauren Ambrose was born on February 20, 1978 in New Haven, Connecticut, USA as Lauren Anne D'Ambruoso. She is an actress and producer, known for Six Feet Under (2001), Can't Hardly Wait (1998) and Sleepwalk with Me (2012). She has been married to Sam Handel since September 2001. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NzI1NzkyOF5BMl5BanBnXkFtZTYwNTgwNDE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0024404","name":"Lauren Ambrose","idIMDB":"nm0024404"},"actorId":"nm0024404","character":"Leah Lever","urlCharacter":"http://www.imdb.com/character/ch0169674","main":true},{"actorName":"Adam Kaufman","urlProfile":"http://www.imdb.com/name/nm0442066","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTc5MDkyNTReQTJeQWpwZ15BbWU4MDUwMjc4MTYx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Adam is an American actor, who is best known for his roles as Lucas Newsome in the NBC series State Of Affairs, Charlie Keys in the Steven Spielberg produced mini-series Taken (2002), Parker Abrams on Buffy the Vampire Slayer (1997) and Ethan on Dawson's Creek (1998) where his and Kerr Smith's characters shared the first gay kiss on a one-hour drama in network history. Adam has worked steadily in television, starring in pilots for ABC (Brookfield (1999) written by Josh Schwartz, Metropolis (2000) opposite Michael Ealy), WB Bloomington, Indiana written by John Ridley, FOX (The Only Living Boy in New York (2000) opposite Jill Clayburgh and Kate Walsh) and UPN (Beck and Call (2004) opposite Jordana Spiro), and doing recurring and guest roles on Without a Trace (2002), NCIS (2003), Melrose Place (2009), Veronica Mars (2004), Mad Men (2007) and _The Client List_. He's also starred in a number of TV movies , including Hallmark Hall Of Fame's Loving Leah (2009) opposite Lauren Ambrose, Lying to Be Perfect (2010) opposite Poppy Montgomery, Perfectly Prudence (2011) opposite Jane Seymour and the upcoming The Thanksgiving House (2013) opposite Emily Rose. In 2006 Adam starred in Rogue Pictures feature film Altered (2006) written and directed by Eduardo Sánchez (The Blair Witch Project (1999)). His other feature credits include Come Away with Me (2005) opposite Mariangela Melato and Final Sale (2011) opposite Ivan Sergei and Laura Harris. Adam lives in Los Angeles with his son Jackson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTc5MDkyNTReQTJeQWpwZ15BbWU4MDUwMjc4MTYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0442066","name":"Adam Kaufman","idIMDB":"nm0442066"},"actorId":"nm0442066","character":"Jake Lever","urlCharacter":"http://www.imdb.com/character/ch0169675","main":true},{"actorName":"Susie Essman","urlProfile":"http://www.imdb.com/name/nm0261435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDY0MDg5NV5BMl5BanBnXkFtZTcwMzE0MzI3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1955","placeOfBirth":" Mt. Vernon, New York, USA","birthName":"Susan Essman","bio":"Susie Essman was born on May 31, 1955 in Mt. Vernon, New York, USA as Susan Essman. She is an actress and writer, known for Bolt (2008), Curb Your Enthusiasm (2000) and Keeping the Faith (2000). She has been married to Jim Harder since September 13, 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDY0MDg5NV5BMl5BanBnXkFtZTcwMzE0MzI3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0261435","name":"Susie Essman","idIMDB":"nm0261435"},"actorId":"nm0261435","character":"Malka","urlCharacter":"http://www.imdb.com/character/ch0169677","main":true},{"actorName":"Harris Yulin","urlProfile":"http://www.imdb.com/name/nm0950867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0Njk2MzgyNF5BMl5BanBnXkFtZTYwMDUwMDc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1937","placeOfBirth":" Los Angeles, California, USA","height":"5' 11¾\" (1.82 m)","bio":"Another one of those frustratingly nameless but omnipresent and talented faces of stage, film and TV, chameleon-like player Harris Yulin has avoided the severe stereotyping lost to many a prolific actor. Benign, balding and often bearded, Yulin off camera was a stark contrast to the tough, unsympathetic men he presented on camera. Born in Los Angeles in 1937, Yulin traveled extensively throughout Europe and Israel before deciding on an acting career. Attending UCLA, he studied acting with Jeff Corey before making his off-Broadway debut in \"Next Time I'll Sing for You\" in 1963. From there, Harris continued to forge a respectable name for himself in the classical arena, particularly in the works of Shakespeare. With credits including \"A Midsummer Night's Dream\" (1964), \"Richard III\" (1966) and \"King John\" (1967), he proved to be a stellar Hamlet in 1974, and subsequently played the role of Claudius to Kevin Kline's dour Dane in a 1986 production. Marking his Broadway debut in \"Watch on the Rhine\" in 1980, he impressed later that year alongside James Earl Jones in the contemporary drama \"A Lesson from Aloes\" (1980). His classical repertoire over the years has included \"Uncle Vanya\" (1981), \"Hedda Gabler\" (1981) and (2001), \"The Doctor's Dilemma\" (1982) \"Tartuffe\" (1984), \"The Seagull\" (1985), and a Broadway return with \"The Visit\" (1992). More recently, he won Drama Desk nominations for his superb work in \"The Price\" (1999) and \"The Diary of Anne Frank\" (2001). Keeping his base firmly in Los Angeles for most his career, he was one of the founders of the Los Angeles Classic Theater and has kept active on the regional theater scene over the years. A noted New York stage director, he helmed the off-Broadway productions \"Baba Goya,\" \"This Lime Tree Bower,\" and \"The Trip to Bountiful\". He is the the possessor of an intriguingly solemn, autocratic-looking mug, and his glowering intensity usually invites suspicion, scorn or skepticism... or all three. Yulin began appearing in films and TV in mid-life (1970), and a high percentage of his work earned standout notices, if not awards and outright stardom. He started impressively enough in Terry Southern's thoroughly bizarre film adaptation of John Barth's novel End of the Road (1970) amid a dream ensemble cast that included Stacy Keach, James Earl Jones, Dorothy Tristan, and James Coco. He then formed a strong acting bond with Keach, again playing best friend Wyatt Earp to Keach's Doc Holliday in an offbeat, revisionist version of their OK Corral story in 'Doc' (1971) that also co-starred Faye Dunaway. While strong supporting turns in The Midnight Man (1974), Night Moves (1975), Scarface (1983), Woody Allen's Another Woman (1988), Narrow Margin (1990), and Clear and Present Danger (1994) kept his name alive on the larger screen, his career found a stronger focus on TV. Over time, he played a number of flashy historical figures on the quality small screen, including Machine Gun Kelly (George Kelly), J. Edgar Hoover, Senator Joseph McCarthy, Israeli General Forman, Jesse James, George Marshall, Leonardo DaVinci and even the Bard himself. He could always be counted on to play a maniacal genius or the embodiment of white-collar corruption in a career piled with genuinely unsympathetic characters. His more mainstream filming has included lightweight comedies and horrors, such as Bad Dreams (1988), Ghostbusters II (1989), Multiplicity (1996) and Rush Hour 2 (2001), and the more familiar heavy drama, including the brutal urban tale Training Day (2001) starring Oscar-winner Denzel Washington, and the somber biopic Fur: An Imaginary Portrait of Diane Arbus (2006) with Nicole Kidman. Though Yulin has been unable to find the one transcending role to catapult him to the very top of his character ranks, he continues to enjoy an enviable career broaching age 70. Fresher audiences might recognize him from episodes of Star Trek: Deep Space Nine (1993), Law & Order (1990), Buffy the Vampire Slayer (1997), 24 (2001) and Frasier (1993), for which he earned a \"guest\" Emmy nomination. His late wife Gwen Welles, who succumbed to cancer at age 42 in 1993, was an actress of note (Robert Altman's Nashville (1975), in particular). A documentary chronicling his wife's illness and untimely death appeared at the 1998 Berlin Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0Njk2MzgyNF5BMl5BanBnXkFtZTYwMDUwMDc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950867","name":"Harris Yulin","idIMDB":"nm0950867"},"actorId":"nm0950867","character":"Rabbi Belsky","urlCharacter":"http://www.imdb.com/character/ch0169699","main":true},{"actorName":"Natasha Lyonne","urlProfile":"http://www.imdb.com/name/nm0005169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMzc2MTE2MzheQTJeQWpwZ15BbWU4MDUwNTY0ODYx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1979","placeOfBirth":" New York City, New York, USA","height":"5' 3½\" (1.61 m)","bio":"Natasha Lyonne is an American stage, film, and television actress. As a young child, she was signed by the Ford Modeling Agency and, at the age of six, was cast as a role in Pee-Wee's Playhouse. Natasha remained busy with appearances in almost 30 films over the next 10 years, including some starring roles in independent films. Lyonne is perhaps best-known for her roles in the \"American Pie\" films as the wise-cracking \"Jessica\". After a hiatus in 2008, due to well-documented health and legal struggles, Lyonne returned to work, As a young child, she was signed by the Ford Modeling Agency and, at the age of six, she was cast as \"Opal\" on Pee-wee's Playhouse (1986), which was quickly followed by film appearances in Heartburn (1986), written by Nora Ephron, directed by Mike Nichols; A Man Called Sarge (1990); and Dennis the Menace (1993), with Walter Matthau and Christopher Lloyd. At the age of 16, Woody Allen cast her as his and Goldie Hawn's daughter in Everyone Says I Love You (1996), alongside Julia Roberts, Edward Norton, Natalie Portman, which led to appearances in almost 30 films over the next 10 years, including starring roles in the independent films Slums of Beverly Hills (1998) and But I'm a Cheerleader (1999). Lyonne's other films included Detroit Rock City (1999); Scary Movie 2 (2001); The Grey Zone (2001), directed by Tim Blake Nelson; James Mangold's Kate & Leopold (2001); Party Monster (2003); Die, Mommie, Die! (2003) and Blade: Trinity (2004), as well as TV appearances on shows including NBC's Will & Grace (1998). Lyonne is perhaps best-known for her roles in the \"American Pie\" films as the wise-cracking \"Jessica\". After a short hiatus in 2008, due to well-documented health and legal struggles, Lyonne returned to work, making her New York stage debut in the award-winning New Group production of Mike Leigh's \"Two Thousand Years\" and in the films The Immaculate Conception of Little Dizzle (2009) and Goyband (2008). Since then, Lyonne has steadily worked in the New York theatre scene, in film and on television. Films include All About Evil (2010) with Thomas Dekker; Abel Ferrara's 4:44 Last Day on Earth (2011) with Willem Dafoe; and upcoming projects Girl Most Likely (2012) (aka \"Imogene\") with Kristen Wiig, Darren Criss, Matt Dillon and Annette Bening; The Rambler (2013) with Dermot Mulroney; Clutter (2013) with Carol Kane and Kathy Najimy; He's Way More Famous Than You (2013), written by Halley Feiffer and directed by Michael Urie, with Ben Stiller and Jesse Eisenberg. TV appearances include the hit series, New Girl (2011) and Law & Order: Special Victims Unit (1999). On stage, she was in the original cast of Nora Ephron and Delia Ephron's award-winning \"Love, Loss, and What I Wore\" with Samantha Bee, Tyne Daly, Katie Finneran and Rosie O'Donnell and in the original cast in Los Angeles at Geffen Playhouse with Tracee Ellis Ross, Carol Kane and Rita Wilson. She received rave reviews in Kim Rosenstock's \"Tigers Be Still\", directed by Sam Gold, with Reed Birney, Halley Feiffer, John Magaro at the Roundabout Theatre Company and returned this past season to the New Group stage with Ethan Hawke, Gordon Clapp and Daphne Rubin-Vega in Tommy Nohilly's \"Blood From a Stone\". Most recently, she participated in New Group's benefit performance of \"Women Behind Bars\", with Charles Busch, Josh Hamilton, Cynthia Nixon, Rhea Perlman and Rosie O'Donnell. Natasha was born Natasha Bianca Lyonne Braunstein in New York City, New York, to Ivette (Buchinger) and Aaron Braunstein, who is a talk radio host, boxing promoter, and race car driver. She is from a Jewish family. Her maternal grandparents, originally from Hungary, were Holocaust survivors who moved to Paris, France, where Natasha's mother was born.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMzc2MTE2MzheQTJeQWpwZ15BbWU4MDUwNTY0ODYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005169","name":"Natasha Lyonne","idIMDB":"nm0005169"},"actorId":"nm0005169","character":"Esther","urlCharacter":"http://www.imdb.com/character/ch0169680","main":true},{"actorName":"Christy Pusz","urlProfile":"http://www.imdb.com/name/nm2891270","urlPhoto":"","biography":{"bio":"Christy Pusz is an actress, known for Loving Leah (2009), Rachel Getting Married (2008) and Almost in Love (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2891270","name":"Christy Pusz","idIMDB":"nm2891270"},"actorId":"nm2891270","character":"Carol","urlCharacter":"http://www.imdb.com/character/ch0169681","main":true},{"actorName":"Ricki Lake","urlProfile":"http://www.imdb.com/name/nm0001442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzU1MTI4MV5BMl5BanBnXkFtZTcwMTgzMzc1MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1968","placeOfBirth":" Hastings-on-Hudson, New York, USA","birthName":"Ricki Pamela Lake","height":"5' 4\" (1.63 m)","bio":"Ricki Lake was born in Hastings-on-Hudson, New York, surprisingly as a blond. She has one sister, who is one year younger than she, named Jennifer. Her father, Barry, is a pharmacist, and her mother, Jill, is a homemaker. The two currently reside in Las Vegas, Nevada. Ricki attended Hastings Elementary as a child, went on to Farragut Middle, and then attended Hastings High, for two years. At the end of her sophomore year, she transferred to the Professional Children's School, in New YCork, to focus on perfecting her craft as an actress. Also, Ricki began singing professionally at the age of nine, in cabarets and clubs. After finishing high school, she attended Ithaca College for one year. During final exams in her freshman year, she received a call from her agent, telling her to audition for the lead in a John Waters film. Unsurprisingly, she landed the role as \"Tracy Turnblad.\" Thus, Hairspray (1988) marked Ricki Lake's movie debut. She then went on to act in 15 more movies and had a recurring role in ABC's China Beach (1988), for one season. At one point in her life, she hit rock-bottom. Then, she decided to take charge of her life and make a dramatic change. She began eating right and exercising and soon lost over 125 pounds. In 1993, she was chosen, out of a hundred people, to host her own daytime talk show. After only three years, Ricki Lake (1992) became rated second in its time frame. Also, in 1993, she met the man of her dreams. At a Halloween party, she locked eyes with Rob Sussman, a political illustrator, who was to become her husband. It was love at first sight, on both sides. The two married in Las Vegas in March 1994 but divorced in 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzU1MTI4MV5BMl5BanBnXkFtZTcwMTgzMzc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001442","name":"Ricki Lake","idIMDB":"nm0001442"},"actorId":"nm0001442","character":"Rabbi Gerry","urlCharacter":"http://www.imdb.com/character/ch0169679","main":true},{"actorName":"Mercedes Ruehl","urlProfile":"http://www.imdb.com/name/nm0001689","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MDU2MzkzNF5BMl5BanBnXkFtZTYwMDE5NTc4._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1948","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Mercedes J. Ruehl","height":"5' 10\" (1.78 m)","bio":"Mercedes Ruehl was born February 28, 1948 in Jackson Heights, Queens, New York City to Mercedes Ruehl, a school teacher, and Vincent Ruehl, an FBI agent. She made several film and television appearance before coming to her most successfully received role in Terry Gilliam's The Fisher King (1991). She played the part of Jeff Bridges's on-screen supportive yet neurotic girlfriend, Anne. Her performance in the film earned her an Oscar, a Golden Globe, Saturn Award, American Comedy Award, BSFC Award, CFCA Award, LAFCA Award and a Pasinetti Award. While Mercedes is first and foremost an actress of the stage, we should acknowledge her spellbinding performances as the mentally deranged and overbearing Connie Russo in Married to the Mob (1988), the mentally challenged, protective, loving, and adventurous Bella in Neil Simon's Lost in Yonkers (1993), and the dying and determined title-character in Roseanna's Grave (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MDU2MzkzNF5BMl5BanBnXkFtZTYwMDE5NTc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001689","name":"Mercedes Ruehl","idIMDB":"nm0001689"},"actorId":"nm0001689","character":"Janice Lever","urlCharacter":"http://www.imdb.com/character/ch0169676","main":true},{"actorName":"Tonye Patano","urlProfile":"http://www.imdb.com/name/nm0665256","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTI3ODM5M15BMl5BanBnXkFtZTcwOTE0Mzg1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tonye Patano is an actress and producer, known for Weeds (2005), Law & Order: Special Victims Unit (1999) and The Taking of Pelham 123 (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTI3ODM5M15BMl5BanBnXkFtZTcwOTE0Mzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665256","name":"Tonye Patano","idIMDB":"nm0665256"},"actorId":"nm0665256","character":"Emily","urlCharacter":"http://www.imdb.com/character/ch0169692","main":true},{"actorName":"Donnie Keshawarz","urlProfile":"http://www.imdb.com/name/nm1334507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTA1ODkzMl5BMl5BanBnXkFtZTgwMzkyNjA4MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1969","placeOfBirth":" Guelph, Ontario, Canada","bio":"Donnie was born in Guelph, Ontario and raised in Jonesboro, Arkansas. Before discovering acting, Donnie was a soccer addict, then frontman for the prog-rock group Elements. He has a BFA from Rutgers University, and an MFA from The University of Missouri at Kansas City. Donnie resides in New York with his wife and his daughter, Sofia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTA1ODkzMl5BMl5BanBnXkFtZTgwMzkyNjA4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1334507","name":"Donnie Keshawarz","idIMDB":"nm1334507"},"actorId":"nm1334507","character":"Raj","urlCharacter":"http://www.imdb.com/character/ch0169689","main":true},{"actorName":"Sylvia Kauders","urlProfile":"http://www.imdb.com/name/nm0441988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1Njk2MjkzMV5BMl5BanBnXkFtZTcwMDY3MTgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1921","placeOfBirth":" South Philadelphia, Pennsylvania, USA","birthName":"Sylvia Wolinsky","height":"5' (1.52 m)","bio":"Sylvia Kauders was born on December 1, 1921 in South Philadelphia, Pennsylvania, USA as Sylvia Wolinsky. She was an actress, known for The Wrestler (2008), Inside Llewyn Davis (2013) and Witness (1985). She was married to Randle Kauders. She died on May 5, 2016 in South Philadelphia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1Njk2MjkzMV5BMl5BanBnXkFtZTcwMDY3MTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441988","name":"Sylvia Kauders","idIMDB":"nm0441988"},"actorId":"nm0441988","character":"Widow Goldfarb","urlCharacter":"http://www.imdb.com/character/ch0169687","main":true},{"actorName":"Jayne Houdyshell","urlProfile":"http://www.imdb.com/name/nm1159251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NTA5ODkyMl5BMl5BanBnXkFtZTcwODE4MTU0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jayne Houdyshell is an actress, known for Garden State (2004), The Bounty Hunter (2010) and Maid in Manhattan (2002). She was previously married to Steve Shaffer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NTA5ODkyMl5BMl5BanBnXkFtZTcwODE4MTU0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1159251","name":"Jayne Houdyshell","idIMDB":"nm1159251"},"actorId":"nm1159251","character":"Mrs. Finkelman","urlCharacter":"http://www.imdb.com/character/ch0169685","main":true},{"actorName":"David Rossmer","urlProfile":"http://www.imdb.com/name/nm1838173","urlPhoto":"","biography":{"bio":"David Rossmer is an actor, known for Robots (2005), Loving Leah (2009) and Law & Order: Special Victims Unit (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1838173","name":"David Rossmer","idIMDB":"nm1838173"},"actorId":"nm1838173","character":"Rabbi Benjamin Lever","urlCharacter":"http://www.imdb.com/character/ch0169694","main":true},{"actorName":"Tibor Feldman","urlProfile":"http://www.imdb.com/name/nm0271127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY3NzY5NTQzMl5BMl5BanBnXkFtZTgwMzEyMjk4MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1947","placeOfBirth":"","bio":"Tibor Feldman was born on April 25, 1947. He is an actor, known for The Devil Wears Prada (2006), Enchanted (2007) and The International (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY3NzY5NTQzMl5BMl5BanBnXkFtZTgwMzEyMjk4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0271127","name":"Tibor Feldman","idIMDB":"nm0271127"},"actorId":"nm0271127","character":"Dr. Saloway","urlCharacter":"http://www.imdb.com/character/ch0169684","main":true},{"actorName":"Jolly Abraham","urlProfile":"http://www.imdb.com/name/nm2049306","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzQyMDU5Nl5BMl5BanBnXkFtZTcwODIwNTczOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jolly Abraham is an actress, known for Stay (2005), A Walk Among the Tombstones (2014) and Loving Leah (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzQyMDU5Nl5BMl5BanBnXkFtZTcwODIwNTczOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2049306","name":"Jolly Abraham","idIMDB":"nm2049306"},"actorId":"nm2049306","character":"Priya","urlCharacter":"http://www.imdb.com/character/ch0169682","main":true}],"seasons":[],"idIMDB":"tt1346983","urlIMDB":"http://www.imdb.com/title/tt1346983","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"09","year":"2008","remarks":null},{"money":null,"country":null,"day":"08","month":"10","year":"2008","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1 (1.78:1)"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["The Lab at Postworks, USA"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Super 35 (3-perf)"],"printedFilmFormat":null},"rating":"7.0","filmingLocations":[],"rated":"TV-PG","awards":[{"award":"Primetime Emmy Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Music Composition for a Miniseries, Movie or a Special (Original Dramatic Score)","names":[{"name":"Jeff Beal","id":"nm0063618","role":"music by"}]}]}]},{"award":"Casting Society of America, USA 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Television Movie","names":[{"name":"Lynn Kressel","id":"nm0470948","role":null}]}]}]},{"award":"Online Film & Television Association 2009","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Television Award","categories":[{"category":"Best Music in a Motion Picture or Miniseries","names":[]}]}]},{"award":"Satellite Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Motion Picture Made for Television","names":[]},{"category":"Best Actress in a Miniseries or a Motion Picture Made for Television","names":[{"name":"Lauren Ambrose","id":"nm0024404","role":null}]}]}]}],"votes":"2,115","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0078555","name":"Hallmark Hall of Fame Productions"}],"keywords":{"keywords":["levirate","jewish woman","chick flick","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:22:22"}}