{"data":{"movies":[{"title":"Mr. Popper's Penguins","originalTitle":"","year":"2011","releaseDate":"20110617","directors":[{"name":"Mark Waters","id":"nm0914134"}],"writers":[{"name":"Sean Anders","id":"nm1890845"},{"name":"John Morris","id":"nm1898234"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMDI4NjEyOF5BMl5BanBnXkFtZTcwNzg5MzEwNQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family","Fantasy"],"plot":"Tom Popper grew up having very little interaction with his father who was off exploring the world. When he grows up he spends most of time on his work and ignores his children. One day his father sends him an unusual gift: a penguin. Popper can't help but wonder why his father would send him a penguin. He tries to get rid of it, but accidentally orders five more. When his children and ex-wife show up to celebrate his son's birthday, the kids are taken with the penguins. And Popper finally gets to connect with his kids while his work suffers.","simplePlot":"The life of a businessman begins to change after he inherits six penguins, and as he transforms his apartment into a winter wonderland, his professional side starts to unravel.","actors":[{"actorName":"Jim Carrey","urlProfile":"http://www.imdb.com/name/nm0000120","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjAwNzI0M15BMl5BanBnXkFtZTcwOTY1MTMyOQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1962","placeOfBirth":" Newmarket, Ontario, Canada","birthName":"James Eugene Carrey","height":"6' 2\" (1.88 m)","bio":"Jim Carrey, Canadian-born and a U.S. citizen since 2004, is an actor and producer famous for his rubbery body movements and flexible facial expressions. The two-time Golden Globe-winner rose to fame as a cast member of the Fox sketch comedy In Living Color (1990) but leading roles in Ace Ventura: Pet Detective (1994), Dumb & Dumber (1994) and The Mask (1994) established him as a bankable comedy actor. James Eugene Carrey was born on January 17, 1962 in Newmarket, Ontario, Canada, and is the youngest of four children of Kathleen (Oram), a homemaker, and Percy Carrey, an accountant and jazz musician. The family surname was originally \"Carré\", and he has French-Canadian, Scottish, and Irish ancestry. Carrey was an incurable extrovert from day one. As a child, he performed constantly, for anyone who would watch, and even mailed his résumé to The Carol Burnett Show (1967) at age 10. In junior high, he was granted a few precious minutes at the end of each school day to do stand-up routines for his classmates (provided, of course, that he kept a lid on it the rest of the day). Carrey's early adolescence took a turn for the tragic, however, when the family was forced to relocate from their cozy town of Newmarket to Scarborough (a Toronto suburb). They all took security and janitorial jobs in the Titan Wheels factory, Jim working 8-hour shifts after school let out (not surprisingly, his grades and morale both suffered). When they finally deserted the factory, the family lived out of a Volkswagen camper van until they could return to Toronto. Carrey made his stand-up debut in Toronto after his parents and siblings got back on their feet. He made his (reportedly awful) professional stand-up debut at Yuk-Yuk's, one of the many local clubs that would serve as his training ground in the years to come. He dropped out of high school, worked on his celebrity impersonations (among them Michael Landon and James Stewart), and in 1979 worked up the nerve to move to Los Angeles. He finessed his way into a regular gig at The Comedy Store, where he impressed Rodney Dangerfield so much that the veteran comic signed him as an opening act for an entire season. During this period Carrey met and married waitress Melissa Womer, with whom he had a daughter (Jane). The couple would later go through a very messy divorce, freeing Carrey up for a brief second marriage to actress Lauren Holly. Wary of falling into the lounge act lifestyle, Carrey began to look around for other performance outlets. He landed a part as a novice cartoonist in the short-lived sitcom The Duck Factory (1984); while the show fell flat, the experience gave Carrey the confidence to pursue acting more vigorously. Carrey also worked on breaking into film around this time. He scored the male lead in the ill-received Lauren Hutton vehicle Once Bitten (1985), and had a supporting role in Peggy Sue Got Married (1986), before making a modest splash with his appearance as the alien Wiploc in Earth Girls Are Easy (1988). Impressed with Carrey's lunacy, fellow extraterrestrial Damon Wayans made a call to his brother, Keenen Ivory Wayans, who was in the process of putting together the sketch comedy show In Living Color (1990). Carrey joined the cast and quickly made a name for himself with outrageous acts (one of his most popular characters, psychotic Fire Marshall Bill, was attacked by watchdog groups for dispensing ill- advised safety tips). Following his time on In Living Color (1990), Carrey's transformation from TV goofball to marquee headliner happened within the course of a single year. He opened 1994 with a starring turn in Ace Ventura: Pet Detective (1994), a film that cashed in on his extremely physical brand of humor (the character's trademark was talking out his derrière). Next up was the manic superhero movie The Mask (1994), which had audiences wondering just how far Carrey's features could stretch. Finally, in December 1994, he hit theaters as a loveable dolt in the Farrelly brothers' Dumb & Dumber (1994) (his first multi-million dollar payday). Now a box-office staple, Carrey brought his manic antics onto the set of Batman Forever (1995), replacing Robin Williams as The Riddler. He also filmed the follow-up to his breakthrough, Ace Ventura: When Nature Calls (1995), and inked a deal with Sony to star in The Cable Guy (1996) (replacing Chris Farley) for a cool $20 million--at the time, that was the biggest up-front sum that had been offered to any comic actor. The movie turned out to be a disappointment, both critically and financially, but Carrey bounced back the next year with the energetic hit Liar Liar (1997). Worried that his comic shtick would soon wear thin, Carrey decided to change course. In 1998, he traded in the megabucks and silly grins to star in Peter Weir's The Truman Show (1998) playing a naive salesman who discovers that his entire life is the subject of a TV show, Carrey demonstrated an uncharacteristic sincerity that took moviegoers by surprise. He won a Golden Globe for the performance, and fans anticipated an Oscar nomination as well--when it didn't materialize, Carrey lashed out at Academy members for their narrow-minded selection process. Perhaps inspired by the snub, Carrey threw himself into his next role with abandon. After edging out a handful of other hopefuls (including Edward Norton) to play eccentric funnyman Andy Kaufman in Man on the Moon (1999), Carrey disappeared into the role, living as Kaufman -- and his blustery alter-ego Tony Clifton -- for months (Carrey even owned Kaufman's bongo drums, which he'd used during his audition for director Milos Forman). His sometimes uncanny impersonation was rewarded with another Golden Globe, but once again the Academy kept quiet. An indignant Carrey next reprised his bankable mania for the Farrelly brothers in Me, Myself & Irene (2000), playing a state trooper whose Jekyll and Hyde personalities both fall in love with the same woman (Renée Zellweger). Carrey's real-life persona wound up falling for her too--a few months after the film wrapped, the pair announced they were officially a couple. By then, Carrey had already slipped into a furry green suit to play the stingy antihero of Ron Howard's How the Grinch Stole Christmas (2000). Although Carrey maintains a foothold in the comedy world with films such as Bruce Almighty (2003) and Mr. Popper's Penguins (2011), he is also capable of turning in nuanced dramatic performances, as demonstrated in films like Eternal Sunshine of the Spotless Mind (2004) and the drama/comedy Yes Man (2008). In 2013, he costars with Steve Carell in The Incredible Burt Wonderstone (2013). Carrey has one child with his first wife, Melissa Carrey, whom he divorced in 1995. He married actress Lauren Holly in 1996, but they split less than a year later.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjAwNzI0M15BMl5BanBnXkFtZTcwOTY1MTMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000120","name":"Jim Carrey","idIMDB":"nm0000120"},"actorId":"nm0000120","character":"Mr. Popper","urlCharacter":"http://www.imdb.com/character/ch0251113","main":true},{"actorName":"Carla Gugino","urlProfile":"http://www.imdb.com/name/nm0001303","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQyNTgzOTI2OF5BMl5BanBnXkFtZTgwNTMyMDk0NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1971","placeOfBirth":" Sarasota, Florida, USA","birthName":"Carla N. Gugino","height":"5' 5\" (1.65 m)","bio":"Carla Gugino was born in Sarasota, Florida, to Carl Gugino, an orthodontist. She is of Italian (father) and English-Irish (mother) ancestry. Gugino moved with her mother to Paradise, California, when Carla was just five years old. During her childhood, they moved many times within the state. But she remained a straight-A student throughout high school and graduated as valedictorian. A major modeling agency discovered Carla in San Diego and sent her to New York to begin a new career when she was 15. New York was more than she could handle at that young age, so she returned to LA in the summer, modeling and enrolling in an acting class at the suggestion of her aunt, Carol Merrill, known from Let's Make a Deal (1963). During her free time, Carla enjoys yoga, traveling and spending time with her friends in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQyNTgzOTI2OF5BMl5BanBnXkFtZTgwNTMyMDk0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001303","name":"Carla Gugino","idIMDB":"nm0001303"},"actorId":"nm0001303","character":"Amanda","urlCharacter":"http://www.imdb.com/character/ch0251645","main":true},{"actorName":"Angela Lansbury","urlProfile":"http://www.imdb.com/name/nm0001450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzOTk0OTYyOV5BMl5BanBnXkFtZTYwNzU1MTkz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1925","placeOfBirth":" Regent's Park, London, England, UK","birthName":"Angela Brigid Lansbury","height":"5' 8\" (1.73 m)","bio":"British character actress, long in the United States. The daughter of an actress and the granddaughter of a high-ranking politician, Lansbury studied acting from her youth, departing for the United States as the Second World War began. She was contracted by MGM while still a teenager and nominated for an Academy Award for her first film, Gaslight (1944). Two pictures later, she was again nominated for Best Supporting Actress, this time for The Picture of Dorian Gray (1945). Now established as a supporting player of quality, she began a long career, often as \"the other woman\" in major productions and as the leading lady in lesser films. Her features, while not at all old-appearing, gave her an air of maturity that allowed her to pass as much older than she actually was, and she began playing mother roles, often to players of her own age, while yet in her thirties. She concentrated more and more on stage work, achieving notable success in a number of Broadway plays and musicals, winning four Tony Awards in sixteen years. Although active in television since the early 1950s, she obtained her greatest fame in the 1980s by starring in the light mystery program Murder, She Wrote (1984). As Jessica Fletcher, she became known and loved by millions for well over a decade. She also became known for the odd fact of almost annual Emmy Award nominations for the role without ever winning for it. An institution in American theatre and television, she is also an inspiration for the graciousness of her personality, which is often exploited and always admired.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzOTk0OTYyOV5BMl5BanBnXkFtZTYwNzU1MTkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001450","name":"Angela Lansbury","nicknames":["Angie"],"idIMDB":"nm0001450"},"actorId":"nm0001450","character":"Mrs. Van Gundy","urlCharacter":"http://www.imdb.com/character/ch0256643","main":true},{"actorName":"Ophelia Lovibond","urlProfile":"http://www.imdb.com/name/nm1166041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzA3MDcyNl5BMl5BanBnXkFtZTcwNDc2NjI4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1986","placeOfBirth":" London, England, UK","birthName":"Ophelia Lucy Lovibond","height":"5' 2\" (1.57 m)","bio":"Ophelia Lovibond was born on February 19, 1986 in London, England as Ophelia Lucy Lovibond. She is an actress, known for Guardians of the Galaxy (2014), The Autopsy of Jane Doe (2016) and No Strings Attached (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzA3MDcyNl5BMl5BanBnXkFtZTcwNDc2NjI4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1166041","name":"Ophelia Lovibond","nicknames":["Fifi"],"idIMDB":"nm1166041"},"actorId":"nm1166041","character":"Pippi","urlCharacter":"http://www.imdb.com/character/ch0256645","main":true},{"actorName":"Madeline Carroll","urlProfile":"http://www.imdb.com/name/nm1630992","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTE2MjExMF5BMl5BanBnXkFtZTgwMzg4NTAyNjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1996","placeOfBirth":" Los Angeles, California, USA","height":"5' 4\" (1.63 m)","bio":"Madeline was born March 18, 1996 and raised in Los Angeles, California. She began modeling when she was 3 years old, soon after she was discovered by her Theatrical agent \"Wendy\" in a nail shop in Sherman Oaks and began her theatrical acting career. She has performed in around 60 principal role/national commercials. you may have seen Madeline in guest-starring performances on several TV shows and series. Madeline absolutely enjoys scary movies, and her favorite roles so far, White Queen, in Resident Evil 3: Extinction, and Molly from Swing Vote. Madeline also enjoys playing with her 3 brothers and has a dog named Spot. She is very active in giving to foundation \"Zoe International\" a non-profit Christian organization which rescues children from child prostitution.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTE2MjExMF5BMl5BanBnXkFtZTgwMzg4NTAyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1630992","name":"Madeline Carroll","nicknames":["Mads"],"idIMDB":"nm1630992"},"actorId":"nm1630992","character":"Janie","urlCharacter":"http://www.imdb.com/character/ch0256648","main":true},{"actorName":"Clark Gregg","urlProfile":"http://www.imdb.com/name/nm0163988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYyNjAwNDUyOV5BMl5BanBnXkFtZTgwOTc5NzgyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1962","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Robert Clark Gregg","height":"5' 9\" (1.75 m)","bio":"Clark Gregg was born on April 2, 1962 in Boston, Massachusetts, USA as Robert Clark Gregg. He is an actor and writer, known for The Avengers (2012), Agents of S.H.I.E.L.D. (2013) and The New Adventures of Old Christine (2006). He has been married to Jennifer Grey since July 21, 2001. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYyNjAwNDUyOV5BMl5BanBnXkFtZTgwOTc5NzgyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163988","name":"Clark Gregg","idIMDB":"nm0163988"},"actorId":"nm0163988","character":"Nat Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey Tambor","urlProfile":"http://www.imdb.com/name/nm0001787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQxMzA3NzQzM15BMl5BanBnXkFtZTcwMTQxMDc3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1944","placeOfBirth":" San Francisco, California, USA","birthName":"Jeffrey Michael Tambor","height":"6' 1\" (1.85 m)","bio":"An incisive talent when it comes to playing bent, off-the-wall characters, Jeffrey Tambor has been captivating audiences for nearly four decades. Tambor was born and raised in San Francisco, to Eileen (Salzberg) and Michael Bernard Tambor, a flooring contractor. His family is Ashkenazi Jewish (from Hungary and Ukraine). He studied acting at San Francisco State University and earned his Bachelors of Arts degree there. Following his Masters at Wayne State University, he started building up his resume in repertory theater. He was first seen on episodic TV in the mid-'70s in both comedies (Taxi (1978), Barney Miller (1974)) and dramas (Kojak (1973), Starsky and Hutch (1975)). A large, somewhat looming fellow, his sly-eyed look and leering gaze, matched with a bright set of pearly teeth and stark pattern baldness, made him a natural for broad, warped comedy. The folks at Three's Company (1976) brought Jeffrey back time and time again, standing toe-to-toe with John Ritter and stealing many of their scenes with his noticeably bizarre gents. Before his \"Three's Company\" guest roles, he co-starred in the show's spin-off The Ropers (1979) with Norman Fell and Audra Lindley. He and Patty McCormack played the Ropers' chagrined neighbors. On the legitimate stage, he has been an earnest player over the years with performances in \"Sly Fox\" and \"Glengarry Glen Ross\" on Broadway in addition to roles in \"Measure for Measure,\" \"A Flea in Her Ear\" and \"The Seagull.\" On the side, Jeffrey has directed a number of stage productions and teaches acting in the Los Angeles area. Although not as well known for his film work, he made a strong dramatic impression in his film debut ...and justice for all. (1979), in which he played Al Pacino's half-crazed law partner. He went on to enhance a number of other movies including The Dream Chasers (1984), Mr. Mom (1983), Brenda Starr (1989), Radioland Murders (1994), Doctor Dolittle (1998), Pollock (2000). More recently he played the Mayor of Whoville in How the Grinch Stole Christmas (2000). Emmy-nominated for his quirky work on The Larry Sanders Show (1992), Jeffrey's fondness and talent for the weird and wacky has recently found a nesting roost. Quite at home amid the insanity in the series Arrested Development (2003), he recently copped another Emmy nomination as the patriarch of the highly dysfunctional Bluth family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQxMzA3NzQzM15BMl5BanBnXkFtZTcwMTQxMDc3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001787","name":"Jeffrey Tambor","idIMDB":"nm0001787"},"actorId":"nm0001787","character":"Mr. Gremmins","urlCharacter":"http://www.imdb.com/character/ch0256652","main":true},{"actorName":"David Krumholtz","urlProfile":"http://www.imdb.com/name/nm0472710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTIxNTA0Nl5BMl5BanBnXkFtZTgwNTM2MTkxNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1978","placeOfBirth":" Queens, New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"David Krumholtz was born on May 15, 1978 in Queens, New York City, New York, USA. He is an actor and producer, known for Sausage Party (2016), Numb3rs (2005) and Slums of Beverly Hills (1998). He has been married to Vanessa Britting since May 22, 2010. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTIxNTA0Nl5BMl5BanBnXkFtZTgwNTM2MTkxNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0472710","name":"David Krumholtz","idIMDB":"nm0472710"},"actorId":"nm0472710","character":"Kent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Baker Hall","urlProfile":"http://www.imdb.com/name/nm0001311","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTA2NDA2MF5BMl5BanBnXkFtZTcwMzY5ODAxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1931","placeOfBirth":" Toledo, Ohio, USA","height":"5' 6\" (1.68 m)","bio":"Philip Baker Hall was born in Toledo, Ohio, to Berdene (McDonald) and William Alexander Hall, a factory worker who was originally from Montgomery, Alabama. He did not start acting until he was 30 years old, and shot to cult fame when he turned in an electrifying performance as Sydney, the veteran gambler, in Paul Thomas Anderson's debut feature, Hard Eight (1996). However, it was his underrated work in the same director's star-studded Magnolia (1999) that really caught the mass film public's attention. His performance as the legendary quiz show presenter \"Jimmy Gator\" was an incredible performance. He has since been in a few blockbuster movies, like The Sum of All Fears (2002), and stars in Dogville (2003), directed by Lars von Trier.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTA2NDA2MF5BMl5BanBnXkFtZTcwMzY5ODAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001311","name":"Philip Baker Hall","idIMDB":"nm0001311"},"actorId":"nm0001311","character":"Franklin","urlCharacter":"http://www.imdb.com/character/ch0256656","main":true},{"actorName":"Maxwell Perry Cotton","urlProfile":"http://www.imdb.com/name/nm2265334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDU3ODYwODFeQTJeQWpwZ15BbWU4MDczNTY0NDMx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 2000","placeOfBirth":" San Diego, California, USA","height":"5' 8\" (1.73 m)","bio":"Maxwell Perry Cotton was born on May 7, 2000 in San Diego, California, USA. He is an actor, known for Brothers & Sisters (2006), Elysium (2013) and Mr. Popper's Penguins (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDU3ODYwODFeQTJeQWpwZ15BbWU4MDczNTY0NDMx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2265334","name":"Maxwell Perry Cotton","idIMDB":"nm2265334"},"actorId":"nm2265334","character":"Billy","urlCharacter":"http://www.imdb.com/character/ch0250881","main":true},{"actorName":"James Tupper","urlProfile":"http://www.imdb.com/name/nm0876805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MjkyMTExNl5BMl5BanBnXkFtZTcwNzg2ODE3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1965","placeOfBirth":" Dartmouth, Nova Scotia, Canada","birthName":"James Howard Tupper","height":"6' 1\" (1.85 m)","bio":"James Tupper was born on August 4, 1965 in Dartmouth, Nova Scotia, Canada as James Howard Tupper. He is an actor and writer, known for Revenge (2011), Mr. Popper's Penguins (2011) and Playing for Keeps (2012). He was previously married to Katherine Mayfield.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MjkyMTExNl5BMl5BanBnXkFtZTcwNzg2ODE3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0876805","name":"James Tupper","nicknames":["Jimmy"],"idIMDB":"nm0876805"},"actorId":"nm0876805","character":"Rick","urlCharacter":"http://www.imdb.com/character/ch0256659","main":true},{"actorName":"Dominic Chianese","urlProfile":"http://www.imdb.com/name/nm0156940","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Njk4MzgyNF5BMl5BanBnXkFtZTcwMzM0NDk4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1931","placeOfBirth":" Bronx, New York City, New York, USA","height":"5' 11\" (1.8 m)","bio":"A multi-talented performer--as well as being an actor, he is an accomplished singer. He released a new music CD in late 2000 on which he sings American and Italian standards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Njk4MzgyNF5BMl5BanBnXkFtZTcwMzM0NDk4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0156940","name":"Dominic Chianese","idIMDB":"nm0156940"},"actorId":"nm0156940","character":"Reader","urlCharacter":"http://www.imdb.com/character/ch0256664","main":true},{"actorName":"William Charles Mitchell","urlProfile":"http://www.imdb.com/name/nm1305878","urlPhoto":"","biography":{"bio":"William Charles Mitchell is an actor, known for Mr. Popper's Penguins (2011), Syriana (2005) and Watercolors (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1305878","name":"William Charles Mitchell","idIMDB":"nm1305878"},"actorId":"nm1305878","character":"Yates","urlCharacter":"http://www.imdb.com/character/ch0256665","main":true},{"actorName":"Henry Kelemen","urlProfile":"http://www.imdb.com/name/nm4630480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTk3MzU4OV5BMl5BanBnXkFtZTgwNzI5NTE4NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"4' 8\" (1.42 m)","bio":"Henry Kelemen is an actor, known for Mr. Popper's Penguins (2011), 10,000 Saints (2015) and One More Time (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTk3MzU4OV5BMl5BanBnXkFtZTgwNzI5NTE4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4630480","name":"Henry Kelemen","idIMDB":"nm4630480"},"actorId":"nm4630480","character":"Young Tommy Popper","urlCharacter":"http://www.imdb.com/character/ch0251113","main":true},{"actorName":"Kelli Barrett","urlProfile":"http://www.imdb.com/name/nm1799058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODcyMTMzMF5BMl5BanBnXkFtZTcwMjc3NzY2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1984","placeOfBirth":" Virginia Beach, Virginia, USA","height":"5' 5\" (1.65 m)","bio":"Born in Virginia Beach Virginia and raised by a single working mother, Kelli always knew she was an actor. She grew up singing in the church choir and going to after school performing arts schools, including the Governor's School for the Arts in high school. She has taken voice lessons since childhood, originally trained by a retired Juilliard professor in opera. Now she sings everything from classical to rock on Broadway. She has also been working in TV and film since the age of 15, driving back and forth to Wilmington N.C. and New York City for auditions. Her first jobs were shot locally in Virginia Beach (allowing her to remain in school) and included everything from hosting a pilot of a new music video show for CBN to several \"reenactment\" films for TLC and the Discovery Channel. She attended The University of the Arts in Philadelphia, PA for music theater and is now a primary New York City resident splitting her time between stage and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODcyMTMzMF5BMl5BanBnXkFtZTcwMjc3NzY2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1799058","name":"Kelli Barrett","idIMDB":"nm1799058"},"actorId":"nm1799058","character":"Tommy's Mom","urlCharacter":"http://www.imdb.com/character/ch0256667","main":true}],"seasons":[],"idIMDB":"tt1396218","urlIMDB":"http://www.imdb.com/title/tt1396218","business":{"budget":{"money":"$55,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$68,218,041","country":"USA","day":"16","month":"10","year":"2011","remarks":""},{"money":"$68,181,940","country":"USA","day":"09","month":"10","year":"2011","remarks":""},{"money":"$68,131,160","country":"USA","day":"02","month":"10","year":"2011","remarks":""},{"money":"$68,038,540","country":"USA","day":"25","month":"09","year":"2011","remarks":""},{"money":"$67,893,865","country":"USA","day":"18","month":"09","year":"2011","remarks":""},{"money":"$67,701,506","country":"USA","day":"11","month":"09","year":"2011","remarks":""},{"money":"$67,506,728","country":"USA","day":"04","month":"09","year":"2011","remarks":""},{"money":"$67,029,427","country":"USA","day":"28","month":"08","year":"2011","remarks":""},{"money":"$66,626,806","country":"USA","day":"21","month":"08","year":"2011","remarks":""},{"money":"$66,094,291","country":"USA","day":"14","month":"08","year":"2011","remarks":""},{"money":"$65,426,969","country":"USA","day":"07","month":"08","year":"2011","remarks":""},{"money":"$64,625,469","country":"USA","day":"31","month":"07","year":"2011","remarks":""},{"money":"$63,500,820","country":"USA","day":"24","month":"07","year":"2011","remarks":""},{"money":"$61,473,016","country":"USA","day":"17","month":"07","year":"2011","remarks":""},{"money":"$58,051,209","country":"USA","day":"10","month":"07","year":"2011","remarks":""},{"money":"$50,124,722","country":"USA","day":"03","month":"07","year":"2011","remarks":""},{"money":"$39,293,341","country":"USA","day":"26","month":"06","year":"2011","remarks":""},{"money":"$170,700,000","country":"Worldwide","day":"04","month":"09","year":"2011","remarks":""},{"money":"$167,200,000","country":"Worldwide","day":"28","month":"08","year":"2011","remarks":""},{"money":"€2,798,664","country":"Italy","day":"11","month":"09","year":"2011","remarks":""},{"money":"€2,651,857","country":"Italy","day":"04","month":"09","year":"2011","remarks":""},{"money":"€2,228,792","country":"Italy","day":"28","month":"08","year":"2011","remarks":""}],"weekendGross":[{"money":"$20,038","country":"USA","day":"16","month":"10","year":"2011","remarks":"38 Screens"},{"money":"$36,778","country":"USA","day":"09","month":"10","year":"2011","remarks":"68 Screens"},{"money":"$69,498","country":"USA","day":"02","month":"10","year":"2011","remarks":"103 Screens"},{"money":"$109,085","country":"USA","day":"25","month":"09","year":"2011","remarks":"153 Screens"},{"money":"$161,828","country":"USA","day":"18","month":"09","year":"2011","remarks":"213 Screens"},{"money":"$162,541","country":"USA","day":"11","month":"09","year":"2011","remarks":"226 Screens"},{"money":"$304,858","country":"USA","day":"04","month":"09","year":"2011","remarks":"252 Screens"},{"money":"$261,040","country":"USA","day":"28","month":"08","year":"2011","remarks":"239 Screens"},{"money":"$302,144","country":"USA","day":"21","month":"08","year":"2011","remarks":"274 Screens"},{"money":"$386,856","country":"USA","day":"14","month":"08","year":"2011","remarks":"294 Screens"},{"money":"$407,111","country":"USA","day":"07","month":"08","year":"2011","remarks":"327 Screens"},{"money":"$467,542","country":"USA","day":"31","month":"07","year":"2011","remarks":"412 Screens"},{"money":"$935,068","country":"USA","day":"24","month":"07","year":"2011","remarks":"591 Screens"},{"money":"$1,368,355","country":"USA","day":"17","month":"07","year":"2011","remarks":"1,002 Screens"},{"money":"$3,154,435","country":"USA","day":"10","month":"07","year":"2011","remarks":"1,996 Screens"},{"money":"$5,100,000","country":"USA","day":"03","month":"07","year":"2011","remarks":"2,861 Screens"},{"money":"$10,145,662","country":"USA","day":"26","month":"06","year":"2011","remarks":"3,342 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Twentieth Century Fox Film Corporation and Dune Entertainment III LLC in all territories except Brazil, Italy, Japan, Korea and Spain; TCF Hungary Film Rights Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation and Dune Entertainment III LLC in Brazil, Italy, Japan, Korea and Spain"},"technical":{"runtime":["1 hr 34 min (94 min) (USA)"],"soundMix":["Dolby","Dolby Digital","SDDS","Datasat"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa, Zeiss Ultra Prime and Angenieux Optimo Lenses"],"laboratory":["EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["2,664 m (Portugal, 35mm)"],"negativeFormat":["Digital (S.two OB-1)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (source format)"],"printedFilmFormat":["35 mm (spherical) (Fuji Eterna-CP 3514DI)","D-Cinema"]},"rating":"6.0","metascore":"53","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG","awards":[{"award":"BMI Film & TV Awards 2012","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"Film Music","names":[{"name":"Rolfe Kent","id":"nm0448843","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie Actor","names":[{"name":"Jim Carrey","id":"nm0000120","role":null}]}]}]},{"award":"MovieGuide Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Best Film for Families","categories":[{"category":"","names":[]}]},{"titleAwardOutcome":"Nominated Grace Award","categories":[{"category":"Most Inspiring Performance in Movies","names":[{"name":"Jim Carrey","id":"nm0000120","role":null}]}]}]}],"votes":"70,967","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0022730","name":"Davis Entertainment"},{"idCompany":"co0174373","name":"Dune Entertainment"}],"keywords":{"keywords":["penguin","winter","new york city new york","snowglobe","applause","elevator","bonding","crying","ice skates","snowman","dancing","music band","champagne","soccer ball","remote control","taxi","bride","year 1981","year 1980","police officer","year 1978","video camera","security","christmas tree","reference to the pittsburgh penguins","watching a movie","baby penguin","snowball","reference to james stewart","watching tv","singing","city park","helicopter","ocean","high rise","ruse","statue of liberty","reference to howard hughes","stethoscope","hockey stick","street market","computer","skating rink","laughter","animal control","laptop computer","marital separation","badge","reference to fred astaire","christmas","reference to winston churchill","ice cube","reference to ernest hemingway","cart","assistant","trap","bridge","slide","microphone","squid","birth","sister","candle","shovel","wife","egg","id","bird","husband","gala","year 1976","ice","tears","iceberg","30 years later","1980s","1970s","mercedes benz","lincoln automobile","ford motor company","mercedes benz s klasse w221","mercedes benz 190 w201","lincoln town car stretched limousine","ford e 350","e z go","chinese food","iphone 4","reference to acer computers","hdtv","apple macbook","reference to the beatles","the beatles song","wilhelm scream","flatiron building manhattan new york city","flatiron building","reference to kareem abdul jabbar","reference to martha stewart","reference to beyonce","multiple time frames","midlife crisis","lawyer","last will and testament","cell phone camera","cell phone","noisy neighbor","lost letter","letter","inheritance","reading of will","death of parent","ham radio","old woman","reading of a last will and testament","first date","escape","overflowing bathtub","bathtub","snow","nest","hatchling","hatching an egg","antarctica","ice skating","memory","partnership","real estate","animal feces","hatching egg","dance routine","taxi ride","hockey fan","cgi","bird hatching","teenage daughter","teenage girl","reference to morgan freeman","reference to the doors","reference to charlie chaplin","reference to donald trump","new york skyline","family vacation","real estate developer","zookeeper","zoo","tavern on the green","central park zoo","manhattan new york city","family relationships","little boy","old lady","restaurant","nosey neighbor","next door neighbor","bribery","doorman","ex husband ex wife relationship","father daughter relationship","father son relationship","three word title","abbreviation in title","punctuation in title","period in title","bird in title","apostrophe in title","animal in title","death of father","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:48:52"}}