{"data":{"movies":[{"title":"Go for It!","originalTitle":"","year":"2011","releaseDate":"20110513","directors":[{"name":"Carmen Marron","id":"nm3164568"}],"writers":[{"name":"Carmen Marron","id":"nm3164568"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NTE1MjQ2NV5BMl5BanBnXkFtZTcwMDM4MTg4NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Musical"],"plot":"Carmen is a good student with a bad attitude who lives for dancing in the underground clubs of Chicago. She yearns to be 'somebody' but is afraid to believe in herself. Her immigrant Mexican, working-class parents want her to stay in school and get an education, so she attends junior college while working at a grocery store. Carmen's professor catches her performing one day in the neighborhood and challenges her to audition to a formal dance school in California. She gets into a fight with her chaotic family and runs away to her best friend Gina's place only to find out Gina's been getting beat up by her boyfriend. Meanwhile, Carmen's boyfriend, Jared wants her to commit and move in with him. Pulled apart in every direction, her dream of dancing fades. Can Carmen overcome her fears and take the biggest chance of her life, or will she succumb to her self-doubt?","simplePlot":"A student must decide between follwing her dream to become a dancer, or to follow the wishes of her family.","actors":[{"actorName":"Aimee Garcia","urlProfile":"http://www.imdb.com/name/nm0305083","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQ2NzUyN15BMl5BanBnXkFtZTcwODA3MjUwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1978","placeOfBirth":" Chicago, Illinois, USA","height":"5' 2\" (1.57 m)","bio":"A Chicago native of Mexican and Puerto Rican descent, she made her professional stage debut at the age of seven in Paul Mejia's \"Cinderella\" at The Auditorium Theatre. By the age of twelve, she was dancing 20 shows a month as \"Clara\" in \"The Nutcracker\". She joined the Young People's Company, whose alumni include John Cusack,Joan Cusack, Jeremy Piven, Lili Taylor and Aidan Quinn. Aimee graduated from Northwestern University with a triple major in economics, journalism and French. While attending Northwestern University, she was put under a two-year contract with Paramount Television after Norman Lear hand-picked her to headline his pilot-in-development, The Chavez Family, and also played the lead role of \"Diana Morales\" in \"A Chorus Line\" for Broadway choreographer Mitzi Hamilton. After Northwestern, she developed a television career in Los Angeles with Greetings from Tucson (2002), and had continued success as Andy Garcia's daughter and George Lopez's niece, \"Veronica Palmero\" on George Lopez (2002). She is currently the only Latina in her generation to be on syndicated television. In 2007, she was nominated for an \"Alma\" and \"Imagen\" Award for \"Best Supporting Actress in a Television Series\". Aimee is currently starring in Peter Berg's new high-octane medical drama, Trauma (2009), on NBC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDQ2NzUyN15BMl5BanBnXkFtZTcwODA3MjUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0305083","name":"Aimee Garcia","idIMDB":"nm0305083"},"actorId":"nm0305083","character":"Carmen Salgado","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Bandiero","urlProfile":"http://www.imdb.com/name/nm0051729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg1MzkwMTUwN15BMl5BanBnXkFtZTgwNTYwOTc1NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Born and raised in Brooklyn, New York, Al is a proud Italian-American. He started as a radio personality and has branched out to include television and films to his extensive resume. His voice can be heard on TV and radio commercials advertising products such as Revlon, Volvo, Nestea, concert dvd and more. He's a huge NY Yankee fan and devoted to fitness. He lives in Los Angeles with his wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg1MzkwMTUwN15BMl5BanBnXkFtZTgwNTYwOTc1NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0051729","name":"Al Bandiero","idIMDB":"nm0051729"},"actorId":"nm0051729","character":"Frank Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jossara Jinaro","urlProfile":"http://www.imdb.com/name/nm0423099","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzQ4ODM5Nl5BMl5BanBnXkFtZTgwNDA2MjYzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1973","placeOfBirth":" Rio de Janeiro, Brazil","bio":"Jossara Jinaro, described in the Latin media as the \"strong, smart, and sexy ultimate woman,\" was the love child of two Maoists in South America. She was born in Rio de Janeiro, Brazil and when her Mother married a Colombian diplomat she moved to Colombia. As a little girl she loved to watch movies. Her favorite was \"Gilda\" because she loved Rita Hayworth as the night club dancing dame. Jossara always dreamed of being just like her. Samba and salsa rhythms pulled Jossara onto the stage. She began dancing at the age of 5 and by the time she was 8 she did her first play. Her Step-Father was held hostage by the guerrilla and soon after he was released her family sought safety in the United States. She fully learned English at the age of 15 and soon found herself caught between a traditional Latin Family and her new American identity. She decided to leave home at the age of 16 and pursue her artistic dreams. Her first professional gig was singing and dancing at the theme park Old Indiana Fun Park where everybody recognized her as the girl playing Janet Jackson. This love for singing and dancing got her in a BFA musical theatre program that fall. She graduated top of her class and was recognized as the best actress and most likely to succeed. She got her first agent in Chicago and started working professionally right away. Chicago reviewers referred to her as \"dynamic and versatile, the ultimate chameleon,\" \"a classic beauty who fills the stage with heat, passion, and intensity.\" Jossara left Chicago to play Rene, the seductress in \"Dark Rapture,\" at the American Conservatory Theatre. An agent approached her after her opening night and asked her to come to Los Angeles. Once she arrived in LA she was soon snatched up by Columbia Tri-Star to play the beautiful and funny Virginia Bustos in the Alma nominated sitcom \"Viva Vegas.\" Since then, Jossara has fought for and been very fortunate to play strong, positive and non-traditional roles for Latinas. After making her network debut recurring on Judging Amy as Cheech Marin's smart and driven activist daughter, she got the attention of Emmy-Award winning director/producer Christopher Chulack, who cast her on ER and later opposite Simon Baker on Smith. The storyline of her role on \"Passions,\" as Rae, the strong and sexy club owner, was nominated for the 2006 GLAAD award. She went back to Colombia in 2009 to work on the Novela La Bella Ceci y El Imprudente and returned to Hollywood to work on the new series East Los High. Her biggest love is the film world. So much so that she began to produce her own projects. A budding filmmaker with critically-acclaimed shorts and a feature that was accepted into Panavision's new filmmaker's program. She's made the film festival rounds with award-winning films like Desert Road Kill which garnered her a best supporting Actress award. You may have also seen her in \"Devil's Rejects,\" a Rob Zombie Film, \"Havoc,\" with Anne Hathaway, \"TenTricks,\" with Leah Thompson, \"Fly Boys,\" with Stephen Baldwin, Oliver Stone's \"World Trade Center,\" opposite Maggie Gyllenhaal and Michael Pena, and recently in Lion Gate's urban hip-hop movie \"Go For It!\" as Loli, the queen bee of the dance floor. Jossara still loves to do live theatre. Most recently she was the female lead in \"Firehouse\" from consulting producer Academy Award winner Robert Moresco and in \"The Birthday Present\" directed by Academy Award winner Jonathan Sanger.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzQ4ODM5Nl5BMl5BanBnXkFtZTgwNDA2MjYzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0423099","name":"Jossara Jinaro","nicknames":["Jo","Jossey"],"idIMDB":"nm0423099"},"actorId":"nm0423099","character":"Loli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gina Rodriguez","urlProfile":"http://www.imdb.com/name/nm1752221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE2MTU2OF5BMl5BanBnXkFtZTgwMjI5OTk0NzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1984","placeOfBirth":" Chicago, Illinois, USA","birthName":"Virginia Ernestine Rodriguez","height":"5' 3½\" (1.61 m)","bio":"Named the \"next big thing\" and one of the \"top 35 Latinos under 35,\" by The Hollywood Reporter, Gina Rodriguez's profile has been rising steadily since her breakout performance as the titular character in FILLY BROWN during the Sundance Film Festival in 2012. Gina Rodriguez was born in Chicago, Illinois, to Puerto Rican parents Magali and Genaro Rodriguez, a boxing referee. She started performing at age seven with the salsa dance company Fantasia Juvenil. She went on to work with other companies including Los Soneros Del Swing, performing at several Salsa Congress' in Chicago, California, New York and Puerto Rico. At sixteen, Gina was one of thirteen teens to be accepted into Columbia University NY- Theatrical Collaboration taught by Richard Niles. She wrote, directed and performed original work with twelve other kids from around the world. She fell in love with New York and NYU called her name-she was accepted into the Tisch School of the Arts, and the calling was clear, theatre was it. Gina had four years of intense theatre training at both the Atlantic Theatre Company and Experimental Theatre Wing, working with David Mamet and William H. Macy, the brilliant guidance of Rosemary Quinn and other wonderful professors. Directly after graduation, Gina booked her first lead role in the feature film Tiny Dancer. After, Gina originated the role of Frida Kahlo in the world premiere of \"Casa Blue: The Last Moments in the Life of Frida Kahlo,\" at the American Stage Theatre. She continued to work in NY with multiple theatres and her work in film and TV steadily grew, including shows \"Jonny Zero,\" \"Army Wives,\" and \"Law and Order,\" in addition to several short and indie films. One in particular, Osvaldos, was accepted into festivals including ABFF, NY HBO Latino Film Fest, Chicago International Film Fest, Urbanworld. They named Gina winner of the \"Best Actor\" award at the First Run Film Festival in NY and the film aired on HBO in 2010 and was named one of the \"Five Best Shorts.\" After the years of success in NY, Gina booked a lead role in a feature film Go for It (Lionsgate) in which she received a 2011 Imagen Awards nomination. After this, Gina booked her first co-star TV role on CBS' \"Eleventh Hour.\" She went on to book series regular roles on web series \"Eden's Court\" and \"No Names;\" her first studio film Our Family Wedding with America Ferrera; and a lead in film Superchicas. Since then she has also guest starred on the TV shows: \"The Mentalist,\" \"Happy Endings\" and \"Ten Things I Hate About You.\" Next up came one of Gina's most exciting roles, to date, Filly Brown. Originally, this role had been written as a spoken word artist, an area that Gina had experience, but upon meeting the directors and producers, they informed her that they were changing the part to a rapper. After an outstanding audition, in which Gina provided an impromptu rap performance, she secured the role. Gina collaborated with music producers, E Dub and Khoolaid from Silent Giant, to come up with over five original songs for the film. Filly Brown is set to hit theatres nationally in April 2013. Up next, Gina stars as the lead in the indie dark comedy Sleeping with Fishes, written and directed by Nicole Gomez Fisher. The film focuses on Alexis Rodriguez Fish, who returns home to her family after the death of her cheating husband. Anna Ortiz will play her sister. Gina remains in the midst of an ABC studios holding deal, and will be seen in a supporting role in Snap, a reunion with her FILLY BROWN director Youssef Delara. Her indie film California Winter with Ruttina Wesley remains in the pipeline as well. Gina is a supporter of Inspira, an organization that works to spotlight Latino leaders who shape their communities. She also works with the National Hispanic Foundation for the Arts and the Boyle Heights Learning Collaborative, and won an Imagen award winner for \"Best Actress in a Feature Film: Filly Brown\". As of 2014, Gina stars in the CW television series Jane the Virgin (2014), for which she was nominated for a Golden Globe (Best Actress in a Television Series - Comedy). She lives in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE2MTU2OF5BMl5BanBnXkFtZTgwMjI5OTk0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1752221","name":"Gina Rodriguez","nicknames":["Cutz"],"idIMDB":"nm1752221"},"actorId":"nm1752221","character":"Gina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louie Alegria","urlProfile":"http://www.imdb.com/name/nm1174932","urlPhoto":"","biography":{"bio":"Louie Alegria is an actor, known for Go for It! (2011), Callback (2005) and The Bling Ring (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1174932","name":"Louie Alegria","idIMDB":"nm1174932"},"actorId":"nm1174932","character":"Pablo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Derrick Denicola","urlProfile":"http://www.imdb.com/name/nm2794399","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxNjQwNjg0Ml5BMl5BanBnXkFtZTgwMzk4MDc3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Derrick Denicola is an actor and producer, known for Go for It! (2011), Zipper (2015) and Black and Blue (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxNjQwNjg0Ml5BMl5BanBnXkFtZTgwMzk4MDc3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2794399","name":"Derrick Denicola","idIMDB":"nm2794399"},"actorId":"nm2794399","character":"Jared","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andres Perez-Molina","urlProfile":"http://www.imdb.com/name/nm2118684","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTMyNTIxOF5BMl5BanBnXkFtZTgwODQwNzQwODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Andres Perez-Molina is an actor, known for The Dark Knight Rises (2012), Go for It! (2011) and Pessimistic Mindset (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTMyNTIxOF5BMl5BanBnXkFtZTgwODQwNzQwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2118684","name":"Andres Perez-Molina","idIMDB":"nm2118684"},"actorId":"nm2118684","character":"Jesse Salgado","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gustavo Mellado","urlProfile":"http://www.imdb.com/name/nm1386329","urlPhoto":"","biography":{"bio":"Gustavo Mellado is an actor, known for Go for It! (2011), Debajo de la alfombra (2010) and Boricua (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1386329","name":"Gustavo Mellado","idIMDB":"nm1386329"},"actorId":"nm1386329","character":"Luis Salgado","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rene Rosado","urlProfile":"http://www.imdb.com/name/nm2062531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDI0MTUxN15BMl5BanBnXkFtZTgwMTAwNzI0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Rene Rosado is an actor, known for Major Crimes (2012), Star Trek Into Darkness (2013) and Sassy Pants (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDI0MTUxN15BMl5BanBnXkFtZTgwMTAwNzI0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2062531","name":"Rene Rosado","idIMDB":"nm2062531"},"actorId":"nm2062531","character":"Nino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Hernandez","urlProfile":"http://www.imdb.com/name/nm0379550","urlPhoto":"","biography":{"dateOfBirth":"26 January 1968","placeOfBirth":" Chicago, Illinois, USA","height":"5' 10½\" (1.79 m)","bio":"David Hernandez was born and raised in the west side of Chicago,in the neighborhoods of Logan square/Bucktown and Humboldt Park. David Hernandez has proven over his lifetime to be a true Renaissance man. David's family and friends thought that David would be perfect for television and film since he was the family entertainer along with his sister Deborah Hernandez. His career began almost like a written storyline. David was discovered on the streets of Chicago by by Sylvia Giannini and Jack Ginay of NBC Chicago in 1984 while filming a Docu-drama named \"Still A Stranger\" at Augusta and Rockwell in front of his Grandmothers Video game room business where David was interviewed. NBC Producer and director were so impressed with David, his captivating personality and animated ways, he was asked to audition for a national role in \"Still A Stranger\" A docu-drama whose intent was to introduce the Hispanic people and culture to the rest of the world, by showing real world trials, triumphs and defeats faced by hispanics. David Hernandez portrayed the son of the family as Carlos. This program was his first time ever on television and he had a national role! David was a natural. Without any previous experience or training David held his own alongside seasoned name actors. Yes, he did audition against the more experienced actors of the time in his age range in Chicago, his natural talent proved to be right on the mark. It has been said that David Hernandez stole the roles' prior to any audition and that the audition was simply a formality at the time. There were few if any child actors in the industry with his natural abilities. He was then hunted down by a talent Agent by the name of Myrna Salazar of Salazar & Navas Talent agency. She was at the casting audition for Night of Courage and read with David as his mother in the story. She offered him representation at the N.B.C. studios and David Flat out declined her offer and refused to share any contact information. The locals in the Humboldt park neighborhood recall, a lady was driving around in a Mercedes-Benz and wearing a fur coat. She was looking for David Hernandez. Word Spread fast and David received the information by the hand of his grandmother (Maria Mendez). She handed David Mrs. Salazars' business card. At the time David was not living at home with his parents he was only 14 years old. David contacted the agent and at that young age, traveled on his own by public transportation to see the talent agent who was located on Rush street in Chicago at the time. David handled his business affairs without any adult supervision. David began landing more and more work and was required to join the actors Union SAG, AFTRA and Actors Equity for live theater. On or around 1986, he was offered a contract (an exclusive contract) with NBC in which David was ready and able to accept. His then agent somehow managed to botch the negotiations and blew the contract all together. This was his first big break network opportunity that would have taken him into the sitcom world. His Agent let him down and stated that the contract offered was not acceptable and he was better off not accepting it. He trusted her recommendation and later felt regret when he discovered the terms of the contract. This was an offer of a lifetime. Gone like the wind. David had no idea that he could have obtained other representation and avoided work by avoiding calls from his agent. This was detrimental to his career. Then life got in the way and David left the industry for many years. Years later in his mid twenties, he owned a Sea Food Restaurant in the west side of Chicago for 9 years. During this time he avoided the movie industry all together. Then by chance a customer walked into his restaurant and recognized him. That same customer was also in the movie industry and spread the word that the 1980's acting dynamo was now all grown up and owned this restaurant. The industry came knocking on his door once again, inviting David to audition for the film \"original Gangstas\" David was not very interested in acting however. It took some persuading, fortunately he finally agreed to get involved. David now admits that one you get bit by the acting bug it is difficult ignore. However, David will not accept non-speaking roles and has been fortunate to always have his lines opposite big name stars. The movie industry in Chicago was lagging for many years and the main issue now is that any movies that come into town are usually pre-cast and the roles of interest are usually taken. Therefore, David has not participated in many auditions. He refuses to clutter his resume with what he considers to be non-growth credits. \"It is either of some significance and shows your ability or it's just extra work\". David Hernandez on or around 2001 took full control of Coqui-tv on channel 25 on Comcast Network. Producing, directing and even editing the Bi-lingual Chicago cable television program in 2005 when he realized that the higher ups were not willing to expand or further improve programming. He had obtained experience in that field when he worked at Fox Television in Wichita Kansas (KSAS FOX 24) in the mid 1990's. He began as a switching engineer and moved into production at a later time back in Chicago. Today David Hernandez does not pursue heavily the acting opportunities. David has always allowed for the opportunities to come to him. He has full faith that whatever roles are meant for him, \"the good Lord will bring to his door\" . This is unorthodox as many actors spend countless hours seeking their next gig and networking in the hopes of landing that big role. Interestingly enough David Hernandez has has always had the blessing of having only speaking roles, usually opposite the lead actors in the films. On his resume there is a unwavering comment as referred to before, clearly and conspicuously stating that David will not accept any extra work (non-speaking role). \"Not that there is anything wrong with being an extra\" Mr. Hernandez remarked. However, David believes that this type of work does not represent his caliber of ability. Every Acting job he has landed is a speaking role, outside of the movies where the speaking scenes were deleted and only his image was used. Unfortunately this happened in the movie the promotion, Nothing Like the holidays and most recently The Chicago Fire - Hell of a ride episode. He did try extra work once. He was asked by his industry friend Sue Kanutsen an extras casting director in the early 90's to be in the film \"Code of Silence\" his experience there was not what he desired and has not worked as an extra ever since. He was asked if he will act again and his response was \" Talk to my agent and I don't do extra work\". He smiled and assured that he is open to work as long as it is a meaningful role. David Hernandez is now the V.P. in charge of production in an up and coming television networknamed \"VSPANN\" a broadcast network dedicated to Veterans and the communities they live in. The last reported project was that of a role in the Chicago Series \" Chicago Fire\" as Acevedo. Prior to that was \"Mob Doctor\" in which David Hernandez portrays the gang leader Umberto Cruz of the Latin Kings. David admitted that he has never been in a gang and the thought of portraying a member of a real gang was possibly dangerous. However, the opportunity to work side by side with William Forsythe, Jennifer Beals, Mike Starr and with a few lines was welcome. David Hernandez grew up around many gang members. There was pressure to join, yet David never did, saying \" He was more afraid of his father than any gang member\". He was warned by his father Felix Antonio Hernandez that if he ever caught wind that David was involved in a gang that would be the end of David. Today David has various scars that he states are his war wounds. Obtained in various situations in the avoidance of joining gangs and in situations where he was accused of being a gang member when he was not. He learned how to stand up for himself in the tough Chicago streets and today is a loving husband and a father and is eternally grateful to his now deceased father for keeping him on the straight and narrow. In the January 1989 issue of T.V. Guide with \"The 1989 Network News All-Star Team,\" featuring Tom Brokaw, Peter Jennings, Andrea Mitchell, and Leslie Stahl on the cover Inside was a written interview that was had with one of the supporting role actors \"Tom Hodges\" of the movie Night of Courage\". David was not interviewed. Yet David's Name came up, he was one of the lead actors of that Monday night movie of the week. Tom Hodges, stated that during the shoot in Humboldt park one night the police had advised the movie producers to shut down for the night that a gang war was in progress and would take place in that very park. David Hernandez stepped up and said that he would talk to the heads of the gangs named, and he did. He confronted them with Hispanic pride and expressing his views on the importance of respect for other Hispanics. He insisted that this film was important and that they consider his Latin Blood plea. Incredibly a truce was struck for the night. The entire night the cast and crew were able to work without incident and the gangs from each side of the park intently watching the film being made.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0379550","name":"David Hernandez","nicknames":["One Take Hernandez"],"idIMDB":"nm0379550"},"actorId":"nm0379550","character":"Cuko","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liliana Montenegro","urlProfile":"http://www.imdb.com/name/nm2685881","urlPhoto":"","biography":{"bio":"Liliana Montenegro is an actress, known for Coyotes (2011), Go for It! (2011) and Heavenly Father (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2685881","name":"Liliana Montenegro","idIMDB":"nm2685881"},"actorId":"nm2685881","character":"Irene Salgado","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Safia Hannin","urlProfile":"http://www.imdb.com/name/nm3164240","urlPhoto":"","biography":{"bio":"Safia Hannin is an actress, known for Go for It! (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3164240","name":"Safia Hannin","idIMDB":"nm3164240"},"actorId":"nm3164240","character":"Cecy Salgado","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peggy Goss","urlProfile":"http://www.imdb.com/name/nm1007108","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NDgzNjgwOF5BMl5BanBnXkFtZTYwOTkzOTEy._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Peggy Goss is an actress and producer, known for Redemption Maddie (2007), Norma Grace (2008) and A Dream Like You (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NDgzNjgwOF5BMl5BanBnXkFtZTYwOTkzOTEy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1007108","name":"Peggy Goss","idIMDB":"nm1007108"},"actorId":"nm1007108","character":"Jared's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Yabut","urlProfile":"http://www.imdb.com/name/nm1717425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjExMjM1NF5BMl5BanBnXkFtZTcwOTcyNzEzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1976","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Originally from Bucks County, Pa., Daniel Yabut has been a regular on Chicago and regional stages since graduating from the University of Minnesota and Duquesne University in Pittsburgh. He made his professional debut in \"The Magic Flute\" at the Lyric Opera of Chicago, and has since performed in dozens of dramas, Shakespeare plays, musicals, and commercials. After appearing as Dromio of Syracuse in \"The Comedy of Errors\" at the Door Shakespeare Festival in Wisconsin, he made his feature film debut as the loud-mouthed Roy in Roll Bounce (2005). When he's not acting, Daniel enjoys basketball, rollerskating, football, movies and theatre. He follows the Chicago, Philly and Atlanta sports teams and plays a mean game of poker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjExMjM1NF5BMl5BanBnXkFtZTcwOTcyNzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1717425","name":"Daniel Yabut","idIMDB":"nm1717425"},"actorId":"nm1717425","character":"Danny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Armacost","urlProfile":"http://www.imdb.com/name/nm0035234","urlPhoto":"","biography":{"bio":"Brad Armacost is an actor, known for Red Faction (2001), Barbershop 2: Back in Business (2004) and Eight Men Out (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0035234","name":"Brad Armacost","idIMDB":"nm0035234"},"actorId":"nm0035234","character":"Jared's Father","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1307926","urlIMDB":"http://www.imdb.com/title/tt1307926","business":{"budget":{"money":"$2,450,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$119,714","country":"USA","day":"15","month":"05","year":"2011","remarks":"218 Screens"}],"gross":[{"money":"$172,687","country":"USA","day":"22","month":"05","year":"2011","remarks":""},{"money":"$119,714","country":"USA","day":"15","month":"05","year":"2011","remarks":""}],"weekendGross":[{"money":"$14,435","country":"USA","day":"22","month":"05","year":"2011","remarks":"64 Screens"},{"money":"$119,714","country":"USA","day":"15","month":"05","year":"2011","remarks":"218 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Red One Camera"],"laboratory":null,"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (4K) (source format)"],"printedFilmFormat":null},"rating":"3.9","metascore":"44","filmingLocations":[],"rated":"PG-13","awards":[{"award":"Chicago International Film Festival 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Gold Hugo","categories":[{"category":"New Directors Competition","names":[{"name":"Carmen Marron","id":"nm3164568","role":"director"}]}]}]},{"award":"Imagen Foundation Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Imagen Award","categories":[{"category":"Best Supporting Actress/Feature Film","names":[{"name":"Gina Rodriguez","id":"nm1752221","role":null}]}]}]}],"votes":"1,037","type":"Movie","companyCreditsSimple":[{"idCompany":"co0250071","name":"Go For It!"},{"idCompany":"co0396492","name":"Sparkhope Productions"}],"keywords":{"keywords":["imperative in title","three word title","punctuation in title","exclamation point in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:02:15"}}