{"data":{"movies":[{"title":"Twelve","originalTitle":"","year":"2010","releaseDate":"20100806","directors":[{"name":"Joel Schumacher","id":"nm0001708"}],"writers":[{"name":"Jordan Melamed","id":"nm0577332"},{"name":"Nick McDonell","id":"nm3393347"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTgwMjc4MV5BMl5BanBnXkFtZTcwMzA3ODk1Mw@@._V1.jpg","countries":["USA","France"],"languages":["English"],"genres":["Action","Crime","Drama","Thriller"],"plot":"A young drug dealer watches as his high-rolling life is dismantled in the wake of his cousin's murder, which sees his best friend arrested for the crime.","simplePlot":"A young drug dealer watches as his high-rolling life is dismantled in the wake of his cousin's murder, which sees his best friend arrested for the crime.","actors":[{"actorName":"Chace Crawford","urlProfile":"http://www.imdb.com/name/nm2003700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4Nzc3Njc0N15BMl5BanBnXkFtZTgwMjE0MDEzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1985","placeOfBirth":" Lubbock, Texas, USA","birthName":"Christopher Chace Crawford","height":"5' 10\" (1.78 m)","bio":"Christopher Chace Crawford was born in Lubbock, Texas, the son of Dana (Plott), a teacher, and Chris Wayne Crawford, a dermatologist. He grew up in Plano, Texas, and has a younger sister, Candice Crawford Romo, who studied broadcast journalism and won the Miss Missouri USA title in 2008. Chace played football and golf in high school, and is a talented artist. He graduated from Trinity Christian Academy in 2003. Although he worked as a model in Dallas, he never pursued acting. He moved to Malibu, California, to attend Pepperdine University after high school where he was a member of the Sigma Nu fraternity. He struggled to identify a career path, vacillating between advertising, business and communications majors. Midway through his second year, his mother encouraged him to pursue acting. He credits her for initiating this move. She stated that \"it was a practical move,\" based on a career aptitude test he had taken in high school, which revealed he was best suited for a career in the performing arts. He was signed by the first talent agent that interviewed him and then committed full-time to acting studies. In 2006, Chace appeared in Lifetime's television movie Rendez-moi mon fils! (2006), where he plays the son of Gabrielle Anwar's character. That same year, he starred alongside Steven Strait, Taylor Kitsch, Sebastian Stan and Toby Hemingway in the horror/thriller movie, The Covenant (2006). The year 2007 was a big break for Chace. He became one of the leads in CW's drama, Gossip Girl (2007). Among his cast members on the show are Penn Badgley, Leighton Meester & Ed Westwick. In the year 2008, Chace was seen in the movie Loaded (2008), opposite Jesse Metcalfe. He also got involved in the independent movie, The Haunting of Molly Hartley (2008) with Haley Bennett. His other guest appearance includes a stint on the Family Guy (1999) episode Family Guy: The Former Life of Brian (2008). Other than being involved in more acting projects, the year 2008 proved to be an even better year for Chace as he won the Choice TV Breakout Star Male at the Teen Choice Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4Nzc3Njc0N15BMl5BanBnXkFtZTgwMjE0MDEzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2003700","name":"Chace Crawford","nicknames":["Chace"],"idIMDB":"nm2003700"},"actorId":"nm2003700","character":"White Mike","urlCharacter":"http://www.imdb.com/character/ch0242352","main":true},{"actorName":"Rory Culkin","urlProfile":"http://www.imdb.com/name/nm0191412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMzk3MzI4MF5BMl5BanBnXkFtZTgwNTc2ODI2MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1989","placeOfBirth":" New York City, New York, USA","birthName":"Rory Hugh Culkin","height":"5' 6\" (1.68 m)","bio":"Rory Culkin was born in New York City, New York. He is the youngest son of Christopher Culkin, a former stage and child actor, and Patricia Brentrup. He is the brother of Shane Culkin, Dakota Culkin, Macaulay Culkin, Kieran Culkin, Quinn Culkin, and Christian Culkin. His mother, who is from North Dakota, is of German and Norwegian descent. His father, from Manhattan, has Irish, German, English, Swiss-German, and French ancestry. He grew up in New York along with his mother (his parents split up in 1995) and the rest of his siblings. He started his career by playing younger versions of his brothers in their films, such as Richie Rich and Igby Goes Down. He landed his first real role in 2000 in the Kenneth Lonergan film You Can Count on Me. Rory Culkin is best known for his work in the 2002 M. Knight Shyamalan film Signs but has also appeared in a number of independent films like Mean Creek, The Chumscrubber, Down in the Valley, The Night Listener, and Lymelife. He has also appeared in some television shows such as The Twilight Zone and Law & Order: Special Victims Unit.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMzk3MzI4MF5BMl5BanBnXkFtZTgwNTc2ODI2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191412","name":"Rory Culkin","idIMDB":"nm0191412"},"actorId":"nm0191412","character":"Chris","urlCharacter":"http://www.imdb.com/character/ch0341844","main":true},{"actorName":"Philip Ettinger","urlProfile":"http://www.imdb.com/name/nm3464684","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMzOTQ1MDQ4Nl5BMl5BanBnXkFtZTcwNTkzNjg0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Philip Ettinger is an actor and producer, known for Compliance (2012), Twelve (2010) and Indignation (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMzOTQ1MDQ4Nl5BMl5BanBnXkFtZTcwNTkzNjg0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3464684","name":"Philip Ettinger","idIMDB":"nm3464684"},"actorId":"nm3464684","character":"Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Esti Ginzburg","urlProfile":"http://www.imdb.com/name/nm3355987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg1NjQ1NjgzNF5BMl5BanBnXkFtZTcwNDY4MDg1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1990","placeOfBirth":" Tel Aviv, Israel","height":"5' 8\" (1.73 m)","bio":"Esti Ginzburg was born on March 6, 1990 in Tel Aviv, Israel. She is an actress, known for Rising Star (2013), Exposure: Sports Illustrated Swimsuit 2011 (2011) and Beard at Work (2011). She has been married to Adi Keizman since June 9, 2012. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg1NjQ1NjgzNF5BMl5BanBnXkFtZTcwNDY4MDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3355987","name":"Esti Ginzburg","idIMDB":"nm3355987"},"actorId":"nm3355987","character":"Sara Ludlow","urlCharacter":"http://www.imdb.com/character/ch0341839","main":true},{"actorName":"50 Cent","urlProfile":"http://www.imdb.com/name/nm1265067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0NTc2NTAxNV5BMl5BanBnXkFtZTgwMjYwMDMzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1975","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Curtis James Jackson III","height":"6' (1.83 m)","bio":"Born in the South Jamaica section of Queens, Curtis \"50 Cent\" Jackson has lived in New York City all his life. He was raised by his grandparents after his father ran out and his mother was shot when he was only eight. Growing up, the Queens rapper originally wanted to be a heavyweight boxer, but eventually fell back on rapping. DJs had taken it upon themselves to release two Best of 50 Cent mix CDs, before he had even signed to a major label. 50 Cent hit the scene with \"How To Rob\" and he's been on a rampage ever since dealing with bootleggers, label back stabbing and other platinum selling artists trying to get at him physically. In 1999 his album Power of the Dollar, was heavily bootlegged and Trackmasters/Columbia never released it. Supposedly, Trackmasters weren't comfortable with him being caught up in the streets and getting shot three days before filming the video for \"Thug Love,\" (with Destiny's Child) -- his first single. 50 was shot three times that night, two shots hitting him in the head, the bullet that struck his face he carries as a reminder of what happened. That event led to the fall out with Columbia and negotiating his release from their grasps. He still showed love and rhymed over a Trackmasters produced remix of \"I'm Gonna Be Alright\" on J-Lo's latest album, but rivals at Murder Inc. had 50 cut from the track which could have launched the rapper. This all changed in one night when Eminem said on a radio show that \"50 Cent is definitely my favorite rapper right now, he's the only one keeping it real.\" The very next day a bidding war started on 50, ending when 50 signed to Eminem's very own label Shady/Aftermath. 50 Cent's fame has exploded, being produced by Dr. Dre and Eminem and finally making his debut album \"Get rich or Die Tryin'.\" 50 has full access and advantage of the streets through mix-tapes; that's his forum because he controls it. 50 Cent is the most anticipated artist of 2003. It's well deserved because he's \"been patiently waiting.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0NTc2NTAxNV5BMl5BanBnXkFtZTgwMjYwMDMzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1265067","name":"50 Cent","nicknames":["Interscope","Fiddy","Boo Boo"],"idIMDB":"nm1265067"},"actorId":"nm1265067","character":"Lionel","urlCharacter":"http://www.imdb.com/character/ch0242353","main":true},{"actorName":"Zoë Kravitz","urlProfile":"http://www.imdb.com/name/nm2368789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk0MjE4NDYwOF5BMl5BanBnXkFtZTgwNjc5MzU1MDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1988","placeOfBirth":" Los Angeles, California, USA","birthName":"Zoë Isabella Kravitz","height":"5' 1\" (1.55 m)","bio":"Zoe Isabella Kravitz, the daughter of singer/actor Lenny Kravitz and actress Lisa Bonet, was born on December 1, 1988 in Los Angeles, California. She is of half African-American (from her father's mother and her mother's father) and half Ashkenazi Jewish (from her father's father and her mother's mother) descent. Zoe's love and interest in acting developed from classes she began taking while in school. Wasting little time, Zoe started working on two films during her senior year in high school; No Reservations (2007), directed by Scott Hicks, where she worked alongside Catherine Zeta-Jones and Aaron Eckhart, and The Brave One (2007), directed by Neil Jordan, starring Jodie Foster and Terrence Howard. In 2008, Zoe completed work on Assassination of a High School President (2008), alongside Bruce Willis. She worked with Susan Sarandon and Pierce Brosnan on The Greatest (2009), which debuted at Sundance. Zoe has just wrapped on the latest Joel Schumacher film, Twelve (2010), co-starring Kiefer Sutherland, 50 Cent, Chace Crawford and Emma Roberts, which will be released in 2010. She recently wrapped shooting in New York on her first lead roles in the films, Beware the Gonzo (2010), opposite Amy Sedaris, Campbell Scott and Ezra Miller, and Yelling to the Sky (2011), the story of \"Sweetness O'Hara\", who has a sometimes-absent father and a present but mentally unstable mother. Outside of her film endeavors, Kravitz has kept busy with various projects. She served as lead singer and co-writer with her band, \"Elevator Fight\". Kravitz is also the new face of Vera Wang's \"Princess\" perfume. The campaign launches in November 2009. Zoe starred in 2008 in Jay Z music video for his single, \"I Know\", off his \"American Gangster\" album. She was also featured with Jessica Alba, Ryan Phillippe, Tyrese Gibson, George Lopez, John Leguizamo and several other celebrities in Will.i.am's \"We Are the Ones\" video during Barack Obama campaign. Zoe resides in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk0MjE4NDYwOF5BMl5BanBnXkFtZTgwNjc5MzU1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2368789","name":"Zoë Kravitz","idIMDB":"nm2368789"},"actorId":"nm2368789","character":"Gabby","urlCharacter":"http://www.imdb.com/character/ch0341838","main":true},{"actorName":"Billy Magnussen","urlProfile":"http://www.imdb.com/name/nm2915105","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNzc0MjMxN15BMl5BanBnXkFtZTgwMDM2NTY5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1985","placeOfBirth":"","height":"5' 11\" (1.8 m)","bio":"Billy Magnussen was born on April 20, 1985. He is an actor, known for Bridge of Spies (2015), Into the Woods (2014) and The Big Short (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNzc0MjMxN15BMl5BanBnXkFtZTgwMDM2NTY5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2915105","name":"Billy Magnussen","idIMDB":"nm2915105"},"actorId":"nm2915105","character":"Claude","urlCharacter":"http://www.imdb.com/character/ch0341851","main":true},{"actorName":"Emily Meade","urlProfile":"http://www.imdb.com/name/nm2007030","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTY0YTc1NzktNTYzYi00MDI1LWE5MGUtYjY3NTUyNzdhM2M1XkEyXkFqcGdeQXVyNzQwODg0MjY@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1989","placeOfBirth":" New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"Emily Meade was born on January 10, 1989 in New York City, New York, USA. She is an actress, known for Nerve (2016), The Leftovers (2014) and Money Monster (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTY0YTc1NzktNTYzYi00MDI1LWE5MGUtYjY3NTUyNzdhM2M1XkEyXkFqcGdeQXVyNzQwODg0MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2007030","name":"Emily Meade","idIMDB":"nm2007030"},"actorId":"nm2007030","character":"Jessica Brayson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Roberts","urlProfile":"http://www.imdb.com/name/nm0731075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjhmZTE0OTctYjUzMC00NGY0LWFhMDQtZmJiN2Y2Yzk4ODY4L2ltYWdlXkEyXkFqcGdeQXVyMTIxMTA0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1991","placeOfBirth":" Rhinebeck, New York, USA","birthName":"Emma Rose Roberts","height":"5' 2\" (1.57 m)","bio":"Emma Roberts is the daughter of Oscar-nominated actor Eric Roberts, and the niece of Oscar-winner Julia Roberts. She was born in Rhinebeck, New York. Emma was a baby when her parents separated, and she grew up living with her mother, Kelly Cunningham. She was educated at Archer School for Girls in Los Angeles, California. As a child she spent some time on the sets of movies with her aunt Julia. This helped Emma decide that she wanted to follow a career in acting. Her first movie role came in Blow (2001), where she played the daughter of Johnny Depp's character. Various small parts followed, until she was cast in the lead role of Addie Singer in Nickelodeon's \"Unfabulous\" (2004). Her performance lead to many award nominations as well as a foray into the music industry, including the release of an album, \"Unfabulous and More\". More roles followed in various projects, including the eponymous heroine in Nancy Drew (2007), Hotel for Dogs (2009), 4.3.2.1. (2010) and Scream 4 (2011). In 2011, Emma began attending Sarah Lawrence College in New York, studying English Literature.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjhmZTE0OTctYjUzMC00NGY0LWFhMDQtZmJiN2Y2Yzk4ODY4L2ltYWdlXkEyXkFqcGdeQXVyMTIxMTA0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0731075","name":"Emma Roberts","nicknames":["Em"],"idIMDB":"nm0731075"},"actorId":"nm0731075","character":"Molly","urlCharacter":"http://www.imdb.com/character/ch0171021","main":true},{"actorName":"Ellen Barkin","urlProfile":"http://www.imdb.com/name/nm0000289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTk3MTgxNl5BMl5BanBnXkFtZTcwMTMxNDkxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1954","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Ellen Rona Barkin","height":"5' 6\" (1.68 m)","bio":"Offbeat, unconventionally pretty, and utterly mesmerizing, Ellen Barkin was born in 1954 in the Bronx, New York, to Evelyn (Rozin), a hospital administrator, and Sol Barkin, a chemical salesman. Her parents were both from Russian Jewish families. Raised in the South Bronx and Queens, New York area, she wanted to be an actress as early as her teens and was eventually accepted into Manhattan's High School of the Performing Arts. Barkin then attended Hunter College and received her degree after double majoring in history and drama. At one point she wanted to teach ancient history, but instead turned her thoughts back to her first love: acting. Barkin then continued her education at New York's Actor's Studio. Fearful of the auditioning process, she studied acting for seven years before finally landing her first audition. While continuing her studies, she worked as a waitress at the avant-garde Ocean Club. Performing off-Broadway in such plays \"Shout Across the River\" (1979), \"Extremities\" (1983), \"Fool for Love\" (1984) and \"Eden Court\" (1985), she was applauded across the board for her first film lead in Diner (1982) opposite Mickey Rourke and Daniel Stern, and pursued sexy tough-cookie status thereafter with such quirky roles in The Big Easy (1986) starring Dennis Quaid and Siesta (1987) with Irish actor Gabriel Byrne, whom she married in 1987 and separated from in 1993 after producing a son and daughter. She and Byrne divorced in 1999. With trademark squinting eyes and slightly off-kilter facial features, Barkin continued the fascination of her seamy/steamy girl-from-the-wrong-side-of-the-tracks status most notably opposite Al Pacino in the thriller Sea of Love (1989). In addition, she was well cast as Robert De Niro's abused wife in This Boy's Life (1993), and portrayed \"Calamity Jane\" in Wild Bill (1995) with earnest. Other impressionable offbeat projects included roles in Fear and Loathing in Las Vegas (1998), Belles à mourir (1999) and Mercy (2000). On TV, she was well-cast in the mini-movie Clinton and Nadine (1988) and won an Emmy award for her gripping performance in Before Women Had Wings (1997) opposite Oprah Winfrey as another abused wife who, in this case, turns her violent anger on her own daughters. In 2000, Barkin married billionaire Ronald O. Perelman, eleven years her senior and chairman of the Revlon company, and put her career relatively on hold, appearing sporadically in edgy films like She Hate Me (2004) and Palindromes (2004). Barkin and Perelman went through an acrimonious divorce in 2006. Just prior to her divorce in late 2005, Barkin ventured into independent film production with Applehead Pictures, a company she set up with her brother George Barkin, who is a scriptwriter and former editor-in-chief of National Lampoon and High Times, and former Independent Film Channel executive Caroline Kaplan. In her first major acting appearance since her divorce from Perelman, Barkin co-starred in Ocean's Thirteen (2007) with George Clooney, Matt Damon, Brad Pitt and former co-star Pacino. She followed up Ocean's with a supporting role in Antoine Fuqua's Brooklyn's Finest (2009), Happy Tears (2009) with Parker Posey and Demi Moore, and Twelve (2010). Recently, Barkin has produced features, including Letters to Juliet (2010) and Another Happy Day (2011) (she also starred in the latter project). On the small screen, she appeared in an episode of Modern Family (2009) and her new NBC show, The New Normal (2012), got a sneak peek during the Olympics. She lives with her two teenage children in Manhattan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTk3MTgxNl5BMl5BanBnXkFtZTcwMTMxNDkxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000289","name":"Ellen Barkin","idIMDB":"nm0000289"},"actorId":"nm0000289","character":"Jessica's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kiefer Sutherland","urlProfile":"http://www.imdb.com/name/nm0000662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MjI5ODI3Nl5BMl5BanBnXkFtZTcwNTQzOTM0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1966","placeOfBirth":" Paddington, London, England, UK","birthName":"Kiefer William Frederick Dempsey George Rufus Sutherland","height":"5' 8½\" (1.74 m)","bio":"Kiefer Sutherland was born in London, England, UK, to Canadian actors Shirley Douglas and Donald Sutherland, who moved to California shortly after his birth. His maternal grandfather, Tommy Douglas, was a Scottish-born Canadian politician who was a Premier of Saskatchewan for over 17 years and led the national NDP party for almost 10. Kiefer got his first film role in the comedy drama Max Dugan Returns (1983). Sutherland's first major role was in the Canadian drama Un printemps sous la neige (1984), which earned Sutherland and director Daniel Petrie, Genie award nominations for best actor and best director, respectively. Following his success in The Bay Boy, Sutherland eventually moved to Los Angeles and landed television appearances in \"The Mission\", an episode of Amazing Stories (1985) and in the telefilm Trapped in Silence (1986) with Marsha Mason. In 1992, Sutherland starred opposite Ray Liotta and Forest Whitaker in Article 99 (1992) and in the military drama A Few Good Men (1992) also starring Jack Nicholson and Tom Cruise. Later, in 1994, he starred with Jeff Bridges and Nancy Travis in the American version of The Vanishing (1993) for 20th Century Fox. In 1997, he co-starred with William Hurt and Rufus Sewell in Dark City (1998), directed by Alex Proyas, which was a special presentation at the Cannes Film Festival. Sutherland also added his second directorial credit and starred in Truth or Consequences, N.M. (1997) alongside Kevin Pollak, Mykelti Williamson, Rod Steiger and Martin Sheen. He stars in the Fox drama series 24 (2001) as Jack Bauer for which he has earned a Golden Globe for Best Actor in a Drama Series. Most recently, he has been seen in the movie Phone Booth (2002) as a man who calls up someone at a phone booth and threatens to kill them if they hang up.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MjI5ODI3Nl5BMl5BanBnXkFtZTcwNTQzOTM0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000662","name":"Kiefer Sutherland","idIMDB":"nm0000662"},"actorId":"nm0000662","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ako","urlProfile":"http://www.imdb.com/name/nm0015488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwOTMwNDE5OF5BMl5BanBnXkFtZTcwMTk1MDA5Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Ako is an actress, known for I Origins (2014), No Reservations (2007) and Snow Falling on Cedars (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwOTMwNDE5OF5BMl5BanBnXkFtZTcwMTk1MDA5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015488","name":"Ako","idIMDB":"nm0015488"},"actorId":"nm0015488","character":"Mrs. Fong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dionne Audain","urlProfile":"http://www.imdb.com/name/nm1916071","urlPhoto":"","biography":{"birthName":"Dionne E. Audain","height":"5' 8\" (1.73 m)","bio":"Dionne Audain is an emerging artist who began her career in the DC Metro area known for her passion, drive and dedication. Having a BA in English (Literature & Rhetoric emphasis) and a Master's of Public Administration (MPA) from the number one program in the nation - The Maxwell School at Syracuse University, Ms. Audain's former life included consulting, budgeting and managing change in large government and private organizations averaging 70 hours a week. After realizing that her drive and talent also had artistic inclinations, Ms. Audain set her sights on acting. Having \"performed\" since the age of two in pageants, dance troupes, story telling competitions, original poems and of course plays - she was a natural and force waiting to be unleashed. During the last four years, under the tutelage of great teachers, coaches and training programs, she has accomplished an impressive resume with local, regional and national credits in theater, film, television, voice-overs and print.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1916071","name":"Dionne Audain","nicknames":["Dee Dee"],"idIMDB":"nm1916071"},"actorId":"nm1916071","character":"Nana's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregg Bello","urlProfile":"http://www.imdb.com/name/nm0069131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjkzNDQxOV5BMl5BanBnXkFtZTgwMzI5NzM2MzE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"bio":"Gregg Bello is an actor and producer, known for The Wrestler (2008), Requiem for a Dream (2000) and Noah (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjkzNDQxOV5BMl5BanBnXkFtZTgwMzI5NzM2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0069131","name":"Gregg Bello","idIMDB":"nm0069131"},"actorId":"nm0069131","character":"Detective Keminski","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maxx Brawer","urlProfile":"http://www.imdb.com/name/nm1682293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Nzc2NDQ0MV5BMl5BanBnXkFtZTgwMzcwMzE1OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1987","placeOfBirth":" New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Maxx Brawer was born on November 15, 1987 in New York City, New York, USA. He is an actor, known for Twelve (2010), My Last Day Without You (2011) and Julian Got the Part (2018).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Nzc2NDQ0MV5BMl5BanBnXkFtZTgwMzcwMzE1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1682293","name":"Maxx Brawer","idIMDB":"nm1682293"},"actorId":"nm1682293","character":"Andrew","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1407084","urlIMDB":"http://www.imdb.com/title/tt1407084","business":{"budget":null,"openingWeekend":[{"money":"$110,238","country":"USA","day":"08","month":"08","year":"2010","remarks":"231 Screens"}],"gross":[{"money":"$181,591","country":"USA","day":"15","month":"08","year":"2010","remarks":""},{"money":"$110,238","country":"USA","day":"08","month":"08","year":"2010","remarks":""}],"weekendGross":[{"money":"$3,437","country":"USA","day":"15","month":"08","year":"2010","remarks":"12 Screens"},{"money":"$110,238","country":"USA","day":"08","month":"08","year":"2010","remarks":"231 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"04","year":"2009","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min) (USA)","1 hr 35 min (95 min) (Germany)"],"soundMix":["Dolby Digital","Dolby SR","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Red One Camera"],"laboratory":["Technicolor, New York (NY), USA (digital intermediate)"],"filmLength":["2,589.35 m (6 reels)"],"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (4K) (source format)"],"printedFilmFormat":["35 mm (spherical) (Fuji Eterna-CP 3513DI)","D-Cinema"]},"rating":"5.7","metascore":"22","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[{"award":"Teen Choice Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Summer Movie Star: Female","names":[{"name":"Emma Roberts","id":"nm0731075","role":null}]}]}]}],"votes":"11,010","type":"Movie","companyCreditsSimple":[{"idCompany":"co0178269","name":"Gaumont"},{"idCompany":"co0098047","name":"Hannover House"},{"idCompany":"co0023815","name":"Radar Pictures"}],"keywords":{"keywords":["murder","generation y","coitus","strained relationship","missionary sex position","sexual favor","night","undressing","male nudity","woman undressing for a man","sword","unhappiness","blowjob offer","sexy dress","death notification","death","drug cocktail","masturbating in a shower","male masturbation","lack of money","porn dvd","porn video","interrupted sex","caught having sex","female nudity","solicitation of prostitution","prostitution","having sex on drugs","sex on bed","sex scene","new york city","grief","cancer","father son relationship","killed on birthday","suicide by cop","wilhelm scream","shooting spree","shot in the back","shot in the shoulder","shot in the eye","shot in the leg","fellatio","nude with a gun","interracial sex","loss of virginity","virgin","church","underage drinking","death of cousin","birthday party","talking to the camera","mother daughter relationship","police detective","police station","teddy bear","male rear nudity","character says i love you","webcam","hospital","bare chested male","times square manhattan new york city","reference to john f. kennedy","reference to abraham lincoln","premature ejaculation","katana sword","marijuana joint","fake id","brother brother relationship","young version of character","childhood friend","male model","shot to death","shot in the head","shot in the chest","character repeating someone else's dialogue","drug addict","party","high school dropout","ensemble cast","flashback","pistol","cell phone","teen drug use","marijuana","harlem manhattan new york city","drug dealer","rich kid","troubled youth","voice over narration","teenager","manhattan new york city","one word title","fictional drug","drug addiction","death of mother","based on novel","title spoken by character","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:35:03"}}