{"data":{"movies":[{"title":"The Aviators","originalTitle":"Cher Ami... ¡y yo!","year":"2008","releaseDate":"20090619","directors":[{"name":"Miquel Pujol","id":"nm0700237"}],"writers":[{"name":"Miquel Pujol","id":"nm0700237"},{"name":"Ibán Roca","id":"nm3168065"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2OTQxNjY0NV5BMl5BanBnXkFtZTgwNjgwNTA5MzE@._V1.jpg","countries":["Spain"],"languages":["Spanish","Catalan","English","Basque"],"genres":["Animation","Adventure","Family","War"],"plot":"During World War I in 1918, a pigeon and his friends spring into action.","simplePlot":"During World War I in 1918, a pigeon and his friends spring into action.","actors":[{"actorName":"Phil Austin","urlProfile":"http://www.imdb.com/name/nm1971070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzQzMTU4Ml5BMl5BanBnXkFtZTcwMDM4NTY0Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Phil Austin is an actor, known for Olympus Has Fallen (2013), The Host (2013) and The Final Destination (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzQzMTU4Ml5BMl5BanBnXkFtZTcwMDM4NTY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1971070","name":"Phil Austin","idIMDB":"nm1971070"},"actorId":"nm1971070","character":"Soldiers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cyrille Autin","urlProfile":"http://www.imdb.com/name/nm1443247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMTk4ODM1M15BMl5BanBnXkFtZTcwMDExOTQ3Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Born in the South suburb of Paris but raised mostly in Pays de Gex, France. Cyrille is the third son among six children of Françoise and Bruno Autin. First experience with acting, came for Autin at Berkeley's Dr King JR High School in 1976, when Miss Washburn introduced him to the craft. Three years later, Autin created his first Punk Rock Opera: 'Apology of the Apocalypse'. In 1983 he graduated from the Conservatory of Dramatic Arts in Geneva Switzerland and took the train to Paris. Autin first appearance on the small screen is a TV/movie: 'Les Capricieux' directed by award winning director Michel Deville. The next year In 1984, Autin is hired by Jean Luc Godard to play the part of a Punk Rocker in his movie: 'Detective'. In 1987 Autin is invited to the Wooster Group in New York City to perform a monologue of his own. He'll stay for three years... Cyrille as now relocated to California where he joined Tim Robbins' troop: 'The Actors' Gang', in 2013 in Culver City CA. By displacing himself constantly from one environment to the next; Autin has forged a gift for adapting his own self into character and surroundings that resonates in all of his work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMTk4ODM1M15BMl5BanBnXkFtZTcwMDExOTQ3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1443247","name":"Cyrille Autin","nicknames":["Ajabajaba","Samurai"],"idIMDB":"nm1443247"},"actorId":"nm1443247","character":"Victor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yann Bean","urlProfile":"http://www.imdb.com/name/nm3588151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3OTQ4NzQ2NjJeQTJeQWpwZ15BbWU4MDMwMDQ5NTkx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Yann Bean is an actor and cinematographer, known for Jackie (2016), From the Head (2011) and Murder in the Dark (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3OTQ4NzQ2NjJeQTJeQWpwZ15BbWU4MDMwMDQ5NTkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3588151","name":"Yann Bean","idIMDB":"nm3588151"},"actorId":"nm3588151","character":"Cher Ami","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Berliner","urlProfile":"http://www.imdb.com/name/nm1621552","urlPhoto":"","biography":{"dateOfBirth":"27 May 1982","placeOfBirth":" New York, USA","height":"6' 3\" (1.91 m)","bio":"Robert Berliner was born on May 27, 1982 in New York, USA. He is an actor, known for Love: The Movie (2004), Agent Dick Danger (2004) and The Aviators (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1621552","name":"Robert Berliner","nicknames":["Rob"],"idIMDB":"nm1621552"},"actorId":"nm1621552","character":"Sergeant Grey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Bolen","urlProfile":"http://www.imdb.com/name/nm0092868","urlPhoto":"","biography":{"dateOfBirth":"27 August 1953","placeOfBirth":" Georgia, USA","height":"6' (1.83 m)","bio":"John Bolen was born on August 27, 1953 in Georgia, USA. He is an actor, known for The Call of Cthulhu (2005), Mega Shark vs. Giant Octopus (2009) and Lily (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0092868","name":"John Bolen","idIMDB":"nm0092868"},"actorId":"nm0092868","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arsenio Corsellas","urlProfile":"http://www.imdb.com/name/nm0181085","urlPhoto":"","biography":{"dateOfBirth":"17 September 1933","placeOfBirth":" Figueres, Girona, Catalonia, Spain","height":"5' 6½\" (1.69 m)","bio":"Arsenio Corsellas was born on September 17, 1933 in Figueres, Girona, Catalonia, Spain. He is known for his work on Lo mejor que le puede pasar a un cruasán (2003), Despertaferro (1990) and Self Esteem (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0181085","name":"Arsenio Corsellas","idIMDB":"nm0181085"},"actorId":"nm0181085","character":"McBomb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan Forrest","urlProfile":"http://www.imdb.com/name/nm2584203","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjE5ZTk3NmYtZDE1OC00NWViLTk2NjgtZTk2MjRhZDFhNGQwXkEyXkFqcGdeQXVyMTQ2NjI2MzQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1986","placeOfBirth":" Tustin, California, USA","bio":"Graduated from the University California at Santa Barbara in 2009, earning a BFA from their Acting Conservatory. A multifaceted artist and performer Bryan can often be found working within a productions Art Department designing and building props and costumes for himself and his costars. The feats of medieval knights have captivated his imagination since a young lad leading him to also work in the realm of stunts. A California native Bryan moved back south after graduation and now resides in Los Angeles. His work travels through many fields of the industry; voice over for cult favorite Japanese animation, stunt choreography embodying warriors long since past, the building of worlds that previously only existed in our imaginations to name an interesting few.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjE5ZTk3NmYtZDE1OC00NWViLTk2NjgtZTk2MjRhZDFhNGQwXkEyXkFqcGdeQXVyMTQ2NjI2MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2584203","name":"Bryan Forrest","idIMDB":"nm2584203"},"actorId":"nm2584203","character":"Charlie / Kids Sparrows","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Foxworthy","urlProfile":"http://www.imdb.com/name/nm0289344","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTg2ODU0OV5BMl5BanBnXkFtZTYwMjY5NjUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1958","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Jeffrey Marshall Foxworthy","height":"5' 10\" (1.78 m)","bio":"Foxworthy was born Jeffrey Marshall Foxworthy in Atlanta, Georgia on September 6, 1958. He followed in his father's footsteps working for IBM in Georgia, but on a dare from friends, he did a few minutes of comedy at an Atlanta comedy club. A few months later, Foxworthy quit his job and started on the stand-up comedy road. His comedy originally centered on family situations, but he soon hit upon his successful \"You might be a redneck if...\" tagline, which he says signifies \"a glorious absence of sophistication.\" Following two successful albums, Foxworthy joined the growing trend of stand-up comics with their own TV sitcoms.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTg2ODU0OV5BMl5BanBnXkFtZTYwMjY5NjUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0289344","name":"Jeff Foxworthy","nicknames":["Boss Fox"],"idIMDB":"nm0289344"},"actorId":"nm0289344","character":"Linberg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan Carles Gustems","urlProfile":"http://www.imdb.com/name/nm1000977","urlPhoto":"","biography":{"dateOfBirth":"29 October 1960","placeOfBirth":" Barcelona, Barcelona, Catalonia, Spain","bio":"Joan Carles Gustems was born on October 29, 1960 in Barcelona, Barcelona, Catalonia, Spain. He is known for his work on Informativos (2003), El coronel Macià (2006) and What's It All About (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1000977","name":"Joan Carles Gustems","idIMDB":"nm1000977"},"actorId":"nm1000977","character":"Sargento Gris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miguel Ángel Jenner","urlProfile":"http://www.imdb.com/name/nm0421071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njk5Mjk4NF5BMl5BanBnXkFtZTgwMDU1Mjk5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Miguel Ángel Jenner Redondo","bio":"Miguel Ángel Jenner was born as Miguel Ángel Jenner Redondo. He is known for his work on Tad l'explorateur: À la recherche de la Cité perdue (2012), El corredor (2014) and La historia de siempre (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njk5Mjk4NF5BMl5BanBnXkFtZTgwMDU1Mjk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0421071","name":"Miguel Ángel Jenner","idIMDB":"nm0421071"},"actorId":"nm0421071","character":"Paloma Francesa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Laurie","urlProfile":"http://www.imdb.com/name/nm2368587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MzAwMzQ2MF5BMl5BanBnXkFtZTgwNzA4MDY3NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michael Laurie was born in Leigh Park, a large suburb of Havant, in Hampshire, on the south coast of England. Laurie's father Charles was a fifth generation dockworker (an iron caulker and riveter). As a young child, Laurie enjoyed tremendous freedom living on Southern England's South Downs, awestruck by its dramatic coastline and footpaths. As a child, Laurie frolicked in ocean waters alive with marine animals found on the rocks and in tide pools. It was on the South Coast beaches where Laurie first learned to swim; to this day he is a daily swimmer. Through junior and secondary school, Laurie particularly excelled in Drama. After leaving school and fueled with his father's advice \"If you want to make it in life, get a trade!\" Laurie trained as a construction plant and machinery fitter, auto mechanic and eventually worked on historic racing cars and as part of a pit team. After seeing a performance of \"Cats\" (Original Cast) at the Drury Lane Theatre, London beckoned him and he moved there to pursue what had occupied his heart all along. Laurie trained classically with Viviane Guignard, a faculty member of the Royal Academy of Dramatic Art for over 50 years, in her London home. He would perform scenes, monologues and do elocution exercises to exorcise his regional accent in her drawing room, accompanied by a handful of pigeons (her friends) that would - even in sub-zero temperatures - hop in through the constantly open French doors. A short period of study at Harlequin Studios, a drama school in London's Bayswater, was followed by a two-year scholarship at the London School of Singing, after which Laurie burst onto the club circuit singing in pubs and clubs. A chance meeting with impressionist John Scott, a former schoolmate, led them to form \"Scott Free.\" Performing a mix of comedy, impressions and singing the comedy duo toured the variety club circuit and holiday camps up and down the country. After the duo disbanded, Laurie returned to singing, often finding himself working as a host in strip clubs around London. During this time Michael also pursued acting, enjoying recurring television roles and writing and hosting \"Tattoo,\" a docudrama on the Tattoo industry on the South Coast of England. Laurie's transition to stand-up comedy was natural. He simply started including more banter between songs. The laughter and extra cash was all the incentive he needed. Feeling stagnant in a small town, he hopped a flight to Los Angeles in the late 1980s with the intention of \"checking it out\" for a couple of weeks. Almost immediately Laurie began booking stand-up gigs around Los Angeles. After being told, \"If you want to be a comic, New York is the only place to learn,\" he moved to New York and started working all of the showcase comedy clubs there. Laurie continued his acting studies in New York, and is a graduate of the Actors Institute and Susan Slavin Actors and Singers Academy. After five years in New York, Michael made his way back to Los Angeles. Upon arriving in Los Angeles, Laurie enrolled in and graduated from the Ruskin School of Acting in Santa Monica, CA., following a two-year course in the Meisner Technique. He was fortunate to be included in classes taught by Sir Anthony Hopkins and Anthony Fransciosa. Laurie went on to become a founding member of the Ruskin Group Theatre, a producer of their LA Café Plays series and the director of \"Collected Stories.\" Laurie enjoyed three seasons with The Globe of America in their productions of \"Androcles and the Lion,\" \"The Fir Tree\" and the \"Unsinkable Titanic\" when they took up residence in The Royal Theatre aboard the Queen Mary in Long Beach, CA. He was also a member of the resident improv group \"Improv-Xing.\" Laurie's Los Angeles theatre credits are extensive, and include appearances at The Hermosa Beach Playhouse, San Gabriel Civic Auditorium, and Fullerton Playhouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MzAwMzQ2MF5BMl5BanBnXkFtZTgwNzA4MDY3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2368587","name":"Michael Laurie","idIMDB":"nm2368587"},"actorId":"nm2368587","character":"Sir Archibald","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh Lehane","urlProfile":"http://www.imdb.com/name/nm4566326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjU1NjU3OF5BMl5BanBnXkFtZTcwMzk0Mjg2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Actor Hugh Lehane was born in Limerick and grew up in Dublin Ireland. He is also a musician, an editor and a filmmaker. As a boy Hugh was enchanted by Stephen Speilberg's classic film 'Close Encounters Of The Third Kind'. The experience was profound and in Hugh's own words... \"With Close Encounters I truly came to know the wonder, the magic of cinema, the scope of what it could do and it changed me. Later, as I grew to know myself as an artist this film became a reminder of my purpose as an actor. To create art that touches the soul, that fundamentally, emotionally, spiritually moves people, and in doing so, giving back the same experience, the magical wonder that Speilberg helped me feel with Close Encounters.\" Some of the highlights of Hugh's time growing up in Ireland as an artist include performances at Dublin's famous Olympia Theatre, going on a Nationwide Sponsored Irish Tour, producing, directing & starring in many musical theater shows at the Rupert Guinness Theatre and getting past numerous public rounds of selection to win a personal audition with Alan Parker for a Lead Role in his film 'The Commitments'. Wanting to take his acting career to the next level in 2011 Hugh made the move to Los Angeles where he has been studying intensively at Studio 24 Seven with the amazing acting teacher / career coach Mark McPherson. Within weeks of beginning these LA classes Hugh hit the ground running and booked a Lead Role in the feature film 'Gothic Assassins' which went on to win numerous awards and appeared in 14 International Film Festivals. Since then Hugh has steadily continued to add to his resume making appearances in numerous TV shows, films & web series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjU1NjU3OF5BMl5BanBnXkFtZTcwMzk0Mjg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4566326","name":"Hugh Lehane","idIMDB":"nm4566326"},"actorId":"nm4566326","character":"Various","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"P.J. Marino","urlProfile":"http://www.imdb.com/name/nm0547827","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MjI2NTI3NF5BMl5BanBnXkFtZTgwMTAwNjc0MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1972","placeOfBirth":" Boston, Massachusetts, USA","height":"6' 1\" (1.85 m)","bio":"P.J. Marino was born and raised in Boston's North End, or Little Italy. He started his career as a stand-up comic, quickly getting spots at some of Boston's best comedy clubs, such as The Comedy Connection and Nick's Comedy Stop. He landed an acting job after his first audition, a national commercial for Nike starring Ken Griffey Jr., in which Griffey hits a foul ball off the head of a popcorn vendor played by P.J. After his first film audition, P.J. landed the role of Brian in \"Little Shots of Happiness\", shot entirely in Boston on Super 8 video, this film got accepted in over a dozen festivals, including Berlin, New York Underground, and Thessalonika. He moved to Los Angeles in 1998, and took his first acting class, studying with Aaron Speiser in Beverly Hills. Within a few months, he got his first TV audition, a recurring role in a new Fox sitcom looking for authentic Boston accents called \"Costello\". Four callbacks later, he booked it, and shot his first TV show on the Disney lot. Several national commercials followed, including Saturn, Coors Light, Blockbuster, Volkswagen, and a widely shown Coors Original campaign with Kid Rock. In the meantime, P.J. has worked steadily in TV shows, appearing on \"Everybody Hates Chris\", \"King of Queens\", \"Without A Trace\", \"Las Vegas\", \"ER\", \"Alias\", and many others. He also appeared on stage in \"The Talking Cure\" under the guidance of artistic director Gordon Davidson and writer Christopher Hampton (Academy-Award winner for Dangerous Liaisons), and performed at downtown LA?s prestigious Mark Taper Forum. P.J. is also a writer. His spec script for \"The Simpsons\" placed second in a recent national competition sponsored by Scriptapalooza, and his original pilot, \"Bella Napoli\", was a finalist with Writers? Digest and Square Magazine. He just finished his second feature-length screenplay, \"Over The Tobin\", based on his life growing up in the North End.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MjI2NTI3NF5BMl5BanBnXkFtZTgwMTAwNjc0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0547827","name":"P.J. Marino","idIMDB":"nm0547827"},"actorId":"nm0547827","character":"Soldiers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zak Morgan","urlProfile":"http://www.imdb.com/name/nm3061622","urlPhoto":"","biography":{"bio":"Zak Morgan is an actor and writer, known for Zakland (2008) and The Aviators (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3061622","name":"Zak Morgan","idIMDB":"nm3061622"},"actorId":"nm3061622","character":"Lindbergh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tessa Munro","urlProfile":"http://www.imdb.com/name/nm1433102","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4ODU1MjAyNl5BMl5BanBnXkFtZTgwODI2MjQxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tessa Munro is an actress and producer, known for Scandal (2012), Revenge (2011) and NCIS (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4ODU1MjAyNl5BMl5BanBnXkFtZTgwODI2MjQxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1433102","name":"Tessa Munro","idIMDB":"nm1433102"},"actorId":"nm1433102","character":"Dominique / Little Chick","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1476250","urlIMDB":"http://www.imdb.com/title/tt1476250","business":{"budget":null,"openingWeekend":[{"money":"$68,794","country":"Spain","day":"21","month":"06","year":"2009","remarks":"135 Screens"}],"gross":[{"money":"$168,304","country":"Spain","day":"05","month":"07","year":"2009","remarks":""},{"money":"$68,794","country":"Spain","day":"21","month":"06","year":"2009","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.6","filmingLocations":[],"awards":[{"award":"Gaudí Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Gaudí Award","categories":[{"category":"Best Animated Feature (Millor Pel·lícula d'Animació)","names":[{"name":"Miquel Pujol","id":"nm0700237","role":null},{"name":"Accio","id":null,"role":null},{"name":"Digital Dreams Films","id":null,"role":null},{"name":"Euroview Animation","id":null,"role":null},{"name":"Televisió de Catalunya (TV3)","id":null,"role":null}]}]}]}],"votes":"49","type":"Movie","companyCreditsSimple":[{"idCompany":"co0032486","name":"Accio"},{"idCompany":"co0234854","name":"Audience Alliance Motion Picture Studios (AAMPS)"},{"idCompany":"co0279109","name":"Digital Dreams Films"}],"keywords":{"keywords":["pigeon","horse","farm","duck","donkey","chicken","world war one","mouse","forest","exclamation point in title","ellipsis in title","airplane","based on true story","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:01:47"}}