{"data":{"movies":[{"title":"Red Riding Hood","originalTitle":"","year":"2011","releaseDate":"20110311","directors":[{"name":"Catherine Hardwicke","id":"nm0362566"}],"writers":[{"name":"David Leslie Johnson","id":"nm0424901"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NjYyMzQ5MV5BMl5BanBnXkFtZTcwNjE5Mjc3NA@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Fantasy","Horror","Mystery","Thriller"],"plot":"Valerie (Seyfried) is a beautiful young woman torn between two men. She is in love with a brooding outsider, Peter (Fernandez), but her parents have arranged for her to marry the wealthy Henry (Irons). Unwilling to lose each other, Valerie and Peter are planning to run away together when they learn that Valerie's older sister has been killed by the werewolf that prowls the dark forest surrounding their village. For years, the people have maintained an uneasy truce with the beast, offering the creature a monthly animal sacrifice. But under a blood red moon, the wolf has upped the stakes by taking a human life. Hungry for revenge, the people call on famed werewolf hunter, Father Solomon (Oldman), to help them kill the wolf. But Solomon's arrival brings unintended consequences as he warns that the wolf, who takes human form by day, could be any one of them. As the death toll rises with each moon, Valerie begins to suspect that the werewolf could be someone she loves. As panic grips the ...","simplePlot":"Set in a medieval village that is haunted by a werewolf, a young girl falls for an orphaned woodcutter, much to her family's displeasure.","actors":[{"actorName":"Amanda Seyfried","urlProfile":"http://www.imdb.com/name/nm1086543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUyODkwODUyMF5BMl5BanBnXkFtZTcwMzU3MjYxMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1985","placeOfBirth":" Allentown, Pennsylvania, USA","birthName":"Amanda Michelle Seyfried","height":"5' 2½\" (1.59 m)","bio":"Amanda Seyfried was born and raised in Allentown, Pennsylvania, to Ann (Sander), an occupational therapist, and Jack Seyfried, a pharmacist. She is of German, and some English and Scottish, ancestry. She began modeling when she was eleven, and acted in high school productions as well as taking singing lessons. She landed a recurring role in the long-running soap opera As the World Turns (1956) when she was just age 15. More soap work followed as she completed her schooling and had already secured a place at Fordham University when she was offered a role in the Tina Fey-penned teen comedy Mean Girls (2004). She deferred her university education to complete the film. More television work followed, raising her profile across America, while her appearances in Mamma Mia! (2008) and Red Riding Hood (2011) helped establish her international fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUyODkwODUyMF5BMl5BanBnXkFtZTcwMzU3MjYxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1086543","name":"Amanda Seyfried","idIMDB":"nm1086543"},"actorId":"nm1086543","character":"Valerie","urlCharacter":"http://www.imdb.com/character/ch0219210","main":true},{"actorName":"Gary Oldman","urlProfile":"http://www.imdb.com/name/nm0000198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTM4MzQ5MV5BMl5BanBnXkFtZTcwOTE4MDczNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1958","placeOfBirth":" New Cross, London, England, UK","birthName":"Gary Leonard Oldman","height":"5' 8½\" (1.74 m)","bio":"Gary Oldman is a talented British born movie actor who played Sid Vicious in Sid & Nancy, Drexl in True Romance, and George Smiley in Tinker Tailor Soldier Spy. He starred in Dawn of the Planet of the Apes and the remake of RoboCop. He is also an English filmmaker, musician and author. Renowned for his \"big\" acting style, Oldman is one of the most celebrated thespians of his generation, with a diverse career encompassing theatre, film and television. Gary Oldman was born on March 21, 1958 in New Cross, London, England, the son of Kathleen (Cheriton), a homemaker, and Leonard Bertram Oldman, a welder. For most of his career he was best-known for playing over-the-top antagonists such as the role of Russian terrorist Egor Korshunov in the 1997 blockbuster Air Force One, though he has recently reached a new audience with heroic roles in the Harry Potter and Dark Knight franchises. In amazing trivia, he was in Batman Begins and The Fifth Element. Oldman won a scholarship to Britain's Rose Bruford Drama College, in Sidcup, Kent, where he received a B.A. in theatre arts in 1979. He subsequently studied with the Greenwich Young People's Theatre and went on to appear in a number of plays throughout the early '80s, including \"The Pope's Wedding,\" for which he received Time Out's Fringe Award for Best Newcomer of 1985-1986 and the British Theatre Association's Drama Magazine Award as Best Actor for 1985. Before fame, he was employed as a worker in assembly lines, and as a porter in an operating theater. He also got jobs selling shoes and beheading pigs while supporting his early acting career. He was also in the movie The Dark Knight with Heath Ledger. His film debut was Remembrance (1982), though his most-memorable early role came when he played Sex Pistol Sid Vicious in the biopic Sid and Nancy (1986) picking up the Evening Standard Film Award as Best Newcomer. He then received a Best Actor nomination from BAFTA for his portrayal of '60s playwright Joe Orton in Prick Up Your Ears (1987). In the 1990s, Oldman brought to life a series of iconic real-world and fictional villains including Lee Harvey Oswald in JFK (1991), the title character in Bram Stoker's Dracula (1992), Drexl Spivey in True Romance (1993), Stansfield in Léon: The Professional (1994), Jean-Baptiste Emanuel Zorg in The Fifth Element (1997) and Ivan Korshunov in Air Force One (1997). That decade also saw Oldman portraying Ludwig van Beethoven in biopic Immortal Beloved (1994). Oldman scored the coveted role of Sirius Black in Harry Potter and the Prisoner of Azkaban (2004), giving him a key part in one of the highest-grossing franchises ever. He reprised that role in Harry Potter and the Goblet of Fire (2005) and Harry Potter and the Order of the Phoenix (2007). Oldman also took on the iconic role of Detective James Gordon in writer-director Christopher Nolan's Batman Begins (2005), a role he played again in The Dark Knight (2008) and The Dark Knight Rises (2012). Prominent film critic Mark Kermode, in reviewing The Dark Knight, wrote, \"the best performance in the film, by a mile, is Gary Oldman's ... it would be lovely to see him get a[n Academy Award] nomination because actually, he's the guy who gets kind of overlooked in all of this.\" Oldman co-starred with Jim Carrey in the 2009 version of A Christmas Carol in which Oldman played three roles. He had a starring role in David Goyer's supernatural thriller The Unborn, released in 2009. In 2010, Oldman co-starred with Denzel Washington in The Book of Eli. He also played a lead role in Catherine Hardwicke's Red Riding Hood. Oldman voiced the role of villain Lord Shen and was nominated for an Annie Award for his performance in Kung Fu Panda 2. In 2011, Oldman portrayed master spy George Smiley in the adaptation of John le Carré's La taupe (2011), and the role scored Oldman his first Academy Award nomination. In 2014, he played one of the lead humans in the science fiction action film Dawn of the Planet of the Apes (2014). Also in 2014, Oldman starred alongside Joel Kinnaman, Abbie Cornish, Michael Keaton, and Samuel L. Jackson in the remake of RoboCop (2014), as Norton, the scientist who creates RoboCop. Also that year, Oldman starred in Dawn of the Planet of the Apes as one of the leads alongside Jason Clarke and Keri Russell. Aside from acting, Oldman tried his hand at writing and directing for Nil by Mouth (1997). The movie opened the Cannes Film Festival in 1997, and won Kathy Burke a Best Actress prize at the festival. Oldman has three children - one with first wife Lesley Manville, and two with third wife Donya Fiorentino. He married Alexandra Edenborough on December 31, 2008 until they divorced in January 2015. He was married to actress Uma Thurman from 1990 to 1992. He married his fourth wife Alexandra Edenborough in 2008 but the couple divorced in 2015. He has three sons named Alfie, Gulliver and Charlie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTM4MzQ5MV5BMl5BanBnXkFtZTcwOTE4MDczNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000198","name":"Gary Oldman","nicknames":["Gaz"],"idIMDB":"nm0000198"},"actorId":"nm0000198","character":"Solomon","urlCharacter":"http://www.imdb.com/character/ch0241442","main":true},{"actorName":"Billy Burke","urlProfile":"http://www.imdb.com/name/nm0121605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2OTAyMzQxOF5BMl5BanBnXkFtZTcwMDA4NDU1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1966","placeOfBirth":" Everett, Washington, USA","birthName":"William Albert Burke","height":"6' 2\" (1.88 m)","bio":"Billy Burke was born and raised in Bellingham, Washington, USA. He began singing at age nine, and joined a band at age fifteen. He continued to work with bands and study/performing drama at Western Washington University. He performed in Seattle at the Annex Theater, New City Festival, and the A.H.A. Theater, though it was as a musician, not an actor, that Burke first moved to Los Angeles. A demo deal with a major record label that \"didn't quite pan out\", left him to explore the only other thing he \"knew he was good at\". With two independent films shot in his native Seattle under his belt, he began auditioning and very soon working as an actor. He made his feature film debut in the independent film Daredreamer (1990). After a string of mostly \"bad guy with facial hair\" TV guest appearances, he landed his first studio picture role in the Zucker brothers' genre spoof Mafia! (1998). Capitalizing on his deadpan comedic sensibilities, he then won the title role in Dill Scallion (1999), the cult classic \"mockumentary\" about the rise and fall of a slightly touched country music singer. Co-starring in \"Dill\", was then fledgling writer/director Peter Berg. It was Berg who brought Billy back to television to play \"Dr. Abe Matthews\" in the acclaimed ABC drama Wonderland (2000). Although its life on the air was short-lived, Wonderland (2000) won the hearts of critics and fans, alike, and was recently re-released in its entirety on DirecTV. Paramount's Along Came a Spider (2001) marked Billy's first revisit to studio films. He then returned yet again to television for the second season of Fox's mega hit series 24 (2001). His disturbing portrayal of abusive father and husband \"Gary Matheson\" still resonates as a fan favorite. In 2004, Billy teamed up with John Travolta and Joaquin Phoenix in the firefighter drama Ladder 49 (2004). It was here that the studios once again began to recognize his on-screen magnetism. So, after another steady stream of notable television performances, he was cast alongside Anthony Hopkins and Ryan Gosling in New Line's hit thriller Fracture (2007), directed by NYPD Blue (1993) creator Gregory Hoblit. This multi-layered turn as a flawed cop snared by his own aberrations caught the eye of Academy Award winning director Robert Benton. Benton swiftly invited Billy to join the cast of his and Lakeshore Entertainment's Feast of Love (2007), which included Morgan Freeman and Greg Kinnear. As fate would have it, neither Gregory Hoblit nor Lakeshore had seen enough of Burke's dry wit and unshakable persona, so when it came time to find a match for Diane Lane in Untraceable (2008), he got the call to play the rock solid \"Detective Eric Box\". Since arriving in Hollywood in the early 90s, Billy Burke has never stopped working. There are countless credits that come in between the aforementioned that of course, also serve as a testament to his gift and longevity. However, it was a chance viewing of Dill Scallion (1999) that struck an indelible head turn for director Catherine Hardwicke. The impression Billy's performance left, lasted until they met in 2007 while Hardwicke and Summit Entertainment were looking for someone to play \"Charlie Swan\" in their film adaptations of the bestselling book series The \"Twilight\" Saga. After a brief meeting and read-through of a few scenes, Billy and Catherine agreed... it was \"meant to be\". Summit followed suit and welcomed him into the franchise. Millions of fans around the world have concurred with the choice and the overwhelming response to his theatrical work has given him solace in the fact that he never got that record deal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2OTAyMzQxOF5BMl5BanBnXkFtZTcwMDA4NDU1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0121605","name":"Billy Burke","idIMDB":"nm0121605"},"actorId":"nm0121605","character":"Cesaire","urlCharacter":"http://www.imdb.com/character/ch0242349","main":true},{"actorName":"Shiloh Fernandez","urlProfile":"http://www.imdb.com/name/nm2057036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjIwODA4M15BMl5BanBnXkFtZTcwMjA5NjE0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1985","placeOfBirth":" Ukiah, California, USA","birthName":"Shiloh Thomas Fernandez","height":"5' 10\" (1.78 m)","bio":"Shiloh Fernandez was born on February 26, 1985 in Ukiah, California, USA as Shiloh Thomas Fernandez. He is an actor and writer, known for Evil Dead (2013), Red Riding Hood (2011) and Deadgirl (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjIwODA4M15BMl5BanBnXkFtZTcwMjA5NjE0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2057036","name":"Shiloh Fernandez","idIMDB":"nm2057036"},"actorId":"nm2057036","character":"Peter","urlCharacter":"http://www.imdb.com/character/ch0241298","main":true},{"actorName":"Max Irons","urlProfile":"http://www.imdb.com/name/nm1796057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDM1MTkwN15BMl5BanBnXkFtZTcwNDg2Mzk3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1985","placeOfBirth":" Camden, London, England, UK","birthName":"Maximilian Paul Diarmuid Irons","height":"6' 2\" (1.88 m)","bio":"Max Irons was born on October 17, 1985 in Camden, London, England as Maximilian Paul Diarmuid Irons. He is an actor, known for Red Riding Hood (2011), Woman in Gold (2015) and The Host (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDM1MTkwN15BMl5BanBnXkFtZTcwNDg2Mzk3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1796057","name":"Max Irons","idIMDB":"nm1796057"},"actorId":"nm1796057","character":"Henry","urlCharacter":"http://www.imdb.com/character/ch0242350","main":true},{"actorName":"Virginia Madsen","urlProfile":"http://www.imdb.com/name/nm0000515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyMDcxNTU3N15BMl5BanBnXkFtZTcwMDAwNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1961","placeOfBirth":" Chicago, Illinois, USA","height":"5' 5\" (1.65 m)","bio":"One of the hottest stars of the mid-1980s, Virginia Madsen has since played a variety of roles that have cemented her reputation as a fantastic actress who can adapt to any part. Virginia was born in Chicago, Illinois, and belongs to an acting family -- with her brother, Michael Madsen, also an actor, and her mother, Elaine Madsen (née Melson), an Emmy-winning writer, poet, and producer. Her paternal grandparents were Danish, and her father, Calvin Madsen, was a firefighter. Audiences first caught a glimpse of her as \"Princess Irulan\" in the 1984 science fiction epic Dune (1984). She followed that up with Electric Dreams (1984); however, it was in 1986 that Virginia captured the hearts of the audience with an intense portrayal of a Catholic school girl who fell in love with a boy from a prison camp in Duncan Gibbins' Fire with Fire (1986). Virginia played the role of \"Lisa\" and her co-star was Craig Sheffer, who played Lisa's love interest, \"Joe Fisk\". Kari Wuhrer also made an appearance as Virginia's best friend, \"Gloria\". Fire with Fire (1986) was a low-budget production, starring a bunch of fresh faces who were till then-unknown to Hollywood. However, the movie was a success and elevated its three young stars overnight. Virginia has never looked back since. Not only did she receive amazing reviews for her Academy Award and Golden Globe nominated performance in Alexander Payne's hit film, Sideways (2004), but this Independent Spirit Award-winning actress has an illustrious resume of roles alongside the most notable and respected actors in the business. Also on Virginia's slate is her production company, with partner Karly Meola, called \"Title IX Productions\". Their first project was the documentary I Know a Woman Like That (2009), which previewed at the Phoenix Film Festival in April 2009 and premiered at the Chicago Film Festival in October 2009. The doc was directed by Virginia's mother, Elaine Madsen, about the lives of extraordinary women ages 64-94. Next in the company's lineup is the documentary Fighting Gravity (2010), about women ski jumpers' ongoing battle for the right to compete in the 2010 Winter Olympics. Title IX will team up with \"Empire 8 Productions\" and Vancouver-based \"Screen Siren\" on the project. The duo also has several projects in development that they're shopping around for financing including screenwriters Sebastian Gutierrez's screen adaptation of Martha O'Connor's novel \"The Bitch Posse\" and a remake of the 1984 film Electric Dreams (1984), in which Virginia appeared.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyMDcxNTU3N15BMl5BanBnXkFtZTcwMDAwNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000515","name":"Virginia Madsen","nicknames":["Gina"],"idIMDB":"nm0000515"},"actorId":"nm0000515","character":"Suzette","urlCharacter":"http://www.imdb.com/character/ch0242351","main":true},{"actorName":"Lukas Haas","urlProfile":"http://www.imdb.com/name/nm0001305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MjU1MDMxM15BMl5BanBnXkFtZTgwODk5ODE4MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1976","placeOfBirth":" West Hollywood, California, USA","birthName":"Lukas Daniel Haas","height":"5' 11½\" (1.82 m)","bio":"Lukas was born on April 16, 1976 in West Hollywood, California. His Texas-born mother, Emily Tracy, is a writer, and his German-born father, Berthold Haas, is an artist. He has twin brothers, Simon and Nikolai. It's widely noted that Lukas was discovered at the age of 5 by casting director Margery Simkin while he was in kindergarten. While his first screen role was in the 1983 nuclear holocaust film Testament (1983), it was his second appearance, in Witness (1985) opposite Harrison Ford and Kelly McGillis, that earned attention and acclaim. In Peter Weir's 1985 film, Lukas portrayed an Amish child who was the sole witness to an undercover cop's murder, and his work earned him starring roles in such films as Lady in White (1988), The Wizard of Loneliness (1988), and Alan & Naomi (1992) - the latter film co-written by his mother. Lukas was subsequently nominated for an Emmy for his portrayal of AIDS victim, Ryan White, in the controversial TV movie, The Ryan White Story (1989). He continued to distinguish himself in film in starring roles including: Music Box (1989) with Jessica Lange and director Costa-Gavras; Convicts (1991) and Rambling Rose (1991) (both with Robert Duvall); and Boys (1996) with John C. Reilly and Winona Ryder. On stage, in 1988, Lukas performed alongside Steve Martin and Robin Williams in Samuel Beckett's \"Waiting for Godot\" at Lincoln Center in New York City for director Mike Nichols. Lukas went on to work with directors Woody Allen in Everyone Says I Love You (1996), Tim Burton in Mars Attacks! (1996), and Alan Rudolph in Breakfast of Champions (1999). He had a pivotal role in Brick (2005), Rian Johnson's directorial debut with Joseph Gordon-Levitt. He next appeared in the Kurt Cobain-inspired Last Days (2005), directed by Gus Van Sant, which premiered at the Cannes Film Festival. Roles in Material Girls (2006), slasher movie send-up The Tripper (2006), Who Loves the Sun (2006), Gardener of Eden (2007), While She Was Out (2008), and Death in Love (2008) followed. Recently, Lukas had a supporting role in Christopher Nolan's Inception (2010) opposite Leonardo DiCaprio, Ellen Page, Joseph Gordon-Levitt, Michael Caine and Marion Cotillard. He then appeared in Red Riding Hood (2011) for director Catherine Hardwicke, and Contraband (2012), director Baltasar Kormákur's English-language remake of the movie he starred in, Reykjavik - Rotterdam (2008). Lukas was most recently seen in Crazy Eyes (2012). He has several projects in production, including Meth Head (2013) written and directed by Jane Clark. Also a talented musician, Lukas plays drums and piano in the band The Rogues.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MjU1MDMxM15BMl5BanBnXkFtZTgwODk5ODE4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001305","name":"Lukas Haas","nicknames":["Freddy"],"idIMDB":"nm0001305"},"actorId":"nm0001305","character":"Father Auguste","urlCharacter":"http://www.imdb.com/character/ch0457338","main":true},{"actorName":"Julie Christie","urlProfile":"http://www.imdb.com/name/nm0001046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzIzMTE5MV5BMl5BanBnXkFtZTcwNDc3NDA2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1941","placeOfBirth":" Chabua, Assam Province, British India","birthName":"Julie Frances Christie","height":"5' 3\" (1.6 m)","bio":"Julie Christie, the British movie legend whom Al Pacino called \"the most poetic of all actresses\", was born in Chukua, Assam, India, on April 14, 1941, the daughter of a tea planter, Frank St. John Christie, and his wife, Rosemary (Ramsden), who was a painter. Her family was of English, and some Scottish, origin. The young Christie grew up on her father's tea plantation before being sent to England for her education. Finishing her studies in Paris, where she had moved to improve her French with an eye to possibly becoming a linguist (she is fluent in French and Italian), the teenager became enamored of the freedom of the Continent. She also was smitten by the bohemian life of artists and planned on becoming an artist before she enrolled in London's Central School of Speech Training. She made her debut as a professional in 1957 as a member of the Frinton Repertory of Essex. Christie was not fond of the stage, even though it allowed her to travel, including a professional gig in the United States. Her true métier as an actress was film, and she made her screen debut in the science-fiction television serial A for Andromeda (1961) in 1961. Her first film role was as the unlikely fiancé of Leslie Phillips in the Ealing-like comedy Crooks Anonymous (1962), which was followed up by an ingénue role in another comedy, The Fast Lady (1962). The producers of the \"James Bond\" series were sufficiently intrigued by the young actress to consider her for the role that subsequently went to Ursula Andress in Dr. No (1962), but dropped the idea because she was not busty enough. Christie first worked with the man who would kick her career into high gear, director John Schlesinger, when he choose her as a replacement for the actress originally cast in Billy Liar (1963). Christie's turn in the film as the free-wheeling \"Liz\" was a stunner, and she had her first taste of becoming a symbol if not icon of the new British cinema. Her screen presence was such that the great John Ford cast her as the Irish prostitute, Daisy Battles, in Young Cassidy (1965). Charlton Heston wanted her for his film The War Lord (1965), but the studio refused her salary demands. Although Amercan magazines portrayed Christie as a \"newcomer\" when she made her breakthrough to super-stardom in Schlesinger's seminal Swinging Sixties film Darling (1965), she actually had considerable work under her professional belt and was in the process of a artistic quickening. Schlesinger called on Christie, whom he adored, to play the role of mode \"Diana Scott\" when the casting of Shirley MacLaine fell through. (MacLaine was the sister of the man who would become Christie's long-time paramour in the late 1960s and early 1970s, Warren Beatty, whom some, like actor Rod Steiger, believe she gave up her career for. Her Doctor Zhivago (1965) co-star, Steiger -- a keen student of acting -- regretted that Christie did not give more of herself to her craft). As played by Christie, Diana is an amoral social butterfly who undergoes a metamorphosis from immature sex kitten to jaded socialite. For her complex performance, Christie won raves, including the Best Actress Awards from the Academy of Motion Picture Arts and Sciences and the British Film Academy. She had arrived, especially as she had followed up Darling (1965) with the role of \"Lara\" in two-time Academy Award-winning director David Lean's adaptation of Boris Pasternak's Doctor Zhivago (1965), one of the all-time box-office champs. Christie was now a superstar who commanded a price of $400,000 per picture, a fact ruefully noted in Charlton Heston's diary (his studio had balked at paying her then-fee of $35,000). More interested in film as an art form than in consolidating her movie stardom, Christie followed up Doctor Zhivago (1965) with a dual role in Fahrenheit 451 (1966) for director François Truffaut, a director she admired. The film was hurt by the director's lack of English and by friction between Truffaut and Christie's male co-star Oskar Werner, who had replaced the more-appropriate-for-the-role Terence Stamp. Stamp and Christie had been lovers before she had become famous, and he was unsure he could act with her, due to his own ego problems. On his part, Werner resented the attention the smitten Truffaut gave Christie. Stamp overcame those ego problems to sign on as her co-star in John Schlesinger's adaptation of Thomas Hardy's Far from the Madding Crowd (1967), which also featured two great English actors, Peter Finch and Alan Bates. It is a film that is far better remembered now than when it was received in 1967. The film and her performance as the Hardy heroine \"Bathsheba Everdene\" was lambasted by film critics, many of whom faulted Christie for being too \"mod\" and thus untrue to one of Hardy's classic tales of fate. Some said that her contemporary, Vanessa Redgrave, would have been a better choice as \"Bathsheba\", but while it is true that Redgrave is a very fine actress, she lacked the sex appeal and star quality of Christie, which makes the story of three men in love with one woman more plausible, as a film. Although no one then knew it, the period 1967-68 represented the high-water mark of Christie's career. Fatefully, like the Hardy heroine she had portrayed, she had met the man who transformed her life, undermining her pretensions to a career as a movie star in their seven-year-long love affair, the American actor Warren Beatty. Living his life was always far more important than being a star for Beatty, who viewed the movie star profession as a \"treadmill leading to more treadmills\" and who was wealthy enough after Bonnie and Clyde (1967) to not have to ever work again. Christie and Beatty had visited a working farm during the production of Far from the Madding Crowd (1967) and had been appalled by the industrial exploitation of the animals. Thereafter, animal rights became a very important subject to Christie. They were kindred souls who remain friends four decades after their affair ended in 1974. Christie's last box-office hit in which she was the top-liner was Petulia (1968) for Richard Lester, a film that featured one of co-star George C. Scott's greatest performances, perfectly counter-balanced by Christie's portrayal of an \"arch-kook\" who was emblematic of the '60s. It is one of the major films of the decade, an underrated masterpiece. Despite the presence of the great George C. Scott and the excellent Shirley Knight, the film would not work without Julie Christie. There is frankly no other actress who could have filled the role, bringing that unique presence and the threat of danger that crackled around Christie's electric aura. At this point of her career, she was poised for greatness as a star, greatness as an actress. And she walked away. After meeting Beatty, Julie Christie essentially surrendered any aspirations to screen stardom, or at maintaining herself as a top-drawer working actress (success at the box office being a guarantee of the best parts, even in art films). She turned down They Shoot Horses, Don't They? (1969) and Anne of the Thousand Days (1969), two parts that garnered Oscar nominations for the second choices, Jane Fonda and Geneviève Bujold. After shooting In Search of Gregory (1969), a critical and box office flop, to fulfill her contractual obligations, she spent her time with Beatty in California, renting a beach house at Malibu. She did return to form in Joseph Losey's The Go-Between (1971), a fine picture with a script by the great Harold Pinter, and she won another Oscar nomination as the whore-house proprietor in Robert Altman's minor classic McCabe & Mrs. Miller (1971) that she made with her lover Beatty. However, like Beatty, himself, she did not seek steady work, which can be professional suicide for an actor who wants to maintain a standing in the first rank of movie stars. At the same time, Julie Christie turned down the role of the Russian Empress in Nicholas and Alexandra (1971), another film that won the second-choice (Janet Suzman) a Best Actress Oscar nomination. Two years later, she appeared in his landmark mystery-horror film Don't Look Now (1973), but that likely was as a favor to the director, Nicolas Roeg, who had been her cinematographer on Fahrenheit 451 (1966), Far from the Madding Crowd (1967) and Petulia (1968). In the mid-70s, her affair with Beatty came to an end, but the two remained close friends and worked together in Shampoo (1975) (which she regretted due to its depiction of women) and Heaven Can Wait (1978). Christie was still enough of a star, due to sheer magnetism rather than her own pull at the box-office, to be offered $1 million to play the Jacqueline Kennedy Onassis character in The Greek Tycoon (1978) (a part eventually played by Jacqueline Bisset to no great acclaim). She signed for but was forced to drop out of the lead in Agatha (1979) (which was filled by Vanessa Redgrave) after she broke a wrist roller-skating (a particularly southern Californian fate!). She then signed for the female lead in American Gigolo (1980) when Richard Gere was originally attached to the picture, but dropped out when John Travolta muscled his way into the lead after making twin box-office killings as disco king \"Tony Manero\" in Saturday Night Fever (1977) and greaser \"Danny Zuko\" in Grease (1978). Christie could never have co-starred with such a camp figure of dubious talent. When Travolta himself dropped out and Gere was subbed back in, it was too late for Christe to reconsider, as the part already had been filled by model-actress Lauren Hutton. Finally, the end of the American phase of her movie career was realized when Christie turned down the part of \"Louise Bryant\" in Reds (1981), a part written by Warren Beatty with her in mind, as she felt an American should play the role. (Beatty's latest lover, Diane Keaton, played the part and won a Best Actress Oscar nomination). Still, she remained a part of the film, Beatty's long-gestated labor of love, as it is dedicated to \"Jules\". Julie Christie moved back to the UK and become the UK's answer to Jane Fonda, campaigning for various social and political causes, including animal rights and nuclear disarmament. The parts she did take were primarily driven by her social consciousness, such as appearing in Sally Potter's first feature-length film, The Gold Diggers (1983) which was not a remake of the old Avery Hopwood's old warhorse but a feminist parable made entirely by women who all shared the same pay scale. Roles in The Return of the Soldier (1982) with Alan Bates and Glenda Jackson and Merchant-Ivory's Heat and Dust (1983) seemed to herald a return to form, but Christie -- as befits such a symbol of the freedom and lack of conformity of the '60s -- decided to do it her way. She did not go \"careering\", even though her unique talent and beauty was still very much in demand by filmmakers. At this point, Christie's movie career went into eclipse. Once again, she was particularly choosy about her work, so much so that many came to see her, essentially, as retired. A career renaissance came in the mid-1990s with her turn as \"Gertrude\" in Kenneth Branagh's ambitious if not wholly successful Hamlet (1996). As Christie said at the time, she didn't feel she could turn Branagh down as he was a national treasure. But the best was yet to come: her turn as the faded movie star married to handyman Nick Nolte and romanced by a younger man in Afterglow (1997), which brought her rave notices. She received her third Best Actress Oscar nomination for her performance, and showed up at the awards as radiant and uniquely beautiful as ever. Ever the iconoclast, she was visibly relieved, upon the announcement of the award, to learn that she had lost! Christie lived with left-wing investigative journalist Duncan Campbell (a Manchester Guardian columnist) since 1979, first in Wales, then in Ojai, California, and now in London's East End, before marrying in 2008. In addition to her film work, she has narrated many books-on-tape. In 1995, she made a triumphant return to the stage in a London revival of Harold Pinter's \"Old Times\", which garnered her superb reviews. In the decade since Afterglow (1997), she has worked steadily on film in supporting roles. Christie -- an actress who eschewed vulgar stardom -- proved to be an inspiration to her co-star Sarah Polley who was in No Such Thing (2001) and The Secret Life of Words (2005). Polley says that Christie is uniquely aware of her commodification by the movie industry and the mass media during the 1960s. Not wanting to be reduced to a product, she had rebelled and had assumed control of her life and career. Her attitude makes her one of Polley's heroes, who calls her one of her surrogate mothers. (Polley lost her own mother when she was 11 years old). Polley wrote the screenplay for her adaptation of Alice Munro's short story \"The Bear Went Over the Mountain\" with only one actress in mind: Julie Christie. Polley had first read the short story on a flight back from Iceland, where she had made No Such Thing (2001) with Christie and, as she read, it was Julie whom she pictured as \"Fiona\", the wife of a one-time philandering husband, who has become afflicted with Alzheimer's disease and seeks to save her hubby the pain of looking after her by checking herself into a home. After finishing the screenplay, it took months to get Christie to commit to making the film. Polley then found out why Christie is so reticent about making movies: \"She gives all of herself to what she does. Once she said yes, she was more committed than anybody\". According to David Germain, a cinema journalist who interviewed Christie for the Associated Press, \"Polley and Christie share a desire to do interesting, unusual work, which generally means staying away from Hollywood. The collaboration between the two rebels yielded a small gem of a film. Lions Gate Films was so impressed, it purchased the American distribution rights to the film in 2006, then withheld it until the following year to build up momentum for the awards season. Julie Christie's performance in Loin d'elle (2006) is superb, and already has garnered her the National Board of Review's Best Actress Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzIzMTE5MV5BMl5BanBnXkFtZTcwNDc3NDA2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001046","name":"Julie Christie","nicknames":["Jules"],"idIMDB":"nm0001046"},"actorId":"nm0001046","character":"Grandmother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shauna Kain","urlProfile":"http://www.imdb.com/name/nm0435076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDk5NTQ2MV5BMl5BanBnXkFtZTcwMTM2NDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Shauna Nicole Kain","bio":"Shauna Kain was born as Shauna Nicole Kain. She is an actress, known for X-Men 2 (2003), X-Men: L'affrontement final (2006) and Red Riding Hood (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDk5NTQ2MV5BMl5BanBnXkFtZTcwMTM2NDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0435076","name":"Shauna Kain","idIMDB":"nm0435076"},"actorId":"nm0435076","character":"Roxanne","urlCharacter":"http://www.imdb.com/character/ch0460021","main":true},{"actorName":"Michael Hogan","urlProfile":"http://www.imdb.com/name/nm0389581","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTk1ODE0MV5BMl5BanBnXkFtZTcwMTc5MTM5Mg@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"height":"5' 11½\" (1.82 m)","bio":"Michael Hogan, a prospector's son, was born in Northern Ontario. He trained at the National Theatre School of Canada, where he met his future wife, actress Susan Hogan (nee King). They worked as a package until their their children, Jennie Rebecca Hogan (actress), Gabriel Hogan (actor), and Charlie Hogan (audience member), came along. Over the years, Hogan has appeared in countless plays, films, TV series, and radio dramas, and even an opera. Some of his favorite feature film experiences include La vengeance du loup (1991), with his good friend, Graham Greene, shot in the bush north of Lake Superior Road to Saddle River, shot in the Badlands of Alberta; Klondike Fever (1980), with Rod Steiger, Lorne Greene, Angie Dickinson and Gordon Pinsent, shot in and around Barkerville, B.C. in the winter; A Simple Curve (2005), shot in Slocan Valley, B.C. His most rewarding television experiences include his work on Jake and the Kid (1995), Monk (2002), African Skies (1992), La loi du colt (1997), Lifeline to Victory (1993), Nights Below Station Street (1997), _Secret in Giving (1999) (TV) (aka \"Calico Christmas\"), _For Those Who Hunt The Wounded Down (1996) (TV)_ and, of course, his all-time favorite, Battlestar Galactica (2004). Among his numerous live theater performances are the title role in \"Cowboy King\", performed on horseback at the Caravan Farm Theatre in the interior of B.C.; \"Biff Loman\" in \"Death of a Salesman\", then 19 years later, \"Willy Loman\" in the same play; \"Red Mango Blues\", a one-man show (with guitar virtuoso Harris Van Berkel), written by poet/playwright Charles Tidler; and \"Petruchio\" in \"Taming of the Shrew\", with wife Susan Hogan as \"Kate\". Hogan has performed on several radio shows, including \"Pocket City Blues\", a radio series about a blues DJ who stumbles into a different crime every week. Hogan's distinctive voice has also been heard over CBC Radio as the narrator of many books, poems, and short stories. His award nominations are numerous and include a Blizzard Award for Best Leading Actor (feature length) for his role in Nights Below Station Street (1997), from Manitoba Film; and a Genie for Best Supporting Actor (feature length) in Solitaire (1991). The Hogans live on an island with son Charlie, a couple of dogs, cats, bikes, skis, and a few kayaks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTk1ODE0MV5BMl5BanBnXkFtZTcwMTc5MTM5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0389581","name":"Michael Hogan","idIMDB":"nm0389581"},"actorId":"nm0389581","character":"The Reeve","urlCharacter":"http://www.imdb.com/character/ch0460022","main":true},{"actorName":"Adrian Holmes","urlProfile":"http://www.imdb.com/name/nm0391738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NzMyOTY2Ml5BMl5BanBnXkFtZTgwNzg2MjAzOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1974","placeOfBirth":" Wrexham, North Wales, UK","birthName":"Adrian Randolph Holmes","height":"6' (1.83 m)","bio":"Born in Wrexham, North Wales, Adrian Holmes is a descendant of Barbados, who grew up in Vancouver and now makes Vancouver and Los Angeles his home. With over 100 television credits including \"Arrow\" and the comedy \"Impastor\", one of his fan favorites was his recurring role of \"Basqat\" on the long running CW series, \"Smallville.\" Whether it be on television, big studio blockbusters or more independent productions, Holmes' is driven not only by telling a great story but one that allows him to really grow and show his versatility as an artist. His mantra of \"be ready so you don't have to get ready\" served him well in his initial audition for the 2011 feature \"Red Riding Hood.\" Director Catherine Hardwick (Twilight) spontaneously asked if he could do an African accent, Holmes delivered thus transforming his role of \"Captain.\" The film brought Holmes international recognition and allowed him the honor of working alongside one of his favorite actors, Gary Oldman. In 2013 Holmes got to collaborate with Matt Damon and Jodie Foster in the SyFy feature \"Elysium.\" Directed by Neill Blomkamp (District 9), Elysium illuminates how a segregated class system creates an unhealthy, unfair & unbalanced world. Now in their fourth season shooting in Montreal, Holmes' leads the cast of Bravo's critically acclaimed original series, \"19-2.\" Winning Best Drama at the Canadian Screen Awards, and most recently nominated for an International Emmy Award for Best Drama. It has been hailed by the press: The \"Huffington Post\" stated \"You will be on the edge of your seats, guaranteed.\" The Hollywood Reporter announced \"Rebooted Quebec drama '19-2' has breakthrough in English Canada.\" Yahoo Celebrity News proclaimed \"It's unlike anything you have seen on Canadian Television\" and the New York Times stated \"The series is in the tradition of shows like \"The Wire,\" portraying law enforcement less flashily and less noisily than others, and thus more accurately.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NzMyOTY2Ml5BMl5BanBnXkFtZTgwNzg2MjAzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0391738","name":"Adrian Holmes","nicknames":["Slice"],"idIMDB":"nm0391738"},"actorId":"nm0391738","character":"Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cole Heppell","urlProfile":"http://www.imdb.com/name/nm1877089","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODYyNjY3NV5BMl5BanBnXkFtZTcwMjA2MDUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1993","placeOfBirth":" Calgary, Alberta, Canada","height":"5' 8\" (1.73 m)","bio":"Cole Heppell was born on November 11, 1993 in Calgary, Alberta, Canada. He is an actor, known for Red Riding Hood (2011), The Fog (2005) and Diary of a Wimpy Kid (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODYyNjY3NV5BMl5BanBnXkFtZTcwMjA2MDUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1877089","name":"Cole Heppell","idIMDB":"nm1877089"},"actorId":"nm1877089","character":"Claude","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Willes","urlProfile":"http://www.imdb.com/name/nm0929794","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjg1NzkwN15BMl5BanBnXkFtZTgwNDM3NzIzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"One of Vancouver's top actors for 30 years, Christine has extensive experience in TV, stage and film. In 2008, she was nominated for a Leo award for her work as \"Gladys the DMV Demon\" in CW's hit comedy, Reaper (2007). She is internationally known as \"Delores Herbig\" in the Emmy-nominated TV series, Dead Like Me (2003). She will appear on the big screen in March, 2011 as \"Madame Lazar\" in Catherine Hardwicke's production of Red Riding Hood (2011) - the first studio picture to be directed by a woman, shot by a woman and starring a woman (Amanda Seyfried). She has won three Jessie Richardson theatre awards for excellence, and both produced and starred in Yasmina Reza's \"The Unexpected Man\", one of 2006's Top Ten in Vancouver. Recently, she has expanded her practice to include acting/coaching on such productions as Bionic Woman (2007) and Charlie St. Cloud (2010). Christine serves on the Executive Board of UBCP/ACTRA. She was elected national councilor by her peers in the fall of 2008, and is a fiery champion of women in the performing arts. Encouraged by her sisters at the National table, Christine became chair of the National Women's Committee in February, 2010. She has two great children, and is proud to call the West Coast of Canada home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjg1NzkwN15BMl5BanBnXkFtZTgwNDM3NzIzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0929794","name":"Christine Willes","idIMDB":"nm0929794"},"actorId":"nm0929794","character":"Madame Lazar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Shanks","urlProfile":"http://www.imdb.com/name/nm0788218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzc2NTE0NF5BMl5BanBnXkFtZTcwOTQ5OTQ1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1970","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Michael Garrett Shanks","height":"6' (1.83 m)","bio":"Michael Shanks was born on December 15, 1970 in Vancouver, British Columbia, Canada as Michael Garrett Shanks. He is an actor and director, known for Stargate SG-1 (1997), Elysium (2013) and Stargate: Continuum (2008). He has been married to Lexa Doig since August 2, 2003. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzc2NTE0NF5BMl5BanBnXkFtZTcwOTQ5OTQ1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0788218","name":"Michael Shanks","idIMDB":"nm0788218"},"actorId":"nm0788218","character":"Adrien Lazar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kacey Rohl","urlProfile":"http://www.imdb.com/name/nm3821782","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNzcwMDgwOF5BMl5BanBnXkFtZTgwNzgwNzkwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1991","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 5\" (1.65 m)","bio":"Kacey Rohl was born on August 6, 1991 in Vancouver, British Columbia, Canada. She is an actress and writer, known for Hannibal (2013), Wayward Pines (2015) and The Magicians (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNzcwMDgwOF5BMl5BanBnXkFtZTgwNzgwNzkwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3821782","name":"Kacey Rohl","idIMDB":"nm3821782"},"actorId":"nm3821782","character":"Prudence","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1486185","urlIMDB":"http://www.imdb.com/title/tt1486185","business":{"budget":{"money":"$42,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$14,005,335","country":"USA","day":"13","month":"03","year":"2011","remarks":"3,030 Screens"}],"gross":[{"money":"$37,652,565","country":"USA","day":"22","month":"05","year":"2011","remarks":""},{"money":"$37,611,987","country":"USA","day":"15","month":"05","year":"2011","remarks":""},{"money":"$37,522,748","country":"USA","day":"08","month":"05","year":"2011","remarks":""},{"money":"$37,395,241","country":"USA","day":"01","month":"05","year":"2011","remarks":""},{"money":"$37,186,013","country":"USA","day":"24","month":"04","year":"2011","remarks":""},{"money":"$36,942,432","country":"USA","day":"17","month":"04","year":"2011","remarks":""},{"money":"$36,678,750","country":"USA","day":"10","month":"04","year":"2011","remarks":""},{"money":"$35,592,341","country":"USA","day":"03","month":"04","year":"2011","remarks":""},{"money":"$32,424,769","country":"USA","day":"27","month":"03","year":"2011","remarks":""},{"money":"$25,895,514","country":"USA","day":"20","month":"03","year":"2011","remarks":""},{"money":"$14,005,335","country":"USA","day":"13","month":"03","year":"2011","remarks":""}],"weekendGross":[{"money":"$21,655","country":"USA","day":"22","month":"05","year":"2011","remarks":"50 Screens"},{"money":"$58,314","country":"USA","day":"15","month":"05","year":"2011","remarks":"100 Screens"},{"money":"$82,730","country":"USA","day":"08","month":"05","year":"2011","remarks":"156 Screens"},{"money":"$132,495","country":"USA","day":"01","month":"05","year":"2011","remarks":"209 Screens"},{"money":"$187,452","country":"USA","day":"24","month":"04","year":"2011","remarks":"308 Screens"},{"money":"$126,735","country":"USA","day":"17","month":"04","year":"2011","remarks":"248 Screens"},{"money":"$511,380","country":"USA","day":"10","month":"04","year":"2011","remarks":"777 Screens"},{"money":"$1,776,234","country":"USA","day":"03","month":"04","year":"2011","remarks":"1,788 Screens"},{"money":"$4,311,312","country":"USA","day":"27","month":"03","year":"2011","remarks":"2,715 Screens"},{"money":"$7,188,131","country":"USA","day":"20","month":"03","year":"2011","remarks":"3,030 Screens"},{"money":"$14,005,335","country":"USA","day":"13","month":"03","year":"2011","remarks":"3,030 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"07","year":"2010","remarks":null},{"money":null,"country":null,"day":"16","month":"09","year":"2010","remarks":null}],"copyrightHolder":"Warner Bros. Entertainment Inc."},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["SDDS","DTS","Dolby Digital","Datasat"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Millennium XL2, Panavision Primo and PCZ Lenses","Panavision Panaflex Millennium, Panavision Primo and PCZ Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (prints)"],"filmLength":["2,729 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak Vision3 250D 5207, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"5,4","metascore":"29","filmingLocations":[{"location":"Canadian Motion Picture Park Studios, Burnaby, British Columbia, Canada"}],"rated":"PG-13","awards":[{"award":"Costume Designers Guild Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated CDG Award","categories":[{"category":"Excellence in Fantasy Film","names":[{"name":"Cindy Evans","id":"nm0262639","role":null}]}]}]},{"award":"Houston Film Critics Society Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Worst Picture","names":[]}]}]},{"award":"Young Artist Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actor","names":[{"name":"Cole Heppell","id":"nm1877089","role":null}]},{"category":"Best Performance in a Feature Film - Supporting Young Actress","names":[{"name":"Bella King","id":"nm2949090","role":null}]},{"category":"Best Performance in a Feature Film - Young Actress Ten and Under","names":[{"name":"Megan Charpentier","id":"nm2743784","role":null}]}]}]}],"votes":"94 520","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0088354","name":"Appian Way"},{"idCompany":"co0310908","name":"Random Films"}],"keywords":{"keywords":["werewolf","love","death","forest","female director","f rated","werewolf bite","cult film","female protagonist","torture device","brazen bull","murder","title directed by female","mist","dumping dead body in lake","murder of grandmother","daughter murders father","killed by a werewolf","basket","hatchet","nightmare","sword","shot with an arrow","abuse of power","publicly disgraced","torture","scratched by werewolf","blood splatter","walking over hot coals","women dancing together","mask","party","severed hand","crossbow","stagecoach","wolf head","torch","snowing","log cabin","flash forward","white rabbit","rabbit trap","water bucket","narrated by character","winter","gothic horror","red moon","red hood","red cape","fairy tale","death of sister","bloody moon","arranged marriage","grandmother granddaughter relationship","character name in title","folk horror","three word title","color in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:09:30"}}