{"data":{"movies":[{"title":"No God, No Master","originalTitle":"","year":"2013","releaseDate":"20150819","directors":[{"name":"Terry Green","id":"nm0338372"}],"writers":[{"name":"Terry Green","id":"nm0338372"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NDgxNzEzOV5BMl5BanBnXkFtZTgwMDIxODMyMTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","History","Thriller"],"plot":"When a series of package bombs show up on the doorsteps of prominent politicians and businessmen in the summer of 1919, U.S. Bureau of Investigation Agent William Flynn (Strathairn) is assigned the task of finding those responsible. He becomes immersed in an investigation that uncovers an anarchist plot to destroy democracy. Inspired by true events of the 20s the film sets the stage for a timely thriller with resoundingly similar parallels to the contemporary war on terrorism and the role government plays to defeat it.","simplePlot":"When a series of package bombs show up on the doorsteps of prominent politicians and businessmen in the summer of 1919, U.S. Bureau of Investigation Agent William Flynn (Strathairn) is ... ","actors":[{"actorName":"David Strathairn","urlProfile":"http://www.imdb.com/name/nm0000657","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MjI5MDg2MF5BMl5BanBnXkFtZTcwNjgwNDM3NQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1949","placeOfBirth":" San Francisco, California, USA","birthName":"David Russell Strathairn","height":"5' 11½\" (1.82 m)","bio":"David Russell Strathairn was born on January 26, 1949 in San Francisco, California. He is the son of Mary Frances (Frazier), a nurse, and Thomas Scott Strathairn, Jr., a physician. He has two siblings, Tom and Anne. His ancestry includes English, Scottish, Irish, Portuguese, Native Hawaiian, and one sixteenth Chinese (the latter three from his paternal grandmother). Strathairn attended Williams College, where he demonstrated great interest in the theater, and first befriended John Sayles, with whom he would later frequently collaborate. Strathairn graduated college and traveled to Florida to visit with his grandfather, but the grandfather passed away while Strathairn was en route. Strathairn, finding himself freshly-arrived and without friends in Florida, decided instead to join the Ringling Brothers Clown College and subsequently worked as a clown for six months in a traveling circus. Relocating to New York State, he spent several years hitchhiking across America to work in local theaters during the summers. During one of these summers Strathairn reunited with Sayles, and this eventually resulted in his role in the highly regarded Return of the Secaucus Seven (1979), Sayle's directorial debut. Thereafter Strathairn developed an extensive resume of supporting roles, which became increasingly substantial as his stature in the industry grew; notable films include Lovesick (1983), Silkwood (1983), L.A. Confidential (1997), and A Map of the World (1999). Sayles frequently casts Strathairn, whose performances can be seen in Sayles' The Brother from Another Planet (1984), Matewan (1987), Eight Men Out (1988), City of Hope (1991), and Passion Fish (1992). Perhaps most notable of his collaborations with Sayles is his superb performance co-starring with Mary Elizabeth Mastrantonio in Limbo (1999). After a string of successful supporting roles in the early 2000s, Strathairn found himself thrust into the role of leading man with his performance as Edward R. Murrow in George Clooney's Good Night, and Good Luck. (2005) Taking on the role of the iconic newsman in the black-and-white drama, Strathairn garnered numerous award mentions including an Academy Award nomination for Best Actor. Following the success of that film, Strathairn traveled easily between low-budget independent films - The Notorious Bettie Page (2005), The Sensation of Sight (2006), My Blueberry Nights (2007), and Howl (2010) among them - and big-budget Hollywood productions, including We Are Marshall (2006), The Spiderwick Chronicles (2008), both The Bourne Ultimatum (2007) and The Bourne Legacy (2012), and Steven Spielberg's biopic Lincoln (2012), in which he plays Secretary of State William Seward. Strathairn has also worked extensively in television, and first became familiar to television viewers as the title character's boss in the series The Days and Nights of Molly Dodd (1987). In addition to narration work for many PBS shows, Strathairn has appeared in the TV series Big Apple (2001), The Sopranos (1999), Monk (2002), and heads the cast of the science-fiction series Alphas (2011). His work in television films has brought him an Emmy Award for Temple Grandin (2010) and an Emmy nominations for Hemingway & Gellhorn (2012). Strathairn married Logan Goodman in 1980, and the couple have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MjI5MDg2MF5BMl5BanBnXkFtZTcwNjgwNDM3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000657","name":"David Strathairn","idIMDB":"nm0000657"},"actorId":"nm0000657","character":"William Flynn","urlCharacter":"http://www.imdb.com/character/ch0175358","main":true},{"actorName":"Ray Wise","urlProfile":"http://www.imdb.com/name/nm0936403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTg0NDU5NF5BMl5BanBnXkFtZTcwNDQ5NTk3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1947","placeOfBirth":" Akron, Ohio, USA","birthName":"Raymond Herbert Wise","height":"5' 9½\" (1.77 m)","bio":"Raymond Herbert \"Ray\" Wise (born August 20, 1947) is an American actor. Some of his best-known roles include Leland Palmer in Twin Peaks (1990), henchman Leon C. Nash in RoboCop (1987), Jack Taggart Sr. in Jeepers Creepers II (2003), the Devil in the CW television series Reaper (2007), Donald Wadsworth in Suburban Gothic (2014). Wise was born in Akron, Ohio, graduated from Garfield High School in 1964 and attended Kent State University in Kent, Ohio. He is of Romanian descent on his mother's side.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTg0NDU5NF5BMl5BanBnXkFtZTcwNDQ5NTk3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936403","name":"Ray Wise","idIMDB":"nm0936403"},"actorId":"nm0936403","character":"A. Mitchell Palmer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Witwer","urlProfile":"http://www.imdb.com/name/nm1022429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjQzNDY1Ml5BMl5BanBnXkFtZTgwNjY2NTYyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1977","placeOfBirth":" Glenview, Illinois, USA","birthName":"Samuel Stewart Witwer","height":"6' 1\" (1.85 m)","bio":"Sam Witwer headlines the SyFy series, Being Human, the U.S. adaptation of the popular British television series. The darkly humorous, provocative drama stars Sam as the heroic, \"Aidan\", a sensual and brooding vampire. His excellent work was noticed soon after the show's premiere, as Sam received a Gemini Award nomination for Best Performance by an Actor in a Continuing, Leading Dramatic Role in 2011. Feature film fans remember Sam as the sacrificed \"Wayne Jessup\" in The Mist, Frank Darabont's adaptation of the Stephen King novella. Two independent features in which Sam stars await release: The Return of Joe Rich, starring opposite Armand Assante and Talia Shire and No God, No Master starring with David Strathairn and Edoardo Ballerini. A favorite in the science-fiction world, Sam began his career in the memorable role of \"Lt. Crashdown\" in SyFy's Battlestar Galactica and played \"Davis Bloom/ Doomsday\", the character fated to kill Superman, on CW's Smallville. Star Wars fans and the gaming community will also recognize Sam as Darth Vader's vengeful apprentice, \"StarKiller\" in the LucasArts' video game sensation Star Wars: The Force Unleashed (Parts One and Two). Through high-tech digital referencing and motion capture, Sam has become the voice and face of this LucasArts' creation in which the first title grossed over 500 million dollars. Sam has also done extensive voice work for the fan-favorite Clone Wars, the animated series airing on the Cartoon Network. Working opposite Jon Favreau and Clancy Brown as the voice of \"Darth Maul\" on Clone Wars, Sam received recognition with an Annie Award nomination for Best Voice Acting in an Animated Television/ Broadcast Production in 2012. Outside of sci-fi, audiences remember Sam in his recurring role of \"Neil Perry\" on the Emmy winning Showtime series Dexter. Sam's edge was a perfect compliment to the ground-breaking series in its first season. A Chicago native and a Juilliard-trained actor, Sam is also an accomplished musician who performed in the LA music scene with his band, The Crashtones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjQzNDY1Ml5BMl5BanBnXkFtZTgwNjY2NTYyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1022429","name":"Sam Witwer","nicknames":["Stewart"],"idIMDB":"nm1022429"},"actorId":"nm1022429","character":"Eugenio Ravarini","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alessandro Mario","urlProfile":"http://www.imdb.com/name/nm1501294","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzQ1NjUxMl5BMl5BanBnXkFtZTgwMjkyNzQ2MTE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1975","placeOfBirth":" Agrigento, Sicily, Italy","bio":"Widely known in his country for being the male lead in the famous cult Italian series 'Centovetrine', Alessandro Mario has recently portrayed the Italian anarchist Bartolomeo Vanzetti in the American feature film 'No God No Master' (2013) directed by Terry Green, where he played opposite the Oscar nominated actor David Strathairn. Inspired by true events of the 20's, the story includes depictions of the Sacco and Vanzetti case. Beside his film and television work, Alessandro is an accomplished stage lead actor and was directed, at the beginning of his career, by Giuseppe Patroni Griffi, considered one of the last maestros of Italian theatre. On stage every year Alessandro is used to perform works by Pirandello, Verga, Tenessee Williams, Molière, John Fante and Leonardo Sciascia. While at university in Rome, where he was studying modern literature, he attended drama classes and spent his summers touring Italy with a theatre group. After graduation he moved to New York to improve his English language and acting skills prior to performing Shakespeare, Pirandello and Arthur Miller back in Rome. Alessandro became a TV star in Italy while starring in 'Il Bello delle Donne' and playing the male lead in 'Centovetrine'. He acted in the movie 'Il Siero della Vanita' (The Vanity Serum) by Alex Infascelli, a story about the kidnapping of the Vips of Italian TV. For his role in Centovetrine Alessandro is the only actor ever awarded twice in a row with the 'Telegrolla', the Italian Emmy. Alessandro has since 2004 been Unicef ambassador for Moldavia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzQ1NjUxMl5BMl5BanBnXkFtZTgwMjkyNzQ2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1501294","name":"Alessandro Mario","idIMDB":"nm1501294"},"actorId":"nm1501294","character":"Bartolomeo Vanzetti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edoardo Ballerini","urlProfile":"http://www.imdb.com/name/nm0050737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDE5MjM4OF5BMl5BanBnXkFtZTcwNTQyMDk3Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1970","placeOfBirth":" Los Angeles, California, USA","height":"5' 9\" (1.75 m)","bio":"Edoardo Ballerini was born on March 20, 1970 in Los Angeles, California, USA. He is an actor and producer, known for The Sopranos (1999), Quarry (2016) and Dinner Rush (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDE5MjM4OF5BMl5BanBnXkFtZTcwNTQyMDk3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0050737","name":"Edoardo Ballerini","nicknames":["Edo"],"idIMDB":"nm0050737"},"actorId":"nm0050737","character":"Carlo Tresca","urlCharacter":"http://www.imdb.com/character/ch0156746","main":true},{"actorName":"James Madio","urlProfile":"http://www.imdb.com/name/nm0534944","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFiYzI3MGItMWFkNy00NWNkLWE5MzctNjk4NTJkNjA5YjBhXkEyXkFqcGdeQXVyODI1NzY3Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1975","placeOfBirth":" The Bronx, New York, USA","height":"5' 5\" (1.65 m)","bio":"Born and raised in the Bronx, New York. He is one of seven children. At the age of thirteen with his very first audition, James landed a role in the Steven Spielberg family adventure, Hook (1991) and never looked back. On the set of Hook, Dustin Hoffman was impressed enough with Madio's talent to suggest him for the role of his son in the film Hero (1992) The same year, he appeared as the younger version of the title character in the Independent film Mac (1992) starring John Turturro (in his directorial debut). Madio's big break as a young actor then came when he co-starred with Leonardo DiCaprio and Mark Wahlberg in the highly acclaimed film, The Basketball Diaries (1995) After a number of independent roles, Madio found himself once again, on another Spielberg set, this time as a lead cast member in the Emmy Award-Winning HBO series, Band of Brothers (2001). Portraying WWII hero Sgt. Frank Perconte. This would become a turning point in his career, putting him in the national and international spotlight in a timeless piece that continues to air today. Moreover, Madio continue to support troops by speaking at WWII Veteran engagements around the world. He recently co-starred in the Clint Eastwood film Jersey Boys (2014) Madio's career has extended to behind the camera, having acted, produced and written several award-winning independent projects (both features and shorts). His short film AppleBox (2011) (of which he wrote, produced and starred in) has racked up several wins across the country, which earned him 2 Best Actor awards. Other Independent works include, The Box (2007) which he co-produced, and Love Lies Bleeding (2008) starring Christian Slater. Searching for Bobby D (2005) West of Brooklyn (2008) Dough Boys (2008) and The Grasslands (2011). And most recently playing executed anarchist Nicola Sacco in the feature film No God, No Master (2013) While Madio recurred on CW's Ringer (2011), and has guest starred on Blue Bloods, Law & Order SVU, Castle, Bones, C.S.I: Miami, Cold Case and many others. His voice is also featured in the DreamWorks animated movie, _Shark Tale (2004)_ and on the Call of Duty video game franchise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFiYzI3MGItMWFkNy00NWNkLWE5MzctNjk4NTJkNjA5YjBhXkEyXkFqcGdeQXVyODI1NzY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534944","name":"James Madio","idIMDB":"nm0534944"},"actorId":"nm0534944","character":"Nicola Sacco","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mariana Klaveno","urlProfile":"http://www.imdb.com/name/nm1674570","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzNiOWQ2ZjYtNjAwYS00OThhLWI0MDQtZGE5ODRkOTcyYjVmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1979","placeOfBirth":" Endicott, Washington, USA","height":"5' 10\" (1.78 m)","bio":"Mariana Klaveno (b. 25th October) is an American actress best known for her role as Lorena in HBO's True Blood. She also starred in the feature film While the Children Sleep (released as The Sitter on DVD) in the role of Abby Read in 2007. She's guest starred in TV show episodes of Standoff, ER, and others. She appeared in the HBO Series True Blood, alongside Anna Paquin and Stephen Moyer, in the fifth episode of season one as the vampire Lorena, who turned Bill Compton into a vampire. Her character became a regular with starring credits in the second half of season two and into season three. She was nominated along with the starring cast of True Blood for the \"Outstanding Performance by an Ensemble in a Drama Series\" at the 16th Annual Screen Actors Guild awards in January 2010. Mariana Klaveno grew up in Endicott, Washington on the family owned and operated farm, with her three older siblings. After graduating valedictorian of her high school class, she pursued her B.A. in theatre at the University of Washington in Seattle. She trained there with Jon Jory, erstwhile Artistic Director of Actor's Theatre of Louisville. After graduating with honors, Mariana moved to Los Angeles and continued her training with noted acting coach, Cameron Thor. After a chance meeting with acclaimed Producer\\Director J.J.Abrams, he cast Mariana in Alias, her network television debut. However, it wasn't until her standout guest performance as a modern day Bonnie Parker on Standoff opposite Ron Livingston and Rosemarie DeWitt, that people really began to stop and take notice. Guest star roles followed on ER, K-Ville and Laws of Chance. She also starred in the television movie Final Approach (2007). For the 2010 LA Shorts Film Festival - held at Laemmle Sunset 5 Theaters on Sunset Blvd - Mariana was one of the judges, along with fellow True Blood co-star Carrie Preston. Mariana currently resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzNiOWQ2ZjYtNjAwYS00OThhLWI0MDQtZGE5ODRkOTcyYjVmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1674570","name":"Mariana Klaveno","idIMDB":"nm1674570"},"actorId":"nm1674570","character":"Louise Berger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean McNall","urlProfile":"http://www.imdb.com/name/nm2323938","urlPhoto":"","biography":{"bio":"Sean McNall is an actor, known for No God, No Master (2013) and Donovan Slacks (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2323938","name":"Sean McNall","idIMDB":"nm2323938"},"actorId":"nm2323938","character":"J. Edgar Hoover","urlCharacter":"http://www.imdb.com/character/ch0030565","main":true},{"actorName":"Mariann Mayberry","urlProfile":"http://www.imdb.com/name/nm0562246","urlPhoto":"","biography":{"bio":"Mariann Mayberry was born in Springfield, Missouri, USA. She is an actress, known for War of the Worlds (2005), Handsome Harry (2009) and Company (2003). She is married to Scott Jaeck.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0562246","name":"Mariann Mayberry","idIMDB":"nm0562246"},"actorId":"nm0562246","character":"Emma Goldman","urlCharacter":"http://www.imdb.com/character/ch0034692","main":true},{"actorName":"Paul Iacono","urlProfile":"http://www.imdb.com/name/nm1476591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjcwMTk4NV5BMl5BanBnXkFtZTgwODExMDYzNDE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1988","placeOfBirth":" Secaucus, New Jersey, USA","height":"5' 6\" (1.68 m)","bio":"A graduate of NYC's Professional Performing Arts High School, Iacono is best known for his portrayal of the title character on MTV's, \"The Hard Times of RJ Berger.\" Iacono was first featured on \"The Rosie O'Donnell Show,\" after she discovered his unique talents for impersonating Frank Sinatra and Ethel Merman, at age 8. Starting out as child actor in the NYC theater scene, Paul has appeared in over 100 theatrical productions, including Noël Coward's \"Sail Away\" at Carnegie Hall with Elaine Stritch and Marian Seldes, \"Mame\" opposite Christine Ebersole at the Papermill Play House and John Guare's \"Landscape of the Body\" at Signature Theater with Lili Taylor and Sherie Rene Scott. On the big screen, Paul starred in MGM's remake of \"Fame,\" \"No God, No Master\" with David Strathairn and Darren Stein's teen comedy, \"G.B.F.\" Upcoming films include Drew Barrymore's, \"Animal,\" \"Rhymes with Banana\" with Zosia Mamet and Judith Light, and \"Unreachable By Conventional Means,\" with Alexandra Daddario and Tovah Feldshuh. As a creator, Paul wrote and produced the NY play, \"Prince/Elizabeth,\" and is in development on his second pilot, \"GIF'ted.\" Paul is a Leukemia survivor, having been diagnosed in 1997. He works closely with the Leukemia and Lymphoma Society, helping raise hope and awareness for the disease. Iacono is openly gay and a major LGBTQ activist, having publicly come out in Michael Musto's Village Voice Column in April 2012. He was named one of OUT Magazine's 100 most influential gay, lesbian, bisexual, or transgender people for 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjcwMTk4NV5BMl5BanBnXkFtZTgwODExMDYzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1476591","name":"Paul Iacono","idIMDB":"nm1476591"},"actorId":"nm1476591","character":"Tony Cafiero","urlCharacter":"http://www.imdb.com/character/ch0463621","main":true},{"actorName":"Andrea Grano","urlProfile":"http://www.imdb.com/name/nm0335192","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWQ2MGUyZDQtMWFhZC00MWQzLWI0NjUtZmMwNGY3NGM0OGZiL2ltYWdlXkEyXkFqcGdeQXVyMDk2MTcyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Andrea Grano is an actress and producer, known for BFFs (2014), Planet of the Apes (2001) and 24 (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWQ2MGUyZDQtMWFhZC00MWQzLWI0NjUtZmMwNGY3NGM0OGZiL2ltYWdlXkEyXkFqcGdeQXVyMDk2MTcyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335192","name":"Andrea Grano","idIMDB":"nm0335192"},"actorId":"nm0335192","character":"Concetta Cafiero","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mario Di Donato","urlProfile":"http://www.imdb.com/name/nm0223790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTIzODY1N15BMl5BanBnXkFtZTgwOTI2NzY5OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Mario Di Donato is an actor, known for Se7en (1995), Bobby (2006) and Play the Game (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTIzODY1N15BMl5BanBnXkFtZTgwOTI2NzY5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0223790","name":"Mario Di Donato","idIMDB":"nm0223790"},"actorId":"nm0223790","character":"Vincenzo Brini","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Darlow","urlProfile":"http://www.imdb.com/name/nm0201436","urlPhoto":"","biography":{"bio":"David Darlow is an actor, known for The Fugitive (1993), Road to Perdition (2002) and High Fidelity (2000). He has been married to Rachel Silverman Darlow since April 3, 2006. He was previously married to Kristie Thatcher.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0201436","name":"David Darlow","idIMDB":"nm0201436"},"actorId":"nm0201436","character":"John D. Rockefeller Sr.","urlCharacter":"http://www.imdb.com/character/ch0220260","main":true},{"actorName":"Gino Sciortino","urlProfile":"http://www.imdb.com/name/nm3645090","urlPhoto":"","biography":{"bio":"Gino Sciortino is an actor, known for No God, No Master (2013), Days of Our Lives (1965) and Port Charles (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3645090","name":"Gino Sciortino","idIMDB":"nm3645090"},"actorId":"nm3645090","character":"Carlo Valdinoci","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alice Wedoff","urlProfile":"http://www.imdb.com/name/nm4624144","urlPhoto":"","biography":{"bio":"Alice Wedoff is an actress, known for No God, No Master (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4624144","name":"Alice Wedoff","idIMDB":"nm4624144"},"actorId":"nm4624144","character":"Mattie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1485761","urlIMDB":"http://www.imdb.com/title/tt1485761","business":{"budget":{"money":"$6,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Fuji Eterna 250D 8563, Eterna 500T 8573)"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.9","metascore":"48","filmingLocations":[{"location":"Milwaukee, Wisconsin, USA"}],"rated":"PG-13","awards":[{"award":"International Film Music Critics Award (IFMCA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for an Action/Adventure/Thriller Film","names":[{"name":"Nuno Malo","id":"nm1181838","role":null}]}]}]},{"award":"Stony Brook Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Special Recognition","categories":[{"category":"Opening Night Film","names":[{"name":"Terry Green","id":"nm0338372","role":"Director"},{"name":"Strata Productions","id":null,"role":null}]}]}]}],"votes":"618","type":"Movie","companyCreditsSimple":[{"idCompany":"co0093814","name":"Strata Productions"}],"keywords":{"keywords":["bombing","terror","package bomb","1919","art film","war on terror","fbi","politics","sacco and vanzetti","immigrant","dick cheney","political drama","repetition in title","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:30:12"}}