{"data":{"movies":[{"title":"Lucky","originalTitle":"","year":"2011","releaseDate":"20110715","directors":[{"name":"Gil Cates Jr.","id":"nm0146049"}],"writers":[{"name":"Kent Sublette","id":"nm1229014"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDM0MTcxN15BMl5BanBnXkFtZTcwMTAxNjk1NQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Ben Keller is sort of a bumbler who carries a torch for Lucy, a co-worker he's known since childhood. She's indifferent until he wins $36 million in the Iowa lottery; trouble is, he murdered the young woman who bought the ticket (it's not his first murder), but the mercenary Lucy doesn't discover Ben's secret until their honeymoon. She figures out that he murders women who look like her, so she's probably safe: she'd like to wait for the next lottery check to come in the mail, then run away. Ben knows she knows and wants her to love him anyway. With a police detective sniffing around and Ben's protective mother watching things carefully, can Lucy make a great escape?","simplePlot":"A wannabe serial killer wins the lottery and pursues his lifelong crush.","actors":[{"actorName":"Colin Hanks","urlProfile":"http://www.imdb.com/name/nm0004988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTcxNjIzM15BMl5BanBnXkFtZTcwNDI0NjMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1977","placeOfBirth":" Sacramento, California, USA","birthName":"Colin Lewes Dillingham","height":"6' 1½\" (1.87 m)","bio":"Colin Lewes Hanks is an American actor. He was born in Sacramento, California, to actors Samantha Lewes and Tom Hanks. Colin is best-known for his work as \"Jack Bailey\" in the series, The Good Guys (2010) and as \"Alex Whitman\" in Roswell (1999). Hanks' best-known film role may be in the teen movie, Orange County (2002), with Jack Black and John Lithgow. His best-known television role was \"Alex Whitman\", the love interest of Katherine Heigl in the science fiction series, Roswell (1999) between 1999 and 2001. Hanks also made an appearance in an episode of The O.C. (2003). He appeared in part eight of the HBO mini-series, Band of Brothers (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTcxNjIzM15BMl5BanBnXkFtZTcwNDI0NjMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004988","name":"Colin Hanks","idIMDB":"nm0004988"},"actorId":"nm0004988","character":"Ben Keller","urlCharacter":"http://www.imdb.com/character/ch0346667","main":true},{"actorName":"Ari Graynor","urlProfile":"http://www.imdb.com/name/nm0310966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk0NTQxNTMwOF5BMl5BanBnXkFtZTYwMjExNjcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1983","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Ariel Geltman Graynor","height":"5' 5\" (1.65 m)","bio":"Ari Graynor was born on April 27, 1983 in Boston, Massachusetts, USA as Ariel Geltman Graynor. She is an actress and producer, known for Mystic River (2003), Nick and Norah's Infinite Playlist (2008) and The Sitter (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk0NTQxNTMwOF5BMl5BanBnXkFtZTYwMjExNjcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0310966","name":"Ari Graynor","idIMDB":"nm0310966"},"actorId":"nm0310966","character":"Lucy St. Martin","urlCharacter":"http://www.imdb.com/character/ch0402549","main":true},{"actorName":"Ann-Margret","urlProfile":"http://www.imdb.com/name/nm0000268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzM1NjMyN15BMl5BanBnXkFtZTYwODg1OTQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1941","placeOfBirth":" Valsjöbyn, Jämtlands län, Sweden","birthName":"Ann-Margret Olsson","height":"5' 3½\" (1.61 m)","bio":"Actress and singer Ann-Margret is one of the most famous sex symbols and actresses of the 1960s and beyond. She continued her career through the following decades and into the 21st century. Ann-Margret was born Ann-Margret Olsson in Valsjöbyn, Jämtland County, Sweden, to Anna Regina (Aronsson) and Carl Gustav Olsson, who worked for an electrical company. She came to America at age 6. She studied at Northwestern University and left for Las Vegas to pursue a career as a singer. Ann-Margret was discovered by George Burns and soon afterward got both a record deal at RCA and a film contract at 20th Century Fox. In 1961, her single \"I Just Don't Understand\" charted in the Top 20 of the Billboard Hot 100 Charts. Her acting debut followed the same year as Bette Davis' daughter in Frank Capra's Pocketful of Miracles (1961). She appeared in the musical State Fair (1962) a year later before her breakthrough in 1963. With Bye Bye Birdie (1963) and Viva Las Vegas (1964) opposite Elvis Presley, she became a Top 10 Box Office star, teen idol and even Golden Globe nominated actress. She was marketed as Hollywood's hottest young star and in the years to come got awarded the infamous nickname \"sex kitten.\" Her following pictures were sometimes ripped apart by critics (Bus Riley's Back in Town (1965) and The Swinger (1966)), sometimes praised (The Cincinnati Kid (1965)). She couldn't escape being typecast because of her great looks. By the late 1960s, her career stalled, and she turned to Italy for new projects. She returned and, by 1970, she was back in the public image with Hollywood films (R.P.M. (1970) opposite Anthony Quinn), Las Vegas sing-and-dance shows and her own television specials. She finally overcame her image with her Oscar-nominated turn in Mike Nichols' Carnal Knowledge (1971) and succeeded in changing her image from sex kitten to respected actress. A near-fatal accident at a Lake Tahoe show in 1972 only momentarily stopped her career. She was again Oscar-nominated in 1975 for Tommy (1975), the rock opera film of the British rock band The Who. Her career continued with successful films throughout the late 1970s and into the 1980s. She starred next to Anthony Hopkins in Magic (1978) and appeared in pictures co-starring Walter Matthau, Gene Hackman, Glenda Jackson and Roy Scheider. She even appeared in a television remake of Tennessee Williams's masterpiece play \"A Streetcar Named Desire\" in 1983. Another late career highlight for her was Grumpy Old Men (1993) as the object of desire for Jack Lemmon and Walter Matthau. She continues to act in movies today.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzM1NjMyN15BMl5BanBnXkFtZTYwODg1OTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000268","name":"Ann-Margret","nicknames":["Slugger"],"idIMDB":"nm0000268"},"actorId":"nm0000268","character":"Pauline Keller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey Tambor","urlProfile":"http://www.imdb.com/name/nm0001787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQxMzA3NzQzM15BMl5BanBnXkFtZTcwMTQxMDc3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1944","placeOfBirth":" San Francisco, California, USA","birthName":"Jeffrey Michael Tambor","height":"6' 1\" (1.85 m)","bio":"An incisive talent when it comes to playing bent, off-the-wall characters, Jeffrey Tambor has been captivating audiences for nearly four decades. Tambor was born and raised in San Francisco, to Eileen (Salzberg) and Michael Bernard Tambor, a flooring contractor. His family is Ashkenazi Jewish (from Hungary and Ukraine). He studied acting at San Francisco State University and earned his Bachelors of Arts degree there. Following his Masters at Wayne State University, he started building up his resume in repertory theater. He was first seen on episodic TV in the mid-'70s in both comedies (Taxi (1978), Barney Miller (1974)) and dramas (Kojak (1973), Starsky and Hutch (1975)). A large, somewhat looming fellow, his sly-eyed look and leering gaze, matched with a bright set of pearly teeth and stark pattern baldness, made him a natural for broad, warped comedy. The folks at Three's Company (1976) brought Jeffrey back time and time again, standing toe-to-toe with John Ritter and stealing many of their scenes with his noticeably bizarre gents. Before his \"Three's Company\" guest roles, he co-starred in the show's spin-off The Ropers (1979) with Norman Fell and Audra Lindley. He and Patty McCormack played the Ropers' chagrined neighbors. On the legitimate stage, he has been an earnest player over the years with performances in \"Sly Fox\" and \"Glengarry Glen Ross\" on Broadway in addition to roles in \"Measure for Measure,\" \"A Flea in Her Ear\" and \"The Seagull.\" On the side, Jeffrey has directed a number of stage productions and teaches acting in the Los Angeles area. Although not as well known for his film work, he made a strong dramatic impression in his film debut ...and justice for all. (1979), in which he played Al Pacino's half-crazed law partner. He went on to enhance a number of other movies including The Dream Chasers (1984), Mr. Mom (1983), Brenda Starr (1989), Radioland Murders (1994), Doctor Dolittle (1998), Pollock (2000). More recently he played the Mayor of Whoville in How the Grinch Stole Christmas (2000). Emmy-nominated for his quirky work on The Larry Sanders Show (1992), Jeffrey's fondness and talent for the weird and wacky has recently found a nesting roost. Quite at home amid the insanity in the series Arrested Development (2003), he recently copped another Emmy nomination as the patriarch of the highly dysfunctional Bluth family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQxMzA3NzQzM15BMl5BanBnXkFtZTcwMTQxMDc3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001787","name":"Jeffrey Tambor","idIMDB":"nm0001787"},"actorId":"nm0001787","character":"Detective Harold Waylon","urlCharacter":"http://www.imdb.com/character/ch0346669","main":true},{"actorName":"Adam Harrington","urlProfile":"http://www.imdb.com/name/nm0364227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjU0NzQyNl5BMl5BanBnXkFtZTgwNjQ0ODg5OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1972","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Adam John Harrington","height":"6' 1\" (1.85 m)","bio":"Adam Harrington was born on November 26, 1972 in Hamilton, Ontario, Canada as Adam John Harrington. He is known for his work on Dexter (2006), Parks and Recreation (2009) and TURN: Washington's Spies (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjU0NzQyNl5BMl5BanBnXkFtZTgwNjQ0ODg5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364227","name":"Adam Harrington","idIMDB":"nm0364227"},"actorId":"nm0364227","character":"Steve Mason","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mimi Rogers","urlProfile":"http://www.imdb.com/name/nm0000211","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDUyNDQ3N15BMl5BanBnXkFtZTcwOTk0MTMwNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1956","placeOfBirth":" Coral Gables, Florida, USA","birthName":"Miriam Spickler","height":"5' 8½\" (1.74 m)","bio":"It's fair to say that after 20 years and over 50 film appearances, Mimi Rogers should be praised for her variety of roles and acting capabilities, not for a brief marriage to a Hollywood star. In the early 1980s she began to carve a niche for herself in Hollywood, appearing on television and in films. It was her role in Someone to Watch Over Me (1987) that got her noticed and was her springboard to stardom. Cemented by a marriage to Tom Cruise, an already established young actor, Mimi went on to appear in Hider in the House (1989), Desperate Hours (1990), and The Doors (1991). She appeared in a controversial movie analyzing religion in America, The Rapture (1991), which proved a hit and delighted audiences, creating many a debate over the film's subject material. She played a bored telephone exchange operator who swaps a sinful life of sex and swinging with other couples for a devout religious one, ending unexpectedly in disaster. Despite her successes, few meaty, interesting roles came her way in the '90s. Shooting Elizabeth (1992), opposite Jeff Goldblum, the family movie Mon ami Dodger (1994), Far from Home: The Adventures of Yellow Dog (1995), and Full Body Massage (1995) were just a few of the films that she appeared in. Working consistently, she rejuvenated her career in the unexpected hit Austin Powers: International Man of Mystery (1997), playing Miss Kensington, an attractive female agent of 1960s London and the mother of Elizabeth Hurley's character. Next, Mimi was seen in the big-screen remake of the '60s sci-fi TV series Lost in Space (1998) and several guest appearances on the hugely popular television series The X-Files (1993), playing a scheming FBI agent. A role in the Canadian indie-horror Ginger Snaps (2000) did her career no harm. Soon, she was opposite Geena Davis in The Geena Davis Show (2000) from 2000-01 and playing an extremely rich Manhattan socialite in the direct-to-video Cruel Intentions 2 (2000). More recently Mimi has appeared on cable television, including leading roles in Charms for the Easy Life (2002) (which she also executive produced) and Le coeur enseveli (2003) (a true-life disaster drama in which she played the Chief Superintendent of a mine). In 2004, she gave a revealing performance in The Door in the Floor (2004), a critical success. The Loop (2006), a Chicago-based sitcom, will soon be airing in America, featuring Mimi as a flirtatious office worker. Also in 2006, Mimi will be appearing in an original horror film, Penny Dreadful (2006), playing a psychiatrist in peril. In 2003, she married her longtime partner Chris Ciaffa, with whom she has a son and a daughter. A poker novice, Mimi also travels around competing in tournaments, some televised.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDUyNDQ3N15BMl5BanBnXkFtZTcwOTk0MTMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000211","name":"Mimi Rogers","idIMDB":"nm0000211"},"actorId":"nm0000211","character":"Ms. Brand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allison Mackie","urlProfile":"http://www.imdb.com/name/nm0533492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDE1MjEyMF5BMl5BanBnXkFtZTgwNDE2NDI5MjE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1960","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Allison P. Mackie","height":"5' 5½\" (1.66 m)","bio":"Allison Mackie was born on January 25, 1960 in Philadelphia, Pennsylvania, USA as Allison P. Mackie. She is an actress, known for Péché originel (2001), Those People (2015) and Sliver (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDE1MjEyMF5BMl5BanBnXkFtZTgwNDE2NDI5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533492","name":"Allison Mackie","idIMDB":"nm0533492"},"actorId":"nm0533492","character":"Grace","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Amandes","urlProfile":"http://www.imdb.com/name/nm0023885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZlZTMzZWQtZDAzMC00OWRhLTlhNDktY2U5ZWZhMDhkZWY5L2ltYWdlXkEyXkFqcGdeQXVyNDU3ODM0Nw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1959","placeOfBirth":" Chicago, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Tom grew up in the small towns of Richmond and Crystal Lake, Illinois. He began performing at home, with his 10 brothers and sisters, creating puppet shows, short films, music and radio dramas, before moving on to school plays and community theater. He graduated from The Goodman School of Drama, as it became the Theatre School at DePaul University. His work on the Chicago stage began in the ensemble of the \"Body Politic Theatre\", where he starred in such memorable productions as \"Translations\", \"The Playboy of the Western World\" and \"Falstaff & Hal\". Other notable stage work includes \"What the Butler Saw\", \"Candida\" and \"The Mystery Cycle\" at the Court Theatre, and \"Free Advice from Prague\" and \"The Courtship of Carl Sandburg\" at Northlight. Tom was head writer and announcer of the NPR musical variety show, \"The Flea Market\". He directed plays for the Curious Theater, played music with both Balderdash and Jamie O'Reilly & The Rogues, and was artistic director of the Call to Action Theater. While working on-stage in Chicago, Tom was cast as \"Eliot Ness\" in the television series, The Untouchables (1993) and spent two years shooting on his home turf. Moving to L.A., Tom starred in the NBC comedy, The Pursuit of Happiness (1995), with Melinda McGraw and Brad Garrett. He's played recurring roles on Big Love (2006), Boston Legal (2004), Eli Stone (2008), The Guardian (2001), Spin City (1996), From the Earth to the Moon (1998) and, most recently, Parenthood (2010). Other favorite TV work include Grey's Anatomy (2005), Curb Your Enthusiasm (2000), Just Shoot Me! (1997), ER (1994) and The Larry Sanders Show (1992). Traveling to the western Rockies, Tom spent four years portraying the beloved \"Dr. Harold Abbott\" on the family drama, Everwood (2002), opposite Treat Williams. He went on to direct episodes of \"Everwood\" as well as ABC's Brothers & Sisters (2006) and the new CW series, Hart of Dixie (2011). Tom's film credits include The Long Kiss Goodnight (1996), opposite Geena Davis, Brokedown Palace (1999) with Claire Danes and Kate Beckinsale, Billboard Dad (1998) with the Olsen twins, Mary-Kate Olsen and Ashley Olsen', Second Chances (1998), Straight Talk (1992), HBO's Live from Baghdad (2002) and the recent black-comedy, Lucky (2011), with Colin Hanks and Ari Graynor. His work on the Chicago stage continues at the Victory Gardens Theater, where he's starred, most recently, in \"Cynical Weathers\" and Edward Albee's \"At Home At The Zoo\", both directed by Dennis Zacek. Tom plays \"Dr. Peter Pelikan\" on the hit NBC series, Parenthood (2010), opposite Ray Romano. He stars as \"President Abraham Lincoln\" in the Salvador Litvak film, Saving Lincoln (2013), alongside Penelope Ann Miller and Lea Coco. He also appears as \"Governor Samuel Reston\" on the ABC political thriller, Scandal (2012), opposite Kerry Washington and Tony Goldwyn. Tom is married to actress Nancy Everhard, who played \"Katherine Ness\" on The Untouchables (1993). His daughters, Meg O'Reilly Amandes and Nia O'Reilly Amandes make up two-thirds of the Chicago band, \"Midnight Moxie\". And his son, Ben Amandes, is himself a budding hyphenate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZlZTMzZWQtZDAzMC00OWRhLTlhNDktY2U5ZWZhMDhkZWY5L2ltYWdlXkEyXkFqcGdeQXVyNDU3ODM0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0023885","name":"Tom Amandes","idIMDB":"nm0023885"},"actorId":"nm0023885","character":"Jonathan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Davidson","urlProfile":"http://www.imdb.com/name/nm2976354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ4MTM0MTAxMF5BMl5BanBnXkFtZTgwNzQyNjEyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Michelle Davidson is known for roles in the feature films \"Lucky,\"\"Last Ounce of Courage\" and \"Nailbiter.\" Drawing from her experience as a news anchor and reporter, she can be seen in \"Halt and Catch Fire\" (AMC) and \"Boss\"(Starz). Michelle wrote, directed and produced the Mid-America Emmy Award winning comedic short film \"A Senior Moment,\"also recognized with a Celtx Seed Grant. She co-wrote the thriller \"Enclosure\" with director and frequent collaborator Patrick Rea.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ4MTM0MTAxMF5BMl5BanBnXkFtZTgwNzQyNjEyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2976354","name":"Michelle Davidson","idIMDB":"nm2976354"},"actorId":"nm2976354","character":"Leslie Singer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivia Sather","urlProfile":"http://www.imdb.com/name/nm3854069","urlPhoto":"","biography":{"bio":"Olivia Sather is an actress, known for Lucky (2011), Life at Grandpa's (2009) and Sun for Sorrow (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3854069","name":"Olivia Sather","idIMDB":"nm3854069"},"actorId":"nm3854069","character":"Shannon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Kirchberger","urlProfile":"http://www.imdb.com/name/nm1702615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE0NjQ2MDQ0NV5BMl5BanBnXkFtZTcwMzM4MDU3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Eric Kirchberger is an actor, known for Lucky (2011), I'll Believe You (2006) and Wild Girls Gone (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE0NjQ2MDQ0NV5BMl5BanBnXkFtZTcwMzM4MDU3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1702615","name":"Eric Kirchberger","idIMDB":"nm1702615"},"actorId":"nm1702615","character":"Sunny Mart Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heather Marie Marsden","urlProfile":"http://www.imdb.com/name/nm0915574","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjk2MDAzNF5BMl5BanBnXkFtZTgwNTU3NDIzNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3½\" (1.61 m)","bio":"Adventurous and beautiful with an effervescent personality, Heather Marie Marsden is a native Detroiter. The fifth child of her fathers, and the first of her mother's, she grew up with the love of the performing arts. She began dancing at 3, playing cello at 7, and later played in the Detroit Civic Symphony Orchestra. Starting at 13, she had the lead in many regional plays, and at the age of 17, toured the United States with the National Tour of \"Sweet Charity\". Her friends still tease her about getting a fake I.D. not to buy drinks, but to be able to work professionally, while \"underage\". She then lived in the East Village in New York, where she sang for tips at a coffee house. Shortly thereafter, Heather's desire to act full time drove her to move to Los Angeles and begin acting in numerous hit television series and films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjk2MDAzNF5BMl5BanBnXkFtZTgwNTU3NDIzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915574","name":"Heather Marie Marsden","idIMDB":"nm0915574"},"actorId":"nm0915574","character":"Allison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan McClure","urlProfile":"http://www.imdb.com/name/nm2901078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2YjJhODktODhlMi00M2UxLTlhZWQtNDQ3NjhlYThhZjU5XkEyXkFqcGdeQXVyMTgyNDUwODY@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Bryan McClure is known for his work on Hawaii Five-0 (2010), Space Command (2016) and Lucky (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2YjJhODktODhlMi00M2UxLTlhZWQtNDQ3NjhlYThhZjU5XkEyXkFqcGdeQXVyMTgyNDUwODY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2901078","name":"Bryan McClure","idIMDB":"nm2901078"},"actorId":"nm2901078","character":"Sandwich Guy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bennett Wright","urlProfile":"http://www.imdb.com/name/nm3899166","urlPhoto":"","biography":{"bio":"Bennett Wright is an actor, known for Lucky (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3899166","name":"Bennett Wright","idIMDB":"nm3899166"},"actorId":"nm3899166","character":"8 year old Ben","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lena Noel Krussel","urlProfile":"http://www.imdb.com/name/nm3589916","urlPhoto":"","biography":{"bio":"Lena Noel Krussel is an actress, known for The Scientist (2010) and Lucky (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3589916","name":"Lena Noel Krussel","idIMDB":"nm3589916"},"actorId":"nm3589916","character":"8 year old Lucy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1473397","urlIMDB":"http://www.imdb.com/title/tt1473397","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.4","metascore":"41","filmingLocations":[{"location":"9926 Fieldcrest Dr, Omaha, Nebraska, USA"}],"rated":"R","awards":[],"votes":"3,210","type":"Movie","companyCreditsSimple":[{"idCompany":"co0259260","name":"Ten/Four Pictures"},{"idCompany":"co0248518","name":"Tax Credit Finance"},{"idCompany":"co0291625","name":"Mirabelle Pictures"}],"keywords":{"keywords":["lottery","murder","serial killer","police detective","honeymoon","seeing dead people","swimming pool","buried","buried body","prison","confession","pet bird","cheque","pistol","shot to death","blonde","lottery winner","hiding under a bed","hawaii","f word","digging","office romance","office affair","mother son relationship","one word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:46:49"}}