{"data":{"movies":[{"title":"Loosies","originalTitle":"","year":"2011","releaseDate":"20111109","directors":[{"name":"Michael Corrente","id":"nm0180912"}],"writers":[{"name":"Peter Facinelli","id":"nm0004906"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMzY5MjMxMl5BMl5BanBnXkFtZTcwOTM5MjY2Ng@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Comedy","Crime","Romance"],"plot":"A young pickpocket in the New York subways, living a fast, free, lifestyle is confronted by a woman whom he had a one night affair with, she informs him that she is now pregnant with his child, he must now choose between continuing the lifestyle he lead or take responsibility for his actions.","simplePlot":"A young pickpocket in the New York subways, living a fast, free, lifestyle is confronted by a woman with whom he had a one night affair.","actors":[{"actorName":"Peter Facinelli","urlProfile":"http://www.imdb.com/name/nm0004906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0ZDkwODctM2QxMi00ODJlLWI2ODMtYjc3MjFlZWFjYjY0L2ltYWdlXkEyXkFqcGdeQXVyNzEwNjQwMTY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1973","placeOfBirth":" Queens, New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Peter Facinelli was born in Queens, New York, the youngest child of Bruna (Reich) and Pierino Facinelli, a waiter. His parents are Italian immigrants, originally from Trentino, Northern Italy. He has three sisters. Peter was educated at St. Francis Preparatory School in Fresh Meadows, New York, and went on to attend St. John's University, but left after a year to follow his interest in acting at the Atlantic Theater Company Acting School, also in New York. There Facinelli was taught by such distinguished actors as Academy Award nominees William H. Macy and Felicity Huffman. He made his screen debut in 1995, appearing in Rebecca Miller's Angela (1995) and has worked consistently ever since. Notable projects include The Price of Love (1995), An Unfinished Affair (1996) (where he met his future wife, Jennie Garth), Touch Me (1997) and The Scorpion King (2002). Facinelli has also had re-occurring roles in such TV shows such as Fastlane (2002), Six Feet Under (2001), Damages (2007) and Nurse Jackie (2009). In 2008, he won the role of Dr. Carlisle Cullen in the wildly popular Twilight (2008) and its sequels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0ZDkwODctM2QxMi00ODJlLWI2ODMtYjc3MjFlZWFjYjY0L2ltYWdlXkEyXkFqcGdeQXVyNzEwNjQwMTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004906","name":"Peter Facinelli","idIMDB":"nm0004906"},"actorId":"nm0004906","character":"Bobby Corelli","urlCharacter":"http://www.imdb.com/character/ch0295966","main":true},{"actorName":"Jaimie Alexander","urlProfile":"http://www.imdb.com/name/nm1526352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzAzMzQyNl5BMl5BanBnXkFtZTgwMTU3OTA2MDE@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1984","placeOfBirth":" Greenville, South Carolina, USA","birthName":"Jaimie Lauren Tarbush","height":"5' 9\" (1.75 m)","bio":"Jaimie Alexander was born in Greenville, South Carolina, but moved with her family to Grapevine, Texas, when she was four years old. She took theatre classes in grade school as a hobby but was kicked out in high school because she could not sing, and so she took up sports instead. At age 17 she substituted for a friend at a meeting with a scouting agency and she met her manager, Randy James, who sent her some scripts. After graduating from high school she moved to Los Angeles, California, to pursue acting. Her career was launched in 2003 when she was cast in the leading role of Hanna Thompson in the low-budget award-winning film The Other Side (2006). According to the DVD commentary, she was originally at the audition to help out by reading against the male actors, but director Gregg Bishop decided to cast her in the leading role after hearing her perform the lines. Her second role was in 2004 in Squirrel Trap (2004), in which she played the co-lead role of Sara. A year later she was cast as Jessi XX on the ABC Family series Kyle XY (2006), in which she played the role of a superhuman being created by scientists as a laboratory experiment. She was nominated for the Saturn Awards as \"Best Supporting Actress on Television\" for that role in 2008. Her biggest role came in 2011, when she was cast as Lady Sif, a warrior goddess of Asgard, in the blockbuster from Marvel Comics, Thor (2011). She later reprised her role in its sequel, Thor: The Dark World (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzAzMzQyNl5BMl5BanBnXkFtZTgwMTU3OTA2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1526352","name":"Jaimie Alexander","nicknames":["James"],"idIMDB":"nm1526352"},"actorId":"nm1526352","character":"Lucy Atwood","urlCharacter":"http://www.imdb.com/character/ch0416090","main":true},{"actorName":"Michael Madsen","urlProfile":"http://www.imdb.com/name/nm0000514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODA5NzY2N15BMl5BanBnXkFtZTYwNjc3NTI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1958","placeOfBirth":" Chicago, Illinois, USA","birthName":"Michael Soren Madsen","height":"6' 2\" (1.88 m)","bio":"Michael Madsen's long career spans 25 years and more than 170 films in which he has played memorable characters in myriad box office hits, including: Kill Bill: Vol. 1 (2003), Kill Bill: Vol. 2 (2004) Sin City (2005), Hell Ride (2008), Die Another Day (2002), Donnie Brasco (1997), Species (1995), The Getaway (1994), Thelma & Louise (1991), and Free Willy (1993). Michael is notably recognized for his role as Mr. Blonde, in Quentin Tarantino's Reservoir Dogs (1992). Michael was born in Chicago, Illinois, to Elaine Madsen (née Melson), an Emmy-winning writer, producer, and poet, and Calvin Madsen, a firefighter. He is the brother of actress Virginia Madsen. His paternal grandparents were Danish. In recent years, Madsen has received Best Actor awards for his role in the Irish boxing film Strength and Honour, from the New York International Film Festival, the Boston Film Festival and the Downtown Los Angeles Film Festival. Madsen received the Golden Dolphin Award at the 25th Festroia Festival in Portugal, an award also given to veterans Kirk Douglas and Robert Mitchum. In 2012, Madsen was named President of the first annual Champs Elysees Film Festival in France which honored producer Harvey Weinstein. Recent television appearances include guest starring roles on The Mob Doctor (2012), Golden Boy (2013)and Blue Bloods (2010). Madsen is well recognized as an accomplished poet. His first book \"Burning In Paradise\" with a Foreword by Dennis Hopper, won the Independent Firecracker Award and was later translated into Norwegian. He has a world-wide following with his work, honored at International Poetry Festivals in Genoa, Italy and Mexico . He was recently the Guest of Honor at the Crossing Border Festival in Netherlands. His \"The Complete Poetic Works\" is an international bestseller. This was followed by his \"Signs of Life\" dedicated to Chris Penn. This unique work combined his new poetry with his own original photography. His next book of poetry \"American Badass\"was dedicated to the memory of the late David Carradine, his friend and Kill Bill co-star. His newest book \"Expecting Rain\" has a Foreword by Jerry Hopkins.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODA5NzY2N15BMl5BanBnXkFtZTYwNjc3NTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000514","name":"Michael Madsen","idIMDB":"nm0000514"},"actorId":"nm0000514","character":"Lt. Nick Sullivan","urlCharacter":"http://www.imdb.com/character/ch0295967","main":true},{"actorName":"Vincent Gallo","urlProfile":"http://www.imdb.com/name/nm0001252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0NzkzMDMwM15BMl5BanBnXkFtZTYwNjgyNTQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 April 1961","placeOfBirth":" Buffalo, New York, USA","height":"5' 11\" (1.8 m)","bio":"Vincent Gallo. American-born, Buffalo, New York, 1961. Left home, moved to New York City in 1978, and began playing in the experimental musical group, Gray, with artist Jean Michel Basquiat. After leaving Gray, he formed the band, Bohack, and recorded the highly regarded avant-garde industrial noise album, \"It Took Several Wives\". During the same period, Gallo also became known in New York City for his very unusual street performances, which were spontaneously executed in public and also witnessed by invited guests in the know. The One-Armed Man, The Man with No Face, Sandman, Boy Hit by a Car, and Boy Cries in Restaurant Window, to name a few. These radical public performances were upsetting and disturbing and were meant to provoke thought, self-reflection and consciousness. Gallo's invited guests could witness his performance's impact in this larger public context. One invited guest, New York Underground filmmaker, Eric Mitchell, cast Gallo as the lead in his film, The Way It Is (1985), alongside newcomer Steve Buscemi. The Way It Is (1985) was Gallo's first appearance in a feature-length film, though previously he had directed himself in several short films, including If You Feel Froggy, Jump (1986), The Gunlover (1986) and Rocky 10, as well as the collaborations with filmmaker Michael Holman, Vincent Gallo as \"Jesus Christ\" (used in Julian Schnabel's Basquiat (1996)) and Vampire LeStat. Since his early performance art days, Gallo has continued to create very conceptual performance pieces. Examples are a series of protesting of protests. Gallo has also created his own website, which upon closer examination, is actually a highly conceptual artwork resonating with his early performance work. On his website www.vincentgallo.com in the merchandise section, Gallo is selling his sperm and sexual fantasies as conceptual works. Gallo's Internet art questions celebrity, procreation, ego, social agenda, and views of religion, race and sexuality. These public offerings are motivated by extreme sensitivity, concept and thoughtfulness, however their presentation appears crude and offensive. Misinterpretation of this work is common and Gallo is often incorrectly categorized as a racist, sexist, homophobe. Gallo has had over 25 one-man shows of his paintings, including several with famed New York art dealer, Annina Nosei, and 4 museum shows including one at the Hara Museum in Tokyo, Japan. Gallo has also released several musical albums including 2 on the prestigious Warp Records label-When and Recordings of Music for Film. Gallo wrote, composed and performed the original music for the films Buffalo '66 (1998), The Agent (1990) and Promises Written in Water (2010). In the 1980s, Gallo reached the professional level of Grand Prix motorcycle racing, though he did not win a national championship. Gallo is one of the actual motorcycle riders in his feature film, The Brown Bunny (2003). For many years, Gallo has been known and highly respected in hi-fi and music recording circles and is considered by many professionals in the field as having world-class knowledge and experience. He has been published many times by specialty magazines focused on high fidelity designs and equipment as well as music recording techniques and equipment. His collection of vintage hi-fi and recording gear, as well as musical instruments, is amongst the largest and most refined in the world. Gallo is also a fanatic record collector, owning over 35,000 vinyl LP's. Gallo has no agent, manager, assistant or intern and he makes his films without producers, and with extremely scaled down crews. He has self-distributed his movies and is directly involved in his films' sales for distribution. Gallo has also created all of his films' trailers and posters. Gallo is one of the most misunderstood, misquoted, misrepresented talents in the past 25 years and a brief review of his IMDb page suggests he has also been incredibly prolific. In the summer of 2011, under much secrecy, Gallo began co-directing the independent fantasy, Ape (2012), alongside long-time collaborator, Joel Potrykus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0NzkzMDMwM15BMl5BanBnXkFtZTYwNjgyNTQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001252","name":"Vincent Gallo","nicknames":["Vinnie"],"idIMDB":"nm0001252"},"actorId":"nm0001252","character":"Jax","urlCharacter":"http://www.imdb.com/character/ch0118493","main":true},{"actorName":"William Forsythe","urlProfile":"http://www.imdb.com/name/nm0001235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTkxMTMwM15BMl5BanBnXkFtZTYwNzkyNDMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1955","placeOfBirth":" Bedford-Stuyvesant, Brooklyn, New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Dynamically entertaining heavyset US actor with piercing eyes, William Forsythe has a superb talent for playing some truly unlikeable and downright nasty characters that dominate the films in which he appears! If you're cast as the \"hero\" against Forsythe's \"villain\", then you have your work cut out for you, as Forsthye's raw energy and menace on screen is second to none. He started out in a couple of minor film roles and guest appearance's in high-rated TV shows including CHiPs (1977), Hill Street Blues (1981) and T.J. Hooker (1982). He quickly moved into high-quality feature films, including playing a small-time hoodlum in Il était une fois en Amérique (1984), an hilariously funny performance as a bumbling jail escapee alongside John Goodman in the knockout Raising Arizona (1987) and as a renegade soldier in Extreme Prejudice (1987). The energetic Forsythe portrayed comic book villain \"Flattop\" in Dick Tracy (1990), was foolish enough to tangle with vengeful cop Steven Seagal in the hyper-violent Out for Justice (1991) and locked horns with ex-NFL linebacker Brian Bosworth in the biker action film Stone Cold (1991). With his expertise in playing icy villains, Forsythe was perfect to portray Prohibition mobster Al Capone in the short-lived '90s revival of the classic '60s crime show, The Untouchables (1993), and he continued the motif of playing edgy, nefarious individuals in the thought-provoking The Waterdance (1992), the oily film noir piece Things to Do in Denver When You're Dead (1995), as real-life mobster Sammy Gravano, aka \"The Bull\", in Gotti (1996) and supporting another ex-NFL player's foray into film acting, when L.A. Raider Howie Long debuted in Firestorm (1998). Forsythe has remained perpetually busy in the new century with a plethora of feature film, telemovie and TV series appearances, and developing a minor cult following amongst film fans for his attention grabbing dramatic skills - check out his performances in City by the Sea (2002), The Devil's Rejects (2005) and Halloween (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTkxMTMwM15BMl5BanBnXkFtZTYwNzkyNDMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001235","name":"William Forsythe","nicknames":["Bill"],"idIMDB":"nm0001235"},"actorId":"nm0001235","character":"Captain Tom Edwards","urlCharacter":"http://www.imdb.com/character/ch0295968","main":true},{"actorName":"Marianne Leone","urlProfile":"http://www.imdb.com/name/nm0502906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMTY1NTY2MV5BMl5BanBnXkFtZTcwOTQ3ODcwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1952","placeOfBirth":" Boston, Massachusetts, USA","bio":"Marianne Leone was born on January 2, 1952 in Boston, Massachusetts, USA. She is an actress, known for Goodfellas (1990), Joy (2015) and The Three Stooges (2012). She has been married to Chris Cooper since July 8, 1983. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMTY1NTY2MV5BMl5BanBnXkFtZTcwOTQ3ODcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502906","name":"Marianne Leone","idIMDB":"nm0502906"},"actorId":"nm0502906","character":"Rita Corelli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christy Carlson Romano","urlProfile":"http://www.imdb.com/name/nm0005579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzQyMjQ3OF5BMl5BanBnXkFtZTcwODc0MzgyMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1984","placeOfBirth":" Milford, Connecticut, USA","birthName":"Christy Michelle Romano","height":"5' 7\" (1.7 m)","bio":"Television + Film Romano has had a long relationship with Disney ABC Television Group by starring in hit series and movies for the Disney Channel and ABC Family including: Cadet Kelly, The Even Stevens franchise, Campus Confidential, Taking Five, The Cutting Edge 2: Going for the Gold, and The Cutting Edge 3: Chasing the Dream. Various other TV appearances include MTV's Kaya, NBC'S Joan of Arcadia, CW's Summerland, and TNT's HawthoRNe. At twelve, she made her feature film debut in Woody Allen's Everyone Says I Love You. She continued acting in independent films with famed directors Hal Hartley in Henry Fool and Martin Davidson in Looking for an Echo. Romano's most recent feature films include Loosies (IFC), Mirrors II (20th Cent. FOX), Where Fate Meets (Lifetime), Bear With Us, and Wes Craven's The Girl in the Photographs. Romano has further branched off in the industry after obtaining a BFA in Film Studies from Columbia University. She has directed two short films, and a music video, which has amassed almost 2 million views on YouTube and was selected in the 2012 Los Angeles Shorts Film Festival. Her production company, Interstitial Productions, has completed its first dramatic feature, Prism (2015), and is in pre-production for a documentary about child labor within the entertainment industry called Looking Ahead. Voice Work Romano became the first person to act in three Disney Channel projects simultaneously. Supplementing her on-camera work on Even Stevens, where she co-starred with Shia LaBeouf, she voiced the title animated character in Kim Possible. Romano's voice was nominated for a Daytime Emmy and the show inspired an adventure ride at Disney's Epcot, as well as two Disney Channel original movies. She originated the voice of 'Yuffie Kisaragi' in the English version of Final Fantasy VII Advent Children, as well as in the Disney/Square game Kingdom Hearts. She has continued success as a voice actor on shows like Family Guy and The Penguins of Madagascar and films like Casper's Scare School and The Legends of Secret Pass. She has done scratch vocal work for Mila Kunis in To Hell and Back and voiced 'Black Cat' and 'Black Widow' in a recent Marvel video game. She can also be heard on many Audible audiobook titles such as: Sweet, Kaleidoscope Hearts, The Mara Dyer Trilogy, The Dragonfly Series, Cuckoo's Child, Bat Six, Connie B. Jones, My Heartbeat, Pop Princess and her own book Grace's Turn (available via iTunes). She is also the voice of Disney's Scene it: Deluxe Edition. Christy's singing voice can be heard on the recording soundtracks of Everyone Says I Love You, Parade, Kim Possible: A Stitch in Time, Disney's Teachers Pet, and Disney's Princess Diaries 2. Her solo album 'Christy Carlson Romano Greatest Movie & TV Hits' was released by Disney Records. She was briefly signed to Atlantic records and toured with Raven and Hilary Duff. Musical Theater At six years old Christy was cast in several national tours of Broadway musicals, including Annie, The Will Rogers Follies, and The Sound of Music. Before heading to Hollywood, Romano made her Broadway debut in the Tony Award-winning musical Parade by Alfred Uhry and Jason Robert Brown originating the role of 'Mary Phagan'. On February 17, 2004, Romano began a 31-week run of playing 'Belle' in Disney's Beauty and the Beast on Broadway. She left the production after raising ticket attendance from 30% to 99%. Romano later returned to Broadway and starred in Avenue Q, in which she puppet-mastered 'Kate Monster' and 'Lucy the Slut'. Publications Romano penned a novel, Grace's Turn, published by Hyperion, which received accolades by The New York Public Library as the '2007 Teenage Book of the Year'. She is developing a new young adult novel. Advocacy Romano received the 'GI Spirit Award' with the GI Film Festival due to her work as a member of the 'Ambassadors of Hollywood' support tour to Afghanistan. She traveled to the Capitol building to be presented by former Senator Chris Dodd (CT) and performed the National Anthem for the festival's veteran filmmakers. She was awarded the key to the city of her hometown in Connecticut and been given a day (Feb 22) commemorating her contribution as a positive role model for young women with the 'CT's Finest Award'. Romano has actively participated in many charities such as Equity Fights Aids, Leukemia Foundation, American Heart Association, L.A's AVIVA Center, and Unicef. She dedicated the proceeds of her 'Ready for Action' Mickey statue to the Children's Miracle Network. She has fulfilled several wishes for the Make-a-Wish Foundation, and has also sat on the board of the young Hollywood committee at St. Jude's Hospital. She has done PSA's for the Child's Safety Network on internet safety as well as acted as a campaign spokesperson for The American Counseling Association to speak out against bullying. She now actively volunteers at The Actor's Fund's 'Looking Ahead' program for youth in entertainment. Romano recently spoke at Old Dominion University and is available for speaking engagements or youth coaching sessions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzQyMjQ3OF5BMl5BanBnXkFtZTcwODc0MzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005579","name":"Christy Carlson Romano","idIMDB":"nm0005579"},"actorId":"nm0005579","character":"Carmen","urlCharacter":"http://www.imdb.com/character/ch0393873","main":true},{"actorName":"Joe Pantoliano","urlProfile":"http://www.imdb.com/name/nm0001592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NjgwODU4NDZeQTJeQWpwZ15BbWU3MDE0NzUwNDQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1951","placeOfBirth":" Hoboken, New Jersey, USA","birthName":"Joseph Peter Pantoliano","height":"5' 9¼\" (1.76 m)","bio":"With more than 100 film, television and stage credits to his name, Joseph Peter Pantoliano is a prolific American character actor who has played many diverse and memorable roles, from Guido in Risky Business (1983) to Eddie Moscone in Midnight Run (1988), Cosmo Renfro in The Fugitive (1993), Cypher in The Matrix (1999) and Teddy in Memento (2000). Pantoliano was born September 12, 1951 in Hoboken, New Jersey, the son of Mary (Centrella) and Dominic Pantoliano, first-generation Italian Americans who split when Joe was twelve years old (though they never officially divorced). His mother was a seamstress and bookie, and his father was a hearse driver and foreman at a factory. Despite suffering from severe dyslexia that made studies difficult for him, Pantoliano displayed acting talent from an early age and moved to Manhattan after high school to pursue an acting career. After four years in Manhattan that included auditions, acting classes, waiting tables and a role as Billy Bibbit in the touring production of \"One Flew Over the Cuckoo's Nest\", Joe Pantoliano moved to California to pursue television and film acting. Joe was successful in landing a number of television roles before getting his feature film debut in The Idolmaker (1980), but his true Hollywood breakthrough came with his turn opposite a 21-year-old Tom Cruise as ruthless pimp Guido in 1983's Risky Business (1983). A wide array of TV and film roles followed that have led Joe to work with many of Hollywood's brightest talents, both on-screen and off, including Richard Donner, Steven Spielberg, Lilly Wachowski & Lana Wachowski, Harrison Ford, Tommy Lee Jones, Wesley Snipes, Christopher Nolan and many others. Winner of a primetime Emmy for his work on The Sopranos (1999), for which he also received two SAG Award nominations, Joe Pantoliano is married to former model Nancy Sheppard, with whom he has two daughters, Daniella and Isabella. Pantoliano also has a son, Marco, from a previous marriage, and a step-daughter, Melody.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NjgwODU4NDZeQTJeQWpwZ15BbWU3MDE0NzUwNDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001592","name":"Joe Pantoliano","nicknames":["Joey Pants"],"idIMDB":"nm0001592"},"actorId":"nm0001592","character":"Carl","urlCharacter":"http://www.imdb.com/character/ch0280805","main":true},{"actorName":"Eric Phillips","urlProfile":"http://www.imdb.com/name/nm4086876","urlPhoto":"","biography":{"bio":"Eric Phillips is known for his work on Loosies (2011) and Inkubus (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4086876","name":"Eric Phillips","idIMDB":"nm4086876"},"actorId":"nm4086876","character":"Donny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom DeNucci","urlProfile":"http://www.imdb.com/name/nm3848723","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODg2NzE5OV5BMl5BanBnXkFtZTgwNjMwMjU0NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1984","placeOfBirth":" Cranston, Rhode Island, USA","birthName":"Thomas Dominic DeNucci","height":"5' 10\" (1.78 m)","bio":"Tom DeNucci is the recipient of the 2013 Rhode Island International Film Festival Robert Burgess Aldrich Award, named for the heralded director of the 1967 war masterpiece The Dirty Dozen. Like Mr. Aldrich, DeNucci also hails from Cranston, Rhode Island, USA. If DeNucci's career thus far is any indication, the young Director and Actor will be a worthy successor to Mr. Aldrich's legacy and a prominent voice for his own generation. For DeNucci's Almost Mercy (2015), Scott Hallam of dreadcentral.com proclaims: \"DeNucci holds nothing back on this one. Almost Mercy confronts major social issues and does so in a way that's delicate, but also quite powerful, and deals them into a revenge-thriller that's actually empowering for the viewer.\" DeNucci plays a member of boxer Vinny Pazienza's entourage in Bleed for This (2016), which stars Miles Teller (Whiplash) as Pazienza and Aaron Eckheart (Erin Brokovich) as \"Paz's\" trainer. Directed by Ben Younger and executive produced by Martin Scorsese. In action films, Tom and Ultimate Fighting legend Chuck Liddell wreak havoc as ruthless mercenaries in Altitude (2016), a film that stars Dolph Lundgren (Drago from Rocky IV) and Denise Richards (Wild Things). In Blue Line (2015), DeNucci plays a drug dealer on the edge, under siege from a hard as nails cop played by Tom Sizemore (Saving Private Ryan). As versatile as he is prolific, DeNucci's resume also includes forays into family films. As Director, his Arlo the Burping Pig (2016) tells the story of a lonely, young girl and the adorable teacup pig she adopts as a pet. Tom lends his acting talents to Christmas All Over Again (2016) as Francisco, a wild wedding planner. Imagine Magazine named Tom DeNucci as its 2015 Shooting Star Award Recipient. As DeNucci's own unique path continues, one might imagine that Mr. Aldrich himself would be impressed by the young man following in his film footsteps from Cranston to Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODg2NzE5OV5BMl5BanBnXkFtZTgwNjMwMjU0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3848723","name":"Tom DeNucci","nicknames":["Tommy D"],"idIMDB":"nm3848723"},"actorId":"nm3848723","character":"Detective Jeffrey","urlCharacter":"http://www.imdb.com/character/ch0213264","main":true},{"actorName":"Tom Paolino","urlProfile":"http://www.imdb.com/name/nm0660057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTExOTE5OF5BMl5BanBnXkFtZTgwNjc2MDIyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Thomas J. Paolino III","height":"5' 9\" (1.75 m)","bio":"Tom Paolino is an actor, writer, director and producer living in New York City. Upcoming films include \"A Little Something for your Birthday\" and \"Passaic\". Two stories he wrote are now short films, including \"Please Punish Me\" which has been accepted into 21 film festivals. Tom graduated from Brown University and trained with Sanford Meisner and Larry Moss. He currently studies with Austin Pendleton at HB Studios. When he is not acting, Tom directs original plays in the NYC prison system through his theatre company, Xavier Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTExOTE5OF5BMl5BanBnXkFtZTgwNjc2MDIyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0660057","name":"Tom Paolino","idIMDB":"nm0660057"},"actorId":"nm0660057","character":"Detective Verdi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ara Boghigian","urlProfile":"http://www.imdb.com/name/nm4948874","urlPhoto":"","biography":{"bio":"Ara Boghigian is an actor, known for Loosies (2011) and Getting Home (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4948874","name":"Ara Boghigian","idIMDB":"nm4948874"},"actorId":"nm4948874","character":"Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Paolucci","urlProfile":"http://www.imdb.com/name/nm1682927","urlPhoto":"","biography":{"bio":"Anthony Paolucci is an actor, known for Spotlight (2015), Loosies (2011) and Brooklyn Rules (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1682927","name":"Anthony Paolucci","idIMDB":"nm1682927"},"actorId":"nm1682927","character":"Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glenn Ciano","urlProfile":"http://www.imdb.com/name/nm0161870","urlPhoto":"","biography":{"bio":"Glenn Ciano is a writer and producer, known for Infected (2012), Inkubus (2011) and Homie Spumoni (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0161870","name":"Glenn Ciano","idIMDB":"nm0161870"},"actorId":"nm0161870","character":"Gomer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Cicco","urlProfile":"http://www.imdb.com/name/nm0161978","urlPhoto":"","biography":{"dateOfBirth":"19 August 1972","placeOfBirth":" Cranston, Rhode Island, USA","height":"5' 10\" (1.78 m)","bio":"Johnny Cicco was born on August 19, 1972 in Cranston, Rhode Island, USA. He is known for his work on The Departed (2006), Elysium (2013) and The Adjustment Bureau (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0161978","name":"Johnny Cicco","nicknames":["Cheeks"],"idIMDB":"nm0161978"},"actorId":"nm0161978","character":"Stoner Adam","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1568337","urlIMDB":"http://www.imdb.com/title/tt1568337","business":{"budget":{"money":"$3,900,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$3,318","country":"USA","day":"22","month":"01","year":"2012","remarks":""},{"money":"$2,644","country":"USA","day":"15","month":"01","year":"2012","remarks":""}],"weekendGross":[{"money":"$566","country":"USA","day":"22","month":"01","year":"2012","remarks":"2 Screens"},{"money":"$808","country":"USA","day":"15","month":"01","year":"2012","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"07","year":"2010","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Canon EOS 5D Mark II","Canon EOS 7D"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","metascore":"35","filmingLocations":[{"location":"Manhattan, New York City, New York, USA"}],"rated":"PG-13","awards":[],"votes":"5,245","type":"Movie","companyCreditsSimple":[{"idCompany":"co0015762","name":"IFC Films"},{"idCompany":"co0339115","name":"Verdi Productions"},{"idCompany":"co0307232","name":"Facinelli Films"}],"keywords":{"keywords":["subway","f word","new york city","thief"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:23:44"}}