{"data":{"movies":[{"title":"Jack the Reaper","originalTitle":"","year":"2011","directors":[{"name":"Kimberly Seilhamer","id":"nm0989920"}],"writers":[{"name":"Kimberly Seilhamer","id":"nm0989920"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODQyNTQyNl5BMl5BanBnXkFtZTcwODg1NzQzNw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"A group of unsuspecting teens face a railroad reaper in his desert carnival.","simplePlot":"A group of unsuspecting teens face a railroad reaper in his desert carnival.","actors":[{"actorName":"Tony Todd","urlProfile":"http://www.imdb.com/name/nm0865302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1954","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Anthony Tiran Todd","height":"6' 5\" (1.96 m)","bio":"Perhaps best known for his chilling performance as \"Candyman\", the charismatic 6' 5\" actor Tony Todd has consistently turned in compelling performances since his debut in the fantasy film Sleepwalk (1986). Born in Washington, D.C., Todd spent two years on a scholarship at the University of Connecticut, which, in turn, led to a scholarship from the renowned Eugene O'Neill National Theatre Institute. It proved to be the foundation for intense stints at the Hartman Conservatory in Stamford, Connecticut and the Trinity Square Repertory Theatre Conservatory in Providence, Rhode Island. Todd appeared in dozens of classical and many experimental plays, yet still managed to find time to teach playwriting to high school students in the Hartford public school system. Todd's extensive credits exemplify his versatility. They include such film classics as The Rock (1996), The Crow (1994), Lean on Me (1989), Bird (1988), Night of the Living Dead (1990), Destination finale (2000), the multiple Academy Award winning Oliver Stone film Platoon (1986) and Le secret (2000), which was nominated and screened at the Cannes Film Festival. Todd's recent films include the independent film Silence (2002) and Final Destination 2 (2003). He has had prominent guest starring roles in numerous critically-acclaimed television series, including recurring on Boston Public (2000), For the People (2002) and The District (2000), as well as NYPD Blue (1993), Smallville (2001), Law & Order (1990), Crossing Jordan (2001), Homicide: Life on the Street (1993) and The X-Files (1993). Todd recurred on three incarnations of \"Star Trek\" and guest starred on Xena: Warrior Princess (1995) and episodes of CSI: Miami (2002) and Andromeda (2000). His television movies include starring roles in True Women (1997), Black Fox (1995), Butter (1998), Ivory Hunters (1990), Babylon 5: A Call to Arms (1999) and Control Factor (2003). Todd's considerable theatre credits include the world premiere of award-winning playwright August Wilson's \"King Hedley II\", where he originated the title role in Pittsburgh, Seattle and Boston. Variety commented: \"Todd's King Hedley dominates the stage. A sour-faced mix of rage and resolve, anger and vulnerability. Todd's Hedley was a memorable tour-de-force even on opening.\" He also received a coveted Helen Hayes nomination for his performance in Athol Fugard's \"The Captain's Tiger at La Jolla, the Manhattan Theatre Club and the Kennedy Center. Other theatre credits include \"Les Blancs\", \"Playboy of the West Indies\", \"Othello\", \"Zooman and the Sign\", award-winning playwright Keith Glover's \"Dark Paradise\", \"Aida\" (on Broadway), and most recently, \"Levee James\" for the prestigious Eugene O'Neill Playwrights Conference and The New Dramatist Guild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865302","name":"Tony Todd","idIMDB":"nm0865302"},"actorId":"nm0865302","character":"Mr. Steele","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sally Kirkland","urlProfile":"http://www.imdb.com/name/nm0000476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDQ5MDEyNF5BMl5BanBnXkFtZTgwNzg4NTcxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1941","placeOfBirth":" New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"Sally Kirkland, BEST Actress Oscar Nominee, Golden Globe winner, Independent Spirit Award winner and veteran of over 200 films. Feisty, hard-working, famously liberal, with the trademark blonde hair, actress Sally Kirkland has certainly made an indelible mark on Hollywood history. Born in New York City, her mother was the fashion editor at Vogue and LIFE magazine. Sally began her career on the off-Broadway circuit and trained under 'Lee Strasberg'. Sally Kirkland is a film, TV, and theater veteran since the 1960's and is probably best known for the film \"Anna,\" for which she garnered a Best Actress Oscar nomination and won the Best Actress Golden Globe, the Independent Spirit Award, and the LA Film Critic's Circle Award. Sally's first director in 1964 was Andy Warhol in \"13 Most Beautiful Women.\" Her 200 films also include: \"The Sting,\" \"The Way We Were,\" \"Coming Apart,\" \"Cold Feet,\" \"Best of the Best,\" \"Revenge,\" \"JFK,\" \"ED TV,\" \"Bruce Almighty\", \"Coffee Date\" and \"Archaeology of a Woman\". Her new films will include \"Buddy Solitaire\", \"Gnaw\" and \"The Most Hated Woman in America\" co-starring with Melissa Leo and Peter Fonda coming to Netflix. She was nominated for Best Actress in a TV movie by the Hollywood Foreign Press for \"The Haunted- A True Story.\" Her television credits include: guest starring on \"Criminal Minds,\" recurring on \"Head Case\" and \"the Simple Life.\" She guest starred on \"Resurrection Blvd,\" and in the TV movie, \"Another Woman's Husband.\" Sally had a recurring role on \"Felicity\" and \"Wasteland.\" She starred on the NBC movie, \"Brave New World.\" She starred in the TV movie, \"Song of Songs\"and was a series regular on the TV show \"Valley of the Dolls.\" She also starred in the TV movie, \"The Woman Who Loved Elvis.\" She played Barbara Healy on \"Roseanne.\" She starred in the TV movie, \"Heatwave\" and recurred as Tracy on \"Days of Our Lives.\" Sally is also an exhibited painter, poet, renowned acting coach and ordained minister.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDQ5MDEyNF5BMl5BanBnXkFtZTgwNzg4NTcxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000476","name":"Sally Kirkland","idIMDB":"nm0000476"},"actorId":"nm0000476","character":"Harold's Nana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Douglas Tait","urlProfile":"http://www.imdb.com/name/nm1408752","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDY4OWNhMmYtMTA0Ny00MDlkLTgzZTEtY2Y4ZDVmMjY4YmJhXkEyXkFqcGdeQXVyNDU3ODAzMA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1978","placeOfBirth":" Tarzana, California, USA","birthName":"Douglas J. Tait","height":"6' 5\" (1.96 m)","bio":"Douglas Tait was born on December 17, 1978 in Tarzana, California, USA as Douglas J. Tait. He is known for his work on Star Trek (2009), Land of the Lost (2009) and Teen Wolf (2011). He has been married to Isabel Cueva since March 8, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDY4OWNhMmYtMTA0Ny00MDlkLTgzZTEtY2Y4ZDVmMjY4YmJhXkEyXkFqcGdeQXVyNDU3ODAzMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1408752","name":"Douglas Tait","nicknames":["The Monster Man"],"idIMDB":"nm1408752"},"actorId":"nm1408752","character":"Railroad Jack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Alen","urlProfile":"http://www.imdb.com/name/nm3896266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFmMmFlZjEtMjYyYi00NGZkLWIxY2MtNWM2Zjc2MGE5Nzk3XkEyXkFqcGdeQXVyMjEwMjcwNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"David Alen is an actor and writer, known for Abruptio (2018), Murder Book (2014) and All Wrong (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFmMmFlZjEtMjYyYi00NGZkLWIxY2MtNWM2Zjc2MGE5Nzk3XkEyXkFqcGdeQXVyMjEwMjcwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3896266","name":"David Alen","nicknames":["Dave"],"idIMDB":"nm3896266"},"actorId":"nm3896266","character":"Fireman 3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Beeler","urlProfile":"http://www.imdb.com/name/nm0066417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg4MjI3Njc1NF5BMl5BanBnXkFtZTcwMTk4MzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Born and raised in Kerrville Texas, David attended UT, Austin, and then trained in London at The Royal Central School of Speech & Drama in their 3 year acting conservatory. David lived and worked in the UK for 10 years, racking up numerous theatre credits before moving to sunny LA. UK highlights include: playing Hamlet in London and at Kennilworth Castle, Norman Petty in Buddy, Puck, Edmund, and being directed in \"The Scottish Play\" by Dame Judi Dench. Booth, a one man show written and performed by David, won a Fringe 1st at the Edinburgh Festival, as did an ensemble piece about John Wilkes Booth entitled Our Brutus which led to transfer to London and a writing commission from a West End Producer. David was part of the sketch comedy troupe, Lester McFwap, and was part of the comedy duo, Dave & Tom, for many years. David has an insatiable desire for creative engagement. As well as being an actor, he is a professional photographer and designer. He also writes, produces and enjoys building furniture and architecture. He finds that creativity from one discipline cross-pollinates the others and offers a holistic view when approaching an endeavor. Equally at home with comedy or drama, on stage or in front of the camera, he brings wit, passion and creativity to all he does. In addition to his credits listed here on IMDB, he has appeared in over 80 national commercials, several of which aired in various SuperBowls. He and his wife, Marieke, are busy with their best productions, their two sons, Chayim (\"Kai\") and Ryder.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg4MjI3Njc1NF5BMl5BanBnXkFtZTcwMTk4MzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0066417","name":"David Beeler","idIMDB":"nm0066417"},"actorId":"nm0066417","character":"Mr. Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Bruno","urlProfile":"http://www.imdb.com/name/nm0116456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Njc0MTc4Nl5BMl5BanBnXkFtZTgwMDMxNjM1NjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1966","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Christopher Malcolm Bruno","height":"6' (1.83 m)","bio":"Christopher Malcolm Bruno was born in New Haven Connecticut. He grew up in the small town of Milford with his mother but spent a substantial amount of time with his father on Manhattan's Upper West Side of New York City. Surrounded by the allure of New York and all its offerings, Chris developed an appreciation for the arts but had no intention of pursuing it as a career. Chris attended college in Vermont where he skied on the ski-team while studying Psychology. During his sophomore year he was temporarily sidelined with an injury so he decided to try something different. He auditioned for a play, Machiavelli's \"The Mandrake\" and was cast as the lead. Having discovered a new passion for the arts, Bruno transferred to StonyBrook University where he changed his major to Theater and was a walk-on starting pitcher for their baseball team. His fastball was clocked at 90 miles per hour and he finished with a 6-0 record his senior year and broke three school records for strikeouts, wins and games pitched. Those records were later broken by The Minnesota Twins perennial all-star Joe Nathan. After college, Chris moved to his beloved New York City full-time and after several bar-tending jobs, he landed a two year contract on NBC's \"Another World\". During his first year on the show Chris was nominated for a Soap Opera Digest Award as \"Outstanding Newcomer\". A few years later he was cast as Michael Delaney on \"All My Children\", a gay school teacher who loses his job to social prejudice. The writers won an Emmy that year for his groundbreaking storyline. Chris eventually realized the need to be in Los Angeles if he was to take his career to the next level. He performed stand-up comedy at The Improv and was discovered by an exec at Warner Bros and subsequently was cast on \"Suddenly Susan\", \"The Nanny\", \"Jesse\" and a recurring role on Alan Ball's series \"Oh Grow Up\". In 1998, Bruno and his brother Dylan Bruno were cast in Lorenzo Carcaterra's dark and gritty New York cop show \"The Force\" for The WB. Then came Chris' biggest break when he was cast as Walt Bannerman in \"Stephen King's \"The Dead Zone\" which was immensely successful and ran for six seasons on USA Network. In the summer of 2004 Chris produced and starred in the feature film \"Last of the Romantics\" and again, worked alongside his brother Dylan which solidified the Bruno Brothers as a force to be reckoned with. On his hiatus from The Dead Zone, Chris completed work on the feature film \"The World's Fastest Indian\" opposite Sir Anthony Hopkins which was, in Chris' words, \"One of the most exciting jobs he's ever done\". In the last season of The Dead Zone, Chris was able to exercise his directing skills as he helmed an episode entitled \"Independence Day\" which again included an appearance by his brother Dylan. They dedicated this episode to the memory of their Mom Nancy Mendillo Bruno who had just passed away from breast cancer earlier that year. After the show was canceled, Chris then landed recurring roles on Tony and Ridley Scott's show \"Numb3rs\", FOX's \"Prison Break\" and appeared in the movie \"Prison Break, The Final Break\". He was also the male lead in \"The Cell 2\". Recently Chris has had a nice run doing guest starring roles on \"Castle\", \"Southland\", \"NCIS\" and \"NCIS LA\". In 2013, Chris teamed up with his cousin Vohn Regensberger for the second time to produce and star in the feature film \"A Remarkable Life\" where he and Dylan Bruno played actual brothers for the first time in their illustrious careers. Upon wrapping, he immediately went to work on Lifetime's \"Sorority Surrogate\" and was a recurring character on ABC's \"Family Tools\" playing the husband of Leah Rimini. In 2013 Chris joined the cast of ABC Family's The Fosters, playing the role of Adam and subsequently can be seen as Danny on MTV''s Awkward.. Chris's passions outside of the business include surfing and fighting MMA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Njc0MTc4Nl5BMl5BanBnXkFtZTgwMDMxNjM1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0116456","name":"Chris Bruno","idIMDB":"nm0116456"},"actorId":"nm0116456","character":"Paramedic Vasquez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joel Bryant","urlProfile":"http://www.imdb.com/name/nm1071164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGI5ZjY5MTMtMjA2Ni00ZTM0LWE5N2QtYTAyNWIwNjUwNjY3XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10½\" (1.79 m)","bio":"Born and raised in Albuquerque, New Mexico, Joel Bryant graduated from Pepperdine University with a BA in Theatre and has lived in LA ever since. He's been lucky to work in many mediums including film (\"The Heartbreak Kid,\" \"Valkyrie,\" \"Loaded,\" \"Gone But Not Forgotten,\" among many others), TV (guest stars on \"Monk,\" \"Criminal Minds: Suspect Behavior,\" \"The Defenders,\" \"Las Vegas,\" etc., a number of pilots such as \"Hillers\" with Henry Winkler and Tom Arnold and \"Angry Guys\") and New Media (Streamy-nominated for \"After Judgment,\" \"Life From the Inside,\" \"The Temp Life,\" \"Elevator\" and is co-producer/\"Mac\" in the award-winning \"Suck and Moan\"). Among his numerous theatre highlights, he's been tapped by Neil LaBute to be in \"Fat Pig\" at the Belasco Theatre on Broadway in 2012. As well, he's garnered glowing reviews all over L.A. (Knightsbridge Theatre, Hudson Theatre, and Civic Light Opera of South Bay Cities) and performed at the Edinburgh Fringe Festival, the Texas Shakespeare Festival and a variety of regional theatres throughout the Southwest, including the world premiere of \"Terminal Cafe\" with Neil Patrick Harris. Some of his favorite pieces include: \"ART,\" \"Moonlight & Magnolias,\" \"A Midsummer Night's Dream,\" \"The Woolgatherer,\" \"Oleanna\"). Trained in improv at The Groundlings, Joel is a co-founder and member of the award-winning comedy duo \"Deven & Joel\" with comedy partner/wife Deven Green, with whom he has entertained the troops overseas, performed at a series of maximum security prisons, played at colleges and clubs all over the U.S., and have headlined at many places including The Comedy Store, The Icehouse, the Venetian, the Riviera and Bally's in Las Vegas, Flappers in Burbank, all over L.A. and San Diego, a week of sold out shows at the San Francisco Fringe Festival and won the Best of the Fest at the International Hollywood Comedy Festival. Since starting stand-up comedy at the age of 16, he has performed in such places as The Comedy Store, The Icehouse, The Comedy Union, Laff's, The Queen Mary, and many clubs in between. Joel is also an accomplished dancer, writer and spoken word artist...and sometimes he even sleeps.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGI5ZjY5MTMtMjA2Ni00ZTM0LWE5N2QtYTAyNWIwNjUwNjY3XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1071164","name":"Joel Bryant","idIMDB":"nm1071164"},"actorId":"nm1071164","character":"William","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stacey Carino","urlProfile":"http://www.imdb.com/name/nm1634004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDYzMDUzOV5BMl5BanBnXkFtZTcwMjU0NTE0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Stacey Carino is known for her work on The Hunger Games: Catching Fire (2013), Eagle Eye (2008) and Transformers (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDYzMDUzOV5BMl5BanBnXkFtZTcwMjU0NTE0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1634004","name":"Stacey Carino","idIMDB":"nm1634004"},"actorId":"nm1634004","character":"Emma","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richardson Chery","urlProfile":"http://www.imdb.com/name/nm2879487","urlPhoto":"","biography":{"height":"6' 2\" (1.88 m)","bio":"Richardson Chery is an actor, known for Pastor Jones: Preachin' to the Choir (2009), Bobby and Henry (2013) and Tainted Rose (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2879487","name":"Richardson Chery","idIMDB":"nm2879487"},"actorId":"nm2879487","character":"Andre","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Isabel Cueva","urlProfile":"http://www.imdb.com/name/nm1036803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWFlNzJhNWUtMWU2Mi00YjYxLWFhODYtNTYxNTI4MTRhZGQ4L2ltYWdlXkEyXkFqcGdeQXVyNjAxNTU3MA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Elizabeth Cueva","bio":"Isabel Cueva was born on February 1, 1980 in Los Angeles, California, USA as Elizabeth Cueva. She is an actress and producer, known for Aztec Warrior (2016), The Haunt (2017) and American Horror House (2012). She has been married to Douglas Tait since March 8, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWFlNzJhNWUtMWU2Mi00YjYxLWFhODYtNTYxNTI4MTRhZGQ4L2ltYWdlXkEyXkFqcGdeQXVyNjAxNTU3MA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1036803","name":"Isabel Cueva","idIMDB":"nm1036803"},"actorId":"nm1036803","character":"Paramedic Duyenen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam David","urlProfile":"http://www.imdb.com/name/nm3297161","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI2MzcyN15BMl5BanBnXkFtZTgwODI2NDIyODE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Adam David is an actor and producer, known for Everlasting (2016), The Stranger in Us (2010) and You Me & Her (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI2MzcyN15BMl5BanBnXkFtZTgwODI2NDIyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3297161","name":"Adam David","idIMDB":"nm3297161"},"actorId":"nm3297161","character":"Bully 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jemal Draco","urlProfile":"http://www.imdb.com/name/nm3524039","urlPhoto":"","biography":{"dateOfBirth":"31 December 1986","placeOfBirth":" Los Angeles, California, USA","height":"5' 8\" (1.73 m)","bio":"Jemal Draco was born on December 31, 1986 in Los Angeles, California, USA. He is an actor and writer, known for Part of Me (2013), Salem Rogers (2015) and Nerd Wars! (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3524039","name":"Jemal Draco","nicknames":["Jammy"],"idIMDB":"nm3524039"},"actorId":"nm3524039","character":"Tyler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Erikson","urlProfile":"http://www.imdb.com/name/nm3693880","urlPhoto":"","biography":{"bio":"Mark Erikson is a producer and actor, known for Jack the Reaper (2011) and The Lighthouse (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3693880","name":"Mark Erikson","idIMDB":"nm3693880"},"actorId":"nm3693880","character":"Bus Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John J. Fischer","urlProfile":"http://www.imdb.com/name/nm3897304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTI0MzUxMF5BMl5BanBnXkFtZTcwMzMyNzk0OA@@._V1_UY44_CR21,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"John J. Fischer is known for his work on Turn Around Jake (2014), The Last Letter (2013) and Jack the Reaper (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTI0MzUxMF5BMl5BanBnXkFtZTcwMzMyNzk0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3897304","name":"John J. Fischer","idIMDB":"nm3897304"},"actorId":"nm3897304","character":"Police Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Gillespie","urlProfile":"http://www.imdb.com/name/nm1152653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjgwMTE5Nl5BMl5BanBnXkFtZTcwNjA3NDM2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1979","placeOfBirth":" Dallas, Texas, USA","height":"5' 8\" (1.73 m)","bio":"Jay Gillespie was born in Dallas, Texas. The youngest of three children and the only boy, Jay spent his childhood in Houston before the family moved to Connecticut. Eager to return to his Southern roots, he started undergrad at the College of Charleston, where he first discovered his love of acting. Ready to pursue his newfound dream, the transient Jay settled in New York to attend NYU's Tisch School of the Arts. His first film was O Beautiful (2002), featured in Boys Life 4: Four Play (2003). He recently completed the lead role in Tim Sullivan's 2001 Maniacs (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjgwMTE5Nl5BMl5BanBnXkFtZTcwNjA3NDM2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1152653","name":"Jay Gillespie","idIMDB":"nm1152653"},"actorId":"nm1152653","character":"Shawn Hickey","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1552423","urlIMDB":"http://www.imdb.com/title/tt1552423","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Red One Camera","Zeiss Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.5","filmingLocations":[{"location":"California City Studios, Mojave, California, USA"}],"rated":"R","awards":[],"votes":"786","type":"Movie","companyCreditsSimple":[{"idCompany":"co0290497","name":"Kilo Entertainment Ltd."},{"idCompany":"co0328682","name":"Mad Crapper Films"}],"keywords":{"keywords":["f rated"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:55:30"}}