{"data":{"movies":[{"title":"Scream of the Banshee","originalTitle":"","year":"2011","releaseDate":"20110326","directors":[{"name":"Steven C. Miller","id":"nm1921345"}],"writers":[{"name":"Anthony C. Ferrante","id":"nm0003116"},{"name":"Anthony C. Ferrante","id":"nm0003116"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQ0MDQwMF5BMl5BanBnXkFtZTcwNjMzNjM1NA@@._V1.jpg","countries":["USA"],"languages":["English","Serbian"],"genres":["Horror"],"plot":"In 1188 A.D., in Limerick, Ireland, Templar Knights chase a creature through the woods and trap her head in a box. In the present day Professor Isla Whelan and her two assistants are researching and labeling historical artifacts in the basement of the university where she works and they find an Irish glove and map with the name Duncan. Isla's estranged daughter Shayla Whelan finds a hidden space behind a wall with a box with the severed head, but they believe that it belongs to deformed person or an animal. Out of the blue, the head screams and they all bleed through the ears. They learn soon that the head is from a Banshee and in accordance with the mythology they are doomed to die. Their only hope is to find the lunatic and discredited Professor Broderick Duncan, whose expertise is in the feminine spirit in Irish mythology.","simplePlot":"An archeology professor unearths a dangerous artifact, unwittingly releasing a creature that is able to kill with the power of its bone-splitting scream.","actors":[{"actorName":"Lauren Holly","urlProfile":"http://www.imdb.com/name/nm0000452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDA0NDcyMl5BMl5BanBnXkFtZTgwNzE2ODkwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1963","placeOfBirth":" Bristol, Pennsylvania, USA","birthName":"Lauren Michael Holly","height":"5' 5\" (1.65 m)","bio":"Born in Bristol, Pennsylvania, the daughter of two college professors, Lauren grew up in the upstate New York town of Geneva. Her childhood was split between experiences that contrasted. She was privy to the shelter of growing up in a rural town and also exposed due to the erudite sophistication of her parents' academic careers. Lauren spent time traveling in Europe and lived for a year in London, where she studied languages and flute at the famed Sarah Siddons School. A graduate of Sarah Lawrence College in New York, Lauren credits her love of acting to her great-grandmother who bred a family tradition of \"treading the boards\" on the musical theatre stages of Liverpool and London. Lauren's breakthrough motion picture performance came in the New Line Cinema's box-office smash, Dumb & Dumber (1994), with Jim Carrey and Jeff Daniels. Lauren captured the hearts of audiences, as \"Mary Swanson\", the woman who drove Jim Carrey to follow her across the country to pledge his love. Next, she received glowing reviews for her performance in the Edward Burns drama, No Looking Back (1998), as a woman whose life in a small seaside community is turned upside down by the reappearance of her ex-boyfriend. Lauren's other film credits include Oliver Stone's \"Any Given Sunday,\" with Al Pacino, Cameron Diaz and Jamie Fox, Sydney Pollack's \"Sabrina,\" starring Harrison Ford, the action-drama \"Turbulence,\" co-starring Ray Liotta, the Miramax ensemble \"Beautiful Girls,\" a lead role in the Universal production of \"Dragon: The Bruce Lee Story,\" \"A Smile Like Yours,\" \"The Adventures of Ford Fairlane,\" the comedy \"Down Periscope,\" starring Kelsey Grammer, \"Entropy\" and \"The Last Producer,\" starring and directed by Burt Reynolds.In television, Lauren's credits are no less impressive. Lauren recently starred in 2 films for Hallmark. She also boasts three seasons as Director Jenny Shepard in CBS/Paramount Television's top-rated drama series NCIS. Lauren was seen in the TNT movie \"King of Texas,\" an adaptation of Shakespeare's \"King Lear,\" playing opposite Oscar winner Marcia Gay Harden and renowned actor Patrick Stewart, and in the NBC miniseries \"Jackie, Ethel, Joan: Women of Camelot,\" alongside Jill Hennessy and Leslie Stefanson. Additionally, Lauren starred as plastic surgeon Jeremy Hanlon on David E. Kelley's Emmy Award-nominated CBS drama, \"Chicago Hope,\" marking her second project with Kelley, following their successful collaboration on the critically acclaimed, Emmy Award-winning series, \"Picket Fences.\" Lauren has worked on numerous Independent films. These feature films include the political thriller \"Fatwa,\" in which she not only acted but also served as a producer, the Peter Schwaba penned and directed comedy \"Godfather of Green Bay,\" \"The Chumscrubber,\" an Arie Posen directed, independent film to be released by DreamWorks, \"Pleasure Drivers,\" directed by acclaimed cinematographer Andrej Sekula and co-starring Angus McFadden, a Lifetime movie \"Caught in the Act,\" which she also produced, and \"Chasing 3000\". Most recently, Lauren starred in \"You're So Cupid\" with Brian Krause and Jeremy Sumpter. Additional projects contributing to the broad and diverse body of motion picture work Lauren has compiled include the drama \"Colored Eggs\" with Faye Dunaway, the comedy \"Raising Flagg\" playing opposite Oscar winner Alan Arkin, the Darrell Roodt directed HBO thriller, \"Pavement\", co-starring Robert Patrick and Paramount Pictures', and \"What Women Want\" opposite Mel Gibson and Helen Hunt. In addition, Lauren served a lead role in Disney's Oscar winning animated motion picture \"Spirited Away\" as the voice of Chihiro's Mother. Coming up she will play a lead in \"Perfect Age of Rock and Roll,\" produced by Spike Lee. Lauren currently [march, 2014] makes her home in Toronto, Canada with her \"three kings\", sons Alexander, George, and Henry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDA0NDcyMl5BMl5BanBnXkFtZTgwNzE2ODkwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000452","name":"Lauren Holly","idIMDB":"nm0000452"},"actorId":"nm0000452","character":"Professor Isla Whelan","urlCharacter":"http://www.imdb.com/character/ch0243426","main":true},{"actorName":"Lance Henriksen","urlProfile":"http://www.imdb.com/name/nm0000448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1940","placeOfBirth":" New York City, New York, USA","birthName":"Lance James Henriksen","height":"5' 10¼\" (1.79 m)","bio":"An intense, versatile actor as adept at playing clean-cut FBI agents as he is psychotic motorcycle-gang leaders, who can go from portraying soulless, murderous vampires to burned-out, world-weary homicide detectives, Lance Henriksen has starred in a variety of films that have allowed him to stretch his talents just about as far as an actor could possibly hope. He played \"Awful Knoffel\" in the TNT original movie Evel Knievel (2004), directed by John Badham and executive produced by Mel Gibson. Henriksen portrayed \"Awful Knoffel\" in this project based on the life of the famed daredevil, played by George Eads. Henriksen starred for three seasons (1996-1999) on Millennium (1996), Fox-TV's critically acclaimed series created by Chris Carter (The X-Files (1993)). His performance as Frank Black, a retired FBI agent who has the ability to get inside the minds of killers, landed him three consecutive Golden Globe nominations for \"Best Performance by a Lead Actor in a Drama Series\" and a People's Choice Award nomination for \"Favorite New TV Male Star\". Henriksen was born in New York City. His mother, Margueritte, was a waitress, dance instructor, and model. His father, James Marin Henriksen, who was from Tønsberg, Norway, was a boxer and merchant sailor. Henriksen studied at the Actors Studio and began his career off-Broadway in Eugene O'Neill's \"Three Plays of the Sea.\" One of his first film appearances was as an FBI agent in Sidney Lumet's Dog Day Afternoon (1975), followed by parts in Lumet's Network (1976) and Prince of the City (1981). He then appeared in Steven Spielberg's Close Encounters of the Third Kind (1977) with Richard Dreyfuss and François Truffaut, Damien: Omen II (1978) and in Philip Kaufman's The Right Stuff (1983), in which he played Mercury astronaut Capt. Wally Schirra. James Cameron cast Henriksen in his first directorial effort, Piranha Part Two: The Spawning (1981), then used him again in The Terminator (1984) and as the android Bishop in the sci-fi classic Aliens (1986). Sam Raimi cast Henriksen as an outrageously garbed gunfighter in his quirky western Mort ou vif (1995). Henriksen has also appeared in what has developed into a cult classic: Kathryn Bigelow's Near Dark (1987), in which he plays the head of a clan of murderous redneck vampires. He was nominated for a Golden Satellite Award for his portrayal of Abraham Lincoln in the TNT original film The Day Lincoln Was Shot (1998). In addition to his abilities as an actor, Henriksen is an accomplished painter and potter. His talent as a ceramist has enabled him to create some of the most unusual ceramic artworks available on the art market today. He resides in Southern California with his wife Jane and their five-year-old daughter Sage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000448","name":"Lance Henriksen","idIMDB":"nm0000448"},"actorId":"nm0000448","character":"Broderick Duncan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric F. Adams","urlProfile":"http://www.imdb.com/name/nm2353879","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NjE4NjgwOV5BMl5BanBnXkFtZTgwNTY2OTE4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1970","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Eric Freeland Adams","height":"6' 3\" (1.91 m)","bio":"Eric F. Adams was born on January 9, 1970 in Baton Rouge, Louisiana, USA as Eric Freeland Adams. He is known for his work on In the Hell of Dixie (2016), Autopsy (2008) and Scream of the Banshee (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NjE4NjgwOV5BMl5BanBnXkFtZTgwNTY2OTE4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2353879","name":"Eric F. Adams","idIMDB":"nm2353879"},"actorId":"nm2353879","character":"Samuel Page","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcelle Baer","urlProfile":"http://www.imdb.com/name/nm3053529","urlPhoto":"","biography":{"height":"5' 7\" (1.7 m)","bio":"Marcelle Baer is known for her work on Vampires Suck (2010), Scream of the Banshee (2011) and Arena (2011). She has been married to Andrew Gruezke since October 17, 2015.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3053529","name":"Marcelle Baer","idIMDB":"nm3053529"},"actorId":"nm3053529","character":"Shayla Whelan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edrick Browne","urlProfile":"http://www.imdb.com/name/nm1517407","urlPhoto":"","biography":{"bio":"Edrick Browne is an actor and producer, known for Django Unchained (2012), Olympus Has Fallen (2013) and Ender's Game (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1517407","name":"Edrick Browne","idIMDB":"nm1517407"},"actorId":"nm1517407","character":"Officer Sioux","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leanne Cochran","urlProfile":"http://www.imdb.com/name/nm1770409","urlPhoto":"","biography":{"height":"5' 5\" (1.65 m)","bio":"Leanne Cochran is an actress, known for Green Lantern (2011), A Love Song for Bobby Long (2004) and I Ran Against Us (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1770409","name":"Leanne Cochran","idIMDB":"nm1770409"},"actorId":"nm1770409","character":"Janie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas C. Daniel","urlProfile":"http://www.imdb.com/name/nm1917768","urlPhoto":"","biography":{"bio":"Thomas C. Daniel is known for his work on The Haunting in Connecticut 2: Ghosts of Georgia (2013), Scream of the Banshee (2011) and 12 Rounds (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1917768","name":"Thomas C. Daniel","idIMDB":"nm1917768"},"actorId":"nm1917768","character":"Young Duncan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kasey Emas","urlProfile":"http://www.imdb.com/name/nm3962535","urlPhoto":"","biography":{"birthName":"Kasey Amanda Emas","height":"5' 3\" (1.6 m)","bio":"Kasey Amanda Emas was born on December 18th in New Orleans, Louisiana. She began theatre and acting at an early age and fell in love with performing. Her father's job brought her all over the country to states such as: Louisiana, Iowa, California, Colorado, Connecticut and Ohio, where she practiced her craft along the way while also studying dance, piano, voice and figure skating.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3962535","name":"Kasey Emas","idIMDB":"nm3962535"},"actorId":"nm3962535","character":"School Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Haberkorn","urlProfile":"http://www.imdb.com/name/nm1920556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODAxMTA5NF5BMl5BanBnXkFtZTgwMjg4NjE1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1982","placeOfBirth":" Arlington, Texas, USA","birthName":"Todd Michael Haberkorn","height":"5' 10\" (1.78 m)","bio":"Todd Haberkorn was born on August 16, 1982 in Arlington, Texas, USA as Todd Michael Haberkorn. He is an actor and director, known for Fairy Tail (2009), Kingsglaive: Final Fantasy XV (2016) and Monster High: Boo York, Boo York (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODAxMTA5NF5BMl5BanBnXkFtZTgwMjg4NjE1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1920556","name":"Todd Haberkorn","idIMDB":"nm1920556"},"actorId":"nm1920556","character":"Otto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Garrett Hines","urlProfile":"http://www.imdb.com/name/nm2584077","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzg4MmM0YTItYjNmNi00NGJiLWI4MzMtMzQxNjIyMjhkMzc5L2ltYWdlXkEyXkFqcGdeQXVyMjIyNDUxNjU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Garrett Hines was born in New Orleans, Louisiana but grew up north of the city in the small town of Mandeville. Interested in acting since a young age but unable to pursue it due to family tragedy, he graduated high school and attended college at Southeastern Louisiana University, where he would receive a Bachelor's Degree in English. While taking English 101, he wrote a narrative essay for class which his professor encouraged him to adapt and perform as a one-man show entitled \"Ghost\". It was the first time he performed. Six months later, he was cast in his first speaking role on the television show \"K-Ville\" for FOX. After receiving his degree, he returned for a Master's Degree Program and worked as a tutor in Southeastern Louisiana University's Writing Center. His professors would allow him time off for auditions and film/TV shoots under the agreement that all missed assignments would be made-up (he shot numerous commercials and films while still in graduate school, such as the SyFy Channel original movie \"Scream of the Banshee\"). After earning a Master's Degree in Creative Writing, Garrett has now fully dedicated his time to a career in acting. He has gone on to appear in such films as \"Last Vegas\" and \"Midnight Special\", as well as the TV series \"Common Law\" for USA Networks and the highly acclaimed Showtime series \"Homeland\". He can also be seen as Dean Parsing in WEtv's upcoming scripted series \"South of Hell\" and opposite Bryan Cranston in Jay Roach's upcoming film \"Trumbo\", where Garrett plays Andrew Hird.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzg4MmM0YTItYjNmNi00NGJiLWI4MzMtMzQxNjIyMjhkMzc5L2ltYWdlXkEyXkFqcGdeQXVyMjIyNDUxNjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2584077","name":"Garrett Hines","idIMDB":"nm2584077"},"actorId":"nm2584077","character":"Kurtis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Lincoln","urlProfile":"http://www.imdb.com/name/nm1938969","urlPhoto":"","biography":{"bio":"Don Lincoln is known for his work on Scream of the Banshee (2011), The Adventures of Gorilla Bob: Bokato Attacks! (2011) and Seeking Justice (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1938969","name":"Don Lincoln","idIMDB":"nm1938969"},"actorId":"nm1938969","character":"Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Ormiston","urlProfile":"http://www.imdb.com/name/nm2481279","urlPhoto":"","biography":{"birthName":"Kimberly Robyn Ormiston","height":"5' 10\" (1.78 m)","bio":"Kim Ormiston was born as Kimberly Robyn Ormiston. She is an actress, known for The Hunger Games: Mockingjay - Part 2 (2015), Vertiges (2014) and Meet the Spartans (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2481279","name":"Kim Ormiston","idIMDB":"nm2481279"},"actorId":"nm2481279","character":"Woman in the Red Cape","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Misty Ormiston","urlProfile":"http://www.imdb.com/name/nm2481471","urlPhoto":"","biography":{"birthName":"Misty Lynn Ormiston","height":"5' 10\" (1.78 m)","bio":"Misty Ormiston was born as Misty Lynn Ormiston. She is an actress, known for The Hunger Games: Mockingjay - Part 2 (2015), Vertiges (2014) and Meet the Spartans (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2481471","name":"Misty Ormiston","idIMDB":"nm2481471"},"actorId":"nm2481471","character":"Old Hag - Banshee","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1548628","urlIMDB":"http://www.imdb.com/title/tt1548628","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Cineworks, New Orleans (LA), USA"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision2 250D 5205, Vision3 250D 5207, Vision3 500T 5219, Vision2 500T 5260)"],"cinematographicProcess":["Digital Intermediate (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm"]},"rating":"3.8","filmingLocations":[{"location":"Baton Rouge, Louisiana, USA"}],"rated":"R","awards":[],"votes":"1,975","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0166161","name":"After Dark Films"},{"idCompany":"co0487217","name":"Bomar OOD"}],"keywords":{"keywords":["knight","banshee","after dark","blood splatter","mannequin","camera","sex scene","red cape"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:02:00"}}