{"data":{"movies":[{"title":"Crave","originalTitle":"","year":"2012","releaseDate":"20131206","directors":[{"name":"Charles de Lauzirika","id":"nm1361273"}],"writers":[{"name":"Robert Lawton","id":"nm1844950"},{"name":"Charles de Lauzirika","id":"nm1361273"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NDYwOTMxOF5BMl5BanBnXkFtZTgwMTk0MjE4NTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Thriller"],"plot":"A downtrodden photographer, haunted by the urban violence and decay around him, retreats into an inner world of dark fantasies. Those dangerous visions explode in reality with deadly consequences when his intoxicating new relationship with a beautiful young woman goes sour.","simplePlot":"A downtrodden photographer, haunted by the urban violence and decay around him, retreats into an inner world of dark fantasies.","actors":[{"actorName":"Josh Lawson","urlProfile":"http://www.imdb.com/name/nm0493257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyOTE1OTU2NV5BMl5BanBnXkFtZTcwMjU5NzYzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1981","placeOfBirth":" Queensland, Australia","height":"6' 2\" (1.88 m)","bio":"Josh Lawson was born on July 22, 1981 in Queensland, Australia. He is an actor and writer, known for The Little Death (2014), Anchorman 2: The Legend Continues (2013) and House of Lies (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyOTE1OTU2NV5BMl5BanBnXkFtZTcwMjU5NzYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0493257","name":"Josh Lawson","nicknames":["JD"],"idIMDB":"nm0493257"},"actorId":"nm0493257","character":"Aiden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Lung","urlProfile":"http://www.imdb.com/name/nm1344335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTA5NjczNl5BMl5BanBnXkFtZTcwMzI3MDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Emma Lung was born in Sydney, New South Wales, Australia. She is an actress and producer, known for Triangle (2009), Wonderland (2013) and The Jammed (2007). She has been married to Henry Zalapa since 2013. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTA5NjczNl5BMl5BanBnXkFtZTcwMzI3MDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1344335","name":"Emma Lung","idIMDB":"nm1344335"},"actorId":"nm1344335","character":"Virginia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Perlman","urlProfile":"http://www.imdb.com/name/nm0000579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1950","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Francis Perlman","height":"6' 1\" (1.85 m)","bio":"Ron Perlman is a classically-trained actor who has appeared in countless stage plays, feature films and television productions. Ronald N. Perlman was born April 13, 1950 in Washington Heights, Manhattan, New York. His mother, Dorothy (Rosen), is retired from the City Clerk's Office. His father, Bertram \"Bert\" Perlman, now deceased, was a repairman and a drummer. His parents were both from Jewish families (from Hungary, Germany and Poland). With a career spanning over three decades, Perlman has worked alongside such diverse actors as Marlon Brando, Sean Connery, Dominique Pinon, Brad Dourif, Ed Harris, John Hurt, Jude Law, Christina Ricci, Federico Luppi, Sigourney Weaver, Michael Wincott and Elijah Wood to name a few. While he has never been a bankable star, Perlman has always had a large fanbase. He started out strong as Amoukar, one of the tribesmen in Jean-Jacques Annaud's Academy Award-winning film Quest for Fire (1981), for which he earned a Genie Award nomination. Perlman teamed up with Annaud again, this time as a hunchback named Salvatore in The Name of the Rose (1986). His first real breakthrough came later when he landed the role of the noble lion-man Vincent, opposite Linda Hamilton on the fantasy series Beauty and the Beast (1987). His work in this role earned him not only a Golden Globe Award but an underground fan following. Sadly the series was cancelled in its third season shortly after Hamilton's character's death. After that, he spent time doing supporting work on television and independent films such as Guillermo del Toro's debut Cronos (1993) (where a lifelong friendship and collaboration between the director and Perlman would blossom) as Angel and his first lead role as One in Jean-Pierre Jeunet's surreal The City of Lost Children (1995). His first real big role in a mainstream film came when Jeunet wanted him for the brutish Johner in his first Hollywood outing Alien: Resurrection (1997). Perlman has also used his distinctive voice to his advantage, appearing in many animated films/series, commercials and he is a video game fan favorite because of his work on such games as the Fallout series. It was not until much later he received worldwide fame when his good friend Guillermo del Toro helped him land the title role in the big-budget comic book movie Hellboy (2004). Del Toro fought the studio for four years because they wanted a more secure name, but he stood his ground and in 2004, after almost 25 years in and out of obscurity, Perlman became and household name and a sought out actor. Perlman has had one of the most offbeat careers in film, playing everything from a prehistoric ape-man to an aging transsexual and will always be a rarity in Hollywood. Other notable roles include the cunning Norman Arbuthnot in The Last Supper (1995), sniper expert Koulikov in Enemy at the Gates (2001), vampire leader Reinhardt in Blade II (2002), his reprisal of Hellboy in Hellboy II: The Golden Army (2008) and biker chief Clarence Morrow on the popular series Sons of Anarchy (2008). He currently resides in Los Angeles, California with his wife, Opal, and their two children, Blake and Brandon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000579","name":"Ron Perlman","idIMDB":"nm0000579"},"actorId":"nm0000579","character":"Pete","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Furlong","urlProfile":"http://www.imdb.com/name/nm0000411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MzgxODkyMl5BMl5BanBnXkFtZTcwNTc1NDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1977","placeOfBirth":" Glendale, California, USA","birthName":"Edward Walter Furlong","height":"5' 5¾\" (1.67 m)","bio":"Edward Walter Furlong was born in Glendale, California. His mother, Eleanor (Tafoya), is from a Mexican family, and worked at a youth center. Furlong had no acting ambitions until he was approached by casting agent Mali Finn, who was looking for a young actor to play the role of John Connor in what turned out to be one of the the biggest box-office hits of the 1990s, Terminator 2: Judgment Day (1991). Finn instantly recognized his ability, and suggested him for the part, feeling that he could hold his own playing opposite Arnold Schwarzenegger and Linda Hamilton. For his career-starting role, Furlong earned an MTV movie award for best breakthrough role, and a Saturn Sci-Fi award for best young actor. From there, he took an unconventional route through Hollywood, which led to his working with some of the top people in the business, in both studio and independent films. His work has included starring opposite Jeff Bridges in American Heart (1992) for which he was nominated for an IFP Spirit award for best supporting actor. He has also starred in A Home of Our Own (1993) with Kathy Bates, Little Odessa (1994) with Tim Roth, The Grass Harp (1995) with Walter Matthau and Barbet Schroeder's Before and After (1996). He also starred opposite Edward Norton in Tony Kaye's controversial and gripping drama American History X (1998) and in the hit comedy Pecker (1998). More recently, Furlong has been opposite Willem Dafoe in the prison drama Animal Factory (2000), directed by Steve Buscemi. He recently starred in Pupi Avati's 11th-century tale, I cavalieri che fecero l'impresa (2001) (\"The Knights of the Quest\").","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MzgxODkyMl5BMl5BanBnXkFtZTcwNTc1NDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000411","name":"Edward Furlong","nicknames":["Eddie"],"idIMDB":"nm0000411"},"actorId":"nm0000411","character":"Ravi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Stapleton","urlProfile":"http://www.imdb.com/name/nm0822944","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Mjg3NzYyMzJeQTJeQWpwZ15BbWU3MDIyMzc3OTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1971","placeOfBirth":" Springfield, Illinois, USA","birthName":"Christopher James Stapleton","height":"6' 1\" (1.85 m)","bio":"Christopher James Stapleton was born on February 18, 1971 in Sherman, Illinois, a small rural town outside Springfield. Perhaps his first interest in acting came when his parents, Jim and Phyllis, purchased a camcorder. It wasn't long before Chris and his younger twin brothers, Tony and Brian, began to shoot their own short movies. Chris further dabbled with performing at Griffin High School, where he was convinced by a teacher to audition for the theater club's latest production. He won the role and went on to play the lead in the musical, \"Carousel\", the following year. But it wasn't until college that Chris seriously considered a career in the entertainment business. In the fall of 1989, Stapleton received a full football scholarship to the University of Michigan. After starting as the team's punter his freshman year, he sustained a foot injury in training camp and was sidelined for the season. Frustrated, Chris focused his energy on acting. Throughout his college theater experience he was the lead in several productions including, \"The Time of Your Life\", \"As You Like It\", \"Andromache\" and the American classic, \"Our Town\". In 1993, he was named \"Performer of the Year\" by the Michigan Daily. Chris graduated from Michigan in '93 with a degree in Communications. Six months later, he packed up everything and road tripped to Hollywood. Shortly thereafter, he landed a guest spot on the popular soap, \"The Young and the Restless\". Since then he has appeared with Brooke Shields on \"Suddenly Susan\", Dixie Carter on \"Family Law\" and Martin Lawrence in Blue Streak (1999). Some of his other credits include, \"The X-Files\" \"JAG\", \"Providence\" and the independent feature films, Aurora (1998), _Black Friday (2000)_ and Ultimate Target (2000) the latter with Michael Madsen, star of such movies as \"Reservoir Dogs\" and \"Donnie Brasco.\" Currently, Chris can be seen in his recurring role of \"Dan\" on the new UPN show, \"As If\". He also finished principal photography on two projects this past summer, the first being a short entitled, \"The Death of Batman\", in which he dons the famous cape and cowl. The other is a gritty independent drama called \"American Dream\", where he plays the polar opposite of a hero, an intense drug enforcer named \"Shamus\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Mjg3NzYyMzJeQTJeQWpwZ15BbWU3MDIyMzc3OTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0822944","name":"Christopher Stapleton","idIMDB":"nm0822944"},"actorId":"nm0822944","character":"Barry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Gines","urlProfile":"http://www.imdb.com/name/nm3667527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxOTMyNTkzOV5BMl5BanBnXkFtZTcwMTAxNzAwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"William Gines is an actor, known for Crave (2012), Chi-Raq (2015) and Public Housing Unit (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxOTMyNTkzOV5BMl5BanBnXkFtZTcwMTAxNzAwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3667527","name":"William Gines","idIMDB":"nm3667527"},"actorId":"nm3667527","character":"Chuchi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Renda","urlProfile":"http://www.imdb.com/name/nm3495332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzk3MjUwNF5BMl5BanBnXkFtZTgwNTk3NTIxMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Michael Joseph Renda","height":"5' 9\" (1.75 m)","bio":"Michael Joseph Renda born in Detroit Michigan, began in the performing arts at age eight, he studied acting and performed in musical theatre for over fifteen years. Michael later found great opportunities in starting a career in acting, with a focus in film and television. He got involved and started booking work in the Detroit indie film community with supporting and principal roles. During this time Michael was picked up and signed with two of Michigan's top talent agencies, The I Group Model & Talent Management and Productions Plus - The Talent Shop. Later Michael Renda became a member of SAG-AFTRA after landing a supporting role as Peanut in the feature film Crave. Michael acts alongside Josh Lawson, Ron Pearlman, Edward Furlong and Emma Lung. Directed by Charles de Lauzirika. That same month Michael landed voice-over work for NHL'S Detroit Red Wings in an international radio broadcast and as MTV's lead super hero character Bashire for Liquid Comic's animated short 'The Silver Scorpion'. Michael Renda has years of professional training at credible institutions such as The Second City Detroit conservatory program for comedy improvisation. The Purple Rose Theatre (founded by actor Jeff Daniels) in voice and movement. Michael studied at Michigan Actors Studio for over three years, ranging in different levels of various focuses, from stage, film, improv, method acting (Lee Strasberg), character development, scene study, stage combat and Shakespeare. Michael also completed a one year intensive on the Eric Morris Technique at Detroit Performance Workshop. Michael has over two years of training in voice-over as well. Michael stays on top of his craft with ongoing training. Most recently Michael Renda landed a co-starring role in the award winning indie film Getting Out as Derek. Michael also stars in the awards winning short film 'The Time' as Shawn and has landed a national commercial for auto parts giant AutoZone, the commercial is currently airing on all major television networks. Michael is now living in Los Angeles, CA and is represented by his agent Michael Zanuck at the Michael Zanuck Agency (MZA).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzk3MjUwNF5BMl5BanBnXkFtZTgwNTk3NTIxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3495332","name":"Michael Renda","idIMDB":"nm3495332"},"actorId":"nm3495332","character":"Peanut","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helena Kash","urlProfile":"http://www.imdb.com/name/nm3684608","urlPhoto":"","biography":{"bio":"Helena Kash is an actress, known for Crave (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3684608","name":"Helena Kash","idIMDB":"nm3684608"},"actorId":"nm3684608","character":"Redhead","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Hanna","urlProfile":"http://www.imdb.com/name/nm0360209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2FlNzVlYzItMGE5MS00OWIyLWI3YTUtZTg3YWY5ZjdjZDJlL2ltYWdlXkEyXkFqcGdeQXVyMTE5NTMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1967","placeOfBirth":" Lincoln, Nebraska, USA","height":"5' 10\" (1.78 m)","bio":"Jim Hanna was born on October 2, 1967 in Lincoln, Nebraska, USA. He is an actor and director, known for The Middle (2009), Battle of the Sexes (2017) and Roadies (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2FlNzVlYzItMGE5MS00OWIyLWI3YTUtZTg3YWY5ZjdjZDJlL2ltYWdlXkEyXkFqcGdeQXVyMTE5NTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0360209","name":"Jim Hanna","idIMDB":"nm0360209"},"actorId":"nm0360209","character":"AA Boyfriend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tonya Cornelisse","urlProfile":"http://www.imdb.com/name/nm1397601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5Njk5ODMzN15BMl5BanBnXkFtZTcwNzI1MTc0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Tonya Cornelisse is an actress and writer, known for NCIS (2003), Parks and Recreation (2009) and Liminal (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5Njk5ODMzN15BMl5BanBnXkFtZTcwNzI1MTc0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1397601","name":"Tonya Cornelisse","idIMDB":"nm1397601"},"actorId":"nm1397601","character":"AA Girlfriend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John W. Hardy","urlProfile":"http://www.imdb.com/name/nm0362681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNDIzODc0OV5BMl5BanBnXkFtZTcwMDk2NzIxNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"John W. Hardy is an actor, known for Into the Storm (2014), Chain Reaction (1996) and Crave (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNDIzODc0OV5BMl5BanBnXkFtZTcwMDk2NzIxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362681","name":"John W. Hardy","idIMDB":"nm0362681"},"actorId":"nm0362681","character":"AA Speaker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Speight Jr.","urlProfile":"http://www.imdb.com/name/nm0817620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzQ4MjcwMF5BMl5BanBnXkFtZTcwMzk4NzA4OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1970","placeOfBirth":" Nashville, Tennessee, USA","height":"5' 8\" (1.73 m)","bio":"American actor Richard Speight Jr. was born in Nashville, Tennesese. He attended Montgomery Bell Academy and the University of Southern California's School of Theater, where he graduated cum laude. He began his acting career in the late 1980s, appearing in television movies like Love Leads the Way: A True Story, and Goodbye, Miss 4th of July. In 1990, Richard Speight Jr. landed the role of Leon on several episodes of Elvis. He next appeared on China Beach, Matlock and on the series Running the Halls. He also had a role on ER, and later played Miller West on Party of Five. In 1996, Speight was cast on the hit film Independence Day, playing the character of Ed. He was later featured in Built to Last, Sugar: The Fall of the West, L.A. Doctors, The Last Big Attraction, and JAG. Richard Speight Jr. began the year 2000 with a performance in In God We Trust. This was followed by a role on Big Monster on Campus, and then on North Beach. He was soon seen on Dave's Blind Date and Sam's Circus. He gained the most fame portraying Sgt. Warren 'Skip' Muck in the award-winning HBO series Band of Brothers. Later on, he became known for playing Lex on more than 20 episodes of The Agency. In 2005, Speight got a part on Alias, CSI: Miami, Into the West, and two episodes of Yes, Dear. He also received attention for his roles in Love for Rent and the Jason Reitman film Thank You for Smoking. Speight was also responsible for the voice of Pvt. Stephen Kelly on the video games Call of Duty 2 and Call of Duty 2: Big Red One. Subsequently, he was cast on Open Water 2: Adrift, and played a role on four episodes of Supernatural as the Trickster/Archangel Gabriel. He later joined the cast of the CBS series Jericho, portraying the character Bill. In 2008, he got the part of Oliver on the TV production The Consultants. Other than acting, Richard Speight Jr. is also talented in playing the guitar and bass.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzQ4MjcwMF5BMl5BanBnXkFtZTcwMzk4NzA4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0817620","name":"Richard Speight Jr.","nicknames":["Dick"],"idIMDB":"nm0817620"},"actorId":"nm0817620","character":"Master Rupert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jordan Trovillion","urlProfile":"http://www.imdb.com/name/nm3561899","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTUzMzA5MF5BMl5BanBnXkFtZTgwNTA1Njc2OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Jordan Trovillion is an actress, known for Jack Reacher (2012), A Matter of Faith (2014) and Secrets in the Walls (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTUzMzA5MF5BMl5BanBnXkFtZTgwNTA1Njc2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3561899","name":"Jordan Trovillion","idIMDB":"nm3561899"},"actorId":"nm3561899","character":"Young Emily","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lloyd James","urlProfile":"http://www.imdb.com/name/nm3667354","urlPhoto":"","biography":{"bio":"Lloyd James is an actor, known for Crave (2012) and Qing Lou Nu (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3667354","name":"Lloyd James","idIMDB":"nm3667354"},"actorId":"nm3667354","character":"Slave Jim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taras Los","urlProfile":"http://www.imdb.com/name/nm1272401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjU3Mzc1Nl5BMl5BanBnXkFtZTcwOTYxMTY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Taras Los is an actor, known for Into the Storm (2014), The Eyes Have It (2007) and Jimmy P. (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjU3Mzc1Nl5BMl5BanBnXkFtZTcwOTYxMTY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1272401","name":"Taras Los","idIMDB":"nm1272401"},"actorId":"nm1272401","character":"Yuri","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1535432","urlIMDB":"http://www.imdb.com/title/tt1535432","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Iron Helmet, LLC [us]"},"technical":{"runtime":["1 hr 53 min (113 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red One MX"],"laboratory":null,"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (4.5K) (source format)"],"printedFilmFormat":null},"rating":"5.3","metascore":"19","filmingLocations":[{"location":"Chicago, Illinois, USA"}],"awards":[{"award":"Fantasia Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Jury Prize","categories":[{"category":"Best First Film","names":[{"name":"Charles de Lauzirika","id":"nm1361273","role":"director"},{"name":"Iron Helmet","id":null,"role":"production company"}]}]}]},{"award":"Fantastic Planet Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Best Female Performance","names":[{"name":"Emma Lung","id":"nm1344335","role":null}]}]}]},{"award":"Toronto After Dark Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Special Award","categories":[{"category":"Best Editing","names":[{"name":"David Crowther","id":"nm0003934","role":null},{"name":"Iron Helmet","id":null,"role":null}]},{"category":"Best Title Sequence","names":[{"name":"Raleigh Stewart","id":"nm3902260","role":null},{"name":"Iron Helmet","id":null,"role":null}]}]}]}],"votes":"970","type":"Movie","companyCreditsSimple":[{"idCompany":"co0287636","name":"Iron Helmet"},{"idCompany":"co0233787","name":"Another Green World Productions"}],"keywords":{"keywords":["photographer","knocking on a door","close up of eye","pinwheel","syringe","hyperventilating","blood trail","struggle for gun","standing ovation","telephone disconnected","out of ammunition","harness racing","male star appears nude","female star appears nude","shot in the belly","condom","bare breasts","cut in half with a chainsaw","obscene finger gesture","blood spatter","head smashed with a sledge hammer","reference to bill gates","fellatio","fantasizing","riding a subway","party","reference to mr. magoo","upskirt","hairy chest","bare chested male","dead body","thumbs up gesture","disposing of a dead body","applause","digital camera","collage","following someone","vintage camera","pawn shop","ring","cheating husband","accidental killing","blackmail","accidental shooting","friendship between men","leather jacket","black leather jacket","schizotypal personality disorder","fantasy life","sex with neighbor","amateur theater","stage play","twenty something","neighbor neighbor relationship","female nudity","drug addict","recovering alcoholic","sex scene","subway train","pistol whip","homeless man","shot in the stomach","talking to self","car won't start","stolen gun","thug","revolver","pistol","crime scene photograph","scene of the crime","race track","dismembered body","detroit michigan","internal monologue","held at gunpoint","voice over narration","vigilantism","head bashed in","sledgehammer","vigilante","convenience store robbery","alcoholics anonymous meeting","thirty something","loner","daydream","armed robbery","daydreamer","fantasy sequence","policeman","police","dreamer","apartment building","neighbor","boyfriend girlfriend relationship","police detective","crime scene","camera","older man younger woman relationship","intergenerational friendship","reporter","feature film directorial debut","one word title","murder","surrealism","written by director"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:15:32"}}