{"data":{"movies":[{"title":"Ass Backwards","originalTitle":"","year":"2013","releaseDate":"20130121","directors":[{"name":"Chris Nelson","id":"nm0625245"}],"writers":[{"name":"June Diane Raphael","id":"nm2053085"},{"name":"Casey Wilson","id":"nm1988111"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODI1MjY0M15BMl5BanBnXkFtZTgwMDk0MzgxMDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy"],"plot":"\"Ass Backwards\" is an irreverent female buddy comedy about two childhood best friends who are pushing the age of 30 and not quite where they thought they'd be in life. When they run into their former beauty pageant nemesis, they decide to go on a road trip back home to recapture the pageant crown which eluded them as children. On the road, they face some hard truths about themselves and each other as they encounter spring breakers, strip clubs, a women's militant group and their favorite reality star. This heightened comedic awakening leads us into an unforgettable third act finale that is the girls' homecoming and final reckoning with their past, present and future.","simplePlot":"Two best friends (Kate and Chloe) embark on a cross country trip back to their hometown to attempt to win a pageant that eluded them as children.","actors":[{"actorName":"June Diane Raphael","urlProfile":"http://www.imdb.com/name/nm2053085","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjI4NjU0MV5BMl5BanBnXkFtZTcwNjk3ODI5NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1980","placeOfBirth":" Rockville Centre, Long Island, New York, USA","height":"5' 9\" (1.75 m)","bio":"June Diane Raphael was born on January 4, 1980 in Rockville Centre, Long Island, New York, USA. She is an actress and writer, known for Zodiac (2007), Bride Wars (2009) and Forgetting Sarah Marshall (2008). She has been married to Paul Scheer since October 10, 2009. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjI4NjU0MV5BMl5BanBnXkFtZTcwNjk3ODI5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2053085","name":"June Diane Raphael","idIMDB":"nm2053085"},"actorId":"nm2053085","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Casey Wilson","urlProfile":"http://www.imdb.com/name/nm1988111","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDYwMDA3MF5BMl5BanBnXkFtZTgwNDMxNTI1MDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1980","placeOfBirth":" Alexandria, Virginia, USA","birthName":"Cathryn Rose Wilson","height":"5' 8\" (1.73 m)","bio":"Casey Wilson was born on October 24, 1980 in Alexandria, Virginia, USA as Cathryn Rose Wilson. She is an actress and writer, known for Gone Girl (2014), Bride Wars (2009) and Julie & Julia (2009). She has been married to David Caspe since May 25, 2014. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDYwMDA3MF5BMl5BanBnXkFtZTgwNDMxNTI1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1988111","name":"Casey Wilson","idIMDB":"nm1988111"},"actorId":"nm1988111","character":"Chloe","urlCharacter":"http://www.imdb.com/character/ch0297793","main":true},{"actorName":"Jon Cryer","urlProfile":"http://www.imdb.com/name/nm0001083","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NTkzNDY1OF5BMl5BanBnXkFtZTYwMTQ3ODU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1965","placeOfBirth":" New York City, New York, USA","birthName":"Jonathan Niven Cryer","height":"5' 9\" (1.75 m)","bio":"Jon Cryer was born on April 16, 1965 in New York City, New York, USA as Jonathan Niven Cryer. He is an actor, known for Two and a Half Men (2003), Pretty in Pink (1986) and Hot Shots! (1991). He has been married to Lisa Joyner since June 16, 2007. They have one child. He was previously married to Sarah Trigger.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NTkzNDY1OF5BMl5BanBnXkFtZTYwMTQ3ODU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001083","name":"Jon Cryer","idIMDB":"nm0001083"},"actorId":"nm0001083","character":"Dean","urlCharacter":"http://www.imdb.com/character/ch0297790","main":true},{"actorName":"Vincent D'Onofrio","urlProfile":"http://www.imdb.com/name/nm0000352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1959","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Vincent Phillip D'Onofrio","height":"6' 3½\" (1.92 m)","bio":"Vincent Phillip D'Onofrio was born on June 30, 1959 in Brooklyn, New York, to Phyllis, a restaurant manager and server, and Gene D'Onofrio, a theater production assistant and interior designer. He is of Italian descent and has two older sisters. He studied at the Actors Studio and the American Stanislavski Theatre. Vincent D'Onofrio is known as an \"actor's actor\". The wide variety of roles he has played and the quality of his work have earned him a reputation as a versatile talent. His first paid role was in Off-Broadway's \"This Property Is Condemned\". He continued appearing in plays and worked as a bouncer, a bodyguard and a delivery man. In 1984, he made his Broadway debut in \"Open Admissions\", followed by work in numerous other stage plays. In 2012, D'Onofrio returned to teach at the Lee Strasberg Theater & Film Institute. As a film actor, D'Onofrio's career break came when he played a mentally unbalanced recruit in Full Metal Jacket (1987), directed by the renowned Stanley Kubrick. For this role D'Onofrio gained nearly 70 pounds. He had a major role in Dying Young (1991), and appeared prominently in the box-office smash Men in Black (1997) as the bad guy (Edgar \"The Bug\"). Other films of note in which he has appeared are Mystic Pizza (1988), JFK (1991), The Player (1992), Ed Wood (1994), The Cell (2000), The Break-Up (2006) and Jurassic World (2015). In 1996, D'Onofrio garnered critical acclaim along with co-star Renée Zellweger for The Whole Wide World (1996), which he helped produce. He also made a guest appearance in Homicide: Life on the Street: The Subway (1997), where he played an accident victim who could not be rescued and was destined to die. For this performance he won an Emmy nomination. In 2000, he both produced and starred in Steal This Movie (2000), a biopic of radical leader Abbie Hoffman. In 2001, D'Onofrio took the role which has likely given him his greatest public recognition: Det. Robert Goren, the lead character in the TV series Law & Order: Criminal Intent (2001). Goren is based on Sherlock Holmes but, instead of relying upon physical evidence like Holmes, D'Onofrio's character focuses on psychology to identify the perpetrators, whom he often draws into confessing or yielding condemning evidence. He played the part for 10 years. In his career D'Onofrio's various film characters have included a priest, a bisexual former porn star, a hijacker, a serial killer, Orson Welles, a space alien, a 1960s radical leader, a pulp fiction writer, an ingenious police investigator and Stuart Smalley's dope-head brother. His on-screen love interests have included Julia Roberts, Cameron Diaz, Renée Zellweger, Marisa Tomei, Tracey Ullman, Rebecca De Mornay and Lili Taylor. One of his latest roles is in Marvel's Daredevil (2015) as Daredevil's nemesis, Wilson Fisk. He lives in Manhattan with his wife and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000352","name":"Vincent D'Onofrio","nicknames":["The Human Chameleon","Noffy"],"idIMDB":"nm0000352"},"actorId":"nm0000352","character":"Bruce","urlCharacter":"http://www.imdb.com/character/ch0297791","main":true},{"actorName":"Alicia Silverstone","urlProfile":"http://www.imdb.com/name/nm0000224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg4MDQ1MTc2Ml5BMl5BanBnXkFtZTgwOTA2MjQ4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1976","placeOfBirth":" San Francisco, California, USA","height":"5' 5\" (1.65 m)","bio":"Alicia Silverstone was born on October 4, 1976 in San Francisco, California, the youngest of three children. She is the daughter of Didi (Radford), a former flight attendant, and Monty Silverstone, a real-estate investor. Her English-born father is from a Jewish family, while her Scottish-born mother converted to Judaism. Alicia's career began at the tender age of six, when her father took some photos of his young daughter, which eventually led to her getting several television commercials. After a guest spot on The Wonder Years (1988) as a literal \"dream girl\", she moved on to movies. She landed a role in The Crush (1993), a sort of Fatal Attraction (1987) for teenagers in which she portrayed a disturbed young girl obsessed with an older man. The nasty little role did not impress the critical establishment but it wowed its target audience: teenagers. In fact, the role won her the 1994 MTV Movie Award for \"Best Villain\" and \"Breakthrough Performance\". It is interesting to note that during the filming of the movie, Alicia became an emancipated minor in order to get around child labor laws which would have interfered with her working hours. She was a dedicated actress from early on. The film also caught the attention of Aerosmith, who hired her to appear in a string of their music videos. The first of them, \"Cryin'\", was voted the #1 video of all time on MTV. Silverstone was definitely a hit with the MTV crowd, but larger commercial success still eluded her. That all changed when she landed the role of Cher in Amy Heckerling's Clueless (1995). Cher was the antithesis of Alicia's role in The Crush; this time around, she was a rich, naive yet endearing girl from Beverly Hills in search of love in the 1990s. The film was a huge box-office hit and wowed both audiences and critics alike and demonstrated Alicia's strength and bankability. She was hailed as the woman of the hour, and branded the spokeswoman for an emerging young generation. She signed a deal with Columbia TriStar worth $10 million and got the coveted role of Batgirl in the Batman franchise. Also, as part of the package, she got a three-year first-look deal for her own production company, First Kiss Productions. The first film released by First Kiss was Excess Baggage (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg4MDQ1MTc2Ml5BMl5BanBnXkFtZTgwOTA2MjQ4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000224","name":"Alicia Silverstone","nicknames":["Queen Slice"],"idIMDB":"nm0000224"},"actorId":"nm0000224","character":"Laurel","urlCharacter":"http://www.imdb.com/character/ch0297789","main":true},{"actorName":"Brian Geraghty","urlProfile":"http://www.imdb.com/name/nm1310016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzY3NjUyNV5BMl5BanBnXkFtZTcwODk5NDU2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1975","placeOfBirth":" Toms River, New Jersey, USA","birthName":"Brian Timothy Geraghty","height":"5' 10\" (1.78 m)","bio":"Originally from Jersey, Brian Geraghty graduated from The Neighborhood Playhouse School of Theatre and then began his professional career in New York City before moving to Los Angeles. He has previously enjoyed being a surf instructor and continues to surf in his free time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzY3NjUyNV5BMl5BanBnXkFtZTcwODk5NDU2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1310016","name":"Brian Geraghty","idIMDB":"nm1310016"},"actorId":"nm1310016","character":"Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Odenkirk","urlProfile":"http://www.imdb.com/name/nm0644022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1Njg1NzI1Ml5BMl5BanBnXkFtZTcwNTE5ODk1OA@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1962","placeOfBirth":" Naperville, Illinois, USA","birthName":"Robert John Odenkirk","height":"5' 11\" (1.8 m)","bio":"Robert John Odenkirk was born in Berwyn, Illinois, to Barbara (Baier) and Walter Odenkirk, who worked in printing. His ancestry includes German and Irish. He grew up in Naperville, IL, the second of seven children. He worked as a DJ for WIDB, his college radio station at Southern Illinois University Carbondale. Three credits shy of graduation, he moved to Chicago. He began work there in local improv workshops. He also did open-mic stand-up comedy for several years. In Chicago, he became friends with Robert Smigel, who would later help him become a writer for Saturday Night Live (1975). In 1987, Bob was hired as a writer for Saturday Night Live (1975) and in 1989 he went on to win an Emmy for his writing work. He worked on the show from season 13 to 20 (1987-1995). However, he had trouble getting his work on the air, so he began work as a writer for Get a Life (1990) starring Chris Elliott. The show was quickly canceled, but he was soon hired as writer for The Dennis Miller Show (1992). On that show he made his acting debut and was noticed by Ben Stiller, who later hired him as a writer and actor for The Ben Stiller Show (1992). The show only lasted for 13 episodes, but Bob won another Emmy for his writing. After The Ben Stiller Show (1992) was canceled, Bob made recurring appearances (1993-1998) on The Larry Sanders Show (1992) as Stevie Grant, Larry's hyperactive agent. He also wrote for Late Night with Conan O'Brien (1993) during 1993-94. During this time Bob hooked up with fellow The Ben Stiller Show (1992) writer David Cross, also a stand-up comedian. They started doing sketch-comedy shows together in Los Angeles. In 1995, they got their own show on HBO (Mr. Show with Bob and David (1995)). The show lasted for four seasons and 30 episodes. After Mr. Show with Bob and David (1995) ended, Bob wrote Run Ronnie Run (2002) and directed three feature films (Melvin Goes to Dinner (2003), Let's Go to Prison (2006) and The Brothers Solomon (2007)). After 1998, he has also made many guest appearances on TV shows like Just Shoot Me! (1997), 3rd Rock from the Sun (1996), Curb Your Enthusiasm (2000), Ed (2000), Everybody Loves Raymond (1996), Less Than Perfect (2002), Arrested Development (2003), How I Met Your Mother (2005) and Weeds (2005). In 2009, he appeared on many episodes of Breaking Bad (2008) as Saul Goodman, a shyster lawyer. He is also in Son of Morning (2011) and Operation: Endgame (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1Njg1NzI1Ml5BMl5BanBnXkFtZTcwNTE5ODk1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0644022","name":"Bob Odenkirk","idIMDB":"nm0644022"},"actorId":"nm0644022","character":"Pageant MC","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Scheer","urlProfile":"http://www.imdb.com/name/nm1179677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzczNjg5NV5BMl5BanBnXkFtZTgwOTgzMTAyNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1976","placeOfBirth":" New Hyde Park, New York, USA","birthName":"Paul Christian Scheer","height":"5' 11½\" (1.82 m)","bio":"Scheer is an American actor, comedian, writer, director, and producer. Scheer was born in Huntington, New York and graduated from New York University where he majored in Communication and Education. He stars on the FX series The League (2009), the ABC sitcom Fresh Off the Boat (2015), and Hulu comedy series The Hotwives of Orlando (2014), which he also executive produces. Scheer co-created and starred in the cult MTV sketch series Human Giant (2007) as well as the Adult Swim series NTSF:SD:SUV (2011). His films include supporting roles in Army of One (2016), Opening Night (2016), Daddy's Home (2015), Hell Baby (2013), Ass Backwards (2013), Clear History (2013), and Hell and Back (2015). He starred in a web series for JASH called The ArScheerio Paul Show (2013), which recreates classic moments from the The Arsenio Hall Show (1989) and was dubbed 2013's best viral video of the year by USA Today. Scheer also has made appearances on programs such as Burning Love (2012), 30 Rock (2006), Best Week Ever with Paul F. Tompkins (2004), Childrens Hospital (2008), Funny or Die Presents... (2010), Happy Endings (2011) and Yo Gabba Gabba! (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzczNjg5NV5BMl5BanBnXkFtZTgwOTgzMTAyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1179677","name":"Paul Scheer","idIMDB":"nm1179677"},"actorId":"nm1179677","character":"Strip Club Owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandy Martin","urlProfile":"http://www.imdb.com/name/nm0553036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTMyMTYzMV5BMl5BanBnXkFtZTgwMTU5OTM4NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1950","placeOfBirth":"","bio":"Sandy Martin began her acting career at the age of 15 touring the country with Martha Raye in Good-bye Charley. After several East Coast touring productions she settled in New York City. Martin began working in many of New York City's esteemed theatres: Lincoln Center, La Mama, Ensemble Studio Theatre, Playwrights Horizon, The American Place Theatre acting in over 70 stage productions. Martin was a founding company member for two renowned New York City's theatre companies: the Wpa Theatre and the Perry Street Theatre. During this period she played opposite Armand Assante, Christopher Lloyd, John Savage and Ellen Barkin. Martin then joined the improvisational troupe, Second City. First, in New York City at the Eastside Playhouse and the Plaza Hotel before moving on as a company member in Chicago. There she worked with John Belushi, Bill & Brian Murray, and Harold Ramis. In 1976 Martin was asked to guest direct senior plays at the American Academy Of Dramatic Arts in both New York and Los Angeles. During this period she co-founded Hothouse Stage Co. with Susan Streitfeld. Together they produced (with Streitfeld directing and Martin acting) the award winning productions of: Hothouse (Matrix Theatre), East/West Game by John Cassavetes, (Co-staring with Nick Cassavetes at the Callboard Theatre) and Welcome to Andromeda (Matrix Theatre) ending their tenure with Best Revival of the Year - L.A. Weekly 1991, The Killing of Sister George. Sandy went on to direct - Line by Israel Horovitz (Best Direction Award - Dramalogue / (Matrix Theatre), Saturday Night by Jerome Kass (Starring Robert Pastorelli / Cast Theatre), Una Vida (Cheech Merin / Actor's Studio), Talking With... (Starring Cch Pounder). Martin also directed a reading of The Team by Terrence Feely, starring Kevin Spacey, Lenny Von Dohlan and Sheryl Lee. After their enormous hit with the stage play, Hothouse by Megan Terry, Sandy wrote the screen adaptation which she packaged with her good friends, Amy Madigan and Ed Harris, both whom she acted with in the award winning world premiere of, Prairie Avenue by Edward Allen Baker, both in New York City. (at Est.) & Los Angeles's Callboard Theatre. Esparza/Katz Prod. quickly acquired Hothouse, and thus began a long working relationship with Moctesume Esparza and Robert Katz that lasted over ten years. Starting as a Development Executive, Sandy worked her way up to being the Associate Producer of the company, working on the critically acclaimed feature films: Milagro Bean Field Wars and Selena. She was also Associate Producer of Gettysburg for Turner and Bowl Of Beings starring the famed comedy troupe, Culture Clash for Great Performances on PBS. During her tenure with Esparza/Katz Prod., Martin wrote several treatments and screenplays; Underdogs, which was optioned by Avnet/Kerner (Risky Business, Fried Green Tomatoes), Thirteenth Duke, commissioned by Marchelo Danon (Producer of the original, La Cage aux Folles), The James Dean Story (Mini-series - Marvin Worth Prod.), she also co-wrote a musical revival of Reefer Madness with Dan Gerrity - directed by the late, great Ron Link. Martin penned Ms. Prez a screenplay that she co-authored with Patrick O'Neal about the first African American Woman President. Martin produced and directed two documentaries. The Great Meddler about the founding of the American Society for the Protection Of Cruelty To Animals) and The United Farm Workers - A Tribute to Caesar Chavez. The short, Lovely Rita, stars her friend, Cch Pounder - (The Shield) Martin was also President of Edward James Olmos's production company, Olmos Prod. at ABC for four years in early 2000. Thrilled to go back to acting, Martin was very happy to score a recurring role on HBO's drama, Big Love as the creepy he/she Selma Green, as well as the comedy, It's Always Sunny in Philadelphia, as Mac's Mom. Sandy has guest starred on numerous hit shows: CSI, Nip Tuck, Shameless, Saving Grace, Weeds, Cold Case, 2 Broke Girls, Parenthood, The Closer, Rizzoli & Isles etc. She looks forward to continuing her role as Grandma from Napoleon Dynamite for Fox's animated version of the 2004 mega indie hit. She played the lead in Tennessee William's last full-length play; A House Not Meant To Stand in it's critically acclaimed West Coast Premiere at the Fountain Theatre in 2011. Her performance was nominated for an Ovation Award - Best Female Lead in 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTMyMTYzMV5BMl5BanBnXkFtZTgwMTU5OTM4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0553036","name":"Sandy Martin","idIMDB":"nm0553036"},"actorId":"nm0553036","character":"Qwen","urlCharacter":"http://www.imdb.com/character/ch0297794","main":true},{"actorName":"Marcia Jean Kurtz","urlProfile":"http://www.imdb.com/name/nm0476040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTA2MjM2MF5BMl5BanBnXkFtZTcwMTI5MDg1MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Marcia Jean Kurtz was born in The Bronx, New York, USA. She is an actress, known for Requiem for a Dream (2000), Black Swan (2010) and Dog Day Afternoon (1975).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTA2MjM2MF5BMl5BanBnXkFtZTcwMTI5MDg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476040","name":"Marcia Jean Kurtz","idIMDB":"nm0476040"},"actorId":"nm0476040","character":"Barb","urlCharacter":"http://www.imdb.com/character/ch0297800","main":true},{"actorName":"Lea DeLaria","urlProfile":"http://www.imdb.com/name/nm0216466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMxMzY0NDMxNF5BMl5BanBnXkFtZTgwMTQwMzQ1MDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1958","placeOfBirth":" Belleville, Illinois, USA","height":"5' 1\" (1.55 m)","bio":"Lea DeLaria was born on May 23, 1958 in Belleville, Illinois, USA. She is an actress, known for Orange Is the New Black (2013), Edge of Seventeen (1998) and The First Wives Club (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMxMzY0NDMxNF5BMl5BanBnXkFtZTgwMTQwMzQ1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0216466","name":"Lea DeLaria","idIMDB":"nm0216466"},"actorId":"nm0216466","character":"Deb","urlCharacter":"http://www.imdb.com/character/ch0297795","main":true},{"actorName":"Meg Hatton","urlProfile":"http://www.imdb.com/name/nm6029834","urlPhoto":"","biography":{"bio":"Meg Hatton is an actress, known for Ass Backwards (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6029834","name":"Meg Hatton","idIMDB":"nm6029834"},"actorId":"nm6029834","character":"Little Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ursula Parker","urlProfile":"http://www.imdb.com/name/nm3425494","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ2NzMxNjgxMF5BMl5BanBnXkFtZTgwODIxODA3ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 2003","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Ursula Clare Parker","bio":"Ursula Parker is an actress and a violinist attending a school for academically gifted students. At age 5 she was approached by an acting agent and since played in several movies and TV shows where she was fortunate to work with such actors as Nicole Kidman, Tilda Swinton, Al Pacino, Channing Tatum, Anna Paquin, Bryan Cranston, etc. Ursula is a regular on the Emmy winning FX series \"Louie\" where she plays Louis CK's younger daughter, Jane. She is the daughter of Brian Parker, an American musician; and Jerica Oblak, a Slovenian composer teaching at NYU. Ursula started playing the violin at 3, and has since performed as a violinist on TV, in films as well as at various concerts, including Carnegie Hall. She was 6 when she first performed as a soloist with an orchestra and 10 when she was the soloist with a professional symphony orchestra. After taking violin lessons with Nicole DiCecco, Ursula was accepted into Naoko Tanaka's private studio at Juilliard. In addition, she has studied ballet at SAB and BBT, and has earned a high green belt in taekwondo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ2NzMxNjgxMF5BMl5BanBnXkFtZTgwODIxODA3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3425494","name":"Ursula Parker","idIMDB":"nm3425494"},"actorId":"nm3425494","character":"Little Chloe","urlCharacter":"http://www.imdb.com/character/ch0297793","main":true},{"actorName":"Kaylyn Slevin","urlProfile":"http://www.imdb.com/name/nm3853111","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODQzNTAxMl5BMl5BanBnXkFtZTgwODExOTUwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5½\" (1.66 m)","bio":"Kaylyn Slevin is an actress, known for Ass Backwards (2013), D.I.N.K.s (Double Income, No Kids) (2011) and Beast (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODQzNTAxMl5BMl5BanBnXkFtZTgwODExOTUwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3853111","name":"Kaylyn Slevin","idIMDB":"nm3853111"},"actorId":"nm3853111","character":"Little Laurel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deanna Cheng","urlProfile":"http://www.imdb.com/name/nm1007930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjM5NDA1MF5BMl5BanBnXkFtZTcwOTE1NzkyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Deanna Cheng is a comic actress, writer, and director. She co-hosts the popular podcast OMFG! on the Earwolf network. OMFG! is a deep dive into all things millennial. Deanna directed HGTV star Laurie March in her web series, In the Workshop (2014) and One Day, One Change (2013) She can be found acting in shows like Marry Me (2014) , Filthy Preppy Teen$ (2015) and _\"The Hotwives of Las Vegas\" (2015)_","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjM5NDA1MF5BMl5BanBnXkFtZTcwOTE1NzkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1007930","name":"Deanna Cheng","idIMDB":"nm1007930"},"actorId":"nm1007930","character":"Lizbeth","urlCharacter":"http://www.imdb.com/character/ch0297811","main":true}],"seasons":[],"idIMDB":"tt1509788","urlIMDB":"http://www.imdb.com/title/tt1509788","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Sister Spirit LLC"},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.2","metascore":"37","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"UNRATED","awards":[],"votes":"1,860","type":"Movie","companyCreditsSimple":[{"idCompany":"co0301911","name":"Prominent Pictures"},{"idCompany":"co0001099","name":"Worldview Entertainment"},{"idCompany":"co0215483","name":"Indion Entertainment Group"}],"keywords":{"keywords":["best friends","strip club","road trip","forest","revenge","cemetery","public urination","dumb blonde","jail","drug dealer","rival","lesbian","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:25:56"}}