{"data":{"movies":[{"title":"Exodus: Gods and Kings","originalTitle":"","year":"2014","releaseDate":"20141212","directors":[{"name":"Ridley Scott","id":"nm0000631"}],"writers":[{"name":"Adam Cooper","id":"nm0177836"},{"name":"Bill Collage","id":"nm0171651"}],"runtime":"150 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDY0NjkxNl5BMl5BanBnXkFtZTgwNTM3NTA0MzE@._V1.jpg","countries":["UK","Spain","USA"],"languages":["English"],"genres":["Action","Adventure","Drama"],"plot":"Epic adventure Exodus: Gods and Kings is the story of one man's daring courage to take on the might of an empire. Using state of the art visual effects and 3D immersion, Scott brings new life to the story of the defiant leader Moses as he rises up against the Egyptian Pharaoh Ramses, setting 600,000 slaves on a monumental journey of escape from Egypt and its terrifying cycle of deadly plagues.","simplePlot":"The defiant leader Moses rises up against the Egyptian Pharaoh Ramses, setting 600,000 slaves on a monumental journey of escape from Egypt and its terrifying cycle of deadly plagues.","actors":[{"actorName":"Christian Bale","urlProfile":"http://www.imdb.com/name/nm0000288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk4MjQ4MF5BMl5BanBnXkFtZTcwMzExODQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1974","placeOfBirth":" Haverfordwest, Pembrokeshire, Wales, UK","birthName":"Christian Charles Philip Bale","height":"6' (1.83 m)","bio":"Christian Charles Philip Bale was born in Pembrokeshire, Wales, UK on January 30, 1974, to English parents Jennifer \"Jenny\" (James) and David Charles Howard Bale. His mother was a circus performer and his father, who was born in South Africa, was a commercial pilot. The family lived in different countries throughout Bale's childhood, including England, Portugal, and the United States. Bale acknowledges the constant change was one of the influences on his career choice. His first acting job was a cereal commercial in 1983; amazingly, the next year, he debuted on the West End stage in \"The Nerd\". A role in the 1986 NBC mini-series Anastasia: The Mystery of Anna (1986) caught Steven Spielberg's eye, leading to Bale's well-documented role in Empire of the Sun (1987). For the range of emotions he displayed as the star of the war epic, he earned a special award by the National Board of Review for Best Performance by a Juvenile Actor. Adjusting to fame and his difficulties with attention (he thought about quitting acting early on), Bale appeared in Kenneth Branagh's 1989 adaptation of Shakespeare's Henry V (1989) and starred as Jim Hawkins in a TV movie version of Treasure Island (1990). Bale worked consistently through the 1990s, acting and singing in Newsies (1992), Swing Kids (1993), Little Women (1994), The Portrait of a Lady (1996), The Secret Agent (1996), Metroland (1997), Velvet Goldmine (1998), All the Little Animals (1998), and A Midsummer Night's Dream (1999). Toward the end of the decade, with the rise of the Internet, Bale found himself becoming one of the most popular online celebrities around, though he, with a couple notable exceptions, maintained a private, tabloid-free mystique. Bale roared into the next decade with a lead role in American Psycho (2000), director Mary Harron's adaptation of the controversial Bret Easton Ellis novel. In the film, Bale played a murderous Wall Street executive obsessed with his own physicality - a trait for which Bale would become a specialist. Subsequently, the 10th Anniversary issue for \"Entertainment Weekly\" crowned Bale one of the \"Top 8 Most Powerful Cult Figures\" of the past decade, citing his cult status on the Internet. EW also called Bale one of the \"Most Creative People in Entertainment\", and \"Premiere\" lauded him as one of the \"Hottest Leading Men Under 30\". Bale was truly on the Hollywood radar at this time, and he turned in a range of performances in the remake Shaft (2000), Captain Corelli's Mandolin (2001), the balmy Laurel Canyon (2002), and Reign of Fire (2002), a dragons-and-magic commercial misfire that has its share of defenders. Two more cult films followed: Equilibrium (2002) and The Machinist (2004), the latter of which gained attention mainly due to Bale's physical transformation - he dropped a reported 60+ pounds for the role of a lathe operator with a secret that causes him to suffer from insomnia for over a year. Bale's abilities to transform his body and to disappear into a character influenced the decision to cast him in Batman Begins (2005), the first chapter in Christopher Nolan's definitive trilogy that proved a dark-themed narrative could resonate with audiences worldwide. The film also resurrected a character that had been shelved by Warner Bros. after a series of demising returns, capped off by the commercial and critical failure of Batman & Robin (1997). A quiet, personal victory for Bale: he accepted the role after the passing of his father in late 2003, an event that caused him to question whether he would continue performing. Bale segued into two indie features in the wake of Batman's phenomenal success: The New World (2005) and Harsh Times (2005). He continued working with respected independent directors in 2006's Rescue Dawn (2006), Werner Herzog's feature version of his earlier, Emmy-nominated documentary, Little Dieter Needs to Fly (1997). Leading up to the second Batman film, Bale starred in The Prestige (2006), the remake of 3:10 to Yuma (2007), and a reunion with director Todd Haynes in the experimental Bob Dylan biography, I'm Not There. (2007). Anticipation for The Dark Knight (2008) was spun into unexpected heights with the tragic passing of Heath Ledger, whose performance as The Joker became the highlight of the sequel. Bale's graceful statements to the press reminded us of the days of the refined Hollywood star as the second installment exceeded the box-office performance of its predecessor. Bale's next role was the eyebrow-raising decision to take over the role of John Connor in the Schwarzenegger-less Terminator Salvation (2009), followed by a turn as federal agent Melvin Purvis in Michael Mann's Public Enemies (2009). Both films were hits but not the blockbusters they were expected to be. For all his acclaim and box-office triumphs, Bale would earn his first Oscar in 2011 in the wake of The Fighter (2010)'s critical and commercial success. Bale earned the Best Supporting Actor award for his portrayal of Dicky Eklund, brother to and trainer of boxer \"Irish\" Micky Ward, played by Mark Wahlberg. Bale again showed his ability to reshape his body with another gaunt, skeletal transformation. Bale then turned to another auteur, Yimou Zhang, for the epic Sacrifices of War (2011), in which Bale portrayed a priest trapped in the midst of the Rape of Nanking. Bale earned headlines for his attempt to visit with Chinese civil-rights activist Chen Guangcheng, which was blocked by the Chinese government. Bale capped his role as Bruce Wayne/Batman in The Dark Knight Rises (2012); in the wake of the Aurora, Colorado tragedy, Bale made a quiet pilgrimage to the state to visit with survivors of the attack that left theatergoers dead and injured. He also starred in the thriller Out of the Furnace (2013) with Crazy Heart (2009) writer/director Scott Cooper, and the drama-comedy American Hustle (2013), reuniting with David O. Russell. Bale will re-team with The New World (2005) director Terrence Malick for two upcoming projects: Knight of Cups (2015) and an as-yet-untitled drama. In his personal life, he devotes time to charities including Greenpeace and the World Wildlife Foundation. He lives with his wife, Sibi Blazic, and their daughter, Emmeline.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk4MjQ4MF5BMl5BanBnXkFtZTcwMzExODQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000288","name":"Christian Bale","idIMDB":"nm0000288"},"actorId":"nm0000288","character":"Moses","urlCharacter":"http://www.imdb.com/character/ch0006190","main":true},{"actorName":"Joel Edgerton","urlProfile":"http://www.imdb.com/name/nm0249291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODI1ODk4NzdeQTJeQWpwZ15BbWU3MDkwNjkzOTY@._V1._SX214_SY317_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1974","placeOfBirth":" Blacktown, New South Wales, Australia","height":"5' 11\" (1.8 m)","bio":"Joel Edgerton was born on June 23, 1974 in Blacktown, New South Wales, Australia, to Marianne and Michael Edgerton, who is a solicitor and property developer. His brother is filmmaker Nash Edgerton. He went to Hills Grammar School in the Western Suburbs of Sydney, and after leaving, he attended Nepean Drama School in 1994. Joel has done many projects on stage and off, but most people will recognize him from his work on the Australian television series The Secret Life of Us (2001), in which he played William McGill. This gave him his first big break through in the television industry. For this role, he was nominated in 2001 for an AFI Award. As well as \"The Secret Life of Us\", he has also appeared in other television projects such as The Three Stooges (2000), Dossa and Joe (2002), Secret Men's Business (1999), Never Tell Me Never (1998) and Saturn's Return (2001). Joel has done a lot of work on the theatrical stage having played King Henry in \"Henry V\", Prince Hal in \"Henry III\", and others including \"Road\", \"Third World Blues\" and \"Dead White Males\". As well as acting, he has also starred, co-written and produced the short movie Bloodlock (1998). His first international break came from when he played Uncle Owen Lars in Star Wars: Episode II - Attack of the Clones (2002). Since then, he has also starred in Ned Kelly (2003), King Arthur (2004), Star Wars: Episode III - Revenge of the Sith (2005) and Kinky Boots (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODI1ODk4NzdeQTJeQWpwZ15BbWU3MDkwNjkzOTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249291","name":"Joel Edgerton","idIMDB":"nm0249291"},"actorId":"nm0249291","character":"Ramses","urlCharacter":"http://www.imdb.com/character/ch0006186","main":true},{"actorName":"John Turturro","urlProfile":"http://www.imdb.com/name/nm0001806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNjgwMjMxMF5BMl5BanBnXkFtZTcwNjUwOTc3NQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1957","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"John Michael Turturro","height":"6' 0½\" (1.84 m)","bio":"Highly talented, lightly built American actor who always looks unsettled and jumpy has become a favourite of cult/arthouse film aficionados with his compelling performances in a broad range of cinematic vehicles. Turturro was born in Brooklyn, New York, to Italian-American parents, Katherine, a jazz singer, and Nicholas Turturro, a construction worker and carpenter. His brother, also named Nicholas Turturro, is an actor, and actress Aida Turturro is his cousin. Turturro has become a regular in the thought provoking films of Spike Lee and the off the wall comedies of Joel Coen & Ethan Coen. His wonderful performances include as the highly agitated \"Pino\" in Do the Right Thing (1989), as an intellectual playwright in Barton Fink (1991), a pedophile tenpin bowler in The Big Lebowski (1998), a confused boyfriend in Jungle Fever (1991) and as the voice of Harvey the dog in Summer of Sam (1999). Turturro has continued to appeal to audiences despite his unconventional looks and the often annoying onscreen mannerisms of his characters which he used to great effect in films such as his blue collar tale of warring brothers in the construction business, Mac (1992), as the irate, dumped game show contestant, Herbie Stempel, in Robert Redford's dynamic Quiz Show (1994). One of modern American cinema's gems of acting, Turturro remains in strong demand for his high calibre thespian talents.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNjgwMjMxMF5BMl5BanBnXkFtZTcwNjUwOTc3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001806","name":"John Turturro","idIMDB":"nm0001806"},"actorId":"nm0001806","character":"Seti","urlCharacter":"http://www.imdb.com/character/ch0006235","main":true},{"actorName":"Aaron Paul","urlProfile":"http://www.imdb.com/name/nm0666739","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTY5NjI5NV5BMl5BanBnXkFtZTcwODA4MjM0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1979","placeOfBirth":" Emmett, Idaho, USA","birthName":"Aaron Paul Sturtevant","height":"5' 8\" (1.73 m)","bio":"Aaron Paul was born Aaron Paul Sturtevant in Emmett, Idaho, to Darla (Haynes) and Robert Sturtevant, a retired Baptist minister. While growing up, Paul took part in church programs, and performed in plays. He attended Centennial High School in Boise, Idaho. It was there, in eighth grade, that Aaron decided he wanted to become an actor. He joined the theatre department and became obsessed with the idea of acting for a living. After finishing school, Aaron moved to Los Angeles. During the late '90's, he worked as an usher at the Universal Studios Movie Theatre in Hollywood. His television debut was in an episode of Beverly Hills, 90210 (1990), which was followed by an appearance in another Aaron Spelling series, Melrose Place (1992). On the big screen, Aaron played the estranged son of Jeff Bridges in K-PAX (2001), and Tom Cruise's brother-in-law in Mission: Impossible III (2006). After appearing in several roles on American television, his breakthrough role came as \"Jesse Pinkman\" in the AMC series Breaking Bad (2008). The character was only supposed to last for one season, but series creator Vince Gilligan changed his mind, due to Aaron's chemistry with Bryan Cranston. He has won three Emmy Awards for \"Outstanding Supporting Actor in a Drama Series\" for this role (2010, 2012 and 2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTY5NjI5NV5BMl5BanBnXkFtZTcwODA4MjM0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0666739","name":"Aaron Paul","idIMDB":"nm0666739"},"actorId":"nm0666739","character":"Joshua","urlCharacter":"http://www.imdb.com/character/ch0006234","main":true},{"actorName":"Ben Mendelsohn","urlProfile":"http://www.imdb.com/name/nm0578853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzcyMDcyMF5BMl5BanBnXkFtZTcwNjQwMTczMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1969","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Paul Benjamin Mendelsohn","height":"5' 11\" (1.8 m)","bio":"Despite his prominence in Hollywood as a character actor known for playing villains and criminals, Ben Mendelsohn has been a leading man in Australia since starting acting as a teenager. Paul Benjamin Mendelsohn was born in Melbourne, Australia, to Carole Ann (Ferguson), a nurse, and Frederick Arthur Oscar Mendelsohn, a medical researcher. Getting his start in television, including The Henderson Kids and the long running soap opera Neighbours, Mendelsohn broke out with his performance as an ill-fated juvenile delinquent in the acclaimed coming of age film The Year My Voice Broke. Mendelsohn won the best supporting actor award from the Australian Film Institute, his first of eight nominations. Mendelsohn went onto to become one of the most popular teen/young adult stars in Australia cinema, often rivaling other emerging talents of his generation, including Russell Crowe, Noah Taylor, and Guy Pearce, leading the Australian tabloid to nickname them \"the Mouse Pack\" in reference to the Rat Pack in America and Brit Pack in the UK, emerging at the same time. Among his peers, Mendelsohn seemed to corner the market on troubled, angry young men, thanks to his roles in Idiot Box, Metal Skin, and Nirvana Street Murder. But Mendelsohn also proved he was capable of being a romantic lead, starring in the comedies The Big Steal, Cosi, Spotswood, and Amy. In the 1990s, Mendelsohn appeared in just one \"Hollywood\" film, the action film Vertical Limit, as one of two daredevil climbers on a rescue mission, often providing the film's comic relief. The film failed to find an audience and Mendelsohn returned to Australia, where he primarily worked in theater and television, despite earning best actor nominations from the Australian Film Institute and Australian Film Critics Circle for the drama Mullet, as a prodigal son returning to his small town. He also took steps to work in more international films such as The New World, Knowing and Australia. Mendelsohn has acknowledged that there was a period of almost two years that he had so little work, he considered leaving the acting profession entirely. In 2009, Mendelsohn experienced a bit of a comeback with the role in the independent Australian films Beautiful Kate, as troubled man forced to return reunite with his dying father and come to terms with the death of his twin sister, with whom he had a complicated relationship. He was nominated for Australian Film Institute and Australian Film Critics Circle Best Actor in 2009. A year later, he appeared as Pope in Animal Kingdom, the most terrifying and violent member of a crime family. In 2010, he won Best Actor from the Australian Film Institute, Independent Film Award, and Australian Film Critics Circle. Since 2010, Mendelsohn has become a major player in Hollywood as a character actor in both blockbuster films (The Dark Knight Rises) and critically acclaimed films such as Killing Them Softly and Place Beyond the Pines. In 2013 he appeared in the UK Starred Up, which earned him a Best Supporting Actor Award from the British Independent Film Awards. In 2014, he will also star in Ryan Gosling's Lost River, Slow West, and Exodus: Gods and Kings. In 2016, Mendelsohn won the Outstanding Supporting Actor in a Drama Series for his role as Danny Rayburn in Netflix's Bloodline. Mendelsohn lives in the US with his wife, writer Emma Forrest, and their daughter. He also has an older daughter from a previous relationship. (2014)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzcyMDcyMF5BMl5BanBnXkFtZTcwNjQwMTczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0578853","name":"Ben Mendelsohn","idIMDB":"nm0578853"},"actorId":"nm0578853","character":"Viceroy Hegep","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"María Valverde","urlProfile":"http://www.imdb.com/name/nm1482999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NjMwNTM5Nl5BMl5BanBnXkFtZTgwNDUwNzA2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1987","placeOfBirth":" Madrid, Spain","height":"5' 5\" (1.65 m)","bio":"She began acting in 2002, when film director Manuel Martin Cuenca chose her from 3000 girls to be the lead actress in his film \"The Bolshevik's Weakness\". One year later, Maria's work impressed both the audience and the Spanish Film Academy, who awarded her with the Goya for Best Newcomer. Since then she has been working in Spain, Italy, UK, US, Mexico, Venezuela...","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NjMwNTM5Nl5BMl5BanBnXkFtZTgwNDUwNzA2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1482999","name":"María Valverde","idIMDB":"nm1482999"},"actorId":"nm1482999","character":"Zipporah","urlCharacter":"http://www.imdb.com/character/ch0497629","main":true},{"actorName":"Sigourney Weaver","urlProfile":"http://www.imdb.com/name/nm0000244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MTcyNTE3OV5BMl5BanBnXkFtZTcwMTA0MTMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1949","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Susan Alexandra Weaver","height":"5' 11\" (1.8 m)","bio":"Sigourney Weaver was born Susan Alexandra Weaver in Leroy Hospital in Manhattan, New York City. Her father, TV producer Sylvester L. Weaver Jr., originally wanted to name her Flavia, because of his passion for Roman history (he had already named her elder brother Trajan). Her mother, Elizabeth Inglis (née Desiree Mary Lucy Hawkins), was an English actress who had sacrificed her career for a family. Sigourney grew up in a virtual bubble of guiltless bliss, being taken care of by nannies and maids. By 1959, the Weavers had resided in 30 different households. In 1961, Sigourney began attending the Brearley Girls Academy, but her mother moved her to another New York private school, Chapin. Sigourney was quite a bit taller than most of her other classmates (at the age of 13, she was already 5' 10\"), resulting in her constantly being laughed at and picked on; in order to gain their acceptance, she took on the role of class clown. In 1962, her family moved to San Francisco briefly, an unpleasant experience for her. Later, they moved back east to Connecticut, where she became a student at the Ethel Walker School, facing the same problems as before. In 1963, she changed her name to \"Sigourney\", after the character \"Sigourney Howard\" in F. Scott Fitzgerald's \"The Great Gatsby\" (her own birth name, Susan, was in honor of her mother's best friend, explorer Susan Pretzlik). Sigourney had already starred in a school drama production of \"A Midsummer Night's Dream\", and, in 1965, she worked during the summer with a stock troupe, performing in \"A Streetcar Named Desire\" and \"You Can't Take It With You\" (she didn't star in the latter because she was taller than the lead actor!). After graduating from school in 1967, she spent some months in a kibbutz in Israel. At that time, she became engaged to reporter Aaron Latham, but they soon broke up. In 1969, Sigourney enrolled in Stanford University, majoring in English Literature. She also participated in school plays, especially Japanese Noh plays. By that time she was living in a tree house, alongside a male friend, dressed in elf-like clothes! After completing her studies in 1971, she applied for the Yale School of Drama in New Haven. Despite appearing at the audition reading a Bertolt Brecht speech and wearing a rope-like belt, she was accepted by the school but her professors rejected her, because of her height, and kept typecasting her as prostitutes and old women (whereas classmate Meryl Streep was treated almost reverently). However, in 1973, while making her theatrical debut with \"Watergate Classics\", she met up with a team of playwrights and actors and began hanging around with them, resulting in long-term friendships with Christopher Durang, Kate McGregor-Stewart and Albert Innaurato. In 1974, she starred in such plays as Aristophanes' \"Frogs\" and Durang's \"The Nature and Purpose of the Universe\" and \"Daryl and Carol and Kenny and Jenny\", as \"Jenny\". After finishing her studies that year, she began seriously pursuing a stage career, but her height kept being a hindrance. However, she continued working on stage with Durang (in \"Titanic\" [1975]) and Innaurato (in \"Gemini\" [1976]). Other 1970s stage works included \"Marco Polo Sing a Song\", \"The Animal Kingdom\", \"A Flea in Her Ear\", \"The Constant Husband\", \"Conjuring an Event\" and others. However, the one that really got her noticed was \"Das Lusitania Songspiel\", a play she co-wrote with Durang and in which she starred for two seasons, from 1979 to 1981. She was also up for a Drama Desk Award for it. During the mid-70s, she appeared in several TV spots and even starred as \"Avis Ryan\" in the soap opera Somerset (1970). In 1977, she was cast in the role Shelley Duvall finally played in Annie Hall (1977), after rejecting the part due to prior stage commitments. In the end, however, Woody Allen offered her a part in the film that, while short (she was on-screen for six seconds), made many people sit up and take notice. She later appeared in Madman (1978) and, of course, Alien (1979). The role of the tough, uncompromising \"Ripley\" made Sigourney an \"overnight\" star and brought her a British Award Nomination. She next appeared in Eyewitness (1981) and L'année de tous les dangers (1982), the latter being a great success in Australia that won an Oscar and brought Sigourney and co-star Mel Gibson to Cannes in 1983. The same year she delivered an honorary Emmy award to her father, a few months before her uncle, actor Doodles Weaver, committed suicide. That year also brought her a romance with Jim Simpson, her first since having broken up two years previously with James M. McClure. She and Simpson were married on 1 October 1984. Sigourney had, meanwhile, played in the poorly received Deal of the Century (1983) and the mega-hit Ghostbusters (1984). She was also nominated for a Tony Award for her tour-de-force performance in the play \"Hurly Burly\". Then followed One Woman or Two (1985), Half Moon Street (1986) and Aliens (1986). The latter was a huge success, and Sigourney was nominated for both a Golden Globe and an Oscar. She then entered her most productive career period and snatched Academy Award nominations, in both Best Actress and Best Supporting Actress categories, for her intense portrayal of Dian Fossey in Gorillas in the Mist (1988) and her delicious performance as a double-crossing, power-hungry corporate executive in Working Girl (1988). She ended up losing in both, but made up for it to a degree by winning both Golden Globes. After appearing in a documentary about fashion photographer Helmut Newton, Helmut Newton: Frames from the Edge (1989), and reprising her role in the sequel Ghostbusters II (1989), she discovered she was pregnant and retired from public life for a while. She gave birth to her daughter, Charlotte Simpson, on 13 April 1990, and returned to the movies as a (now skinhead) Ripley in Alien 3 (1992) and a gorgeous \"Queen Isabella of Spain\" in 1492: Christophe Colomb (1992), her second film with director Ridley Scott. She starred in the political comedy Dave (1993) alongside Kevin Kline, and then a Roman Polanski thriller, Death and the Maiden (1994). In 1995, she was seen in Jeffrey (1995) and Copycat (1995). The next year, she \"trod the boards\" in \"Sex and Longing\", yet another Durang play. She hadn't performed in the theater in many years before that play, her last stage performances occurring in the 1980s in \"As You Like It\" (1981), \"Beyond Therapy\" (1981), \"The Marriage of 'Bette and Boo'\" (1985) and \"The Merchant of Venice\" (1986). In 1997, she was the protagonist in Grimm's Snow White: A Tale of Terror (1997), Ice Storm (1997) and Alien: Resurrection (1997). Her performance in Ice Storm (1997) got her a BAFTA prize and another Golden Globe nod. She also gave excellent performances in A Map of the World (1999) and the sci-fi spoof Galaxy Quest (1999). Her next comedy, Company Man (2000), wasn't quite so warmly welcomed critically and financially, however. She next played a sexy con artist in Heartbreakers (2001) and had a voice role in Big Bad Love (2001). Her father died at the age of 93. Sigourney herself has recently starred in Tadpole (2000) and is planning a cinematic version of The Guys (2002), the enthralling September 11th one-act drama she played on stage on late 2001. At age 60, she played a crucial role in Avatar (2009), which became the top box-office hit of all time. The film reunited her with her Aliens (1986) director James Cameron. Her beauty, talent, and hard-work keeps the ageless actress going, and she has continued to win respect from her fans and directors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MTcyNTE3OV5BMl5BanBnXkFtZTcwMTA0MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000244","name":"Sigourney Weaver","nicknames":["The Actress's Actress","The Sci-Fi Queen"],"idIMDB":"nm0000244"},"actorId":"nm0000244","character":"Tuya","urlCharacter":"http://www.imdb.com/character/ch0063777","main":true},{"actorName":"Ben Kingsley","urlProfile":"http://www.imdb.com/name/nm0001426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1943","placeOfBirth":" Scarborough, Yorkshire, England, UK","birthName":"Krishna Bhanji","height":"5' 8\" (1.73 m)","bio":"Ben Kingsley was born Krishna Bhanji on December 31, 1943 in Scarborough, Yorkshire, England. His father, Rahimtulla Harji Bhanji, was a Kenyan-born medical doctor, of Gujarati Indian descent, and his mother, Anna Lyna Mary (Goodman), was an English actress. Ben began to act in stage plays during the 1960s. He soon became a successful stage actor, and also began to have roles in films and television. His birth name was Krishna Bhanji, but he changed his name to \"Ben Kingsley\" soon after gaining fame as a stage actor, fearing that a foreign name could hamper his acting career. Kingsley first earned international fame for his performance in the drama movie Gandhi (1982). His performance as Mohandas K. Gandhi earned him international fame. He won many awards - including an Academy Award for Best Actor. He also won Golden Globe, BAFTA and London Film Critics' Circle Awards. After acting in Gandhi (1982), Ben was recognized as one of the finest British actors. After his international fame for appearing in Gandhi (1982), Kingsley appeared in many other famous movies. His success as an actor continued. His performance as Itzhak Stern in the drama movie Schindler's List (1993) earned him a BAFTA nomination. Schindler's List (1993) won seven Academy Awards, including Best Picture. During the late 1990s, Kingsley acted in many successful movies. He played Sweeney Todd in the television movie The Tale of Sweeney Todd (1997). For his performance in this movie, he was nominated for the Screen Actors' Guild Award. His other notable role was as Otto Frank in the television movie Anne Frank (2001), for which he won a Screen Actors' Guild Award. In 2002, Kingsley was appointed Knight Bachelor of the Order of the British Empire in the Queen's New Years Honours for his services to drama. In 2013, he received the BAFTA Los Angeles Britannia Award for Worldwide Contribution to Filmed Entertainment. That same year, he also received the Fellowship Award at the Asian Awards in London, England. Ben Kingsley currently resides in Spelsbury, Oxfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001426","name":"Ben Kingsley","idIMDB":"nm0001426"},"actorId":"nm0001426","character":"Nun","urlCharacter":"http://www.imdb.com/character/ch0492480","main":true},{"actorName":"Isaac Andrews","urlProfile":"http://www.imdb.com/name/nm5036576","urlPhoto":"","biography":{"bio":"Isaac Andrews is an actor, known for Avengers: Age of Ultron (2015), Exodus: Gods and Kings (2014) and Hercules (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5036576","name":"Isaac Andrews","idIMDB":"nm5036576"},"actorId":"nm5036576","character":"Malak","urlCharacter":"http://www.imdb.com/character/ch0399936","main":true},{"actorName":"Hiam Abbass","urlProfile":"http://www.imdb.com/name/nm0007814","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEzMDQ2OTM5Ml5BMl5BanBnXkFtZTcwMDk2NTE4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1960","placeOfBirth":" Nazareth, Israel","bio":"Hiam Abbass was born on November 30, 1960 in Nazareth, Israel. She is known for her work on The Visitor (2007), Les citronniers (2008) and Exodus: Gods and Kings (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEzMDQ2OTM5Ml5BMl5BanBnXkFtZTcwMDk2NTE4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007814","name":"Hiam Abbass","idIMDB":"nm0007814"},"actorId":"nm0007814","character":"Bithia","urlCharacter":"http://www.imdb.com/character/ch0006239","main":true},{"actorName":"Indira Varma","urlProfile":"http://www.imdb.com/name/nm0890055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzAyNjE1Nl5BMl5BanBnXkFtZTcwNjYyOTI4Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1973","placeOfBirth":" Bath, Somerset, England, UK","height":"5' 7\" (1.7 m)","bio":"Indira Varma was born on May 14, 1973 in Bath, Somerset, England. She is an actress and producer, known for Kama Sutra: A Tale of Love (1996), Exodus: Gods and Kings (2014) and Anna (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzAyNjE1Nl5BMl5BanBnXkFtZTcwNjYyOTI4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0890055","name":"Indira Varma","idIMDB":"nm0890055"},"actorId":"nm0890055","character":"High Priestess","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ewen Bremner","urlProfile":"http://www.imdb.com/name/nm0001971","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTVjNzNhNzItNjc1ZC00YTJjLWI2MjctMDc4MmMxOGZkZGUxXkEyXkFqcGdeQXVyMTg0NTYyNjU@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1972","placeOfBirth":" Edinburgh, Scotland, UK","height":"5' 8\" (1.73 m)","bio":"Born in Edinburgh, Scotland, Ewen Bremner has worked with many of the most respected directors in world cinema, including Danny Boyle, Mike Leigh, Ridley Scott, Joon-Ho Bong, Werner Herzog and Woody Allen. Ewen has established himself by creating unique characters in critically acclaimed films, as well as going toe to toe with many of Hollywood's biggest stars. Bremner had worked widely in theatre, television, and film for years before being cast in his breakout role in Trainspotting (1996), by Oscar-winning director Danny Boyle. Having originated the role of Mark Renton in Edinburgh's Traverse Theatre production, Bremner then made waves opposite Ewan McGregor playing Spud Murphy and earned screen immortality with his character's infamous \"speed fueled\" job interview scene. Prior to Trainspotting, Bremner gave a striking performance in Mike Leigh's Naked, starring opposite David Thewlis. In 1999, Bremner received critical acclaim for his portrayal of a schizophrenic man living with his dysfunctional family in Harmony Korine's Julien Donkey-Boy. Filmed strictly in accordance with the ultra-realist tenants of Lars Von Trier's Dogma 95 movement and starring opposite Werner Herzog, Bremner played Julien its eponymous hero, requiring him to assume an American accent. He then worked with director Michael Bay in his high-profile 2001 war film Pearl Harbor, proving his versatility once again by portraying the role of a wholeheartedly patriotic American soldier fighting in WWII. The following year, he stepped back into fatigues for a supporting role in Ridley Scott's Black Hawk Down, while rounding out the next several years with roles in high-profile Hollywood releases such as The Rundown, Disney's Around the World in 80 Days, Alien vs. Predator, Woody Allen's Match Point, the comedy Death at a Funeral directed by Frank Oz, and Fool's Gold starring Matthew McConaughey and Kate Hudson. This past year proved to be a busy one when Bremner was invited to join the DC Universe in the Zack Snyder-produced feature Wonder Woman, directed by Patty Jenkins, co-starring Gal Gadot and Chris Pine, and set for release by Warner Bros. in the summer of 2017. Ewen would also reprise his unforgettable role as \"Spud\" in the highly-anticipated sequel to Danny Boyle's cult classic, T2: Trainspotting, for Sony due out early 2017. He rounded out the year with the feature The Lake, produced by Luc Besson. Currently (2017), Bremner is filming the TNT Drama Series Will with Shekhar Kapur, produced by Craig Pearce, whose writing credits include the feature films The Great Gatsby, Moulin Rouge, Romeo + Juliet and Strictly Ballroom. The series will tell the story of the lost years of young William Shakespeare after his arrival to London in 1589. Other notable film credits include Woody Allen's You Will Meet a Tall Dark Stranger, David Mackenzie's Perfect Sense starring again alongside Ewan McGregor, Great Expectations directed by Mike Newell, Bryan Singer's Jack the Giant Slayer, and Snowpiercer directed by Bong Joon-Ho and starring opposite Chris Evans and Tilda Swinton. Further credits include Exodus: Gods and Kings, Wide Open Spaces, Mojo, Mediator, Faintheart, Hallam Foe, Sixteen Years of Alcohol, and Snatch. In television, Ewen has worked on many acclaimed productions including David Hare's Worriker trilogy starring Bill Nighy for BBC, Jimmy McGovern's Moving On and also his Australian mini-series Banished, Strike Back for Sky TV, Dominic Savage's Dive, the Dylan Thomas biopic, A Poet In New York and the adaptation of Day of the Triffids for the BBC. Other noteworthy series appearances include portraying legendary surrealist Salvador Dali in the U.K. television drama Surrealissimo: The Trial of Salvador Dali, and a guest spot on the successful NBC series, My Name is Earl. Ewen has worked extensively in theatre and his credits include God of Hell (Donmar Warehouse), Damascus (Traverse), Trainspotting (Citizens/Traverse/Bush Theatres), The Present (Bush Theatre), Gormenghast (Lyric Hammersmith), Bright Light Shinning (Bush Theatre) and Conquest of the South Pole (Traverse/Royal Court) among others. He currently spends his time between Scotland and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTVjNzNhNzItNjc1ZC00YTJjLWI2MjctMDc4MmMxOGZkZGUxXkEyXkFqcGdeQXVyMTg0NTYyNjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001971","name":"Ewen Bremner","idIMDB":"nm0001971"},"actorId":"nm0001971","character":"Expert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Golshifteh Farahani","urlProfile":"http://www.imdb.com/name/nm0267042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDAwMDUzNV5BMl5BanBnXkFtZTgwMjQ4NDE2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1983","placeOfBirth":" Tehran, Iran","height":"5' 6½\" (1.69 m)","bio":"Golshifteh started her acting career in theater at the age of 6 and has always kept a strong link with theater, but it was at the age of 14 that she acted in her first film The Pear Tree (1998), for which she won the prize for the Best Actress from the international section of the Fajr film festival, immediately making her one of the stars of Iranian cinema. Since then she has played in more than 15 films, many of which have been screened or awarded at international festivals. Amongst her latest films are Bahman Ghobadi's Half Moon (2006) (winner of the Golden Seashell at the San Sebastián film festival 2006), Dariush Mehrjui's controversial The Music Man (2007), still banned in Iran, and the late Rasool Mollagholi Poor's M for Mother (2006), which after a huge success in Iran was chosen to represent Iran for the Best Foreign Film at the Academy Awards in 2008. After playing in Body of Lies (2008) by Ridley Scott, Golshifteh became the first Iranian star to act in a major Hollywood production. Subsequently she was banned from leaving her country. Her last film in Iran À propos d'Elly (2009) won a Silver Bear in Berlin and the Best Narrative Feature at Tribeca (2009). Golshifteh graduated from music school, she sings and plays the piano amongst other instruments. She is also fluent in French and English and lives in Paris now.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDAwMDUzNV5BMl5BanBnXkFtZTgwMjQ4NDE2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267042","name":"Golshifteh Farahani","idIMDB":"nm0267042"},"actorId":"nm0267042","character":"Nefertari","urlCharacter":"http://www.imdb.com/character/ch0176812","main":true},{"actorName":"Ghassan Massoud","urlProfile":"http://www.imdb.com/name/nm1586095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjc3Njg1Ml5BMl5BanBnXkFtZTcwMTUwNzUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1958","placeOfBirth":" Damascus, Syria","bio":"Ghassan Massoud (born September 20, 1958 in Damascus) is a Syrian actor and film-maker. He is best-known in the West for playing the role of the Kurdish military general Saladin in Ridley Scott's 2005 film Kingdom of Heaven. He has also played the \"Sheikh\" in famous Turkish film \"Kurtlar Vadisi: Irak\" (Valley of the Wolves Iraq). Massoud is best known in Syria for his appearance in many Syrian-made films, and writing and directing the theatre play Diplomasiyyoun, and was part of the Syrian Ministry of Culture's National Theater's 2002 season. Married with both a son and daughter, Massoud teaches Drama at both the Damascus Music and Drama School and High Institution of Theatrical Arts. He has appeared in the Syrian films The Chant of Rain, and in Haytham Hakky's well known work Memories of the Forthcoming Age, and on the Syrian stage was an actor in August Strindberg's Miss Julie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjc3Njg1Ml5BMl5BanBnXkFtZTcwMTUwNzUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1586095","name":"Ghassan Massoud","idIMDB":"nm1586095"},"actorId":"nm1586095","character":"Ramses' Grand Vizier","urlCharacter":"http://www.imdb.com/character/ch0552458","main":true},{"actorName":"Tara Fitzgerald","urlProfile":"http://www.imdb.com/name/nm0001216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjQyNjEwMV5BMl5BanBnXkFtZTYwODMyOTI3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1967","placeOfBirth":" Cuckfield, Sussex, England, UK","birthName":"Tara Anne Cassandra Fitzgerald","height":"5' 5\" (1.65 m)","bio":"Tara Fitzgerald was born in Sussex, England. Her mother, Sarah Fitzgerald, is Irish, and her father, Michael Callaby, was Italian. Shortly after her birth, her family moved to Freeport, in the Bahamas where her grandfather, David Fitzgerald, was a well-established lawyer. Her sister, Arabella Fitzgerald, was born there, but the family returned to London when Tara was three. Her mother and father separated when she was four-years-old and, along with her mother and sister, Tara moved in with her uncle and Aunt Caroline. Her mother married the Irish actor Norman Rodway when Tara was age 6, and the birth of her half-sister, Bianca Rodway, followed shortly thereafter. Rodway and Sarah Fitzgerald separated when Tara was seven. Tara's formative years were spent moving around - a lifestyle that saw her attending five primary schools while living in a variety of locations which included Glasgow, Dublin, and Stratford-upon-Avon. Eventually, Sarah and her three daughters returned to South London, but she left at the age of 16 after passing her \"O\" level examinations, now known as the GCSE (General Certificate of Secondary Education) exams. Her reason for taking a break from the educational process was that she was not allowed to pursue her goal of attending drama school. Tara had auditioned for RADA and the Guildhall, but she was unable to secure a placement. She now recognizes that, at age 17, she really had not been ready. Tara spent the next two years working her way around Europe as a waitress, an experience that provided her with an improved perspective. When she returned to London and decided to audition for a place at the Drama Centre, she was accepted immediately. Her training at the Drama Centre leaned heavily toward method acting which she recalls was like one long therapy session of breaking down the ego, and then rebuilding it. (Other well-known actors who trained at the Drama Centre include Anthony Hopkins, Colin Firth, Simon Callow and Pierce Brosnan). Life at the Drama Centre consisted of long days and hard work, but Tara recalls the time as being one of the best in her life. She was living at home with her mother, and working as a waitress at \"The Ark\" restaurant in Kensington to repay the bank loan which she had secured to cover her tuition fees. A theatrical agent noticed her performance in an amateur production, and arranged for Tara to audition for a co-starring role in the offbeat comedy Hear My Song (1991). Tara was the first actress to audition and, after the director had seen another 300 young hopefuls, the role was hers. Two weeks after graduating from college in July, 1990, Tara was at work on a major film that turned out to be a surprise success, and generated rave reviews of her performance. Tara never looked back. Starring roles in several successful television productions during 1991 and 1992 followed. Tara received critical acclaim for The Black Candle (1991), Performance: Six Characters in Search of an Author (1992), The Camomile Lawn (1992) and Anglo Saxon Attitudes (1992). Her next major step was a co-starring role in the West End play, \"Our Song\", where she acquitted herself nightly opposite one of the legends of the London stage, Peter O'Toole. This success was followed by a role opposite Hugh Grant in the Australian hit film, Sirènes (1993), for which the Australian Film Institute nominated Tara as Best Actress in a Lead Role. An American mini-series, Fall from Grace (1994), was followed by the Irish film, A Man of No Importance (1994), which found Tara sharing honors with Albert Finney. Then came the two widely different television productions Mystery!: Cadfael (1994) (The Leper of St. Giles (#1.3)) and The Vacillations of Poppy Carew (1995). Tara was back co-starring with Hugh Grant in The Englishman Who Went Up a Hill But Came Down a Mountain (1995) before she embarked upon another major change of pace by playing \"Ophelia\" opposite Ralph Fiennes in \"Hamlet\" on the London and Broadway stages. Ralph received the notoriety, but Tara received the award for Best Supporting Actress from the New York Critics Circle. Tara's next success was co-starring with Ewan McGregor in the highly acclaimed comedy/drama Brassed Off (1996). Then, it was back to BBC television for The Tenant of Wildfell Hall (1996), The Woman in White (1997) and The Prince of Hearts (1997), all of which were featured on the U.S. mainstay, \"Masterpiece Theatre\". Tara's next theatrical film was Conquest (1998), which was produced in Canada. Back on the British side of the Atlantic, Tara starred in the contemporary Little White Lies (1998) and the Daphne Du Maurier swashbuckler (also featured on Masterpiece Theatre) Frenchman's Creek (1998), for which she received the award for Best Actress at the 1999 Reims International Television Festival. A major part in the film Childhood (2001) (which, regrettably, has never been released) was followed by the harrowing role of a stalked woman in the psychological drama In the Name of Love (1999). Radio dramatizations have included \"A Handful of Dust\", \"Look Back in Anger\", \"The African Queen\" and, most recently, \"Laughter in Leningrad\". Tara has been heard as the voice of the narrator in such diverse television mini-series as Wild Thing (Animal Life), The Final Day (Celebrity Deaths), Vice - Inside Britain's Sex Business (Self-explanatory), Reputations (Biographies), Omnibus: A Long Time Ago, The Story of Star Wars (TV Special) and, most recently, The Changemakers. You also will hear Tara's great voice doing radio and television advertisements for products ranging from Johnson's Facial Wipes to Norwich Union Insurance. Tara's recent cinematic appearances have included co-starring with Rutger Hauer in New World Disorder (1999), and starring opposite Rhys Ifans and Joseph Fiennes in Rancid Aluminum (2000). During this period, Tara appeared on stage in the title role of \"Antigone\", and as \"Blanche du Bois\" in \"A Streetcar Named Desire\". In 2001, Tara appeared as the female lead in the World War II drama, Dark Blue World (2001) (aka \"Dark Blue World\"), a Czech film by Academy Award-winning director Jan Sverák (Kolya (1996)). She was also seen on the big screen in I Capture the Castle (2003), a romantic comedy based upon the 1948 novel by Dodie Smith (101 Dalmatians). Tara's recent television work has included a starring role in a segment of the highly-regarded psychological drama series Murder in Mind (2001), Murder in Mind: Echoes (2003). She also played the leading female role in Love Again (2003), a dramatization of the life of British poet Philip Larkin, which was telecast on the BBC in July. Tara has completed work on Secret Passage (2004) opposite John Turturro, a period drama which is set in Venice during the Spanish Inquisition, and Cinq enfants et moi (2004), a family adventure film based on E. Nesbit's classic 1902 novel, which was released in the U.K. on October 22, 2004. During the late winter and early spring of 2004, Tara completed a very successful tour of the United Kingdom playing the role of \"Nora Helmer\" in \"A Doll's House\", for which she received high critical acclaim. In the fall of 2004, she began a tour in the role of \"Mara Hill\" in a new comedy \"Clouds\", by Michael Frayn. During her career, Tara has picked her roles cautiously, always seeking to play the role of a strong woman. She feels that playing characters who have weak and insipid parts do not provide her with the motivation that the role of a strong woman can deliver. She has been remarkably successful in a variety of genre ranging from historical costume dramas (The Woman in White (1997), The Tenant of Wildfell Hall (1996) and Frenchman's Creek (1998)), to contemporary psychological suspense dramas (Little White Lies (1998) and In the Name of Love (1999)), as well as comedy dramas (Brassed Off (1996) and Conquest (1998)), and offbeat comedies (Sirènes (1993) and The Vacillations of Poppy Carew (1995)). Her fine performance in the World War II drama Dark Blue World (2001) (aka \"Dark Blue World\") and her recent work on stage give further evidence of her acting versatility.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjQyNjEwMV5BMl5BanBnXkFtZTYwODMyOTI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001216","name":"Tara Fitzgerald","idIMDB":"nm0001216"},"actorId":"nm0001216","character":"Miriam","urlCharacter":"http://www.imdb.com/character/ch0006236","main":true}],"seasons":[],"idIMDB":"tt1528100","urlIMDB":"http://www.imdb.com/title/tt1528100","business":{"budget":{"money":"$140,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$24,115,934","country":"USA","day":"12","month":"12","year":"2015","remarks":"3,503 Screens"},{"money":"$7,634,853","country":"Russia","day":"05","month":"01","year":"2015","remarks":"2,120 Screens"}],"gross":[{"money":"$65,014,513","country":"USA","day":"28","month":"02","year":"2015","remarks":""},{"money":"$65,007,045","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$64,983,583","country":"USA","day":"18","month":"02","year":"2015","remarks":""},{"money":"$64,909,773","country":"USA","day":"13","month":"02","year":"2015","remarks":""},{"money":"$64,909,773","country":"USA","day":"11","month":"02","year":"2015","remarks":""},{"money":"$64,881,433","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$64,782,719","country":"USA","day":"05","month":"02","year":"2015","remarks":""},{"money":"$64,738,422","country":"USA","day":"04","month":"02","year":"2015","remarks":""},{"money":"$64,600,795","country":"USA","day":"29","month":"01","year":"2015","remarks":""},{"money":"$64,532,567","country":"USA","day":"25","month":"01","year":"2015","remarks":""},{"money":"$64,364,688","country":"USA","day":"22","month":"01","year":"2015","remarks":""},{"money":"$63,973,459","country":"USA","day":"15","month":"01","year":"2015","remarks":""},{"money":"$267,281,936","country":"Worldwide","day":"28","month":"02","year":"2015","remarks":""},{"money":"$267,274,468","country":"Worldwide","day":"25","month":"02","year":"2015","remarks":""},{"money":"$265,370,583","country":"Worldwide","day":"18","month":"02","year":"2015","remarks":""},{"money":"$265,296,773","country":"Worldwide","day":"13","month":"02","year":"2015","remarks":""},{"money":"$265,296,773","country":"Worldwide","day":"11","month":"02","year":"2015","remarks":""},{"money":"$262,686,830","country":"Worldwide","day":"05","month":"02","year":"2015","remarks":""},{"money":"$259,338,422","country":"Worldwide","day":"04","month":"02","year":"2015","remarks":""},{"money":"$259,200,795","country":"Worldwide","day":"03","month":"02","year":"2015","remarks":""},{"money":"$253,200,795","country":"Worldwide","day":"29","month":"01","year":"2015","remarks":""},{"money":"$252,703,789","country":"Worldwide","day":"22","month":"01","year":"2015","remarks":""},{"money":"$237,717,140","country":"Worldwide","day":"15","month":"01","year":"2015","remarks":""},{"money":"$268,031,828","country":"worldwide","day":"26","month":"03","year":"2015","remarks":""},{"money":"$203,017,315","country":"Non-USA","day":"26","month":"03","year":"2015","remarks":""},{"money":"$202,267,423","country":"Non-USA","day":"25","month":"02","year":"2015","remarks":""},{"money":"$200,387,000","country":"Non-USA","day":"18","month":"02","year":"2015","remarks":""},{"money":"$200,387,000","country":"Non-USA","day":"11","month":"02","year":"2015","remarks":""},{"money":"$197,904,111","country":"Non-USA","day":"05","month":"02","year":"2015","remarks":""},{"money":"$188,600,000","country":"Non-USA","day":"29","month":"01","year":"2015","remarks":""},{"money":"$188,339,101","country":"Non-USA","day":"22","month":"01","year":"2015","remarks":""},{"money":"$17,497,162 (Russia)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$18,907","country":"USA","day":"22","month":"02","year":"2015","remarks":"35 Screens"},{"money":"$98,714","country":"USA","day":"08","month":"02","year":"2015","remarks":"130 Screens"},{"money":"$167,879","country":"USA","day":"25","month":"01","year":"2015","remarks":"178 Screens"}],"admissions":[{"money":"276,913","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"09","year":"2013","remarks":null},{"money":null,"country":null,"day":"18","month":"01","year":"2014","remarks":null}],"copyrightHolder":"Twentieth Century Fox Film Corporation, Producciones Ramses, A.I.E. and TSG Entertainment Finance LLC"},"technical":{"runtime":["2 hr 30 min (150 min)","2 hr 22 min (142 min) (Taiwan)"],"soundMix":["Dolby Atmos"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic Dragon, Zeiss Ultra Prime and Angenieux Optimo Lenses (helicopter shots 2D)","Red Epic M-X"],"laboratory":["Company 3, London, UK (digital intermediate)","Fluent Image, London, UK (digital negative management)"],"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (5K) (dual-strip 3-D) (source format)"],"printedFilmFormat":["D-Cinema (also 3-D version)"]},"rating":"6.0","metascore":"52","filmingLocations":[{"location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Costumes","names":[{"name":"Janty Yates","id":"nm0946765","role":null}]},{"category":"Best Action/Adventure Film","names":[]}]}]},{"award":"International 3D & Advanced Imaging Society's Creative Arts Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Creative Arts Award","categories":[{"category":"3D Feature - Live Action","names":[]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Film Music Composition of the Year","names":[{"name":"Harry Gregson-Williams","id":"nm0004581","role":null}]}]}]}],"votes":"135,968","type":"Movie","companyCreditsSimple":[{"idCompany":"co0286257","name":"Chernin Entertainment"},{"idCompany":"co0074212","name":"Scott Free Productions"},{"idCompany":"co0454147","name":"Babieka"}],"keywords":{"keywords":["moses","pharaoh","plague","egypt","exodus","sibling rivalry","well","battle","act of god","jewish","epic","general","destruction","tidal wave","tornado","shepherd","sheep","lamb","marriage ceremony","husband wife relationship","prophecy","priestess","boil","locust","frog","crocodile attack","crocodile","religion","palace","passover","wedding","sword","army","chariot","judaism","ancient egypt","emancipation","based on the bible","biblical plagues","loss of son","old testament","belief in god","talking to god","bible","escape from slavery","biblical","slavery","desert","beard","death of son","egyptian","slave","escape","empire","courage","faith","adopted son","hebrew","new kingdom of egypt","reunited family","running for your life","fish kill","catfish","mountain road","arson","sabotage","loom","god personified as a boy","face painting","swarm of insects","drawing a map","cooking over a campfire","hunting","yoke","walking in the rain","cobra venom","parade","camp site","cavalry charge","volley of arrows","ox cart","construction site","sandstorm","two man chariot","death of pharaoh","aerial shot of a city","chicken","animal sacrifice","flogging","horse drawn wagon","horseback riding","father son reunion","husband wife reunion","tribe","running","falling off a cliff","trampled to death","cliff","wading in water","seagull","overhead shot","throwing a sword into the sea","doubt","cradle","dead baby","old man","covered wagon","ten commandments","crying","darkness","killing a lamb","sunset","survival","messenger","brutality","pain","suffering","inhumanity","cruelty","mass murder","riot","grainery","starvation","mercy","dead animal","death of an ox","illness","disease","facial sore","catastrophe","body sore","panic","gnat","baby boy","dead fish","boat","subjective camera","man on fire","archer","freedom","military training","slave army","gallows","hanging a child","hanging","hiding","search","pursuit","burning a dead body","sword held to throat","little boy","prince of egypt","uncle nephew relationship","bolt upright after nightmare","carrying a dead body","milk","facial tattoo","stacking stones","honesty","arrest","monument","zebra skin","leopard skin","throne","mummy","irony","dying","grand vizier","bondage","quarry","prayer house","reference to abraham","canaan","elder","guard","egyptian guard","israelite","kiss on the forehead","delusion","shivering","hit on the head","surrealism","candle","buried in mud","broken leg","waking up","hearing voices","landslide","thunder","boy","bedouin","tomb","chanting","flash forward","kiss","wedding vows","clapping","embroidery","weaving","spinning wheel","burning bush","father daughter relationship","sister sister relationship","interrogation","fear","barking dog","straits of tiran","death of a horse","campfire","apology","horse and wagon","sphinx","treason","spy","eating","food","advisor","sedition","sense of smell","camel","oxen","imitating a snake's hissing","venom","milking venom from a cobra","snake","cobra","viceroy","pithom egypt","trust","saving a life","liar","lie","tent on fire","encampment","lance","fight","hand to hand combat","chariot collision","promise","sekhmet","omen","duck entrails","dead duck","kadesh egypt","hittite","memphis egypt","reference to god","storm","year 1300 b.c.","nile river","rain","ship explosion","building explosion","killing an animal","looting","villain not really dead cliche","village","eavesdropping","brother sister relationship","divine intervention","christianity","interracial relationship","farm","rescue","impalement","guerilla warfare","torch","flaming arrow","attack","person on fire","mudslide","crushed to death","grape","lightning","heavy rain","falling from height","fisherman","maggot","fish","eaten alive","blood","animal attack","race against time","underwater scene","chase","giant wave","politics","sword and sandal","hope","pyramid","soldier","family relationships","mother son relationship","hallucination","cave","knocked out","paranoia","corpse","explosion","ship","fire","battlefield","assassination attempt","assassin","axe","shot to death","shot in the chest","shot in the back","shot in the leg","stabbed in the arm","shot in the throat","stabbed in the throat","stabbed in the face","shot in the face","stabbed to death","stabbed in the chest","stabbed in the shoulder","helmet","shield","dagger","spear","bow and arrow","statue","thief","tent","violence","public hanging","montage","christ allegory","destiny","death","mountain","beach","murder","film starts with text","funeral","black comedy","adopted brother","prince","showdown","no opening credits","knife","threatened with a knife","cow","horse","dog","combat","swarm","fly","revenge","rage","grief","drowning","threat","goat","shouting","father son relationship","brother brother relationship","sword fight","caravan","armor","13th century b.c.","dead boy","whipping","exile","red sea","bare chested male","death of child","death of father","surprise ending","king","hail","interrupted whipping"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:48:41"}}