{"data":{"movies":[{"title":"Scooby-Doo! Curse of the Lake Monster","originalTitle":"","year":"2010","releaseDate":"20101016","directors":[{"name":"Brian Levant","id":"nm0505152"}],"writers":[{"name":"Steven Altiere","id":"nm1662742"},{"name":"Daniel Altiere","id":"nm1662741"}],"runtime":"79 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTAwOTYzNl5BMl5BanBnXkFtZTcwMjQ0OTc2NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy","Fantasy","Mystery"],"plot":"School is out and the familiar Scooby gang are looking to enjoy a long vacation. However, sightings of a Lake Monster cause them to band together once again to solve yet another mystery.","simplePlot":"School is out and the familiar Scooby gang are looking to enjoy a long vacation. However, sightings of a Lake Monster cause them to band together once again to solve yet another mystery.","actors":[{"actorName":"Robbie Amell","urlProfile":"http://www.imdb.com/name/nm2064412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTMyMDM2Ml5BMl5BanBnXkFtZTgwNDAyMjU4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1988","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Robert Patrick Amell","height":"6' (1.83 m)","bio":"Along with his sister, Robert Patrick Amell started acting when he was just six years old. At sixteen, he started to land theater roles at Lawrence Park Stage in plays such as Louis and Dave, Picasso at the Lapin Agile and The Importance of Being Earnest. The experience brought Robbie to realize that he wanted to pursue a career in acting. Shortly after choosing to follow acting, he booked the part of Daniel Murtaugh in the major motion picture Cheaper by the Dozen 2, headed by names such as Steve Martin, Bonnie Hunt, Hilary Duff, Tom Welling and - of whom he played the son - Eugene Levy and Carmen Electra. Robie was born in Toronto, Ontario, Canada, to Jo (Burden) and Rob Amell, who work in custom jewelry. His first cousin is actor Stephen Amell. As it seems is the habit of Canadians, Robbie has played hockey since he was a child. He also takes Muay Thai and break dancing lessons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTMyMDM2Ml5BMl5BanBnXkFtZTgwNDAyMjU4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2064412","name":"Robbie Amell","nicknames":["Hollywood","Picky"],"idIMDB":"nm2064412"},"actorId":"nm2064412","character":"Fred","urlCharacter":"http://www.imdb.com/character/ch0000513","main":true},{"actorName":"Hayley Kiyoko","urlProfile":"http://www.imdb.com/name/nm3072243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYyMDc3OTUzOF5BMl5BanBnXkFtZTgwMjcyNTUxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1991","placeOfBirth":" Los Angeles, California, USA","birthName":"Hayley Kiyoko Alcroft","height":"5' 4\" (1.63 m)","bio":"Hayley first appeared in national commercials for GM, On Star, K-Mart, and Slim Jim, and became the TV spokesperson for Cinnamon Toast Crunch. In addition, she had a couple of guest star roles on Nickelodeon's Unfabulous (2004). As a dancer, she studied with Scotty Nyugen. She is a prolific songwriter and she plays the drums, keyboards, and guitar. She was a member of a five girl-singing group, the Stunners up until their disbandment in 2011. The Stunners have released their first five-song EP with the video \"Dancing Around the Truth.\" Scooby-Doo! The Mystery Begins (2009) debuted on Cartoon Network in 2009 with Hayley in the iconic role of Velma Dinkley. She appeared in the role of Stevie on Disney Channel's Wizards of Waverly Place (2007). Hayley, with the Stunners, toured as Justin Bieber's opening act in the summer of 2010. Hayley recently joined the cast of the new CBS mid-season drama CSI: Cyber (2015). The series revolves around Special Agent Avery Ryan (Patricia Arquette), who is in charge of the Cyber Crime Division at Quantico, Virginia. Hayley plays Raven, a rookie techie working in the division who is an expert in social media, cyber trends, and international relations. This past summer, Hayley filmed the Universal feature Jem and the Holograms (2015), in which she plays Aja. This Jon M. Chu-helmed film is set to be released on October 23, 2015. She followed that with Insidious: Chapitre 3 (2015), the third installment in the successful franchise. Hayley can also be seen in the recurring role of Gabi, an ex-cyberbully in an all-girl group home on the breakout ABC Family show The Fosters (2013). Prior to this, she guest-starred on the hit CW series The Vampire Diaries (2009) and also appeared in the Disney Channel original movie Lemonade Mouth (2011). In addition to a successful acting career, Hayley is a prolific songwriter and gifted musician. To follow up her solo artist debut in 2013, she is scheduled to release her new EP, \"This Side of Paradise,\" in 2015. Working in collaboration with producer James Flannigan, she recorded the new album in London as well as in a makeshift studio in the garage of her Los Angeles home. Her music has garnered praise in multiple online publications including Nylon, Just Jared, Earmilk, and Hype Machine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYyMDc3OTUzOF5BMl5BanBnXkFtZTgwMjcyNTUxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3072243","name":"Hayley Kiyoko","idIMDB":"nm3072243"},"actorId":"nm3072243","character":"Velma","urlCharacter":"http://www.imdb.com/character/ch0000505","main":true},{"actorName":"Kate Melton","urlProfile":"http://www.imdb.com/name/nm2196325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg5OTcwOTY3OF5BMl5BanBnXkFtZTcwNTY0MTIyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1992","placeOfBirth":" Oklahoma City, Oklahoma, USA","height":"5' 8\" (1.73 m)","bio":"Kate Melton was born on June 23, 1992 in Oklahoma City, Oklahoma, USA. She is an actress, known for Scooby-Doo! The Mystery Begins (2009), Scooby-Doo! Curse of the Lake Monster (2010) and Lucy: A Period Piece (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg5OTcwOTY3OF5BMl5BanBnXkFtZTcwNTY0MTIyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2196325","name":"Kate Melton","nicknames":["Kaity","Kate"],"idIMDB":"nm2196325"},"actorId":"nm2196325","character":"Daphne","urlCharacter":"http://www.imdb.com/character/ch0000494","main":true},{"actorName":"Nick Palatas","urlProfile":"http://www.imdb.com/name/nm2641518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTkwNTMyNjc5OV5BMl5BanBnXkFtZTcwMzQ0OTc2NA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1988","placeOfBirth":" Bethesda, Maryland, USA","birthName":"Nicholas Edward Palatas","height":"6' (1.83 m)","bio":"Nick first became interested in acting when his mom pushed him to audition for a community theatre production of \"Pirates of Penzance\". Nick was cast as a pirate and instantly fell in love with the stage. He began studying acting on weekends and taking theatre and jazz performance in high school. When he and his entire family were selected for a national WalMart/Sony PS2 commercial, Nick realized he preferred the camera to the stage. Despite being offered a full academic scholarship to a university, Nick decided to move to Los Angeles to pursue his love of film and television. He does not regret his decision.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTkwNTMyNjc5OV5BMl5BanBnXkFtZTcwMzQ0OTc2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2641518","name":"Nick Palatas","idIMDB":"nm2641518"},"actorId":"nm2641518","character":"Shaggy","urlCharacter":"http://www.imdb.com/character/ch0000527","main":true},{"actorName":"Frank Welker","urlProfile":"http://www.imdb.com/name/nm0919798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzU2ODYxMV5BMl5BanBnXkFtZTgwMzQ3MjcwMjE@._V1._CR55.1875,112.71306800842285,367,462.6363582611084_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1946","placeOfBirth":" Denver, Colorado, USA","birthName":"Franklin Wendell Welker","height":"5' 8\" (1.73 m)","bio":"Frank Welker was born on March 12, 1946 in Denver, Colorado, USA as Franklin Wendell Welker. He is an actor, known for Aladdin (1992), The Real Ghostbusters (1986) and The Smurfs (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzU2ODYxMV5BMl5BanBnXkFtZTgwMzQ3MjcwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0919798","name":"Frank Welker","nicknames":["Dr. Frankenwelker"],"idIMDB":"nm0919798"},"actorId":"nm0919798","character":"Scooby-Doo","urlCharacter":"http://www.imdb.com/character/ch0000609","main":true},{"actorName":"Ted McGinley","urlProfile":"http://www.imdb.com/name/nm0569337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ2OTk3OV5BMl5BanBnXkFtZTcwNjcyODUyMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1958","placeOfBirth":" Newport Beach, California, USA","birthName":"Theodore Martin McGinley","height":"6' (1.83 m)","bio":"Theodore Martin 'Ted' McGinley was born on May 30, 1958 in Newport Beach, California. He is perhaps best known for his long-running roles in the television series Happy Days (1974), The Love Boat (1977), Dynasty (1981), Married with Children (1987) and The West Wing (1999). Formerly a male model, McGinley was spotted by a casting director after appearing in the GQ magazine, and was subsequently offered the role of Roger Phillips in Happy Days (1974). However, the veteran television star is no stranger to film either, having appeared in a string of features including Young Doctors in Love (1982), Revenge of the Nerds (1984), Wayne's World 2 (1993), Major League: Back to the Minors (1998) and Pearl Harbor (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ2OTk3OV5BMl5BanBnXkFtZTcwNjcyODUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569337","name":"Ted McGinley","idIMDB":"nm0569337"},"actorId":"nm0569337","character":"Uncle Thorny","urlCharacter":"http://www.imdb.com/character/ch0307551","main":true},{"actorName":"Richard Moll","urlProfile":"http://www.imdb.com/name/nm0596959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTc2Mjg5MV5BMl5BanBnXkFtZTcwNzY2MDQ4NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1943","placeOfBirth":" Pasadena, California, USA","birthName":"Charles Richard Moll","height":"6' 8\" (2.03 m)","bio":"Richard Moll was born on January 13, 1943 in Pasadena, California, USA as Charles Richard Moll. He is an actor, known for Night Court (1984), The Flintstones (1994) and House (1985). He was previously married to Susan Brown and Laura Class.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTc2Mjg5MV5BMl5BanBnXkFtZTcwNzY2MDQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0596959","name":"Richard Moll","idIMDB":"nm0596959"},"actorId":"nm0596959","character":"Elmer Uggins","urlCharacter":"http://www.imdb.com/character/ch0307552","main":true},{"actorName":"Nichelle Nichols","urlProfile":"http://www.imdb.com/name/nm0629667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4OTUxMTU0OV5BMl5BanBnXkFtZTYwNzY4OTc2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1932","placeOfBirth":" Robbins, Illinois, USA","birthName":"Grace Nichols","height":"5' 5\" (1.65 m)","bio":"Nichelle Nichols was born Grace Nichols on December 28, 1932 in Robbins, Illinois. She began her show business career at age 16 as a singer with Duke Ellington in a ballet she created for one of his compositions and later sang with his band. After switching to acting, she was twice nominated for the Sarah Siddons Award for best actress in \"The Blacks\" and \"Kicks and Company\". Her film debut found her dancing with Sammy Davis Jr. in Porgy and Bess (1959). A guest appearance on The Lieutenant (1963) led to an offer from Gene Roddenberry to join the cast of Star Trek (1966). Her best known role on the series is communications officer Lieutenant Nyota Uhura. She later repeated her role in a string of successful Star Trek films: Star Trek: The Motion Picture (1979), Star Trek II: The Wrath of Khan (1982), Star Trek III: The Search for Spock (1984), Star Trek IV: The Voyage Home (1986), Star Trek V: The Final Frontier (1989), and Star Trek VI: The Undiscovered Country (1991). Invited to join the board of directors of the National Space Institute, NASA asked her to participate in its astronaut recruitment programme for the space shuttle project. Three of her recruits were on the ill-fated Challenger mission. For her work, she received NASA's distinguished Public Service Award. She has a consultant firm, Women in Motion Inc. through which she produced and starred in the Smithsonian Institution's National Air and Space Museum film \"What's in It for Me?\". With all this, she has not neglected her singing making a series of video albums the latest being \"Nichelle Nichols: Live at Disneyland\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4OTUxMTU0OV5BMl5BanBnXkFtZTYwNzY4OTc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629667","name":"Nichelle Nichols","idIMDB":"nm0629667"},"actorId":"nm0629667","character":"Senator","urlCharacter":"http://www.imdb.com/character/ch0307553","main":true},{"actorName":"Marion Ross","urlProfile":"http://www.imdb.com/name/nm0005385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTU1MDM4N15BMl5BanBnXkFtZTYwNzU3MTU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1928","placeOfBirth":" Albert Lea, Minnesota, USA","birthName":"Marian Ellen Ross","height":"5' 5\" (1.65 m)","bio":"The lovely, continuously upbeat and iconic All-American mom from the classic Happy Days (1974) TV sitcom had fervent desires of becoming an actress while growing up in her obscure Minnesota town. Born Marian Ross (with an \"a\") in 1928, she grew up in her native state and, at one time, worked as a teenage au pair in order to earn money for drama lessons at the MacPhail Center in Minneapolis. The family eventually relocated to San Diego (she was in her late teens) and Marion attended and graduated from Point Loma High School. Changing her stage moniker to Marion (with an \"o\") Ross because it read classier to her, the young hopeful enrolled at San Diego University and appeared in the theater department's various productions. Graduating in 1950, Marion worked in summer theater in and around the San Diego area, including the Old Globe Theatre. She then managed to land a Paramount Studio contract with the assist of an old college professor and found a few unbilled parts to play as various actress, tourist and girlfriend types in a variety of films such as The Glenn Miller Story (1954), Secret of the Incas (1954), Sabrina (1954) and Pushover (1954). At the same time, she won a regular role as the Irish maid \"Nora\" in the Victorian-TV comedy Life with Father (1953) which ran a couple of seasons and was headed by Leon Ames and Lurene Tuttle. This program happened to be the first live color series for network Hollywood TV. Not your conventional leading lady type, Marion landed slightly larger parts in such movies as The Proud and Profane (1956), Lizzie (1957), Teacher's Pet (1958) and Operation Petticoat (1959), but any and all attempts to move further up the Hollywood film ladder proved a long-lasting frustration. Marking her Broadway debut in 1958 with a role in \"Edwin Booth\" starring José Ferrer, Marion nevertheless continued to focus on TV work. Throughout the 1960s, she appeared in a fairly steady amount of shows, both comedies and dramas, including Father Knows Best (1954), Rawhide (1959), Route 66 (1960), The Outer Limits (1963), The Felony Squad (1966) and The Brady Bunch (1969). By the end of the decade, however, she was still disillusioned, but now she was divorced from her husband of 18 years, Freeman Meskimen, and struggling to raise two children. Middle-aged stardom came to her (in her 46th year) with the nostalgic sitcom series Happy Days (1974), which arrived on a wave of 50s popularity triggered by the huge box-office reception to the film American Graffiti (1973). The show starred \"Graffiti\" lead Ron Howard and co-starred Henry Winkler as \"The Fonz\". Marion was ideally paired with Tom Bosley, who expertly played her beleaguered hubby. The series became a certifiable hit and Marion's ever-pleasant \"Marion Cunningham\" the new, slightly blended version of Lucille Ball's ditzy and Barbara Billingsley's pristine perfect moms. Two Emmy nominations came Marion's way during the show's long tenure (ten seasons). Following the demise of such an exalting hit, many actors often find themselves either resting on their laurels or witnessing a sad decline in their career. Not Marion. She continued to pursue her career assertively and challengingly and the critics kept taking notice. She earned terrific reviews for her recurring The Love Boat (1977) role in 1986, and enjoyed standard guest turns on Night Court (1984), MacGyver (1985), Burke's Law (1963) and (the revived) \"Superman\". One of Marion's finest hours on TV occurred with her role as the obstinate, iron-willed Jewish matriarch in the Brooklyn Bridge (1991) series, which neatly deflected any broad, daffy stereotype she might have incurred from her Happy Days (1974) role. Irritating yet ingratiating at the same time, Marion's fine interpretation garnered the veteran actress two more Emmy nominations. Sadly, a lack of viewership triggered an abrupt cancellation and deep disappointment in Marion. While never making a strong dent in films, an excellent supporting turn for Marion came in the form of her moving portrayal of Shirley MacLaine's loyal housekeeper and confidante in The Evening Star (1996), the long-awaited sequel to the Oscar-winning Terms of Endearment (1983). Critics predicted an Academy Award nomination for the actress but, surprisingly, it did not pan out. Other films over the years have included Colossus: The Forbin Project (1970); Grand Theft Auto (1977), which starred Happy Days (1974) son Ron Howard (who also made his directorial debut); and, more recently, Music Within (2007) and the silly spoof Superhero Movie (2008). In her post-\"Happy Days\" years, Marion reinvigorated her career on the stage. As a result, she earned renewed acclaim and respect for her roles in \"Arsenic and Old Lace\" (which brought her back to Broadway), \"Steel Magnolias\", \"Long Day's Journey Into Night\", \"The Glass Menagerie\", \"Pippin\" and \"Barefoot in the Park\", among others. She also toured with her one-woman show as poet Edna St. Vincent Millay entitled \"A Lovely Light\". On TV, Marion found recurring flinty-like roles on Touched by an Angel (1994) (a fifth Emmy nomination), That '70s Show (1998), The Drew Carey Show (1995), Gilmore Girls (2000) and Brothers & Sisters (2006) and also provided a voice in the cartoon \"Spongebob Squarepants\" as Spongebob's grandmother. The ever-vital copper-haired octogenarian continues to reside at her country-style home she calls the \"Happy Days Farm\" in California's San Fernando Valley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTU1MDM4N15BMl5BanBnXkFtZTYwNzU3MTU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005385","name":"Marion Ross","idIMDB":"nm0005385"},"actorId":"nm0005385","character":"Hilda Trowburg","urlCharacter":"http://www.imdb.com/character/ch0307554","main":true},{"actorName":"Beverly Sanders","urlProfile":"http://www.imdb.com/name/nm0761473","urlPhoto":"","biography":{"dateOfBirth":"2 September 1940","placeOfBirth":" Hollywood, California, USA","bio":"Beverly Sanders was born on September 2, 1940 in Hollywood, California, USA. She is an actress, known for ...and justice for all. (1979), The Flintstones in Viva Rock Vegas (2000) and Magic (1978). She has been married to Harvey J. Newmark since October 29, 1978.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0761473","name":"Beverly Sanders","idIMDB":"nm0761473"},"actorId":"nm0761473","character":"Wanda Grubworth","urlCharacter":"http://www.imdb.com/character/ch0307570","main":true},{"actorName":"Patrick Babbitt","urlProfile":"http://www.imdb.com/name/nm2604268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI0NDE4NjQzNl5BMl5BanBnXkFtZTcwOTkyNDM1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1985","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 10\" (1.78 m)","bio":"Patrick Babbitt was born on May 5, 1985 in Washington, District of Columbia, USA. He is an actor and writer, known for My Bloody Wedding (2010), Detention (2011) and Scooby-Doo! Curse of the Lake Monster (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI0NDE4NjQzNl5BMl5BanBnXkFtZTcwOTkyNDM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2604268","name":"Patrick Babbitt","idIMDB":"nm2604268"},"actorId":"nm2604268","character":"Wolfman","urlCharacter":"http://www.imdb.com/character/ch0299303","main":true},{"actorName":"Michael Berryman","urlProfile":"http://www.imdb.com/name/nm0077720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTA0MTAwM15BMl5BanBnXkFtZTcwOTQ3MDQ4NA@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1948","placeOfBirth":" Los Angeles, California, USA","birthName":"Michael John Berryman","height":"6' 2\" (1.88 m)","bio":"Late 1970s horror genre icon who's best known for his creepy performance as \"Pluto\" in the uncompromising Wes Craven horror film The Hills Have Eyes (1977). Berryman (who suffers from Hypohidrotic Ectodermal Dysplasia, a rare condition leaving him with no sweat glands, hair, fingernails or teeth) reminds one of a latter-day Rondo Hatton who also suffered from a rare medical condition that distorted his features giving him a brutish look just right for horror movies. To Berryman's credit, he managed to develop upon his \"Pluto\" character, and has turned up in numerous sci-fi / fantasy movies such as My Science Project (1985), Weird Science (1985), Armed Response (1986) and Evil Spirits (1990). The tall & lean Berryman generally portrays mutant bikers, evil undertakers, monsters and other frightening characters! A genuine favorite of horror movie fans.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTA0MTAwM15BMl5BanBnXkFtZTcwOTQ3MDQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0077720","name":"Michael Berryman","idIMDB":"nm0077720"},"actorId":"nm0077720","character":"Zombie Head","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karee Higashi","urlProfile":"http://www.imdb.com/name/nm4349984","urlPhoto":"","biography":{"bio":"Karee Higashi is an actress, known for Scooby-Doo! Curse of the Lake Monster (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4349984","name":"Karee Higashi","idIMDB":"nm4349984"},"actorId":"nm4349984","character":"Hawaiian Dance Girl #2","urlCharacter":"http://www.imdb.com/character/ch0307571","main":true},{"actorName":"David Joyner","urlProfile":"http://www.imdb.com/name/nm0431645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTY5OTAxNl5BMl5BanBnXkFtZTcwNTgyMzI3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1963","placeOfBirth":" Decatur, Illinois, USA","birthName":"David Eugene Joyner","height":"5' 10\" (1.78 m)","bio":"David Eugene Joyner was born on July 4th, 1963 in Decatur, Illinois to the proud parents, Roscoe and Mary Joyner. He is the 5th out 6 children. His nickname growing up was \"Preacher\". He graduated in 1981, with Honors, from MacArthur High School in Decatur at the age of 17. And in 1983 he graduated ITT Technical Institute of Indianapolis, Indiana with an Associate Degree in Electronic Engineering Technology, also with honors. In 1982 he became known as \"The Mannequin Man\". David was hired to stand in store windows in malls as a mechanically moving mannequin. Hundreds of people would stand outside the window and watch with amazement. In 1984 he was hired by (TI) Texas Instruments and moved to Dallas, Texas, where he worked for 6 years as a Software Analyst. On September 28, 1990 he resigned to pursue his entertainment career on a full-time basis. While working for TI, he performed during evenings and weekends at various clubs, malls, Churches, Civic Organization, and on local TV Talk Shows. He was known as \"Mr. Entertainment-David E. Joyner-The Mannequin Man\". He became a Professional Motivational Speaker in 1988, and is in great demand all over the country. He has a very funny and energetic way of motivating. In 1990 he became an Acting Coach at \"The Dallas TV & Film Workshop, now known as \"The Dallas Young Actors Studio & Performance Center, under the direction of Linda Seto. It's a non-profit organization that trains kids and teens from the ages of 3 to 18 acting skills. In 1992 he became the Assistant Director. It was there in 1990, that he met Casting Director, Shirley Abrams, who cast him in the role as \"Barney\". And it was also there that he met Hollywood Agent, Mary Grady, who is now one his dearest and closest friends. David began playing the role of Barney in 1991, and has traveled around the world spreading love to millions of people of all ages. He was the original Barney on the hit TV Series, \"Barney & Friends\", from 1992 until 2001. In April 2001 he left the television show, which is taped in Dallas, Texas, and moved to Los Angeles to continue pursuing his acting career outside the costume. After moving to LA, the Barney Special Events Dept came calling offering him the opportunity to continue traveling around the US making Barney appearances, and training new Barney's in other countries. All the while, allowing him to continue an acting career in LA as himself. On October 31, 1994 he lost one of his best friends to lung cancer, his Mom. She was only 58 years old. In 1998 David answered his call to Ministry, and was on the track for Ordained Ministry in the United Methodist Church, until he realized that his calling was bigger than being a Pastor in a church. David's calling is to share his love for children all over the world. In 2002 while guest-starring on the TV series, \"That's So Raven\", word got around the set that he was Barney. Later that day he was approached by a young lady asking him to meet with a producer named Claude Brooks, who was developing a new children's character named Hip Hop Harry, a rapping teddy bear. Thinking he was only meeting him to give him some great advice as to how to get Hip Hip Harry going, he was then offered the role as Hip Hop Harry to shot 2 pilots for a direct to DVD series. The two pilots were shot in August 2002, and thus the beginning of a new chapter in David Joyner's world of children's entertainment. Harry is a bear and the world's best youth counselor. He started his after-school program, Hip Hop Central, because he truly believes that kids need a positive place to learn, play and discover. Outside of being a youth counselor at Hip Hop Central he works as a rapper/singer/dancer for kids and families around the world. Hip Hop Harry lives and breathes Hip Hop in an old school sort of way but he's hip to the current trends. He loves to rap and dance along with the kids and he believes that a beat and a rhyme can solve any problem. Hip Hop Harry is 100% positive in all he does. He uses hip hop as a vehicle to spread positive and enlightening messages to both kids and adults. In 2005 Hip Hop Harry began making live appearances, blowing people away with a live show that had never been seen before as a costume character. Besides himself he has 4 very talented break dancers who know how to rock an audience. The live show is fulled with fun, and entertainment, while educating both children and adults when it's funky beats and cool raps. The producers recently signed a deal with Discovery Kids for a TV series. Hip Hop Harry can be seen on TLC and Discovery Kids, weekday mornings. 120 million homes, 5 days a week, 3 times a day. WOW, that's a lot of hip hopping. The response of Hip Hop Harry has been overwhelming, with many people believing he's going to be bigger than Barney. David is a man who truly has passion for the love of God, and he loves to share it with everyone he comes in contact with. He truly has a bright light shining from within. But besides being an Actor, an Entertainer, a Mannequin Man, a dancer, a Purple Dinosaur, a Drummer, a Preacher, a Motivational Speaker, and Hip Hop Rapping and Dancing Teddy Bear, he's a very humble, loving guy, who loves people.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTY5OTAxNl5BMl5BanBnXkFtZTcwNTgyMzI3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0431645","name":"David Joyner","idIMDB":"nm0431645"},"actorId":"nm0431645","character":"Sinister Clown","urlCharacter":"http://www.imdb.com/character/ch0307557","main":true},{"actorName":"Cherisse Ligot","urlProfile":"http://www.imdb.com/name/nm0510075","urlPhoto":"","biography":{"bio":"Cherisse Ligot is known for her work on Scooby-Doo! Curse of the Lake Monster (2010), Who We Are (2010) and Flucht ins Paradies (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0510075","name":"Cherisse Ligot","idIMDB":"nm0510075"},"actorId":"nm0510075","character":"Hawaiian Dance Girl #1","urlCharacter":"http://www.imdb.com/character/ch0307571","main":true}],"seasons":[],"idIMDB":"tt1618435","urlIMDB":"http://www.imdb.com/title/tt1618435","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"04","year":"2009","remarks":null},{"money":null,"country":null,"day":"21","month":"06","year":"2009","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 19 min (79 min) (Spain)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.2","filmingLocations":[{"location":"California, USA"}],"rated":"PG","awards":[],"votes":"2,606","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0197868","name":"Warner Premiere"},{"idCompany":"co0005780","name":"Cartoon Network"},{"idCompany":"co0028338","name":"Atlas Entertainment"}],"keywords":{"keywords":["scooby doo","dog","sequel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:56:41"}}