{"data":{"movies":[{"title":"Million Dollar Arm","originalTitle":"","year":"2014","releaseDate":"20140516","directors":[{"name":"Craig Gillespie","id":"nm0318916"}],"writers":[{"name":"Tom McCarthy","id":"nm0565336"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1OTUwOTA0M15BMl5BanBnXkFtZTgwMTA0Nzk4MjE@._V1.jpg","countries":["USA"],"languages":["English","Hindi"],"genres":["Biography","Drama","Sport"],"plot":"In 2008, J. B. Bernstein is a sports agent who finds his business being seriously outplayed by his deep-pocketed competitors. Inspired by reality shows and Indian cricket games on TV, Bernstein gets the bold idea of finding cricket players in India and training them to become pro baseball players in America. After a long search, Bernstein finds two talented, but non-cricket playing, youths, Rinku Singh and Dinesh Patel. Together, Berthstein takes his prospects to Los Angeles where they find mastering a new sport in a foreign land a daunting challenge. As these boys struggle amid an alien culture, Bernstein must find a way to make their dream come true. In doing, Bernstein finds a deeper humanity to his work with growing friendships he never expected to have.","simplePlot":"A sports agent stages an unconventional recruitment strategy to get talented Indian cricket players to play Major League Baseball.","actors":[{"actorName":"Jon Hamm","urlProfile":"http://www.imdb.com/name/nm0358316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg0MzA4MTY5M15BMl5BanBnXkFtZTcwODg2MTIwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1971","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Jonathan Daniel Hamm","height":"6' 2\" (1.88 m)","bio":"Jon Hamm was born on March 10, 1971 in St. Louis, Missouri, USA as Jonathan Daniel Hamm. He is an actor and producer, known for Mad Men (2007), The Town (2010) and Minions (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg0MzA4MTY5M15BMl5BanBnXkFtZTcwODg2MTIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0358316","name":"Jon Hamm","idIMDB":"nm0358316"},"actorId":"nm0358316","character":"JB","urlCharacter":"http://www.imdb.com/character/ch0410463","main":true},{"actorName":"Pitobash","urlProfile":"http://www.imdb.com/name/nm3329873","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MzMwMTk2M15BMl5BanBnXkFtZTgwNDAzOTU3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Pitobash was born in Deuli, Nayagarh, Orissa to an Oriya Brahmin family. He is the youngest among his 3 brothers and 2 sisters. His mother is a Retd. school teacher and his father worked for the Agriculture department. Pitobash was brought up in Bhubaneswar where he completed his schooling from Government High School, Unit 1, Bhubaneswar. Then, he joined Buxi Jagabandhu Bidyadhar College, Bhubaneswar for his higher secondary education. He has completed Bachelor of Technology degree in 2005 from Government College of Engineering & Leather Technology in Leather Technology from Kolkata. He also hold his diploma in acting from the prestigious Film and Television Institute of India,Pune which helped him a lot. Pitobash was honored \"National Balshree Award\" from the president of India in the field of creative performance at the age of 12. He was also involved in theater in Kolkata 2007 from 2001-05. Later on, he joined Bollywood as an actor. Now with Walt Disney's \"Million Dollar Arm\" Pitobash is making his Hollywood Debut.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MzMwMTk2M15BMl5BanBnXkFtZTgwNDAzOTU3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3329873","name":"Pitobash","idIMDB":"nm3329873"},"actorId":"nm3329873","character":"Amit","urlCharacter":"http://www.imdb.com/character/ch0440960","main":true},{"actorName":"Suraj Sharma","urlProfile":"http://www.imdb.com/name/nm4139037","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MDU5NTM1OF5BMl5BanBnXkFtZTcwNDQ0MDYwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1993","placeOfBirth":" New Delhi, India","height":"5' 9\" (1.75 m)","bio":"Suraj was born and raised in New Dehli, India. His mother is an economist and his father is a software engineer. He has a brother and sister who are both younger than he. Was one of 3,000 to audition for the role of Pi in Life of Pi (2012) and he attended the audition only because his younger brother asked him to. Several rounds of auditions ended when director Ang Lee chose Sharma because of his expressive eyes and innocent appearance. Since appearing in Life of Pi (2012), Sharma has returned to his study of philosophy at St. Stephens College, Delhi of Delhi University. Sharma received a Las Vegas Film Critics Society Award for Youth in Film for his performance in Life of Pi (2012) as well as an MTV Movie Award and a Saturn Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MDU5NTM1OF5BMl5BanBnXkFtZTcwNDQ0MDYwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4139037","name":"Suraj Sharma","idIMDB":"nm4139037"},"actorId":"nm4139037","character":"Rinku","urlCharacter":"http://www.imdb.com/character/ch0388381","main":true},{"actorName":"Madhur Mittal","urlProfile":"http://www.imdb.com/name/nm2639934","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjUxMDIxMF5BMl5BanBnXkFtZTcwMjQxODQzMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Madhur Mittal is an actor, known for Slumdog Millionaire (2008), Million Dollar Arm (2014) and L'île au trésor (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjUxMDIxMF5BMl5BanBnXkFtZTcwMjQxODQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2639934","name":"Madhur Mittal","idIMDB":"nm2639934"},"actorId":"nm2639934","character":"Dinesh","urlCharacter":"http://www.imdb.com/character/ch0440962","main":true},{"actorName":"Aasif Mandvi","urlProfile":"http://www.imdb.com/name/nm0541902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjI1MDY0OV5BMl5BanBnXkFtZTcwNzg0MjU3Nw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1966","placeOfBirth":" Bombay, India","birthName":"Aasif Mandviwala","height":"5' 8\" (1.73 m)","bio":"Aasif Mandvi was born on March 5, 1966 in Bombay, India as Aasif Mandviwala. He is an actor and producer, known for Spider-Man 2 (2004), The Dictator (2012) and The Internship (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjI1MDY0OV5BMl5BanBnXkFtZTcwNzg0MjU3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0541902","name":"Aasif Mandvi","idIMDB":"nm0541902"},"actorId":"nm0541902","character":"Aash","urlCharacter":"http://www.imdb.com/character/ch0476536","main":true},{"actorName":"Darshan Jariwala","urlProfile":"http://www.imdb.com/name/nm1189762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDdiODliYjgtNDNlNi00MTYxLWI5MTctYjljYTdhZWViMmEzXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1958","placeOfBirth":" Bombay, State of Bombay, India","bio":"Darshan Jariwala was born on September 29, 1958 in Bombay, State of Bombay, India. He is an actor, known for Kahaani (2012), Million Dollar Arm (2014) and Ajab Prem Ki Ghazab Kahani (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDdiODliYjgtNDNlNi00MTYxLWI5MTctYjljYTdhZWViMmEzXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1189762","name":"Darshan Jariwala","idIMDB":"nm1189762"},"actorId":"nm1189762","character":"Vivek","urlCharacter":"http://www.imdb.com/character/ch0476537","main":true},{"actorName":"Lake Bell","urlProfile":"http://www.imdb.com/name/nm1128572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMzMzMDk5NV5BMl5BanBnXkFtZTgwNTEzODY3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1979","placeOfBirth":" New York City, New York, USA","birthName":"Lake Caroline Siegel Bell","height":"5' 8\" (1.73 m)","bio":"Lake Bell was born on March 24, 1979 in New York City, New York, USA as Lake Caroline Siegel Bell. She is an actress and director, known for In a World... (2013), What Happens in Vegas (2008) and No Strings Attached (2011). She has been married to Scott Campbell since June 1, 2013. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMzMzMDk5NV5BMl5BanBnXkFtZTgwNTEzODY3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1128572","name":"Lake Bell","idIMDB":"nm1128572"},"actorId":"nm1128572","character":"Brenda","urlCharacter":"http://www.imdb.com/character/ch0440968","main":true},{"actorName":"Alan Arkin","urlProfile":"http://www.imdb.com/name/nm0000273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1934","placeOfBirth":" New York City, New York, USA","birthName":"Alan Wolf Arkin","height":"5' 9½\" (1.77 m)","bio":"Alan Arkin is an Academy Award-winning American actor who is also an acclaimed director, producer, author, singer and composer. He was born Alan Wolf Arkin on March 26, 1934, in Brooklyn, New York. His family were Jewish immigrants from Russia and Germany. In 1946 the Arkins moved from Brooklyn to Los Angeles, California. His father, David I. Arkin, was an artist and writer, who worked as a teacher, and lost his job for merely refusing to answer questions about his political affiliation during the 1950s Red Scare. His father challenged the politically biased dismissal and eventually prevailed, but unfortunately it was after his death. His mother, Beatrice (Wortis) Arkin, a teacher, shared his fathers views. Young Arkin was fond of music and acting, he was taking various acting classes from the age of 10. He attended Franklin High School, in Los Angeles, then Los Angeles City College from 1951 - 1953, and Bennington College in Vermont from 1953 - 1954. He sang in a college folk-band, and was involved in a drama class. He dropped out of college to form the folk music group The Tarriers, in which Arkin was the lead singer and played guitar. He co-wrote the 1956 hit \"The Banana Boat Song\" - a Jamaican calypso folk song, which became better known as Harry Belafonte's popular version, and reached #4 on the Billboard chart. At that time Arkin was a struggling young actor who played bit parts on television and on stage, and made a living as a delivery boy, repairman, pot washer and baby sitter. From 1958 - 1968 he performed and recorded with the children's folk group, The Babysitters. He has also recorded an entire album for the Elektra label titled \"Folksongs - Once Over Lightly.\" In 1957 Arkin made his first big screen appearance as a lead singer with The Tarriers in Calypso Heat Wave (1957). Then he made his Off-Broadway debut as a singer in \"Heloise\" (1958). Next year he joined the Compass Theatre in St. Louis, Missouri. There he caught the eye of stage director Bob Sills and became the original member of the \"Second City\" troupe in Chicago. In 1961 Arkin made his Broadway debut in musical \"From the Second City\", for which he wrote lyrics and sketches, then starred as David Kolowitz in the Broadway comedy \"Enter Laughing\" (1963), for which he won a Tony Award. He starred in a Broadway musical \"From the Second City production, then returned to Broadway as Harry Berlin in \"Luv\" (1964). Arkin made his directorial debut with an Off-Broadway hit called \"Eh?\" (1966), which introduced the young actor, named Dustin Hoffman. He won a Drama Desk Award for his direction of the Off-Broadway production of \"Little Murders\" (1969), and another Drama Desk Award for \"The White House Murder Case\" (1970). He also directed the original version of Neil Simon's hilarious smash, \"The Sunshine Boys\" (1972), which ran over 500 performances. Arkin earned his first Academy Award nomination as Best Actor for his feature acting debut in a comedy The Russians Are Coming! The Russians Are Coming! (1966), by director Norman Jewison, co-starring as Lt. Rozanov, a Soviet submariner who is mistaken for a spy after his boat accidentally wrecks aground in New England. Arkin demonstrated his dramatic range as the psychopathic killer Roat in suspense film Wait Until Dark (1967), opposite Audrey Hepburn. He reinvented himself as the sensitive deaf-mute in The Heart Is a Lonely Hunter (1968), for which he received his second Academy Award nomination as Best Actor in the Leading role. He followed with what remained his best known role as Captain Yossarian in Catch-22 (1970), directed by Mike Nichols and based on the eponymous anti-war novel by Joseph Heller. In it Arkin arguably gave his strongest performance, however, his career suffered because the film initially did not live up to expectations. After a few years of directorial work on television, Arkin made a comeback with an impressive portrayal of doctor Sigmund Freud in The Seven-Per-Cent Solution (1976). In the early 1980s he acted in three movies that were family affairs, written by his wife, Barbara Dana, and co-starring his son, Adam Arkin. During the 1990s he turned out several notable performances, such as a bitter former baseball player in TNT's Cooperstown (1993), and as a hilarious psychiatrist opposite John Cusack in Grosse Pointe Blank (1997). He won raves for his portrayal of a divorced father who struggles to keep his kids enrolled in the Beverly Hills school system in Slums of Beverly Hills (1998). Arkin gave a brilliant performance opposite Robin Williams in Jakob le menteur (1999), a film about the Nazi occupation of Poland. He also returned to the New York stage co-starring with his son, Tony Arkin and Elaine May in \"Power Plays\", which he also co-authored. His most recent comeback as a heroin-snorting, sex-crazed, foul-mouthed grandfather in Little Miss Sunshine (2006), earned him his third Academy Award nomination for Best Performance by an Actor in a Supporting Role, and his first Academy Award. Alan Arkin has been a modern Renaissance man. In addition to his achievements as an actor, director, and producer, he made his mark as a singer-songwriter with his popular-song compositions \"Banana Boat Song\", \"Cuddle Bug,\" \"That's Me,\" and \"Best Time of the Year.\" Arkin also authored several books, including science-fiction and some children's stories, such as \"The Clearing\", \"The Lemming Condition\" and \"Cassie Loves Beethoven\" among his other publications. He is a father of three sons, Adam, Matthew, and Tony, and a grandfather of Molly Arkin. Alan Arkin has been a strong supporter of an organic way of living and also a proponent for preservation of the environment and natural habitat. He has been avoiding the show-biz-milieu and is known as an actor who does not really care about prestigious awards, but values having a good job and being acknowledged by his peers. In Arkin's own words he wants to \"Stay home for three months. Living as quietly as humanly possible.\" Arkin was given an Indian name, Grey Wolf, by his Native American friends in New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000273","name":"Alan Arkin","nicknames":["The Tarriers"],"idIMDB":"nm0000273"},"actorId":"nm0000273","character":"Ray","urlCharacter":"http://www.imdb.com/character/ch0476545","main":true},{"actorName":"Bill Paxton","urlProfile":"http://www.imdb.com/name/nm0000200","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2NTQwOTAyNV5BMl5BanBnXkFtZTcwNTUyNjYwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1955","placeOfBirth":" Fort Worth, Texas, USA","birthName":"William Paxton","height":"6' (1.83 m)","bio":"Bill Paxton was born on May 17, 1955 in Fort Worth, Texas. He was the son of Mary Lou (Gray) and John Lane Paxton, a businessman and actor (as John Paxton). Bill moved to Los Angeles, California at age eighteen, where he found work in the film industry as a set dresser for Roger Corman's New World Pictures. He made his film debut in the Corman film Crazy Mama (1975), directed by Jonathan Demme. Moving to New York, Paxton studied acting under Stella Adler at New York University. After landing a small role in Stripes (1981), he found steady work in low-budget films and television. He also directed, wrote and produced award-winning short films including Fish Heads (1980), which aired on Saturday Night Live (1975). His first appearance in a James Cameron film was a small role in The Terminator (1984), followed by his very memorable performance as Private Hudson in Aliens (1986) and as the nomadic vampire Severen in Kathryn Bigelow's Near Dark (1987). Bill also appeared in John Hughes' Weird Science (1985), as Wyatt Donnelly's sadistic older brother Chet. Although he continued to work steadily in film and television, his big break did not come until his lead role in the critically acclaimed film-noir One False Move (1992). This quickly led to strong supporting roles as Wyatt Earp's naive younger brother Morgan in Tombstone (1993) and as Fred Haise, one of the three astronauts, in Apollo 13 (1995), as well as in James Cameron's offering True Lies (1994). Bill died on February 25, 2017, in Los Angeles, from complications following heart surgery. He was 61.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2NTQwOTAyNV5BMl5BanBnXkFtZTcwNTUyNjYwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000200","name":"Bill Paxton","nicknames":["Wild Bill","Knuckles"],"idIMDB":"nm0000200"},"actorId":"nm0000200","character":"Tom House","urlCharacter":"http://www.imdb.com/character/ch0476546","main":true},{"actorName":"Gregory Alan Williams","urlProfile":"http://www.imdb.com/name/nm0930707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDQ5ODE1NV5BMl5BanBnXkFtZTgwMzYwNDA5OTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1956","placeOfBirth":" Des Moines, Iowa, USA","bio":"Gregory Alan Williams was born on June 12, 1956 in Des Moines, Iowa, USA. He is an actor and writer, known for Baywatch (1989), Terminator Genisys (2015) and In the Line of Fire (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDQ5ODE1NV5BMl5BanBnXkFtZTgwMzYwNDA5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930707","name":"Gregory Alan Williams","idIMDB":"nm0930707"},"actorId":"nm0930707","character":"Doug","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allyn Rachel","urlProfile":"http://www.imdb.com/name/nm2085100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2UyNjI0NzctZjdiOS00NGIzLWFiNGUtMjZjYjAxZjg5NDUwXkEyXkFqcGdeQXVyNzgzMDE3NQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"birthName":"Allyn Rachel Lichtenfeld","height":"5' 2\" (1.57 m)","bio":"Allyn Rachel was born as Allyn Rachel Lichtenfeld. She is an actress and writer, known for Kong: Skull Island (2017), Togetherness (2015) and Million Dollar Arm (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2UyNjI0NzctZjdiOS00NGIzLWFiNGUtMjZjYjAxZjg5NDUwXkEyXkFqcGdeQXVyNzgzMDE3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2085100","name":"Allyn Rachel","nicknames":["Ally"],"idIMDB":"nm2085100"},"actorId":"nm2085100","character":"Theresa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tzi Ma","urlProfile":"http://www.imdb.com/name/nm0002245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWQ3OGJlMjgtNWFlNS00YzM4LWIzNzMtYTM1MzFkY2EyYTUxL2ltYWdlXkEyXkFqcGdeQXVyMjQ0ODU3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"An endlessly imaginative and compelling actor, Tzi Ma has created a score of memorable film, television and stage characters. From his recent roles as Hinh, a deadly efficient assassin and nationalist spy masquerading as Michael Caine's ever-invaluable assistant in The Quiet American (2002) to his hilarious, lit-cigarette-swallowing take as The General in Joel Coen and Ethan Coen's The Ladykillers (2004), Ma always delivers the unexpected. So far, 2005 is offering Ma even more opportunities to brand his indelible stamp on widely diverse projects. This year will see him in a slate of shows, including a multi-episode cliffhanger for the critically acclaimed hit series 24 (2001); the inspirational Lions Gate family drama Akeelah and the Bee (2006); Nick Cassavetes' Alpha Dog (2006); the indie experimental film by new filmmaker Juwan Chung, Baby (2003), in which Ma will also function as associate producer; an episode of JAG (1995) that aired in the spring, and the indie movie Red Doors (2005), which premiered at the Fourth Annual Tribeca Film Festival and won for best narrative feature made in New York. Red Doors (2005) is the work of writer/director Georgia Lee, who served as director Martin Scorsese's apprentice on the set of Gangs of New York (2002) in Rome. She approached Ma to play the part of vulnerable, emotionally bankrupt father Ed Wong, who is desperately trying to mask his incessant suicidal compulsions from his three grown daughters. On the pulse-accelerating season closer for 24 (2001), Ma is the main protagonist, the relentless head of security for the Chinese consulate in Los Angeles. Shedding his diplomatic correctness to go eyeball to eyeball against Kiefer Sutherland's Agent Jack Bauer, Ma's character engages in a searing, deadly duel of wit, intimidation and lies. In Baby (2003) and Akeelah and the Bee (2006), starring Laurence Fishburne and Angela Bassett, Ma again interprets fatherhood, first as an intensely competitive \"sports dad\" driving his small son to win at any cost, then as an alcoholic who sees his son embracing a similar path of failure and waste. It was a personal invitation from director Cassavetes that led to Ma's cameo in Alpha Dog (2006), based on the headline-grabbing activities of Jesse James Hollywood, an alleged drug dealer accused of masterminding a kidnap-murder. Tzi Ma was born in Hong Kong and raised in New York City. Surrounded by music, diverse cultures, and an eclectic lifestyle, he defied tradition to study classical theater and dance. Drive and versatility resulted in steady stage and film work and since that time he has appeared in such television series as The Practice (1997), JAG (1995), The Bernie Mac Show (2001), Chicago Hope (1994), Millennium (1996), Jake 2.0 (2003), Martial Law (1998), ER (1994), Law & Order (1990), Boomtown (2002), as the star of the series Yellowthread Street (1990), and in the popular recurring role of Det. Harold Ng on NYPD Blue (1993). His numerous feature films include Rush Hour (1998), Golden Gate (1998), Dante's Peak (1997), Rapid Fire (1992), Chain Reaction (1996), and the acclaimed indie feature Catfish in Black Bean Sauce (1999). On stage, he garnered critical and popular acclaim with his starring role of \"Master Wang/Sammy Fong\" in the revised version of \"Flower Drum Song\" by David Henry Hwang, at the Mark Taper Forum in Los Angeles. Ma also appeared in two plays written especially for him, \"The Dance and The Railroad,\" by Tony award-winning playwright Hwang (M. Butterfly) and \"In Perpetuity Throughout The Universe\" by Eric Ellis Overmyer (executive producer of Law & Order (1990)). Ma has received numerous awards and nominations for his work, including the Cine Golden Eagle Award for Best Actor in \"The Dance and The Railroad\"; an Ace Award nomination for Best Supporting Actor in The Forgotten (2004), a TV film directed by James Keach; a Dramalogue Best\"Choreographer/Best Director Award for \"The Dance and The Railroad\"; and a Garland Award nomination for Best Actor, as well as a Los Angeles City Council Citation, for \"Flower Drum Song.\" Ma maintains homes in New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWQ3OGJlMjgtNWFlNS00YzM4LWIzNzMtYTM1MzFkY2EyYTUxL2ltYWdlXkEyXkFqcGdeQXVyMjQ0ODU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002245","name":"Tzi Ma","idIMDB":"nm0002245"},"actorId":"nm0002245","character":"Chang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rey Maualuga","urlProfile":"http://www.imdb.com/name/nm4391986","urlPhoto":"","biography":{"bio":"Rey Maualuga is an actor, known for Million Dollar Arm (2014), 2007 Rose Bowl (2007) and 2008 Rose Bowl (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4391986","name":"Rey Maualuga","idIMDB":"nm4391986"},"actorId":"nm4391986","character":"Popo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bar Paly","urlProfile":"http://www.imdb.com/name/nm1427034","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDQ0NTczOF5BMl5BanBnXkFtZTgwNDM4ODczODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1985","placeOfBirth":" Nizhniy Tagil, Sverdlovskaya oblast, RSFSR, USSR [now Russia]","birthName":"Barbara Phaly","height":"5' 8½\" (1.74 m)","bio":"Bar Paly was born on April 29, 1985 in Nizhniy Tagil, Sverdlovskaya oblast, RSFSR, USSR as Barbara Phaly. She is an actress, known for Pain & Gain (2013), Non-Stop (2014) and The Ruins (2008). She is married to Ian Kessner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDQ0NTczOF5BMl5BanBnXkFtZTgwNDM4ODczODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1427034","name":"Bar Paly","idIMDB":"nm1427034"},"actorId":"nm1427034","character":"Lisette","urlCharacter":"http://www.imdb.com/character/ch0492701","main":true},{"actorName":"Jaspaul Sandhu","urlProfile":"http://www.imdb.com/name/nm3034745","urlPhoto":"","biography":{"bio":"Jaspaul Sandhu is an actor, known for Million Dollar Arm (2014) and Contract (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3034745","name":"Jaspaul Sandhu","idIMDB":"nm3034745"},"actorId":"nm3034745","character":"Grumpy Guy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1647668","urlIMDB":"http://www.imdb.com/title/tt1647668","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,511,000","country":"USA","day":"18","month":"05","year":"2014","remarks":"3,019 Screens"}],"gross":[{"money":"$36,312,739","country":"USA","day":"03","month":"08","year":"2014","remarks":""},{"money":"$39,955,572","country":"USA","day":"20","month":"07","year":"2014","remarks":""},{"money":"$35,643,752","country":"USA","day":"13","month":"07","year":"2014","remarks":""},{"money":"$35,012,418","country":"USA","day":"29","month":"06","year":"2014","remarks":""},{"money":"$34,402,198","country":"USA","day":"22","month":"06","year":"2014","remarks":""},{"money":"$33,471,302","country":"USA","day":"15","month":"06","year":"2014","remarks":""},{"money":"$31,550,980","country":"USA","day":"08","month":"06","year":"2014","remarks":""},{"money":"$28,097,000","country":"USA","day":"01","month":"06","year":"2014","remarks":""},{"money":"$22,243,000","country":"USA","day":"25","month":"05","year":"2014","remarks":""},{"money":"$10,511,000","country":"USA","day":"18","month":"05","year":"2014","remarks":""}],"weekendGross":[{"money":"$77,177","country":"USA","day":"03","month":"08","year":"2014","remarks":"101 Screens"},{"money":"$169,823","country":"USA","day":"20","month":"07","year":"2014","remarks":"175 Screens"},{"money":"$186,158","country":"USA","day":"13","month":"07","year":"2014","remarks":"224 Screens"},{"money":"$300,252","country":"USA","day":"29","month":"06","year":"2014","remarks":"273 Screens"},{"money":"$538,050","country":"USA","day":"22","month":"06","year":"2014","remarks":"444 Screens"},{"money":"$804,423","country":"USA","day":"15","month":"06","year":"2014","remarks":"577 Screens"},{"money":"$2,025,950","country":"USA","day":"08","month":"06","year":"2014","remarks":"1,643 Screens"},{"money":"$3,700,000","country":"USA","day":"01","month":"06","year":"2014","remarks":"2,329 Screens"},{"money":"$8,709,000","country":"USA","day":"25","month":"05","year":"2014","remarks":"3,019 Screens"},{"money":"$10,511,000","country":"USA","day":"18","month":"05","year":"2014","remarks":"3,019 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["2 hr 4 min (124 min)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.39 : 1"],"camera":["Arri Alexa XT Studio, Cooke S4 and Angenieux Optimo Lenses","Arri Alexa XT, Cooke S4 and Angenieux Optimo Lenses","Arricam LT, Cooke S4 and Angenieux Optimo Lenses","Arricam ST, Cooke S4 and Angenieux Optimo Lenses","Arriflex 235, Cooke S4 and Angenieux Optimo Lenses","Arriflex 435, Cooke S4 and Angenieux Optimo Lenses"],"laboratory":["Company 3, Atlanta (GA), USA (dailies)","Company 3, Los Angeles (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":["3,399.17 m (7 reels)"],"negativeFormat":["35 mm (Kodak Vision3 50D 5203, Vision3 250D 5207, Vision3 500T 5219)","Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3514DI)","D-Cinema"]},"rating":"7.0","metascore":"56","filmingLocations":[{"location":"India"}],"rated":"PG","awards":[{"award":"Heartland Film 2014","titlesAwards":[{"titleAwardOutcome":"Won Truly Moving Picture Award","categories":[{"category":"","names":[{"name":"Craig Gillespie","id":"nm0318916","role":null},{"name":"Walt Disney Pictures","id":null,"role":null},{"name":"Walt Disney Studios Motion Pictures","id":null,"role":null}]}]}]},{"award":"Teen Choice Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Drama","names":[]},{"category":"Choice Movie Actor: Drama","names":[{"name":"Jon Hamm","id":"nm0358316","role":null}]}]}]}],"votes":"37,386","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0268489","name":"Roth Films"},{"idCompany":"co0093869","name":"Mayhem Pictures"}],"keywords":{"keywords":["baseball","india","based on true story","sports agent","training","cricket the game","audition","hotel","fish out of water","talent search"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:55:32"}}