{"data":{"movies":[{"title":"Romeo & Juliet","originalTitle":"","year":"2013","releaseDate":"20131011","directors":[{"name":"Carlo Carlei","id":"nm0137363"}],"writers":[{"name":"Julian Fellowes","id":"nm0271501"},{"name":"William Shakespeare","id":"nm0000636"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MjQwOTg4MTheQTJeQWpwZ15BbWU3MDM3NDE0OTk@._V1.jpg","countries":["UK","Italy","Switzerland"],"languages":["English","Latin"],"genres":["Drama","Romance"],"plot":"In the city of Verona, two families have a prolonged and ancient feud. The Montagues and the Capulets co-exist under the stern eye of the Prince, but the hatred between the families threatens all, in particular the children. The young men of both families are hot-blooded and ready to fight at any provocation, despite the Prince's edict against such fights. But when young Romeo, a Montague, first sets eyes on the virginal Capulet daughter Juliet, no enmity between families can prevent his falling in love with her, and her with him. From this risk-laden romance comes both joy and tragedy for all.","simplePlot":"Romeo and Juliet secretly wed despite the sworn contempt their families hold for each other. It is not long, however, before a chain of fateful events changes the lives of both families forever.","actors":[{"actorName":"Damian Lewis","urlProfile":"http://www.imdb.com/name/nm0507073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTcyMDgxMl5BMl5BanBnXkFtZTcwNDU3NTU5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1971","placeOfBirth":" St. John's Wood, London, England, UK","birthName":"Damian Watcyn Lewis","height":"6' 1\" (1.86 m)","bio":"Widely regarded as the one of greatest stage and screen actors both in his native Great Britain and internationally, Damian Lewis was born on February 11, 1971, in St. John's Wood, London, England, to Charlotte Mary (Bowater), from an upper-class background, and J. Watcyn Lewis, a city broker whose own parents were Welsh. He was raised on Abbey Road in London until the age of 8 with his siblings Gareth, William, and Amanda. In 1979, he was sent to Ashdown House boarding school, then was educated at Eton College. At age 16, he formed his own theater company, then worked in South London, then traveled around Africa. From 1990 to 1993, he studied at Guildhall School of Music and Drama, alongside Daniel Craig and Joseph Fiennes. Among his teachers was RSC stalwart Colin McCormack. Lewis graduated in 1993, and worked on the stage, particularly with the Royal Shakespeare Company. There he was seen by director Steven Spielberg, who subsequently cast him as Richard Winters in the HBO/BBC miniseries Band of Brothers (2001), for which he was nominated for a Golden Globe, among other awards. Lewis continues his career in films, TV, and theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTcyMDgxMl5BMl5BanBnXkFtZTcwNDU3NTU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507073","name":"Damian Lewis","idIMDB":"nm0507073"},"actorId":"nm0507073","character":"Lord Capulet","urlCharacter":"http://www.imdb.com/character/ch0000695","main":true},{"actorName":"Laura Morante","urlProfile":"http://www.imdb.com/name/nm0603090","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDUzOTAxOV5BMl5BanBnXkFtZTcwMTU3OTc1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1956","placeOfBirth":" Santa Fiora, Tuscany, Italy","height":"5' 7\" (1.7 m)","bio":"Laura Morante was born on August 21, 1956 in Santa Fiora, Tuscany, Italy. She is an actress and director, known for La chambre du fils (2001), Remember Me, My Love (2003) and Romeo & Juliet (2013). She has been married to Francesco Giammatteo since October 3, 2004. She was previously married to Georges Claisse and Daniele Costantini.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDUzOTAxOV5BMl5BanBnXkFtZTcwMTU3OTc1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0603090","name":"Laura Morante","idIMDB":"nm0603090"},"actorId":"nm0603090","character":"Lady Montague","urlCharacter":"http://www.imdb.com/character/ch0048753","main":true},{"actorName":"Tomas Arana","urlProfile":"http://www.imdb.com/name/nm0032962","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwOTk3NDUxNF5BMl5BanBnXkFtZTcwMTgwMDczMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1955","placeOfBirth":" Auburn, California, USA","birthName":"Thomas Clifford Arana","height":"6' 0½\" (1.84 m)","bio":"TOMAS ARANA He co-starred as Quintus in Ridley Scott's GLADIATOR, the Dreamworks-Universal movie and winner of five Oscars, including Best Picture, starring Russell Crowe & Joaquin Phoenix. He has appeared in more than 60 films, ranging from large budget Hollywood Studio pictures to Independent films in both the U.S. and Europe. His studio pictures include THE DARK KNIGHT RISES, LIMITLESS, THE BOURNE SUPREMACY, GUARDIANS OF THE GALAXY, LA CONFIDENTIAL, THE BODYGUARD (as Portman, Kevin Costner's antagonist), HUNT FOR RED OCTOBER (as Loginov, the Russian Saboteur), among others. He played Lazarus in Martin Scorsese's controversial LAST TEMPTATION OF CHRIST, starring Willem Dafoe & Harvey Keitel. In Television he was a regular in the Michael Seitzman CBS Network show INTELLIGENCE, starring Josh Holloway, Marg Helgenberger and Megan Ory., as well as appearing as a guest star on more than 30 Network TV shows. In Europe, he was also a regular on the smash hit Italian RAI TV series TUTTI PAZZI PER AMORE and the outstanding German ZDF TV drama VERBRECHEN. Arana has played leading and supporting roles in over 30 European movie productions including films by directors such as Lina Wertmüller, Liliana Cavani, Carlo Verdone, Michele Soavi and with one of Japan's most successful directors: Koreyoshi Kurahara, in the Toho production SEE YOU.He co-starred as Quintus in Ridley Scott's Gladiator (2000), the Dreamworks-Universal movie and winner of five Oscars, including Best Picture, co-starring Russell Crowe,Joaquin Phoenix, Connie Nielsen, Richard Harris, Derek Jacobi, and Oliver Reed. He has appeared in more than 60 films, ranging from large budget Hollywood Studio pictures to Independent films in both the U.S. and Europe. His studio pictures include THE L.A. Confidential (1997) (as Bruening, a rogue cop), The Bodyguard (1992) (as Portman,Kevin Costner's antagonist and Whitney Houston's assassin), The Hunt for Red October(1990) (as Loginov, the Russian Saboteur), Tombstone (1993), and First Kid (1996). He played Lazarus in Martin Scorsese's controversial The Last Temptation of Christ (1988). He was also featured in the Sundance-developed Wildflowers (1999), an independent film by Melissa Painter starring Clea DuVall and Daryl Hannah. Arana has played leading and supporting roles in over 30 European productions including films by directors such as Lina Wertmüller, Liliana Cavani, Carlo Verdone, Michele Soavi and with one of Japan's most successful directors: Koreyoshi Kurahara in the Toho production Umi e (1988). In theatre, Arana was the producer as well as a leading actor in the internationally acclaimed Theatre Company Falso Movimento, based in Naples, Italy. Under Arana and the artistic director Mario Martone (now a major Italian Film Director), Falso Movimento won many awards including Best Play of the Year, Best Set Design and the prestigious Mondello Prize. The company toured worldwide for more than nine years at major International Festivals including London, Frankfurt, New York, Los Angeles, Madrid, Barcelona, Copenhagen, Stockholm, Jerusalem, and others. Tomas Arana grew up in San Francisco and studied classical theatre at its prestigious American Conservatory Theatre, afterwards relocating to New York and acting in off-Broadway productions. He then hitchhiked throughout Europe and ended up living in Naples, Italy, where he worked in the Lucio Amelio Art Gallery, working with such artists as Warhol, Rauschenberg, Beuys, Richter, Longobardi, Clemente, Gilbert & George, etc. Andy Warhol painted his portrait, which is now part of his extensive art collection. He has both U.S. and Italian citizenship. He is married and has two sons. In theatre, Arana was the producer as well as a leading actor in the internationally acclaimed Theatre Company Falso Movimento, based in Naples, Italy. Under Arana and the artistic director Mario Martone (now a major Italian Film Director), Falso Movimento won many awards including Best Play of the Year, Best Set Design and the prestigious Mondello Prize. The company toured worldwide for more than nine years at major International Festivals including London, Frankfurt, New York, Los Angeles, Madrid, Barcelona, Copenhagen, Stockholm, Jerusalem, and others. The company evolved into TEATRI UNITI, produced by Angelo Curti and its Artistic Director now is Toni Servillo (2 European Film Awards for Best Actor and the star of THE GREAT BEAUTY, the Oscar winning film by Paolo Sorrentino). Tomas Arana grew up in San Francisco and studied classical theatre at its prestigious American Conservatory Theatre, afterwards relocating to New York and acting in off-Broadway productions. He then hitchhiked throughout Europe and ended up living in Naples, Italy, where he worked in the famous Lucio Amelio Art Gallery, working with such artists as Warhol, Rauschenberg, Beuys, Richter, Longobardi, Clemente, Gilbert & George, etc. Andy Warhol painted his portrait, which is now part of his extensive art collection. He was an award winning athlete as a youth and has practiced for many years Aikido, Judo, Japanese Sword, Fencing as well as advanced dance and movement techniques. He has both U.S. and Italian citizenship. He has three sons, Yanez, Joaquin & Dashiell Arana.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwOTk3NDUxNF5BMl5BanBnXkFtZTcwMTgwMDczMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0032962","name":"Tomas Arana","idIMDB":"nm0032962"},"actorId":"nm0032962","character":"Lord Montague","urlCharacter":"http://www.imdb.com/character/ch0048752","main":true},{"actorName":"Kodi Smit-McPhee","urlProfile":"http://www.imdb.com/name/nm2240346","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE4ODU4NzY5NV5BMl5BanBnXkFtZTgwOTIwNTk5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1996","placeOfBirth":" Adelaide, South Australia, Australia","height":"6' 2\" (1.88 m)","bio":"Kodi was born on June 13, 1996 in Adelaide, Australia, to Sonja Smit and Andy McPhee, who is an actor and professional wrestler. His sister is actress Sianoa Smit-McPhee. In 2014, Kodi starred in Twentieth Century Fox's Dawn of the Planet of the Apes opposite Andy Serkis, Jason Clarke, Gary Oldman, and Keri Russell. The project reunited him with director Matt Reeves with whom he previously worked with on the film Let Me in (opposite Chloe Moretz). The film has grossed over $700MM Worldwide. The film Young Ones (dir: Jake Paltrow) in which Kodi starred opposite Michael Shannon, Nicholas Hoult and Elle Fanning, premiered at the 2014 Sundance Film Festival. Kodi was recently at the 2015 Sundance Film Festival for the premiere of Slow West (dir. John MacLean), in which he stars opposite Michael Fassbender and Ben Mendelsohn. The film received the World Cinema Grand Jury Prize. It's a Western two hander that takes place in the Wild West in the 1870's. A24 has released the film in the US to rave reviews. Earlier in 2015, Kodi was seen as the lead role in an epic 8 part Australian television mini series Gallipoli (2015) (Channel Nine) based on the infamous WWI battle that took place 100 years ago. In 2016, Kodi co-starred in X-Men: Apocalypse (2016) (dir: Bryan Singer) for Twentieth Century Fox, portraying the role of Nightcrawler. He lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE4ODU4NzY5NV5BMl5BanBnXkFtZTgwOTIwNTk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2240346","name":"Kodi Smit-McPhee","nicknames":["Koda Spekz"],"idIMDB":"nm2240346"},"actorId":"nm2240346","character":"Benvolio","urlCharacter":"http://www.imdb.com/character/ch0000579","main":true},{"actorName":"Natascha McElhone","urlProfile":"http://www.imdb.com/name/nm0001523","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y2Yzg3MTktMDI0Yi00MTRhLWI5YzQtMmVmN2I3MTcwNzY2L2ltYWdlXkEyXkFqcGdeQXVyMzI1NjU1NTA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1969","placeOfBirth":" Surrey, England, UK","birthName":"Natasha Abigail Taylor","height":"5' 8\" (1.73 m)","bio":"Natascha McElhone was born in Walton on Thames, London. She attended several schools, Camden School for Girls being the last. Natascha McElhone established herself as a talented leading actress when she left drama school in 1993 to play the lead in her first film, Merchant Ivory's Surviving Picasso, opposite Anthony Hopkins. She quickly followed this with Peter Weir's film, The Truman Show; Alan J. Pakula's The Devil's Own, with Brad Pitt and Harrison Ford; and John Frankenheimer's action epic Ronin, in which she co-starred with Robert De Niro. She also played Rosalind to Kenneth Branagh's Berowne in his musical version of William Shakespeare's Love's Labour's Lost. In 2003, McElhone co-starred with George Clooney in Steven Soderbergh's futuristic love story, Solaris. McElhone starred in TNT's mini-series The Company, a Golden Globe-nominated drama. In 2005, she starred in NBC's Emmy-nominated mini-series, Revelations. Natascha McElhone stars opposite David Duchovny in the Golden Globe-winning Showtime series Californication. McElhone also stars in the children's fantasy film, The Secret Of Moonacre Manor, with Ioan Gruffud. She shared the title role in Mrs Dalloway with Vanessa Redgrave directed by Oscar winning director Marleen Gorris. McElhone's other major film credits include City Of Ghosts, with Matt Dillon and Gerard Depardieu; Laurel Canyon, with Christian Bale and Francis McDormand; and Ladies In Lavender, with Dame Judi Dench and Dame Maggie Smith. She has most recently starred in The Kid and in two other British feature films 'The Theatre Of Dreams' with Toby Stephens and Brian Cox and in Julian Fellowes' adaptation of 'Romeo And Juliet' to be released March 2013. She has just completed filming 'The Sea' starring with Rufus Sewell, Ciaran Hinds and Charlotte Rampling also to be released in 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y2Yzg3MTktMDI0Yi00MTRhLWI5YzQtMmVmN2I3MTcwNzY2L2ltYWdlXkEyXkFqcGdeQXVyMzI1NjU1NTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001523","name":"Natascha McElhone","idIMDB":"nm0001523"},"actorId":"nm0001523","character":"Lady Capulet","urlCharacter":"http://www.imdb.com/character/ch0000587","main":true},{"actorName":"Stellan Skarsgård","urlProfile":"http://www.imdb.com/name/nm0001745","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDUzOTY0N15BMl5BanBnXkFtZTYwNjYxODE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1951","placeOfBirth":" Gothenburg, Västra Götalands län, Sweden","birthName":"John Stellan Skarsgård","height":"6' 3\" (1.91 m)","bio":"Stellan Skarsgård was born in Gothenburg, Västra Götalands län, Sweden, to Gudrun (Larsson) and Jan Skarsgård. He became a star in his teens through the title role in the TV-series Bombi Bitt och jag (1968). Between the years 1972-88 he was employed at The Royal Dramatic Theatre in Stockholm, where he participated in \"Vita rum\" (1988), August Strindberg's \"Ett drömspel\" (1986) and \"Mäster Olof\" (1988). Simultaneously Skarsgård did outstanding film roles, notably in The Simple-Minded Murderer (1982) by Hans Alfredson and with Fred Ward in American Playhouse: Noon Wine (1985). The fantastic performance gave him both a well-earned Guldbagge and Silver Berlin Bear. He portrayed the Skagen-painter Sören Kröyer in Hip Hip Hurrah! (1987) and the Swedish ambassador Raoul Wallenberg in Good Evening, Mr. Wallenberg (1990), both directed by Kjell Grede. Täcknamn Coq Rouge (1989) and Den demokratiske terroristen (1992) he played Jan Guillou's Swedish superagent Carl Hamilton. He also had the leading part in the Oscar nominated Oxen (1991) directed by the world-famous cinematographer Sven Nykvist. Skarsgård did his first (but small) role in an big American film with The Unbearable Lightness of Being (1988). The role of Captain Tupolev in The Hunt for Red October (1990) was at supposed to be biggest part in a Hollywood-film, but unfortunately it was cut down. His breakthrough instead came with Lars von Trier's Breaking the Waves (1996) opposite newcomer Emily Watson. After that Skarsgård got several supporting roles in American films, such as in My Son the Fanatic (1997), Gus Van Sant's Good Will Hunting (1997) and Steven Spielberg's Amistad (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDUzOTY0N15BMl5BanBnXkFtZTYwNjYxODE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001745","name":"Stellan Skarsgård","nicknames":["Skarzie"],"idIMDB":"nm0001745"},"actorId":"nm0001745","character":"Prince of Verona","urlCharacter":"http://www.imdb.com/character/ch0122679","main":true},{"actorName":"Tom Wisdom","urlProfile":"http://www.imdb.com/name/nm0936300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTM2ODQ1OF5BMl5BanBnXkFtZTcwMjk5OTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1973","placeOfBirth":" Swindon, Wiltshire, England, UK","height":"6' 3\" (1.91 m)","bio":"Tom Wisdom was born on February 18, 1973 in Swindon, Wiltshire, England. He is an actor, known for 300 (2006), Pirate Radio (2009) and The Sisterhood of the Traveling Pants 2 (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTM2ODQ1OF5BMl5BanBnXkFtZTcwMjk5OTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936300","name":"Tom Wisdom","idIMDB":"nm0936300"},"actorId":"nm0936300","character":"Count Paris","urlCharacter":"http://www.imdb.com/character/ch0000664","main":true},{"actorName":"Matt Patresi","urlProfile":"http://www.imdb.com/name/nm0665767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDMxNDc5OF5BMl5BanBnXkFtZTcwNDA5NjIzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Matt Patresi is an actor, known for The Passion of the Christ (2004), The International (2009) and Romeo & Juliet (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDMxNDc5OF5BMl5BanBnXkFtZTcwNDA5NjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665767","name":"Matt Patresi","idIMDB":"nm0665767"},"actorId":"nm0665767","character":"First Capulet Servant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcus J. Cotterell","urlProfile":"http://www.imdb.com/name/nm1080966","urlPhoto":"","biography":{"height":"6' (1.83 m)","bio":"Marcus J. Cotterell is an actor, known for The Best Offer (2013), Romeo & Juliet (2013) and Stalking Eva (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1080966","name":"Marcus J. Cotterell","idIMDB":"nm1080966"},"actorId":"nm1080966","character":"Second Capulet Servant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christian Cooke","urlProfile":"http://www.imdb.com/name/nm0177396","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQwNTIwMzAzNF5BMl5BanBnXkFtZTgwODA3NTgyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1987","placeOfBirth":" Leeds, West Yorkshire, England, UK","height":"5' 8\" (1.73 m)","bio":"Christian Louis Cooke was born in Leeds, West Yorkshire, England. He began his acting career at the age of 10 when he appeared in a production of Bedazzled at the Bingley Arts Centre. His first television appearance was in a commercial for Birds Eye beef burgers. His career has progressed from there. He has guest starred in 'Doctors', 'The Royal', 'Casualty' and 'George Gently'. He starred in one episode of the BBC's 'Robin Hood' as Will Scarlett's younger brother, Luke Scarlett. He also guest starred in the 2008 Doctor Who episodes \"The Sontaran Stratagem\" and \"The Poison Sky\", playing UNIT soldier Ross Jenkins, who dies in the latter episode. In 2010 Christian played the lead role of Freddie in Ricky Gervais' 'Cemetery Junction'. He also starred in the critically acclaimed Channel 4 four-part drama 'The Promise', directed by Peter Kosminsky. He recently starred in the new 1950s Miami-set drama series, Magic City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQwNTIwMzAzNF5BMl5BanBnXkFtZTgwODA3NTgyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177396","name":"Christian Cooke","idIMDB":"nm0177396"},"actorId":"nm0177396","character":"Mercutio","urlCharacter":"http://www.imdb.com/character/ch0000528","main":true},{"actorName":"Ed Westwick","urlProfile":"http://www.imdb.com/name/nm2067953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjk2Mzk1OF5BMl5BanBnXkFtZTcwMDA0NTQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1987","placeOfBirth":" Stevenage, Hertfordshire, England, UK","birthName":"Edward Westwick","height":"5' 8½\" (1.74 m)","bio":"Ed Westwick was born on June 27, 1987 in Stevenage, Hertfordshire, England as Edward Westwick. He is an actor, known for Gossip Girl (2007), Children of Men (2006) and J. Edgar (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjk2Mzk1OF5BMl5BanBnXkFtZTcwMDA0NTQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2067953","name":"Ed Westwick","idIMDB":"nm2067953"},"actorId":"nm2067953","character":"Tybalt","urlCharacter":"http://www.imdb.com/character/ch0000499","main":true},{"actorName":"Hailee Steinfeld","urlProfile":"http://www.imdb.com/name/nm2794962","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAwODIzOV5BMl5BanBnXkFtZTgwNjkwNDk3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1996","placeOfBirth":" Tarzana, Los Angeles, California, USA","birthName":"Hailee Caribe Steinfeld","height":"5' 7\" (1.7 m)","bio":"Hailee Steinfeld was born on December 11, 1996 in Tarzana, California, to Cheri (Domasin), an interior designer, and Peter Steinfeld, a personal fitness trainer. She has a brother, Griffin. Her uncle is Jake Steinfeld, a fitness trainer, and her great-uncle is actor Larry Domasin. Her father is of Ashkenazi Jewish descent and her mother's ancestry is Filipino, African-American, British Isles, and German. Hailee was raised in Thousand Oaks, California. At an early age, she appeared in several short films to gain experience. She played the role of Talia Alden in She's a Fox (2009), which received several awards. Her debut in a feature film for theater was True Grit (2010). She played a major role, Mattie Ross, with Jeff Bridges, Josh Brolin, and Matt Damon. She got big attention for her performance in this movie, and she was nominated for the 'Best Supporting Actress' Academy Award. After a short break, she appeared in several films which were released in 2013. She played the role of Juliet in Shakespeare's Romeo & Juliet (2013), which also starred Douglas Booth, and was released in 2013. Also, she appeared in Ender's Game (2013) as Petra Arkanian, based on the book written by Orson Scott Card, and this movie was directed by Gavin Hood. She starred with Asa Butterfield and Harrison Ford, and this movie received positive reviews. She appeared in the short film The Magic Bracelet (2013), with Bailee Madison, as Angela. In 2014, She appeared in 3 Days to Kill (2014), which was released on February 21, 2014. she played the major role of Zoey Renner, daughter of Kevin Costner. In Hateship Loveship (2013), she played Sabitha with Kristen Wiig. This movie was released on April 11, 2014 in USA. Steinfeld performed the role of Emily Junk in Pitch Perfect 2 (2015). She also starred in Barely Lethal (2015) with Jessica Alba. She filmed the movie, 10,000 Saints (2015), as the role of Eliza, again opposite Asa Butterfield. In 2016, she starred in the teen dramedy The Edge of Seventeen (2016), for which she received a Golden Globe nomination for Best Actress in a Motion Picture - Comedy or Musical. She has been home-schooled since 2008. Hailee says she is very interested to be on the other side of camera and would like to eventually produce and direct.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAwODIzOV5BMl5BanBnXkFtZTgwNjkwNDk3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2794962","name":"Hailee Steinfeld","idIMDB":"nm2794962"},"actorId":"nm2794962","character":"Juliet","urlCharacter":"http://www.imdb.com/character/ch0000496","main":true},{"actorName":"Lesley Manville","urlProfile":"http://www.imdb.com/name/nm0544334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NTU0OTc1OF5BMl5BanBnXkFtZTcwNzU5MTA3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1956","placeOfBirth":" Brighton, East Sussex, England, UK","birthName":"Lesley Ann Manville","height":"5' 2\" (1.57 m)","bio":"Lesley Manville was born on March 12, 1956 in Brighton, East Sussex, England. She is a multi award winning stage and screen actress and has worked extensively with the director Mike Leigh. She is known for Another Year (2010), All or Nothing (2002), Topsy-Turvy (1999), Secrets & Lies (1996). Lesley was made an OBE in the 2015 Queens Birthday Honours List.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NTU0OTc1OF5BMl5BanBnXkFtZTcwNzU5MTA3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544334","name":"Lesley Manville","idIMDB":"nm0544334"},"actorId":"nm0544334","character":"Nurse","urlCharacter":"http://www.imdb.com/character/ch0153510","main":true},{"actorName":"Anton Alexander","urlProfile":"http://www.imdb.com/name/nm0018258","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ1Njc3NjUwMl5BMl5BanBnXkFtZTgwNTI3MTkzMDI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Anton Alexander is an actor, known for Exodus: Gods and Kings (2014), Cemetery Man (1994) and The Best Offer (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ1Njc3NjUwMl5BMl5BanBnXkFtZTgwNTI3MTkzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018258","name":"Anton Alexander","idIMDB":"nm0018258"},"actorId":"nm0018258","character":"Abraham","urlCharacter":"http://www.imdb.com/character/ch0000734","main":true},{"actorName":"Douglas Booth","urlProfile":"http://www.imdb.com/name/nm3150488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczM2NmMDAtOTY4Yy00ZjZlLWFmOTQtYTM2MDgyMjlhODU0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1992","placeOfBirth":" Greenwich, London, England, UK","birthName":"Douglas John Booth","height":"6' 1\" (1.85 m)","bio":"Douglas John Booth is an English actor. Booth was born in London, England, the son of Vivien (De Cala), an artist, and Simon Booth, who works in shipping for Citigroup. He has appeared on English television as (Christopher and His Kind (2011), Great Expectations (2011)), starred in the film Romeo & Juliet (2013), and played Shem, one of the sons of Noah, in Noah (2014). More recently, he played Harry Villiers in The Riot Club (2014) and Titus Abrasax in Jupiter Ascending (2015). Booth was educated at at Solefield School, a boys independent school in Sevenoaks, Kent, followed by Bennett Memorial Diocesan School, and Lingfield Notre Dame School, an independent school in Lingfield, Surrey. His mother is of half Spanish and half Dutch ancestry, and his father is of English descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczM2NmMDAtOTY4Yy00ZjZlLWFmOTQtYTM2MDgyMjlhODU0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3150488","name":"Douglas Booth","nicknames":["Doug"],"idIMDB":"nm3150488"},"actorId":"nm3150488","character":"Romeo","urlCharacter":"http://www.imdb.com/character/ch0000491","main":true}],"seasons":[],"idIMDB":"tt1645131","urlIMDB":"http://www.imdb.com/title/tt1645131","business":{"budget":null,"openingWeekend":[{"money":"$520,116","country":"USA","day":"13","month":"10","year":"2013","remarks":"461 Screens"}],"gross":[{"money":"$1,161,089","country":"USA","day":"01","month":"12","year":"2013","remarks":""},{"money":"$1,107,907","country":"USA","day":"03","month":"11","year":"2013","remarks":""},{"money":"$1,070,708","country":"USA","day":"27","month":"10","year":"2013","remarks":""},{"money":"$520,116","country":"USA","day":"13","month":"10","year":"2013","remarks":""},{"money":"€17,197","country":"Portugal","day":"06","month":"11","year":"2013","remarks":""},{"money":"€13,474","country":"Portugal","day":"30","month":"10","year":"2013","remarks":""}],"weekendGross":[{"money":"$428","country":"USA","day":"01","month":"12","year":"2013","remarks":"12 Screens"},{"money":"$9,991","country":"USA","day":"03","month":"11","year":"2013","remarks":"22 Screens"},{"money":"$35,813","country":"USA","day":"27","month":"10","year":"2013","remarks":"91 Screens"},{"money":"$520,116","country":"USA","day":"13","month":"10","year":"2013","remarks":"461 Screens"}],"admissions":[{"money":"3,335","country":"Portugal","day":"06","month":"11","year":"2013","remarks":""},{"money":"2,608","country":"Portugal","day":"30","month":"10","year":"2013","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 53 min (113 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Studio, Zeiss Master Prime Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"5.8","metascore":"41","filmingLocations":[{"location":"Verona, Veneto, Italy"}],"rated":"PG-13","awards":[{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Romance Poster","names":[{"name":"Relativity Media","id":null,"role":null},{"name":"Blood & Chocolate Productions Ltd.","id":null,"role":null}]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2013","titlesAwards":[{"titleAwardOutcome":"Won IFMCA Award","categories":[{"category":"Film Score of the Year","names":[{"name":"Abel Korzeniowski","id":"nm0466851","role":null}]},{"category":"Best Original Score for a Drama Film","names":[{"name":"Abel Korzeniowski","id":"nm0466851","role":null}]}]},{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Film Music Composition of the Year","names":[{"name":"Abel Korzeniowski","id":"nm0466851","role":null}]}]}]}],"votes":"8,750","type":"Movie","companyCreditsSimple":[{"idCompany":"co0318553","name":"Amber Entertainment"},{"idCompany":"co0076285","name":"Echo Lake Entertainment"},{"idCompany":"co0172718","name":"Indiana Production Company"}],"keywords":{"keywords":["teenage girl","star crossed lovers","forbidden love","costume drama","shakespeare's romeo and juliet","based on play","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:17:45"}}