{"data":{"movies":[{"title":"Walk a Mile in My Pradas","originalTitle":"","year":"2011","releaseDate":"20111115","directors":[{"name":"Joey Sylvester","id":"nm1395754"}],"writers":[{"name":"Rick Karatas","id":"nm1489264"},{"name":"Tom Archdeacon","id":"nm1794323"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Nzc4MjQyNl5BMl5BanBnXkFtZTcwNDM2OTEwNw@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Comedy"],"plot":"A magic Christmas ornament turns two men's lives upside down when homophobic Tony starts preferring men two weeks before his wedding and his gay co-worker Steve finds himself blossoming into a ladies' man.","simplePlot":"A magic Christmas ornament turns two men's lives upside down when homophobic Tony starts preferring men two weeks before his wedding and his gay co-worker Steve finds himself blossoming into a ladies' man.","actors":[{"actorName":"Nathaniel Marston","urlProfile":"http://www.imdb.com/name/nm0551368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTY0MDY3OF5BMl5BanBnXkFtZTcwMDY2OTYxNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1975","placeOfBirth":" Sharon, Connecticut, USA","height":"6' 3\" (1.91 m)","bio":"Nathaniel Marston was born on July 9, 1975 in Sharon, Connecticut, USA. He was an actor and producer, known for The Craft (1996), One Life to Live (1968) and Walk a Mile in My Pradas (2011). He was married to Rita Bias. He died on November 11, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTY0MDY3OF5BMl5BanBnXkFtZTcwMDY2OTYxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0551368","name":"Nathaniel Marston","idIMDB":"nm0551368"},"actorId":"nm0551368","character":"Tony","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Archdeacon","urlProfile":"http://www.imdb.com/name/nm1794323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDk1NjU2N15BMl5BanBnXkFtZTgwMDk1MzA1MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1976","placeOfBirth":" Ireland","bio":"Tom Archdeacon was born on April 6, 1976 in Ireland. He is an actor and producer, known for The Path, Logan Lucky (2017) and The Westies (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDk1NjU2N15BMl5BanBnXkFtZTgwMDk1MzA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1794323","name":"Tom Archdeacon","idIMDB":"nm1794323"},"actorId":"nm1794323","character":"Steve","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Arnold","urlProfile":"http://www.imdb.com/name/nm0000792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTYzNzMyNl5BMl5BanBnXkFtZTgwNjc2NzgzMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1959","placeOfBirth":" Ottumwa, Iowa, USA","birthName":"Thomas Duane Arnold","height":"6' 2\" (1.88 m)","bio":"Tom Arnold was born in Ottumwa, Iowa, to Linda (Graham) and Jack Arnold. After his parents divorced, he was raised by his father. In 1983, he got his first taste of stand-up comedy when he performed at open microphone nights at the University of Iowa. Tom's comedy career had its ups and downs over the next several years until 1988, when he entered the Minneapolis Comedy Competition and won first place. With this victory in hand, he decided to move to Los Angeles to pursue a stand-up comedy career. Once he hit Los Angeles, things happened fast. That same year, he was hired as a staff writer for Roseanne Barr's TV sitcom Roseanne (1988) and began to appear regularly on the show as \"Arnie Thomas\". He and Roseanne Barr were married in 1990, with Arnold converting to Judaism prior to the marriage. They formed Rapello County Productions to develop projects for themselves. The couple's marriage, together with their sometimes outrageous behavior, attracted media attention - and especially that of the tabloids - like a magnet. In 1994 conditions between the two deteriorated and they went through a very public, and acrimonious, divorce. Tom has been married twice since then and is the co-host of Fox Sports Net's talk show The Best Damn Sports Show Period (2001). He also does voiceover work, and provides the voice for the \"Oven Mitt\" character in the TV commercials for the Arby's restaurant chain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTYzNzMyNl5BMl5BanBnXkFtZTgwNjc2NzgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000792","name":"Tom Arnold","idIMDB":"nm0000792"},"actorId":"nm0000792","character":"Joe","urlCharacter":"http://www.imdb.com/character/ch0343531","main":true},{"actorName":"Mike Starr","urlProfile":"http://www.imdb.com/name/nm0823563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAzNDgyMzIyNV5BMl5BanBnXkFtZTgwMjE2NTY1MDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1950","placeOfBirth":" Queens, New York City, New York, USA","height":"6' 3½\" (1.92 m)","bio":"Mike Starr was born on July 29, 1950 in Queens, New York City, New York, USA. He is an actor, known for Goodfellas (1990), Dumb & Dumber (1994) and Radio Days (1987). He has been married to Joanne since 1975. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAzNDgyMzIyNV5BMl5BanBnXkFtZTgwMjE2NTY1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823563","name":"Mike Starr","idIMDB":"nm0823563"},"actorId":"nm0823563","character":"John","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dee Wallace","urlProfile":"http://www.imdb.com/name/nm0908914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3YmE4ZDAtYzFiOS00M2E3LThjMTItYzE1OWZhY2FiMTg2XkEyXkFqcGdeQXVyMjkxNzgyMDU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1948","placeOfBirth":" Kansas City, Kansas, USA","birthName":"Deanna Lee Bowers","height":"5' 4\" (1.63 m)","bio":"This attractive, happy go lucky blonde actress, educated at the University of Kansas and a former ballet soloist, first broke into both TV and cinema screens in the mid 1970s and through her appearances in several well remembered horror and sci-fi films, and Dee quickly gained a cult following among the fantasy film fans. Poor Dee always seemed to be on the wrong side of some malevolent person or evil creature....she was pursued by a clan of cannibal killers in The Hills Have Eyes (1977), terrorized by a pack of werewolves in the superb The Howling (1981), got a break from the horror, as a sympathetic mom in the mega sci-fi hit E.T. the Extra-Terrestrial (1982), and nearly ends up lunch for a rabid St. Bernard in the heart stopping Cujo (1983). In the early 1980s, Wallace-Stone actually shared the screen several times with her then husband Christopher Stone before his unfortunate, early demise from a heart attack in October, 1995. However, typecasting Dee Wallace-Stone as a horror heroine does not do her justice, as unlike some other scream queens whose careers quickly faded, Dee has gone on to have a very busy and varied acting career, appearing in over 90 feature films to date! Her All-American looks and easy going demeanor has seen Dee often cast as a typical suburban mother, a sympathetic friend, or a trusted ally. Fans warm to her endearing smile and natural warmth, and Dee continues to find herself in constant demand in front of the camera, plus she has her own much visited website.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3YmE4ZDAtYzFiOS00M2E3LThjMTItYzE1OWZhY2FiMTg2XkEyXkFqcGdeQXVyMjkxNzgyMDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908914","name":"Dee Wallace","idIMDB":"nm0908914"},"actorId":"nm0908914","character":"Mary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kirsten Lea","urlProfile":"http://www.imdb.com/name/nm2875873","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDQ3OTk1OV5BMl5BanBnXkFtZTgwMzEwMTI4OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1980","placeOfBirth":" London, England, UK","birthName":"Kirsten Kristina Katherine Keira Lea","height":"5' 5½\" (1.66 m)","bio":"Kirsten Lea was born in London, England and is the daughter of Charlie Lea, who produced and managed actor Anthony Newley, husband of actress Joan Collins. Kirsten was brought up immersed in the acting profession and first appeared on stage at the tender age of four, when her father invited her to tread the boards of the world famous stage at the London Palladium, where he worked as a producer. Kirsten began taking classes in performing arts from the age of four, and was consequently cast in the lead roles in plays as soon as she began attending preparatory school. Throughout her teens, she continued to win the lead roles in plays such as Romeo & Juliet, Great Expectations, A Midsummer's Night Dream and Wuthering Heights. She twice won awards for Best Actress at her local theatre school and later went on to teach children Dance and Drama at the Theatre Train School in London. After her father's death when she was just sixteen, she chose not to attend a formal drama school, despite winning a scholarship to one. Instead she continued to take private tuition under a range of dance, drama and music coaches while earning a degree in Art History and Journalism. After passing her examinations with distinctions, Kirsten worked for several magazines including Harpers & Queen and had regular features published in magazines such as Company, Women's Health, Total Style, Ms London, Girl About Town and The Magazine Guide. She also wrote a monthly fashion column for British newspaper, The Union Jack, published across America, while also appearing as a model and cover girl for numerous other publications. Kirsten began writing screenplays in her early twenties and finally turned her hand to production, when she produced a million pound Variety Theatre Show in honor of her late father, in place of her own wedding reception. The show featured family show business friends such as comedian Jimmy Tarbuck, Mind Reader Graham P. Jolley and Grammy-Nominated Jazz Pianist Jamie Cullum. Kirsten also hosted the show. Continuing her intensive study of acting with private drama teachers in England throughout her early twenties, it was while attending a master class at the London Academy of Film that Kirsten came to the attention of renowned director and acting coach Milfid Ellis, who has described Kirsten as \"having a real gift\". Milfid has since supported Kirsten in both the classroom and on location. In early 2008, Kirsten made a highly publicized appearance at both the Spirit Awards for Independent Film and the 80th Annual Academy Awards ® where she was one of 'the most photographed stars on the red carpet'. She then went on to make her feature film debut in the highly anticipated production of _The Soloist (2008)_directed by 'Joe Wright'( Atonement (2007), Pride & Prejudice (2005)), where she starred alongside Robert Downey Jr.. Combining her passion for acting and producing, Kirsten launched her own production company, LoveLea Films, with branches in London and Los Angeles where she divides her time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDQ3OTk1OV5BMl5BanBnXkFtZTgwMzEwMTI4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2875873","name":"Kirsten Lea","nicknames":["Kiki"],"idIMDB":"nm2875873"},"actorId":"nm2875873","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Karatas","urlProfile":"http://www.imdb.com/name/nm1489264","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDI3OTA2MGMtY2I5My00NzQxLTljNWUtNjJlNTE2ZGE5NjE5XkEyXkFqcGdeQXVyNjA4NTY0MDQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Rick Karatas is an actor and writer, known for Walk a Mile in My Pradas (2011), Road Test (2006) and Charlie's Dream (2018).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDI3OTA2MGMtY2I5My00NzQxLTljNWUtNjJlNTE2ZGE5NjE5XkEyXkFqcGdeQXVyNjA4NTY0MDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1489264","name":"Rick Karatas","idIMDB":"nm1489264"},"actorId":"nm1489264","character":"Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emrhys Cooper","urlProfile":"http://www.imdb.com/name/nm1869082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2I0M2NkMDEtOGRmOC00Y2QzLWJiNGItNzJiNmEwOWYxZTNlXkEyXkFqcGdeQXVyMTQ0MDExOTQ@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1985","placeOfBirth":" Totnes, Devon, England, UK","bio":"Emrhys Cooper (Born February 14, 1985) is an English actor, singer and dancer, best known for his role as the male lead in the original Emmy nominated Stylehaul teen drama series Vanity (2015) in which he starred alongside Denise Richards and Karrucehe Tran. He has appeared in films such as Mamma Mia (2008), Stephen Fry's period drama Bright Young Things (2003), the romantic comedy Walk a mile in my Pradas (2011), the award winning Indie drama Till We Meet Again (2016) and the sci-fi drama Altered Perception (2016). He can be seen in the upcoming drama series Relationship Status alongside Milo Ventimiglia, Emma Bell and Shawn Ashmore. In 2015 Cooper landed the lead role in the remake of the classic silent horror film Nosferatu playing the of Thomas Hutter. This marks Cooper's biggest film role to date. The film also stars Doug Jones playing the iconic role of Count Orlok. Other cast includes Joely Fisher and Sarah Carter. Cooper studied musical Theatre at Laine Theater Arts College in London, which he graduated at 19 years old. Upon graduation, Emrhys landed his first professional theatre role on the National Tour of 'Fame: The Musical'. He made his West End debut at 21 in the Queen Musical 'We Will Rock You'. Other notable stage work includes playing Orlando in Shakespeare's 'As You Like It' with the Red Earth Theater Company. Cooper starred as Sloane in the critically acclaimed production of 'Entertaining Mr Sloane', his performance lead to rave reviews and 'The Stage Scene LA' award for 'Best performance by a Lead Actor', as well as Broadway World's Award for 'Person to Watch and Best Play. Emrhys now divides his time between London, Toronto and Los Angeles where he has appeared in US Television shows such as Desperate Housewives, CSI:NY, Touch, Blackish and Person of Interest. In 2013 Cooper was cast as the lead role in the Bhutanese feature film Kushuthara. Kushuthara was filmed in Kingdom of Bhutan. Cooper is the first ever Western actor to star in a Bhutanese film. Kushuthara went on to win many international film festivals and Cooper was awarded outstanding performance from a leading actor in the IndieFest film festival. The film is set to be released international summer of 2016. In 2013 Cooper co wrote and released his debut single \"Hypnotized\" through Inspire U records. The song played on many of the UK's major stations. The song can be heard in the feature film Kushuthara: Pattern of Love. In 2016 he released the single Reboot My Heart also through Inspire U records, which he co wrote with his songwriting partner Elaine Macaulso. Cooper also directed the music video shot in Bangkok and Koh Tao - Thailand. Cooper has also worked extensively in voice overs including radio plays, commercials and many audio books such as Orhanpamuk (Silent House) & Neversink for which he was awarded the Earphones Award - Audio File Magazine - best Narration for the children's book.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2I0M2NkMDEtOGRmOC00Y2QzLWJiNGItNzJiNmEwOWYxZTNlXkEyXkFqcGdeQXVyMTQ0MDExOTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1869082","name":"Emrhys Cooper","idIMDB":"nm1869082"},"actorId":"nm1869082","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lindsay Hollister","urlProfile":"http://www.imdb.com/name/nm0391234","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDdmNjIwZGMtMGI2ZS00YmI1LWI1YjMtMThjMDU3MDBmOTk5XkEyXkFqcGdeQXVyMTE1NzQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1977","placeOfBirth":" Columbus, Ohio, USA","birthName":"Lindsay Anne Hollister","height":"5' 9\" (1.75 m)","bio":"After Graduating with a B.F.A in Theatre Performance from Miami University of Ohio, Lindsay moved to Los Angeles to pursue a career in film and television. Almost a year later, she was cast as Christine Banks in Fox's hit show Boston Public and was submitted for Emmy consideration in the category of Outstanding Guest Star. This led to numerous other guest appearances on such shows as ER, Strong Medicine, Any Day Now, Popular, and Susan Adamson on NBC's popular daytime series Days of Our Lives. Lindsay has also completed work in eighteen films; most notable would be her role opposite Steve Carell and Anne Hathaway in Get Smart, as Max's Dance Partner, a now iconic dance scene. Lindsay can be found in Pee Wee's Big Holiday produced by comedy legend Judd Apatow and available on Netflix. In addition, Lindsay has written several feature films, TV shows and created/wrote/starred in two seasons of her own web series Breaking Fat. She also adapted the comedic version of the popular film, BloodRayne, called Blubberella and played the title character (produced and directed by the controversial German filmmaker, Uwe Boll). Lindsay has a production company with good friend, Katherine VanderLinden - Lead's Best Friend Productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDdmNjIwZGMtMGI2ZS00YmI1LWI1YjMtMThjMDU3MDBmOTk5XkEyXkFqcGdeQXVyMTE1NzQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0391234","name":"Lindsay Hollister","idIMDB":"nm0391234"},"actorId":"nm0391234","character":"Laura","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darren Keefe Reiher","urlProfile":"http://www.imdb.com/name/nm1197438","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NjUxMTQxNl5BMl5BanBnXkFtZTgwMjMzODQ2MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1975","placeOfBirth":" Portadown, Northern Ireland, UK","birthName":"Darren Keefe Reiher","height":"5' 10\" (1.78 m)","bio":"Darren Keefe Reiher was born on July 4, 1975 in Portadown, Northern Ireland. He is an actor and producer, known for My Big Fat Independent Movie (2005), Truth About Kerry (2010) and Last Stand (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NjUxMTQxNl5BMl5BanBnXkFtZTgwMjMzODQ2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1197438","name":"Darren Keefe Reiher","idIMDB":"nm1197438"},"actorId":"nm1197438","character":"Danny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sammy Sheik","urlProfile":"http://www.imdb.com/name/nm1879133","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU3MDM3ODA1OV5BMl5BanBnXkFtZTgwNjU3NDk5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1981","placeOfBirth":" Alexandria, Egypt","bio":"Sammy Sheik was born in Alexandria, Egypt. His passion for acting drove him to leave home shortly after high school and move to New York to study theatre. He soon landed his first film role in the Albert Brooks' satire comedy \"Looking for Comedy in the Muslim World\", playing Al-Jazeera executive \"Mukhtar Al-Mujib.\" Sheik followed this with memorable roles in both film and television including recurring roles on Homeland, 24, United States of Tara and roles on Nikita, The Unit, NCIS and Lost, among others. Sheik's film credits include Attack On Darfur, Transformers: Dark of the Moon and Charlie Wilson's War among others. In 2012, ten years after leaving Egypt, Sheik finally returned to work on a series called \"Hekayat Banat\", which heralds the beginning of his rising international career. In addition to his acting career, in 2010 Sheik was appointed goodwill ambassador to the Middle East for Y-Peer, a youth education network, pioneered by the United Nations Population Fund. Sheik travels the world on behalf of the organization which is active in more than 36 countries.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU3MDM3ODA1OV5BMl5BanBnXkFtZTgwNjU3NDk5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1879133","name":"Sammy Sheik","idIMDB":"nm1879133"},"actorId":"nm1879133","character":"Carlos","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jackie Debatin","urlProfile":"http://www.imdb.com/name/nm0213339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjU4ODA0N15BMl5BanBnXkFtZTgwNDcwMTAyODE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1970","placeOfBirth":" Alhambra, Illinois, USA","birthName":"Jackie L. Debatin","bio":"Born and raised on a dairy farm in Southern Illinois. She attended Southern Illinois University at Carbondale, where she studied Theater and Business. She moved to Los Angeles in 1992. She later moved to New York City to do an off-Broadway show in 2013, and now calls NYC her primary home. In addition to her acting, she owns and runs her own accounting firm with offices in Los Angeles and New York City. Her accounting firm opened in 1999, and handles entertainment and corporate financing and tax consulting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjU4ODA0N15BMl5BanBnXkFtZTgwNDcwMTAyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0213339","name":"Jackie Debatin","idIMDB":"nm0213339"},"actorId":"nm0213339","character":"Trish","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tina Lynch","urlProfile":"http://www.imdb.com/name/nm2765322","urlPhoto":"","biography":{"bio":"Tina Lynch is an actress, known for Walk a Mile in My Pradas (2011), Chance (2007) and Behind the Scenes of 'Pradas' (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2765322","name":"Tina Lynch","idIMDB":"nm2765322"},"actorId":"nm2765322","character":"Kathy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chandler Lutz","urlProfile":"http://www.imdb.com/name/nm3888721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzIyNTk3Ml5BMl5BanBnXkFtZTcwOTQ3MjM3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Chandler Lutz is an actress, known for Walk a Mile in My Pradas (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzIyNTk3Ml5BMl5BanBnXkFtZTcwOTQ3MjM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3888721","name":"Chandler Lutz","idIMDB":"nm3888721"},"actorId":"nm3888721","character":"Stefanie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vincent De Paul","urlProfile":"http://www.imdb.com/name/nm0210885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjQzMzQzNF5BMl5BanBnXkFtZTcwODY5MjIxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1968","placeOfBirth":" Baltimore, Maryland, USA","height":"6' 1\" (1.85 m)","bio":"Vincent De Paul was born in Baltimore, Maryland. His father was a mortuary scientist and owned funeral homes in Maryland. His mother, a Maryland socialite, dedicated her time to Chairing committees for the March of Dimes, Children with Birth Defects and Relief to Earthquake victims in Naples. De Paul's acting career began with his first role as Beowolf, in one of the oldest Scandinavian epics. De Paul is a Miami, New York, Los Angeles bi-coastal film and television actor. He's been in the entertainment industry for more than 15 years. After graduating from Johns Hopkins University in Baltimore Maryland (Studying Epidemiology, Biomedical ethics and Bio statistics), Vincent De Paul moved to Miami Beach to work at Mt. Sinai Medical Center. While working at the Miami Beach Hospital he was discovered and began doing fashion shows for the late Gianni Versace . www.vincentdepaul1.com Represented by Wilhelmina Creative, Vincent has worked internationally and has appeared, and been interviewed in, numerous magazines including, GQ, Vogue (Spain), Cosmopolitan (Greece, Spain, Poland, Russia) 8 covers of  Men's Health (Peru, Ecuador, USA  edicion en  Espanol, Mexico, & Columbia), Men's Exercise, Vanidades, Complot and Metrosource magazine. Vincent has been featured in the following Campaigns worldwide, L'Oreal (France) w/Stephanie Seymour directed by  Patrick  Dermachelier, El Corte Inglese (Spain with Ricky Martin, Christian  Dior (Latin America) Oscar  De la Renta (Mexico) and FUJI (Mexico) Avon Campaign USA, Guy La Roche Campaign (USA & Canada). His film career spans more than a decade. The first feature film was Hairspray in which he played one of the original Corny Collins Dancers (Dir. John  Waters), Riding in Cars with Boys with Drew  Barrymore as a Line Backer directed by Penny Marshall. His TV career includes  appearances on West Wing, Frasier, Charmed, Sex in the City, HBO's Six Feet Under as a  Hollywood  junkie snorting the ashes of his best friend, and most recently appeared on NBC's Medical Investigation.  He has re-occurred for the last 4 years on As The World Turns as  Charlie the Bartender at the Metro. He has served on the Audrey Hepburn Red Rose Award committee with Sean Hepburn Ferrar.  He volunteers his time at the House of Camillus for battered  women.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjQzMzQzNF5BMl5BanBnXkFtZTcwODY5MjIxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0210885","name":"Vincent De Paul","idIMDB":"nm0210885"},"actorId":"nm0210885","character":"Keith","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1645187","urlIMDB":"http://www.imdb.com/title/tt1645187","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"19","month":"07","year":"2011","remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Red One Camera"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.6","filmingLocations":[{"location":"Hollywood, Los Angeles, California, USA"}],"rated":"NOT RATED","awards":[{"award":"Accolade Competition 2011","titlesAwards":[{"titleAwardOutcome":"Won Award of Excellence","categories":[{"category":"Original Score","names":[{"name":"Andrew Markus","id":"nm3184403","role":null}]},{"category":"Feature Film","names":[{"name":"Tom Archdeacon","id":"nm1794323","role":"producer"},{"name":"Rick Karatas","id":"nm1489264","role":"producer"},{"name":"Joey Sylvester","id":"nm1395754","role":"producer"}]}]},{"titleAwardOutcome":"Won Award of Merit","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Tom Archdeacon","id":"nm1794323","role":null}]}]}]},{"award":"Hoboken International Film Festival 2011","titlesAwards":[{"titleAwardOutcome":"Won Festival Award","categories":[{"category":"Best Trailer","names":[{"name":"Rick Karatas","id":"nm1489264","role":"producer"},{"name":"Tom Archdeacon","id":"nm1794323","role":"producer"},{"name":"Joey Sylvester","id":"nm1395754","role":"director"},{"name":"Brian Arnott","id":"nm3899671","role":"executive producer"},{"name":"Mark Behar","id":"nm3975368","role":"associate producer"},{"name":"Emrhys Cooper","id":"nm1869082","role":"executive producer"},{"name":"Vincent De Paul","id":"nm0210885","role":"co-producer"},{"name":"Kirsten Lea","id":"nm2875873","role":"executive producer"},{"name":"Richard M. Lutz","id":"nm3975198","role":"executive producer"},{"name":"Melanie Wagor","id":"nm1858075","role":"line producer"},{"name":"Val Tasso","id":"nm1368204","role":"associate producer"},{"name":"Walk A Mile Productions","id":null,"role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Tom Archdeacon","id":"nm1794323","role":null}]}]},{"titleAwardOutcome":"Nominated Festival Award","categories":[{"category":"Best Screenplay","names":[{"name":"Rick Karatas","id":"nm1489264","role":"writer"},{"name":"Tom Archdeacon","id":"nm1794323","role":"writer"}]}]}]},{"award":"Hoboken International Film Festival 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Festival Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Kirsten Lea","id":"nm2875873","role":null}]}]}]}],"votes":"295","type":"Movie","companyCreditsSimple":[{"idCompany":"co0302773","name":"Walk A Mile Productions"},{"idCompany":"co0390329","name":"Dream It Productions"},{"idCompany":"co0395655","name":"FROST Pictures"}],"keywords":{"keywords":["gay","wedding","christmas","wish","marriage engagement","reference to mario lopez","reference to judy garland","reference to liza minnelli","english teacher","reference to youtube","king of the house","reference to froot loops","uses the word faggot","uses the word fag","uses the word queer","uncomfortable touching","reference to baptism","homosexual","reference to ex gay therapy","psychiatrist","urologist","reference to martha stewart","cooking","boyfriend boyfriend relationship","gay kiss","straight fantasy","turn about","gay fantasy","talking about sex","reference to anne heche","reference to carrot top","talking in text","queer cinema","talisman","station wagon","year 2011","year 1986","flashback","penance","writing on a blackboard","church","praying","mugging","caroler","street gang","reference to oprah winfrey","boxing gloves","waiter","public bathroom","gay bar","holy water","landscape art","evangelist","faith healing","psychic","electroshock therapy","viagra","doctor","home cooking","beer","waitress","restaurant","bedroom","erotic dream","bodybuilder","commercial pitchman","erection","sexual fantasy","gay sex","disguised as a nun","carpenter","pizza delivery","tv commercial","car repair","flower","quiche","degradation","mistletoe","christmas party","gay slur","homophobia","fidelity","video store","figurine","contractor","nun","elementary school","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:52:25"}}