{"data":{"movies":[{"title":"The Drop","originalTitle":"","year":"2014","releaseDate":"20140912","directors":[{"name":"Michaël R. Roskam","id":"nm1742427"}],"writers":[{"name":"Dennis Lehane","id":"nm1212331"},{"name":"Dennis Lehane","id":"nm1212331"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjMzODUzNV5BMl5BanBnXkFtZTgwNjIxNDI1MTE@._V1.jpg","countries":["USA"],"languages":["English","Russian"],"genres":["Crime","Drama","Mystery"],"plot":"Follows lonely bartender Bob Saginowski through a covert scheme of funneling cash to local gangsters - \"money drops\" - in the underworld of Brooklyn bars. Under the heavy hand of his employer and cousin Marv, Bob finds himself at the center of a robbery gone awry and entwined in an investigation that digs deep into the neighborhood's past where friends, families, and foes all work together to make a living - no matter the cost.","simplePlot":"Bob Saginowski finds himself at the center of a robbery gone awry and entwined in an investigation that digs deep into the neighborhood's past where friends, families, and foes all work together to make a living - no matter the cost.","actors":[{"actorName":"Tom Hardy","urlProfile":"http://www.imdb.com/name/nm0362766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1977","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Edward Thomas Hardy","height":"5' 9\" (1.75 m)","bio":"With his breakthrough performance as Eames in Christopher Nolan's science fiction thriller Inception (2010), English actor Tom Hardy has been brought to the attention of mainstream audiences worldwide. However, the versatile actor has been steadily working on both stage and screen since his television debut in the miniseries Band of Brothers (2001). After being cast in the World War II drama, Hardy left his studies at the prestigious Drama Centre in London and was subsequently cast as Twombly in Ridley Scott's Black Hawk Down (2001) and as the villain Shinzon in Star Trek: Nemesis (2002). Tom was born on September 15, 1977 in Hammersmith, London; his mother, Elizabeth Anne (Barrett), is an artist and painter, and his father, Edward Hardy, is a writer. He is of English and Irish descent. Hardy was brought up in East Sheen, London, and first studied at Reed's School. His education continued at Tower House School, then at Richmond Drama School, and subsequently at the Drama Centre London, along with fellow Oscar nominee Michael Fassbender. After winning a modeling competition at age 21, he had a brief contract with the agency Models One. Tom spent his teens and early twenties battling delinquency, alcoholism and drug addiction; after completing his work on Star Trek: Nemesis (2002), he sought treatment and has also admitted that his battles with addiction ended his 5-year marriage to Rachael Speed. Returning to work in 2003, Hardy was awarded the Evening Standard Most Promising Newcomer Award for his theatre performances in the productions of \"In Arabia, We'd All Be Kings\" and \"Blood\". In 2003, Tom also co-starred in the play \"The Modernists\" with Paul Popplewell, Jesse Spencer and Orlando Wells. During the next five years, Hardy worked consistently in film, television and theatre, playing roles as varied as Robert Dudley in the BBC's The Virgin Queen (2005), Bill Sikes in Oliver Twist (2007) and starring in \"The Man of Mode\" at the National Theatre. On the silver screen, he appeared in the crime thriller Layer Cake (2004) with Daniel Craig, Sofia Coppola's Marie Antoinette (2006), and the romp Scenes of a Sexual Nature (2006). In 2006, Hardy created \"Shotgun\", an underground theatre company along with director Robert Delamere, and directed a play, penned by his father for the company, called \"Blue on Blue\". In 2007, Hardy received a best actor BAFTA nomination for his touching performance as Stuart Shorter in the BBC adaptation of Alexander Masters' bestselling biography Stuart: A Life Backwards (2007). Hardy, hailed for his transformative character acting, was lauded for his emotionally and physically convincing portrayal in the ill-fated and warmhearted tale of Shorter, a homeless and occasionally violent man suffering from addiction and muscular dystrophy. The following year, he appeared as gay hoodlum Handsome Bob in the Guy Ritchie film RocknRolla (2008), but this would be his next transformation that would prove his extensive range and stun critics. In the film Bronson (2008), Hardy played the notorious Charles Bronson (given name, Michael Peterson), the \"most violent prisoner in Britain\". Bald, pumped-up, and outfitted with Bronson's signature strongman mustache, Hardy is unrecognizable and gives a harrowing performance that is physically fearless and psychologically unsettling. Director Nicolas Winding Refn breaks the fourth wall with Hardy retelling his tales directly to viewers as well as performing them outright before an audience of his own imagining. The performance mixes terrifying brutality, vaudevillian showmanship, wry humor, and an alarming amount of commitment, and won Hardy a British Independent Film Award for Best Actor. The performance got Hollywood's attention, and in 2009, Hardy was named one of Variety's \"10 Actors to Watch\". That year, he continued to garner praise for his starring role in The Take (2009), a four-part adaptation of Martina Cole's bestselling crime novel, as well as for his performance as Heathcliff in a version of Wuthering Heights (2009). Recent work includes the aforementioned breakthrough appearance in Inception (2010) alongside Leonardo DiCaprio, Joseph Gordon-Levitt, Cillian Murphy, Tom Berenger, Ken Watanabe, Michael Caine, Marion Cotillard and Ellen Page. The movie was released in July 2010 and became one of top 25 highest grossing films of all time, collecting eight Oscar nominations (including Best Picture) and winning four. Other films include Warrior (2011), opposite Joel Edgerton, the story of two estranged brothers facing the fight of a lifetime from director Gavin O'Connor, and This Means War (2012), directed by McG and co-starring Reese Witherspoon and Chris Pine. Tom also starred in the heralded Cold War thriller, La taupe (2011) with Colin Firth and Gary Oldman. Hardy rejoined Christopher Nolan for The Dark Knight Rises (2012); he played the villain role of Bane opposite Christian Bale, Anne Hathaway, Joseph Gordon-Levitt and Gary Oldman. Hardy's menacing physique and his character's scrambled, hard-to-distinguish voice became a major discussion point as the film was released. Outside of performing, Hardy is the patron for the charity \"Flack\", which is an organization to aid the recovery of the homeless in Cambridge. And in 2010, Hardy was named an Ambassador for The Prince's Trust, which helps disadvantaged youth. On the recent stage, he starred in the Brett C. Leonard play \"The Long Red Road\" in early 2010. Written for Hardy and directed by Philip Seymour Hoffman, the play was staged at Chicago's Goodman Theater. In 2015, Hardy starred as the iconic Mad Max in George Miller's reboot of his franchise, Mad Max: Fury Road (2015). He also collected a British Independent Film Award for his portrayal of both the Kray twins, Ronnie and Reggie, in Legend (2015), and an Oscar nomination for Best Supporting Actor for his role as John Fitzgerald in The Revenant (2015). He has an outlaw biker story among other projects in development. In 2010, Hardy became engaged to fellow English actress Charlotte Riley, whom he starred with in The Take (2009) and Wuthering Heights (2009), and is raising a young son, Louis, with ex-girlfriend Rachael Speed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODEyNjA4Nl5BMl5BanBnXkFtZTgwMTE4ODMyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362766","name":"Tom Hardy","idIMDB":"nm0362766"},"actorId":"nm0362766","character":"Bob","urlCharacter":"http://www.imdb.com/character/ch0459703","main":true},{"actorName":"Noomi Rapace","urlProfile":"http://www.imdb.com/name/nm0636426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzg3NDkyN15BMl5BanBnXkFtZTgwOTg2NjA2ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1979","placeOfBirth":" Hudiksvall, Gävleborgs län, Sweden","birthName":"Noomi Norén","height":"5' 4¼\" (1.63 m)","bio":"Swedish actress Noomi Rapace is the daughter of fellow Swedish actress Nina Norén and Spanish Flamenco singer Rogelio Durán. Her parents did not stay together, and when Rapace was five she moved to Iceland with her mother and stepfather, where she lived for three years. When she was eight, she was cast in a small role in the Icelandic film, 'Í skugga hrafnsins', and this sparked her love of acting. At the age of 15, she left home and joined the Stockholm Theatre School. Rapace went on to win the recurring role of Lucinda Gonzales in the Swedish TV series Tre kronor (1994), and also became a respected stage performer. She won critical acclaim for playing the leading role in 2007's Daisy Diamond (2007). In 2009, Rapace came to the attention of international audiences for her portrayal of Lisbeth Salander in The Girl with the Dragon Tattoo (2009). Her performance was widely praised, and she won the Best Actress prize at Sweden's prestigious Guldbagge Awards. She went on to reprise the role in the sequels, The Girl Who Played with Fire (2009) and The Girl Who Kicked the Hornet's Nest (2009). Rapace made her English language film debut in Guy Ritchie's Sherlock Holmes: A Game of Shadows (2011), alongside Robert Downey Jr. She was also cast as Elizabeth Shaw in Ridley Scott's Prometheus (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzg3NDkyN15BMl5BanBnXkFtZTgwOTg2NjA2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636426","name":"Noomi Rapace","idIMDB":"nm0636426"},"actorId":"nm0636426","character":"Nadia","urlCharacter":"http://www.imdb.com/character/ch0401430","main":true},{"actorName":"James Gandolfini","urlProfile":"http://www.imdb.com/name/nm0001254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDY4NDMzN15BMl5BanBnXkFtZTcwNDkzNDE5NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1961","placeOfBirth":" Westwood, New Jersey, USA","birthName":"James Joseph Gandolfini Jr.","height":"6' 0½\" (1.84 m)","bio":"James Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin. James' breakthrough role was his portrayal of Virgil the hitman in Tony Scott's True Romance (1993), but the role that brought him worldwide fame and accolades was as complex Mafia boss Tony Soprano in HBO's smash hit series The Sopranos (1999). He died unexpectedly of a heart attack in 2013 while vacationing in Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDY4NDMzN15BMl5BanBnXkFtZTcwNDkzNDE5NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001254","name":"James Gandolfini","nicknames":["Jim","Jimmy"],"idIMDB":"nm0001254"},"actorId":"nm0001254","character":"Cousin Marv","urlCharacter":"http://www.imdb.com/character/ch0410985","main":true},{"actorName":"Matthias Schoenaerts","urlProfile":"http://www.imdb.com/name/nm0774386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTQ0MDgwOF5BMl5BanBnXkFtZTcwOTUxNzA3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1977","placeOfBirth":" Antwerp, Belgium","height":"6' 1½\" (1.87 m)","bio":"Matthias Schoenaerts was born on December 8, 1977 in Antwerp, Belgium. His mother, Dominique Wiche, was a costume designer, translator and French teacher, his father is actor Julien Schoenaerts. He made his film debut at the age of 13, alongside his father in the Belgian film Daens (1992), which was nominated for an Academy Award for Best Foreign Language Film. Schoenaerts enrolled in film school but was expelled for poor attendance in his second year. By age 21, he was enrolled at the Academy of Dramatic Arts in Antwerp and was acting professionally in small roles on Belgian television and in Belgian film. By the time he graduated in 2003, Schoenaerts was already named one of \"Europe's Shooting Stars\" by the influential marketing organization, European Film Promotion. In 2002, he starred in Dorothée Van Den Berghe's directorial debut Girl (2002), which was also his first feature film since Daens. With his role in Tom Barman's Any Way the Wind Blows (2003), he proved he was Flanders' young actor to watch. In 2004, Schoenaerts produced and starred in the short film A Message from Outer Space (2004). He also appeared in Ellektra (2004) alongside his father. In 2006, he had a small role as a member of the Dutch Resistance in Paul Verhoeven's Black Book (2006), and landed his first starring role in the Belgian film Love Belongs to Everyone (2006), playing Dennis, a mentally-challenged man learning to adjust to life after a prison sentence for a rape he may not have committed. Though Schoenaerts garnered critical praise for his role in \"Love Belongs to Everyone\", the film that would make him a star in his homeland came in 2008, in Erik Van Looy's Loft (2008), Schoenaerts played Filip, one of a group of married friends who share the rent on a downtown loft as a place to meet their respective mistresses. The dramatic thriller was a smash hit, becoming the top-grossing Flemish film of all time. In the same year, he also starred in the horror film Left Bank (2008). In 2009, he worked once again with director Dorothée Van Den Berghe, playing the hippie Raven in My Queen Karo (2009). In 2010, he played the lead role in Alex Stockman's techno-thriller Pulsar (2010). In 2011, Schoenaerts starred in Michaël R. Roskam's Bullhead (2011), playing Jacky Vanmarsenille, a cattle farmer who becomes entangled with the underworld of bovine hormones and steroids. Impressed by the script, Schoenaerts committed to star in the film in 2005, and over the five years that it took first-time director Roskam to secure financing, the actor transformed his naturally thin body into that of a steroid abusing brute. His powerful performance in the tragic role won awards at numerous film festivals and propelled \"Bullhead\" to an Academy Award nomination for Best Foreign Language Film in 2012. In 2012, Schoenaerts got the lead role opposite Marion Cotillard in Jacques Audiard's Rust and Bone (2012), in the film he played Ali, an ex-boxer who falls in love with Cotillard's character. Like Audiard's previous films, \"Rust and Bone\" received a breathless reception at the Cannes Film Festival with a ten-minute standing ovation at the end of its screening and was a critical and box office hit in France. Schoenaerts' performance in the film earned him a César Award for Most Promising Actor in 2013. Schoenaerts also starred in the Belgian short film Death of a Shadow (2012), which was nominated for an Academy Award for Best Live Action Short Film in 2013 and won the European Film Award for Best European Short. In 2013, he starred in Blood Ties (2013), after being recommended for the film by his former co-star in \"Rust and Bone\", Marion Cotillard. Following his breakthrough in \"Rust and Bone\", Matthias started a career in Hollywood and landed roles in American and British productions like Saul Dibb's Suite Française (2014), Alan Rickman's A Little Chaos (2014), Michaël R. Roskam's The Drop (2014) and Thomas Vinterberg's Far from the Madding Crowd (2015). In 2015, Schoenaerts returned to French cinema in Alice Winocour's Disorder (2015), in which he plays an ex-soldier with PTSD. He also played one of the leads of Luca Guadagnino's A Bigger Splash (2015), opposite Tilda Swinton and Ralph Fiennes, and played the art-dealer Hans Axgil in Tom Hooper's The Danish Girl (2015). He will reteam with Michaël R. Roskam in Racer and the Jailbird (2017) and also with Thomas Vinterberg in Kursk (2018), in which Schoenaerts will play the Captain of a Russian submarine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTQ0MDgwOF5BMl5BanBnXkFtZTcwOTUxNzA3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0774386","name":"Matthias Schoenaerts","nicknames":["Zenith","Matti"],"idIMDB":"nm0774386"},"actorId":"nm0774386","character":"Eric Deeds","urlCharacter":"http://www.imdb.com/character/ch0410986","main":true},{"actorName":"John Ortiz","urlProfile":"http://www.imdb.com/name/nm0651159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzc5MzcyMV5BMl5BanBnXkFtZTgwMjYzOTg1NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1968","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"John Ortiz was born on May 23, 1968 in Brooklyn, New York City, New York, USA. He is an actor, known for Silver Linings Playbook (2012), Fast & Furious (2009) and American Gangster (2007). He is married to Jennifer Ortiz. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzc5MzcyMV5BMl5BanBnXkFtZTgwMjYzOTg1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651159","name":"John Ortiz","idIMDB":"nm0651159"},"actorId":"nm0651159","character":"Detective Torres","urlCharacter":"http://www.imdb.com/character/ch0401434","main":true},{"actorName":"Elizabeth Rodriguez","urlProfile":"http://www.imdb.com/name/nm0735300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODc2MDMyMF5BMl5BanBnXkFtZTcwNzgxMDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1980","placeOfBirth":" New York, USA","height":"5' 6\" (1.68 m)","bio":"Elizabeth Rodriguez is a Manhattan born and raised native New Yorker and a graduate of Lehman College in the Bronx. After graduation from Lehman, Rodriguez studied for two years under acclaimed acting teacher Maggie Flanigan at William Esper Studios in NYC. While still at the studio she began working professionally with appearances in the feature films \"Fresh\", \"Dead Presidents\" and \"I Think I Do\", as well as in TV shows such as \"Law & Order\", and recurring roles on both \"OZ\" and \"New York Undercover\". Rodriguez has since appeared in numerous shows, including a recent recurring role as Aleida Diaz on the upcoming Netflix Original Series \"Orange Is The New Black\". Other TV credits include roles as series regulars on both NBC's \"Prime Suspect\", opposite Maria Bello, and ABC's \"All My Children\", in addition to recurring roles on \"The Shield\" and \"ER. Other credits include \"Six Feet Under\", \"Flash Forward\", \"Cold Case\", \"Just Shoot Me\", \"NYPD Blue\" and \"Law & Order: SVU\". Her made-for-TV movies include \"Inflammable\" and \"The Eddie Matos Story\", written by Oscar nominated writer Jose Rivera. Some of her feature films include \"Return to Paradise\", \"Four Lane Highway\", \"Acts of Worship\", \"Blow\", \"All Things Fall Apart\", \"Pound Of Flesh\", \"Tonight at Noon\", \"A Line in the Sand\", \"Jack Goes Boating\", directed by Philip Seymour Hoffman, and Michael Mann's \"Miami Vice\", opposite Colin Farrell and Jamie Foxx. Upcoming films include \"Tio Papi\", \"Glass Chin\" and \"Animal Rescue\", with Tom Hardy and James Gandolfini. In addition to her work on screen, Rodriguez remains extremely active in the theater. She has starred in \"Beauty of the Father\" (Manhattan Theatre Club), \"The Last Days of Judas Iscariot\" (NY's Public Theater), \"Roger and Vanessa\" (Actors' Gang), \"Den of Thieves\" (Black Dahlia), \"Robbers\" (American Place Theater), \"A View From 151st Street\" (NY's Public Theater) and \"Unconditional\" (NY's Public Theater). Rodriguez is a longtime member of NY's acclaimed Labyrinth Theater Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODc2MDMyMF5BMl5BanBnXkFtZTcwNzgxMDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0735300","name":"Elizabeth Rodriguez","idIMDB":"nm0735300"},"actorId":"nm0735300","character":"Detective Romsey","urlCharacter":"http://www.imdb.com/character/ch0401435","main":true},{"actorName":"Michael Aronov","urlProfile":"http://www.imdb.com/name/nm0033079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNWZjMTEtYmE1My00ZTBhLThkNzEtZWEyYTg2NmUxNTNjXkEyXkFqcGdeQXVyMTUzNDMyMjM@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Nearly unrecognizable in his portrayals, Michael Aronov has made a name for himself by pushing the boundaries on stage and screen. Residing in New York, the actor continues to balance his way through theatre and film. He recently completed work as one of the leads opposite Tom Hardy and James Gandolfini in the upcoming Dennis Lehane film, The Drop (2014). On television, the actor has a recurring role in the acclaimed series The Americans (2013), giving a heartbreaking performance as a physicist and potential spy. His work as avenging father and Italian royalty, Count Vincent of Naples, will also be seen in this season's newly anticipated show Reign (2013). Previous television work had Aronov taking on the gritty undercover world in the Bronx as Danny Raden - a series lead opposite Larenz Tate in BET's Gun Hill (2011). Michael then went on to parallel Jim Caviezel's character in Person of Interest (2011), donning the role of another undercover cop searching for symmetry between family and the streets. And in 2010 his intense performance as concealed war criminal Armand Marku pitted Aronov head-to-head with Kyra Sedgwick in a gripping season finale of The Closer (2005). For his stage work Michael received \"The Elliot Norton Award - Best Actor\", for originating the lead role in Theresa Rebeck's \"Mauritius\". On Broadway he appeared as the lovable troublemaker Siggie, in the Tony-nominated revival of \"Golden Boy\" (2012-2013), directed by Bartlett Sher. Previously he worked with Sher and the Lincoln Center theatre yet again, playing the volcanic yet endearing KGB operative, Dmitri Gromov, in the American premiere of \"Blood and Gifts\" (2011). Prior to that, Aronov's reputation for versatility and complex character work reflected itself in his highly acclaimed solo-show \"Manigma\" (2010), which had its second run in New York City at the Harold Clurman Theatre. He ventured to Europe to take on the indelible role of Stanley Kowalski in the classic \"A Streetcar Named Desire\" (2009). In 2006 the actor's theatre travels took him to the West Coast under the direction of Estelle Parsons in \"Salome\", starring Al Pacino. Aronov then went on to work with Terrence McNally on the world premiere of \"Unusual Acts of Devotion\" (2008). A revered pioneer in avant-garde theatre and the Off-Broadway world, the late great Joseph Chaikin took Michael under his wing after their first introduction in Sam Shepard's New York premiere of \"The Late Henry Moss\" (2001) at the Signature Theatre. Just before Chaikin's death, the two collaborated for the last time at the esteemed Actors' Studio (2002). A member for over a decade, Aronov furthered his work there exploring the likes of Anton Chekhov under the guidance of Oleg Tabakov/Moscow Art Theatre (2003). Also at The Studio, he later dove into August Strindberg's complex world in \"Playing with Fire\" (2004), directed by Lee Grant. That same year the actor took on another Strindberg classic in his darkly visceral portrayal of Jean in \"Miss Julie\" (2004) at the landmark Cherry Lane Theatre. Extending his trademark for risk, Michael played opposite Annabella Sciorra as her wildly fantasized Conquistador in \"Spain\" (2007) at the Lucille Lortel Theatre; embodied the dangerous and flamboyant Dionysus in \"The Bacchae 2.1\" (2001); and undertook the layered madness of Edgar in an award winning production of \"King Lear\" (1999). Along with his stage success, Michael continues to find a balance with film and television. From torn and troubled characters on Elementary (2012), The Good Wife (2009), Life on Mars (2008) and Threat Matrix (2003), to cocksure troublemakers in Burn Notice (2007), Blue Bloods (2010), White Collar (2009), and Without a Trace (2002), Michael has kept his roles vibrant and varied. He made several appearances on Law & Order (1990), Law & Order: Special Victims Unit (1999), and Law & Order: Criminal Intent (2001), worked with the late Bruno Kirby in Barry Levinson's The Beat (2000), among various episodes on Spin City (1996), Lipstick Jungle (2008), The Game (2006) and All My Children (1970). In 2013 he collaborated for the third time with director Matthew Bonifacio on another award-winning piece called Fortune House (2013), which premiered at the Tribeca Film Festival. In the story Michael delved into the world of autism as he portrayed Peter, a lone obsessive-compulsive, that comes upon companionship for the first time. In harsh contrast, a drastic red flattop and burly mustache accentuated Aronov's full transformation into a brick of a man in Amexicano (2007), which also premiered at the Tribeca Film Festival. In his first film, he learned to rock the drums as \"Schlatko\" in the cult-classic Hedwig and the Angry Inch (2001), and then gave a shockingly polar portrayal in another Sundance Film Festival favorite and 2011 Independent Spirit Award nominated film - Lbs. (2004). The latter film showcased Aronov's unique level of immersion into a role as he lost nearly fifty pounds to reflect the authentic downfall of Sacco Valenzia, a charismatic and boundless addict. Michael has been honored nationally with a \"Level 1 Award for Acting\" by the NFAA in association with the ARTS; an \"IRNE Award\" nomination for Best Supporting Actor; \"The Greer Garson Award\" in Dallas, TX; and in culmination of his work he was the recipient of \"The Individual Grant Award\" by the Belle Foundation, \"exhibiting exceptional talent and potential for achievement in the arts.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNWZjMTEtYmE1My00ZTBhLThkNzEtZWEyYTg2NmUxNTNjXkEyXkFqcGdeQXVyMTUzNDMyMjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0033079","name":"Michael Aronov","idIMDB":"nm0033079"},"actorId":"nm0033079","character":"Chovka","urlCharacter":"http://www.imdb.com/character/ch0401436","main":true},{"actorName":"Morgan Spector","urlProfile":"http://www.imdb.com/name/nm1767528","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODIxNzAwMF5BMl5BanBnXkFtZTgwMjQwNzY0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Morgan Michael Spector","height":"6' 1\" (1.85 m)","bio":"Morgan Spector was born as Morgan Michael Spector. He is known for his work on The Drop (2014), The Last Airbender (2010) and Christine (2016). He has been married to Rebecca Hall since September 26, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODIxNzAwMF5BMl5BanBnXkFtZTgwMjQwNzY0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1767528","name":"Morgan Spector","idIMDB":"nm1767528"},"actorId":"nm1767528","character":"Andre","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Esper","urlProfile":"http://www.imdb.com/name/nm1092022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWI3YzBkMDQtODBhYi00MTRmLWExOTEtMGQxZWM1Yjk4YTZkXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1976","placeOfBirth":" New York, New York, USA","birthName":"Michael James Esper","bio":"Michael Esper was born on December 1, 1976 in New York, New York, USA as Michael James Esper. He is an actor, known for A Beautiful Mind (2001), Frances Ha (2012) and The Drop (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWI3YzBkMDQtODBhYi00MTRmLWExOTEtMGQxZWM1Yjk4YTZkXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1092022","name":"Michael Esper","idIMDB":"nm1092022"},"actorId":"nm1092022","character":"Rardy","urlCharacter":"http://www.imdb.com/character/ch0401432","main":true},{"actorName":"Ross Bickell","urlProfile":"http://www.imdb.com/name/nm0081009","urlPhoto":"","biography":{"dateOfBirth":"14 January 1947","placeOfBirth":" Hackensack, New Jersey, USA","birthName":"George Ross Bickell Jr.","bio":"Ross Bickell was born on January 14, 1947 in Hackensack, New Jersey, USA as George Ross Bickell Jr. He is an actor, known for The Fighter (2010), The Drop (2014) and Major Payne (1995). He has been married to Deirdre Madigan since May 15, 1993. He was previously married to Loni Anderson.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0081009","name":"Ross Bickell","idIMDB":"nm0081009"},"actorId":"nm0081009","character":"Father Regan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Frecheville","urlProfile":"http://www.imdb.com/name/nm3306943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MDU2NjY0OF5BMl5BanBnXkFtZTgwMTQ5MjUxNDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"James Frecheville is an actor and producer, known for Animal Kingdom (2010), The Drop (2014) and The Stanford Prison Experiment (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MDU2NjY0OF5BMl5BanBnXkFtZTgwMTQ5MjUxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3306943","name":"James Frecheville","idIMDB":"nm3306943"},"actorId":"nm3306943","character":"Fitz","urlCharacter":"http://www.imdb.com/character/ch0490809","main":true},{"actorName":"Tobias Segal","urlProfile":"http://www.imdb.com/name/nm1708414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTMwNjI5OV5BMl5BanBnXkFtZTcwMTY5NzE1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Tobias Segal is an actor, known for John Wick: Chapter 2 (2017), Men in Black 3 (2012) and The Drop (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTMwNjI5OV5BMl5BanBnXkFtZTcwMTY5NzE1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1708414","name":"Tobias Segal","nicknames":["Toby"],"idIMDB":"nm1708414"},"actorId":"nm1708414","character":"Briele","urlCharacter":"http://www.imdb.com/character/ch0401437","main":true},{"actorName":"Patricia Squire","urlProfile":"http://www.imdb.com/name/nm4779905","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkwMTAyNzY4N15BMl5BanBnXkFtZTgwNTE3MjA1MTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Patricia Squire is an actress, known for John Wick (2014), The Drop (2014) and Bridge of Spies (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkwMTAyNzY4N15BMl5BanBnXkFtZTgwNTE3MjA1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4779905","name":"Patricia Squire","idIMDB":"nm4779905"},"actorId":"nm4779905","character":"Millie","urlCharacter":"http://www.imdb.com/character/ch0401448","main":true},{"actorName":"Ann Dowd","urlProfile":"http://www.imdb.com/name/nm0235652","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMTc0NzA0OV5BMl5BanBnXkFtZTcwMDIwMjk4OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1956","placeOfBirth":" Holyoke, Massachusetts, USA","bio":"Ann Dowd was born on January 30, 1956 in Holyoke, Massachusetts, USA. She is an actress, known for Compliance (2012), Side Effects (2013) and Marley & Me (2008). She has been married to Lawrence Arancio since 1984. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMTc0NzA0OV5BMl5BanBnXkFtZTcwMDIwMjk4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235652","name":"Ann Dowd","idIMDB":"nm0235652"},"actorId":"nm0235652","character":"Dottie","urlCharacter":"http://www.imdb.com/character/ch0401449","main":true},{"actorName":"Chris Sullivan","urlProfile":"http://www.imdb.com/name/nm2884388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ0Mzc3OTU2Ml5BMl5BanBnXkFtZTgwMTc3ODE1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Chris Sullivan is an actor and producer, known for The Drop (2014), Imperium (2016) and Morgan (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ0Mzc3OTU2Ml5BMl5BanBnXkFtZTgwMTc3ODE1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2884388","name":"Chris Sullivan","nicknames":["Sully"],"idIMDB":"nm2884388"},"actorId":"nm2884388","character":"Jimmy","urlCharacter":"http://www.imdb.com/character/ch0401433","main":true}],"seasons":[],"idIMDB":"tt1600196","urlIMDB":"http://www.imdb.com/title/tt1600196","business":{"budget":{"money":"$12,600,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,104,552","country":"USA","day":"12","month":"09","year":"2014","remarks":"809 Screens"}],"gross":[{"money":"$10,724,389","country":"USA","day":"13","month":"11","year":"2014","remarks":""},{"money":"$10,715,320","country":"USA","day":"06","month":"11","year":"2014","remarks":""},{"money":"$10,699,392","country":"USA","day":"30","month":"10","year":"2014","remarks":""},{"money":"$10,680,693","country":"USA","day":"23","month":"10","year":"2014","remarks":""},{"money":"$10,641,027","country":"USA","day":"16","month":"10","year":"2014","remarks":""},{"money":"$10,530,820","country":"USA","day":"09","month":"10","year":"2014","remarks":""},{"money":"$10,124,241","country":"USA","day":"02","month":"10","year":"2014","remarks":""},{"money":"$8,595,722","country":"USA","day":"25","month":"09","year":"2014","remarks":""},{"money":"$5,639,701","country":"USA","day":"18","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$1,046,090","country":"USA","day":"26","month":"09","year":"2014","remarks":"1,131 Screens"},{"money":"$2,070,660","country":"USA","day":"19","month":"09","year":"2014","remarks":"1,192 Screens"},{"money":"$4,104,552","country":"USA","day":"12","month":"09","year":"2014","remarks":"809 Screens"}],"admissions":[{"money":"32,934","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa M, Leica Summilux-C Lenses","Arri Alexa Plus, Leica Summilux-C Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"7.1","metascore":"69","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[{"award":"Abu Dhabi Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Black Pearl Award","categories":[{"category":"New Horizons Competition","names":[{"name":"Michaël R. Roskam","id":"nm1742427","role":null}]}]}]},{"award":"London Critics Circle Film Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated ALFS Award","categories":[{"category":"British Actor of the Year","names":[{"name":"Tom Hardy","id":"nm0362766","role":null},{"name":"Locke","id":"tt2692904","role":null}]}]}]},{"award":"San Sebastián International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Prize of the Jury","categories":[{"category":"Best Screenplay","names":[{"name":"Dennis Lehane","id":"nm1212331","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Seashell","categories":[{"category":"Best Film","names":[{"name":"Michaël R. Roskam","id":"nm1742427","role":null}]}]}]},{"award":"Sant Jordi Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Sant Jordi","categories":[{"category":"Best Foreign Actor (Mejor Actor Extranjero)","names":[{"name":"Tom Hardy","id":"nm0362766","role":null},{"name":"Locke","id":"tt2692904","role":null}]}]}]},{"award":"Zurich Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Special Mention","categories":[{"category":"International Feature Film","names":[{"name":"Michaël R. Roskam","id":"nm1742427","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Eye","categories":[{"category":"Best International Feature Film","names":[{"name":"Michaël R. Roskam","id":"nm1742427","role":null}]}]}]}],"votes":"114,519","type":"Movie","companyCreditsSimple":[{"idCompany":"co0283574","name":"Big Screen Productions"},{"idCompany":"co0148124","name":"Bob Industries"},{"idCompany":"co0286257","name":"Chernin Entertainment"}],"keywords":{"keywords":["catholic","mass","church","bar","chechen","bartender","robbery","gangster","criminal","abandoned puppy","love interest","mob execution","tear on cheek","red umbrella","ford pickup","bloody money","hit on the head","abused puppy","stained glass window","watch stopped","bar robbery","pit bull puppy","puppy in a trash can","beer keg","drink on the house","stella artois","disposing of body part","diner","recovering drug addict","disposing of a dead body","semiautomatic pistol","plastic wrap","body parts in trash bag","body part","organized crime","plan gone wrong","garbage bag","jogging","held at gunpoint","murder confession","human animal relationship","cage","pet dog","run over by a car","money roll","hitman","henchman","botched robbery","planning robbery","vehicular homicide","attempted robbery","masked robber","armed robbery","van","neck scar","shovelling snow","winter","snow","pickup truck","dirty money","trashcan","police","wristwatch","blackmail","breaking and entering","new york city","blood splatter","super bowl","mobster","shot in the chest","shot to death","shot in the throat","upside down camera shot","ex convict","intimidation","threat","umbrella","hit by a car","murder","envelope full of money","scar","rain","dog park","brother sister relationship","bound and gagged","stabbed in the foot","pistol","shotgun","masked man","animal cruelty","character repeating someone else's dialogue","title spoken by narrator","voice over narration","shot in a car","severed arm","corpse","ex boyfriend ex girlfriend relationship","two word title","cousin cousin relationship","holy communion","pet store","new year","waitress","abandoned dog","shot in the head","safe","police detective","crime boss","unsolved murder","money laundering","bar owner","brooklyn new york city","star died before release","based on short story","title spoken by character","dog"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:09:53"}}