{"data":{"movies":[{"title":"Friends with Benefits","originalTitle":"","year":"2011","releaseDate":"20110722","directors":[{"name":"Will Gluck","id":"nm0323239"}],"writers":[{"name":"Keith Merryman","id":"nm2226647"},{"name":"David A. Newman","id":"nm2226970"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MzQ0NTk4N15BMl5BanBnXkFtZTcwMDc2NDYzNQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Jamie Rellis () is a New York City head-hunter trying to sign Los Angeles-based art director Dylan Harper () for her client. When he takes the job and makes the move, they quickly become friends. Their friendship turns into a friendship with benefits, but with Jamie's emotionally damaged past and Dylan's history of being emotionally unavailable, they have to try to not fall for each other the way Hollywood romantic comedies dictate.","simplePlot":"A young man and woman decide to take their friendship to the next level without becoming a couple, but soon discover that adding sex only leads to complications.","actors":[{"actorName":"Justin Timberlake","urlProfile":"http://www.imdb.com/name/nm0005493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjE1MjU2N15BMl5BanBnXkFtZTcwNjk0ODY1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1981","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Justin Randall Timberlake","height":"6' 1\" (1.85 m)","bio":"Justin Randall Timberlake was born on January 31, 1981, in Memphis, Tennessee, to Lynn (Bomar) and Randall Timberlake, whose own father was a Baptist minister. At the age of 11, he appeared on the show Star Search (1983), and even though he didn't win, it didn't dampen his ambitions. He also appeared on The All New Mickey Mouse Club (1989), where his costars included Britney Spears, Ryan Gosling, Keri Russell, Christina Aguilera and future band-mate J.C. Chasez. At age 14, Justin became a member of the boy band *NSYNC. In 1998, the group released their self-titled debut album. They became a big hit with fans and made a place for themselves in the music world with a succession of big-selling albums. In the beginning of 2002, Justin spent time working on and writing songs for his debut solo album. During this time, he broke up with his longtime girlfriend, Britney Spears. The release of the solo album, titled \"Justified\", came in November of 2002. Songs from his solo album include: \"Like I Love You\", \"Cry Me A River\" and \"Rock Your Body\". Timberlake has branched out into an acting career, having most recently starred in The Social Network (2010), Friends with Benefits (2011), and Trouble with the Curve (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjE1MjU2N15BMl5BanBnXkFtZTcwNjk0ODY1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005493","name":"Justin Timberlake","nicknames":["JT"],"idIMDB":"nm0005493"},"actorId":"nm0005493","character":"Dylan","urlCharacter":"http://www.imdb.com/character/ch0398422","main":true},{"actorName":"Mila Kunis","urlProfile":"http://www.imdb.com/name/nm0005109","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyNTQyNzY4MV5BMl5BanBnXkFtZTcwODg5MDA3MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1983","placeOfBirth":" Chernovtsy, Ukrainian SSR, USSR [now Chernivtsi, Ukraine]","birthName":"Milena Markovna Kunis","height":"5' 4\" (1.63 m)","bio":"The talented Milena \"Mila\" Markovna Kunis was born to a Jewish family in Chernivtsi, Ukraine, USSR (now independent Ukraine). Her mother, Elvira, is a physics teacher, her father, Mark Kunis, is a mechanical engineer, and she has an older brother named Michael. After attending one semester of college between gigs, she realized that she wanted to act for the rest of her life. She started acting when she was just 9 years old, when her father heard about an acting class on the radio and decided to enroll Mila in it. There, she met her future agent. Her first gig was in 1995, in which she played a character named Melinda in Make a Wish, Molly (1995). From there, her career skyrocketed into big-budget films. Although she is mostly known for playing Jackie Burkhart in That '70s Show (1998), she has shown the world that she can do so much more. Her breakthrough film was Forgetting Sarah Marshall (2008), in which she played a free-spirited character named Rachel Jensen. She has since starred or co-starred in the films The Book of Eli (2010), Black Swan (2010), Friends with Benefits (2011) and Ted (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyNTQyNzY4MV5BMl5BanBnXkFtZTcwODg5MDA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005109","name":"Mila Kunis","nicknames":["Goldfish"],"idIMDB":"nm0005109"},"actorId":"nm0005109","character":"Jamie","urlCharacter":"http://www.imdb.com/character/ch0389421","main":true},{"actorName":"Patricia Clarkson","urlProfile":"http://www.imdb.com/name/nm0165101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjI2MjY1NV5BMl5BanBnXkFtZTcwODUyNjkxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1959","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Patricia Davies Clarkson","height":"5' 5\" (1.65 m)","bio":"This remarkable, one-of-a-kind actress has, since the early 1990s, intrigued film and TV audiences with her glowing, yet careworn eccentricity and old world-styled glamour. Very much in demand these days as a character player, Patricia Clarkson nevertheless continues to avoid the temptation of money-making mainstream filming while reaping kudos and acting awards in out-of-the-way projects. The New Orleans born-and-bred performer with the given name of Patricia Davies Clarkson was born on December 29, 1959, the daughter of Arthur (\"Buzz\") Clarkson, a school administrator, and Jacquelyn (Brechtel) Clarkson, a local city politician and councilwoman. Patricia demonstrated an early interest in acting and managed to appear in a few junior high and high school-level plays while growing up. She took her basic college studies at Louisiana State University, studying speech for two years, before transferring to New York's Fordham University and graduating with honors in theatre arts. Accepted into the prestigious Yale School of Drama graduate program, she earned her Master of Fine Arts after gracing a wide range of productions including \"Electra,\" \"Pericles,\" \"Twelfth Night\", \"The Lower Depths,\" \"The Misanthrope,\" \"Pacific Overtures\" and \"La Ronde\". From there she took on New York City where she attracted strong East Coast notice in 1986 for her portrayal of Corrina in \"The House of Blue Leaves\" and in such other plays as \"Eastern Standard\" (1988) and \"Wolf-Man\" (1989). Known for her organic approach to acting, the flaxen-maned actress decided to try out her trademark whiskey voice in Hollywood at age 28, making her movie debut as Mrs. Eliot Ness in Brian De Palma's The Untouchables (1987) starring Kevin Costner. The following years she gained attention for playing Samantha Walker in The Dead Pool (1988) where she starred opposite Clint Eastwood's popular \"Dirty Harry\" character. Playing supportive, wifely types at the onset, she became a strong contender for character stardom by the mid-to-late 1990s, not only on stage but in the independent film arena. On stage Patricia received impressive notices for her contributions to the plays \"Raised in Captivity,\" \"The Ride Down Mt. Morgan,\" \"Three Days of Rain\" and, in particular, \"The Maiden's Prayer,\" which nabbed her both Outer Critics Circle and Drama Desk Award nominations. In 2004, she finally enacted the classic part she seemed born to play, that of Southern belle Blanche DuBois in the Kennedy Center production of \"A Streetcar Named Desire\". She earned glowing notices. On camera she was offered roles of marked diversity. From the heavier dramatics of a film like Pharaoh's Army (1995), she could move deftly into light comedy, courtesy of Neil Simon in the TV-movie London Suite (1996). It was, however, her bleak, convulsive portrayal of Greta, a strung-out, heroin-happy German has-been actress, opposite a resurgent Ally Sheedy in the acclaimed art film High Art (1998) that truly put Patricia on the indie map. From this she was handed a silver plate's worth of excitingly offbeat roles. In 2003 alone, Patricia received a special acting prize at the Sundance Film Festival for her superb work in three films: as a somber, grieving artist in The Station Agent (2003), a cold-hearted cancer victim in Pieces of April (2003) and a jokey, get-with-it mom in All the Real Girls (2003). She was nominated for a \"Supporting Actress\" Oscar for the second movie mentioned. On TV Patricia received two Emmys for her recurring guest part as Frances Conroy's free-spirited sister in the acclaimed black comedy series Six Feet Under (2001). She also received the New York Film Critics Circle and the National Society of Film Critics awards for her supporting work in the gorgeous, 1950s-styled melodrama Far from Heaven (2002), as a prim and proper Stepford-wife and deceptive friend to Julianne Moore. No matter the size, such as her extended cameos in The Green Mile (1999), All the Real Girls (2003), Miracle (2004) and Elegy (2008), Patricia manages to make the most of whatever screen time she has, often stealing scenes effortlessly. Seen everywhere because of her in-demand status in Hollywood, Patricia recently worked for director/actor Woody Allen. Impressed with her small but excellent contribution in Vicky Cristina Barcelona (2008), she was promoted to a lead in his more recent picture Whatever Works (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjI2MjY1NV5BMl5BanBnXkFtZTcwODUyNjkxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0165101","name":"Patricia Clarkson","nicknames":["Patty"],"idIMDB":"nm0165101"},"actorId":"nm0165101","character":"Lorna","urlCharacter":"http://www.imdb.com/character/ch0283635","main":true},{"actorName":"Jenna Elfman","urlProfile":"http://www.imdb.com/name/nm0001184","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE3MDI5NjAwOF5BMl5BanBnXkFtZTcwOTQ2NzI2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1971","placeOfBirth":" Los Angeles, California, USA","birthName":"Jennifer Mary Butala","height":"5' 10\" (1.78 m)","bio":"Jenna Elfman was born in Los Angeles, California, and began her career appearing in commercials. She studied with Milton Katselas, the renowned acting teacher. She then began appearing in TV shows before landing the role of Dharma in the hit ABC television show Dharma & Greg (1997). Her first starring role in a film was in Krippendorf's Tribe (1998), alongside Richard Dreyfuss. She won a Golden Globe award for her role in Dharma & Greg (1997) and has since appeared in such films as Keeping the Faith (2000) and Edtv (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE3MDI5NjAwOF5BMl5BanBnXkFtZTcwOTQ2NzI2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001184","name":"Jenna Elfman","idIMDB":"nm0001184"},"actorId":"nm0001184","character":"Annie","urlCharacter":"http://www.imdb.com/character/ch0454632","main":true},{"actorName":"Bryan Greenberg","urlProfile":"http://www.imdb.com/name/nm1034965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0ODE2OTE2Ml5BMl5BanBnXkFtZTcwNTAyOTAyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1978","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Bryan E. Greenberg","height":"6' (1.83 m)","bio":"Bryan Greenberg was born in Omaha, Nebraska, to Denise \"Denny\" and Carl Greenberg, who are both psychologists. He has a sister, Becca. His family is Jewish. At the age of twelve, Greenberg moved to St. Louis, Missouri, and graduated from Parkway Central High School in Chesterfield, MO. Having starring in summer camp productions, he moved to New York City to pursue an acting career. Greenberg studied at NYU, and made his television debut on a 1997 episode of Law & Order (1990), playing Matt Wheeler, followed by other television work (including episodes of The Sopranos (1999), Third Watch (1999), and Boston Public (2000), and a run on One Tree Hill (2003)). Moving into film, Greenberg had his first major movie role playing Matty Matthews in The Perfect Score (2004), with an even bigger part in Prime (2005), as David Bloomberg, the love interest of Uma Thurman's character. Since then, Greenberg has headlined the television series October Road (2007) and How to Make It in America (2010), and had notable supporting turns in the films Bride Wars (2009), as the brother of Kate Hudson's character, and Friends with Benefits (2011), opposite Mila Kunis's Jamie Rellis. On October 31, 2015, Bryan married actress Jamie Chung.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0ODE2OTE2Ml5BMl5BanBnXkFtZTcwNTAyOTAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1034965","name":"Bryan Greenberg","nicknames":["BG"],"idIMDB":"nm1034965"},"actorId":"nm1034965","character":"Parker","urlCharacter":"http://www.imdb.com/character/ch0283637","main":true},{"actorName":"Richard Jenkins","urlProfile":"http://www.imdb.com/name/nm0420955","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5MzA4NDcyN15BMl5BanBnXkFtZTcwMDkwNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1947","placeOfBirth":" DeKalb, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Richard Jenkins was born on May 4, 1947 in DeKalb, Illinois, USA. He is an actor, known for Jack Reacher (2012), The Cabin in the Woods (2012) and Step Brothers (2008). He has been married to Sharon R. Friedrick since August 23, 1969. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5MzA4NDcyN15BMl5BanBnXkFtZTcwMDkwNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0420955","name":"Richard Jenkins","idIMDB":"nm0420955"},"actorId":"nm0420955","character":"Mr. Harper","urlCharacter":"http://www.imdb.com/character/ch0283638","main":true},{"actorName":"Woody Harrelson","urlProfile":"http://www.imdb.com/name/nm0000437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDc2ODc4MF5BMl5BanBnXkFtZTcwODk2MzAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1961","placeOfBirth":" Midland, Texas, USA","birthName":"Woodrow Tracy Harrelson","height":"5' 9½\" (1.77 m)","bio":"Academy Award-nominated and Emmy Award-winning actor Woodrow Tracy Harrelson was born on July 23, 1961 in Midland, Texas, to Diane Lou (Oswald) and Charles Harrelson. He grew up in Lebanon, Ohio, and, after receiving degrees in theater arts and English from Hanover College, had a brief stint in New York theater. He was soon cast as Woody on TV series Cheers (1982), which wound up being one of the most-popular TV shows ever and also earned Harrelson an Emmy for his performance in 1989. While he dabbled in film during his time on Cheers (1982), that area of his career didn't fully take off until towards the end of the show's run. In 1991, Doc Hollywood (1991) gave him his first widely-seen movie role, and he followed that up with White Men Can't Jump (1992), Indecent Proposal (1993) and Natural Born Killers (1994). More recently, Harrelson was seen in No Country for Old Men (2007), Zombieland (2009), 2012 (2009), and Friends with Benefits (2011), along with the acclaimed HBO movie Game Change (2012). In 2011, Harrelson snagged the coveted role of fan-favorite drunk Haymitch Abernathy in the big-screen adaptation of The Hunger Games (2012), which ended up being one of the highest-grossing movies ever at the domestic box office. Harrelson is set to reprise that role for the sequels, which are scheduled for release in November 2013, 2014 and 2015. Harrelson has received two Academy Award nominations, first for his role as controversial Hustler founder Larry Flynt in The People vs. Larry Flynt (1996) and then for a role in The Messenger (2009). He also received Golden Globe nominations for both of these parts. In 2016, he had a stand-out role as a wise teacher in the teen drama The Edge of Seventeen (2016). Harrelson was briefly married to Nancy Simon in the 80s, and later married his former assistant, Laura Louie, with whom he has three daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDc2ODc4MF5BMl5BanBnXkFtZTcwODk2MzAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000437","name":"Woody Harrelson","idIMDB":"nm0000437"},"actorId":"nm0000437","character":"Tommy","urlCharacter":"http://www.imdb.com/character/ch0403517","main":true},{"actorName":"Nolan Gould","urlProfile":"http://www.imdb.com/name/nm2188098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzU0ODczN15BMl5BanBnXkFtZTgwNjk2MDgxNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1998","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"Nolan Gould was born on October 28, 1998 in New York City, New York, USA. He is an actor, known for Modern Family (2009), Friends with Benefits (2011) and The To Do List (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzU0ODczN15BMl5BanBnXkFtZTgwNjk2MDgxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2188098","name":"Nolan Gould","idIMDB":"nm2188098"},"actorId":"nm2188098","character":"Sam","urlCharacter":"http://www.imdb.com/character/ch0277120","main":true},{"actorName":"Andy Samberg","urlProfile":"http://www.imdb.com/name/nm1676221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODAwMDc2NF5BMl5BanBnXkFtZTcwMjUzNzg3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1978","placeOfBirth":" Berkeley, California, USA","birthName":"Andrew David Samberg","height":"5' 9½\" (1.77 m)","bio":"Andy Samberg was born in Berkeley, California, to Marjorie (Marrow), a teacher, and Joe Samberg, a photographer. With Jorma Taccone and Akiva Schaffer, Samberg is one of three Los Angeles, California-based writer-performer-filmmakers--all childhood friends--dubbed the Lonely Island, whose short films were showcased on the popular untelevised television network show and Web site Channel 101.com. Some of their popular shorts included The O.C. (2003) parody \"The 'Bu\" and their full-length pilot, \"Awesometown.\" They met Jimmy Fallon while writing for 2004 MTV Video Music Awards (2004), who then suggested that they audition for \"Saturday Night Live\". Andy was then cast as a featured performer, and Samberg's Lonely Island cohorts Jorma and Akiva were hired as writers for the show. Near the end of his first season of \"SNL,\" Andy started filming the lead role in the film Hot Rod (2007), the first major motion picture by the Lonely Island team, with the production support of Lorne Michaels. In 2016, Andy starred in the pop music mockumentary Popstar: Never Stop Never Stopping (2016). Taccone and Schaffer co-starred in and co-directed the film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODAwMDc2NF5BMl5BanBnXkFtZTcwMjUzNzg3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1676221","name":"Andy Samberg","nicknames":["Ardy"],"idIMDB":"nm1676221"},"actorId":"nm1676221","character":"Quincy","urlCharacter":"http://www.imdb.com/character/ch0283640","main":true},{"actorName":"Shaun White","urlProfile":"http://www.imdb.com/name/nm1027039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2M1ZTNkZGMtMTk3NS00M2JlLWE4NGUtNmI3MmRmODg2YjY0XkEyXkFqcGdeQXVyNzQyNDk4ODg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1986","placeOfBirth":" San Diego, California, USA","birthName":"Shaun Roger White","height":"5' 8\" (1.73 m)","bio":"Shaun Roger White was born on September 3, 1986 to Roger and Kathy White, whom now reside in Carlsbad, California. Shaun has one brother, Jesse, and one sister, Kari. Shaun started snowboarding at age six and became a pro at age ten when he had started entering as \"pro\". His brother, Jesse, is also his manager, best friend, his everything.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2M1ZTNkZGMtMTk3NS00M2JlLWE4NGUtNmI3MmRmODg2YjY0XkEyXkFqcGdeQXVyNzQyNDk4ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1027039","name":"Shaun White","nicknames":["Future Boy","The Egg","The Flying Tomato","The Animal"],"idIMDB":"nm1027039"},"actorId":"nm1027039","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Fleming","urlProfile":"http://www.imdb.com/name/nm0281598","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTczNjc4NF5BMl5BanBnXkFtZTcwNzYxOTA4MQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1965","placeOfBirth":" USA","bio":"Andrew Fleming was born on December 30, 1965 in the USA. He is a director and producer, known for The Craft (1996), Dick - Les coulisses de la présidence (1999) and Nancy Drew (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTczNjc4NF5BMl5BanBnXkFtZTcwNzYxOTA4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0281598","name":"Andrew Fleming","idIMDB":"nm0281598"},"actorId":"nm0281598","character":"Driver","urlCharacter":"http://www.imdb.com/character/ch0341932","main":true},{"actorName":"Catherine Reitman","urlProfile":"http://www.imdb.com/name/nm0718642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDFmYWNkMzAtMTViZi00MjQ2LThhYTAtNWJkOGRiOGIxMTZhL2ltYWdlXkEyXkFqcGdeQXVyMTc2MzkwMTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1981","placeOfBirth":" Los Angeles, California, USA","birthName":"Catherine Marcelle Reitman","height":"5' 5\" (1.65 m)","bio":"Catherine Reitman was born on April 28, 1981 in Los Angeles, California, USA as Catherine Marcelle Reitman. She is an actress and writer, known for Workin' Moms (2017), It's Always Sunny in Philadelphia (2005) and Black-ish (2014). She has been married to Philip Sternberg since August 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDFmYWNkMzAtMTViZi00MjQ2LThhYTAtNWJkOGRiOGIxMTZhL2ltYWdlXkEyXkFqcGdeQXVyMTc2MzkwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0718642","name":"Catherine Reitman","nicknames":["Cat"],"idIMDB":"nm0718642"},"actorId":"nm0718642","character":"Female Co-Worker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Courtney Henggeler","urlProfile":"http://www.imdb.com/name/nm1136435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTUzMzcxNF5BMl5BanBnXkFtZTgwNTQxNzM3MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1981","placeOfBirth":" Phillipsburg, New Jersey, USA","height":"5' 9\" (1.75 m)","bio":"Courtney Henggeler is an actress, model and singer. As a child she was definitely theatrical. She took acting lessons in LA. Her first audition was for her high school's production of 'Carousel' when she was in 9th grade. She pretended to eat an apple while singing about clams. Her debut was as Susan Beth in the film The Bog Creatures. Though her television debut was in House M.D (2005), she was popular as Missy Cooper in CBS sitcom the big bang theory in 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTUzMzcxNF5BMl5BanBnXkFtZTgwNTQxNzM3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1136435","name":"Courtney Henggeler","idIMDB":"nm1136435"},"actorId":"nm1136435","character":"Flight Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Masi Oka","urlProfile":"http://www.imdb.com/name/nm1199811","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4Mjc5ODIxNV5BMl5BanBnXkFtZTcwODk1NjU2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1974","placeOfBirth":" Tokyo, Japan","birthName":"Masayori Oka","height":"5' 6\" (1.68 m)","bio":"Masayori \"Masi\" Oka is a Japanese American actor, producer and digital effects artist. He became widely known for his role on NBC's Heroes as Hiro Nakamura and in CBS' Hawaii Five-0 as Doctor Max Bergman. Oka was born in Tokyo, Japan, to Setsuko Oka. His parents divorced when he was one month old; he was raised in a single parent family and has never met his father. He was six years old when his mother and he moved to Los Angeles from Japan. At age eight, he appeared on the CBS-TV game show Child's Play. In 1987, a twelve-year-old Oka was featured on the cover of Time titled \"Those Asian-American Whiz Kids\". Though he was not featured in the article itself, he was acquainted with the photographer who conducted the shoot. His IQ has been reported at over 180.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4Mjc5ODIxNV5BMl5BanBnXkFtZTcwODk1NjU2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1199811","name":"Masi Oka","idIMDB":"nm1199811"},"actorId":"nm1199811","character":"Darin Arturo Morena","urlCharacter":"http://www.imdb.com/character/ch0283641","main":true},{"actorName":"Tiya Sircar","urlProfile":"http://www.imdb.com/name/nm1587188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMTU5MjgyMF5BMl5BanBnXkFtZTgwODI4NDYyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1982","placeOfBirth":" Tarrant County, Texas, USA","height":"5' 3\" (1.6 m)","bio":"Tiya Sircar was born on May 16, 1982 in Tarrant County, Texas, USA. She is an actress, known for The Internship (2013), Star Wars Rebels (2014) and 17 Again (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMTU5MjgyMF5BMl5BanBnXkFtZTgwODI4NDYyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1587188","name":"Tiya Sircar","idIMDB":"nm1587188"},"actorId":"nm1587188","character":"Hostess","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1632708","urlIMDB":"http://www.imdb.com/title/tt1632708","business":{"budget":{"money":"$35,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$18,622,150","country":"USA","day":"24","month":"07","year":"2011","remarks":"2,926 Screens"},{"money":"€1,022,427","country":"Italy","day":"16","month":"10","year":"2011","remarks":"248 Screens"},{"money":"PHP 6,410,319","country":"Philippines","day":"02","month":"10","year":"2011","remarks":"65 Screens"}],"gross":[{"money":"$55,802,754","country":"USA","day":"18","month":"09","year":"2011","remarks":""},{"money":"$55,705,000","country":"USA","day":"11","month":"09","year":"2011","remarks":""},{"money":"$55,574,329","country":"USA","day":"04","month":"09","year":"2011","remarks":""},{"money":"$55,216,702","country":"USA","day":"28","month":"08","year":"2011","remarks":""},{"money":"$54,712,145","country":"USA","day":"21","month":"08","year":"2011","remarks":""},{"money":"$53,079,337","country":"USA","day":"14","month":"08","year":"2011","remarks":""},{"money":"$48,526,287","country":"USA","day":"07","month":"08","year":"2011","remarks":""},{"money":"$38,175,973","country":"USA","day":"31","month":"07","year":"2011","remarks":""},{"money":"$18,622,150","country":"USA","day":"24","month":"07","year":"2011","remarks":""},{"money":"€1,022,427","country":"Italy","day":"16","month":"10","year":"2011","remarks":""},{"money":"PHP 11,523,224","country":"Philippines","day":"09","month":"10","year":"2011","remarks":""},{"money":"PHP 6,410,319","country":"Philippines","day":"02","month":"10","year":"2011","remarks":""}],"weekendGross":[{"money":"$62,714","country":"USA","day":"18","month":"09","year":"2011","remarks":"96 Screens"},{"money":"$78,445","country":"USA","day":"11","month":"09","year":"2011","remarks":"114 Screens"},{"money":"$192,687","country":"USA","day":"04","month":"09","year":"2011","remarks":"161 Screens"},{"money":"$213,321","country":"USA","day":"28","month":"08","year":"2011","remarks":"214 Screens"},{"money":"$533,670","country":"USA","day":"21","month":"08","year":"2011","remarks":"413 Screens"},{"money":"$1,846,455","country":"USA","day":"14","month":"08","year":"2011","remarks":"1,294 Screens"},{"money":"$4,687,883","country":"USA","day":"07","month":"08","year":"2011","remarks":"2,398 Screens"},{"money":"$9,275,962","country":"USA","day":"31","month":"07","year":"2011","remarks":"2,926 Screens"},{"money":"$18,622,150","country":"USA","day":"24","month":"07","year":"2011","remarks":"2,926 Screens"},{"money":"PHP 2,588,202","country":"Philippines","day":"09","month":"10","year":"2011","remarks":"41 Screens"},{"money":"PHP 6,410,319","country":"Philippines","day":"02","month":"10","year":"2011","remarks":"65 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 2011 Screen Gems, Inc."},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["Dolby Digital","SDDS","Datasat"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Sony CineAlta F35, Panavision Primo Lenses"],"laboratory":["ColorWorks, Culver City (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":["2,989 m (Portugal, 35 mm)"],"negativeFormat":["Video (HD)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (1080p/24) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"6,6","metascore":"63","filmingLocations":[{"location":"Sony Pictures Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"R","awards":[{"award":"Golden Schmoes Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best T&amp;A of the Year","names":[{"name":"Mila Kunis","id":"nm0005109","role":null}]}]}]},{"award":"People's Choice Awards, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Comedy Movie","names":[]}]}]},{"award":"Rembrandt Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Rembrandt Award","categories":[{"category":"Best International Actress (Beste Buitenlandse Actrice)","names":[{"name":"Mila Kunis","id":"nm0005109","role":null}]}]}]},{"award":"Teen Choice Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Summer Movie Star: Male","names":[{"name":"Justin Timberlake","id":"nm0005493","role":null}]},{"category":"Choice Summer Movie Star: Female","names":[{"name":"Mila Kunis","id":"nm0005109","role":null}]}]}]}],"votes":"284 220","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010568","name":"Screen Gems"},{"idCompany":"co0040620","name":"Castle Rock Entertainment"},{"idCompany":"co0110404","name":"Zucker Productions"}],"keywords":{"keywords":["male objectification","blow job","girl in panties","no panties","female rear nudity","oral sex","female frontal nudity","sex","scantily clad female","female removes her dress","female removes her clothes","lingerie","profanity","orgasm","sex in bed","woman on top","male rear nudity","quickie","friends with benefits","white panties","female nudity","breasts","sex scene","new york city","new york","job","break up","sex montage","bra and panties","black bra","bra","rear male nudity","rear female nudity","bare butt","woman's bare butt","buttocks","bare butt woman","woman moaning from pleasure","moaning woman","woman moaning","moaning","sawed in half magic act","voyeurism","voyeur","upskirt","mini skirt","mini dress","thong panties","brown panties","black panties","panties","lust","public nudity","cleavage","playstation eye","playstation move","blu ray disc","blu ray","2010s","major league baseball","new york mets","microsoft windows 7","hbo","sony bravia","led tv","plasma tv","touch screen","sony vaio","smartphone","sony ericsson xperia","hdtv","sony","blog","blogger","news report","overheard conversation","beach house","beach","watching a movie","taking off pants","jet ski","alzheimer's disease","sex with socks on","interrupted sex","urination","apartment","caught having sex","sex comedy","telephone call","cell phone","magazine","swearing","sneezing","sneeze","promiscuous mother","job interview","new job","dating","single","little boy","flight","airport","party","playstation 3","playing a video game","boat","rooftop","ipad","swearing on a bible","magic trick","amateur magician","magician","woman wearing a thong","police helicopter","eurocopter as350 squirrel","hollywood sign","boy wearing a tuxedo","aerial shot","playing basketball","fellatio","cunnilingus","black lingerie","gq magazine","flash mob","f word","single mother","penthouse apartment","anti romantic comedy","boyfriend girlfriend relationship","film within a film","bare chested male","parents","alcohol","brother sister relationship","mother daughter relationship","father son relationship","contract","headhunter","los angeles california","advertising","scene after end credits","three word title","homosexual","leg spreading","dementia"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:14:09"}}