{"data":{"movies":[{"title":"Jesse Jane: Home Work","originalTitle":"","year":"2010","releaseDate":"2010","directors":[{"name":"Robby D.","id":"nm0195996"}],"countries":["USA"],"languages":["English"],"genres":["Adult"],"simplePlot":"","actors":[{"actorName":"Tori Black","urlProfile":"http://www.imdb.com/name/nm2789448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDcwNzMzM15BMl5BanBnXkFtZTcwODk2ODM3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1988","placeOfBirth":" Seattle, Washington, USA","birthName":"Michelle Chapman","height":"5' 9½\" (1.77 m)","bio":"Tall (5'9\"), lovely, and slender brunette knockout Tori Black was born Michelle Chapman on August 26, 1988 in Seattle, Washington. Tori has been a dancer since she was seven years old (she used to be a belly dance instructor). Moreover, Black played football and boxed while growing up. In 2007 Tori attended Western Washington University, where she majored in Journalism and minored in Sociology - Women's Studies. She started performing in explicit hardcore movies in her late teens that same year. Black was the Penthouse Pet of the Month for December, 2008 and the Twisty's Treat of the Month for September, 2009. Tori was nominated for an AVN Award for Best New Starlet in 2009. Among the awards Black has won are an XRCO Award for Cream Dream, a CAVR Award for Hottie of the Year, and a FAME Award for Favorite Rookie Starlet in 2009, a CAVR Award for Star of the Years and an XBIZ Award for Female Performer of the Year in 2010, and back to back AVN and XRCO Awards for Female Performer of the Year in 2010 and 2011 (Black has the distinction of being the first adult film star to win AVN Awards two years in a row in this particular category). Tori was named one of the top twelve female stars in porn by Maxim magazine in 2010 and one of the single most popular stars in porn by CNBC in 2011. Black has a self-designed tattoo of a star and five rings on her lower right abdomen and a pierced tongue and navel. She likes video games and air hockey. Tori gave birth to a son on October 14, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDcwNzMzM15BMl5BanBnXkFtZTcwODk2ODM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2789448","name":"Tori Black","idIMDB":"nm2789448"},"actorId":"nm2789448","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mick Blue","urlProfile":"http://www.imdb.com/name/nm1120190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWZmZjMyMzUtYTZiMi00Njg4LWE5ZTctNjlhN2UzNTc3NGFhXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1976","placeOfBirth":" Graz, Styria, Austria","birthName":"Michael Omelko","height":"5' 10\" (1.78 m)","bio":"Austria, not only produced Hollywood action film star Arnold Schwarzenegger, but also the erotic film star Mick Blue. Born on September 9, 1976 in Graz, Austria, the same region as Schwarzenegger, this next-generation adult film stud began his exhibition work as a model in photo shoots for a Austrian magazine called OEKM. His first glimpse at performing sexually on camera came around September of 2000, while in Paris, working for a German company called Videorama. He credits the owner of the OEKM magazine for having recommended him for Videorama as well as helping him make contacts at a convention in Berlin. Still new to the whole industry, Mick waited until 2001, the next year when he began getting offers. In 2002, Mick began working steadily mostly in Europe. 2003 marked the beginning of recognition for his work during the two years he had been in the industry. He was awarded in Belgium, Best Supporting Actor in March 2003 and received a nomination for Best Foreign Performer of the Year in Berlin, 2003. When he began working in America, or at least with American cast and production companies, he received further award nominations in 2004. Approximately, 3 AVN Award nominations in categories including Foreign Performer of the Year, Best Couple Scene and Best Anal Scene. In addition to his established performing career, Mick is also an accomplished director, making his start back in 2005 and going steady.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWZmZjMyMzUtYTZiMi00Njg4LWE5ZTctNjlhN2UzNTc3NGFhXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1120190","name":"Mick Blue","idIMDB":"nm1120190"},"actorId":"nm1120190","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Deen","urlProfile":"http://www.imdb.com/name/nm1776976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAzMzI5MDleQTJeQWpwZ15BbWU3MDY0NDE3MTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1986","placeOfBirth":" Pasadena, California, USA","birthName":"Bryan Matthew Sevilla","height":"5' 7\" (1.7 m)","bio":"At the age of 12, James was first called \"James Deen\" due to the way he smoked. As a teenager he listened to an interview with Jenna Jameson on the nationally syndicated radio program, \"Loveline.\" When a male caller asked Jenna how he could become a porn star. She responded that he needed to be able to masturbate in a room full of 20 of his best friends. Taking this advice to heart, James began having sex at parties and Raves. He credits this exhibitionist behavior with helping him perform in front of the camera. At the age of 17, James was attending a community college in Pasadena. While there, he decided to break into the adult film industry by meeting girls who had connections to the porn industry. Through these connections, James was introduced to Pamela Peaks who helped him choose his old nickname as his stage name (other options included Clint Cullingus). Deen was represented at that time by World Modeling. However, it was difficult for him to find work due to only being 18 and having no on-screen experience. Deen's first big break came in 2004 when Eon McKai cast him in Art School Sluts (2004). During the first year of his adult film career, James Deen worked on nearly 500 scenes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAzMzI5MDleQTJeQWpwZ15BbWU3MDY0NDE3MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1776976","name":"James Deen","idIMDB":"nm1776976"},"actorId":"nm1776976","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franziska Duff","urlProfile":"http://www.imdb.com/name/nm3066888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjZjY2IzZjItOGI5My00NjM4LTljYWUtOWZlYTQzYmVjMWM2L2ltYWdlXkEyXkFqcGdeQXVyNzE4MTQyMDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1989","placeOfBirth":" Bavaria, Germany","birthName":"Franziska Fischer","height":"5' 6¼\" (1.68 m)","bio":"Franziska Duff was born in Bayreuth Germany August 28, 1989. After moving to America at the age of eight she quickly adapted to the American ways. By the time she was 18 years old she was determined to be the next Club Jenna contract girl. By her 19th birthday she had appeared in dozens of top men's mags, including \"Penthouse\" and \"Hustler\". After getting into the adult industry she knew she wanted to produce her own movies and her passion lead her a different direction. By 2009 she was the first all girl adult film star to land a contract with Elite Models. After gracing numerous main stream magazine covers and Miami's fashion week runways, she was drawn back to producing erotic films for X-Art.com. While she is still sometimes found in the world of fashion her main focus is in the world of erotica where you can find her as director/ producer for the erotic empire X-Art.com. On October 13, 2014 Colette Field & Franziska Duff went on New York's Howard Stern show in which they were an instant hit. In 2015 Franziska was the \"right hand man\" to Colette Field as they started Colette.com; a so called hard core version of X-Art.com.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjZjY2IzZjItOGI5My00NjM4LTljYWUtOWZlYTQzYmVjMWM2L2ltYWdlXkEyXkFqcGdeQXVyNzE4MTQyMDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3066888","name":"Franziska Duff","idIMDB":"nm3066888"},"actorId":"nm3066888","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Manuel Ferrara","urlProfile":"http://www.imdb.com/name/nm1279296","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDQyODAwN15BMl5BanBnXkFtZTcwMzc1MDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1975","placeOfBirth":" Gagny, Seine-Saint-Denis, France","birthName":"Manuel Jeannin","height":"6' (1.83 m)","bio":"Manuel Ferrara was born on November 1, 1975 in Gagny, Seine-Saint-Denis, France as Manuel Jeannin. He is an actor and director. He is married to Kayden Kross. They have one child. He was previously married to Dana Vespoli.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDQyODAwN15BMl5BanBnXkFtZTcwMzc1MDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1279296","name":"Manuel Ferrara","idIMDB":"nm1279296"},"actorId":"nm1279296","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jesse Jane","urlProfile":"http://www.imdb.com/name/nm1377478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjQ0NzQyN15BMl5BanBnXkFtZTcwNDk4MjIzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1980","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Cindy Taylor","height":"5' 3\" (1.6 m)","bio":"A \"military brat\", Jesse Jane grew up on military bases and was somewhat of a tomboy. She combined her love of sports with her long training in dance and became a top cheerleader in high school. After graduation she began doing TV commercials, including one for the \"Hooters\" restaurant chain. She won several \"Hawaiian Tropics\" beauty contests and managed to snag a role in Baywatch: Hawaiian Wedding (2003). She was named \"Miss Photogenic\" by the American Dreams Pageant, and soon afterwards embarked on a career as a top bikini model. Her desire to break into the film business led her to sign a contract with adult-film production company Digital Playground. The films the company put her in have proved extremely popular, as has her line of sex toys. Her films have been nominated for numerous AVN awards, as has she herself, and in 2004 AFW put her on the cover of its directory.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjQ0NzQyN15BMl5BanBnXkFtZTcwNDk4MjIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1377478","name":"Jesse Jane","idIMDB":"nm1377478"},"actorId":"nm1377478","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vanessa Leon","urlProfile":"http://www.imdb.com/name/nm3141184","urlPhoto":"","biography":{"dateOfBirth":"1 June 1987","placeOfBirth":" San Jose, California, USA","birthName":"Jasmine Anderson","height":"5' 1¾\" (1.57 m)","bio":"Tiny (5'2\"), but buxom, comely, and shapely brunette knockout Vanessa Leon was born Jasmine Anderson on June 1, 1987 in San Jose, California. She's of Mexican and Native American descent. Vanessa grew up in Mesa, Arizona. Leon first began performing in explicit hardcore movies at age 21 in July, 2008. Vanessa has appeared in X-rated features for such companies as Vivid, 3rd Degree, Wicked Pictures, Zero Tolerance, Bang Productions, Red Light District, and Kick Ass Pictures. Moreover, Leon not only has several tattoos, but also has piercings in her navel, clitoris, and both nipples.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3141184","name":"Vanessa Leon","idIMDB":"nm3141184"},"actorId":"nm3141184","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kerry Louise","urlProfile":"http://www.imdb.com/name/nm3528574","urlPhoto":"","biography":{"dateOfBirth":"26 April 1986","placeOfBirth":" Lincolnshire, England, UK","height":"5' 6¼\" (1.68 m)","bio":"Bxom and shapely brunette knockout Kerry Louise was born on April 26, 1986 in Nottingham, England. Louise worked as a customer advisor in a bank prior to starting out in the adult entertainment industry as a glamor model in 2004. Kerry went on to become a stripper prior to filming her first hardcore scene for the UK-based adult website Killergram in February, 2009. Louise not only has worked for such adult websites as Brazzers, Twistys, Bang Bros., Reality Kings, and Naughty America, but also has worked as an escort in England. Kerry announced her retirement from the sex industry in January, 2011. She was nominated for an AVN Award for Best Group Sex Scene that same year.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3528574","name":"Kerry Louise","idIMDB":"nm3528574"},"actorId":"nm3528574","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Nails","urlProfile":"http://www.imdb.com/name/nm1256007","urlPhoto":"","biography":{"dateOfBirth":"29 April 1982","placeOfBirth":" Phoenix, Arizona, USA","height":"6' (1.83 m)","bio":"Scott Nails was born on April 29, 1982 in Phoenix, Arizona, USA. He is an actor.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1256007","name":"Scott Nails","idIMDB":"nm1256007"},"actorId":"nm1256007","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1657907","urlIMDB":"http://www.imdb.com/title/tt1657907","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.6","filmingLocations":[],"awards":[],"votes":"16","type":"Video","companyCreditsSimple":[],"keywords":{"keywords":["facial","oral sex","female masturbation","hardcore","sex"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:00:45"}}