{"data":{"movies":[{"title":"Diary of a Sergeant","originalTitle":"","year":"1945","releaseDate":"1945","directors":[{"name":"Joseph M. Newman","id":"nm0628149"}],"writers":[],"runtime":"22 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODUyMjE2NV5BMl5BanBnXkFtZTgwNTQ2NDAyODE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary","Short"],"plot":"Harold Russell, an American soldier who lost his hands in a training accident, tells the story of his medical rehabilitation at Walter Reed Army Medical Center in Washington DC, how he and his fellow amputees at the hospital at first despaired and then found new hope in the prostheses and training available to amputees through the Army's medical corps. Russell learns to wear and to operate the hooks which replace his hands and becomes competent to perform many tasks he had once thought no longer possible. Discharged from the Army, he is welcomed into Boston College by college president William J. Murphy, S.J.","simplePlot":"Harold Russell, an American soldier who lost his hands in a training accident, tells the story of his medical rehabilitation at Walter Reed Army Medical Center in Washington DC, how he and ... ","actors":[{"actorName":"Alfred Drake","urlProfile":"http://www.imdb.com/name/nm0236848","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdlZThlOTUtYjIwZC00YmRkLTlhOTYtMDZmY2VlNWUxNjY4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1914","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Alfred Capurro","bio":"One of Broadway's most venerable, respected musical leading men, Alfred Drake created the male leads in \"Oklahoma!\" (1943), \"Kiss Me Kate\" (1949) and \"Kismet\" (1953). Sadly, he re-created none of these roles on screen. Very much a man of his beloved live theater, he never did go to Hollywood, except for the starring role in \"Tars and Spars\" (1946) for Columbia Pictures, a post-war comedy, and for a small role as the President of the Exchange in 1983's \"Trading Places\" (the one who says to Don Ameche \"Mortimer, your brother's not well\"). The 1964 production of \"Hamlet\" in which he played Claudius was filmed live in a Broadway theatre, was made in a new process of the time, (Electronovision) and distributed in movie theaters in the 60s and early 70s. It is available on DVD. And so, apart from those films mentioned, as well as TV appearances both in starring roles and as a guest star in episodic series, his name and art can only live on in the memories of those who saw him work his particular brand of magic on stage during the golden years of the Broadway musical, his performances on Broadway cast albums giving only a partial idea of just how potent that magic was.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdlZThlOTUtYjIwZC00YmRkLTlhOTYtMDZmY2VlNWUxNjY4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236848","name":"Alfred Drake","idIMDB":"nm0236848"},"actorId":"nm0236848","character":"Harold Russell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Russell","urlProfile":"http://www.imdb.com/name/nm0751174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MDYwODgyNl5BMl5BanBnXkFtZTcwNTU4OTQwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1914","placeOfBirth":" North Sydney, Nova Scotia, Canada","birthName":"Harold John Russell","bio":"Harold John Russell was born in Nova Scotia in 1914. His family moved to Cambridge Massachusetts when his father died in 1919. He was training paratroopers at Camp MacKall NC on June 6, 1944 when some TNT he was using exploded in his hands. He lost both hands. After receiving hooks, and training on them, he was chosen to make an Army training film called \"Diary Of A Sergeant\". William Wyler saw the film and decided to cast him in The Best Years of Our Lives (1946). Harold Russell played Homer Parish. For this role he received 2 Oscars, a Best Supporting and one for being an inspiration to all returning veterans. He is the only actor to receive 2 Oscars for the same role. After the movie he attended Boston University. He later went on to help establish AMVETS as a viable alternative to the American Legion for veterans, though his dream of an international veterans organization was never realized. He later appeared in Inside Moves (1980) and Dogtown (1997). He lived with his wife on Cape Cod in Massachusetts. He wrote 2 biographies: \"Victory In My Hands\" (1947) & \"The Best Years Of My Life\" (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MDYwODgyNl5BMl5BanBnXkFtZTcwNTU4OTQwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751174","name":"Harold Russell","idIMDB":"nm0751174"},"actorId":"nm0751174","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1772258","urlIMDB":"http://www.imdb.com/title/tt1772258","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["22 min"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.0","filmingLocations":[{"location":"Army Pictorial Center, Kaufman Astoria Studios - 3412 36th Street, Astoria, Queens, New York City, New York, USA"}],"awards":[],"votes":"21","type":"Movie","companyCreditsSimple":[{"idCompany":"co0152057","name":"United States War Department"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:25:11"}}