{"data":{"movies":[{"title":"Stonehearst Asylum","originalTitle":"Eliza Graves","year":"2014","releaseDate":"20141024","directors":[{"name":"Brad Anderson","id":"nm0026442"}],"writers":[{"name":"Edgar Allan Poe","id":"nm0000590"},{"name":"Joe Gangemi","id":"nm2081303"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg5NjU0MTM4N15BMl5BanBnXkFtZTgwMjU1NDQzMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Horror","Mystery","Thriller"],"plot":"A couple of days before 1899 Christmas, the Oxford new graduate Dr. Edward Newgate arrives at the Stonehearst Asylum to complete training for his specialty of asylum medicine. He is met by armed men who take him to Dr. Silas Lamb, who welcomes his help and takes him under his wing. Edward is shocked to see the methods that Dr Lamb uses to run this asylum. He becomes infatuated with Eliza Graves, one of the patients who is a lady of status and does not seem to belong. One night, Edward overhears a knocking from the bowels of the facility and is shocked to find that everything is not as it seems in this place and that his uneasy feelings may be justified. What will Edward Choose?","simplePlot":"An Oxford graduate takes up a job in a mental asylum, only to discover that the \"revolutionary\" new treatments are inhumane and that there is more going on than meets the eye.","actors":[{"actorName":"Kate Beckinsale","urlProfile":"http://www.imdb.com/name/nm0000295","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1973","placeOfBirth":" Finsbury Park, London, England, UK","birthName":"Kathrin Romany Beckinsale","height":"5' 7\" (1.7 m)","bio":"Kate Beckinsale was born on 26 July 1973 in England, and has resided in London for most of her life. Her mother is Judy Loe, who has appeared in a number of British dramas and sitcoms and continues to work as an actress, predominantly in British television productions. Her father was Richard Beckinsale, born in Nottingham, England. He starred in a number of popular British television comedies during the 1970s, most notably the series Rising Damp (1974), Porridge (1974) and The Lovers (1970). He passed away tragically early in 1979 at the age of 31. Kate attended the private school Godolphin and Latymer School in London for her grade and primary school education. In her teens she twice won the British bookseller W.H. Smith Young Writers' competition - once for three short stories and once for three poems. After a tumultuous adolescence (a bout of anorexia - cured - and a smoking habit which continues to this day), she gradually took up the profession of acting. Her major acting debut came in a TV film about World War II called One Against the Wind (1991), filmed in Luxembourg during the summer of 1991. It first aired on American television that December. Kate began attending Oxford University's New College in the fall of 1991, majoring in French and Russian literature. She had already decided that she wanted to act, but to broaden her horizons she chose university over drama school. While in her first year at Oxford, Kate received her big break in Kenneth Branagh's film adaptation of William Shakespeare's Much Ado About Nothing (1993). Kate worked in three other films while attending Oxford, beginning with a part in the medieval historical drama Royal Deceit (1994), cast as Ethel. The film was shot during the spring of 1993 on location in Denmark, and she filmed her supporting part during New College's Easter break. Later in the summer of that year she played the lead in the contemporary mystery drama Uncovered (1994). Before she went back to school, her third year at university was spent at Oxford's study-abroad program in Paris, France, immersing herself in the French language, Parisian culture and French cigarettes. A year away from the academic community and living on her own in the French capital caused her to re-evaluate the direction of her life. She faced a choice: continue with school or concentrate on her flourishing acting career. After much thought, she chose the acting career. In the spring of 1994 Kate left Oxford, after finishing three years of study. Kate appeared in the BBC/Thames Television satire Cold Comfort Farm (1995), filmed in London and East Sussex during late summer 1994 and which opened to spectacular reviews in the United States, grossing over $5 million during its American run. It was re-released to U.K. theaters in the spring of 1997. Acting on the stage consumed the first part of 1995; she toured in England with the Thelma Holts Theatre Company production of Anton Chekhov's \"The Seagull\". After turning down several mediocre scripts \"and going nearly berserk with boredom\", she waited seven months before another interesting role was offered to her. Her big movie of 1995 was the romance/horror movie Haunted (1995), starring opposite Aidan Quinn and John Gielgud, and filmed in West Sussex. In this film she wanted to play \"an object of desire\", unlike her past performances where her characters were much less the siren and more the worldly innocent. Kate's first film project of 1996 was the British ITV production of Jane Austen's novel Emma (1996). Her last film of 1996 was the comedy Shooting Fish (1997), filmed at Shepperton Studios in London during early fall. She played the part of Georgie, an altruistic con artist. She had a daughter, Lily, in 1999 with actor Michael Sheen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY2MDYwOF5BMl5BanBnXkFtZTcwODQ3MDA0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000295","name":"Kate Beckinsale","idIMDB":"nm0000295"},"actorId":"nm0000295","character":"Eliza Graves","urlCharacter":"http://www.imdb.com/character/ch0376561","main":true},{"actorName":"Jim Sturgess","urlProfile":"http://www.imdb.com/name/nm0836343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU0NTE0NDYwOF5BMl5BanBnXkFtZTcwMDc2MDI3Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1978","placeOfBirth":" London, England, UK","birthName":"James Anthony Sturgess","height":"6' 0½\" (1.84 m)","bio":"Jim was born in London, the son of Jane O. (Martin) and Peter J. S. Sturgess. He was raised in Surrey. First and foremost his interest was music. However, he began to develop a secret passion for acting, at age 8, when he auditioned for local theatre to get out of class. Whilst music appeared cool, he felt being in school plays wasn't. So he stuck with small parts, despite a yearning to be in the lead role. At age 15, he joined a band and they began lying about their ages to play gigs in pubs. At school, he received mostly low grades with the exception of music and drama. For college, he moved to Salford because there was a lot of good music coming out of the Manchester scene. In the hopes of joining a new band, he undertook a Higher National Diploma in Media Performance at Salford University. It was here that he met people that were really interested in filmmaking, and it suddenly felt like a possible career move. He began making short films with his friends and as well as doing theater. He wrote and performed a one-man show, which led an actor in the audience to suggest Jim to his agent. The agent signed him without even meeting him. Jim moved back to London in 2000, where he joined the band 'Saint Faith'. He had moved to Manchester to join a band, and instead fell into acting. He moved back to London for acting, and ended up joining a band. He took small roles on television to fund his life as a musician. Problems began in the band in 2006, and Jim heard of an audition for the musical film Across the Universe (2007). He won the leading male role of Jude. He followed this film with The Other Boleyn Girl (2008) with Natalie Portman and Scarlett Johansson. His breakthrough role came with Dexter in One Day (2011), based on the bestselling book by David Nicholls. Before his audition, Jim hadn't read the book.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU0NTE0NDYwOF5BMl5BanBnXkFtZTcwMDc2MDI3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0836343","name":"Jim Sturgess","idIMDB":"nm0836343"},"actorId":"nm0836343","character":"Edward Newgate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Thewlis","urlProfile":"http://www.imdb.com/name/nm0000667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA3MjM4NTE0NV5BMl5BanBnXkFtZTcwOTU1OTY4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1963","placeOfBirth":" Blackpool, Lancashire, England, UK","birthName":"David Wheeler","height":"6' 2½\" (1.89 m)","bio":"David Thewlis was born David Wheeler in 1963 in Blackpool, Lancashire, to Maureen (Thewlis) and Alec Raymond Wheeler, and lived with his parents above their combination wallpaper and toy shop during his childhood. Originally, he came to London with his band Door 66, however he changed his plans and entered Guildhall School of Drama. He had minor roles in films and TV until he took the main role in Naked (1993). The film won him several awards including the New York Critics Award. He has since been in many other films including DragonHeart (1996), Restoration (1995), Black Beauty (1994) and recently took the part of Professor Remus John Lupin in Harry Potter and the Prisoner of Azkaban (2004). He has lived with the British actress Anna Friel since 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA3MjM4NTE0NV5BMl5BanBnXkFtZTcwOTU1OTY4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000667","name":"David Thewlis","idIMDB":"nm0000667"},"actorId":"nm0000667","character":"Mickey Finn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brendan Gleeson","urlProfile":"http://www.imdb.com/name/nm0322407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3NTMxODI0OTBeQTJeQWpwZ15BbWU3MDQ1NTY5Mjc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1955","placeOfBirth":" Dublin, Ireland","height":"6' 2\" (1.88 m)","bio":"Brendan Gleeson was born in Dublin, Ireland, to Pat and Frank Gleeson. From a very young age, he loved to learn, especially reading classical text in and outside the classroom. He took great attention to Irish play writers such as Samuel Beckett, which eventually led to him performing in his high school play production of \"Waiting for Godot\", and paying great attention to detail in his high school drama classes. Upon finishing 12th grade, he spent a couple of years with the Dublin Shakespeare Festival, and under the advice of a director there, headed across to London and auditioned for drama schools. Soon to follow, he was invited to audition for the Royal Shakespeare Company in Stratford upon Avon, and spent a couple of seasons back in England on the stage. He then, at the age of thirty five, decided to audition for films in the UK and began to build a very respectable resume playing many different diverse characters. He made his debut as a quarryman in The Field (1990). He had several small roles in major Hollywood movies based in Ireland, such as Far and Away (1992) and Le cheval venu de la mer (1992). Memorably played historical Irish figure \"Michael Collins\" in The Treaty (1991). Made his breakthrough in Scottish themed Braveheart (1995), which was largely filmed in Ireland, opposite Mel Gibson. He played Gibson's right-hand man \"Hamish\". Since then, he has appeared in numerous major films such as Mission: Impossible II (2000), Lake Placid (1999), Turbulence (1997). He has made a name for himself taking the titular role in The General (1998), based on the life of Irish criminal \"Martin Cahill\", for which he won the Boston Society of Film Critics Award. He appears in director John Boorman's film The Tailor of Panama (2001) as well as Martin Scorsese's Gangs of New York (2002) and Steven Spielberg's A.I. Artificial Intelligence (2001). Ever since, he has continued to bring his huge stage presence to the screen, always delivering the character in full development to his audience. He is married to his lovely wife, Mary, since 1982. They have four sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3NTMxODI0OTBeQTJeQWpwZ15BbWU3MDQ1NTY5Mjc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322407","name":"Brendan Gleeson","idIMDB":"nm0322407"},"actorId":"nm0322407","character":"The Alienist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Kingsley","urlProfile":"http://www.imdb.com/name/nm0001426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1943","placeOfBirth":" Scarborough, Yorkshire, England, UK","birthName":"Krishna Bhanji","height":"5' 8\" (1.73 m)","bio":"Ben Kingsley was born Krishna Bhanji on December 31, 1943 in Scarborough, Yorkshire, England. His father, Rahimtulla Harji Bhanji, was a Kenyan-born medical doctor, of Gujarati Indian descent, and his mother, Anna Lyna Mary (Goodman), was an English actress. Ben began to act in stage plays during the 1960s. He soon became a successful stage actor, and also began to have roles in films and television. His birth name was Krishna Bhanji, but he changed his name to \"Ben Kingsley\" soon after gaining fame as a stage actor, fearing that a foreign name could hamper his acting career. Kingsley first earned international fame for his performance in the drama movie Gandhi (1982). His performance as Mohandas K. Gandhi earned him international fame. He won many awards - including an Academy Award for Best Actor. He also won Golden Globe, BAFTA and London Film Critics' Circle Awards. After acting in Gandhi (1982), Ben was recognized as one of the finest British actors. After his international fame for appearing in Gandhi (1982), Kingsley appeared in many other famous movies. His success as an actor continued. His performance as Itzhak Stern in the drama movie Schindler's List (1993) earned him a BAFTA nomination. Schindler's List (1993) won seven Academy Awards, including Best Picture. During the late 1990s, Kingsley acted in many successful movies. He played Sweeney Todd in the television movie The Tale of Sweeney Todd (1997). For his performance in this movie, he was nominated for the Screen Actors' Guild Award. His other notable role was as Otto Frank in the television movie Anne Frank (2001), for which he won a Screen Actors' Guild Award. In 2002, Kingsley was appointed Knight Bachelor of the Order of the British Empire in the Queen's New Years Honours for his services to drama. In 2013, he received the BAFTA Los Angeles Britannia Award for Worldwide Contribution to Filmed Entertainment. That same year, he also received the Fellowship Award at the Asian Awards in London, England. Ben Kingsley currently resides in Spelsbury, Oxfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001426","name":"Ben Kingsley","idIMDB":"nm0001426"},"actorId":"nm0001426","character":"Silas Lamb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Caine","urlProfile":"http://www.imdb.com/name/nm0000323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1933","placeOfBirth":" Rotherhithe, London, England, UK","birthName":"Maurice Joseph Micklewhite","height":"6' 1\" (1.85 m)","bio":"Michael Caine was born Maurice Joseph Micklewhite in London, to Ellen Frances Marie (Burchell), a charlady, and Maurice Joseph Micklewhite, a fish-market porter. He left school at 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit, \"The Long and the Short and the Tall.\" Zulu (1964), the 1964 epic retelling of a historic 19th-century battle in South Africa between British soldiers and Zulu warriors, brought Caine to international attention. Instead of being typecast as a low-ranking Cockney soldier, he played a snobbish, aristocratic officer. Although \"Zulu\" was a major success, it was the role of Harry Palmer in The Ipcress File (1965) and the title role in Alfie (1966) that made Caine a star of the first magnitude. He epitomized the new breed of actor in mid-'60s England, the working-class bloke with glasses and a down-home accent. However, after initially starring in some excellent films, particularly in the 1960s, including Gambit (1966), Funeral in Berlin (1966), Play Dirty (1969), Battle of Britain (1969), Too Late the Hero (1970), The Last Valley (1971) and especially Get Carter (1971), he seemed to take on roles in below-average films, simply for the money he could by then command. There were some gems amongst the dross, however. He gave a magnificent performance opposite Sean Connery in The Man Who Would Be King (1975) and turned in a solid one as a German colonel in The Eagle Has Landed (1976). Educating Rita (1983) and Hannah and Her Sisters (1986) (for which he won his first Oscar) were highlights of the 1980s, while more recently Little Voice (1998), The Cider House Rules (1999) (his second Oscar) and Last Orders (2001) have been widely acclaimed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000323","name":"Michael Caine","idIMDB":"nm0000323"},"actorId":"nm0000323","character":"Benjamin Salt","urlCharacter":"http://www.imdb.com/character/ch0504371","main":true},{"actorName":"Jason Flemyng","urlProfile":"http://www.imdb.com/name/nm0002076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjUxNTk5MV5BMl5BanBnXkFtZTcwOTE0OTEyOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1966","placeOfBirth":" Putney, London, England, UK","birthName":"Jason Iain Flemyng","height":"6' 1\" (1.85 m)","bio":"Jason Flemyng was born on September 25, 1966 in Putney, London, England as Jason Iain Flemyng. He is an actor, known for Lock, Stock and Two Smoking Barrels (1998), The Curious Case of Benjamin Button (2008) and Snatch (2000). He has been married to Elly Fairman since June 6, 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjUxNTk5MV5BMl5BanBnXkFtZTcwOTE0OTEyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002076","name":"Jason Flemyng","idIMDB":"nm0002076"},"actorId":"nm0002076","character":"Swanwick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sophie Kennedy Clark","urlProfile":"http://www.imdb.com/name/nm4080531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDU1NTY3OV5BMl5BanBnXkFtZTcwNjQ5MDY1OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 6½\" (1.69 m)","bio":"Sophie Kennedy Clark was born in Aberdeen, Aberdeenshire, Scotland. She is an actress, known for Philomena (2013), Nymphomaniac - Volume 1 (2013) and Nymphomaniac - Volume 2 (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDU1NTY3OV5BMl5BanBnXkFtZTcwNjQ5MDY1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4080531","name":"Sophie Kennedy Clark","idIMDB":"nm4080531"},"actorId":"nm4080531","character":"Millie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sinéad Cusack","urlProfile":"http://www.imdb.com/name/nm0193661","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MzIwNTkwNF5BMl5BanBnXkFtZTcwNzE0NTQwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1948","placeOfBirth":" Dalkey, Ireland","birthName":"Jane Moira Cusack","height":"5' 5\" (1.65 m)","bio":"Sinéad Cusack was born on February 18, 1948 in Dalkey, Ireland as Jane Moira Cusack. She is an actress, known for V for Vendetta (2005), Eastern Promises (2007) and Beauté volée (1996). She has been married to Jeremy Irons since March 28, 1978. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MzIwNTkwNF5BMl5BanBnXkFtZTcwNzE0NTQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0193661","name":"Sinéad Cusack","idIMDB":"nm0193661"},"actorId":"nm0193661","character":"Mrs. Pike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edmund Kingsley","urlProfile":"http://www.imdb.com/name/nm0455511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzcwMjY4Nl5BMl5BanBnXkFtZTgwNTc1OTI5MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1982","placeOfBirth":" Leamington Spa, Warwickshire, England, UK","height":"6' 2\" (1.88 m)","bio":"Edmund Kingsley was born on July 5, 1982 in Leamington Spa, Warwickshire, England. He is an actor, known for Hugo (2011), Capsule (2015) and Stonehearst Asylum (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzcwMjY4Nl5BMl5BanBnXkFtZTgwNTc1OTI5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455511","name":"Edmund Kingsley","idIMDB":"nm0455511"},"actorId":"nm0455511","character":"Charles Graves","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Hands","urlProfile":"http://www.imdb.com/name/nm0359654","urlPhoto":"","biography":{"bio":"Robert Hands is an actor, known for Stonehearst Asylum (2014), Shine (1996) and Charlotte Gray (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0359654","name":"Robert Hands","idIMDB":"nm0359654"},"actorId":"nm0359654","character":"Elegant Lady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ciara Flynn","urlProfile":"http://www.imdb.com/name/nm4221569","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0OTM2NDA0OV5BMl5BanBnXkFtZTgwNDAyMzM2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1992","placeOfBirth":" San Mateo County, California, USA","birthName":"Ciara Rose Elise Flynn","height":"5' 7\" (1.7 m)","bio":"Ciara (kee-ar-ah) Flynn was born in the San Francisco Bay Area to parents Dennis and Lois Flynn. The family later moved to Boston, MA and then to Austin, TX. Her heritage is Irish, German and English. Ciara began acting at the age of 12 when she joined a youth theater company in her area. Through them, she was referred to and later cast twice in leading roles for Austin Shakespeare's \"Young Shakespeare\" program for their inaugural season and their subsequent one. She transitioned into film while still in Austin, and upon the completion of the lead role in \"Lumberjack Man\", moved to Los Angeles. There she continues to be seen regularly in independent film, television and commercials, focusing on character and dramatic roles. When she is not on set, you can find her with her partner in crime, a woolly Siberian Husky named Sakura.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0OTM2NDA0OV5BMl5BanBnXkFtZTgwNDAyMzM2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4221569","name":"Ciara Flynn","idIMDB":"nm4221569"},"actorId":"nm4221569","character":"Farmer's Daughter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Fulford","urlProfile":"http://www.imdb.com/name/nm0298089","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTljNDZjNGUtM2E3MC00NWNhLTk5OGEtZDJhMGY4OGI1ODJkXkEyXkFqcGdeQXVyMTk2MTE5ODY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1955","placeOfBirth":" London, England, UK","height":"5' 10\" (1.78 m)","bio":"Fair haired British character actor Christopher Fulford has been a recognizable face on British TV and film for over 20 years in a variety of roles. Most recently he's appeared in the BBC series Servants (2003) as the master butler and in Courtroom drama The Brief (2004). He's appeared in many character driven roles on TV, usually in crime dramas such as A Touch of Frost (1992), Inspector Morse (1987), Silent Witness (1996), and Wire in the Blood (2002). Memorably he appeared as a suspected child murderer in Cracker (1993), a film which had a brilliant twist in the finale. He's also appeared in many films, such as Jack the Ripper (1988), Resurrected (1989), Hotel (2001) and Eye See You (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTljNDZjNGUtM2E3MC00NWNhLTk5OGEtZDJhMGY4OGI1ODJkXkEyXkFqcGdeQXVyMTk2MTE5ODY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298089","name":"Christopher Fulford","idIMDB":"nm0298089"},"actorId":"nm0298089","character":"Paxton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Dallmeyer","urlProfile":"http://www.imdb.com/name/nm0198108","urlPhoto":"","biography":{"dateOfBirth":"10 January 1945","placeOfBirth":" Boswells, Scotland, UK","bio":"Andrew is a Scottish playwright credited with over 75 plays, a theatre director of more than 50 productions, and an actor. He has performed in every theatre in Scotland except Pitlochry. His notable works include \"Opium Eaters\", \"Hello Dali\" and \"Shadow On The Earth\" (BBC). Another notable production, \"Wanted Dead Or Alive\", earned him a death threat. His plays have won a Scottish BAFTA-equivalent and have featured on BBC Radio as well as in America. His favourite quote is the from reviewer who described his portrayal of Tartouffe as, \"Touched by genius\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0198108","name":"Andrew Dallmeyer","idIMDB":"nm0198108"},"actorId":"nm0198108","character":"Jeremiah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guillaume Delaunay","urlProfile":"http://www.imdb.com/name/nm2297450","urlPhoto":"","biography":{"height":"6' 9\" (2.06 m)","bio":"Guillaume Delaunay is an actor, known for Stonehearst Asylum (2014), Victor Frankenstein (2015) and Age of Uprising: The Legend of Michael Kohlhaas (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDA3MjcwMl5BMl5BanBnXkFtZTgwMzk2OTIxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2297450","name":"Guillaume Delaunay","idIMDB":"nm2297450"},"actorId":"nm2297450","character":"Arthur Timbs","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1772264","urlIMDB":"http://www.imdb.com/title/tt1772264","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"7,125","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"24","month":"06","year":"2013","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 52 min (112 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.8","metascore":"52","filmingLocations":[{"location":"Bulgaria"}],"rated":"PG-13","awards":[{"award":"Motion Picture Sound Editors, USA 2015","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Direct to Video - Live Action","names":[{"name":"Lon Bender","id":"nm0070489","role":"supervising sound editor, sound designer"},{"name":"William R. Dean","id":"nm1192908","role":"supervising sound editor"},{"name":"Kris Fenske","id":"nm0271987","role":"sound designer"},{"name":"Rachel Chancey","id":"nm0151265","role":"supervising foley editor"},{"name":"Bobbi Banks","id":"nm0052100","role":"supervising dialogue editor, supervising adr editor"},{"name":"Ryan Collison","id":"nm0172810","role":"foley artist"},{"name":"Patrick Cicero","id":"nm0162031","role":"sound effects editor"},{"name":"Dino Dimuro","id":"nm0227491","role":"sound effects editor"},{"name":"Hector C. Gika","id":"nm0317696","role":"sound effects editor"},{"name":"Allan Zaleski","id":"nm0952411","role":"sound effects editor"},{"name":"David Raines","id":"nm1547647","role":"sound effects editor"},{"name":"John Carbonara","id":"nm0136134","role":"supervising music editor"},{"name":"Chad Birmingham","id":"nm0083650","role":"supervising music editor"}]}]}]}],"votes":"38,393","type":"Movie","companyCreditsSimple":[{"idCompany":"co0073417","name":"Icon Productions"},{"idCompany":"co0086773","name":"Sobini Films"}],"keywords":{"keywords":["madhouse","mental institution","asylum","mental asylum","patient","woman","ballroom dancing","medical demonstration","love at first sight","derringer","tuscany italy","impersonating a doctor","inmate running an asylum","man in a wheelchair","man wearing an eyepatch","playing chess","stagecoach","man wearing a top hat","attempted suicide","wounded soldier","hospital fire","empathy","tied to a table","immolation","new year countdown","century's eve","fistfight","strangled","mercy killing","mental patient","hot box","drenched with water","sprayed with water","cliff","fall to death","climbing down a ladder","smoking a pipe","spilling a drink","squirrel dinner","reference to charles dickens","original composition","reference to ludwig van beethoven","reference to wolfgang amadeus mozart","camera shot of hand","music therapy","dancing","grand piano","playing piano","phonograph","family embarassment","heir","hospital rounds","finger stuck","human skull","frog legs","kicked in the shin","based on a short story","alienist","woman in a wheelchair","convulsion","high on drugs","medical school","1800s","electroconvulsive therapy","reference to edgar allan poe","hysteria","insane asylum","fight","escape","dying","feast","secluded institution","england","gothic","macabre","stolen identity","sociopath","insanity","nurse","burning to death","prisoner","inmate","take over","swearing","mental illness","love","trauma trigger","mindwipe","cell","infatuation","pretending to be someone else","sleeping powder","killer","suicide","strangled to death","murder","torture","primitive medicine","psychiatrist","madman","year 1899","based on short story","plot twist"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:21:43"}}