{"data":{"movies":[{"title":"Before I Go to Sleep","originalTitle":"","year":"2014","releaseDate":"20141031","directors":[{"name":"Rowan Joffe","id":"nm0423626"}],"writers":[{"name":"Rowan Joffe","id":"nm0423626"},{"name":"S.J. Watson","id":"nm4081356"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI0NTAwMTU1NV5BMl5BanBnXkFtZTgwNzkwNjQ0MjE@._V1.jpg","countries":["UK","USA","France","Sweden"],"languages":["English"],"genres":["Drama","Mystery","Thriller"],"plot":"Forty-year-old Christine Lucas wakes up in bed with a man she does not know, in an unfamiliar house. The man explains that he is her husband, Ben, and that she suffered brain damage from a car accident ten years earlier. Christine wakes up every morning with no memory of her life from her early twenties onwards. Christine receives treatment from Dr. Nasch, a neurologist at a local hospital who provides her a camera to record her thoughts and progress each day, and calls her every morning to remind her to watch the video in the camera. Soon, she starts to discover the truth around her.","simplePlot":"A woman wakes up every day, remembering nothing as a result of a traumatic accident in her past. One day, new terrifying truths emerge that force her to question everyone around her.","actors":[{"actorName":"Nicole Kidman","urlProfile":"http://www.imdb.com/name/nm0000173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1967","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Nicole Mary Kidman","height":"5' 11\" (1.8 m)","bio":"Elegant blonde Nicole Kidman, known as one of Hollywood's top Australian imports, was actually born in Honolulu, Hawaii, while her Australian parents were there on educational visas. Kidman is the daughter of Janelle Ann (Glenny), a nursing instructor, and Antony David Kidman, a biochemist and clinical psychologist. She is of English, Irish, and Scottish descent. Shortly after her birth, the family moved to Washington, D.C., where Nicole's father pursued his research on breast cancer, and then, three years later, made the pilgrimage back to her parents' native Sydney in Australia, where Nicole was raised. Young Nicole's first love was ballet, but she eventually took up mime and drama as well (her first stage role was a bleating sheep in an elementary school Christmas pageant). In her adolescent years, acting edged out the other arts and became a kind of refuge -- as her classmates sought out fun in the sun, the fair-skinned Kidman retreated to dark rehearsal halls to practice her craft. She worked regularly at the Philip Street Theater, where she once received a personal letter of praise and encouragement from audience member Jane Campion (then a film student). Kidman eventually dropped out of high school to pursue acting full-time. She broke into movies at age 16, landing a role in the Australian holiday favorite Bush Christmas (1983). That appearance touched off a flurry of film and television offers, including a lead in Le gang des BMX (1983) and a turn as a schoolgirl-turned-protester in the miniseries Vietnam (1987) (for which she won her first Australian Film Institute Award). With the help of an American agent, she eventually made her US debut opposite Sam Neill in the at-sea thriller Calme blanc (1989). Kidman's next casting coup scored her more than exposure. While starring as Tom Cruise's doctor/love interest in the racetrack romance Days of Thunder (1990), she won over the Hollywood hunk hook, line and sinker. After a whirlwind courtship (and decent box office returns), the couple wed on December 24, 1990. Determined not to let her new marital status overshadow her fledgling career, the actress pressed on. She appeared as a catty high school senior in the Australian film Flirting (1991), then as Dustin Hoffman's moll in the gangster flick Billy Bathgate (1991). She reunited with Cruise for Far and Away (1992), the story of young Irish lovers who flee to America in the late 1800s, and starred opposite Michael Keaton in the tear-tugger My Life (1993). Despite her steady employment, critics and moviegoers still had not quite warmed to Kidman as a leading lady. She tried to spice up her image by seducing Val Kilmer in Batman Forever (1995), but achieved her real breakthrough with Gus Van Sant's To Die For (1995). As a fame-crazed housewife determined to eliminate any obstacle in her path, Kidman proved that she had an impressive range and deadly comic timing. She took home a Golden Globe and several critics' awards for the performance. In 1996, Kidman stepped into a corset to work with her countrywoman and onetime admirer, Jane Campion, on the adaptation of Henry James's The Portrait of a Lady (1996). A few months later, she tore across the screen as a nuclear weapons expert in The Peacemaker (1997), adding \"action star\" to her professional repertoire. She and Cruise then disappeared into a notoriously long, secretive shoot for Stanley Kubrick's sexual thriller Eyes Wide Shut (1999). The couple's on-screen shenanigans prompted an increase in public speculation about their sex life (rumors had long been circulating that their marriage was a cover-up for Cruise's homosexuality); tired of denying tabloid attacks, they successfully sued The Star for a story alleging that they needed a sex therapist to coach them through love scenes. Family life has always been a priority for Kidman. Born to social activists (mother was a feminist; father, a labor advocate), Nicole and her little sister, Antonia Kidman, discussed current events around the dinner table and participated in their parents' campaigns by passing out pamphlets on street corners. When her mother was diagnosed with breast cancer, 17-year-old Nicole stopped working and took a massage course so that she could provide physical therapy (her mother eventually beat the cancer). She and Cruise adopted two children: Isabella Jane (born 1993) and Connor Antony (born 1995). Despite their rock-solid image, the couple announced in early 2001 that they were separating due to career conflicts. Her marriage to Cruise ended mid-summer of 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000173","name":"Nicole Kidman","nicknames":["Nic"],"idIMDB":"nm0000173"},"actorId":"nm0000173","character":"Christine","urlCharacter":"http://www.imdb.com/character/ch0401622","main":true},{"actorName":"Colin Firth","urlProfile":"http://www.imdb.com/name/nm0000147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDMwMTI4MF5BMl5BanBnXkFtZTcwMzE2MzQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1960","placeOfBirth":" Grayshott, Hampshire, England, UK","birthName":"Colin Andrew Firth","height":"6' 1½\" (1.87 m)","bio":"Colin Andrew Firth was born into an academic family in Grayshott, Hampshire, England. His mother, Shirley Jean (Rolles), was a comparative religion lecturer at the Open University, and his father, David Norman Lewis Firth, lectured on history at Winchester University College (formerly King Alfred's College) in Winchester, and worked on education for the Nigerian government. His grandparents were missionaries. His siblings Katie Firth and Jonathan Firth are also actors. Firth's first acting experience came in infant's school when he played \"Jack Frost\" in a Christmas pantomime. Three of his four grandparents were Methodist missionaries and he spent his early childhood in Nigeria, returning to England at age five where he entered a comprehensive school in Winchester. He spent two years at the Drama Centre London in Chalk Farm where he was \"discovered\" while playing \"Hamlet\" during his final term. His first professional role was as \"Bennet\" in the West End production of \"Another Country\". From this performance, he was chosen to play the character of \"Judd\" in the movie of the play. He went on to play a variety of character parts in both film and television. For his portrayal of \"Robert Lawrence\" in the 1989 TV production Tumbledown (1988), he received the Royal Television Society Best Actor award and also a BAFTA nomination. He also received a BAFTA nomination for \"Mr. Darcy\" in the 1995 TV version of Pride and Prejudice (1995). In 2011, he won the Oscar for Best Actor for his commanding leading role, playing British King George VI in The King's Speech (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDMwMTI4MF5BMl5BanBnXkFtZTcwMzE2MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000147","name":"Colin Firth","idIMDB":"nm0000147"},"actorId":"nm0000147","character":"Ben","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Strong","urlProfile":"http://www.imdb.com/name/nm0835016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzAyMDc2NTheQTJeQWpwZ15BbWU3MDUzNTQyNjg@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1963","placeOfBirth":" London, England, UK","birthName":"Marco Giuseppe Salussolia","height":"6' 2\" (1.88 m)","bio":"British actor Mark Strong, who played Jim Prideaux in the 2011 remake of La taupe (2011), is often cast as cold, calculating villains. But before he became a famous actor, he intended to pursue a career in law. Strong was born Marco Giuseppe Salussolia in London, England, to an Austrian mother and an Italian father. His father left the family not long after he was born, and his mother worked as an au pair to raise the boy on her own. Strong's mother had his name legally changed when he was young in order to help him better assimilate with his peers. Strong attended Wymondham College in Norfolk, and studied at the university level in Munich with the intent of becoming a lawyer. After a year, he returned to London to study English and Drama at Royal Holloway. He went on to further master his craft of at Bristol Old Vic Theatre School. Although Americans are most familiar with Strong's roles as Sinestro in Green Lantern (2011), mob boss Frank D'Amico in Kick-Ass (2010), and Lord Blackthorn in Sherlock Holmes (2009), British audiences know him from his long history as a television actor. He also starred in as numerous British stage productions, including plays at the Royal National Theatre and the RSC. His most prominent television parts include Prime Suspect 3 (1993) and Prime Suspect 6: The Last Witness (2003) as Inspector Larry Hall, and starring roles in the BBC Two dramas Our Friends in the North (1996) and The Long Firm (2004), the latter of which netted Strong a BAFTA nomination. He also played Mr. Knightley in the 1996 adaptation of Jane Austen's classic tale Emma (1996). Strong resides in London with his wife Liza Marshall, with whom he has two sons, the younger of which is the godson of his longtime friend Daniel Craig.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzAyMDc2NTheQTJeQWpwZ15BbWU3MDUzNTQyNjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835016","name":"Mark Strong","idIMDB":"nm0835016"},"actorId":"nm0835016","character":"Dr. Nasch","urlCharacter":"http://www.imdb.com/character/ch0463957","main":true},{"actorName":"Ben Crompton","urlProfile":"http://www.imdb.com/name/nm0174005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzg0NjYwOV5BMl5BanBnXkFtZTgwMjgyMjE3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1974","placeOfBirth":" Stockport, Greater Manchester, England, UK","height":"5' 6¼\" (1.68 m)","bio":"Ben Crompton was born in 1974 in Stockport, Greater Manchester, England. He is known for his work on Before I Go to Sleep (2014), Game of Thrones (2011) and 102 Dalmatians (2000). He has been married to Liv Lorent since 2008. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzg0NjYwOV5BMl5BanBnXkFtZTgwMjgyMjE3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0174005","name":"Ben Crompton","idIMDB":"nm0174005"},"actorId":"nm0174005","character":"Warehouse Caretaker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne-Marie Duff","urlProfile":"http://www.imdb.com/name/nm0240359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk0NzYxMTg1M15BMl5BanBnXkFtZTcwMzgyMjAyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1970","placeOfBirth":" Southall, London, England, UK","height":"5' 7\" (1.7 m)","bio":"Anne-Marie Duff is an English actress, born on 8 October 1970 in Southall, London. Her parents, Brendan and Mary (née Doherty), are from Donegal, Ireland. Her father worked as a painter and decorator and her mother worked in a shoe shop. She first came to the attention of the British public for her role as Margaret in The Magdalene Sisters (2002) and as Fiona Gallagher in the successful TV series Shameless (2004), where she met her future husband, James McAvoy. She went on to play Queen Elizabeth I opposite Tom Hardy's Robert Dudley, Earl of Leicester in the four-part miniseries The Virgin Queen (2005). In Nowhere Boy (2009), Duff played John Lennon's mother, Julia, a role for which she won British Independent Film Award for Best Supporting Actress. She played Violet Miller in Suffragette (2015), a working-class woman who introduces Maud Watts (Carey Mulligan) to the fight for women's rights in east London. \"Violet is extraordinary, she's a firebrand - a tornado that comes into Maud's life and changes it forever. I found her thrilling,\" says Duff. In 2017, she will appear as Hyzenthlay in a new BBC animated miniseries of Watership Down. Duff has also taken on many theatre roles, including Joan of Arc in George Bernard Shaw's \"Saint Joan\" in 2007 and Alma Rattenbury in Terence Rattigan's \"Cause Célèbre\" at The Old Vic, London in 2011. She has been married to McAvoy since 11 November 2006. They have one child, a son named Brendan after Duff's father. On 13 May 2016, Duff and McAvoy announced their decision to divorce.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk0NzYxMTg1M15BMl5BanBnXkFtZTcwMzgyMjAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240359","name":"Anne-Marie Duff","idIMDB":"nm0240359"},"actorId":"nm0240359","character":"Claire","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Levy","urlProfile":"http://www.imdb.com/name/nm0506314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDY5OTI2OV5BMl5BanBnXkFtZTgwNDQyMjQ1MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Adam trained in Acting at The Royal Academy Of Dramatic Art (RADA) in London. He has worked extensively in film, theatre and television all over the world. He has been in the acting company of the Royal National Theatre and The Royal Shakespeare Company (RSC) for many years. Within the movie industry Adam has worked extensively for many production houses in The States and Europe. After completing work on the feature film ' Before I Go To Sleep' playing opposite Nicole Kidman, directed Rowan Joffe, Adam took on the lead role of 'Peter' in the twelve part series 'AD.the Bible Continues' for NBC. He is currently filming on 'Music War And Love' directed by Martha Coolidge and produced by Fred Roos.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDY5OTI2OV5BMl5BanBnXkFtZTgwNDQyMjQ1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0506314","name":"Adam Levy","idIMDB":"nm0506314"},"actorId":"nm0506314","character":"Ben","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabriel Strong","urlProfile":"http://www.imdb.com/name/nm6861173","urlPhoto":"","biography":{"bio":"Gabriel Strong is an actor, known for Before I Go to Sleep (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6861173","name":"Gabriel Strong","idIMDB":"nm6861173"},"actorId":"nm6861173","character":"Boy on Bike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Flynn MacArthur","urlProfile":"http://www.imdb.com/name/nm5656346","urlPhoto":"","biography":{"height":"3' 6\" (1.07 m)","bio":"Flynn MacArthur is an actor, known for Before I Go to Sleep (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5656346","name":"Flynn MacArthur","idIMDB":"nm5656346"},"actorId":"nm5656346","character":"Boy in Dream","urlCharacter":"http://www.imdb.com/character/ch0383173","main":true},{"actorName":"Dean-Charles Chapman","urlProfile":"http://www.imdb.com/name/nm2835616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM2Mjc2NzAzMV5BMl5BanBnXkFtZTgwMjE0MzAwNTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Dean-Charles Chapman is an actor, known for Before I Go to Sleep (2014), Game of Thrones (2011) and Man Up (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM2Mjc2NzAzMV5BMl5BanBnXkFtZTgwMjE0MzAwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2835616","name":"Dean-Charles Chapman","idIMDB":"nm2835616"},"actorId":"nm2835616","character":"Adam","urlCharacter":"http://www.imdb.com/character/ch0383173","main":true}],"seasons":[],"idIMDB":"tt1726592","urlIMDB":"http://www.imdb.com/title/tt1726592","business":{"budget":{"money":"$22,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"09","month":"02","year":"2014","remarks":null},"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Fuji Eterna Vivid 500T 8547, Eterna 250D 8563, Eterna 500T 8573)"],"cinematographicProcess":null,"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"6.3","metascore":"41","filmingLocations":[{"location":"Blythe House, 23 Blythe Road, West Kensington, London, England, UK"}],"rated":"R","awards":[],"votes":"53,920","type":"Movie","companyCreditsSimple":[{"idCompany":"co0074212","name":"Scott Free Productions"},{"idCompany":"co0002572","name":"Millennium Films"},{"idCompany":"co0001935","name":"Film i Väst"}],"keywords":{"keywords":["female nudity","amnesia","infidelity","nudity","therapist","memory","anterograde amnesia","flashback","false identity","face slap","female rear nudity","searching for the truth","hidden truth","self discovery","hospital","mobile phone","hotel room","husband wife relationship","accident","brain damage","bed","housewife","swerving to avoid hitting an object in the road","teenage boy","hospital room","male female fight","mistaken belief that someone is dead","evidence","scheme","intrigue","nose bleeding","husband wife conflict","husband slaps wife","husband hits wife","man hits woman","man slaps woman","reunion","tragedy","gaslighting","foot chase","family tragedy","violent man","ex husband ex wife relationship","on the run","chloroformed","learning the truth","mental patient","pretending to be someone else","ill wife","loss of son","crying female","illness","crying woman","hysterical outburst","outburst","wet clothes","sick woman","sick wife","friendship between women","pregnant woman","private investigation","investigation","notebook","freeze frame","dream sequence","fully clothed sex","note","therapy","reconstruction","doubt","repeated event","mentally unstable protagonist","mentally unstable woman","lost memory","mentally unstable","blood on face","disbelief","barefoot male","garage","manipulative man","manipulative behavior","psychological manipulation","wedding photograph","talking to a camera","sex scene","hiding place","waking up naked","female protagonist","camera shot of eyes","close up of eyes","mysterious event","first person title","arrest","reverse footage","revelation","bruise","love","mental illness","best friend","knocked out","fade to black","escape attempt","man fights a woman","escape","chase","newspaper clipping","attack","video recording","anger","betrayal","double cross","argument","kitchen","seizure","anniversary","observatory","2010s","2000s","1990s","no opening credits","written by director","police car","presumed dead","ambulance","warehouse","punched in the face","man hits a woman","man punches a woman","domestic abuse","man slaps a woman","psychologist","england","british","heavy rain","party","repressed memory","drawing","loss of memory","bathroom","danger","panic","deception","wine bottle","mri","repeated line","character's point of view camera shot","camcorder","neo noir","hypodermic needle","injection","hallucination","red herring","pier","fake identity","assumed identity","impostor","school","false accusation","psychological thriller","sociopath","suspense","medical mask","hitchcockian","domestic violence","shoebox","hospital bed","12 year old","boy","skiing accident","facial scar","scar","bloody nose","blood splatter","f word","forgiveness","voice over letter","letter","unfaithfulness","adultery","extramarital affair","park","bench","greenwich observatory london","little boy","divorce","adult community care center","year 2007","countertransference","psychiatrist","eating","food","sedative","name tag","running","hit with a wine bottle","peephole","baby","father son relationship","mother son relationship","holding hands","repeated scene","grief","crying","birth certificate","lock box","key","8 year old","meningitis","dead son","friendship","pregnancy","paranoia","looking at oneself in a mirror","mirror","brushing one's teeth","montage","screaming","bloody mouth","search","repeated dialogue","fast motion scene","flash forward","flashback within a flashback","sex standing up","kiss","kiss on the forehead","shower","hearing voices","semen","sex","blood","airport","airplane","wrapped in a bedsheet","mannequin","scene of the crime","trauma","apology","liar","age regressioin","chemistry teacher","teacher","humming","singing along to music","listening to music","attempted murder","left for dead","newspaper article","medical report","hit on the head","video diary","diary","elevator","neuropsychologist","nightmare","dream","atypical psychogenic amnesia","facial bruise","fire truck","fireman","slow motion scene","fire alarm","hit with an iron","strangulation","hit with a lamp","fight","violence against women","erasing a video diary","guilt","broken glass","breaking a glass","beating","penis slur","cigarette smoking","wedding ring","locked door","closet","windshield wiper","doctor patient relationship","parking garage","bedroom","sleeping","telephone call","subjective camera","surprise","wedding anniversary","london england","marriage","photo album","fear","head injury","40 year old","year 2013","year 1999","woman wrapped in a towel","wrapped in a towel","bare butt","brutality","violence","doctor","secret","distrust","tension","reunited with family","concussion","cracked rib","impersonating husband","nosebleed","syringe","looking through a peephole","whispering","standing in the rain","digital camera","cityscape","recovering lost memory","female star appears nude","close up of hand","close up of eye","lie","trust","short term memory loss","memory loss","amnesiac","death of son","independent film","based on novel","surprise ending","twist ending","camera","character says i love you","looking through a glass door","locking a door","cell phone","telephone","friend","hotel","photograph","waking up","short term memory"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:14:08"}}