{"data":{"movies":[{"title":"Sesame Street: Cookie Monster's Best Bites","originalTitle":"","year":"1995","releaseDate":"19950912","directors":[{"name":"John Ferraro","id":"nm0274179"},{"name":"Jon Stone","id":"nm0831968"}],"writers":[{"name":"Christine Ferraro","id":"nm0274160"},{"name":"David Johnson","id":"nm1714252"}],"runtime":"60 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTA1MDYwM15BMl5BanBnXkFtZTgwOTYwNTA2MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Family"],"plot":"Welcome to a song-filled, smile-making, simply scrumptious video starring everyone's favorite Sesame Street connoisseur de crumbs: Cookie Monster!","simplePlot":"Welcome to a song-filled, smile-making, simply scrumptious video starring everyone's favorite Sesame Street connoisseur de crumbs: Cookie Monster!","actors":[{"actorName":"Carlo Alban","urlProfile":"http://www.imdb.com/name/nm0016243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NzYzNjEwM15BMl5BanBnXkFtZTcwODgwMTY2OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1979","placeOfBirth":" Ecuador","bio":"Carlo Alban was born on October 3, 1979 in Ecuador. He is an actor, known for 21 Grams (2003), The Bravest, the Boldest (2014) and Whip It (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NzYzNjEwM15BMl5BanBnXkFtZTcwODgwMTY2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0016243","name":"Carlo Alban","idIMDB":"nm0016243"},"actorId":"nm0016243","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Arkin","urlProfile":"http://www.imdb.com/name/nm0000273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1934","placeOfBirth":" New York City, New York, USA","birthName":"Alan Wolf Arkin","height":"5' 9½\" (1.77 m)","bio":"Alan Arkin is an Academy Award-winning American actor who is also an acclaimed director, producer, author, singer and composer. He was born Alan Wolf Arkin on March 26, 1934, in Brooklyn, New York. His family were Jewish immigrants from Russia and Germany. In 1946 the Arkins moved from Brooklyn to Los Angeles, California. His father, David I. Arkin, was an artist and writer, who worked as a teacher, and lost his job for merely refusing to answer questions about his political affiliation during the 1950s Red Scare. His father challenged the politically biased dismissal and eventually prevailed, but unfortunately it was after his death. His mother, Beatrice (Wortis) Arkin, a teacher, shared his fathers views. Young Arkin was fond of music and acting, he was taking various acting classes from the age of 10. He attended Franklin High School, in Los Angeles, then Los Angeles City College from 1951 - 1953, and Bennington College in Vermont from 1953 - 1954. He sang in a college folk-band, and was involved in a drama class. He dropped out of college to form the folk music group The Tarriers, in which Arkin was the lead singer and played guitar. He co-wrote the 1956 hit \"The Banana Boat Song\" - a Jamaican calypso folk song, which became better known as Harry Belafonte's popular version, and reached #4 on the Billboard chart. At that time Arkin was a struggling young actor who played bit parts on television and on stage, and made a living as a delivery boy, repairman, pot washer and baby sitter. From 1958 - 1968 he performed and recorded with the children's folk group, The Babysitters. He has also recorded an entire album for the Elektra label titled \"Folksongs - Once Over Lightly.\" In 1957 Arkin made his first big screen appearance as a lead singer with The Tarriers in Calypso Heat Wave (1957). Then he made his Off-Broadway debut as a singer in \"Heloise\" (1958). Next year he joined the Compass Theatre in St. Louis, Missouri. There he caught the eye of stage director Bob Sills and became the original member of the \"Second City\" troupe in Chicago. In 1961 Arkin made his Broadway debut in musical \"From the Second City\", for which he wrote lyrics and sketches, then starred as David Kolowitz in the Broadway comedy \"Enter Laughing\" (1963), for which he won a Tony Award. He starred in a Broadway musical \"From the Second City production, then returned to Broadway as Harry Berlin in \"Luv\" (1964). Arkin made his directorial debut with an Off-Broadway hit called \"Eh?\" (1966), which introduced the young actor, named Dustin Hoffman. He won a Drama Desk Award for his direction of the Off-Broadway production of \"Little Murders\" (1969), and another Drama Desk Award for \"The White House Murder Case\" (1970). He also directed the original version of Neil Simon's hilarious smash, \"The Sunshine Boys\" (1972), which ran over 500 performances. Arkin earned his first Academy Award nomination as Best Actor for his feature acting debut in a comedy The Russians Are Coming! The Russians Are Coming! (1966), by director Norman Jewison, co-starring as Lt. Rozanov, a Soviet submariner who is mistaken for a spy after his boat accidentally wrecks aground in New England. Arkin demonstrated his dramatic range as the psychopathic killer Roat in suspense film Wait Until Dark (1967), opposite Audrey Hepburn. He reinvented himself as the sensitive deaf-mute in The Heart Is a Lonely Hunter (1968), for which he received his second Academy Award nomination as Best Actor in the Leading role. He followed with what remained his best known role as Captain Yossarian in Catch-22 (1970), directed by Mike Nichols and based on the eponymous anti-war novel by Joseph Heller. In it Arkin arguably gave his strongest performance, however, his career suffered because the film initially did not live up to expectations. After a few years of directorial work on television, Arkin made a comeback with an impressive portrayal of doctor Sigmund Freud in The Seven-Per-Cent Solution (1976). In the early 1980s he acted in three movies that were family affairs, written by his wife, Barbara Dana, and co-starring his son, Adam Arkin. During the 1990s he turned out several notable performances, such as a bitter former baseball player in TNT's Cooperstown (1993), and as a hilarious psychiatrist opposite John Cusack in Grosse Pointe Blank (1997). He won raves for his portrayal of a divorced father who struggles to keep his kids enrolled in the Beverly Hills school system in Slums of Beverly Hills (1998). Arkin gave a brilliant performance opposite Robin Williams in Jakob le menteur (1999), a film about the Nazi occupation of Poland. He also returned to the New York stage co-starring with his son, Tony Arkin and Elaine May in \"Power Plays\", which he also co-authored. His most recent comeback as a heroin-snorting, sex-crazed, foul-mouthed grandfather in Little Miss Sunshine (2006), earned him his third Academy Award nomination for Best Performance by an Actor in a Supporting Role, and his first Academy Award. Alan Arkin has been a modern Renaissance man. In addition to his achievements as an actor, director, and producer, he made his mark as a singer-songwriter with his popular-song compositions \"Banana Boat Song\", \"Cuddle Bug,\" \"That's Me,\" and \"Best Time of the Year.\" Arkin also authored several books, including science-fiction and some children's stories, such as \"The Clearing\", \"The Lemming Condition\" and \"Cassie Loves Beethoven\" among his other publications. He is a father of three sons, Adam, Matthew, and Tony, and a grandfather of Molly Arkin. Alan Arkin has been a strong supporter of an organic way of living and also a proponent for preservation of the environment and natural habitat. He has been avoiding the show-biz-milieu and is known as an actor who does not really care about prestigious awards, but values having a good job and being acknowledged by his peers. In Arkin's own words he wants to \"Stay home for three months. Living as quietly as humanly possible.\" Arkin was given an Indian name, Grey Wolf, by his Native American friends in New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000273","name":"Alan Arkin","nicknames":["The Tarriers"],"idIMDB":"nm0000273"},"actorId":"nm0000273","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Annette Bening","urlProfile":"http://www.imdb.com/name/nm0000906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODQ1ODM5Ml5BMl5BanBnXkFtZTcwOTU2NDk3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1958","placeOfBirth":" Topeka, Kansas, USA","birthName":"Annette Francine Bening","height":"5' 8\" (1.73 m)","bio":"Annette Carol Bening was born on May 29, 1958 in Topeka, Kansas, the youngest of four children of Shirley (Ashley), a soloist and church singer, and Arnett Grant Bening, an insurance salesman. She is of German and British Isles ancestry. Her family moved to California when she was young, and she grew up there. She graduated from San Francisco State University and began her acting career with the American Conservatory Theatre in San Francisco, eventually moving to New York where she acted on the stage (including a Tony-award nomination in 1987 for her work in the Broadway play \"Coastal Disturbances\") and got her first film roles, in a few TV movies. As is so often the case, her first big-screen role was in a forgettable movie, The Great Outdoors (1988), in which she had little screen time. However, her next work on-screen was in Milos Forman's Valmont (1989), a film adaptation of Choderlos de Laclos' \"Les Liaisons Dangereuses\". Unfortunately, de Laclos' story had also just served as the source of a more Hollywoodized and successful movie version, Dangerous Liaisons (1988), which had been released the previous year, and Foreman's treatment went little noticed. Bening's career turned an important corner the following year when she co-starred with Anjelica Huston and John Cusack in Stephen Frears's powerful, entertaining screen adaptation of Jim Thompson's novel The Grifters (1990), and her artful turn as a con artist gained her the first of several Academy award nominations. On the strength of this performance Warren Beatty cast Bening as Virginia Hill, Bugsy Siegel's fiery actress moll, in his Bugsy (1991), the story of Siegel's founding of Las Vegas. Although the movie itself did not fare well, it resulted in a relationship with Beatty which led to Bening's pregnancy and then her marriage to Beatty in 1992 - it was the second marriage for Bening, who had been separated from her first husband since 1986 but did not finalize her divorce until 1991. The couple then collaborated on the extravagant flop Love Affair (1994), though the next year her career rebounded with her turn as Queen Elizabeth in the highly-regarded 1995 production of Richard III (1995). Notable performances have since included an obsessive, pushy real estate agent in American Beauty (1999), and as the eponymous character in István Szabó's screen adaptation of the W. Somerset Maugham novel Adorable Julia (2004) - both were duly noted by the Academy, with Oscar nominations. Bening has great poise and screen presence and, at her best, can turn in a very strong performance. Although her resume often features long stretches of mediocre productions before the next good part turns up, when it does, it proves worth the wait. Bening has four children with Beatty.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODQ1ODM5Ml5BMl5BanBnXkFtZTcwOTU2NDk3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000906","name":"Annette Bening","idIMDB":"nm0000906"},"actorId":"nm0000906","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Henson","urlProfile":"http://www.imdb.com/name/nm0001345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1936","placeOfBirth":" Greenville, Mississippi, USA","birthName":"James Maury Henson","height":"6' 1\" (1.85 m)","bio":"Jim Henson never thought that he would make a name of himself in puppetry; it was merely a way of getting himself on television. The vehicle that achieved it was Sam and Friends (1955), a late-night puppet show that was on after the 11:00 news in Washington DC. It proved to be very popular and inspired Jim to continue using puppets for his work. He made many commercials, developing the signature humor that Henson Productions is known for. A key reason for the success of his puppets is that Jim realized he didn't need to hide puppeteers behind a structure when they were in front of a camera. All he had to do was instruct the camera operators to focus on the puppets and keep the puppeteers out of the frame. This allowed the puppets to dominate the image and make them more lifelike. This work on puppets and television would lead to separate projects that had different goals. The first one was his work on the The Jimmy Dean Show (1963) with the character Rowlf the Dog, the oldest clearly identified character that Henson Productions still uses. This show provided an income that allowed Jim to work on a pet project. That project was Time Piece (1965), a surrealistic short about time which was nominated for best live-action short Oscar. Henson shot to prominence when he was approached to use his muppets for the revolutionary educational show Sesame Street (1969). The show was a smash hit and his characters have become staples on public television. Unforetunately, this also led to Henson being typecast as only an entertainer for children. He sought to disprove that by being part of the initial crew of Saturday Night Live (1975), but his style and that of the creative staff simply didn't jibe. It was this circumstance that encouraged him to develop a variety show format that had the kind of sophisticated humor that \"Sesame Street (1969)\" didn't work with. No American broadcaster was interested, but British producer Lew Grade was. This led to The Muppet Show (1976). It initially struggled both in the ratings and in the search for guest stars, but in the second season it became a smash hit and would eventually become the most widely watched series in television history. Hungry for a new challenge, Henson made The Muppet Movie (1979), defying the popular industry opinion that his characters would never work in a movie. The film became a hit and spawned a series of features which included the moody fantasy The Dark Crystal (1982), which was a drastic and bold departure from the amiable tone of his previous work. The most successful TV work in the 1980s was Fraggle Rock (1983), a fantasy series specifically designed to appeal to as many cultural groups as possible. During this time he also established the Creature Shop, a puppet studio that became renowned for being as brilliant with puppetry as ILM was at special effects. When he died all too soon in 1990, he was indisputably one of the geniuses of puppetry. More importantly, he was a man who achieved his phenomenal success while still retaining his social conscience and artistic integrity as his work in promoting environmentalism and his brilliant The Storyteller (1987) series respectively attest to.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001345","name":"Jim Henson","idIMDB":"nm0001345"},"actorId":"nm0001345","character":"Guy Smiley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Oz","urlProfile":"http://www.imdb.com/name/nm0000568","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1944","placeOfBirth":" Hereford, England, UK","birthName":"Frank Richard Oznowicz","height":"6' 2\" (1.88 m)","bio":"Frank Richard Oznowicz was born in Hereford, England to puppeteers Frances and Isidore Oznowicz. His family moved to Montana in 1951, eventually settling in Oakland, California. As a teenager, he worked as an apprentice puppeteer at Children's Fairyland amusement park. He is one of the primary puppeteers responsible for the development of Jim Henson's Sesame Street (1969) and _\"The Muppet Show\" (1976)_ as well as over 75 other Muppet productions. 'George Lucas' originally contacted Henson to play the part of Yoda in Star Wars: Episode V - The Empire Strikes Back (1980), but he recommended Oz for the part instead. He developed the character's trademark syntax, returning to voice and puppet the Jedi Master in Star Wars: Episode VI - Return of the Jedi (1983) and Star Wars: Episode I - The Phantom Menace (1999). He voiced the CGI character in Star Wars: Episode II - Attack of the Clones (2002) and Star Wars: Episode III - Revenge of the Sith (2005), supporting the transition of the character's rendering to digital. In 2011, the Blu-Ray edition of The Phantom Menace replaced the puppet Yoda with CGI to match the other prequel films. He began a career of behind-the-camera puppet and live action filmmaking by co-directing The Dark Crystal (1982) with Henson. He went on to direct The Muppets Take Manhattan (1984), Little Shop of Horrors (1986), Dirty Rotten Scoundrels (1988), What About Bob? (1991), The Indian in the Cupboard (1995), Bowfinger (1999), The Score (2001), The Stepford Wives (2004) and Death at a Funeral (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000568","name":"Frank Oz","idIMDB":"nm0000568"},"actorId":"nm0000568","character":"Cookie Monster","urlCharacter":"http://www.imdb.com/character/ch0000533","main":true}],"seasons":[],"idIMDB":"tt1722633","urlIMDB":"http://www.imdb.com/title/tt1722633","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr (60 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[],"awards":[],"type":"Video","companyCreditsSimple":[{"idCompany":"co0060192","name":"Children's Television Workshop (CTW)"},{"idCompany":"co0058596","name":"Sesame Workshop"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:48:20"}}