{"data":{"movies":[{"title":"Blood Ties","originalTitle":"","year":"2013","releaseDate":"20131030","directors":[{"name":"Guillaume Canet","id":"nm0133899"}],"writers":[{"name":"Guillaume Canet","id":"nm0133899"},{"name":"James Gray","id":"nm0336695"}],"runtime":"127 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDc5NTc5MF5BMl5BanBnXkFtZTgwNDA2MjMwMTE@._V1.jpg","countries":["France","USA"],"languages":["English","Italian","Spanish"],"genres":["Crime","Drama","Thriller"],"plot":"New York, 1974. Fifty-year-old Chris (Clive Owen) has just been released on good behavior after several years in prison following a gangland murder. Reluctantly waiting for him outside the gates is his younger brother, Frank (Billy Crudup), a cop with a bright future. Chris and Frank have always been different, and their father, Leon (James Caan), who raised them alone, seems to favor Chris despite all his troubles. Yet blood ties are the ones that bind, and Frank, hoping that his brother has changed, is willing to give him a chance - he shares his home, finds him a job, and helps him reconnect with his children and his ex-wife, Monica (Marion Cotillard). But Chris' inevitable descent back into a life of crime proves to be the last in a long line of betrayals, and after his brother's latest transgressions, Frank banishes him from his life. But it's already too late, as the brothers' destiny is bound together, forever.","simplePlot":"Two brothers, on either side of the law, face off over organized crime in Brooklyn during the 1970s.","actors":[{"actorName":"Clive Owen","urlProfile":"http://www.imdb.com/name/nm0654110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzAyOTc5Ml5BMl5BanBnXkFtZTcwOTQ5NzEzMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1964","placeOfBirth":" Keresley, Coventry, Warwickshire, England, UK","height":"6' 2\" (1.88 m)","bio":"British actor Clive Owen is one of a handful of stars who, though he is best known for his art house films, can handle more mainstream films with equal measures of grace and skill. Owen is typically cast as characters whose primary traits are a balance of physical strength, intellect, conflicting soul but forceful will. He is best known to film audiences for his work in Children of Men (2006), Closer (2004) and his breakout part in Croupier (1998). He recently portrayed Ernest Hemingway in the HBO made-for-TV movie Hemingway & Gellhorn (2012). Born in Coventry, in England's West Midlands county, on 3 October 1964, Owen is the fourth of five brothers. He is the son of Pamela (Cotton) and Jess Owen, a country and western singer. His father abandoned the family when he was three years old, and Owen was subsequently raised by his mother and stepfather. He attended Binley Park Comprehensive School and joined the youth theater at 13 after playing the scene-stealing role of the Artful Dodger in a production of \"Oliver!\" Acting was not his first choice as a profession, but he changed his mind and went on to graduate from the Royal Academy of Dramatic Art in 1987. Owen proceeded to join the Young Vic Theatre Company, where he honed his craft while performing in a number of Shakespearean productions. Clive made his film debut in the British-made Vroom (1988) co-starring with David Thewlis as two fellows who restore a classic American car and take off on the road. Within two years, Clive became a full-fledged TV star playing devilish rogue Stephen Crane in Chancer (1990). However, the now-sought-after Clive abandoned the star-making part at the height of the show's popularity because of unwanted invasion of privacy and his fear of typecasting. His next project raised more than a few eyebrows when he filmed Close My Eyes (1991) in which he played a brother who acts on his incestuous desires for his older sister. Clive's reputation as a lovable shyster was completely shattered and he lost profitable commercial endorsements following the film's release. Offers fell off for the next two years as a result. But the persistent Clive carried on with stage work, including the role of a bisexual in a production of Noël Coward's \"Design For Living.\" He returned to TV at that time as well and played a number of roles in both mini-movies and series. In 1997, Clive had a huge hit on the London stage with \"Closer,\" a cynical, contemporary ensemble piece about relationships. Controversy surrounded him again in the film role of Max in Bent (1997) playing a brash, reckless homosexual lothario in decadent pre-war Germany who finds unconditional love while interned in a Nazi war camp. His biggest film break, however, was in Mike Hodges' Croupier (1998), as a struggling writer-turned-casino employee who gets in over his head with a femme fatale scam artist. English audiences stayed away in droves but the U.S. embraced the film and Hollywood took notice of Clive, who was virtually unknown outside of England. Despite playing detective Ross Tanner in a series of successful \"Second Sight\" mini-movies and finding critical acclaim on stage with \"The Day in the Death of Joe Egg\" in 2001, Clive has focused primarily on film, including the offbeat Brit romantic comedy Greenfingers (2000), the classy and popular Robert Altman film Gosford Park (2001), the Matt Damon star-vehicle The Bourne Identity (2002), and the title role in King Arthur (2004). He has since reached the top rungs of the Hollywood ladder with the film version of his stage smash Closer (2004), in which he received an Academy Award nomination and won the BAFTA award for \"Supporting Actor\"; opposite Denzel Washington in Inside Man (2006); and alongside Julianne Moore and Michael Caine in Children of Men (2006). Upcoming is his portrayal of Sir Walter Raleigh opposite Cate Blanchett's Elizabeth I in the film Elizabeth: The Golden Age (2007). Owen is married to Sarah-Jane Fenton, who played Juliet to his Romeo at the Young Vic in 1998. The couple has two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzAyOTc5Ml5BMl5BanBnXkFtZTcwOTQ5NzEzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654110","name":"Clive Owen","idIMDB":"nm0654110"},"actorId":"nm0654110","character":"Chris","urlCharacter":"http://www.imdb.com/character/ch0417619","main":true},{"actorName":"Billy Crudup","urlProfile":"http://www.imdb.com/name/nm0001082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MzM5NzUzMF5BMl5BanBnXkFtZTcwNjEyMDY5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1968","placeOfBirth":" Manhasset, New York, USA","birthName":"William Gaither Crudup","height":"5' 8½\" (1.74 m)","bio":"Known as much for his rigorous career choices as for his talent and chiseled good looks, Billy Crudup has been straddling the line between serious actor and \"it\" leading man for several years. Crudup was born in 1968 in Manhasset, New York (a Long Island suburb), the middle child in a family of three boys. He is the son of Georgann (Gaither) and Thomas Henry Crudup III, and the grandson of prominent attorney William Cotter \"Billy\" Gaither, Jr. Crudup was raised in Florida and Texas. His family frequently moved and always being the new kid meant Billy had to develop some way of gaining acceptance. Being the class clown was his ticket in. He found roles in school pageants and developed funny impersonations to entertain family and friends. He received his undergraduate degree from the University of North Carolina (where he confirmed his interest in acting). Upon graduation, Crudup headed to NYC to live with his brother Tommy (who was at that time a publicist) and study at New York University, where he joined a theatre troupe called \"the lab!\" and did little plays and musicals - he even played \"Schroeder\" in the famed children's musical \"You're A Good Man Charlie Brown!\". He then went on to earn a Master of Fine Arts from the Tisch School of the Arts at NY in 1994. A year later, he'd already made a name for himself on Broadway, earning the Outer Critics Circle Outstanding Newcomer Award for his performance in Tom Stoppard's \"Arcadia\". Crudup's first big-screen acting gig was in the indie film Grind (1997), which was shot in 1994, but ended up on the shelf for three years. In 1996, he landed another, more lucrative role, opposite Hollywood hotshots Brad Pitt and Jason Patric in the Barry Levinson drama, Sleepers (1996). He followed that up with a brief appearance in Woody Allen's Everyone Says I Love You (1996) and a higher-profile turn as the rakish older brother in Inventing the Abbotts (1997). A self-described student of human nature, Crudup has said that he looks for characters wrestling with their mistakes. Rumor has it that he declined an audition for the lead in Titanic (1997) in order to seek out more challenging projects--like the \"Steve Prefontaine\" biopic Without Limits (1998). \"Limits\" showcased Crudup's ability to completely transform himself for a role (a quality that would help him skirt stardom while continuing to land substantive parts). In 2000, with three major films in release, Crudup's already bustling movie career reached a fever pitch. He first hit the festival circuit in Keith Gordon's Waking the Dead (2000), the tale of an up-and-coming politician who is haunted by the death of his young wife. Next came the art-house favorite Jesus' Son (1999). Finally, he starred as the semi-fictional '70s rocker \"Russell Hammond\" in Cameron Crowe's much-lauded Almost Famous (2000). In 2002, his production of \"The Elephant Man\" on Broadway closed after 65 performances, due to low ticket sales. Crudup lives in New York and returns regularly to the stage - in fact, it was during the 1996 Broadway run of \"Bus Stop\" that he began his romance with longtime girlfriend, Mary-Louise Parker. That romance ended in 2004, when Crudup left the then-pregnant Parker for his Stage Beauty (2004) co-star, Claire Danes. He seems to prefer quiet anonymity to the pomp and circumstance of the movie star lifestyle, but his ever-growing popularity guarantees that he won't be able to avoid the spotlight altogether.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MzM5NzUzMF5BMl5BanBnXkFtZTcwNjEyMDY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001082","name":"Billy Crudup","idIMDB":"nm0001082"},"actorId":"nm0001082","character":"Frank","urlCharacter":"http://www.imdb.com/character/ch0412681","main":true},{"actorName":"Marion Cotillard","urlProfile":"http://www.imdb.com/name/nm0182839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTEzNTkwNF5BMl5BanBnXkFtZTcwNzQ2NDIwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1975","placeOfBirth":" Paris, France","height":"5' 6½\" (1.69 m)","bio":"Academy Award-winning Actress Marion Cotillard was born on September 30, 1975 in Paris. Cotillard is the daughter of Jean-Claude Cotillard, an actor, playwright and director, and Niseema Theillaud, an actress and drama teacher. Her father's family is Breton and her mother has Kabyle ancestry. Raised in Orléans, France, she made her acting debut as a child with a role in one of her father's plays. She studied drama at the Conservatoire d'Art Dramatique in Orléans. After small appearances and performances in theater, Cotillard had occasional and minor roles in TV series such as Highlander (1992) and Extrême limite (1994), but her career as a film actress began in the mid-1990s. While still a teenager, Cotillard made her cinema debut at the age of 18 in the film L'histoire du garçon qui voulait qu'on l'embrasse (1994), and had small but noticeable roles in films such as Arnaud Desplechin's My Sex Life... or How I Got Into an Argument (1996) and Coline Serreau's comedy La belle verte (1996). In 1996, she had her first lead role in the TV film Chloé (1996), playing the title role - a teenage runaway who is forced into prostitution. Cotillard co-starred opposite Anna Karina, the muse of the Nouvelle Vague. In 1997, she won her first film award at the Festival Rencontres Cinématographiques d'Istres in France, for her performance as the young imprisoned Nathalie in the short film Affaire classée (1997). Her first prominent screen role was Lilly Bertineau in Gérard Pirès's box-office hit Taxi (1998), a role which she reprised in two sequels: Taxi 2 (2000) and Taxi 3 (2003), this role earned her first César award nomination (France's equivalent to the Oscar) for Most Promising Actress in 1999. In 1999, Cotillard starred as Julie Bonzon in the Swiss war drama War in the Highlands (1999). For her performance in the film, she won the Best Actress award at the Autrans Film Festival in France. In 2001, Marion starred in Les jolies choses (2001) as the twin sisters Marie and Lucie, and was nominated for her second César award for Most Promising Actress. Cotillard's breakthrough in France came in 2003, when she starred in Yann Samuell's dark romantic comedy Love Me If You Dare (2003), in which she played Sophie Kowalsky, the daughter of Polish immigrants who lives a love-hate relationship with her childhood friend. The film was a box-office hit in France, became a cult film abroad and led Cotillard to bigger projects. Her first Hollywood movie was Tim Burton's Big Fish (2003), in which she played Joséphine, the wife of William Bloom (played by Billy Crudup). A few years later, Marion starred in Ridley Scott's A Good Year (2006) playing Fanny Chenal, a French café owner who falls in love with Russell Crowe's character. In 2004, she won the Chopard Thophy of Female Revelation at the Cannes Film Festival. In 2005, Cotillard won the César award for Best Supporting Actress for her performance of Tina Lombardi in Jean-Pierre Jeunet's A Very Long Engagement (2004). In 2007, Cotillard received international recognition for her iconic portrayal of Édith Piaf in La Vie en Rose (2007). Director Olivier Dahan cast Cotillard to play the legendary French singer because to him, her eyes were like those of \"Piaf\". The fact that she can sing also helped Cotillard land the role of \"Piaf\", although most of the singing in the film is that of Piaf's. The role won Cotillard the Academy Award for Best Actress along with a César, a Lumière Award, a BAFTA Award, and a Golden Globe. That made her only the second actress to win an acting Oscar performing in a language other than English next to Sophia Loren (Two Women (1960)). Only two male performers (Roberto Benigni for Life Is Beautiful (1997) and Robert De Niro for The Godfather: Part II (1974)) have won an Oscar for solely non-English parts. Trevor Nunn called her portrayal of \"Piaf\" \"one of the greatest performances on film ever\". At the Berlin International Film Festival, where the film premiered, Cotillard was given a 15-minute standing ovation. When she won the César, Alain Delon presented the award and announced the winner as \"La Môme Marion\" (The Kid Marion), he also praised her at the stage saying: \"Marion, I give you this César. I think this César is for a great great actress, and I know what I'm talking about\". Cotillard has worked much more frequently in English-language movies following her Academy Award recognition. In 2009, she acted opposite Johnny Depp in Michael Mann's Public Enemies (2009), and later that year played Luisa Contini in Rob Marshall's musical Nine (2009) and received a Golden Globe nomination for her performance. Time magazine ranked her as the fifth best performance by a female in 2009. The following year, she took on the main antagonist role, Mal, in Christopher Nolan's Inception (2010), and in 2011 she had memorable parts in Midnight in Paris (2011) and Contagion (2011) and reteamed with Christopher Nolan in The Dark Knight Rises (2012). In 2011 and 2012 respectively, Cotillard appeared on the top of Le Figaro's list of the highest paid actors in France, it was the first time in nine years that a female topped the list. Cotillard was also the highest paid foreign actress in Hollywood. In 2012, Cotillard received wide-spread critical acclaim for her role as the legless orca trainer Stéphanie in Rust and Bone (2012). The film was a box office hit in France and received a ten-minute standing ovation at the end of its screening at the 65th Cannes Film Festival. Cotillard won the Globe de Cristal (France's equivalent to the Golden Globe), the Étoile d'Or award and was nominated for the Golden Globes, SAG, BAFTA, Critics' Choice and César Awards for her performance in the film. Cate Blanchett wrote an op-ed for Variety praising Cotillard's performance in \"Rust and Bone\", the two actresses competed for the Academy Awards for Best Actress in 2008, Cate was nominated for her performance in Elizabeth: The Golden Age (2007) and Marion for her performance in La Vie en Rose (2007) and Cotillard won the Oscar. She had her first leading role in an American movie in 2013, in James Gray's The Immigrant (2013), in which she played Ewa Cybulska, a Polish immigrant who wants to experience the American dream. Cotillard received wide-spread acclaim for her performance in the film at the 66th Cannes Film Festival, where the film premiered, and also won several critics awards. In 2014, Cotillard played Sandra in the Belgian film Deux jours, une nuit (2014) by the Dardenne brothers. Her performance was unanimously praised at the 67th Cannes Film Festival, earned several critics awards, Cotillard won her first European Award for Best Actress and also received her second Oscar nomination and her sixth César award nomination. In 2015, she played Lady Macbeth opposite Michael Fassbender in Justin Kurzel's Macbeth (2015) and voiced two animated movies: Le Petit Prince (2015) in which she voiced The Rose, and Avril et le monde truqué (2015), in which she voiced the lead role, Avril. Her upcoming films for 2016 are Nicole Garcia's Mal de pierres (2016), Xavier Dolan's It's Only the End of the World (2016), Justin Kurzel's Assassin's Creed (2016), in which she will work again with her Macbeth co-star, Michael Fassbender; and Robert Zemeckis's Allied (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTEzNTkwNF5BMl5BanBnXkFtZTcwNzQ2NDIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0182839","name":"Marion Cotillard","nicknames":["Simone"],"idIMDB":"nm0182839"},"actorId":"nm0182839","character":"Monica","urlCharacter":"http://www.imdb.com/character/ch0409767","main":true},{"actorName":"Mila Kunis","urlProfile":"http://www.imdb.com/name/nm0005109","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyNTQyNzY4MV5BMl5BanBnXkFtZTcwODg5MDA3MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1983","placeOfBirth":" Chernovtsy, Ukrainian SSR, USSR [now Chernivtsi, Ukraine]","birthName":"Milena Markovna Kunis","height":"5' 4\" (1.63 m)","bio":"The talented Milena \"Mila\" Markovna Kunis was born to a Jewish family in Chernivtsi, Ukraine, USSR (now independent Ukraine). Her mother, Elvira, is a physics teacher, her father, Mark Kunis, is a mechanical engineer, and she has an older brother named Michael. After attending one semester of college between gigs, she realized that she wanted to act for the rest of her life. She started acting when she was just 9 years old, when her father heard about an acting class on the radio and decided to enroll Mila in it. There, she met her future agent. Her first gig was in 1995, in which she played a character named Melinda in Make a Wish, Molly (1995). From there, her career skyrocketed into big-budget films. Although she is mostly known for playing Jackie Burkhart in That '70s Show (1998), she has shown the world that she can do so much more. Her breakthrough film was Forgetting Sarah Marshall (2008), in which she played a free-spirited character named Rachel Jensen. She has since starred or co-starred in the films The Book of Eli (2010), Black Swan (2010), Friends with Benefits (2011) and Ted (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyNTQyNzY4MV5BMl5BanBnXkFtZTcwODg5MDA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005109","name":"Mila Kunis","nicknames":["Goldfish"],"idIMDB":"nm0005109"},"actorId":"nm0005109","character":"Natalie","urlCharacter":"http://www.imdb.com/character/ch0417771","main":true},{"actorName":"Zoe Saldana","urlProfile":"http://www.imdb.com/name/nm0757855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk1NTA1OV5BMl5BanBnXkFtZTcwMTIzMjQ4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1978","placeOfBirth":" Passaic, New Jersey, USA","birthName":"Zoë Yadira Saldaña Nazario","height":"5' 6½\" (1.69 m)","bio":"Zoe Saldana was born on June 19, 1978 in Passaic, New Jersey, to Asalia Nazario and Aridio Saldaña. Her father was Dominican and her mother is Puerto Rican. She was raised in Queens, New York. When she was 10 years old, she and her family moved to the Dominican Republic where they would live for the next seven years. While living in the Dominican Republic, Zoe discovered a keen interest in performance dance and began her training at the prestigious ECOS Espacio de Danza Dance Academy where she learned ballet as well as other dance forms. Not only did her training provide an excellent outlet for the enthusiastic and energetic youngster, it would also prove to be a fortunate precursor for the start of her professional acting career. At age 17, Zoe and her family moved back to the United States where her love for dance followed and an interest in theater performance became stronger. She began performing with the Faces theater troupe which put on plays geared to provide positive messages for teens with themes dealing with issues such as substance abuse and sex. These performances not only gave her valuable experience but also a source of great pride knowing that she was making a difference in the lives of young people like herself. While performing with the Faces troupe and also the New York Youth Theater, Zoe was recruited for a talent agency and her dance training years before coupled with her acting experience greatly helped her land her first big screen role as Eva Rodriguez, the talented and headstrong ballet dancer in the film Center Stage (2000). Since her professional career began several years ago, Zoe's talent and determination has allowed her to be involved in blockbuster films and act with major actors, actresses and industry insiders at a pace that very few young professionals have experienced. Zoe has not only held her own in major motion picture productions but gained the respect and praise from industry insiders such as Jerry Bruckheimer and Steven Spielberg and actors/actresses such as Tom Hanks, Bernie Mac, Keira Knightley, Ashton Kutcher, Kirsten Dunst and Orlando Bloom. According to many of her co-stars, producers and directors, the sky is no limit for this young star who has incredible range, intense concentration, and a steely determination to be involved with projects that challenge her professionally with wide-ranging subject matters and characters. Just to ask practically anyone who she has worked for or with about her, glowing comments abound and earned friendships and respect are readily revealed. A star has been born, and growing every day.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk1NTA1OV5BMl5BanBnXkFtZTcwMTIzMjQ4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0757855","name":"Zoe Saldana","idIMDB":"nm0757855"},"actorId":"nm0757855","character":"Vanessa","urlCharacter":"http://www.imdb.com/character/ch0417772","main":true},{"actorName":"Matthias Schoenaerts","urlProfile":"http://www.imdb.com/name/nm0774386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTQ0MDgwOF5BMl5BanBnXkFtZTcwOTUxNzA3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1977","placeOfBirth":" Antwerp, Belgium","height":"6' 1½\" (1.87 m)","bio":"Matthias Schoenaerts was born on December 8, 1977 in Antwerp, Belgium. His mother, Dominique Wiche, was a costume designer, translator and French teacher, his father is actor Julien Schoenaerts. He made his film debut at the age of 13, alongside his father in the Belgian film Daens (1992), which was nominated for an Academy Award for Best Foreign Language Film. Schoenaerts enrolled in film school but was expelled for poor attendance in his second year. By age 21, he was enrolled at the Academy of Dramatic Arts in Antwerp and was acting professionally in small roles on Belgian television and in Belgian film. By the time he graduated in 2003, Schoenaerts was already named one of \"Europe's Shooting Stars\" by the influential marketing organization, European Film Promotion. In 2002, he starred in Dorothée Van Den Berghe's directorial debut Girl (2002), which was also his first feature film since Daens. With his role in Tom Barman's Any Way the Wind Blows (2003), he proved he was Flanders' young actor to watch. In 2004, Schoenaerts produced and starred in the short film A Message from Outer Space (2004). He also appeared in Ellektra (2004) alongside his father. In 2006, he had a small role as a member of the Dutch Resistance in Paul Verhoeven's Black Book (2006), and landed his first starring role in the Belgian film Love Belongs to Everyone (2006), playing Dennis, a mentally-challenged man learning to adjust to life after a prison sentence for a rape he may not have committed. Though Schoenaerts garnered critical praise for his role in \"Love Belongs to Everyone\", the film that would make him a star in his homeland came in 2008, in Erik Van Looy's Loft (2008), Schoenaerts played Filip, one of a group of married friends who share the rent on a downtown loft as a place to meet their respective mistresses. The dramatic thriller was a smash hit, becoming the top-grossing Flemish film of all time. In the same year, he also starred in the horror film Left Bank (2008). In 2009, he worked once again with director Dorothée Van Den Berghe, playing the hippie Raven in My Queen Karo (2009). In 2010, he played the lead role in Alex Stockman's techno-thriller Pulsar (2010). In 2011, Schoenaerts starred in Michaël R. Roskam's Bullhead (2011), playing Jacky Vanmarsenille, a cattle farmer who becomes entangled with the underworld of bovine hormones and steroids. Impressed by the script, Schoenaerts committed to star in the film in 2005, and over the five years that it took first-time director Roskam to secure financing, the actor transformed his naturally thin body into that of a steroid abusing brute. His powerful performance in the tragic role won awards at numerous film festivals and propelled \"Bullhead\" to an Academy Award nomination for Best Foreign Language Film in 2012. In 2012, Schoenaerts got the lead role opposite Marion Cotillard in Jacques Audiard's Rust and Bone (2012), in the film he played Ali, an ex-boxer who falls in love with Cotillard's character. Like Audiard's previous films, \"Rust and Bone\" received a breathless reception at the Cannes Film Festival with a ten-minute standing ovation at the end of its screening and was a critical and box office hit in France. Schoenaerts' performance in the film earned him a César Award for Most Promising Actor in 2013. Schoenaerts also starred in the Belgian short film Death of a Shadow (2012), which was nominated for an Academy Award for Best Live Action Short Film in 2013 and won the European Film Award for Best European Short. In 2013, he starred in Blood Ties (2013), after being recommended for the film by his former co-star in \"Rust and Bone\", Marion Cotillard. Following his breakthrough in \"Rust and Bone\", Matthias started a career in Hollywood and landed roles in American and British productions like Saul Dibb's Suite Française (2014), Alan Rickman's A Little Chaos (2014), Michaël R. Roskam's The Drop (2014) and Thomas Vinterberg's Far from the Madding Crowd (2015). In 2015, Schoenaerts returned to French cinema in Alice Winocour's Disorder (2015), in which he plays an ex-soldier with PTSD. He also played one of the leads of Luca Guadagnino's A Bigger Splash (2015), opposite Tilda Swinton and Ralph Fiennes, and played the art-dealer Hans Axgil in Tom Hooper's The Danish Girl (2015). He will reteam with Michaël R. Roskam in Racer and the Jailbird (2017) and also with Thomas Vinterberg in Kursk (2018), in which Schoenaerts will play the Captain of a Russian submarine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTQ0MDgwOF5BMl5BanBnXkFtZTcwOTUxNzA3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0774386","name":"Matthias Schoenaerts","nicknames":["Zenith","Matti"],"idIMDB":"nm0774386"},"actorId":"nm0774386","character":"Scarfo","urlCharacter":"http://www.imdb.com/character/ch0529950","main":true},{"actorName":"James Caan","urlProfile":"http://www.imdb.com/name/nm0001001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjkyNDQ3NV5BMl5BanBnXkFtZTcwNjY5NTQ0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1940","placeOfBirth":" The Bronx, New York, USA","birthName":"James Edmund Caan","height":"5' 9¼\" (1.76 m)","bio":"A masculine and enigmatic actor whose life and movie career have had more ups and downs than the average rollercoaster and whose selection of roles has arguably derailed him from achieving true superstar status, James Caan is New York-born and bred. He was born in the Bronx, to Sophie (Falkenstein) and Arthur Caan, Jewish immigrants from Germany. His father was a meat dealer and butcher. The athletically gifted Caan played football at Michigan State University while studying economics, holds a black belt in karate and for several years was even a regular on the rodeo circuit, where he was nicknamed \"The Jewish Cowboy\". However, while studying at Hofstra University, he became intrigued by acting and was interviewed and accepted at Sanford Meisner's Neighborhood Playhouse. He then won a scholarship to study under acting coach Wynn Handman and began to appear in several off-Broadway productions, including \"I Roam\" and \"Mandingo\". He made his screen debut as a sailor in Irma la Douce (1963) and began to impress audiences with his work in Red Line 7000 (1965) and the western El Dorado (1967) alongside John Wayne and Robert Mitchum. Further work followed in Journey to Shiloh (1968) and in the sensitive The Rain People (1969). However, audiences were moved to tears as he put in a heart-rending performance as cancer-stricken Chicago Bears running back Brian Piccolo in the highly rated made-for-TV film Brian's Song (1971). With these strong performances under his belt, Francis Ford Coppola then cast him as hot-tempered gangster Santino \"Sonny\" Corleone in the Mafia epic The Godfather (1972). The film was an enormous success, Caan scored a Best Supporting Actor nomination and, in the years since, the role has proven to be the one most fondly remembered by his legion of fans. He reprised the role for several flashback scenes in the sequel The Godfather: Part II (1974) and then moved on to several very diverse projects. These included a cop-buddy crime partnership with Alan Arkin in the uneven Freebie and the Bean (1974), a superb performance as a man playing for his life in The Gambler (1974) alongside Lauren Hutton, and pairing with Barbra Streisand in Funny Lady (1975). Two further strong lead roles came up for him in 1975, first as futuristic sports star \"Jonathon E\" questioning the moral fiber of a sterile society in Rollerball (1975) and teaming up with Robert Duvall in the Sam Peckinpah spy thriller The Killer Elite (1975). Unfortunately, Caan's rising star sputtered badly at this stage of his career, and several film projects failed to find fire with either critics or audiences. These included such failures as the hokey Harry and Walter Go to New York (1976), the quasi-western Comes a Horseman (1978) and the saccharine Chapter Two (1979). However, he did score again with the stylish Michael Mann-directed heist movie Thief (1981). He followed this with a supernatural romantic comedy titled Kiss Me Goodbye (1982) and then, due to personal conflicts, dropped out of the spotlight for several years before returning with a stellar performance under old friend Francis Ford Coppola in the moving Gardens of Stone (1987). Caan appeared back in favor with fans and critics alike and raised his visibility with the sci-fi hit Alien Nation (1988) and Dick Tracy (1990), then surprised everyone by playing a meek romance novelist held captive after a car accident by a deranged fan in the dynamic Misery (1990). The 1990s were kind to him and he notched up roles as a band leader in For the Boys (1991), another gangster in Honeymoon in Vegas (1992), appeared in the indie hit Bottle Rocket (1996) and pursued Arnold Schwarzenegger in Eraser (1996). The demand on Caan's talents seems to have increased steadily over the past few years as he is making himself known to a new generation of fans. Recent hot onscreen roles have included The Yards (2000), City of Ghosts (2002) and Dogville (2003). In addition, he finds himself at the helm of the hit TV series Las Vegas (2003) as casino security chief \"Big Ed\" Deline. An actor of undeniably manly appeal, James Caan continues to surprise and delight audiences with his invigorating performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjkyNDQ3NV5BMl5BanBnXkFtZTcwNjY5NTQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001001","name":"James Caan","nicknames":["Jimmy"],"idIMDB":"nm0001001"},"actorId":"nm0001001","character":"Leon","urlCharacter":"http://www.imdb.com/character/ch0412717","main":true},{"actorName":"Noah Emmerich","urlProfile":"http://www.imdb.com/name/nm0001187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjg4MzgxNV5BMl5BanBnXkFtZTcwMTQ5NTYzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1965","placeOfBirth":" New York City, New York, USA","birthName":"Noah Nicholas Emmerich","height":"6' 3\" (1.91 m)","bio":"Noah Emmerich was born and raised in New York City, to Constance, a concert pianist, and André Emmerich, an art dealer and gallery owner. He attended Yale University, where he sang with the a capella group the Yale Spizzwinks. He attended NYU Film School where he wrote and directed an award winning short film called \"The Painter.\" Emmerich came to prominence with starring roles in the cult hit Beautiful Girls (1996) and the Jim Carrey blockbuster The Truman Show (1998). He is considered a real \"actor's actor,\" noted for his understated, subtle realism and his deep emotional presence on screen. His production company, Sandbox Entertainment, has a first-look production deal with New Line Cinema. His older brother is Toby Emmerich.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjg4MzgxNV5BMl5BanBnXkFtZTcwMTQ5NTYzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001187","name":"Noah Emmerich","idIMDB":"nm0001187"},"actorId":"nm0001187","character":"Lieutenant Connellan","urlCharacter":"http://www.imdb.com/character/ch0422399","main":true},{"actorName":"Lili Taylor","urlProfile":"http://www.imdb.com/name/nm0000666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNzAyMzA1ODZeQTJeQWpwZ15BbWU4MDAzNDQxNjkx._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1967","placeOfBirth":" Glencoe, Illinois, USA","birthName":"Lili Anne Taylor","height":"5' 2\" (1.57 m)","bio":"Lili Taylor is a well-known and successful American actress. She acts in film, TV and stage. She was born in Glencoe, Illinois, to Marie (Lecour) and George Park Taylor, an artist and hardware store operator. Lili graduated from New Trier High School in 1985. Then, she attended the Theatre School at DePaul University and the Piven Theatre Workshop. Lili first earned fame for acting in the 1988 movie, Mystic Pizza (1988), which co-starred Julia Roberts. Then, she acted in a number of successful movies, including Dogfight (1991) and Short Cuts (1993). But, she was more highly recognized for appearing in the 1996 film, I Shot Andy Warhol (1996), for which she was nominated for several awards. Lili's notable works for television include the TV series, Six Feet Under (2001), and in the television movies, Anne Frank (2001) and Live from Baghdad (2002). In 2009, she played \"Sheriff Lillian Holley\" in the movie, Public Enemies (2009). The movie co-starred Johnny Depp, with whom Lili also appeared in the 1993 movie, Arizona Dream (1993). Lili is also a successful stage actress. She has appeared in a number of plays staged on Broadway, including \"The Three Sisters\" (1997). Lili Taylor continues to act in stage, TV and film. She is married to Nick Flynn and they have a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNzAyMzA1ODZeQTJeQWpwZ15BbWU4MDAzNDQxNjkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000666","name":"Lili Taylor","idIMDB":"nm0000666"},"actorId":"nm0000666","character":"Marie","urlCharacter":"http://www.imdb.com/character/ch0412716","main":true},{"actorName":"Domenick Lombardozzi","urlProfile":"http://www.imdb.com/name/nm0518511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxODk1ODYzNF5BMl5BanBnXkFtZTgwNTE1ODU2MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1976","placeOfBirth":" Bronx, New York, USA","birthName":"Domenico Lombardozzi","height":"5' 10\" (1.78 m)","bio":"Domenick Lombardozzi was born on March 25, 1976 in Bronx, New York, USA as Domenico Lombardozzi. He is an actor, known for Bridge of Spies (2015), The Wire (2002) and S.W.A.T. (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxODk1ODYzNF5BMl5BanBnXkFtZTgwNTE1ODU2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0518511","name":"Domenick Lombardozzi","idIMDB":"nm0518511"},"actorId":"nm0518511","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Ventimiglia","urlProfile":"http://www.imdb.com/name/nm0893247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MzMzMDY5N15BMl5BanBnXkFtZTYwMjMxNjkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1963","placeOfBirth":" Ridgewood, Queens, New York, USA","height":"5' 10\" (1.78 m)","bio":"John Ventimiglia was born on July 17, 1963 in Ridgewood, Queens, New York, USA. He is an actor and writer, known for The Sopranos (1999), The Iceman (2012) and Operation Autumn (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MzMzMDY5N15BMl5BanBnXkFtZTYwMjMxNjkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0893247","name":"John Ventimiglia","idIMDB":"nm0893247"},"actorId":"nm0893247","character":"Valenti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Griffin Dunne","urlProfile":"http://www.imdb.com/name/nm0001162","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzM4MzM3Nl5BMl5BanBnXkFtZTYwODIyMzYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1955","placeOfBirth":" New York City, New York, USA","birthName":"Thomas Griffin Dunne","height":"5' 7\" (1.7 m)","bio":"Griffin Dunne was born on June 8, 1955 in New York City, the oldest child of Dominick Dunne, a producer, actor, and writer, and Ellen Beatriz (Griffin) Dunne, an activist. His sister was actress Dominique Dunne. He grew up mainly in Los Angeles, California and attended school in Colorado before moving back to New York in the late 1970s. As an actor, Dunne has the distinction of having starred in two 1980s cult favorites. First came the John Landis monster movie An American Werewolf in London (1981), then the Martin Scorsese black comedy After Hours (1985). After Hours is also among the movies that Dunne has produced with partner Amy Robinson through their company Double Play Productions. Other Double Play productions include Running on Empty (1988), White Palace (1990) and Once Around (1991). Dunne has continued to appear on both sides of the camera, taking supporting roles as an actor in films like My Girl (1991) and I Like It Like That (1994). He made his directorial debut with a short film, Duke of Groove (1996), which was nominated for an Oscar. Dunne then made the leap to feature films with Addicted to Love (1997), Practical Magic (1998), Lisa Picard Is Famous (2000) and Fierce People (2005). Dunne produced and starred in the film Game 6 (2005), which premiered at the Sundance Film Festival in 2005. Griffin's ancestry is Irish (from his father) and Irish, English, German, Mexican, and Swedish (from his mother).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzM4MzM3Nl5BMl5BanBnXkFtZTYwODIyMzYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001162","name":"Griffin Dunne","idIMDB":"nm0001162"},"actorId":"nm0001162","character":"McNally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamie Hector","urlProfile":"http://www.imdb.com/name/nm0373100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NjcwNTMwN15BMl5BanBnXkFtZTgwNzIzMTQ0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1975","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' (1.83 m)","bio":"Jamie Hector (born October 7, 1975 in Brooklyn, New York, U.S.) is an American actor of Haitian descent who is known for his portrayal of Marlo Stanfield on the critically acclaimed HBO series The Wire. Jamie Hector began acting immediately after high school when he auditioned for a community theater company. He then enrolled in college while he continued to audition and book roles on New York Undercover, Third Watch, Law & Order, Law & Order: Special Victims Unit, and The Beat. His film work dates back to Spike Lee's Clockers. From there he went on to appear in He Got Game, Ghost Dog, Prison Song, and Everyday People. In 2002 Hector had a brief role in the movie Paid in Full. Hector attributes a defining moment in his career to the 2003 short film Five Deep Breaths directed by Seith Mann. With Hector in the lead role Five Deep Breaths was an Official Selection of the Cannes, Sundance, Tribeca, and IFP Film Festivals; it went on to accumulate 16 awards. David Simon, the creator of The Wire, cited Five Deep Breaths as the movie that brought Hector to his attention, and led him to be cast as Marlo Stanfield. Hector starred in the 2007 film Blackout with Melvin Van Peebles and Jeffrey Wright, and was featured as recurring villain Benjamin \"Knox\" Washington in the third season of Heroes. In 2008, Hector also appeared in the film Max Payne, in which he plays the role of Lincoln DeNeuf, a Haitian crime boss. In 2009 Hector appeared in the movie Just Another Day, playing the up-and-coming rapper Young Eastie, who attempts to make it at all costs. In 2010 he had a role in Night Catches Us and began filming The Gift. He voiced Emile-A239 (Noble 4) in Halo: Reach. He had a minor role in Season 2 of Jericho episode 7 where he played a corporal for the Allied States of America. In 2011, Jamie made an appearance on CSI Miami as Jean Guiton in the episode \"Hunting Ground\". In 2012, Jamie made a brief appearance on Common Law in the episode \"Hot for Teacher\". Recently, he has been in the Show Person of Interest As Link of the gang Brotherhood. So far appearing in 2 episodes","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NjcwNTMwN15BMl5BanBnXkFtZTgwNzIzMTQ0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0373100","name":"Jamie Hector","idIMDB":"nm0373100"},"actorId":"nm0373100","character":"Nick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yul Vazquez","urlProfile":"http://www.imdb.com/name/nm0891485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNDE4MjU4M15BMl5BanBnXkFtZTgwNTI5MDk0NjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Yul Vazquez is an actor, known for Captain Phillips (2013), The Infiltrator (2016) and The A-Team (2010). He has been married to Linda Larkin since May 18, 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNDE4MjU4M15BMl5BanBnXkFtZTgwNTI5MDk0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0891485","name":"Yul Vazquez","idIMDB":"nm0891485"},"actorId":"nm0891485","character":"Fabio De Soto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eve Hewson","urlProfile":"http://www.imdb.com/name/nm2016723","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5ODUwNzQ3OV5BMl5BanBnXkFtZTcwNTE5MTYzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1991","placeOfBirth":" Ireland","birthName":"Memphis Eve Hewson","height":"5' 1\" (1.55 m)","bio":"Eve Hewson was born on July 7, 1991 in Ireland as Memphis Eve Hewson. She is an actress, known for Bridge of Spies (2015), This Must Be the Place (2011) and Enough Said (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5ODUwNzQ3OV5BMl5BanBnXkFtZTcwNTE5MTYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2016723","name":"Eve Hewson","idIMDB":"nm2016723"},"actorId":"nm2016723","character":"Yvonne","urlCharacter":"http://www.imdb.com/character/ch0503546","main":true}],"seasons":[],"idIMDB":"tt1747958","urlIMDB":"http://www.imdb.com/title/tt1747958","business":{"budget":{"money":"$25,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$26,912","country":"USA","day":"23","month":"03","year":"2014","remarks":"28 Screens"},{"money":"$126,256","country":"Belgium","day":"30","month":"10","year":"2013","remarks":"27 Screens"},{"money":"$1,797,864","country":"France","day":"30","month":"10","year":"2013","remarks":"433 Screens"}],"gross":[{"money":"$41,229","country":"USA","day":"30","month":"03","year":"2014","remarks":""},{"money":"$26,912","country":"USA","day":"23","month":"03","year":"2014","remarks":""},{"money":"$2,415,472","country":"worldwide","day":"08","month":"06","year":"2014","remarks":""},{"money":"$223,880","country":"Belgium","day":"24","month":"11","year":"2013","remarks":""},{"money":"$2,049,720","country":"France","day":"17","month":"11","year":"2013","remarks":""}],"weekendGross":[{"money":"$1,873","country":"USA","day":"30","month":"03","year":"2014","remarks":"5 Screens"},{"money":"$26,912","country":"USA","day":"23","month":"03","year":"2014","remarks":"28 Screens"},{"money":"$40,648","country":"Belgium","day":"06","month":"11","year":"2013","remarks":"23 Screens"},{"money":"$126,256","country":"Belgium","day":"30","month":"10","year":"2013","remarks":"27 Screens"},{"money":"$69,121","country":"France","day":"13","month":"11","year":"2013","remarks":"220 Screens"},{"money":"$398,821","country":"France","day":"06","month":"11","year":"2013","remarks":"415 Screens"},{"money":"$1,797,864","country":"France","day":"30","month":"10","year":"2013","remarks":"433 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"30","month":"04","year":"2012","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["2 hr 7 min (127 min)","2 hr 24 min (144 min) (Cannes) (France)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus, Zeiss Ultra Prime and Angenieux Optimo Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","ProRes 4:4:4 (1080p/24) (source format)"],"printedFilmFormat":null},"rating":"6.5","metascore":"45","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[],"votes":"15,579","type":"Movie","companyCreditsSimple":[{"idCompany":"co0044413","name":"Les Productions du Trésor"},{"idCompany":"co0001099","name":"Worldview Entertainment"},{"idCompany":"co0086683","name":"Caneo Films"}],"keywords":{"keywords":["murder","1970s","flashback","love","money","policeman","police","new york city","family relationships","brother brother relationship","remake of french film","based on story","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:36:26"}}