{"data":{"movies":[{"title":"The Collection","originalTitle":"","year":"2012","releaseDate":"20121130","directors":[{"name":"Marcus Dunstan","id":"nm1729303"}],"writers":[{"name":"Patrick Melton","id":"nm1733317"},{"name":"Marcus Dunstan","id":"nm1729303"}],"runtime":"82 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ0MDgzNDA0NV5BMl5BanBnXkFtZTcwNDM4MDQ1OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"Arkin escapes with his life from the vicious grips of \"The Collector\" during an entrapment party where he adds beautiful Elena to his \"Collection.\" Instead of recovering from the trauma, Arkin is suddenly abducted from the hospital by mercenaries hired by Elena's wealthy father. Arkin is blackmailed to team up with the mercenaries and track down The Collector's booby trapped warehouse and save Elena.","simplePlot":"A man who escapes from the vicious grips of the serial killer known as \"The Collector\" is then forced to help rescue an innocent girl from the killer's booby-trapped lair.","actors":[{"actorName":"Josh Stewart","urlProfile":"http://www.imdb.com/name/nm1577637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTk3NTk3M15BMl5BanBnXkFtZTcwNDE2NTAzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1977","placeOfBirth":" Diana, West Virginia, USA","birthName":"Joshua Regnall Stewart","height":"5' 10\" (1.78 m)","bio":"Joshua Regnall Stewart was born in Diana, West Virginia, to Margie (Skidmore) and Charles Regnall Stewart, a teacher and Baptist pastor. He studied at the T. Schreiber studios in New York City and was a company member of the 13th Street Repertory Theatre. He continued his work in theater in Los Angeles performing in 'Light Bulb,' and 'Beacon' alongside 'Robert Forster' and Brooke Shields. He is a competitive snowboarder and boxer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTk3NTk3M15BMl5BanBnXkFtZTcwNDE2NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1577637","name":"Josh Stewart","idIMDB":"nm1577637"},"actorId":"nm1577637","character":"Arkin","urlCharacter":"http://www.imdb.com/character/ch0151176","main":true},{"actorName":"Emma Fitzpatrick","urlProfile":"http://www.imdb.com/name/nm3500747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MTE1OTE2Nl5BMl5BanBnXkFtZTgwMDE4MjYzNDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1985","placeOfBirth":" Marion, Ohio, USA","height":"5' 7\" (1.7 m)","bio":"Emma Fitzpatrick was born on March 20, 1985 in Marion, Ohio, USA. She is an actress, known for The Social Network (2010), The Collection (2012) and In Time (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MTE1OTE2Nl5BMl5BanBnXkFtZTgwMDE4MjYzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3500747","name":"Emma Fitzpatrick","idIMDB":"nm3500747"},"actorId":"nm3500747","character":"Elena","urlCharacter":"http://www.imdb.com/character/ch0336394","main":true},{"actorName":"Christopher McDonald","urlProfile":"http://www.imdb.com/name/nm0001520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkyNDMxODc3M15BMl5BanBnXkFtZTgwNzQ3OTM2NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1955","placeOfBirth":" New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"Christopher McDonald was born and raised in New York City, New York, to Patricia, a real estate agent, and James R. McDonald, an educator. His breakout role was in Ridley Scott's Thelma and Louise (1991), followed shortly by playing Jack Barry in Robert Redford's Quiz show (1994). Other notable performances include Into Thin Air (1997) as John Krakauher and Tappy Timmons in Requiem for a Dream (2000) opposite Ellen Burstyn. Chris has co-starred in hit comedies Happy Gilmore, American Pie, Flubber and Leave it to Beaver. Harry's Law, Boardwalk Empire and Family Law highlight his television credits. Trained by legendary acting teacher Stella Adler and also at the Royal Academy of Dramatic Art, Chris has been singled out by the New York Times as one of the most prolific actor's in Hollywood. He has performed in over 100 films spanning thirty five years. His 40 stage credits include Billy Flynn in the Broadway production of Chicago and the 2013 hit, Lucky Guy opposite Tom Hanks. Since the loss of two siblings and a parent to cancer, Chris has been an active supporter of the Make a Wish foundation along with charities which help cancer research. He participates in celebrity fund raising events throughout the world. A graduate of Hobart and William Smith college in 1977, he is a principle donor for the building of their new performing arts center.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkyNDMxODc3M15BMl5BanBnXkFtZTgwNzQ3OTM2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001520","name":"Christopher McDonald","idIMDB":"nm0001520"},"actorId":"nm0001520","character":"Mr. Peters","urlCharacter":"http://www.imdb.com/character/ch0357419","main":true},{"actorName":"Lee Tergesen","urlProfile":"http://www.imdb.com/name/nm0855564","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjQ3Nzc2MV5BMl5BanBnXkFtZTcwMTIwOTQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1965","placeOfBirth":" Ivoryton, Connecticut, USA","birthName":"Lee Allen Tergesen","height":"5' 10½\" (1.79 m)","bio":"He was born on July 8, 1965 in Ivoryton, Connecticut and is a graduate of the American Musical and Dramatic Academy. His brother, Chris Tergesen, is a music supervisor and music editor. Lee has been married three times and has been married to Yuko Otomo, an art therapist, since 2011. They have a daughter, Lily, born in 2012. While working as a waiter, he did his first stage work in New York. He landed his first major movie parts in Point Break - Extrême limite (1991), Wayne's World (1992) and Wayne's World 2 (1993). In 1993, he played a recurring character, Chris Thormann, on Homicide: Life on the Street (1993). Next year, he got a starring role as Chett Donnelly on Weird Science (1994), which lasted until 1998. In 1997, he got another starring tv role on HBO's Oz (1997), as Tobias Beecher. It lasted until 2003. Since Oz, he has appeared mostly on tv. He has had recurring or starring roles on Rescue Me (2004), Wanted (2005), Desperate Housewives (2004), Generation Kill (2008), Army Wives (2007), The Big C (2010), Red Widow (2013), Longmire (2012), The Americans (2013), Alpha House (2013) and American Horror Story (2011). After the Wayne's World movies, he has appeared in movies like Shaft (2000), Monster (2003), The Forgotten (2004), The Texas Chainsaw Massacre: The Beginning (2006), Silver Tongues (2011), Red Tails (2012) and The Collection (2012). Lee has also been busy in commercials. His \"I love you, man!\" line from Wayne's World (1992) was used by Budweiser in its beer commercials. Between 2003-2004, he provided the voice-over in Advil's commercials. Between 2011-2012, he provided the voice-over of TV commercials in Ally Bank's \"People Sense\" ad campaign.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjQ3Nzc2MV5BMl5BanBnXkFtZTcwMTIwOTQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0855564","name":"Lee Tergesen","idIMDB":"nm0855564"},"actorId":"nm0855564","character":"Lucello","urlCharacter":"http://www.imdb.com/character/ch0496285","main":true},{"actorName":"Tim Griffin","urlProfile":"http://www.imdb.com/name/nm0341377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NTg0MzU5Nl5BMl5BanBnXkFtZTgwMDM5MDgwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1969","placeOfBirth":" Chicago, Illinois, USA","birthName":"Timothy Collins Griffin","bio":"Chicago native Tim Griffin, often known as, \"the actor who is in everything,\" has amassed a dizzying list of credits, and over the years has solidified his reputation as one of Hollywood's nicest, most charming and versatile actors. The son of a pediatric cardiologist, he first discovered acting after being cast as Oliver Twist in a school performance of the musical \"Oliver!\" As a teen Griffin would star in numerous theatrical productions for \"The Body Politic\" and \"New Haven Playhouse,\" as well local movies and commercials. After graduating from Francis Parker High School (among classmates Paul Adelstein, Anne Heche, and novelist Brad Thor), Griffin made the choice to put acting on the back-burner to enroll in the University of Vermont (UVM) where he graduated with a double major in political philosophy and English literature. Griffin performed as a regular member of the UVM Players (as Claudio in \"Much Ado About Nothing\" and Riff in \"West Side Story\"). Fate intervened his sophomore year while driving back to Chicago when his car broke down outside New York City. While waiting for it to be repaired, his agents asked him to audition for a TV movie called \"Taking A Stand.\" He was cast in the leading role of the all-star production (Betty Buckley, Jane Adams, Michael Beach). The show went on to win a Daytime Emmy for \"Outstanding Children's Special.\" Following this success, Griffin turned down a scholarship to study abroad at the University of Kent in England, and went to Hollywood. Giving himself the extreme grand total of one year to make or break his career, he enrolled in classes at UCLA and signed with Writers and Artists. He quickly went on to star in high-profile TV shows and movies of the week, including \"China Beach,\" \"In The Heat of the Night,\" and Michael Zinberg's autobiographical, coming-of-age drama \"For The Very First Time.\" Rejecting the advice of his agents, he elected to return to the University of Vermont to finish up his Bachelor's Degree. He considered attending graduate school for political philosophy, but his academic mentor convinced him to return to the West Coast and continue to pursue his acting career, noting that the scholarly life would always be there to fall back on if \"things didn't pan out.\" Unsure whether working as a \"teen actor\" came with an expiration date, he picked up right where he left off, landing recurring stints on \"General Hospital,\" the critically acclaimed \"Against The Grain\" (co-starring \"Southland's\" Mike Cudlitz, and Ben Affleck), and a near-unrecognizable turn as the autistic Richie Grayson on \"Party of Five.\" His reputation as a multi-talented actor began to grow, and in 1996, director John Singleton gave Griffin his first break into features, casting him in \"Higher Learning\" (Jennifer Connelly, Lawrence Fishburne) as the orientation announcer at a pep rally whose booming message was \"How many people came here to change the world?!\" In his hilarious recurring role as T.R. Knight's brother, Ronny O'Malley,\" on \"Grey's Anatomy,\" Griffin is best know for shooting his own dad in the butt. He became even more recognizable in 2004 when he was cast in \"The Bourne Supremacy,\" the second installment of the legendary franchise. As \"Nevins\", a hapless CIA agent who interrogates the eerily silent Bourne (Matt Damon), he's repeatedly stonewalled and smugly says \"You're going to play ball one way or another...\" During filming, Damon (by pure accident) really cracked Griffin across the bridge of his nose, giving him a deviated septum. Griffin's blockbuster streak continues with credits that include Jon Favreau's \"Iron Man,\" and more than a few projects for the brilliant J.J. Abrams, such as \"Cloverfield,\" \"Star Trek\"(where Abrams directed him as the doomed UFSS Kelvin's Chief Engineer in the opening sequence) and in the upcoming \"Super 8\"(Elle Fanning). Being handpicked to star alongside and be directed by George Clooney in the 1920's football romp, \"Leatherheads\" (also starring Renee Zellweger) was a huge thrill. He re-teamed with Clooney again in the comedy \"The Men Who Stare at Goats\" (featuring Academy Award winners Kevin Spacey and Jeff Bridges). Griffin earned critical praise for his work in Doug Liman's true-life spy drama \"Fair Game\" as Paul, the lead CIA analyst charged with the unenviable task of taking on Scooter Libby (David Andrews) over the now infamous \"yellow cake uranium.\" Starring Academy Award winner Sean Penn and Naomi Watts, \"Fair Game\" was awarded screen writing honors by the Writer's Guild of America, and a New York Film Critics award. In addition to multiple recognizable commercial campaigns and television spots, Griffin has had numerous high profile projects in the past few years, including roles in feature films such as Chris Weitz's \"A Better Life,\" John Singleton's \"Abduction\" starring Taylor Lautner and Clint Eastwood's \"American Sniper.\" On television, Griffin has starred in the Peter Berg produced NBC primetime drama \"Prime Suspect,\" with Maria Bello and Aidan Quinn and had a major arc on the hit USA drama \"Covert Affairs\" opposite Kari Matchett. Up next, Griffin will play Special Agent \"Adam Hassler\" in the Fox event series \"Wayward Pines\" from M. Night Shyamalan. Griffin lives with his wife and their two children in L.A. With his wife, he has built and remodeled several homes. He's a proud Irish-American ridiculously devoted to the Chicago Cubs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NTg0MzU5Nl5BMl5BanBnXkFtZTgwMDM5MDgwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341377","name":"Tim Griffin","idIMDB":"nm0341377"},"actorId":"nm0341377","character":"Dre","urlCharacter":"http://www.imdb.com/character/ch0496286","main":true},{"actorName":"Andre Royo","urlProfile":"http://www.imdb.com/name/nm0747420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MDMwNTMzNF5BMl5BanBnXkFtZTgwOTI0ODAxNjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1968","placeOfBirth":" Bronx, New York, USA","height":"5' 7\" (1.7 m)","bio":"Andre Royo was born on July 18, 1968 in Bronx, New York, USA. He is an actor and producer, known for The Wire (2002), The Spectacular Now (2013) and Super (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MDMwNTMzNF5BMl5BanBnXkFtZTgwOTI0ODAxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0747420","name":"Andre Royo","idIMDB":"nm0747420"},"actorId":"nm0747420","character":"Wally","urlCharacter":"http://www.imdb.com/character/ch0496287","main":true},{"actorName":"Randall Archer","urlProfile":"http://www.imdb.com/name/nm1313581","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk1MDk5NTM2OF5BMl5BanBnXkFtZTcwMTc1MTk2OA@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Randall Archer is an American Actor/Stunt Performer and is known for his work on Angel (1999), Alice in Wonderland (2010), Pirates of the Caribbean: On Stranger Tides (2011), and The Collection (2012) in which he portrayed the character The Collector. Randall has also been in many other films as a Stunt Performer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk1MDk5NTM2OF5BMl5BanBnXkFtZTcwMTc1MTk2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1313581","name":"Randall Archer","nicknames":["Randy"],"idIMDB":"nm1313581"},"actorId":"nm1313581","character":"The Collector","urlCharacter":"http://www.imdb.com/character/ch0154942","main":true},{"actorName":"Shannon Kane","urlProfile":"http://www.imdb.com/name/nm2000144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjQ3NTgzMF5BMl5BanBnXkFtZTcwNDQ3NDUxNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Shannon Kane is an actress, known for All My Children (1970), Brooklyn's Finest (2009) and The Collection (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNjQ3NTgzMF5BMl5BanBnXkFtZTcwNDQ3NDUxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2000144","name":"Shannon Kane","idIMDB":"nm2000144"},"actorId":"nm2000144","character":"Paz","urlCharacter":"http://www.imdb.com/character/ch0496288","main":true},{"actorName":"Brandon Molale","urlProfile":"http://www.imdb.com/name/nm0596404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTk2MjczOV5BMl5BanBnXkFtZTgwMjk5MjEzODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1971","placeOfBirth":" Pocatello, Idaho, USA","height":"6' 4\" (1.93 m)","bio":"At 6' 4\", Brandon Molale is no stranger to standing out on the big screen. Brandon, a former college and pro football player, is best known from his scene-stealing performance as Kevin Ward, the obnoxious NY Jets Quarterback in Mr. Deeds (2002) starring Adam Sandler and as Blazer in Dodgeball: A True Underdog Story (2004). Brandon continues to be one of the hardest working actors in Hollywood. Molale's good looks, athletic prowess and talent often get him cast in very physical roles. He has appeared in over 150 feature films and television shows including: Scandal (2012), Sons of Anarchy (2008), True Blood (2008), Bones (2005), The Mentalist (2008), NCIS (2003), NCIS: Los Angeles (2009), Agents of S.H.I.E.L.D. (2013), Reno 911! (2003), The Longest Yard (2005), Collateral (2004), iCarly (2007), Desperate Housewives (2004), It's Always Sunny in Philadelphia (2005), Mission: Impossible III (2006), Boston Legal (2004), and That '70s Show (1998). Brandon is involved with numerous national and local charities. Raised in Concord, California, Molale is also known as \"Hollywood Dog\". He played football for the Fresno State Bulldogs where he graduated with a BA in Advertising and Marketing. It was in college that he started taking drama and acting classes. His football skills led him to performing football stunts in The Waterboy (1998) starring Adam Sandler. Molale lives in Los Angeles with his son and dog. Brandon collects vintage guitar picks from famous rock bands and guitarists.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTk2MjczOV5BMl5BanBnXkFtZTgwMjk5MjEzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0596404","name":"Brandon Molale","idIMDB":"nm0596404"},"actorId":"nm0596404","character":"Lin","urlCharacter":"http://www.imdb.com/character/ch0496289","main":true},{"actorName":"Erin Way","urlProfile":"http://www.imdb.com/name/nm2338525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMjcxMjAyOV5BMl5BanBnXkFtZTgwMjIwNzI0OTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1987","placeOfBirth":" Portland, Oregon, USA","height":"5' 2\" (1.57 m)","bio":"A former ballet dancer, Way got the acting bug while in high school and has never looked back. She has already worked with such names as Mark Ruffalo, Bryce Dallas Howard, Ron Howard, and Joe Dante. She comes from a family of six children and was home schooled with her two brothers through high school. She lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMjcxMjAyOV5BMl5BanBnXkFtZTgwMjIwNzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2338525","name":"Erin Way","idIMDB":"nm2338525"},"actorId":"nm2338525","character":"Abby","urlCharacter":"http://www.imdb.com/character/ch0496290","main":true},{"actorName":"Johanna Braddy","urlProfile":"http://www.imdb.com/name/nm1715189","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTU2MjMyMF5BMl5BanBnXkFtZTgwOTQxNDU2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1987","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Johanna Elizabeth Braddy","height":"5' 7¼\" (1.71 m)","bio":"Johanna is known for her work in Greek (2007), Video Game High School (2012) and Paranormal Activity 3 (2011). Born in Atlanta, Georgia, she began her career in the arts, working with The Atlanta Workshop Players, a performing arts company. Classically-trained singer Braddy initially planned to pursue a career in opera. After booking recurring roles on Avatar: The Last Airbender (2005) and The Riches (2007), Braddy made the move out to Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTU2MjMyMF5BMl5BanBnXkFtZTgwOTQxNDU2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1715189","name":"Johanna Braddy","idIMDB":"nm1715189"},"actorId":"nm1715189","character":"Missy","urlCharacter":"http://www.imdb.com/character/ch0496291","main":true},{"actorName":"Michael Nardelli","urlProfile":"http://www.imdb.com/name/nm1660148","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTk4ODY2Ml5BMl5BanBnXkFtZTgwMTQ0OTUxODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Michael Scott Nardelli","height":"5' 11\" (1.8 m)","bio":"Actor and Filmmaker Michael Nardelli can be seen starring in the psychological thriller Circle (2015). Co-starring Julie Benz and Carter Jenkins, Circle focuses on 50 strangers who are held captive. They face imminent execution and are forced to choose the one person among them who deserves to live. The film premiered at the 2015 Seattle International Film Festival, where it was highlighted as part of the festival's Catalyst program for exciting new filmmakers. It also screened at the 2015 San Diego Comic Con, and the 2015 Savannah Film Festival. Circle was purchased by Netflix and released it in October of 2015. Film Buff distributed the film on all VOD platforms that same year. It's become a cult hit; with fans still debating it's themes and ending online. You can buy the film on iTunes. Michael made his professional acting debut as Stradivarius Helberg on the television show Quintuplets. He then co-starred in the independent film the Derby Stallion opposite Zac Efron and the comedy Grassroots with Jason Biggs. Soon after, Michael portrayed a lovesick teenager in the 3D horror film The Collection, and he has recurred on various television shows including My Name is Earl, CSI: New York, The Client List, The Mob Doctor, Revenge, Nashville and Hart of Dixie. Michael recently completed a role in the independent film The Tribe from first-time director Roxy Shih. He plays a psychologically tormented young man left to survive on his own in a post-apocalyptic desert. Michael was nominated for Best Lead Actor by the Nice International Filmmaker Festival of World Cinema for his performance in The Tribe. Michael can be seen on TV's American Crime Story: The People Vs. OJ Simpson and the indie thriller Cassidy Way. A comedic short film he wrote/produced/stars in titled We'll Get It is also making its way across the film festival circuit. In 2010, Michael established himself as an independent film producer. His films include Another Happy Day, where he acted opposite Ezra Miller, Kate Bosworth and Demi Moore. It won the Waldo Salt Award for Best Screenplay at the 27th Sundance Film Festival and was an Official Selection in the Sundance Dramatic Competition that year. Another Happy Day was released theatrically by Phase4 later that year. Michael went on to produce the romantic comedy The Giant Mechanical Man starring Jenna Fischer, Topher Grace, Malin Akerman, Chris Messina, Lucy Punch and Bob Odenkirk. It was an Official Selection of the Tribeca Film Festival in 2012, and purchased by Tribeca Film for theatrical distribution that year. Michael's directorial debut came in the short film Dennis Doesn't Live Here Anymore. The short is a satirical dark comedy featuring a character Michael created while studying with famed LA improv troupe The Groundlings. It premiered at the 2015 LA Comedy Fest and 2015 Palm Shortfest & Film Market. The short also went on to win Best Short Film at the 2015 Atlanta Underground Film Festival, and Michael won Best Male Actor in A Short at the 2015 Chicago Comedy Film Festival. The film also played at Savannah Film Festival in 2015. It can now be seen on Vimeo, Youtube, and Shorts.TV Later this year, Michael will direct his first feature film entitled The Transgression, from a screenplay he wrote. He's also developed and executive-producing Stardrive, a serialized science-fiction television show. He is shooting Dark/Web, a horror-anthology series he created with Circle director Mario Miscione and brother Tim Nardelli. It will launch on the popular film blog LRMonline.com in 2016. Michael has written, produced and starred in several webisodes for FunnyorDie and is an active contributor to the website. Outside of work, he is involved with a number of charities, including the Path Organization and Autism Speaks. He's also a self-proclaimed science fiction, comic book and gamer nerd. He received his bachelor's degree in film and theater from University of Southern California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTk4ODY2Ml5BMl5BanBnXkFtZTgwMTQ0OTUxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1660148","name":"Michael Nardelli","nicknames":["Mike","Nards"],"idIMDB":"nm1660148"},"actorId":"nm1660148","character":"Josh","urlCharacter":"http://www.imdb.com/character/ch0496292","main":true},{"actorName":"Will Peltz","urlProfile":"http://www.imdb.com/name/nm3816797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTk3NzkyNV5BMl5BanBnXkFtZTgwOTgyMzYxNzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1986","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Will Peltz was born on May 30, 1986 in New York City, New York, USA. He is an actor, known for In Time (2011), Unfriended (2014) and Paranoia (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTk3NzkyNV5BMl5BanBnXkFtZTgwOTgyMzYxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3816797","name":"Will Peltz","idIMDB":"nm3816797"},"actorId":"nm3816797","character":"Brian","urlCharacter":"http://www.imdb.com/character/ch0496293","main":true},{"actorName":"Daniel Sharman","urlProfile":"http://www.imdb.com/name/nm1528476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjMwMzcyOF5BMl5BanBnXkFtZTcwMzgwMTAwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1986","placeOfBirth":" London, England, UK","birthName":"Daniel Andrew Sharman","height":"6' 1½\" (1.87 m)","bio":"Daniel Sharman was born in London. He began working as an actor at The Royal Shakespeare Company before going on to train for three years at The London Academy of Dramatic Art in 2007. After which he performed in many theatrical productions in London and Europe. He lives in Los Angeles and London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjMwMzcyOF5BMl5BanBnXkFtZTcwMzgwMTAwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1528476","name":"Daniel Sharman","idIMDB":"nm1528476"},"actorId":"nm1528476","character":"Basil","urlCharacter":"http://www.imdb.com/character/ch0389038","main":true},{"actorName":"Justin Mortelliti","urlProfile":"http://www.imdb.com/name/nm2271520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTQ1OTI5Nl5BMl5BanBnXkFtZTgwNDUzMDE1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1980","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 10\" (1.78 m)","bio":"Justin Mortelliti was born on August 30, 1980 in Philadelphia, Pennsylvania, USA. He is known for his work on TURN: Washington's Spies (2014), The Collection (2012) and Puppet Master (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTQ1OTI5Nl5BMl5BanBnXkFtZTgwNDUzMDE1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2271520","name":"Justin Mortelliti","idIMDB":"nm2271520"},"actorId":"nm2271520","character":"Zack","urlCharacter":"http://www.imdb.com/character/ch0496294","main":true}],"seasons":[],"idIMDB":"tt1748227","urlIMDB":"http://www.imdb.com/title/tt1748227","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,104,269","country":"USA","day":"02","month":"12","year":"2012","remarks":"1,403 Screens"}],"gross":[{"money":"$6,842,058","country":"USA","day":"09","month":"04","year":"2013","remarks":""},{"money":"$5,455,328","country":"USA","day":"09","month":"12","year":"2012","remarks":""},{"money":"$3,104,269","country":"USA","day":"02","month":"12","year":"2012","remarks":""}],"weekendGross":[{"money":"$529,158","country":"USA","day":"16","month":"12","year":"2012","remarks":"621 Screens"},{"money":"$1,487,655","country":"USA","day":"09","month":"12","year":"2012","remarks":"1,403 Screens"},{"money":"$3,104,269","country":"USA","day":"02","month":"12","year":"2012","remarks":"1,403 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"18","month":"01","year":"2011","remarks":null},{"money":null,"country":null,"day":"25","month":"02","year":"2011","remarks":null}],"copyrightHolder":"Copyright © 2011 Odd Box 2, LLC."},"technical":{"runtime":["1 hr 22 min (82 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Hawk V-Lite and V-Series Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Hawk Scope (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3514DI)","D-Cinema"]},"rating":"6.1","metascore":"36","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"37,638","type":"Movie","companyCreditsSimple":[{"idCompany":"co0192696","name":"LD Entertainment"},{"idCompany":"co0194394","name":"Fortress Features"}],"keywords":{"keywords":["mercenary","booby trap","trap","serial killer","brainwashing","rube goldberg machine","hung upside down","impalement","pistol","shotgun","assault rifle","self mutilation","impersonating a police officer","severed finger","abandoned hotel","killer dog","broken arm","body landing on a car","severed tongue","massacre","maze","crushed to death","crushed head","torso cut in half","severed leg","severed arm","dismemberment","cut into pieces","husband wife relationship","brother sister relationship","child in peril","car crash","father daughter relationship","flashback","nightclub","news report","returning character with different actor","sequel","title spoken by character","surprise ending","escape","death","torture","hospital","party","sadistic horror","female nudity","woman punches a man","killing a dog","circular saw","attracting attention","building fire","climbing down a rope","setting a broken arm","locked in a cage","fuse","tied to a bed","swat","german shepherd","grenade","pleading for help","screaming for help","hanging upside down","nailed to a wall","camera shot of feet","held captive","human skeleton","cadaver","spider crawling on face","locked in a box","breaking a car window","close up of eye","peephole","tied to a table","crashing through a window","falling onto a car","death machine","mass murder","dancing","obscene finger gesture","rave","subjective camera","mexican standoff","standoff","martial arts","slow motion scene","fistfight","violence","blood","chase","razor blade","gash in the face","crucifixion","lesbian kiss","raised middle finger","iron maiden","stabbed in the hand","homeless person","hung from a hook","ex convict","anti hero","bare chested male","title at the end","burned alive","firefighter","swat team","kicked in the face","punched in the face","revenge","person on fire","explosion","stabbed in the back","flickering light","spider","body in a trunk","exploding head","strapped to a bomb","exploding body","coercion","knife fight","knife","switchblade","throat slitting","kidnapping","syringe","stabbed to death","stabbed through the chin","survival horror","stabbed in the face","stabbed in the chest","stabbed in the stomach","stabbed in the arm","stabbed in the shoulder","shot to death","shot in the chest","junkie","arm cast","title appears in writing","trip wire","killing an animal","severed head","bear trap","captivity","skull","skeleton","corpse","character's point of view camera shot","thrown through a window","hearing aid","rescue mission","blood splatter","slaughter","younger version of character","cheating boyfriend","murder","gore","lens flare","character says i love you","character repeating someone else's dialogue","broken leg","masked man","death of friend"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:39:09"}}