{"data":{"movies":[{"title":"Sausage Party","originalTitle":"","year":"2016","releaseDate":"20160812","directors":[{"name":"Greg Tiernan","id":"nm0862911"},{"name":"Conrad Vernon","id":"nm0970447"}],"writers":[{"name":"Kyle Hunter","id":"nm3773434"},{"name":"Ariel Shaffir","id":"nm3782043"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxOTk1MzY4MF5BMl5BanBnXkFtZTgwODQzOTU5ODE@._V1.jpg","countries":["USA","Cambodia"],"languages":["English"],"genres":["Animation","Adventure","Comedy","Fantasy"],"plot":"The products at Shopwell's Grocery Store are made to believe a code that helps them live happy lives until it's time for them to leave the comfort of the supermarket and head for the great beyond. However, after a botched trip to the great beyond leaves one sausage named Frank and his companion Bun stranded, Frank goes to great lengths (pun intended) to return to his package and make another trip to the great beyond. But as Frank's journey takes him from one end of the supermarket to the other, Frank's quest to discover the truth about his existence as a sausage turns incredibly dark. Can he expose the truth to the rest of the supermarket and get his fellow products to rebel against their human masters?","simplePlot":"A sausage strives to discover the truth about his existence.","actors":[{"actorName":"Alistair Abell","urlProfile":"http://www.imdb.com/name/nm0008533","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MDYxNDkwNV5BMl5BanBnXkFtZTgwMDk4NzgwMzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Alistair Abell was born in Wawanesa, Manitoba, Canada. He is an actor and producer, known for Sausage Party (2016), Freddy vs. Jason (2003) and Highlander: The Search for Vengeance (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MDYxNDkwNV5BMl5BanBnXkFtZTgwMDk4NzgwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0008533","name":"Alistair Abell","idIMDB":"nm0008533"},"actorId":"nm0008533","character":"Mariachi Salsa / Gefilte Fish","urlCharacter":"http://www.imdb.com/character/ch0559433","main":true},{"actorName":"Iris Apatow","urlProfile":"http://www.imdb.com/name/nm2957717","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0NTY2Nzc1OV5BMl5BanBnXkFtZTcwOTI5NjI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Iris Apatow is an actress, known for Sausage Party (2016), Knocked Up (2007) and This Is 40 (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0NTY2Nzc1OV5BMl5BanBnXkFtZTcwOTI5NjI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2957717","name":"Iris Apatow","idIMDB":"nm2957717"},"actorId":"nm2957717","character":"Berry Good Candies / Grape #3 / Coconut Milk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sugar Lyn Beard","urlProfile":"http://www.imdb.com/name/nm0063944","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ0NjQwNjU3OV5BMl5BanBnXkFtZTgwMTkyNzUxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1981","placeOfBirth":" Scarborough, Ontario, Canada","birthName":"Stephanie Lyn Beard","height":"4' 11\" (1.5 m)","bio":"Sugar Lyn Beard was born on August 27, 1981 in Scarborough, Ontario, Canada as Stephanie Lyn Beard. She is an actress, known for Sausage Party (2016), 50/50 (2011) and Mike and Dave Need Wedding Dates (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ0NjQwNjU3OV5BMl5BanBnXkFtZTgwMTkyNzUxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0063944","name":"Sugar Lyn Beard","nicknames":["Sugar","Sug","Suga BayBee"],"idIMDB":"nm0063944"},"actorId":"nm0063944","character":"Baby Carrot / Cookies","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Cera","urlProfile":"http://www.imdb.com/name/nm0148418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyNDgxMjUyOV5BMl5BanBnXkFtZTcwMDYxNzY1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1988","placeOfBirth":" Brampton, Ontario, Canada","birthName":"Michael Austin Cera","height":"5' 8½\" (1.74 m)","bio":"Canadian actor Michael Cera was born in Brampton, Ontario, to parents who worked for Xerox. His mother, Linda, who is from Quebec, has English, Irish, Scottish, and Dutch ancestry, and his father, Luigi Cera, is Sicilian. Michael is the middle child between two sisters. He was educated at Conestoga Public School, Robert H. Lagerquist Senior Public School and Heart Lake Secondary School until the grade nine. Cera then completed his high school education via correspondence. During a childhood illness he repeatedly viewed Ghostbusters (1984), learning the dialogue. It was this that sparked his interest in performing. He went on to take classes in improvisation at The Second City Toronto. Roles followed in commercials and TV, but he first came to major public attention when he was cast as George Michael Bluth in the critically acclaimed comedy series Arrested Development (2003). After the cancellation of this series, Cera successfully transitioned into movies, scoring starring roles in various projects such as Superbad (2007), Juno (2007), Youth in Revolt (2009) and as the eponymous hero in Scott Pilgrim vs. the World (2010). Alongside acting, Cera is also a musician - he sings and plays guitar and bass.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyNDgxMjUyOV5BMl5BanBnXkFtZTcwMDYxNzY1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0148418","name":"Michael Cera","nicknames":["Mike"],"idIMDB":"nm0148418"},"actorId":"nm0148418","character":"Barry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian James Corlett","urlProfile":"http://www.imdb.com/name/nm0003944","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2Njc4NzU2M15BMl5BanBnXkFtZTcwODU1NDQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1962","placeOfBirth":" Burnaby, British Columbia, Canada","bio":"Ian James Corlett was born on August 29, 1962 in Burnaby, British Columbia, Canada. He is an actor and writer, known for Sausage Party (2016), Adventures of Sonic the Hedgehog (1993) and Ranma ½ (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2Njc4NzU2M15BMl5BanBnXkFtZTcwODU1NDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003944","name":"Ian James Corlett","idIMDB":"nm0003944"},"actorId":"nm0003944","character":"Apple / Tickilish Licorice / Relish / Bag of Dog Food","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Daingerfield","urlProfile":"http://www.imdb.com/name/nm0197405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIxODQxNDQzNl5BMl5BanBnXkFtZTgwNDQ4Nzg3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1970","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Michael Daingerfield Hall","height":"6' 2\" (1.88 m)","bio":"Nominated for 2 Leo Awards as an actor, a ubcp/actra Award for Best Voice and a Leo Award for Screenwriting, Michael Daingerfield has been in the business for twenty years, working in Toronto, Los Angeles, New York and Vancouver. He's appeared in over sixty film and television roles; including Dreamcatcher opposite Morgan Freeman, Catwoman opposite Benjamin Bratt, The Messengers opposite Dylan McDermott and Tooth Fairy starring Dwayne 'The Rock' Johnson. In Television, Michael has had recurring Guest Starring roles on Smallville as Gordon Godfrey, Hermes on Olympus and Ned Foster on Arrow. Michael is also one of the busiest and most versatile voice artists in North America, his voice has appeared in over a thousand projects in various radio and TV commercials, animated series', promos, video games, and documentaries all over the world. He just completed narrating the 1st season of Cabin Truckers and the 6th season of Ice Pilots NWT. He's now playing 'Han Solo' on \"Lego Star Wars: Droid Tales\". You may recognize him as the voice of NBC, Truvia Sweetener, Nissan, Central Bank, Nautilus and Access Communications to name a few, and as characters in the animated series' Ace Ventura, Iron Man, George of the Jungle, Pucca, Inuyasha, Packages from Planet X, Kid vs Kat, Leap Frog, Barbie and Nerds and Monsters. Michael has also appeared in such Anime series as InuYasha, Gundam 00, No GO, Ghost in the Shell, The Story Of Saiunkoku, Death Note, Black Lagoon, Nana. In his spare time, Michael enjoys playing competitive tennis. In 2014 he was the #10 ranked doubles player in Canada in the Men's 40 and over category. Michael is currently living and working in Vancouver, he is represented by Andrew Webster at Webster Talent Management for FILM/TV and Ralph Streich at Red Talent Management for Voice-Over.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIxODQxNDQzNl5BMl5BanBnXkFtZTgwNDQ4Nzg3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197405","name":"Michael Daingerfield","nicknames":["Dainger"],"idIMDB":"nm0197405"},"actorId":"nm0197405","character":"Chunk Munchers Cereal / Light Bulb / Indian Chutney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Dobson","urlProfile":"http://www.imdb.com/name/nm0229889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU2Nzg5NjQ3NV5BMl5BanBnXkFtZTgwNzEzNTYyNTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1973","placeOfBirth":" England, UK","height":"6' 1\" (1.85 m)","bio":"Brian Dobson was born on September 9, 1973 in England. He is known for his work on Sausage Party (2016), Escape from Planet Earth (2013) and Fantastic Four: World's Greatest Heroes (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU2Nzg5NjQ3NV5BMl5BanBnXkFtZTgwNzEzNTYyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0229889","name":"Brian Dobson","idIMDB":"nm0229889"},"actorId":"nm0229889","character":"Italian Tomato / Lettuce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Dobson","urlProfile":"http://www.imdb.com/name/nm0229923","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MDYzMDk1NV5BMl5BanBnXkFtZTYwNjIxMTgy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1966","placeOfBirth":" Kingston upon Thames, London, England, UK","birthName":"Michael Richard Dobson","height":"6' 1\" (1.85 m)","bio":"Michael was born and raised in London, England and later immigrated to Canada with his family when he was sixteen years of age. Upon arrival in Toronto, Ontario, they eventually moved settled in Georgetown. He chose theater arts as an elective and it is there that Michael says \"He found his tribe'. Inspired by his Theater Arts teacher Michelle Mole, he was soon voicing all the school announcements and heavily involved in the high school theatrical productions. He would soon write, produce and perform his own show. He then joined and performed with the Georgetown Little Theater Company and Bramalea theater company The New Generation Players. He later created the curriculum and taught an after school theater program to grade seven and eights. Eventually Michael would move west to Victoria B.C. where he studied performing arts and art history at The University of Victoria. During this period he auditioned and became a member of The Corner Store Theater Company and Edna Browns Dinner Theater Company where he performed in several productions to great reviews! It was in Victoria where Michael was approached by the Creative Director Chris Ogilvie at CJVI and he first began voicing radio commercials as well as comedy sketches for the station. In the mid eighties the film industry was getting a foot hold in Vancouver, B.C. So, Michael made the move to Vancouver to pursue a film career. He continued to hone his craft at The Gastown Actors Studio and attended regular classes with veteran actor Claire Kaplan. Eventually he would guest star on TV Series such as , The X-Files, Stargate, Viper, Seven Days and many others as well as feature films. It was a chance meeting with fellow actor and now close friend Scott McNeil that Michael learned of the growing voice over industry in Vancouver and some advice to attend a workshop by renowned voice actor and director Sue Blu in Los Angeles who was coming to Vancouver to scout new talent by means of a workshop. Michael took the workshop and had a blast! Later Sue Blu would be back in town to cast GI Joe Extreme and Michael would land the role of Sgt. Savage. Many roles and many shows would follow...he's played more Super Villains and Super Heroes than you can shake Batman's Utility Belt at...everything from, Leonardo in the Mutant Ninja Turtles, Starscream in Transformers Armada, Energon and Cybertron, Cobra Commander in GI Joe, Niles Van Roekel in The Marvel Nemesis video game Rise of The Imperfects, Nappa in Dragon Ball Z, The Blob in X-Men, Ronan the Accuser in The Fantastic Four, Kazuki Fuse in Jin Roh, and yes he's played Batman as well as the Joker in Warner Premier's Batman Black & White! With a career that now spans 30 years he's a multi award winning actor who has voiced everything from animated series, video games, motion comics, radio and television commercials to movie trailers, audio books, documentaries and television station Id's for KVOS TV Bellingham. Wa. USA and NTV Canada. Michael resides in Vancouver, B.C. with his wife and four children. He is represented by The Characters Talent Agency in Vancouver B.C. and by Fountainhead Talent in Toronto, Ontario. Michael stars as Commander Ferrus Forge in Mattel's internationally released hit series \"Max Steel\", Disney DHX's \"Slugterra\" as Stoker, Drake and Millard as well as Rainmaker & The Weinstein Company's Animated Feature Film \"Escape from Planet Earth\" as Shanker's Father recently in theaters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MDYzMDk1NV5BMl5BanBnXkFtZTYwNjIxMTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0229923","name":"Michael Dobson","idIMDB":"nm0229923"},"actorId":"nm0229923","character":"Queso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Franco","urlProfile":"http://www.imdb.com/name/nm0290556","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTc0MjE5NV5BMl5BanBnXkFtZTcwNjgyODQwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1978","placeOfBirth":" Palo Alto, California, USA","birthName":"James Edward Franco","height":"5' 11\" (1.8 m)","bio":"Known for his breakthrough starring role on Freaks and Geeks (1999), James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James's mother, a writer, has occasionally acted. Growing up with his two younger brothers, Dave Franco, also an actor, and Tom Franco, James graduated from Palo Alto High School in 1996 and went on to attend UCLA, majoring in English. To overcome his shyness, he got into acting while studying there, which, much to his parents' dismay, he left after only one year. After fifteen months of intensive study at Robert Carnegie's Playhouse West, James began actively pursuing his dream of finding work as an actor in Hollywood. In that short time, he landed himself a starring role on Freaks and Geeks (1999). The show, however, was not a hit to its viewers at the time, and was canceled after its first year. Now, it has become a cult-hit. Prior to joining Freaks and Geeks (1999), Franco starred in the TV miniseries To Serve and Protect (1999). After that, he had a starring role in Whatever It Takes (2000). Although he'd been working steadily, it wasn't until the TNT made-for-television movie, James Dean (2001) that James rose to fan-magazine fame and got to show off his talent. Since then, he has been working non-stop. After losing the lead role to Tobey Maguire, James settled for the part of \"Harry Osborne\", Spider-Man's best friend in the summer 2002 major hit Spider-Man (2002). He returned to the Osborne role for the next two films in the trilogy. Next was Deuces Wild (2002) and City by the Sea (2002), in which Robert De Niro personally had him cast, after viewing his performance in James Dean (2001). He was recently seen in David Gordon Green's Pineapple Express (2008) opposite Seth Rogen, in George C. Wolfe's Nights in Rodanthe (2008), starring Richard Gere and Diane Lane and in Paul Haggis' In the Valley of Elah (2007), starring Tommy Lee Jones. Also starring opposite Sean Penn in Gus Van Sant's Milk (2008) in which his performance earned him an Independent Spirit Award for Best Supporting Actor. Definitely growing out of his shyness, James Franco is turning into a legend of his own.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTc0MjE5NV5BMl5BanBnXkFtZTcwNjgyODQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0290556","name":"James Franco","nicknames":["Ted, Teddy"],"idIMDB":"nm0290556"},"actorId":"nm0290556","character":"Druggie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Hader","urlProfile":"http://www.imdb.com/name/nm0352778","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3MzgwMjE3N15BMl5BanBnXkFtZTcwNjc2MjE3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1978","placeOfBirth":" Tulsa, Oklahoma, USA","height":"6' 1\" (1.85 m)","bio":"Bill Hader was born on June 7, 1978 in Tulsa, Oklahoma, USA. He is an actor and producer, known for Inside Out (2015), Superbad (2007) and Saturday Night Live (1975). He has been married to Maggie Carey since 2006. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3MzgwMjE3N15BMl5BanBnXkFtZTcwNjc2MjE3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0352778","name":"Bill Hader","idIMDB":"nm0352778"},"actorId":"nm0352778","character":"Firewater / Tequila / El Guaco","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Hanlin","urlProfile":"http://www.imdb.com/name/nm6386918","urlPhoto":"","biography":{"bio":"Ian Hanlin is an actor, known for Sausage Party (2016), Afflicted (2013) and Nexo Knights (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6386918","name":"Ian Hanlin","idIMDB":"nm6386918"},"actorId":"nm6386918","character":"Beet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Salma Hayek","urlProfile":"http://www.imdb.com/name/nm0000161","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMTk2NzM2Ml5BMl5BanBnXkFtZTcwNDQ4MjYzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1966","placeOfBirth":" Coatzacoalcos, Veracruz, Mexico","birthName":"Salma Valgarma Hayek-Jimenez","height":"5' 2\" (1.57 m)","bio":"One of Hollywood's most dazzling leading actresses, Salma Hayek was born on September 2, 1966, in the oil boomtown of Coatzacoalcos, Mexico. Hayek has freely admitted that she and her brother, Sami, were spoiled rotten by her well-to-do businessman father, Sami Hayek Dominguez, and her opera-singing mother, Diana Jiménez Medina. Her father is of Lebanese descent and her mother is of Mexican/Spanish ancestry. After having seen Willy Wonka & the Chocolate Factory (1971) in a local movie theatre, Salma decided she wanted to become an actress. At 12, she was sent to the Academy of the Sacred Heart in New Orleans, Louisiana, where she pulled pranks on the nuns by setting their clocks back three hours. She was soon expelled. Only after attending Mexico City's Universidad Iberoamericana did she feel ready to pursue acting seriously. She soon landed the title role in Teresa (1989), a hugely successful soap opera which earned her the star status in her native Mexico. However, anxious to make films and to explore her talent and passion, Hayek left both Teresa (1989) and Mexico in 1991. Heartbroken fans spread rumors that she was having a secret affair with Mexico's president and left to escape his wife's wrath. At long last, Salma made her way to Los Angeles. The 24 year old actress approached Hollywood with naïve enthusiasm, and quickly learned that Latin actresses were, if at all, typecast as the mistress maid or local prostitute. By late 1992, Hayek had landed only bit parts. She appeared on Street Justice (1991), The Sinbad Show (1993), Nurses (1991), and as a sexy maid on the HBO series Dream On (1990). She also had one line in the Allison Anders film Mi vida loca (1993). Feeling under-appreciated by Anglo filmmakers, Hayek vented her frustrations on comedian Paul Rodriguez's late-night Spanish-language talk show in 1992. Robert Rodriguez and his producer wife Elizabeth Avellan happened to be watching and were immediately smitten with the intelligent, opinionated young woman. He soon gave her her big break--to star opposite Antonio Banderas in the now cult classic Desperado (1995), which put her on Hollywood's map. The moviegoers proved to be as dazzled with Hayek as he had been. After her break, she was cast again by Rodriguez to star in his From Dusk Till Dawn (1996). Although her vampy role opposite George Clooney and Quentin Tarantino was a small one, it was a good credit to her box office name. Hayek's first star billing came later that year with Fools Rush In (1997) opposite Friends (1994) actor Matthew Perry. The film was a modest hit, and Hayek continued to rise her star in both commercial and artistic films such as: Breaking Up (1997) with an unknown Russell Crowe; 54 (1998) about the rise and fall of the legendary New York club; Dogma (1999), playing the muse in a somewhat odd comedy co-starring Matt Damon and Chris Rock; In the Time of the Butterflies (2001), the small artistic film which won Hayek an ALMA award as best actress; and the 1999 summer blockbuster Wild Wild West (1999). Her production company \"Ventanarosa\" produced the 1999 Mexican feature film Pas de lettre pour le colonel (1999), which was shown at the Cannes Film Festival and selected as Mexico's official Oscar entry for best foreign film. The new millennium started out quietly around Salma as she was preparing to produce and star in her dream role, that of Frida Kahlo, the legendary Mexican painter whom Salma had been admiring her entire life and whose story she wanted to bring to the big screen ever since her arrival in Hollywood. It finally happened in 2002. Frida (2002), co-produced by Hayek, was a beautifully made film overflowing with passion and enthusiasm, with terrific performances from Salma and Alfred Molina as Kahlo's cheating husband \"Diego Rivera\". On the side was an entourage of stars including Antonio Banderas, Ashley Judd, Geoffrey Rush, Edward Norton and Valeria Golino. The picture was a hit and was nominated for six Oscars, including best actress for Hayek, who became the first Latin actress to be nominated in the category, and won the awards for make-up and its brilliant original score by Elliot Goldenthal. Hayek established herself as the serious actress that she is and, in the same year, expanded her horizons, directing The Maldonado Miracle (2003), which was shown at the Sundance Film festival. In 2003, she starred in the final of Rodriguez's \"Desperado\" trilogy Once Upon a Time in Mexico (2003), again opposite Banderas, and has just finished After the Sunset (2004) opposite Pierce Brosnan and Ask the Dust (2006) opposite Colin Farrell. Both are scheduled for release in early 2005. In the works are Robert Altman's \"Paint\" and Bandidas (2006) in which she will star with her friend Penélope Cruz.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMTk2NzM2Ml5BMl5BanBnXkFtZTcwNDQ4MjYzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000161","name":"Salma Hayek","idIMDB":"nm0000161"},"actorId":"nm0000161","character":"Teresa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maryke Hendrikse","urlProfile":"http://www.imdb.com/name/nm0376860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjgwMjE2Ml5BMl5BanBnXkFtZTcwMDY1NTgwOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1979","placeOfBirth":" Nassau, Bahamas","birthName":"Marÿke Hendrikse","bio":"Maryke Hendrikse was born on February 23, 1979 in Nassau, Bahamas as Marÿke Hendrikse. She is an actress, known for Johnny Test (2005), Sausage Party (2016) and Kate and Mim-Mim (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjgwMjE2Ml5BMl5BanBnXkFtZTcwMDY1NTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0376860","name":"Maryke Hendrikse","idIMDB":"nm0376860"},"actorId":"nm0376860","character":"Popped Cherry Mixer / Plum #1 / Loretta Bun / Frozen Fruitz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonah Hill","urlProfile":"http://www.imdb.com/name/nm1706767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDU0NzAwNl5BMl5BanBnXkFtZTcwMzQxMzIzNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1983","placeOfBirth":" Los Angeles, California, USA","birthName":"Jonah Hill Feldstein","height":"5' 7\" (1.7 m)","bio":"Jonah Hill was born and raised in Los Angeles, the son of Sharon (Chalkin), a fashion designer and costume stylist, and Richard Feldstein, a tour accountant for Guns N' Roses. His siblings are music manager Jordan Feldstein and actress Beanie Feldstein. He graduated from Crossroads School in Santa Monica and went on to The New School in New York to study drama. He began writing and performing in plays while at college in New York, and managed to get himself introduced to Dustin Hoffman, through whom he got an audition for his first film role in I Heart Huckabees (2004). A succession of increasingly high profile film and TV parts followed until he eventually landed one of the starring roles in the teen hit, Superbad (2007). Continuing to write and act, more roles followed as well as popular appearances on US TV talk shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDU0NzAwNl5BMl5BanBnXkFtZTcwMzQxMzIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1706767","name":"Jonah Hill","idIMDB":"nm1706767"},"actorId":"nm1706767","character":"Carl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anders Holm","urlProfile":"http://www.imdb.com/name/nm2981082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDg2NTU5NV5BMl5BanBnXkFtZTgwOTA0NzY4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Anders Holm is an actor and writer, known for Workaholics (2011), The Intern (2015) and The Interview (2014). He has been married to Emma Nesper Holm since September 2011. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDg2NTU5NV5BMl5BanBnXkFtZTgwOTA0NzY4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2981082","name":"Anders Holm","nicknames":["Ders"],"idIMDB":"nm2981082"},"actorId":"nm2981082","character":"Troy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1700841","urlIMDB":"http://www.imdb.com/title/tt1700841","business":{"budget":{"money":"$19,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$33,600,000","country":"USA","day":"14","month":"08","year":"2016","remarks":"3,103 Screens"},{"money":"$34,263,534","country":"USA","day":"14","month":"08","year":"2016","remarks":"3,103 Screens"}],"gross":[{"money":"$97,661,826","country":"USA","day":"30","month":"10","year":"2016","remarks":""},{"money":"$97,636,799","country":"USA","day":"23","month":"10","year":"2016","remarks":""},{"money":"$97,596,322","country":"USA","day":"16","month":"10","year":"2016","remarks":""},{"money":"$97,325,575","country":"USA","day":"09","month":"10","year":"2016","remarks":""},{"money":"$96,781,170","country":"USA","day":"02","month":"10","year":"2016","remarks":""},{"money":"$96,384,272","country":"USA","day":"25","month":"09","year":"2016","remarks":""},{"money":"$93,224,582","country":"USA","day":"11","month":"09","year":"2016","remarks":""},{"money":"$79,869,165","country":"USA","day":"28","month":"08","year":"2016","remarks":""},{"money":"$33,600,000","country":"USA","day":"14","month":"08","year":"2016","remarks":""},{"money":"$34,263,534","country":"USA","day":"14","month":"08","year":"2016","remarks":""},{"money":"$24,900,000","country":"USA","day":"13","month":"08","year":"2016","remarks":""},{"money":"$24,908,604","country":"USA","day":"13","month":"08","year":"2016","remarks":""},{"money":"$13,500,000","country":"USA","day":"12","month":"08","year":"2016","remarks":""},{"money":"$13,510,615","country":"USA","day":"12","month":"08","year":"2016","remarks":""},{"money":"$36,200,000","country":"Worldwide","day":"14","month":"08","year":"2016","remarks":""},{"money":"$36,863,534","country":"Worldwide","day":"14","month":"08","year":"2016","remarks":""},{"money":"$2,600,000","country":"Non-USA","day":"14","month":"08","year":"2016","remarks":""}],"weekendGross":[{"money":"$14,682","country":"USA","day":"30","month":"10","year":"2016","remarks":"37 Screens"},{"money":"$20,268","country":"USA","day":"23","month":"10","year":"2016","remarks":"45 Screens"},{"money":"$49,649","country":"USA","day":"16","month":"10","year":"2016","remarks":"99 Screens"},{"money":"$471,424","country":"USA","day":"09","month":"10","year":"2016","remarks":"1,071 Screens"},{"money":"$189,771","country":"USA","day":"02","month":"10","year":"2016","remarks":"230 Screens"},{"money":"$562,680","country":"USA","day":"25","month":"09","year":"2016","remarks":"551 Screens"},{"money":"$2,342,003","country":"USA","day":"11","month":"09","year":"2016","remarks":"2,071 Screens"},{"money":"$7,525,655","country":"USA","day":"28","month":"08","year":"2016","remarks":"3,135 Screens"},{"money":"$33,600,000","country":"USA","day":"14","month":"08","year":"2016","remarks":"3,103 Screens"},{"money":"$34,263,534","country":"USA","day":"14","month":"07","year":"2016","remarks":"3,103 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Dolby Digital","Dolby Atmos","Auro 11.1","Dolby Surround 7.1","12-Track Digital Sound","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["Digital"],"cinematographicProcess":["Digital (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["D-Cinema"]},"rating":"6.3","metascore":"66","filmingLocations":[],"rated":"R","awards":[{"award":"Annie Awards 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Outstanding Achievement in Editorial in an Animated Feature Production","names":[{"name":"Kevin Pavlovic","id":"nm2112751","role":null}]}]}]},{"award":"Central Ohio Film Critics Association 2017","titlesAwards":[{"titleAwardOutcome":"Nominated COFCA Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Florida Film Critics Circle Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated FFCC Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Golden Schmoes Awards 2016","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Trippiest Movie of the Year","names":[]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Comedy of the Year","names":[]},{"category":"Best Animated Movie of the Year","names":[]},{"category":"Most Memorable Scene in a Movie","names":[]}]}]},{"award":"Hollywood Music In Media Awards (HMMA) 2016","titlesAwards":[{"titleAwardOutcome":"Nominated HMMA Award","categories":[{"category":"Best Original Song - Animated Film","names":[{"name":"Alan Menken","id":"nm0579678","role":"music by"},{"name":"Glenn Slater","id":"nm1637698","role":"lyrics by"},{"name":"Seth Rogen","id":"nm0736622","role":"lyrics by"},{"name":"Evan Goldberg","id":"nm1698571","role":"lyrics by"},{"name":"Ariel Shaffir","id":"nm3782043","role":"lyrics by"},{"name":"Kyle Hunter","id":"nm3773434","role":"lyrics by"}]}]}]},{"award":"Houston Film Critics Society Awards 2017","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Indiana Film Journalists Association, US 2016","titlesAwards":[{"titleAwardOutcome":"2nd place IFJA Award","categories":[{"category":"Best Animated Feature","names":[]},{"category":"Best Vocal/Motion Capture Performance","names":[{"name":"Nick Kroll","id":"nm1802209","role":null}]}]},{"titleAwardOutcome":"2nd place Original Vision Award","categories":[{"category":"","names":[]}]}]},{"award":"Las Vegas Film Critics Society Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Sierra Award","categories":[{"category":"Best Song","names":[{"name":"Alan Menken","id":"nm0579678","role":null},{"name":"Glenn Slater","id":"nm1637698","role":null},{"name":"Seth Rogen","id":"nm0736622","role":null},{"name":"Evan Goldberg","id":"nm1698571","role":null},{"name":"Ariel Shaffir","id":"nm3782043","role":null},{"name":"Kyle Hunter","id":"nm3773434","role":null}]},{"category":"Best Animated Film","names":[]},{"category":"Best Comedy Film","names":[]}]}]},{"award":"North Carolina Film Critics Association 2017","titlesAwards":[{"titleAwardOutcome":"Nominated NCFCA Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Publicists Guild of America 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Maxwell Weinberg Award","categories":[{"category":"Motion Picture","names":[{"name":"Columbia Pictures","id":null,"role":null}]}]}]},{"award":"Village Voice Film Poll 2016","titlesAwards":[{"titleAwardOutcome":"Nominated VVFP Award","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Washington DC Area Film Critics Association Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated WAFCA Award","categories":[{"category":"Best Animated Feature","names":[]}]}]}],"votes":"113,364","type":"Movie","companyCreditsSimple":[{"idCompany":"co0323215","name":"Annapurna Pictures"},{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0345956","name":"Point Grey Pictures"}],"keywords":{"keywords":["adult animation","musical number","sex scene","orgy","adult humor","supermarket","douche","eaten alive","gum","lesbian","severed head","satire","death","potato","lavash","bagel","taco","food","tricked into lesbian sex","sausage","pun","bath salts the drug","marijuana","racism","hedonism","israeli palestinian conflict","condom","toilet paper","gun","decapitation","profanity","f word","carrot","tomato","hot dog","religious hypocrisy","bun","grits","twinkie","jelly","peanut butter","food fight","talking food","anthropomorphic food","anthropomorphism","belief","afterlife","hell","heaven","loss of faith","god","religion","wilhelm scream","cgi animation","juice box","adolescent humor","violent comedy","goofball","garbage","coarse language","bread","alcohol","beer","liquor","vegetable","fruit","part live action"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 21:47:30"}}