{"data":{"movies":[{"title":"Ernest & Celestine","originalTitle":"Ernest et Célestine","year":"2012","releaseDate":"20140228","directors":[{"name":"Stéphane Aubier","id":"nm0041334"},{"name":"Vincent Patar","id":"nm0665262"}],"writers":[{"name":"Daniel Pennac","id":"nm0672032"},{"name":"Gabrielle Vincent","id":"nm6135541"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDg4NTQwOF5BMl5BanBnXkFtZTcwNDE2Mjg2OA@@._V1.jpg","countries":["France","Belgium","Luxembourg"],"languages":["French"],"genres":["Animation","Comedy","Crime","Drama","Family"],"plot":"There is a world where the Bears live above ground in their cities and the rodents live below in their underground ones in mutual fear and hate. However, Celestine, an apprentice mouse dentist, finds at least momentary common cause with Ernest, a poor street Bear musician, that gets them rejected from both their respective worlds. In spite of this misfortune, the exiles find a growing friendship between themselves as their respective talents flower because of it. Despite this, their quietly profound challenge to the founding prejudices of their worlds cannot be ignored as the authorities track them down. When that happens, Ernest and Celestine must stand up for their love in the face of such bigotry and achieve the impossible.","simplePlot":"The story of an unlikely friendship between a bear, Ernest, and a young mouse named Celestine.","actors":[{"actorName":"Forest Whitaker","urlProfile":"http://www.imdb.com/name/nm0001845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDI3NTg2OV5BMl5BanBnXkFtZTcwNTgwMzg5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1961","placeOfBirth":" Longview, Texas, USA","birthName":"Forest Steven Whitaker","height":"6' 2\" (1.88 m)","bio":"Forest Steven Whitaker has packaged a king-size talent into his hulking 6' 2\", 220 lb. frame. He won an Academy Award for his performance as Ugandan dictator Idi Amin in the 2006 film The Last King of Scotland (2006), and has also won a Golden Globe and a BAFTA. He is the fourth African-American male to win an Academy Award for Best Actor, following in the footsteps of Sidney Poitier, Denzel Washington, and Jamie Foxx. Whitaker was born on July 15, 1961 in Longview, Texas, to Laura Francis (Smith), a special education teacher, and Forest Steven Whitaker, an insurance salesman. His family moved to South Central Los Angeles in 1965. The athletically-inclined Whitaker initially found his way into college via a football scholarship. Later, however, he transferred to USC where he set his concentration on music and earned two more scholarships training as an operatic tenor. This, in turn, led to another scholarship at Berkeley with a renewed focus on acting and the performing stage. Whitaker made his film debut at the age of 21 in the raucous comedy Fast Times at Ridgemont High (1982) wherein he played, quite naturally, a footballer. He went on to play another sports-oriented student, a wrestler, in his second film Vision Quest (1985). He gained experience on TV as well with featured spots on such varied shows as Diff'rent Strokes (1978) and Cagney & Lacey (1981), not to mention the TV-movie Civil War epic North and South (1985) and its sequel. The movie that truly put him on the map was The Color of Money (1986). His one big scene as a naive-looking pool player who out-hustles Paul Newman's Fast Eddie Felson was pure electricity. This led to more visible roles in the \"A\" class films Platoon (1986), Stakeout (1987), and Good Morning, Vietnam (1987), which culminated in his breakout lead portrayal of the tortured jazz icon 'Charlie \"Bird\" Parker' in Clint Eastwood's passion project Bird (1988), for which Whitaker won the Cannes Film Festival award for \"best actor\" and a Golden Globe nomination. Whitaker continued to work with a number of well-known directors throughout the 1990s. While his \"gentle giant\" characters typically display innocence, indecision, and timidity along with a strong underlying humanity, he has certainly not shied away from the edgier, darker corners of life as his occasional hitmen and other menacing streetwise types can attest. Although in only the first section of the film, he was memorable as the IRA-captured British soldier whose bizarre relationship with a mysterious femme fatale serves as the catalyst for the critically-lauded drama The Crying Game (1992). Always a willing participant to push the envelope, he's gone on to enhance a number of lesser films. Among those was his plastic surgeon in Johnny Handsome (1989), gay clothing designer in Robert Altman's Ready to Wear (1994), alien hunter in Species (1995), absentee father confronted by his estranged son in Smoke (1995), and Mafia hitman who models himself after the samurai warrior in Ghost Dog, la voie du samouraï (1999), among many others. As would be expected, he's also had his share of epic-sized bombs, notoriously the L. Ron Hubbard sci-fi disaster Battlefield Earth (2000). On the TV front, he was the consulting producer and host of a revamped Rod Serling's cult series classic La treizième dimension (2002), which lasted a disappointing one season. In the early 1990s, Whitaker widened his horizons to include producing/directing and has since gained respect behind the camera as well. He started things off co-producing the violent gangster film A Rage in Harlem (1991), in which he co-starred with Gregory Hines and Robin Givens, and then made his successful directorial debut with the soulful Waiting to Exhale (1995), showcasing a legion of distaff black stars. He also directed co-star Whitney Houston's music video of the movie's theme song (\"Shoop Shoop\"). He also helmed the fluffy romantic comedy First Daughter (2004) with Katie Holmes and Michael Keaton. Whitaker also served as an executive producer on First Daughter. He had previously executive produced several made-for-television movies, most notably the 2002 Emmy-award winning Door to Door, starring William H. Macy. He produced these projects through his production company, Spirit Dance Entertainment, which he shut down in 2005 to concentrate on his acting career. In 2002, he co-starred in Joel Schumacher's thriller, Phone Booth, with Kiefer Sutherland and Colin Farrell. That year, he also co-starred with Jodie Foster in Panic Room. Whitaker's greatest success to date is the 2006 film, The Last King of Scotland. His performance earned him the 2007 Academy Award for Best Actor in a Leading Role, For that same role, he also received the Golden Globe Award, the Screen Actors Guild Award, a BAFTA Award, and many critical accolades. He has also received several other honors. In September 2006, the 10th Annual Hollywood Film Festival presented him with its \"Hollywood Actor of the Year Award,\" He was also honored at the Santa Barbara International Film Festival 2007, receiving the American Riviera Award. Previously, in 2005, the Deauville Festival of American Film paid tribute to him. In 2007, Forest Whitaker won the Cinema for Peace Award 2007. In 2007, Whitaker co-starred in The Great Debaters with fellow Oscar winner Denzel Washington, and in 2008, Whitaker played opposite Keanu Reeves in Street Kings and Dennis Quaid in Vantage Point. In 2009, Forest co-starred in the Warner Bros. film \"Where the Wild Things Are,\" directed by Spike Jonze, which was a mix of live-action, animation and puppetry as an adaptation of the Maurice Sendak classic children's book. Around the same time, he also starred in \"Repossession Mambo\", with Jude Law, \"Hurricane Season\", \"Winged Creatures\", and \"Powder Blue\". He appeared in the Olivier Dahan film \"My Own Love Song\", opposite Renée Zellweger, and was part of the Africa Movie Academy Awards in 2009, in Nigeria. He is married to former model Keisha Whitaker and has three children by her. His younger brothers Kenn Whitaker and Damon Whitaker are both actors as well. Forest was given a star on the Hollywood Walk in April of 2007. In November 2007, Whitaker was the creative mind behind DEWmocracy.com, a website that let people decide the next flavor of Mountain Dew in a \"People's Dew\" poll. He directed a short film and created the characters for the video game. Whitaker has done extensive humanitarian work, he has been involved with organizations like, Penny Lane, an organization that provides assistance to abused teenagers. PETA and Farm Sanctuary, organizations that protect animals' rights. Close friends with Neurosurgeon Dr. Keith Black, Forest has helped raise awareness and funds for Dr. Blacks research. During the last couple of years, he has become a spokesperson for Hope North Ugandan orphanage and Human Rights Watch. In the year 2001 Forest received a Humanitas Prize. He was recently honored by The City of Los Angeles with the Hope of Los Angeles Award. And his entire clan received the LA BEST Family Focus Award. Last year he joined forces with \"Idol Gives Back\" and \"Malaria No More\"; he has become a GQ Ambassador supporting and fundraising for Hope North. He was a Surrogate for Barrack Obama's campaign supporting him across the United States. Whitaker's multimedia company, Spirit Dance Entertainment, includes film, television and music production. He works closely with a number of charitable organizations, giving back to his community by serving as an Honorary Board Members for Penny Lane, an organization that provides assistance to abused teenagers, the Human Rights Watch and The Hope North organization.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDI3NTg2OV5BMl5BanBnXkFtZTcwNTgwMzg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001845","name":"Forest Whitaker","idIMDB":"nm0001845"},"actorId":"nm0001845","character":"Ernest","urlCharacter":"http://www.imdb.com/character/ch0414484","main":true},{"actorName":"Lambert Wilson","urlProfile":"http://www.imdb.com/name/nm0933727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTQ5NTg5Ml5BMl5BanBnXkFtZTgwOTQ5MTA3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1958","placeOfBirth":" Neuilly-sur-Seine, Hauts-de-Seine, France","height":"6' 2\" (1.88 m)","bio":"Lambert Wilson was born in Paris and studied acting at the Drama Centre in London. A fluent English speaker, he made his feature film debut at the age of twenty-two in Fred Zinnemann's Five Days One Summer (1981) starring opposite Sean Connery. He went on to work with many of France's most prestigious auteur directors, playing leads in Andrzej Zulawski's La Femme Publique, (1983), Véra Belmont's Rouge Baiser (1984), André Téchiné's Rendez-vous, (Official Selection at Cannes and winner of the Best Director Award, 1984), Luigi Comencini's La Storia (1985), Claude Chabrol's Le Sang des Autres (1987), Philippe de Broca's Chouans (1987) and Peter Greenaway's The Belly of an Architect (1987). He starred in his actor/director father Georges Wilson's feature film debut, La Vouivre (1988), and won the Jean Gabin Award for his performance in Denis Amar's Winter '54, (1989). Further film work includes James Ivory's Jefferson in Paris (1994) opposite Nick Nolte and Gwyneth Paltrow and John Duigan's The Leading Man, with Thandie Newton and John Bon Jovi (1996). He has made four films with Alain Resnais: Same Old Song (1997), Not on the Lips, 2003, Private Fears in Public Places, (2006) and You Ain't Seen Nothing Yet (2012) and has worked with Jacques Doillon in Trop (peu) d'amour, (1997), Deborah Warner in The Last September, with Maggie Smith, Fiona Shaw, Jane Birkin and Michael Gambon (1998) and starred in Raùl Ruiz's Combat d'amour en songe (2000). His more recent, English language work includes the Wachowski brothers' Matrix Reloaded and Matrix Revolutions (2001), Pitof's Catwoman (2004) with Halle Berry and Sharon Stone, Breck Eisner's Sahara, (2005), Michael Radford's Flawless (2006) with Demi Moore and Michael Caine, and Mathieu Kassovitz's Babylon A.D. (2007) with Vin Diesel and Charlotte Rampling. He has just starred in three international productions, Lulu Wang's Posthumous with Jack Huston and Britt Marling, Victor Levin's 5 to 7 with Anton Yelchin, Glenn Close and Frank Langella, and Suite Française, opposite Michelle Williams, Kristin Scott Thomas and Matthias Shoenaerts, all due for release in 2014. Highlights from his latter French filmography include: Valérie Lemercier's Palais Royal! (2004), Xavier Beauvois' Of Gods and Men, Cannes Official Selection and Winner, Grand Prize of the Jury (2009), Bertrand Tavernier The Princess of Montpensier (2009), Alain Chabat's Le Marsupilami (2011), Philippe Le Guay's Cycling with Moliere (2012). In the summer of 2013, he played the lead in Eric Lavaine's Barbecue, opposite Florence Foresti, Franck Dubosc, Guillaume de Tonquédec, Lionel Abelanski, Jérôme Commandeur, Valérie Crouzet, Sophie Duez et Lysiane Meis (2014). Lambert Wilson is a Chevalier and Officier des Arts et des Lettres and Chevalier and Officier de l'Ordre National du Merite.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTQ5NTg5Ml5BMl5BanBnXkFtZTgwOTQ5MTA3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933727","name":"Lambert Wilson","idIMDB":"nm0933727"},"actorId":"nm0933727","character":"Ernest","urlCharacter":"http://www.imdb.com/character/ch0414484","main":true},{"actorName":"Pauline Brunner","urlProfile":"http://www.imdb.com/name/nm5312818","urlPhoto":"","biography":{"bio":"Pauline Brunner is an actress, known for Ernest & Celestine (2012), La ritournelle (2014) and T'choupi à l'école (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5312818","name":"Pauline Brunner","idIMDB":"nm5312818"},"actorId":"nm5312818","character":"Célestine","urlCharacter":"http://www.imdb.com/character/ch0414485","main":true},{"actorName":"Mackenzie Foy","urlProfile":"http://www.imdb.com/name/nm3237775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTIyMzExODgtNzllNy00OWQwLTlhM2QtMWU1ZTI2MjgwMTQxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 2000","placeOfBirth":" USA","birthName":"Mackenzie Christine Foy","height":"5' 2½\" (1.59 m)","bio":"Mackenzie Christine Foy was born 10 November, 2000. She began her career as a child model in 2004, working for Garnet Hill, Polo Ralph Lauren, and Guess Kids. She has also modeled in print ads for companies such as Rubbermaid, Jones Apparel Group,The Walt Disney Company, Mattel, Target Corporation, Talbots, Guess and Gap. Foy has appeared in many commercials as well, including Burger King, Kohl's, BlackBerry, Comcast, and Pantene. Her first acting role came in 2009 in the TV series 'Til Death (2006). She has guest starred on Hawaii Five-0 (2010) and \"The Haunting Hour\" (2010). One-off appearances followed in various TV shows. At age 11, she landed her breakthrough role as Renesmee, the daughter of Bella and Edward in The Twilight Saga: Breaking Dawn - Part 1 (2011) and The Twilight Saga: Breaking Dawn - Part 2 (2012). Since then she has filmed The Conjuring (2013), Wish You Well (2013), Plastic Jesus (2013), and Interstellar (2013). She has lent her voice to The Boxcar Children (2014) and Le Petit Prince (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTIyMzExODgtNzllNy00OWQwLTlhM2QtMWU1ZTI2MjgwMTQxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3237775","name":"Mackenzie Foy","nicknames":["Kenzie","Kenz"],"idIMDB":"nm3237775"},"actorId":"nm3237775","character":"Celestine","urlCharacter":"http://www.imdb.com/character/ch0414485","main":true},{"actorName":"Lauren Bacall","urlProfile":"http://www.imdb.com/name/nm0000002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2OTk3MzU0OF5BMl5BanBnXkFtZTYwMzE3MzU2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1924","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Betty Joan Perske","height":"5' 8½\" (1.74 m)","bio":"Lauren Bacall was born Betty Joan Perske on September 16, 1924, in New York City. She is the daughter of Natalie Weinstein-Bacal, a Romanian Jewish immigrant, and William Perske, who was born in New Jersey, to Polish Jewish parents. Her family was middle-class, with her father working as a salesman and her mother as a secretary. They divorced when she was five. When she was a school girl, Lauren originally wanted to be a dancer, but later, she became enthralled with acting, so she switched gears to head into that field. She had studied at the American Academy of Dramatic Arts in New York after high school, which enabled her to get her feet wet in some off-Broadway productions. Once out of school, Lauren entered modeling and, because of her beauty, appeared on the cover of Harper's Bazaar, one of the most popular magazines in the US. The wife of famed director Howard Hawks spotted the picture in the publication and arranged with her husband to have Lauren take a screen test. As a result, which was entirely positive, she was given the part of Marie Browning in To Have and Have Not (1944), a thriller opposite the great Humphrey Bogart, when she was just 19 years old. This not only set the tone for a fabulous career but also one of Hollywood's greatest love stories (she married Bogart in 1945). It was also the first of several Bogie-Bacall films. After 1945's Confidential Agent (1945), Lauren received second billing in The Big Sleep (1946) with Bogart. The mystery, in the role of Vivian Sternwood Rutledge, was a resounding success. Although she was making one film a year, each production would be eagerly awaited by the public. In 1947, again with her husband, Lauren starred in the thriller Dark Passage (1947). The film kept movie patrons on the edge of their seats. The following year, she starred with Bogart, Edward G. Robinson, and Lionel Barrymore in Key Largo (1948). The crime drama was even more of a nail biter than her previous film. In 1950, Lauren starred in Bright Leaf (1950), a drama set in 1894. It was a film of note because she appeared without her husband - her co-star was Gary Cooper. In 1953, Lauren appeared in her first comedy as Schatze Page in How to Marry a Millionaire (1953). The film, with co-stars Marilyn Monroe and Betty Grable, was a smash hit all across the theaters of America. After filming Designing Woman (1957), which was released in 1957, Humphrey Bogart died on January 14 from throat cancer. Devastated at being a widow, Lauren returned to the silver screen with The Gift of Love (1958) in 1958 opposite Robert Stack. The production turned out to be a big disappointment. Undaunted, Lauren moved back to New York City and appeared in several Broadway plays to huge critical acclaim. She was enjoying acting before live audiences and the audiences in turn enjoyed her fine performances. Lauren was away from the big screen for five years, but she returned in 1964 to appear in Shock Treatment (1964) and Sex and the Single Girl (1964). The latter film was a comedy starring Henry Fonda and Tony Curtis. In 1966, Lauren starred in Harper (1966) with Paul Newman and Julie Harris, which was one of former's signature films. Alternating her time between films and the stage, Lauren returned in 1974's Murder on the Orient Express (1974). The film, based on Agatha Christie's best-selling book was a huge hit. It also garnered Ingrid Bergman her third Oscar. Actually, the huge star-studded cast helped to ensure its success. Two years later, in 1976, Lauren co-starred with John Wayne in The Shootist (1976). The film was Wayne's last - he died from cancer in 1979. In 1981, Lauren played an actress being stalked by a crazed admirer in The Fan (1981). The thriller was absolutely fascinating with Lauren in the lead role. After that production, Lauren was away from films again, this time for seven years. In the interim, she again appeared on the stages of Broadway. When she returned, it was for the filming of 1988's Mr. North (1988). After Misery (1990), in 1990, and several made for television films, Lauren appeared in 1996's My Fellow Americans (1996). It was a wonderful comedy romp with Jack Lemmon and James Garner as two ex-presidents and their escapades. Despite her advanced age and deteriorating health, she made a small-scale comeback in the English-language dub of Hayao Miyazaki's Howl's Moving Castle (2004) (\"Howl's Moving Castle,\" based on the young-adult novel by Diana Wynne Jones) as the Witch of the Waste, but future endeavors for the beloved actress became increasingly rare. Lauren Bacall died on 12 August 2014, five weeks short of her 90th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg2OTk3MzU0OF5BMl5BanBnXkFtZTYwMzE3MzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000002","name":"Lauren Bacall","nicknames":["The Look","Betty"],"idIMDB":"nm0000002"},"actorId":"nm0000002","character":"The Grey One","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne-Marie Loop","urlProfile":"http://www.imdb.com/name/nm0519735","urlPhoto":"","biography":{"bio":"Anne-Marie Loop is an actress, known for Ernest & Celestine (2012), Alléluia (2014) and Le tout nouveau testament (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0519735","name":"Anne-Marie Loop","idIMDB":"nm0519735"},"actorId":"nm0519735","character":"La Grise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Giamatti","urlProfile":"http://www.imdb.com/name/nm0316079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0MDAzMTU4N15BMl5BanBnXkFtZTcwNzA0NzcwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1967","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Paul Edward Valentine Giamatti","height":"5' 9\" (1.75 m)","bio":"Paul Giamatti is an American actor who has worked steadily and prominently for over twenty years, and is best known for leading roles in the films American Splendor (2003), Sideways (2004), and Le monde de Barney (2010) (for which he won a Golden Globe), and supporting roles in the films Cinderella Man (2005), The Illusionist (2006), and San Andreas (2015). Paul Edward Valentine Giamatti was born June 6, 1967 in New Haven, Connecticut, and is the youngest of three children. His mother, the former Toni Marilyn Smith, was an actress before marrying. His father, Bart Giamatti (Angelo Bartlett Giamatti), was a professor of Renaissance Literature at Yale University, and went on to become the university's youngest president (in 1986, Bart was appointed president of baseball's National League. He became Commissioner of Baseball on April 1, 1989 and served for five months until his untimely death on September 1, 1989. He was commissioner at the time Pete Rose was banned from the game). Paul's father also wrote six books. Paul's older brother, Marcus Giamatti, is also an actor. His sister, Elena, designs jewelry. His ancestry is Italian (from his paternal grandfather), German, English, Dutch, Scottish, and Irish. Paul graduated from Choate Rosemary Hall prep school, majored in English at Yale, and obtained his Master's Degree in Fine Arts, with his major in drama from the Yale University School of Drama. His acting roots are in theatre, from his college days at Yale, to regional productions (Seattle, San Diego and Williamstown, Massachusetts), to Broadway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0MDAzMTU4N15BMl5BanBnXkFtZTcwNzA0NzcwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0316079","name":"Paul Giamatti","idIMDB":"nm0316079"},"actorId":"nm0316079","character":"Rat Judge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrice Melennec","urlProfile":"http://www.imdb.com/name/nm0577616","urlPhoto":"","biography":{"bio":"Patrice Melennec is an actor, known for Ernest & Celestine (2012), Frantic (1988) and One Deadly Summer (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0577616","name":"Patrice Melennec","idIMDB":"nm0577616"},"actorId":"nm0577616","character":"Georges","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William H. Macy","urlProfile":"http://www.imdb.com/name/nm0000513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTk5MTAzNV5BMl5BanBnXkFtZTcwNTk0MzMyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1950","placeOfBirth":" Miami, Florida, USA","birthName":"William Hall Macy Jr.","height":"5' 8\" (1.73 m)","bio":"William H. Macy was born on March 13, 1950 in Miami, Florida, USA as William Hall Macy Jr. He is an actor and writer, known for Fargo (1996), Shameless (2011) and Jurassic Park III (2001). He has been married to Felicity Huffman since September 6, 1997. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTk5MTAzNV5BMl5BanBnXkFtZTcwNTk0MzMyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000513","name":"William H. Macy","nicknames":["Bill"],"idIMDB":"nm0000513"},"actorId":"nm0000513","character":"Head Dentist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brigitte Virtudes","urlProfile":"http://www.imdb.com/name/nm3102740","urlPhoto":"","biography":{"bio":"Brigitte Virtudes is an actress, known for Ernest & Celestine (2012), Astérix et les Vikings (2006) and Sharky & George (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3102740","name":"Brigitte Virtudes","idIMDB":"nm3102740"},"actorId":"nm3102740","character":"Lucienne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Léonard Louf","urlProfile":"http://www.imdb.com/name/nm5643341","urlPhoto":"","biography":{"bio":"Léonard Louf is an actor, known for Ernest & Celestine (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5643341","name":"Léonard Louf","idIMDB":"nm5643341"},"actorId":"nm5643341","character":"Léon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Megan Mullally","urlProfile":"http://www.imdb.com/name/nm0005259","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA3NjUyMF5BMl5BanBnXkFtZTcwNzUyMjk0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1958","placeOfBirth":" Los Angeles, California, USA","height":"5' 4\" (1.63 m)","bio":"Megan is an only child born in Los Angeles, California. Her mother, Martha, was a model, and her father, Carter Mullally Jr., was a contract player for Paramount. Megan first entered Northwestern University intending to study acting, but switched to English literature. However, she still ended up starring in several campus musicals, which gained attention from producers and prompted her to drop out of school. In 1985, she moved to Los Angeles with no particular success. But, in 1994, she co-starred in \"Grease\" with Rosie O'Donnell and, in 1995, in \"How To Succeed In Business\" with Matthew Broderick. Her star has been rising ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA3NjUyMF5BMl5BanBnXkFtZTcwNzUyMjk0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005259","name":"Megan Mullally","idIMDB":"nm0005259"},"actorId":"nm0005259","character":"Lucienne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Offerman","urlProfile":"http://www.imdb.com/name/nm0644406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY2ODkxMV5BMl5BanBnXkFtZTgwMjQxMDA5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1970","placeOfBirth":" Joliet, Illinois, USA","height":"5' 11\" (1.8 m)","bio":"Nick Offerman was born on June 26, 1970 in Joliet, Illinois, USA. He is an actor and producer, known for Parks and Recreation (2009), The Founder (2016) and Fargo (2014). He has been married to Megan Mullally since September 20, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY2ODkxMV5BMl5BanBnXkFtZTgwMjQxMDA5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0644406","name":"Nick Offerman","idIMDB":"nm0644406"},"actorId":"nm0644406","character":"George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Perrette Pradier","urlProfile":"http://www.imdb.com/name/nm0694989","urlPhoto":"","biography":{"dateOfBirth":"17 April 1938","placeOfBirth":" Hanoi, Vietnam","birthName":"Perrette Chevau","bio":"Perrette Pradier was born on April 17, 1938 in Hanoi, Vietnam as Perrette Chevau. She was an actress, known for Ernest & Celestine (2012), Spartakus and the Sun Beneath the Sea (1985) and The Burning Court (1962). She died on January 16, 2013 in Rueil-Malmaison, Hauts-de-Seine, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0694989","name":"Perrette Pradier","idIMDB":"nm0694989"},"actorId":"nm0694989","character":"L'infirmière en chef souris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dominique Maurin","urlProfile":"http://www.imdb.com/name/nm0171993","urlPhoto":"","biography":{"dateOfBirth":"1 April 1949","placeOfBirth":" Toulouse, Haute-Garonne, France","bio":"Dominique Maurin was born on April 1, 1949 in Toulouse, Haute-Garonne, France. He is an actor, known for Rififi (1955), Ernest & Celestine (2012) and Les amitiés particulières (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0171993","name":"Dominique Maurin","idIMDB":"nm0171993"},"actorId":"nm0171993","character":"Chef de Clinique","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1816518","urlIMDB":"http://www.imdb.com/title/tt1816518","business":{"budget":{"money":"€9,600,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$71,442","country":"USA","day":"16","month":"03","year":"2014","remarks":""}],"weekendGross":[{"money":"$39,556","country":"USA","day":"16","month":"03","year":"2014","remarks":"9 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["B-Mac, Paris France"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"7.9","metascore":"86","filmingLocations":[],"rated":"PG","awards":[{"award":"Academy Awards, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Animated Feature Film of the Year","names":[{"name":"Benjamin Renner","id":"nm2883649","role":null},{"name":"Didier Brunner","id":"nm0116369","role":null}]}]}]},{"award":"Annie Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Outstanding Achievement in Character Animation in a Feature Production","names":[{"name":"Patrick Imbert","id":"nm1348707","role":null}]},{"category":"Outstanding Achievement in Directing in an Animated Feature Production","names":[{"name":"Benjamin Renner","id":"nm2883649","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null},{"name":"Stéphane Aubier","id":"nm0041334","role":null}]},{"category":"Outstanding Achievement in Writing in an Animated Feature Production","names":[{"name":"Daniel Pennac","id":"nm0672032","role":null}]},{"category":"Outstanding Achievement in Editorial in an Animated Feature Production","names":[{"name":"Fabienne Alvarez-Giro","id":"nm0023341","role":null}]},{"category":"Outstanding Achievement in Production Design in an Animated Feature Production","names":[{"name":"Zaza","id":"nm6128058","role":null},{"name":"Zyk","id":"nm5204796","role":null}]},{"category":"Best Animated Feature","names":[]}]}]},{"award":"Cannes Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won SACD Prize (Directors' Fortnight) - Special Mention","categories":[{"category":"","names":[{"name":"Stéphane Aubier","id":"nm0041334","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null},{"name":"Benjamin Renner","id":"nm2883649","role":null}]}]}]},{"award":"Cinekid 2011","titlesAwards":[{"titleAwardOutcome":"Won Cinekid Film Award","categories":[{"category":"International Film","names":[{"name":"Benjamin Renner","id":"nm2883649","role":null},{"name":"Stéphane Aubier","id":"nm0041334","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null}]}]}]},{"award":"César Awards, France 2013","titlesAwards":[{"titleAwardOutcome":"Won César","categories":[{"category":"Best Animated Film (Meilleur film d'animation)","names":[{"name":"Benjamin Renner","id":"nm2883649","role":"director"},{"name":"Vincent Patar","id":"nm0665262","role":"director"},{"name":"Stéphane Aubier","id":"nm0041334","role":"director"},{"name":"Didier Brunner","id":"nm0116369","role":"producer"},{"name":"Henri Magalon","id":"nm1436417","role":"producer"}]}]}]},{"award":"Dubai International Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won People's Choice Award","categories":[{"category":"","names":[{"name":"Benjamin Renner","id":"nm2883649","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null},{"name":"Stéphane Aubier","id":"nm0041334","role":null}]}]}]},{"award":"Galway Film Fleadh 2013","titlesAwards":[{"titleAwardOutcome":"2nd place Audience Award","categories":[{"category":"Best International Feature","names":[{"name":"Benjamin Renner","id":"nm2883649","role":"director"},{"name":"Stéphane Aubier","id":"nm0041334","role":"director"},{"name":"Vincent Patar","id":"nm0665262","role":"director"},{"name":"Didier Brunner","id":"nm0116369","role":"producer"},{"name":"Stéphan Roelants","id":"nm2847097","role":"producer"}]}]}]},{"award":"Gold Derby Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Gold Derby Award","categories":[{"category":"Animated Feature","names":[{"name":"Stéphane Aubier","id":"nm0041334","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null},{"name":"Benjamin Renner","id":"nm2883649","role":null}]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Golden Trailer","categories":[{"category":"Best Foreign Animation/Family Trailer","names":[{"name":"Gkids","id":null,"role":null},{"name":"Zealot Productions","id":null,"role":null}]}]}]},{"award":"International Cinephile Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won ICS Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Los Angeles Film Critics Association Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Animation","names":[{"name":"Stéphane Aubier","id":"nm0041334","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null},{"name":"Benjamin Renner","id":"nm2883649","role":null}]}]}]},{"award":"Magritte Awards, Belgium 2014","titlesAwards":[{"titleAwardOutcome":"Won Magritte Award","categories":[{"category":"Best Film (Meilleur film)","names":[{"name":"Stéphane Aubier","id":"nm0041334","role":"director"},{"name":"Vincent Patar","id":"nm0665262","role":"director"},{"name":"Benjamin Renner","id":"nm2883649","role":"producer"}]},{"category":"Best Director (Meilleure réalisation)","names":[{"name":"Stéphane Aubier","id":"nm0041334","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null}]},{"category":"Best Sound (Meilleur son)","names":[{"name":"Emmanuel de Boissieu","id":"nm1051806","role":null},{"name":"Fred Demolder","id":"nm0218611","role":null},{"name":"Franco Piscopo","id":"nm0685470","role":null},{"name":"Luc Thomas","id":"nm0859182","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects, Foley, Dialogue and ADR in an Animation Feature Film","names":[{"name":"Fred Demolder","id":"nm0218611","role":"supervising sound editor"},{"name":"Bertrand Boudaud","id":"nm0099125","role":"sound effects editor"}]}]}]},{"award":"Munich Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Kids Audience Award","categories":[{"category":"","names":[{"name":"Benjamin Renner","id":"nm2883649","role":"director"},{"name":"Vincent Patar","id":"nm0665262","role":"director"},{"name":"Stéphane Aubier","id":"nm0041334","role":"director"}]}]}]},{"award":"New York International Children's Film Festival, US 2013","titlesAwards":[{"titleAwardOutcome":"Won Grand Prize Feature","categories":[{"category":"","names":[{"name":"Benjamin Renner","id":"nm2883649","role":"director"}]}]}]},{"award":"Online Film & Television Association 2014","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Animated Picture","names":[{"name":"Didier Brunner","id":"nm0116369","role":null},{"name":"Henri Magalon","id":"nm1436417","role":null},{"name":"Vincent Tavier","id":"nm0851759","role":null}]}]}]},{"award":"Portland International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Best Animated Feature","names":[{"name":"Stéphane Aubier","id":"nm0041334","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null},{"name":"Benjamin Renner","id":"nm2883649","role":null}]}]}]},{"award":"Satellite Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Motion Picture, Animated or Mixed Media","names":[]}]}]},{"award":"Seattle Film Critics Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Seattle Film Critics Award","categories":[{"category":"Best Animated Feature","names":[{"name":"Stéphane Aubier","id":"nm0041334","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null},{"name":"Benjamin Renner","id":"nm2883649","role":null}]}]}]},{"award":"Seattle International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Films4Families Youth Jury Award","categories":[{"category":"","names":[{"name":"Benjamin Renner","id":"nm2883649","role":null},{"name":"Stéphane Aubier","id":"nm0041334","role":null},{"name":"Vincent Patar","id":"nm0665262","role":null}]}]}]},{"award":"Village Voice Film Poll 2013","titlesAwards":[{"titleAwardOutcome":"Nominated VVFP Award","categories":[{"category":"Best Animated Feature Film","names":[]}]}]}],"votes":"13,270","type":"Movie","companyCreditsSimple":[{"idCompany":"co0101509","name":"La Parti Productions"},{"idCompany":"co0008843","name":"Les Armateurs"},{"idCompany":"co0181248","name":"Maybe Movies"}],"keywords":{"keywords":["bear","friendship","mouse","prejudice","dentist","forbidden friendship","hunger","musician","starving","saving a life","street performer","busker","painting","furry","burglary","bedtime story","acquittal","drawing","one man band","thief","petty theft","underground city","covered in snow","hiding in garbage bin","snow","garbage bin","eating garbage","tooth fairy","incisor","missing tooth","baby tooth","losing a tooth","candy store","candy","prison","trial","judge","garbage can","trashcan","fire","based on book","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:12:33"}}