{"data":{"movies":[{"title":"To Write Love on Her Arms","originalTitle":"","year":"2012","releaseDate":"20150303","directors":[{"name":"Nathan Frankowski","id":"nm2021984"}],"writers":[{"name":"Kate King Lynch","id":"nm4343108"},{"name":"Nathan Frankowski","id":"nm2021984"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NzQ3MzE1Ml5BMl5BanBnXkFtZTgwNDAxNTI0NDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama","Music"],"plot":"The story follows 19-year-old Renee (Kat Dennings) who has always loved fairy tales: the idea of a princess, a hero and a happily ever after. But Renee's life is that of a darker tale: she's a young woman battling addiction, depression and self-injury. In a creative blend of artistic fantasy balanced with harsh reality, the movie follows Renee on her courageous journey towards recovery.","simplePlot":"A drama centered around Renee Yohe and her battle with drugs, depression, and other life issues that ultimately leads to the founding of charity group To Write Love on Her Arms.","actors":[{"actorName":"Kat Dennings","urlProfile":"http://www.imdb.com/name/nm0993507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjk2NzA5Ml5BMl5BanBnXkFtZTcwNzIxMDcwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1986","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Katherine Victoria Litwack","height":"5' 4½\" (1.64 m)","bio":"Kat Dennings was born Katherine Victoria Litwack in Bryn Mawr, Pennsylvania, near Philadelphia, to Ellen (Schatz), a speech therapist and poet, and Gerald Litwack, a molecular pharmacologist. She is the youngest of five children. Her family is of Russian Jewish descent. Kat was predominantly home-schooled, graduating at the age of fourteen. Her family subsequently moved to Los Angeles, California to support Kat acting full-time. After work doing commercials, she began work in television, starting with a role on HBO's Sex and the City (1998), following up with roles on Raising Dad (2001), The Scream Team (2002), Everwood (2002), Without a Trace (2002) and ER (1994), among others. Kat made the move to the big screen with supporting roles in Raise Your Voice (2004), The 40-Year-Old Virgin (2005) and Big Momma's House 2 (2006). She later achieved a level of fame with roles in The House Bunny (2008) and Nick and Norah's Infinite Playlist (2008). Kat continues to act in feature films and is an avid video blogger. Since 2011, she has starred with Beth Behrs in the CBS television series 2 Broke Girls (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjk2NzA5Ml5BMl5BanBnXkFtZTcwNzIxMDcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0993507","name":"Kat Dennings","idIMDB":"nm0993507"},"actorId":"nm0993507","character":"Renee Yohe","urlCharacter":"http://www.imdb.com/character/ch0241268","main":true},{"actorName":"Chad Michael Murray","urlProfile":"http://www.imdb.com/name/nm0614877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcxNjYyMDU5NF5BMl5BanBnXkFtZTcwMTQ1NDcxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1981","placeOfBirth":" Buffalo, New York, USA","birthName":"Chad Michael Murray","height":"6' (1.83 m)","bio":"Chad Michael Murray has showcased his brooding good looks and acting talent on television sets and silver screens for two decades. The 6-foot tall star, who resides in Wilmington, North Carolina, is known to audiences of One Tree Hill (2003), where he played the good son, Lucas Scott. The model-turned-actor has also serenaded Jamie Lee Curtis with Britney Spears' \"Baby One More Time\" in Freaky Friday (2003), became Hilary Duff's \"Prince Charming\" in A Cinderella Story (2004), and even watched Paris Hilton die a violent on-screen death in La maison de cire (2005). Chad Michael Murray was born in Buffalo, New York. Growing up, his mother left his family at a young age and he had to help take care of his younger siblings, together with his brother and his father, Rex Murray, an air traffic controller. While working his way through adolescence, he learned a lot about work ethics, which eventually helped built his character. Chad once said in an interview that he could call his father anytime of the day whenever he needs help as his father is \"his rock\". The One Tree Hill (2003) star started his life as a paper boy, delivering newspapers around the neighborhood before working as a janitor at Donut World. Chad only worked there for a few days when he lost his job because he was shooting Skittles into the deep-fryer. Sure enough, one of the Skittles got caught in the machine and Chad got fired. Chad also worked as a receptionist at a limousine company. When he was 15, he had a resection of his small intestines. His intestines were so twisted they had to be cut out, but there were some complications causing him to not be able to eat for three months. Chad also broke his nose when he was jumped at a Burger King outlet which then required him to be admitted into the hospital. It was there where he met the person who inspired him, his nurse. His nurse was a model and she told Chad to start modeling, but Chad only wanted to act. Chad then took a chance and went to a convention in Buffalo and they wanted him to go to another convention in Biloxi, Mississipi. There, he met a man named Eddie Winkler, who offered Chad a place to stay in Los Angeles to kick-start his career. Not long afterwards, Chad was hired for a Tommy Hilfiger campaign which helped paid his bills and that was when he thought he could really focus on acting. He started out on Dawson's Creek (1998) with his two One Tree Hill (2003) co-stars, Hilarie Burton and Lee Norris. Two years later, he scored the role of rich brat \"Tristian DuGrey\" on Gilmore Girls (2000) before playing \"Lucas Scott\", one half of the young Scott brothers in the popular teen drama One Tree Hill (2003), where he met best friends James Lafferty and Tyler Hilton. Chad also starred in the B-horror flick La maison de cire (2005). He starred in Lionsgate's The Haunting in Connecticut 2: Ghosts of Georgia (2013) and the socially important Indie film, To Write Love on Her Arms (2012) (Kat Dennings, Rupert Friend). Going round the festival circuit, Chad played \"Thatcher\", an HIV-positive character, in the short film The Carrier (2011) (Rita Wilson, Anna Paquin). Murray also released \"Everlast\", his first graphic novel. \"Everlast\" is a passion project of his that tells the story of the tragic hero, \"Derek Everlast\", as he follows his journey to save the world before the \"End of Days\". Chad played football growing up and his love for the sport was projected in a charity game where he would help underprivileged kids with the money he gains from audiences. A fan of philosophy himself, Chad's favorite book is \"Catcher in the Rye\" by J.D. Salinger. He enjoys listening to music from Incubus, Frank Sinatra, James Brown and watching shows such as The Simpsons (1989) and Fear Factor (2001). As for movies, Chad has given credit to Gladiator (2000), Fight Club (1999), Varsity Blues (1999) & Any Given Sunday (1999) as his favorites. Chad married his One Tree Hill (2003) co-star, Sophia Bush, when he was 23. He reportedly cried on his wedding day, the 16th of April, 2005. After less than a year of marriage, the couple signed for an annulment. Chad was also engaged to actress Kenzie Dalton for a few years. In 2015, Chad married actress and model Sarah Roemer, and the two are expecting a child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcxNjYyMDU5NF5BMl5BanBnXkFtZTcwMTQ1NDcxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614877","name":"Chad Michael Murray","nicknames":["CMM"],"idIMDB":"nm0614877"},"actorId":"nm0614877","character":"Jamie Tworkowski","urlCharacter":"http://www.imdb.com/character/ch0241269","main":true},{"actorName":"Rupert Friend","urlProfile":"http://www.imdb.com/name/nm1670029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDExNDE5Ml5BMl5BanBnXkFtZTgwMjUwNjA0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1981","placeOfBirth":" Oxfordshire, England, UK","birthName":"Rupert William Anthony Friend","height":"6' 1\" (1.85 m)","bio":"Rupert Friend was born on October 1, 1981 in Oxfordshire, England as Rupert William Anthony Friend. He is an actor and writer, known for Homeland (2011), The Young Victoria (2009) and Pride & Prejudice (2005). He has been married to Aimee Mullins since May 1, 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDExNDE5Ml5BMl5BanBnXkFtZTgwMjUwNjA0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1670029","name":"Rupert Friend","idIMDB":"nm1670029"},"actorId":"nm1670029","character":"David McKenna","urlCharacter":"http://www.imdb.com/character/ch0242347","main":true},{"actorName":"Mark Saul","urlProfile":"http://www.imdb.com/name/nm0766662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMTM1NTE5OF5BMl5BanBnXkFtZTgwNzk2OTcxNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1985","placeOfBirth":" Los Angeles, California, USA","birthName":"Mark Adam Saul","height":"5' 11\" (1.8 m)","bio":"Mark Saul was born on June 20, 1985 in Los Angeles, California, USA as Mark Adam Saul. He is known for his work on Grey's Anatomy (2005), The Social Network (2010) and Parks and Recreation (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMTM1NTE5OF5BMl5BanBnXkFtZTgwNzk2OTcxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0766662","name":"Mark Saul","idIMDB":"nm0766662"},"actorId":"nm0766662","character":"Dylan","urlCharacter":"http://www.imdb.com/character/ch0497194","main":true},{"actorName":"Juliana Harkavy","urlProfile":"http://www.imdb.com/name/nm3952890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYxMjY4MDg2OF5BMl5BanBnXkFtZTcwMTAzMjE3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Juliana Harkavy is an American actress of Dominican, Russian, African, Chinese, and Hungarian descent. Born on New Years Day in New York City and raised in Los Angeles, Harkavy has been appearing in theater, film, and television since the age of nine. Juliana was born to mother Berta Carela, an artist, writer, and educator from Santo Domingo, and father Michael Harkavy, a Brooklyn native, also a writer, publisher, and athlete. Her only sibling, August, is thirteen years her junior. Juliana's passions were always based in the arts. She grew up playing music from the age of three, studying piano, guitar, voice, and flute. She also began writing and publishing music, stories, and poetry, as well as creating mixed-media visual art at a very young age. With a second passion for athletics and dance, she was able to create a balanced craft that would later prepare her for physically demanding roles, such as ex-military survivor Alicia in AMC's \"The Walking Dead\", and iconic comic book character Dinah Drake/The Black Canary on The CW's \"Arrow\". Harkavy studied theater under the Meisner studio at NYU's Tisch School of the Arts. Other working titles include: Two Streets Entertainment's \"To Write Love on Her Arms\", Warner Bros.' \"Dolphin Tale\", and \"Dolphin Tale 2\", NBC's \"Constantine\", and an award-winning performance as rookie detective Jessica Loren in Magnolia Picture's \"Last Shift.\" Harkavy resides in Los Angeles, CA with her husband and partner of ten years, Peter. Together they share a deep passion for animal rescue, with a focused interest in pit bulls.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYxMjY4MDg2OF5BMl5BanBnXkFtZTcwMTAzMjE3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3952890","name":"Juliana Harkavy","idIMDB":"nm3952890"},"actorId":"nm3952890","character":"Jessie","urlCharacter":"http://www.imdb.com/character/ch0497195","main":true},{"actorName":"Luis Antonio","urlProfile":"http://www.imdb.com/name/nm4472524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODA1NzAxNF5BMl5BanBnXkFtZTgwODAyOTYwMjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Originally from Colombia, Luis Antonio moved to the US at the age of ten. As a child he took a keen interest in art and music but later pursued a degree in Engineering instead. He took his first acting class at the Lisa Maile acting school to help him overcome his fear of public speaking and has been hooked ever since. Appearing in numerous commercials, indies and plays has allowed him to gain experience and build a solid resume.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODA1NzAxNF5BMl5BanBnXkFtZTgwODAyOTYwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4472524","name":"Luis Antonio","idIMDB":"nm4472524"},"actorId":"nm4472524","character":"Jessie's Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Drayton Ball","urlProfile":"http://www.imdb.com/name/nm5010815","urlPhoto":"","biography":{"bio":"Drayton Ball is an actor, known for To Write Love on Her Arms (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5010815","name":"Drayton Ball","idIMDB":"nm5010815"},"actorId":"nm5010815","character":"Young Dylan","urlCharacter":"http://www.imdb.com/character/ch0497194","main":true},{"actorName":"Tiffany Banks","urlProfile":"http://www.imdb.com/name/nm5012817","urlPhoto":"","biography":{"birthName":"Tiffany D. Combs","height":"5' 8\" (1.73 m)","bio":"Tiffany Banks was born Tiffany Combs on May, 23rd, 1982 in Ocala, Florida, USA to Lisa (Robbins) and Daniel Combs. She has one younger brother and is of Scottish, Native American, English, Irish and German descent. Tiffany spent her teenage years in Maysville, Georgia, USA where she grew up with her mother, stepfather and younger brother on their 45 acre chicken farm. Tiffany knew at an early age that she loved the camera as it loved her, starting out modeling for Coppertone as a child. Tiffany has done voice over work and continues to act in feature films. Tiffany is divorced and has two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5012817","name":"Tiffany Banks","idIMDB":"nm5012817"},"actorId":"nm5012817","character":"Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kaleigh Baugh","urlProfile":"http://www.imdb.com/name/nm4917463","urlPhoto":"","biography":{"height":"5' 5\" (1.65 m)","bio":"Kaleigh Baugh is an actress and assistant director, known for Undead Apocalypse (2012), Nostos (2012) and To Write Love on Her Arms (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4917463","name":"Kaleigh Baugh","idIMDB":"nm4917463"},"actorId":"nm4917463","character":"Observer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Benedict","urlProfile":"http://www.imdb.com/name/nm3188810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzUwNjczMF5BMl5BanBnXkFtZTgwNjgzNDA0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1985","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Bradley Philip Benedict","height":"6' 1\" (1.85 m)","bio":"Brad Benedict was born on September 13, 1985 in Atlanta, Georgia, USA as Bradley Philip Benedict. He is an actor and producer, known for Too Close to Home (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzUwNjczMF5BMl5BanBnXkFtZTgwNjgzNDA0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3188810","name":"Brad Benedict","nicknames":["Shark"],"idIMDB":"nm3188810"},"actorId":"nm3188810","character":"Beautiful Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rus Blackwell","urlProfile":"http://www.imdb.com/name/nm0085952","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDY2NjgwNV5BMl5BanBnXkFtZTcwMzExODM3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1963","placeOfBirth":" Rockford, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Rus Blackwell started his acting career in New York, training at Circle in the Square Theatre School and working on stage. Blackwell has built a solid resume over the years and has had the good fortune to work with a number of the industry's top professionals. A tireless work ethic and endless passion make Rus a compelling actor with a terrific range. His work includes roles in the Oscar and Emmy award-winning projects Monster, The Curious Case of Benjamin Button, HBO's Recount and From the Earth to the Moon. Most notably Rus played District Attorney Gordon Hopewell on the Cinemax series Banshee.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDY2NjgwNV5BMl5BanBnXkFtZTcwMzExODM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085952","name":"Rus Blackwell","idIMDB":"nm0085952"},"actorId":"nm0085952","character":"Conrad Willard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corbin Bleu","urlProfile":"http://www.imdb.com/name/nm0088298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTA4Nzc2Ml5BMl5BanBnXkFtZTgwNDUwNDA1NTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1989","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Corbin Bleu Reivers","height":"5' 8½\" (1.74 m)","bio":"Cobin Bleu was born Corbin Bleu Reivers on February 21, 1989 in Brooklyn, New York City, to Martha (Callari) and David Reivers, an actor. His mother is of Italian descent and his father is Jamaican. Corbin began appearing in television commercials at the age two, for products such as Life cereal, Bounty, Hasbro, and Nabisco. It was at that time he also discovered his love for dance when he began taking jazz and ballet classes, usually the only boy in the class. By the age of four he was a model with the Ford Modeling Agency in New York. He appeared in print ads for stores such as Macy's, Gap, Target, and Toys R Us, and fashion spreads in Child, Parent, and American Baby magazines, as well as having his image on toys and game packaging. At age six Corbin appeared in his first professional theater production off Broadway playing an abandon homeless mute in the play \"Tiny Tim is Dead\". Corbin and his family moved to Los Angeles in 1996 and he quickly landed a recurring role on the television series High Incident (1996). He continued to land small roles in such feature films as Soldier (1998) with Kurt Russell, Mystery Men (1999) with Ben Stiller, William H. Macy, and Greg Kinnear, and Galaxy Quest (1999) with Tim Allen, Sigourney Weaver, and Alan Rickman. He also guest starred on such television shows as ER (1994), Malcolm & Eddie (1996), Cover Me (1999), and The Amanda Show (1999). Corbin also continued dancing, eventually becoming one of the first students at the prestigious Debbie Allen Dance Academy. He then attended the Los Angeles County High School for the Arts as a theater major, this time following in his mother's footsteps who attended New York City's famed High School of Performing Arts. While in his freshman year Corbin was cast in his first lead role in the feature film Catch That Kid (2004). Back in school in his sophomore year he played the lead role of Ren in the musical \"Footloose\" and the role of Sonny in the musical \"Grease\". That same year Corbin was honored with the award of Theatre Student of the Year. In the summer of 2004 Corbin became a part of the ensemble cast for the new Discovery Kids television series Flight 29 Down (2005), filmed on location in Hawaii on the island of Oahu. During the summer of 2005 Corbin was cast as Chad in the Disney Channel Original Movie High School Musical (2006) which was directed by Kenny Ortega. Being a big fan of musical theater, Corbin was thrilled to be a part of this musical movie project in which he gets to showcase his dance skills.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTA4Nzc2Ml5BMl5BanBnXkFtZTgwNDUwNDA1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0088298","name":"Corbin Bleu","nicknames":["Bleu Man","Corbie","The Bleu"],"idIMDB":"nm0088298"},"actorId":"nm0088298","character":"Mackey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Samantha Castro","urlProfile":"http://www.imdb.com/name/nm4963935","urlPhoto":"","biography":{"bio":"Samantha Castro is an actress, known for To Write Love on Her Arms (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4963935","name":"Samantha Castro","idIMDB":"nm4963935"},"actorId":"nm4963935","character":"Young Jessie","urlCharacter":"http://www.imdb.com/character/ch0497195","main":true},{"actorName":"Katie Caulfield","urlProfile":"http://www.imdb.com/name/nm4576424","urlPhoto":"","biography":{"bio":"Katie Caulfield is an actress, known for To Write Love on Her Arms (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4576424","name":"Katie Caulfield","idIMDB":"nm4576424"},"actorId":"nm4576424","character":"Choir Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sri Charan","urlProfile":"http://www.imdb.com/name/nm4277996","urlPhoto":"","biography":{"bio":"Sri Charan is known for his work on To Write Love on Her Arms (2012) and The Good Reverend (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4277996","name":"Sri Charan","idIMDB":"nm4277996"},"actorId":"nm4277996","character":"Robert","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1850418","urlIMDB":"http://www.imdb.com/title/tt1850418","business":{"budget":{"money":"$3,400,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"02","year":"2011","remarks":null},{"money":null,"country":null,"day":"29","month":"03","year":"2011","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.6","filmingLocations":[{"location":"Orlando, Florida, USA"}],"rated":"PG-13","awards":[{"award":"Crystal Reel Awards 2012","titlesAwards":[{"titleAwardOutcome":"Won Crystal Reel","categories":[{"category":"Cinematography","names":[{"name":"Stephen Campbell","id":"nm0132864","role":"director of photography"}]},{"category":"Best Actress","names":[{"name":"Kat Dennings","id":"nm0993507","role":"actor"}]},{"category":"Best Sound / Sound Mixing - Feature Film","names":[{"name":"Michael Orlowski","id":"nm0650176","role":null},{"name":"Dave Chmela","id":"nm1479873","role":null}]},{"category":"Best Casting","names":[{"name":"Amy Baker","id":"nm0048221","role":null}]},{"category":"Best Special Effects (CGI)","names":[{"name":"Lee Stringer","id":"nm0834574","role":null}]}]},{"titleAwardOutcome":"Nominated Crystal Reel","categories":[{"category":"Best Director","names":[{"name":"Nathan Frankowski","id":"nm2021984","role":"director"}]},{"category":"Best Picture","names":[{"name":"Kim Dawson","id":"nm0206175","role":"producer"}]}]}]},{"award":"Omaha Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Encore Award","names":[{"name":"Nathan Frankowski","id":"nm2021984","role":"director"},{"name":"Kim Dawson","id":"nm0206175","role":"producer"},{"name":"David McKenna","id":"nm2810037","role":"producer"},{"name":"Two Streets Entertainment","id":null,"role":"production company"}]}]}]},{"award":"Visual Effects Society Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Visual Effects in a Student Project","names":[{"name":"Syrena Edmonds","id":"nm4626861","role":null},{"name":"Zack Heimbegner","id":"nm4577234","role":null},{"name":"Brian Mullen","id":"nm4641735","role":null},{"name":"Nathaniel Skinner","id":"nm4647278","role":null}]}]}]}],"votes":"2,341","type":"Movie","companyCreditsSimple":[{"idCompany":"co0361938","name":"Birchwood Pictures"},{"idCompany":"co0493787","name":"Noble Pictures"},{"idCompany":"co0330723","name":"Two Streets Entertainment"}],"keywords":{"keywords":["depression","drugs","character name in title","one word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:09:19"}}