{"data":{"movies":[{"title":"The Judge","originalTitle":"","year":"2014","releaseDate":"20141010","directors":[{"name":"David Dobkin","id":"nm0229694"}],"writers":[{"name":"Nick Schenk","id":"nm1010405"},{"name":"Bill Dubuque","id":"nm4057793"}],"runtime":"141 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzIxOTIwMV5BMl5BanBnXkFtZTgwMzE0NjQwMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama"],"plot":"Hank Palmer is a successful defense attorney in Chicago, who is getting a divorce. When His brother calls with the news that their mother has died, Hank returns to his childhood home to attend the funeral. Despite the brittle bond between Hank and the Judge, Hank must come to his father's aid and defend him in court. Here, Hank discovers the truth behind the case, which binds together the dysfunctional family and reveals the struggles and secrecy of the family.","simplePlot":"Big-city lawyer Hank Palmer returns to his childhood home where his father, the town's judge, is suspected of murder. Hank sets out to discover the truth and, along the way, reconnects with his estranged family.","actors":[{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Hank Palmer","urlCharacter":"http://www.imdb.com/character/ch0388151","main":true},{"actorName":"Robert Duvall","urlProfile":"http://www.imdb.com/name/nm0000380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1931","placeOfBirth":" San Diego, California, USA","birthName":"Robert Selden Duvall","height":"5' 9½\" (1.77 m)","bio":"Veteran actor and director Robert Selden Duvall was born on January 5, 1931, in San Diego, CA, to Mildred Virginia (Hart), an amateur actress, and William Howard Duvall, a career military officer who later became an admiral. Duvall majored in drama at Principia College (Elsah, IL), then served a two-year hitch in the army after graduating in 1953. He began attending The Neighborhood Playhouse School of the Theatre In New York City on the G.I. Bill in 1955, studying under Sanford Meisner along with Dustin Hoffman, with whom Duvall shared an apartment. Both were close to another struggling young actor named Gene Hackman. Meisner cast Duvall in the play \"The Midnight Caller\" by Horton Foote, a link that would prove critical to his career, as it was Foote who recommended Duvall to play the mentally disabled \"Boo Radley\" in To Kill a Mockingbird (1962). This was his first \"major\" role since his 1956 motion picture debut as an MP was in Somebody Up There Likes Me (1956), starring Paul Newman. Duvall began making a name for himself as a stage actor in New York, winning an Obie Award in 1965 playing incest-minded longshoreman \"Eddie Carbone\" in the off-Broadway revival of Arthur Miller's \"A View from the Bridge\", a production for which his old roommate Hoffman was assistant director. He found steady work in episodic TV and appeared as a modestly billed character actor in films, such as Arthur Penn's The Chase (1966) with Marlon Brando and in Robert Altman's Countdown (1967) and Francis Ford Coppola's The Rain People (1969), in both of which he co-starred with James Caan. He was also memorable as the heavy who is shot by John Wayne at the climax of True Grit (1969) and was the first \"Maj. Frank Burns\", creating the character in Altman's Korean War comedy MASH (1970). He also appeared as the eponymous lead in George Lucas' directorial debut, THX 1138 (1971). It was Francis Ford Coppola, casting The Godfather (1972), who reunited Duvall with Brando and Caan and provided him with his career breakthrough as mob lawyer \"Tom Hagen\". He received the first of his six Academy Award nominations for the role. Thereafter, Duvall had steady work in featured roles in such films as The Godfather: Part II (1974), The Killer Elite (1975), Network (1976), The Seven-Per-Cent Solution (1976) and The Eagle Has Landed (1976). Occasionally this actor's actor got the chance to assay a lead role, most notably in Tomorrow (1972), in which he was brilliant as William Faulkner's inarticulate backwoods farmer. He was less impressive as the lead in Badge 373 (1973), in which he played a character based on real-life NYPD detective Eddie Egan, the same man his old friend Gene Hackman had won an Oscar for playing, in fictionalized form as \"Popeye Doyle\" in The French Connection (1971). It was his appearance as \"Lt. Col. Kilgore\" in another Coppola picture, Apocalypse Now (1979), that solidified Duvall's reputation as a great actor. He got his second Academy Award nomination for the role, and was named by the Guinness Book of World Records as the most versatile actor in the world. Duvall created one of the most memorable characters ever assayed on film, and gave the world the memorable phrase, \"I love the smell of napalm in the morning!\". Subsequently, Duvall proved one of the few established character actors to move from supporting to leading roles, with his Oscar-nominated turns in The Great Santini (1979) and Tender Mercies (1983), the latter of which won him the Academy Award for Best Actor. Now at the summit of his career, Duvall seemed to be afflicted with the fabled \"Oscar curse\" that had overwhelmed the careers of fellow Academy Award winners Luise Rainer, Rod Steiger and Cliff Robertson. He could not find work equal to his talents, either due to his post-Oscar salary demands or a lack of perception in the industry that he truly was leading man material. He did not appear in The Godfather: Part III (1990), as the studio would not give in to his demands for a salary commensurate with that of Al Pacino, who was receiving $5 million to reprise Michael Corleone. His greatest achievement in his immediate post-Oscar period was his triumphant characterization of grizzled Texas Ranger Gus McCrae in the TV mini-series Lonesome Dove (1989), for which he received an Emmy nomination. He received a second Emmy nomination and a Golden Globe for his portrayal of Soviet dictator Joseph Stalin in Stalin (1992), and a third Emmy nomination playing Nazi war criminal Adolf Eichmann in The Man Who Captured Eichmann (1996). The shakeout of his career doldrums was that Duvall eventually settled back into his status as one of the premier character actors in the industry, rivaled only by his old friend Gene Hackman. Duvall, unlike Hackman, also has directed pictures, including the documentary We're Not the Jet Set (1977), Angelo My Love (1983) and Assassination Tango (2002). As a writer-director, Duvall gave himself one of his most memorable roles, that of the preacher on the run from the law in The Apostle (1997), a brilliant performance for which he received his third Best Actor nomination and fifth Oscar nomination overall. The film brought Duvall back to the front ranks of great actors, and was followed by a Best Supporting Actor Oscar nod for A Civil Action (1998). Robert Duvall will long be remembered as one of the great naturalistic American screen actors in the mode of Spencer Tracy and his frequent co-star Marlon Brando. His performances as \"Boo Radley\" in To Kill a Mockingbird (1962), \"Jackson Fentry\" in Tomorrow (1972), \"Tom Hagen\" in the first two \"Godfather\" movies, \"Frank Hackett\" in Network (1976), \"Lt. Col. Kilgore\" in Apocalypse Now (1979), \"Bull Meechum\" in The Great Santini (1979), \"Mac Sledge\" in Tender Mercies (1983), \"Gus McCrae\" in Lonesome Dove (1989) and \"Sonny Dewey\" in The Apostle (1997) rank as some of the finest acting ever put on film. It's a body of work that few actors can equal, let alone surpass.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000380","name":"Robert Duvall","nicknames":["Bob"],"idIMDB":"nm0000380"},"actorId":"nm0000380","character":"Joseph Palmer","urlCharacter":"http://www.imdb.com/character/ch0414035","main":true},{"actorName":"Vera Farmiga","urlProfile":"http://www.imdb.com/name/nm0267812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NzMwNTc1MV5BMl5BanBnXkFtZTcwNDE2ODU2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1973","placeOfBirth":" Clifton, New Jersey, USA","birthName":"Vera Ann Farmiga","height":"5' 7\" (1.7 m)","bio":"Vera Farmiga is an American actress who received an Academy Award nomination for Best Supporting Actress for her role in Up in the Air (2009) and a Primetime Emmy Award nomination for Outstanding Lead Actress in a Drama Series for her role in Bates Motel (2013). She was born Vera Ann Farmiga, the second of seven children, on August 6, 1973, in Clifton, New Jersey, USA, to Ukrainian parents. She did not speak English until the age of six, and was raised in the Ukrainian Catholic home of her mother, Luba (Spas), a schoolteacher, and her father, Michael Farmiga, a computer systems analyst. Her younger sister is actress Taissa Farmiga, who is 21 years her junior. She attended a Ukrainian Catholic school, then went to public school. Young Vera was a shy, nearsighted girl, who played piano and folk danced with a Ukrainian touring company in her teens. In 1991, she graduated from Hunterdon Central Regional High School. She initially dreamed of becoming an optometrist, but changed her mind, and studied acting at Syracuse University's School of Performing Arts, graduating in 1995. The following year, she began her professional acting career, making her Broadway debut as an understudy in the play \"Taking Sides\". Her stage credits included performances in \"The Tempest\", \"Good\", \"The Seagull\", and in a well-reviewed off-Broadway production of \"Second-Hand Smoke\" (1997). That same year, she made her television debut as the female lead, opposite a then-unknown Heath Ledger, in Fox's adventure series Roar (1997). In 1998, Farmiga made her big screen debut in the drama Return to Paradise (1998), then played the daughters of Christopher Walken in The Opportunists (2000) and Richard Gere in Autumn in New York (2000). She starred as a working-class mother struggling to keep her life and marriage together while hiding her drug addiction in Down to the Bone (2004), for which she was awarded Best Actress from the 2004 Sundance Film Festival and the Los Angeles Film Critics Association. Farmiga's acting talent shone in a range of characters, from her role as a senator's daughter in The Manchurian Candidate (2004), the wife of a mobster in Running Scared (2006), a humorous prostitute in Breaking and Entering (2006), and a police psychiatrist in The Departed (2006). In 2010, Farmiga received an Academy Award nomination for Best Actress in a Supporting Role for her performance in Up in the Air (2009). In 2011, she made her directorial debut with the drama Higher Ground (2011), in which she also appears in the leading role. Although the film had a limited release, Farmiga's direction and performance received attention at several festivals. In 2013, she began starring in the drama thriller series Bates Motel (2013), for which she received a Primetime Emmy Award nomination for Outstanding Lead Actress in a Drama Series in the first season. Farmiga was formerly married to actor Sebastian Roché, whom she met during production of Roar (1997). The two eloped to the Bahamas after the series ended in 1997. They separated in 2003 and subsequently divorced. On September 13, 2008, she married musician Renn Hawkey, with whom she has two children, son Fynn McDonnell (b. 2009) and daughter Gytta Lubov Hawkey (b. 2010). Farmiga lives with her family in Hudson Valley, New York. Her other activities, outside her acting profession, include reading, playing piano, boxing, jujitsu, and spending time with her pet angora goats.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NzMwNTc1MV5BMl5BanBnXkFtZTcwNDE2ODU2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267812","name":"Vera Farmiga","idIMDB":"nm0267812"},"actorId":"nm0267812","character":"Samantha Powell","urlCharacter":"http://www.imdb.com/character/ch0414806","main":true},{"actorName":"Billy Bob Thornton","urlProfile":"http://www.imdb.com/name/nm0000671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTUwMDI0OF5BMl5BanBnXkFtZTcwNjIyNzkzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1955","placeOfBirth":" Hot Springs, Arkansas, USA","birthName":"William Robert Thornton","height":"5' 10\" (1.78 m)","bio":"Billy Bob Thornton was born on August 4, 1955 in Hot Springs, Arkansas, to Virginia Roberta (Faulkner), a psychic, and William Raymond (Billy Ray) Thornton, an educator, high school history teacher, and basketball coach (now deceased). He is the older brother of James Donald (Jimmy Don) (born in 1958 and now deceased) and John David (born in 1969). He has been married six times and has four children: daughter Amanda Brumfield, with Melissa Lee Gatlin (now Parish); sons William and Harry, both with Pietra Dawn Cherniak; and daughter Bella with Connie Angland. Billy Bob began his artistic career as a musician, playing drums and singing in a band called Tres Hombres, which once opened for Hank Williams Jr.. In 1981, he moved to Los Angeles with childhood friend Tom Epperson to pursue an acting and writing career. On the side, Billy Bob also sought work as a singer and drummer. He and Epperson tried for years to sell their scripts but no one was buying. During those rough times, Billy Bob neglected his health and subsequently landed in the hospital with heart problems due to malnutrition. In 1992, Billy Bob starred in One False Move (1992), a movie he co-wrote with Epperson. The team finally received attention because of this work, which was very well received in Hollywood. His popularity increased steadily, especially after Sling Blade (1996) which he wrote, directed and in which he starred.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTUwMDI0OF5BMl5BanBnXkFtZTcwNjIyNzkzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000671","name":"Billy Bob Thornton","idIMDB":"nm0000671"},"actorId":"nm0000671","character":"Dwight Dickham","urlCharacter":"http://www.imdb.com/character/ch0450972","main":true},{"actorName":"Vincent D'Onofrio","urlProfile":"http://www.imdb.com/name/nm0000352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1959","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Vincent Phillip D'Onofrio","height":"6' 3½\" (1.92 m)","bio":"Vincent Phillip D'Onofrio was born on June 30, 1959 in Brooklyn, New York, to Phyllis, a restaurant manager and server, and Gene D'Onofrio, a theater production assistant and interior designer. He is of Italian descent and has two older sisters. He studied at the Actors Studio and the American Stanislavski Theatre. Vincent D'Onofrio is known as an \"actor's actor\". The wide variety of roles he has played and the quality of his work have earned him a reputation as a versatile talent. His first paid role was in Off-Broadway's \"This Property Is Condemned\". He continued appearing in plays and worked as a bouncer, a bodyguard and a delivery man. In 1984, he made his Broadway debut in \"Open Admissions\", followed by work in numerous other stage plays. In 2012, D'Onofrio returned to teach at the Lee Strasberg Theater & Film Institute. As a film actor, D'Onofrio's career break came when he played a mentally unbalanced recruit in Full Metal Jacket (1987), directed by the renowned Stanley Kubrick. For this role D'Onofrio gained nearly 70 pounds. He had a major role in Dying Young (1991), and appeared prominently in the box-office smash Men in Black (1997) as the bad guy (Edgar \"The Bug\"). Other films of note in which he has appeared are Mystic Pizza (1988), JFK (1991), The Player (1992), Ed Wood (1994), The Cell (2000), The Break-Up (2006) and Jurassic World (2015). In 1996, D'Onofrio garnered critical acclaim along with co-star Renée Zellweger for The Whole Wide World (1996), which he helped produce. He also made a guest appearance in Homicide: Life on the Street: The Subway (1997), where he played an accident victim who could not be rescued and was destined to die. For this performance he won an Emmy nomination. In 2000, he both produced and starred in Steal This Movie (2000), a biopic of radical leader Abbie Hoffman. In 2001, D'Onofrio took the role which has likely given him his greatest public recognition: Det. Robert Goren, the lead character in the TV series Law & Order: Criminal Intent (2001). Goren is based on Sherlock Holmes but, instead of relying upon physical evidence like Holmes, D'Onofrio's character focuses on psychology to identify the perpetrators, whom he often draws into confessing or yielding condemning evidence. He played the part for 10 years. In his career D'Onofrio's various film characters have included a priest, a bisexual former porn star, a hijacker, a serial killer, Orson Welles, a space alien, a 1960s radical leader, a pulp fiction writer, an ingenious police investigator and Stuart Smalley's dope-head brother. His on-screen love interests have included Julia Roberts, Cameron Diaz, Renée Zellweger, Marisa Tomei, Tracey Ullman, Rebecca De Mornay and Lili Taylor. One of his latest roles is in Marvel's Daredevil (2015) as Daredevil's nemesis, Wilson Fisk. He lives in Manhattan with his wife and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTE2MDkzNF5BMl5BanBnXkFtZTYwODUzMjcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000352","name":"Vincent D'Onofrio","nicknames":["The Human Chameleon","Noffy"],"idIMDB":"nm0000352"},"actorId":"nm0000352","character":"Glen Palmer","urlCharacter":"http://www.imdb.com/character/ch0391951","main":true},{"actorName":"Jeremy Strong","urlProfile":"http://www.imdb.com/name/nm0834989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MjU1OTYxMV5BMl5BanBnXkFtZTgwOTQ0ODI0MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10½\" (1.79 m)","bio":"Jeremy co-starred in the Oscar-nominated film The Big Short (Paramount/Plan B) directed by Adam McKay, alongside Steve Carell, Christian Bale, Ryan Gosling, and Brad Pitt. He starred opposite Robert Downey Jr. and Robert Duvall in the Oscar-nominated film The Judge (Warner Brothers) directed by David Dobkin, in the Oscar-nominated civil rights drama Selma directed by Ava DuVernay, and in Oren Moverman's Time Out Of Mind opposite Richard Gere. His body of work also includes the Oscar-nominated film Lincoln directed by Steven Spielberg, in which Jeremy co-starred alongside Daniel Day Lewis as the President's secretary John Nicolay (DreamWorks) and the Oscar-nominated film Zero Dark Thirty directed by Kathryn Bigelow (Sony). Jeremy played Lee Harvey Oswald in Peter Landesman's acclaimed Kennedy assassination drama Parkland (Playtone). He co-starred in Oscar-winning writer/director Frank Darabont's TNT series \"Mob City.\" He appeared in Oren Moverman's The Messenger, M. Night Shyamalan's The Happening, had the leading role in Humboldt County and has co-starred in numerous independent films at Sundance. Jeremy made his Broadway debut opposite Oscar nominee and Tony winner Frank Langella in A Man For All Seasons (Rounabout) directed by the renowned Doug Hughes. He most recently starred to rave reviews in Amy Herzog's The Great God Pan (Playwright's Horizons) and in Richard Nelson's world premiere translation of Turgenev's A Month In The Country (Williamstown). He played the title role in Sam Gold's production of The Coward (Lincoln Center). Other theater work includes leading roles in Adam Rapp's acclaimed HallwayTrilogy (Rattlestick), Pulitzer Prize nominee Theresa Rebeck's play Our House (Playwrights Horizons), and in David Ives New Jerusalem (CSC). He appeared in Richard Nelson's Conversations In Tusculum (The Public) opposite David Strathairn, in Oscar and Pulitzer prize winning John Patrick Shanley's Defiance (MTC), and Franks Home (Playwrights Horizons) directed by Tony Award winner Robert Falls. Jeremy has been hailed as \"The Excellent Jeremy Strong\" by Ben Brantley of the New York Times. Jeremy was recipient of the Lincoln Center Theater Annenberg Fellowship for \"an artist of extraordinary talent.\" He trained at Yale, The Royal Academy of Dramatic Art in London and Chicago's Steppenwolf Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MjU1OTYxMV5BMl5BanBnXkFtZTgwOTQ0ODI0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834989","name":"Jeremy Strong","idIMDB":"nm0834989"},"actorId":"nm0834989","character":"Dale Palmer","urlCharacter":"http://www.imdb.com/character/ch0479134","main":true},{"actorName":"Dax Shepard","urlProfile":"http://www.imdb.com/name/nm1009277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5Mzg5OTg5N15BMl5BanBnXkFtZTcwODI2MjA0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1975","placeOfBirth":" Milford, Michigan, USA","birthName":"Dax Randall Shepard","height":"6' 3\" (1.91 m)","bio":"Dax Randall Shepard was born in 1975 in Milford, a suburb of Detroit, Michigan, to Laura (LaBo), who worked at GM, and Dave Robert Shepard, Sr., a car salesman. His mother is of French-Canadian and Belgian descent. With both his parents working in the automotive industry, Dax's first love was cars. Shepard graduated from Walled Lake High School in 1993, and moved to California in 1995. He graduated magna cum laude from UCLA with a B.A. in Anthropology. While attending UCLA he trained at The Groundlings Theater for improv and sketch comedy. After eight years of auditioning, Dax booked Punk'd, his first paid acting role. Shepard is married to actress Kristen Bell, with whom he has two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5Mzg5OTg5N15BMl5BanBnXkFtZTcwODI2MjA0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1009277","name":"Dax Shepard","idIMDB":"nm1009277"},"actorId":"nm1009277","character":"C.P. Kennedy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leighton Meester","urlProfile":"http://www.imdb.com/name/nm1015262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3ODQzMzQ3OV5BMl5BanBnXkFtZTgwNTg3MjI5NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1986","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Leighton Marissa Meester","height":"5' 4½\" (1.64 m)","bio":"Leighton Marissa Meester was born in Fort Worth, Texas, to Constance (Haas) and Douglas Meester. Although born in Texas when her mother was serving a jail sentence for her part in a marijuana-smuggling ring, Meester spent her early years in Marco Island, Florida with her grandparents. There, she became involved with the local playhouse and made her stage debut in a production of \"The Wizard of Oz\". She moved to New York with her mother at the age of 11 and was soon working as a model and appearing in TV commercials. A few years later, at age 14, she and her mother moved again, this time to Los Angeles where she soon began to pick up TV work, making her debut in Law & Order: Disciple (1999). A steady stream of TV work followed until in 2007 she landed the role in Gossip Girl (2007) which made her famous. This led to more TV and movie work, and in 2009 she launched a recording career with a single entitled, \"Somebody to Love\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3ODQzMzQ3OV5BMl5BanBnXkFtZTgwNTg3MjI5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1015262","name":"Leighton Meester","idIMDB":"nm1015262"},"actorId":"nm1015262","character":"Carla Powell","urlCharacter":"http://www.imdb.com/character/ch0387830","main":true},{"actorName":"Ken Howard","urlProfile":"http://www.imdb.com/name/nm0397432","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMDA4MDQ2M15BMl5BanBnXkFtZTcwMzQwNzU1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1944","placeOfBirth":" El Centro, California, USA","birthName":"Kenneth Joseph Howard Jr.","height":"6' 6\" (1.98 m)","bio":"Ken Howard was elected the National President of The Screen Actors Guild on September 24, 2009. He has been a working member of SAG for over forty years. The Tony and two-time Emmy Award-winning actor, most recently received an Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie playing Phelan Beale in critically-acclaimed Grey Gardens (2009). The Emmy and Golden Globe-winning film starred Golden Globe-winner Drew Barrymore and fellow Emmy-winner Jessica Lange. He starred opposite Jimmy Smits in the CBS drama Cane (2007) as \"Joe Samuels\". Howard portrayed the world-wise retired Detective Lieutenant \"Max Cavanaugh\" on NBC's Crossing Jordan (2001) and is perhaps best known for his performance as a street-savvy teacher in the classic drama The White Shadow (1978). He taught master classes at the American Repertory Theatre Institute and was an instructor at Harvard University and Harvard Law School. His teaching experience helped form the basis for his book, ACT NATURAL: How to Speak to Any Audience, published by Random House in 2003. In 1968, two years into the three-year program at the Yale School of Drama, he accepted a small role on Broadway in Neil Simon's \"Promises, Promises\". He originated the role of Thomas Jefferson in the Tony-winning musical 1776 (1972), directed by Peter H. Hunt, receiving a Theatre World Award. Howard earned his Tony for his work as a young gym coach at a Catholic Boys' school in \"Child's Play\". He has starred on Broadway in \"Seesaw\", \"The Norman Conquests\", \"1600 Pennsylvania Avenue\" and the national tour of \"Equus\". In 2008, Howard starred in the one-man play, \"According to Tip\". His award-winning performance as Thomas P. 'Tip' O'Neill was critically acclaimed. His feature-film debut was in Tell Me That You Love Me, Junie Moon (1970), opposite Liza Minnelli. Additional films: 1776 (1972), Such Good Friends (1971), Clear and Present Danger (1994), The Net (1995), At First Sight (1999), 2:13 (2009), A Numbers Game (2010) and The Beacon (2009). He delighted movie audiences in 2005 with his work in FOX 2000's In Her Shoes (2005), with Cameron Diaz, Toni Collette and Shirley MacLaine, and in Dreamer: Inspired by a True Story (2005), for Dreamworks, co-starring Kurt Russell and Dakota Fanning. He starred with Sylvester Stallone in Rambo (2008) (aka \"Rambo IV\"), Michael Clayton (2007) with George Clooney and Smother (2008) opposite Diane Keaton. He became firmly established in the public's mind as \"Coach Ken Reeves\" on MTM's prestigious The White Shadow (1978), a series which he co-created, based on his own experiences as the only white player on his high school basketball team. \"White Shadow\" fans can revisit the critically-acclaimed series of seasons 1 and 2 on DVD. He co-starred on the series It's Not Easy (1982), The Colbys (1985) and Dynasty (1981). He guest-starred in numerous prime-time shows: Boston Legal (2004), Dirty Sexy Money (2007), Eli Stone (2008), Cold Case (2003), Brothers & Sisters (2006), Law & Order: Special Victims Unit (1999), Arli$$ (1996), The West Wing (1999), Conviction (2006), Ghost Whisperer (2005), George Lopez (2002) and Showtime's Huff (2004), opposite his dear friend, Blythe Danner. He had a recurring role on Curb Your Enthusiasm (2000) and The Practice (1997). He starred in Sacrifices of the Heart (2007) for the Hallmark Channel. Miniseries include Perfect Murder, Perfect Town: JonBenét and the City of Boulder (2000), The Thorn Birds (1983), Rage of Angels (1983), OP Center (1995), Mastergate (1992), He's Not Your Son (1984), The Country Girl (1982), Murder in New Hampshire: The Pamela Wojas Smart Story (1991), Memories of Midnight (1991). Howard's first Emmy Award was for the on-camera narration of \"Facts for Boys: The Body Human\". His voice can be heard on more than 30 best-selling books on tape. A kidney transplant success (the gift of longtime friend and stunt-woman Jeannie Epper), Howard was appointed Chancellor of the National Kidney Foundation, and works with their efforts to encourage people to donate their organs. He is a member of the Board of the Los Angeles Alzheimer's Committee and, along with his wife, Linda, serves as Board members of Shambala Animal Preserve. He is also the national spokesperson for the Onyx and Breezy Foundation. Howard resides in Los Angeles, with his wife, retired stunt-woman Linda Fetters Howard, and the their recently rescued dogs, Harley Hoops and Hannah Henrietta.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMDA4MDQ2M15BMl5BanBnXkFtZTcwMzQwNzU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0397432","name":"Ken Howard","idIMDB":"nm0397432"},"actorId":"nm0397432","character":"Judge Warren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Tremblay","urlProfile":"http://www.imdb.com/name/nm4590173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDA3Mjg0M15BMl5BanBnXkFtZTgwMTAxNTMzNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Emma Tremblay is an actress, known for Elysium (2013), The Judge (2014) and The Giver (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNDA3Mjg0M15BMl5BanBnXkFtZTgwMTAxNTMzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4590173","name":"Emma Tremblay","idIMDB":"nm4590173"},"actorId":"nm4590173","character":"Lauren Palmer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Balthazar Getty","urlProfile":"http://www.imdb.com/name/nm0001267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4NzU1OTk2Ml5BMl5BanBnXkFtZTcwMjU0NTk1NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1975","placeOfBirth":" Los Angeles, California, USA","birthName":"Paul Balthazar Getty","height":"6' (1.83 m)","bio":"Balthazar Getty was born on January 22, 1975 in Los Angeles, California, USA as Paul Balthazar Getty. He is an actor and producer, known for Brothers & Sisters (2006), Lord of the Flies (1990) and Feast (2005). He has been married to Rosetta Millington since May 3, 2000. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4NzU1OTk2Ml5BMl5BanBnXkFtZTcwMjU0NTk1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001267","name":"Balthazar Getty","nicknames":["Balty"],"idIMDB":"nm0001267"},"actorId":"nm0001267","character":"Deputy Hanson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Krumholtz","urlProfile":"http://www.imdb.com/name/nm0472710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTIxNTA0Nl5BMl5BanBnXkFtZTgwNTM2MTkxNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1978","placeOfBirth":" Queens, New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"David Krumholtz was born on May 15, 1978 in Queens, New York City, New York, USA. He is an actor and producer, known for Sausage Party (2016), Numb3rs (2005) and Slums of Beverly Hills (1998). He has been married to Vanessa Britting since May 22, 2010. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTIxNTA0Nl5BMl5BanBnXkFtZTgwNTM2MTkxNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0472710","name":"David Krumholtz","idIMDB":"nm0472710"},"actorId":"nm0472710","character":"Mike Kattan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grace Zabriskie","urlProfile":"http://www.imdb.com/name/nm0951471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4ODkyOF5BMl5BanBnXkFtZTgwMTc5NDIzNTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1941","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Grace Zabriskie Caplinger","height":"5' 4\" (1.63 m)","bio":"\"Amazing Grace\" Zabriskie was born in New Orleans, Louisiana. She wrote her own original poetry, then performed at coffee shops and various artist hangouts in Atlanta. She was also a wonderful silk-screen printmaker. She moved to Hollywood and made her acting debut in Norma Rae (1979). She went on to appear in over 80 movies. She gave an acclaimed performance as Mrs. Ames in East of Eden (1981), the adaptation of John Steinbeck's novel. Grace appeared in the highly acclaimed and Oscar-nominated An Officer and a Gentleman (1982) and The Big Easy (1986), set in her beloved New Orleans. She worked with producer and director David Lynch, and was a series regular in the cult favorite Twin Peaks (1990) as Sarah Palmer, the part with which she is most often identified. She also appeared in Lynch's Wild at Heart (1990) the same year. She has played a wide variety of roles, and gave a terrific performance in the Oscar-nominated Fried Green Tomatoes (1991) and showed great character depth as the lonely and despondent widow in The Passion of Darkly Noon (1995). Grace's more recent roles were in the zany Sparkler (1997) and in the big-name feature Sans motif apparent (2002), based on a short story by Dashiell Hammett. A woman of many talents, she is currently creating her own original paintings, unique sculptures and woodwork art that can be viewed in Los Angeles galleries. Her visual arts, which include creating lamps or \"sculptures with light\" as she calls them, are available from the L.A.-based ArtHaus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4ODkyOF5BMl5BanBnXkFtZTgwMTc5NDIzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0951471","name":"Grace Zabriskie","nicknames":["Gracie"],"idIMDB":"nm0951471"},"actorId":"nm0951471","character":"Mrs. Blackwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denis O'Hare","urlProfile":"http://www.imdb.com/name/nm0641354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODM4NzU1NV5BMl5BanBnXkFtZTcwMTQwNzQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1962","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Denis Patrick Seamus O'Hare","height":"5' 8\" (1.73 m)","bio":"Denis O'Hare was born on January 17, 1962 in Kansas City, Missouri, USA as Denis Patrick Seamus O'Hare. He is an actor, known for Dallas Buyers Club (2013), The Proposal (2009) and Milk (2008). He has been married to Hugo Redwood since July 28, 2011. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODM4NzU1NV5BMl5BanBnXkFtZTcwMTQwNzQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641354","name":"Denis O'Hare","idIMDB":"nm0641354"},"actorId":"nm0641354","character":"Doc Morris","urlCharacter":"http://www.imdb.com/character/ch0486815","main":true},{"actorName":"Sarah Lancaster","urlProfile":"http://www.imdb.com/name/nm0484178","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk4ODU0MDQ0Ml5BMl5BanBnXkFtZTgwMTA2OTA1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1980","placeOfBirth":" Overland Park, Kansas, USA","birthName":"Sarah Michelle Lancaster","height":"5' 8½\" (1.74 m)","bio":"Born in Overland Park, Kansas, Sarah moved to Mission Viejo, California, when she was 10 years old. In 1994, she secured her first role, as a series regular on Saved by the Bell: The New Class (1993). She then gained attention for her recurring role as \"Madison Kellner\" on the critically-acclaimed Warner Bros. series, Everwood (2002). She went on to star in Dr. Vegas (2004), for CBS from 2004-2006. Followed by ABC's What About Brian (2006), from 2006-2007. Sarah is perhaps best known for her lovable portrayal of \"Ellie Bartowski\" on NBC's long-running series, Chuck (2007). In 2014, Lancaster can be seen, alongside Robert Downey Jr., in The Judge (2014), for Warner Bros. Lancaster resides in Los Angeles with her husband, attorney Matt Jacobs, and their son, Oliver Jacobs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk4ODU0MDQ0Ml5BMl5BanBnXkFtZTgwMTA2OTA1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0484178","name":"Sarah Lancaster","idIMDB":"nm0484178"},"actorId":"nm0484178","character":"Lisa Palmer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1872194","urlIMDB":"http://www.imdb.com/title/tt1872194","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$46,590,889","country":"USA","day":"13","month":"12","year":"2014","remarks":"3,003 Screens"},{"money":"€836,000","country":"Italy","day":"27","month":"10","year":"2014","remarks":""}],"gross":[{"money":"$46,590,889","country":"USA","day":"13","month":"12","year":"2014","remarks":""},{"money":"$75,590,889","country":"Worldwide","day":"13","month":"12","year":"2014","remarks":""},{"money":"€2,382,000","country":"Italy","day":"16","month":"11","year":"2014","remarks":""},{"money":"$230,089","country":"Portugal","day":"13","month":"12","year":"2014","remarks":""},{"money":"44,276","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2013/\">2013</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 21 min (141 min)"],"soundMix":["Dolby Digital","Datasat"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Millennium XL2, Panavision Primo and PVintage Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,877 m (8 reels)"],"negativeFormat":["35 mm (Kodak Vision3 50D 5203, Vision3 200T 5213, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"7.4","metascore":"48","filmingLocations":[{"location":"Boston, Massachusetts, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Performance by an Actor in a Supporting Role","names":[{"name":"Robert Duvall","id":"nm0000380","role":null}]}]}]},{"award":"Golden Globes, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actor in a Supporting Role in a Motion Picture","names":[{"name":"Robert Duvall","id":"nm0000380","role":null}]}]}]},{"award":"Screen Actors Guild Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Performance by a Male Actor in a Supporting Role","names":[{"name":"Robert Duvall","id":"nm0000380","role":null}]}]}]},{"award":"AARP Movies for Grownups Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Movies for Grownups Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Robert Duvall","id":"nm0000380","role":null}]}]}]},{"award":"Broadcast Film Critics Association Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Robert Duvall","id":"nm0000380","role":null}]}]}]},{"award":"Heartland Film 2014","titlesAwards":[{"titleAwardOutcome":"Won Truly Moving Picture Award","categories":[{"category":"","names":[{"name":"David Dobkin","id":"nm0229694","role":null},{"name":"Warner Bros.","id":null,"role":null}]}]}]},{"award":"Hollywood Film Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Film Award","categories":[{"category":"Supporting Actor of the Year","names":[{"name":"Robert Duvall","id":"nm0000380","role":null}]}]}]},{"award":"Hollywood Music In Media Awards (HMMA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated HMMA Award","categories":[{"category":"Best Original Score - Feature Film","names":[{"name":"Thomas Newman","id":"nm0002353","role":null}]}]}]},{"award":"Mill Valley Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"2nd place Audience Award","categories":[{"category":"Best U.S. Feature Film","names":[{"name":"David Dobkin","id":"nm0229694","role":null}]}]}]},{"award":"Palm Springs International Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Icon Award","categories":[{"category":"","names":[{"name":"Robert Duvall","id":"nm0000380","role":null}]}]}]},{"award":"Satellite Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Actor in a Supporting Role","names":[{"name":"Robert Duvall","id":"nm0000380","role":null}]},{"category":"Best Original Score","names":[{"name":"Thomas Newman","id":"nm0002353","role":null}]}]}]}],"votes":"145,365","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0246151","name":"Big Kid Pictures"},{"idCompany":"co0306946","name":"Team Downey"}],"keywords":{"keywords":["courtroom","dysfunctional family","trial","indiana","lawyer","family relationships","father son estrangement","funeral","court","jury selection","matching blood evidence","grandfather granddaughter relationship","police interrogation","murder trial","small town","redemption","judge","incestuous desire","incestuous kiss","movie camera","childhood home","airport","divorce","murder","bar","american flag at half mast","compassionate prison release","bit o honey","man crying","guilty verdict","carton of eggs","bare chested male","blackout","framed for murder","hands free bicycle riding","food freezer","metaphor","averting a fight","playing chess","visiting mother's grave","mens room","conversation in a men's bathroom","chess","manmade waterfall","hush puppy","destroying a film projector","anger","diagnosis","reference to kool aid","packing","change of venue","indiana state penitentiary","deep freezer","1971 cadillac deville","raised middle finger","impounding a car","magic 8 ball","spitting on a car window","murder of son","cadillac","airplane","missing someone","insurance fraud","fraud","beer","suitcase","police car","coffee","manslaughter","hit by a car","murder by drowning","contract","pro bono","clenched fist","homecoming","american flag","truck","tractor","rental car","hydrangea","reference to saint francis","birth certificate","porch","vomiting into a toilet bowl","purgatory","surveillance camera","reference to homer simpson","trophy","reference to saint joseph","reference to sir thomas more","giving a toast","bumper sticker","law student","van","impotence","civil servant","reference to charles francis jenkins","blood clot","ceiling fan","church","dying","wedding ring","little girl driving a car","alzheimer's disease","falling off a bicycle","snapping turtle","hospital bed","hospital","vending machine","indiana state prison","high school yearbook","crawling on the floor","diner owner","reference to the boy scouts","reference to atticus finch","stubbornness","penis slur","crying man","generosity","selfishness","gravestone","reference to the bible","looking at oneself in a mirror","mirror","old friend","loneliness","face slap","mistrial","underwear","scene of the crime","umbrella","legacy","trust","bicycle","looking out a window","urinating on a grave","verdict","shower","giving someone a shower","ambulance","confession","photograph","tragic event","prison","reference to god","law","jury","reading aloud","morphine","pain","sheriff","liar","cheating wife","snake","divorce lawyer","dead body","corpse","innocence","guilt","waitress","diner","cafe","breakfast","unfaithfulness","extramarital affair","adultery","sunglasses","car accident","bail","parole","thunder","grave","burial","restaurant","eating","food","newspaper headline","newspaper","mother son relationship","testimony","mug shot","arrest","little girl","street life","overhead shot","uncle nephew relationship","forgetfulness","widower","rain","movie projector","illness","subjective camera","funeral home","coffin","husband wife relationship","kiss","courthouse","marriage","pregnancy","child support","joke telling","cellphone","flash forward","flashback","basement","mentally challenged brother","defecating on the floor","chemotherapy","bullying","flag at half mast","reference to thurgood marshall","first in class","prison visit","percocet","ice cream cone","knock knock joke","male in a shower","waterfall","breaking a window","baseball trophy","bicycle crash","reference to ronald reagan","reference to ulysses s. grant","walking in the rain","colon cancer","grackle","crossword puzzle","camera shot of feet","barefoot man","cadillac deville","childhood memory","fishing","male vomiting","reference to pablo picasso","new york cityscape","brother brother relationship","female using hair for pretend moustache","putting one's hair under nose like a moustache","convenience store","broken car headlight","damaged fender","bully","former alcoholic","heart attack","surveillance tape evidence","homicidal anger","infidelity","lake","witness impeachment","cross examination","special prosecutor","narcissism","trailer trash","judge on trial","tornado warning","storm siren","uncle daughter sex","illegitimate daughter","tattooed woman","8mm film","home movie","postmodernism","f word","stage four cancer","diarrhea","surveillance footage","video surveillance","lie","paternity revealed","paternity","considering divorce","riding a bicycle","bicycling","memory loss","amnesia","memory","boat","bathroom","urinating on someone","urination","toilet","terminal illness","doctor","cancer","tombstone","cemetery","father daughter relationship","drunkenness","drinking","drink","tornado","suspicion","death","death of wife","pride","cynicism","hit and run","accused of murder","chicago illinois","ex boyfriend ex girlfriend relationship","father son relationship","death of son","death of father","death of mother","plot twist","remote control","killing a deer","hitting a deer with a car","son gives father a shower","72 year old","17 year old","knocking on a door","same day verdict and sentence","dementia","girl","mother daughter relationship","female bartender","reference to willie nelson","reference to pink floyd","reference to metallica"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:16:42"}}