{"data":{"movies":[{"title":"A Resurrection","originalTitle":"","year":"2013","releaseDate":"20130322","directors":[{"name":"Matt Orlando","id":"nm7967242"}],"writers":[{"name":"Matt Orlando","id":"nm7967242"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYzMTMyMjQzN15BMl5BanBnXkFtZTcwNjc4NzQyOQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Horror","Thriller"],"plot":"In Middletown high school, the outcast Eli is bullied by the braggart Brandon and his friends. They are held in detention by the principal Addison to be interviewed by the psychologist Jessie, who is engaged to Deputy Travis the son of the local priest. Jessie and Addison realize that the mentally disturbed Eli misses his big brother Devon, who was murdered in a hit-and-runner. When Eli finally talks to Jessie, he tells that Devon was killed by Brandon. Further, Eli tells that he found the body of his brother and a witch has put an evil spirit in his body. Now he needs six souls to live again and he will seek revenge against Brandon and his friends. The skeptic and atheist Jessie does not believe in his words.","simplePlot":"A murdered boys spirit seeks revenge by seeking six souls to live again.","actors":[{"actorName":"Mischa Barton","urlProfile":"http://www.imdb.com/name/nm0059215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIyNzYyMTA1MF5BMl5BanBnXkFtZTcwMDE4NjgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1986","placeOfBirth":" London, England, UK","birthName":"Mischa Anne Marsden Barton","height":"5' 9\" (1.75 m)","bio":"Born in London and raised in New York. From humble beginnings in New York Theater in 1994 where she trained with such esteemed director/writers as James Lapine (\"Twelve Dreams\" at Lincoln Center with Donna Murphy), Tony Kushner (\"Slavs!\" at New York Theater Workshop with Marisa Tomei), and Naomi Wallace (\"One Flea Spare\" at the Public Theatre with Dianne Wiest), she went on to work side by side with modern-day screen icons including Julia Roberts and Hugh Grant on Notting Hill (1999), Bruce Willis and Toni Collette on The Sixth Sense (1999) and Sam Rockwell in her Sundance critically-lauded feature film debut Lawn Dogs (1997) produced by Duncan Kenworthy in 1998. Yet, despite this early success in theater and film, what really catapulted Mischa to the next level and made her a household name is her small screen performance as the irrepressible and irresistible \"Marisa\" on the popular Fox television show, The O.C. (2003) (2003 to 2007). The show fast became a global cult phenomenon and has earned many awards including a Television Critics Association Award nomination for \"Outstanding New Program of the Year\". Established as one of the most sought after young actresses of her generation Mischa was named \"It Girl\" by Entertainment Weekly, she was also Hollywood Life's \"Breakthrough Actress of the Year\", she won several American Teen Choice Awards for the show, and also Cosmopolitan's \"Fun Fearless Female Award\" for \"Knockout Ingenue\" and Glamour's \"Women of the Year\". She has been ranked as one of People magazine's \"50 Most Beautiful People\" for 5 consecutive years. She was awarded the VIPer Award in 2008 for \"Style Icon 2007\" by Mr. Karl Lagerfeld. In 2008, she played opposite Shirley MacLaine & Christopher Plummer in Sir Richard Attenborough's Closing the Ring (2007), with Hayden Christensen in the Dino De Laurentiis film Medieval pie - Territoires vierges (2007), and starred opposite Bruce Willis in Assassination of a High School President (2008) for the Yari Production Company. In 2007, she filmed Walled In (2009) for the French production company \"Canal Plus\", and she starred in and produced the film Homecoming (2009). In 2012 Mischa went back to her Theatrical roots and starred in a production of \"Steel Magnolias\" at the Gaiety Theatre in Dublin. Mischa has the following Films slated for release this year, 2013. \"Bhopal: A Prayer for Rain\" opposite Martin Sheen, \"A Resurrection\" starring the late Michael Clarke Duncan and Devon Sawa \"Apartment 1303 3D\" with Rebecca De Mornay, \"I Will Follow You Into the Dark\" opposite Ryan Eggold and \"Beauty and the Least: The Misadventures of Ben Banks\". She has just completed \"Mining for Ruby\" Directed by Zoe Quist, \"Beyond Justice\" with Danny Trejo and Vinnie Jones and will star opposite Billy Zane in \"Elephant's Graveyard\" and with Christopher Plummer and Timothy Hutton in \"Butterfly Love\" 2014. Mischa has also made a major impression in the fashion and beauty world. She has already graced the covers of countless international magazines and has become the face of numerous advertising campaigns. She has developed her own Brand, her successful Handbag line having launched in 2008, together with Accessories, Clothing and Beauty products and her Flagship Boutique opened in Fashionable Shoreditch London in 2012. This commercial and theatrical success has given the young woman an opportunity to take an extremely influential role in the global community. She became the spokesperson for \"Climate Star\", an organization that fights global warming through social and legislative activism. She serves as an \"Entertainment Industry Foundation\" ambassador teaming up with QVC to spread awareness and raise funds for women's cancer research through the \"Fashion Footwear Association\" of New York \"Shoes on Sale Initiative\" and is also involved in the \"SAFE\" campaign for skin cancer awareness. She is an ambassador for \"Save the Children\" and the \"One Water\" campaign which brings water to remote locations in Africa, and is on the board of the \"Lupus Research Committee\" in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIyNzYyMTA1MF5BMl5BanBnXkFtZTcwMDE4NjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0059215","name":"Mischa Barton","idIMDB":"nm0059215"},"actorId":"nm0059215","character":"Jessie Parker","urlCharacter":"http://www.imdb.com/character/ch0333769","main":true},{"actorName":"Devon Sawa","urlProfile":"http://www.imdb.com/name/nm0001701","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDkyNDE3Nl5BMl5BanBnXkFtZTgwNTMxNTQwODE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1978","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Devon Edward Sawa","height":"6' (1.83 m)","bio":"Devon started his career as young actor in Vancouver, Canada. First in the theater, and then moving onto smaller roles on TV. His breakout role was the title character in the Universal motion picture, Casper. He went on to star in many more films during his teens such as Now and Then, Little Giants and Wild America. In his early twenties, Devon sought out edgier projects. Movies like Idle Hands, SLC Punk, Final Destination, Slackers and playing 'Stan' in the acclaimed video for Eminem's hit song of the same name, directed by Dr. Dre. Recently Devon spent 4 years on the CW hit show NIKITA. He will be seen next in Punks Dead: SLC Punk 2 and Life On The Line, opposite John Travolta, Kate Bosworth and Sharon Stone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDkyNDE3Nl5BMl5BanBnXkFtZTgwNTMxNTQwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001701","name":"Devon Sawa","idIMDB":"nm0001701"},"actorId":"nm0001701","character":"Travis","urlCharacter":"http://www.imdb.com/character/ch0333770","main":true},{"actorName":"Michael Clarke Duncan","urlProfile":"http://www.imdb.com/name/nm0003817","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDY2ODk5OV5BMl5BanBnXkFtZTYwMjQ0NzE0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1957","placeOfBirth":" Chicago, Illinois, USA","height":"6' 5¼\" (1.96 m)","bio":"Michael Clarke Duncan was born on December 10, 1957 in Chicago, Illinois. Raised by his single mother, Jean, a house cleaner, on Chicago's South Side, Duncan grew up resisting drugs and alcohol, instead concentrating on school. He wanted to play football in high school, but his mother wouldn't let him, afraid that he would get hurt. He then turned to acting, dreaming of becoming a famous actor. After graduating from high school and attending community college, he worked digging ditches at People's Gas Company in Chicago. When he quit his job and headed to Hollywood, he landed small roles while working as a bodyguard. Duncan's role in the movie Armageddon (1998) led to his breakthrough performance in The Green Mile (1999), when his Armageddon co-star Bruce Willis called director Frank Darabont, suggesting Duncan for the part of convict John Coffey. He landed the role, getting critical acclaim as well as many other Awards and Nominations, including an Academy Award Nomination for Best Actor in a Supporting Role. After suffering a heart attack on July 13, 2012, he was taken to a Los Angeles hospital in which his girlfriend Omarosa Manigault-Stallworth tried to save his life with CPR. Unfortunately, on September 3, 2012, Michael Clarke Duncan died at age 54 from respiratory failure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDY2ODk5OV5BMl5BanBnXkFtZTYwMjQ0NzE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003817","name":"Michael Clarke Duncan","nicknames":["Hollywood","Big Mike","Papa Bear"],"idIMDB":"nm0003817"},"actorId":"nm0003817","character":"Addison","urlCharacter":"http://www.imdb.com/character/ch0333771","main":true},{"actorName":"J. Michael Trautmann","urlProfile":"http://www.imdb.com/name/nm1920618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDA3NTcwNF5BMl5BanBnXkFtZTgwODY1NjI0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Born in Milwaukee, WI and raised in Minneapolis, MN. His parents (John/Marian) compromised on his name by putting his first initial in front of his official middle name and calling him J.Michael. He was an immediate class clown, even if it got him into trouble in school. In his Freshman year of high school he was urged to try out for the school's production of 'Romeo & Juliet'. He soon after played the title role and began acting, gaining much praise for his portrayal and depth; he performed regularly in the school's plays. After graduation he attended the University of Arizona and was accepted as a BFA actor in the prestigious Arizona Repertory Theatre where he notably played Eugene Jerome in the Neil Simon Trilogy of 'Brighton Beach Memoirs', 'Biloxi Blues' and 'Broadway Bound'. During his Sophomore year in college he was seen performing in an Improv Comedy Troupe and was asked to audition for his first film 'Earnie'. Notable roles on screen include Kevin in '96 Minutes' and as Iggy Milkovich in 'Shameless' on Showtime.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNDA3NTcwNF5BMl5BanBnXkFtZTgwODY1NjI0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1920618","name":"J. Michael Trautmann","idIMDB":"nm1920618"},"actorId":"nm1920618","character":"Eli Driggers","urlCharacter":"http://www.imdb.com/character/ch0333772","main":true},{"actorName":"Stuart Stone","urlProfile":"http://www.imdb.com/name/nm0832187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyODcyNzQ5Ml5BMl5BanBnXkFtZTcwMTgyNjYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1980","placeOfBirth":" Thornhill, Ontario, Canada","birthName":"Stuart Eisenstein","height":"5' 7\" (1.7 m)","bio":"Stuart Stone was born on November 17, 1980 in Thornhill, Ontario, Canada as Stuart Eisenstein. He is an actor and producer, known for Donnie Darko (2001), Joy Ride (2001) and Babar (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyODcyNzQ5Ml5BMl5BanBnXkFtZTcwMTgyNjYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0832187","name":"Stuart Stone","idIMDB":"nm0832187"},"actorId":"nm0832187","character":"Nick","urlCharacter":"http://www.imdb.com/character/ch0333773","main":true},{"actorName":"Nick Jandl","urlProfile":"http://www.imdb.com/name/nm2633482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgzMTQ3ODM3Nl5BMl5BanBnXkFtZTcwNDI4MjE3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Nick Jandl is an actor, known for Nashville (2012), Green Lantern (2011) and The 4 to 9ers: The Day Crew (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgzMTQ3ODM3Nl5BMl5BanBnXkFtZTcwNDI4MjE3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2633482","name":"Nick Jandl","idIMDB":"nm2633482"},"actorId":"nm2633482","character":"Brandon","urlCharacter":"http://www.imdb.com/character/ch0333774","main":true},{"actorName":"Matthew Willig","urlProfile":"http://www.imdb.com/name/nm2200632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjE5Mzg4MV5BMl5BanBnXkFtZTgwMzk1OTM4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1969","placeOfBirth":" La Mirada, California, USA","birthName":"Matthew Joseph Willig","height":"6' 6½\" (1.99 m)","bio":"Matthew is retired from the NFL after 14 seasons. He played for 6 teams (New York Jets, Atlanta Falcons, Green Bay Packers, St. Louis Rams, San Francisco 49ers and the Carolina Panthers). He went to 2 Super Bowls while winning 1 and losing the other. He is steadily rising up the Acting ladder and receiving acclaim as his roles get bigger and better.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjE5Mzg4MV5BMl5BanBnXkFtZTgwMzk1OTM4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2200632","name":"Matthew Willig","idIMDB":"nm2200632"},"actorId":"nm2200632","character":"Vince","urlCharacter":"http://www.imdb.com/character/ch0333775","main":true},{"actorName":"Alanna Janell","urlProfile":"http://www.imdb.com/name/nm2636911","urlPhoto":"","biography":{"bio":"Alanna Janell is an actress, known for The Last Witch Hunter (2015), Kantemir (2015) and A Resurrection (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2636911","name":"Alanna Janell","idIMDB":"nm2636911"},"actorId":"nm2636911","character":"Tammy","urlCharacter":"http://www.imdb.com/character/ch0333776","main":true},{"actorName":"Morgan Wolk","urlProfile":"http://www.imdb.com/name/nm4265544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTc5OTE0NF5BMl5BanBnXkFtZTgwOTczNTA4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Morgan Wolk is an actress, known for The Perks of Being a Wallflower (2012), Miles Ahead (2015) and As the Crow Flies (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTc5OTE0NF5BMl5BanBnXkFtZTgwOTczNTA4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4265544","name":"Morgan Wolk","idIMDB":"nm4265544"},"actorId":"nm4265544","character":"Dian","urlCharacter":"http://www.imdb.com/character/ch0333777","main":true},{"actorName":"Brenden Meers","urlProfile":"http://www.imdb.com/name/nm2370270","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDJmY2M4YjEtYTZmZi00Yzk1LTk5MjgtNTM0ZGI0ZDJlZmRiXkEyXkFqcGdeQXVyMTIwNDAyNjc@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1991","placeOfBirth":" Columbus, Ohio, USA","height":"6' (1.83 m)","bio":"Brenden Meers was born Brenden Meers Smith. He was raised by his Mother, Angella Smith. His enjoyment of movies, and imitating characters from movies, made his choice to start a career in acting a natural one. In the summer of 2004, at the age of 13, he landed his first role in \"Beowulf: Prince of the Geats,\" playing a Norse warrior. In the several months between landing the role and shooting started, he had to grow a full head of hair and a beard, which, surprisingly enough considering his age, he was able to do. He subsequently received the nickname \"Jesus,\" from classmates and teachers at his school due to, they said, that his new look so closely resembled the pictures of Jesus you see in churches and for sale as art prints. He took it as a compliment! The movie went through some serious delays, before being released on DVD in December, 2008. As an honor student in high school, Brenden, was able to attend a technical school program as a junior and senior studying Motion Picture and Television Production. As a student, he wrote, produced and directed his own 10 minute short film. The film is a drama and deals with the issues of child abuse across socio-economic lines. He would like to turn it into a feature length film someday. He is in the process of writing two other scripts that he would like to direct someday. Since graduating from school in 2009, he has not only concentrated on achieving his entrance into the DGA, which he will have achieved by the end of 2015 by working on feature films as a production assistant, but has worked on furthering his acting career by securing several small acting and stunt roles in films as his busy set PA schedule has allowed. His biggest role so far was in 2010 when he was cast as a main supporting actor in a SAG modified low budget film, \"The Sibling,\" renamed, \"A Resurrection\", directed by Matthew Orlando, working alongside Mischa Barton, Michael Clark Duncan, Nick Jandl and several other very interesting and talented actors. AS of this writing in 2015, he has achieved SAG/AFTRA entrance and is currently (2015) starting to focus on stunt actor work as he finds he has a particular interest in the action-focus of stunt acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDJmY2M4YjEtYTZmZi00Yzk1LTk5MjgtNTM0ZGI0ZDJlZmRiXkEyXkFqcGdeQXVyMTIwNDAyNjc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2370270","name":"Brenden Meers","nicknames":["Hollywood","Sleeves"],"idIMDB":"nm2370270"},"actorId":"nm2370270","character":"Alex","urlCharacter":"http://www.imdb.com/character/ch0333802","main":true},{"actorName":"Annie Kitral","urlProfile":"http://www.imdb.com/name/nm0457723","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDg4MjYzMF5BMl5BanBnXkFtZTcwNzMxNjY5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' (1.52 m)","bio":"Annie Kitral is an actress, known for Jack Reacher (2012), My Bloody Valentine (2009) and Welcome to Collinwood (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDg4MjYzMF5BMl5BanBnXkFtZTcwNzMxNjY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0457723","name":"Annie Kitral","idIMDB":"nm0457723"},"actorId":"nm0457723","character":"The Bruja","urlCharacter":"http://www.imdb.com/character/ch0333782","main":true},{"actorName":"Todd Bellinger","urlProfile":"http://www.imdb.com/name/nm5478580","urlPhoto":"","biography":{"bio":"Todd Bellinger is an American actor who has reignited his career with several appearances on the hit ABC series Nashville. There he started out as a featured background actor and was seen in episode 10 celebrating with Teddy Conrad's (Eric Close) family on his Nashville Mayor election win. He has since played a Edgehill Republic executive and can be seen in episodes 17 and 19 with Juliette Barnes (Hayden Panettiere) Born on June 27, 1971, in Oswego NY, Bellinger attended the State University of New York at Onondaga where electively studied acting. Bellinger attended both Corcoran High School and Henninger High School in Syracuse, NY, where he graduated in 1990. At the urging of his mother in grade school, Bellinger attended a modeling search in Buffalo NY and was selected by a handful of agencies including Ford. After bouncing around employers in the Syracuse area he landed a job at Cadaret Grant Broker in downtown Syracuse in 1999. There he began a career in the IT field as a Systems Analyst. He also met his wife to be Nina Cua, daughter of rocker and Syracuse Sammy Hall a Fame inductee Rick Cua. Cua brought Bellinger to Nashville in 2002 where they married in 2004. Bellinger resumed his career in the IT field working for BMI in Nashville. There he met several Nashville music industry talent in various parties hosted by BMI. In 2012 Bellinger had the opportunity to cast for a role in a brand new ABC series called Nashville, which was to be filmed in the city of Nashville. He took that opportunity and was selected to be a featured extra in an early pilot. There he has worked his way to the from the background to the front of the camera in several episodes. Bellinger may be a late bloomer as he is currently working on several feature films being produced in the southeast. Bellinger has two children with his wife Nina Bellinger.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5478580","name":"Todd Bellinger","idIMDB":"nm5478580"},"actorId":"nm5478580","character":"Sheriff Feingold","urlCharacter":"http://www.imdb.com/character/ch0500033","main":true},{"actorName":"Antonio Costa","urlProfile":"http://www.imdb.com/name/nm2067691","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MzM2NDg5Nl5BMl5BanBnXkFtZTcwMzQzOTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9½\" (1.77 m)","bio":"Antonio Costa is an actor, known for A Better Life (2007), Cielito lindo (2010) and Unbreakable (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MzM2NDg5Nl5BMl5BanBnXkFtZTcwMzQzOTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2067691","name":"Antonio Costa","idIMDB":"nm2067691"},"actorId":"nm2067691","character":"Ignacio","urlCharacter":"http://www.imdb.com/character/ch0333781","main":true},{"actorName":"Tyler Courtad","urlProfile":"http://www.imdb.com/name/nm4068529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDExOTM2NV5BMl5BanBnXkFtZTgwNjY1NDYzOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Tyler Courtad is known for his work on My Crazy Ex (2014), Jack Reacher (2012) and Atonia (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDExOTM2NV5BMl5BanBnXkFtZTgwNjY1NDYzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4068529","name":"Tyler Courtad","idIMDB":"nm4068529"},"actorId":"nm4068529","character":"Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick de Ledebur","urlProfile":"http://www.imdb.com/name/nm4326490","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGZjM2IzYzUtZDM1Ny00ZDcwLWIxOGItZDE1MDI1MzMyNjg0L2ltYWdlXkEyXkFqcGdeQXVyMzQ3MDEyMDQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Patrick de Ledebur is an actor and writer, known for The Perks of Being a Wallflower (2012), Fun Size (2012) and A Resurrection (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGZjM2IzYzUtZDM1Ny00ZDcwLWIxOGItZDE1MDI1MzMyNjg0L2ltYWdlXkEyXkFqcGdeQXVyMzQ3MDEyMDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4326490","name":"Patrick de Ledebur","idIMDB":"nm4326490"},"actorId":"nm4326490","character":"Devon","urlCharacter":"http://www.imdb.com/character/ch0333778","main":true}],"seasons":[],"idIMDB":"tt1817276","urlIMDB":"http://www.imdb.com/title/tt1817276","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,300","country":"USA","day":"25","month":"03","year":"2013","remarks":"17 Screens"},{"money":"$7,300","country":"USA","day":"22","month":"03","year":"2013","remarks":"17 Screens"}],"gross":[{"money":"$10,730","country":"USA","day":"29","month":"03","year":"2013","remarks":""},{"money":"$10,730","country":"USA","day":"28","month":"03","year":"2013","remarks":""}],"weekendGross":[{"money":"$7,300","country":"USA","day":"25","month":"03","year":"2013","remarks":"17 Screens"},{"money":"$7,300","country":"USA","day":"24","month":"03","year":"2013","remarks":"17 Screens"},{"money":"$7,300","country":"USA","day":"22","month":"03","year":"2013","remarks":"17 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["RED - Mysterium X"],"laboratory":null,"filmLength":null,"negativeFormat":["Digital"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.0","filmingLocations":[{"location":"Pennsylvania, USA"}],"rated":"R","awards":[],"votes":"1,429","type":"Movie","companyCreditsSimple":[{"idCompany":"co0292237","name":"Jamie Kennedy Entertainment"},{"idCompany":"co0325248","name":"Levine Pictures"}],"keywords":{"keywords":["brother","spirit","priest","witch","high school","school","principal","deputy","low budget film","hit by a car","violence","bandage","pain","garage","corpse","pony tail","panic","nightmare","shower","fear","gravestone","figure","dream","theatre","cemetery","icon","landscape","hourglass","drawing","clock","prayer","crucifix","gunshot","snow","coffin","strangulation","held at gunpoint","locked in","shotgun","investigation","photograph","teenage boy","police car","interrogation","death of brother","murder","spiritualism","flashback","resurrection","basement","bi polar","hit and run","psychiatrist","siren","cigar smoking","incantation","spanish","old woman","magic spell","small town","teacher student relationship","bruja","washroom","school teacher","mental illness","punched in the face","classroom","student","tears","ritual","crying","gore","wound","attack","knife","pig","death","rite","stage","blood","old man","confession","toilet","campfire","forest","counsellor","janitor","tent","grave","woods","sheriff","anger","revenge"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:00:35"}}