{"data":{"movies":[{"title":"Winter's Tale","originalTitle":"","year":"2014","releaseDate":"20140214","directors":[{"name":"Akiva Goldsman","id":"nm0326040"}],"writers":[{"name":"Akiva Goldsman","id":"nm0326040"},{"name":"Mark Helprin","id":"nm4311444"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMyNjI1NTM4N15BMl5BanBnXkFtZTgwNjcwMzc1MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Fantasy","Mystery","Romance"],"plot":"New York City is subsumed in arctic winds, dark nights, and white lights, its life unfolds, for it is an extraordinary hive of the imagination, the greatest house ever built, and nothing exists that can check its vitality. One night in winter, Peter Lake (), orphan and master-mechanic, attempts to rob a fortress-like mansion on the Upper West Side. Though he thinks the house is empty, the daughter of the house is home. Thus begins the love between Peter, an Irish burglar in his early 20's, and Beverly Penn (), a young girl, who is dying.","simplePlot":"A burglar falls for an heiress as she dies in his arms. When he learns that he has the gift of reincarnation, he sets out to save her.","actors":[{"actorName":"Colin Farrell","urlProfile":"http://www.imdb.com/name/nm0268199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzM5NDk0MV5BMl5BanBnXkFtZTcwNzAzMTUxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1976","placeOfBirth":" Castleknock, Dublin, Ireland","birthName":"Colin James Farrell","height":"5' 10\" (1.78 m)","bio":"Colin Farrell is one of Ireland's best rising stars in Hollywood and abroad today. His film presence has been filled with memorable roles that range from an inwardly tortured hit man, to an adventurous explorer, a determined-but-failing writer, and the greatest military leader in history. Farrell was born on May 31, 1976 in Castleknock, Dublin, Ireland, to Rita (Monaghan) and Eamon Farrell. His father and uncle were both professional athletes, and for a while, it looked like Farrell would follow in their footsteps. Farrell auditioned for a part in the Irish Boy Band, Boyzone, but it didn't work out. After dropping out of the Gaiety School of Acting, Farrell was cast in Ballykissangel (1996), a BBC television drama. \"Ballykissangel\" was not his first role on screen. Farrell had previously been in The War Zone (1999), directed by Tim Roth and had appeared in the independent film Drinking Crude (1997). Farrell was soon to move on to bigger things. Exchanging his usually thick Dublin accent for a light Texas drawl, Farrell acted in the gritty Tigerland (2000), directed by Joel Schumacher. Starring Farrell amongst a number of other budding young actors, the film portrays a group of new recruits being trained for the war in Vietnam. Farrell played the arrogant soldier Boz, drafted into the army and completely spiteful of authority. The film was praised by critics, but did not make much money at the box office. It was Farrell's first big role on film, and certainly not his last. Farrell followed up with American Outlaws (2001), where he played the notorious outlaw Jesse James with Scott Caan, son of legendary actor James Caan, in the role of Cole Younger. The film was a box office flop and failure with the critics. Immediately, Farrell returned to the war drama film that had made him famous. Co-starring in the war film Hart's War (2002) opposite Bruce Willis, Farrell played the young officer captured by the enemy. The film was another failure. Farrell struck gold when he was cast in the Steven Spielberg film Minority Report (2002) that same year. Set in a futuristic time period, Farrell played the character Danny Witwer, a young member of the Justice Department who is sent after Tom Cruise's character. The film was a smash hit, and praised by critics. Farrell continued this success when he reunited with Joel Schumacher on the successful thriller Phone Booth (2002). Farrell played the role of the victim who is harassed by an unseen killer (Kiefer Sutherland) and is made to reveal his sins to the public. 2003 was a big year for Farrell. He starred in the crime thriller The Recruit (2003) as a young CIA man mentored by an older CIA veteran (Al Pacino). Pacino later stated that Farrell was the best actor of his generation. Farrell certainly continued to be busy that year with Daredevil (2003), which actually allowed him to keep his thick Irish accent. The film was another success for Farrell, as was the crime film S.W.A.T. (2003) where Farrell starred opposite Samuel L. Jackson and LL Cool J. Farrell also acted in the Irish black comedy film Intermission (2003) and appeared another Irish film Veronica Guerin (2003) which reunited him with Joel Schumacher once again. The following year, Farrell acted in what is his most infamous film role yet: the title role in the mighty Oliver Stone film epic Alexander (2004), which is a character study of Alexander the Great as he travels across new worlds and conquers all the known world before him. Farrell donned a blond wig and retained his Irish accent, and gave a fine performance as Alexander. However, both he and the film were criticized. Despite being one of the highest grossing films internationally and doing a good job at the DVD sales, Farrell did not come out of the experience without a few hurts. Farrell attempted to rebound with his historical film The New World (2005). Reuniting with \"Alexander\" star Christopher Plummer, and also acting with Christian Bale, Farrell played the brave explorer John Smith, who would make first contacts with the Native peoples. The film did not do well at the box office, though critics praised the film's stunning appearance and cinematography. Farrell returned to act in Michael Mann's film Miami Vice (2006) alongside Jamie Foxx. The film was a film adaptation of the famous television series, and did reasonably well at the box office. Farrell also acted in Ask the Dust (2006) with Salma Hayek and Donald Sutherland, though the film did not receive much distribution. The next year, Farrell acted alongside Ewan McGregor in the Woody Allen film Cassandra's Dream (2007) which received mixed reviews from critics. Farrell followed up with the hilarious black comedy In Bruges (2008). Written and directed by Irish theatre director Martin McDonagh, the film stars Farrell and Brendan Gleeson as two Irish hit men whose latest assignment went wrong, leaving them to hide out in Bruges, Belgium. The film has been one of Farrell's most praised work, and he was nominated for a Golden Globe. As well as In Bruges (2008), Farrell acted alongside Edward Norton in the crime film Pride and Glory (2008) which was not as successful as the former film. As well as working with charity, and speaking at the Special Olympics World Games in 2007, he has donated his salary for Terry Gilliam's The Imaginarium of Doctor Parnassus (2009) to Heath Ledger's little daughter (who was left nothing in a will that had not been updated in time). Ledger had originally been cast in the film and was replaced by Farrell, Johnny Depp and Jude Law. The film was a critical and financial success, and Farrell also played a small role in Crazy Heart (2009) which had the Dubliner playing a country singer. Farrell even sang a few songs for the film's soundtrack. As well as those small roles, Farrell took the lead role in the war film Triage (2009). Farrell incredibly lost forty-four pounds to play the role of a war photographer who must come to terms with what he has experienced in Kurdistan. While the film was finely made, with excellent performances from all involved, the film has received almost no distribution. Farrell's other leading role that year was in Neil Jordan's Irish film Ondine (2009), which had Farrell playing an imaginative fisherman who thinks he has caught a mermaid in his net. In recent years, he co-starred in the comedy horror film Fright Night (2011), the science fiction action film Total Recall (2012), both remakes, and McDonagh's second feature, and the black comedy crime film Seven Psychopaths (2012). Since the mid-2000s, Farrell has cleaned up his act, and far from being a Hollywood hell raiser and party animal, Farrell has shown himself to be a respectable and very talented actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzM5NDk0MV5BMl5BanBnXkFtZTcwNzAzMTUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0268199","name":"Colin Farrell","idIMDB":"nm0268199"},"actorId":"nm0268199","character":"Peter Lake","urlCharacter":"http://www.imdb.com/character/ch0362779","main":true},{"actorName":"Matt Bomer","urlProfile":"http://www.imdb.com/name/nm0093589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTE4NTE5NV5BMl5BanBnXkFtZTcwMTcyOTY5Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1977","placeOfBirth":" Webster Groves, Missouri, USA","birthName":"Matthew Staton Bomer","height":"5' 11½\" (1.82 m)","bio":"Matthew Staton Bomer was born in Webster Groves, Greater St. Louis, Missouri, to Elizabeth Macy (Staton) and John O'Neill Bomer IV, a Dallas Cowboys draft pick. Matt was raised in Spring, Texas, and educated at Klein High School, near Houston. After school, he attended Carnegie Mellon University in Pittsburgh, Pennsylvania, graduating with a Bachelor of Fine Arts degree. Bomer then relocated to New York to forge a career in acting. Theater work followed, but his television break came with a small part in All My Children (1970). This lead to a reoccurring role in Guiding Light (1952) as murderous Ben Reade. Further success in TV followed including parts in Tru Calling (2003), Chuck (2007) and the lead role in Traveler (2007) . Bomer also scored film roles in projects such as Flightplan (2005) and The Texas Chainsaw Massacre: The Beginning (2006). In 2009, he was cast in the lead role of criminal mastermind Neal Caffrey in Fox's White Collar (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTE4NTE5NV5BMl5BanBnXkFtZTcwMTcyOTY5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0093589","name":"Matt Bomer","idIMDB":"nm0093589"},"actorId":"nm0093589","character":"Young Man","urlCharacter":"http://www.imdb.com/character/ch0452187","main":true},{"actorName":"Lucy Griffiths","urlProfile":"http://www.imdb.com/name/nm2189625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTI3MDQ1ODFeQTJeQWpwZ15BbWU3MDA4MzEwMDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1986","placeOfBirth":" Brighton, England, UK","birthName":"Lucy Ursula Griffiths","height":"5' 6\" (1.68 m)","bio":"Lucy Griffiths (10 October 1986) was born in Brighton, Griffiths was educated at Roedean School, Windlesham House School, Dorothy Stringer High School and Varndean College. She is a former member of the National Youth Music Theatre. She first appeared on television in Sea of Souls and then Sugar Rush, and on stage in The White Devil. She was most famous for her role as Marian in the BBC drama Robin Hood and Ruth in the TV series The Little House. Her most recent notable performance was her appearance as Nora, Eric Northman's \"sister\", in the HBO series True Blood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTI3MDQ1ODFeQTJeQWpwZ15BbWU3MDA4MzEwMDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2189625","name":"Lucy Griffiths","idIMDB":"nm2189625"},"actorId":"nm2189625","character":"Young Woman","urlCharacter":"http://www.imdb.com/character/ch0457692","main":true},{"actorName":"Michael Crane","urlProfile":"http://www.imdb.com/name/nm1510059","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDg3NjE1Ml5BMl5BanBnXkFtZTgwODU5NTM5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michael Crane is an actor and producer, known for Winter's Tale (2014), Barry (2016) and Kings (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDg3NjE1Ml5BMl5BanBnXkFtZTgwODU5NTM5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1510059","name":"Michael Crane","idIMDB":"nm1510059"},"actorId":"nm1510059","character":"Ellis Isle Doctor","urlCharacter":"http://www.imdb.com/character/ch0457691","main":true},{"actorName":"Brian Hutchison","urlProfile":"http://www.imdb.com/name/nm0404427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEyOTcwNDE4N15BMl5BanBnXkFtZTcwMzcxMTEwOQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Originally from Pittsburgh, Brian received a BA from Pennsylvania's Lafayette College and earned a Master of Fine Arts in Dramatic Arts at the University of San Diego / Old Globe Theater He has worked both on, and off Broadway in New York and at major regional theaters throughout the Northeast. Brian has appeared as a guest star in several television series including HBO's Vinyl, and Show Me a Hero; Killing Kennedy, Person of Interest, Do No Harm, The Good Wife and, Law and Order among others. Brian is an award-winning narrator who has worked on dozens of audio books for Audible.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEyOTcwNDE4N15BMl5BanBnXkFtZTcwMzcxMTEwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0404427","name":"Brian Hutchison","idIMDB":"nm0404427"},"actorId":"nm0404427","character":"Ellis Isle Official","urlCharacter":"http://www.imdb.com/character/ch0457690","main":true},{"actorName":"Kevin Corrigan","urlProfile":"http://www.imdb.com/name/nm0180984","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1OTc2NDU0OV5BMl5BanBnXkFtZTcwMjI3Mjg4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1969","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Kevin Fitzgerald Corrigan","height":"5' 9\" (1.75 m)","bio":"A native of the Bronx, New York, Kevin Corrigan has been acting and writing since the age of 15. He made his film debut in Lost Angels (1989) and around that time, when he was just 17, his original play \"The Boiler Room\" was produced by the Young Playwrights Festival of New York. He has gone on to star in countless independent films and has made quite an impression. Corrigan is also an experienced guitarist and has played in several New York City bands.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1OTc2NDU0OV5BMl5BanBnXkFtZTcwMjI3Mjg4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0180984","name":"Kevin Corrigan","idIMDB":"nm0180984"},"actorId":"nm0180984","character":"Romeo Tan","urlCharacter":"http://www.imdb.com/character/ch0457689","main":true},{"actorName":"Alan Doyle","urlProfile":"http://www.imdb.com/name/nm0236269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjgyMjExOV5BMl5BanBnXkFtZTYwNjU3MTMz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1969","placeOfBirth":" Petty Harbour, Newfoundland, Canada","bio":"Alan Doyle was born on May 17, 1969 in Petty Harbour, Newfoundland, Canada. He is known for his work on Robin Hood (2010), The Shipping News (2001) and State of Play (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjgyMjExOV5BMl5BanBnXkFtZTYwNjU3MTMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236269","name":"Alan Doyle","idIMDB":"nm0236269"},"actorId":"nm0236269","character":"Dingy Worthington","urlCharacter":"http://www.imdb.com/character/ch0457688","main":true},{"actorName":"Russell Crowe","urlProfile":"http://www.imdb.com/name/nm0000128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTExNTMxOF5BMl5BanBnXkFtZTcwNDg1NzkzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1964","placeOfBirth":" Wellington, New Zealand","birthName":"Russell Ira Crowe","height":"5' 11½\" (1.82 m)","bio":"Russell Ira Crowe was born in Wellington, New Zealand, to Jocelyn Yvonne (Wemyss) and John Alexander Crowe, both of whom catered movie sets. His maternal grandfather, Stanley Wemyss, was a cinematographer. Crowe's recent ancestry includes Welsh (where his paternal grandfather was born, in Wrexham), English, Irish, Scottish, Norwegian, Swedish, and Maori (one of Crowe's maternal great-grandmothers, Erana Putiputi Hayes Heihi, was Maori). Crowe's family moved to Australia when he was a small child, and Russell got the acting bug early in life. Beginning as a child star on a local Australian TV show, Russell's first big break came with two films ... the first, Romper Stomper (1992), gained him a name throughout the film community in Australia and the neighboring countries. The second, The Sum of Us (1994), helped put him on the American map, so to speak. Sharon Stone heard of him from Romper Stomper (1992) and wanted him for her film, Mort ou vif (1995). But filming on The Sum of Us (1994) had already begun. Sharon is reported to have held up shooting until she had her gunslinger-Crowe, for her film. With Mort ou vif (1995) under his belt as his first American film, the second was offered to him soon after. Virtuosity (1995), starring Denzel Washington, put Russell in the body of a Virtual Serial Killer, Sid6.7 ... a role unlike any he had played so far. Virtuosity (1995), a Sci-Fi extravaganza, was a fun film and, again, opened the door to even more American offers. L.A. Confidential (1997), Russell's third American film, brought him the US fame and attention that his fans have felt he deserved all along. Missing the Oscar nod this time around, he didn't seem deterred and signed to do his first film with The Walt Disney Company, Mystery, Alaska (1999). He achieved even more success and awards for his performances in Gladiator (2000) and A Beautiful Mind (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTExNTMxOF5BMl5BanBnXkFtZTcwNDg1NzkzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000128","name":"Russell Crowe","nicknames":["Rusty","Russ"],"idIMDB":"nm0000128"},"actorId":"nm0000128","character":"Pearly Soames","urlCharacter":"http://www.imdb.com/character/ch0297186","main":true},{"actorName":"Jessica Brown Findlay","urlProfile":"http://www.imdb.com/name/nm3726887","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDQ2MjUzOV5BMl5BanBnXkFtZTcwNzI5ODYxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1989","placeOfBirth":" Cookham, Berkshire, England, UK","height":"5' 5\" (1.65 m)","bio":"Jessica Brown Findlay is an English actress. She was born in Cookham, Berkshire, to Beverley, a teacher's aid and nurse, and Christopher Brown-Findlay, who works in finance. She is of Scottish and English descent. Jessica trained with the National Youth Ballet and the Associates of the Royal Ballet. At age 15, she was invited to dance with the Kirov at the Royal Opera House for a summer season. She is best known for playing Lady Sybil Crawley in ITV's Downton Abbey and Emelia Conan-Doyle in the British comedy-drama Albatross.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDQ2MjUzOV5BMl5BanBnXkFtZTcwNzI5ODYxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3726887","name":"Jessica Brown Findlay","nicknames":["Jess"],"idIMDB":"nm3726887"},"actorId":"nm3726887","character":"Beverly Penn","urlCharacter":"http://www.imdb.com/character/ch0441554","main":true},{"actorName":"Jon Patrick Walker","urlProfile":"http://www.imdb.com/name/nm0907895","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyODYxOTY5NTNeQTJeQWpwZ15BbWU3MDc3MzA5OTY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Jon Patrick Walker is an actor, known for Winter's Tale (2014), The Secret Lives of Dentists (2002) and Holding the Baby (1998). He is married to Hope Davis. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyODYxOTY5NTNeQTJeQWpwZ15BbWU3MDc3MzA5OTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907895","name":"Jon Patrick Walker","idIMDB":"nm0907895"},"actorId":"nm0907895","character":"Optometrist","urlCharacter":"http://www.imdb.com/character/ch0457687","main":true},{"actorName":"David O'Brien Hart","urlProfile":"http://www.imdb.com/name/nm5610128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDYxMjU5OF5BMl5BanBnXkFtZTgwNTcxMjAwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"David O'Brien Hart is an actor, known for Winter's Tale (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDYxMjU5OF5BMl5BanBnXkFtZTgwNTcxMjAwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5610128","name":"David O'Brien Hart","idIMDB":"nm5610128"},"actorId":"nm5610128","character":"Penn House Butler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Hurt","urlProfile":"http://www.imdb.com/name/nm0000458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzA5MTUxN15BMl5BanBnXkFtZTcwMTU3ODQ3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1950","placeOfBirth":" Washington, District of Columbia, USA","birthName":"William M. Hurt","height":"6' 2\" (1.88 m)","bio":"William McChord Hurt was born in Washington, D.C., to Claire Isabel (McGill) and Alfred McChord Hurt, who worked at the State Department. He was trained at Tufts University and The Juilliard School and has been nominated for four Academy Awards, including the most recent nomination for his supporting role in David Cronenberg's A History of Violence (2005). Hurt received Best Supporting Actor accolades for the role from the Los Angeles Film Critics circle and the New York Film Critics Circle. Hurt spent the early years of his career on the stage between drama school, summer stock, regional repertory and off-Broadway, appearing in more than fifty productions including \"Henry V\", \"5th of July\", \"Hamlet\", \"Uncle Vanya\", \"Richard II\", \"Hurlyburly\" (for which he was nominated for a Tony Award), \"My Life\" (winning an Obie Award for Best Actor), \"A Midsummer's Night's Dream\" and \"Good\". For radio, Hurt read Paul Theroux's \"The Grand Railway Bazaar\", for the BBC Radio Four and \"The Shipping News\" by Annie Proulx. He has recorded \"The Polar Express\", \"The Boy Who Drew Cats\", \"The Sun Also Rises\" and narrated the documentaries, \"Searching for America: The Odyssey of John Dos Passos\", \"Einstein-How I See the World\" and the English narration of Elie Wiesel's \"To Speak the Unspeakable\", a documentary directed and produced by Pierre Marmiesse. In 1988, Hurt was awarded the first Spencer Tracy Award from UCLA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzA5MTUxN15BMl5BanBnXkFtZTcwMTU3ODQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000458","name":"William Hurt","nicknames":["Bill"],"idIMDB":"nm0000458"},"actorId":"nm0000458","character":"Isaac Penn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maurice Jones","urlProfile":"http://www.imdb.com/name/nm2253389","urlPhoto":"","biography":{"height":"5' 11\" (1.8 m)","bio":"Maurice Jones is an actor, known for Winter's Tale (2014), And So It Goes (2014) and Romeo and Juliet (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2253389","name":"Maurice Jones","idIMDB":"nm2253389"},"actorId":"nm2253389","character":"Cecil Mature","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mckayla Twiggs","urlProfile":"http://www.imdb.com/name/nm5305040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjQyNjg5MF5BMl5BanBnXkFtZTgwNzQwMDM0NDE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"bio":"Mckayla Twiggs is an actress, known for Winter's Tale (2014), 37 (2016) and Orange Is the New Black (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjQyNjg5MF5BMl5BanBnXkFtZTgwNzQwMDM0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5305040","name":"Mckayla Twiggs","idIMDB":"nm5305040"},"actorId":"nm5305040","character":"Young Willa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew R. Staley","urlProfile":"http://www.imdb.com/name/nm1008191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODM3MjYzMl5BMl5BanBnXkFtZTcwMDA1MzYxMg@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1978","placeOfBirth":" Gainesville, Florida, USA","height":"5' 8\" (1.73 m)","bio":"Matthew R. Staley was born on April 22, 1978 in Gainesville, Florida, USA. He is known for his work on The Dark Knight Rises (2012), Independence Day: Resurgence (2016) and The Perks of Being a Wallflower (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODM3MjYzMl5BMl5BanBnXkFtZTcwMDA1MzYxMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1008191","name":"Matthew R. Staley","idIMDB":"nm1008191"},"actorId":"nm1008191","character":"Oyster Boy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1837709","urlIMDB":"http://www.imdb.com/title/tt1837709","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,007,059","country":"USA","day":"16","month":"02","year":"2014","remarks":"2,965 Screens"},{"money":"HUF 14,199,165","country":"Hungary","day":"16","month":"02","year":"2014","remarks":"30 Screens"}],"gross":[{"money":"$12,600,231","country":"USA","day":"19","month":"08","year":"2014","remarks":""},{"money":"$12,600,231","country":"USA","day":"03","month":"04","year":"2014","remarks":""},{"money":"$12,591,660","country":"USA","day":"30","month":"03","year":"2014","remarks":""},{"money":"$12,556,157","country":"USA","day":"23","month":"03","year":"2014","remarks":""},{"money":"$12,506,315","country":"USA","day":"16","month":"03","year":"2014","remarks":""},{"money":"$12,470,979","country":"USA","day":"09","month":"03","year":"2014","remarks":""},{"money":"$11,267,356","country":"USA","day":"23","month":"02","year":"2014","remarks":""},{"money":"$8,007,059","country":"USA","day":"16","month":"02","year":"2014","remarks":""},{"money":"$30,800,231","country":"Worldwide","day":"19","month":"08","year":"2014","remarks":""},{"money":"$211,764","country":"Portugal","day":"19","month":"08","year":"2014","remarks":""}],"weekendGross":[{"money":"$845","country":"USA","day":"08","month":"02","year":"2015","remarks":"1 Screen"},{"money":"$12,737","country":"USA","day":"30","month":"03","year":"2014","remarks":"85 Screens"},{"money":"$37,878","country":"USA","day":"23","month":"03","year":"2014","remarks":"144 Screens"},{"money":"$19,997","country":"USA","day":"16","month":"03","year":"2014","remarks":"50 Screens"},{"money":"$33,126","country":"USA","day":"09","month":"03","year":"2014","remarks":"82 Screens"},{"money":"$2,173,455","country":"USA","day":"23","month":"02","year":"2014","remarks":"2,965 Screens"},{"money":"$8,007,059","country":"USA","day":"16","month":"02","year":"2014","remarks":"2,965 Screens"}],"admissions":[{"money":"19,679","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":{"money":null,"country":null,"day":"29","month":"10","year":"2012","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"26","month":"10","year":"2012","remarks":null},{"money":null,"country":null,"day":"19","month":"02","year":"2013","remarks":null}],"copyrightHolder":"© 2014 WARNER BROS. ENTERTAINMENT INC. - - U.S., Canada, Bahamas &amp; Bermuda / © 2014 VILLAGE ROADSHOW FILMS (BVI) LIMITED - - All Other Territories"},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus 4:3, Panavision C-, E-, G-Series, ATZ and AWZ2 Lenses"],"laboratory":["Technicolor, New York (NY), USA"],"filmLength":["3,233.8 m (7 reels)"],"negativeFormat":["Codex ARRIRAW (2.8K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6.2","metascore":"31","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG-13","awards":[{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Romance Poster","names":[{"name":"Warner Bros.","id":null,"role":null},{"name":"Ignition Creative","id":null,"role":null}]}]}]},{"award":"Hollywood Makeup Artist and Hair Stylist Guild Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Artisan","categories":[{"category":"Best Contemporary Hair Styling - Feature Films","names":[{"name":"Alan D'Angerio","id":"nm0195310","role":null},{"name":"Jasen Joseph Sica","id":"nm0796333","role":null}]}]}]}],"votes":"43,744","type":"Movie","companyCreditsSimple":[{"idCompany":"co0108864","name":"Village Roadshow Pictures"},{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0093488","name":"Weed Road Pictures"}],"keywords":{"keywords":["red haired woman","miracle","tuberculosis","falling through ice","drawing with blood","black and white photograph","playing piano","horse jumping a fence","riding bareback","stethoscope","spirit guide","horse chase","white horse","flying horse","burglar","winter","dying girl","frost","thief","fever","19th century","train station","grand central station manhattan new york city","seizure","newspaper editor","microfilm reader","fire in a 55 gallon drum","model ship","year 1895","year 2014","new york cityscape","bare chested male","sidewalk chalk drawing","pushed off a bridge","facial scar","cityscape","derby","cemetery","calla lily boutonniere","ballroom dancing","men hugging","furnace","hearing","jumping off a cliff","two on a horse","amnesia","dead woman with eyes open","dead woman carried","dead woman","death of lover","magical realism","written by director","based on novel","outnumbered 20 to 1"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:47:09"}}