{"data":{"movies":[{"title":"The Crying Dead","originalTitle":"","year":"2011","releaseDate":"20111031","directors":[{"name":"Hunter G. Williams","id":"nm2598931"}],"writers":[{"name":"Hunter G. Williams","id":"nm2598931"},{"name":"Scott Michael Campbell","id":"nm0132843"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk0NTMzMzU1M15BMl5BanBnXkFtZTgwNzExNjU0MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Horror","Thriller"],"plot":"This film tells the horrifying story of the cast and crew of a new reality TV show investigating the paranormal. When the team is denied access to the Ettersburg hospital, they decide to sneak in and explore at night. Ettersburg hospital, believed to be haunted after the tragic death years before of three young girls burned alive in an apparent accident is to be the pilot episode. What starts out as an uneventful evening exploring the dark halls of the expansive hospital, turns into a fear filled nightmare when one of their team goes missing. As the team separates to search for their missing friend, they find themselves running for their lives as one after the other they fall victim to the hospital and its crying dead.","simplePlot":"This film tells the horrifying story of the cast and crew of a new reality TV show investigating the paranormal. When the team is denied access to the Ettersburg hospital, they decide to ... ","actors":[{"actorName":"Chris Hayes","urlProfile":"http://www.imdb.com/name/nm3252890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMTEyNDU3MF5BMl5BanBnXkFtZTgwNzkxNDcwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Timothy Christopher Hayes was the first of three sons born to Tim Hayes, an executive for Bayer Healthcare, and Susan Hayes, an interior refiner. Though Hayes took his first breaths in San Antonio, Texas, his time in the Lone Star State would be short-lived, due to the demands of his father's career. In fact, Hayes moved around to 8 different states as a child before eventually settling in Chester, New Jersey at the age of 10. It was in New Jersey where Hayes's love for acting first revealed itself, when in 8th grade he was intent on being cast as the lead in his class production of \"Romeo & Juliet\" for the sole purpose of kissing the girl who played Juliet. Unfortunately for the ambitious middle schooler, Hayes, who describes himself back then as a \"chubby little troll,\" did not exactly look like Romeo-at least in the conventional sense. Instead, Hayes was cast as Mercutio, where his natural comedic timing allowed him to steal the show. His quest to become a working actor began that night, and his love for comedy and his penchant for stealing scenes have continued to this day. From that point, Hayes began a torrid pace of making short films with his friends throughout high school and college. Among the hundreds of films that he shot during this period were low budget homages to \"Jurassic Park,\" \"Back to the Future,\" and \"Upright Citizens Brigade.\" He also produced an abundance of original improv material. After graduating from West Morris Mendham High School in 2003, Hayes attended Wake Forest University in Winston-Salem, NC, where he pledged Sigma Pi Fraternity and graduated with honors with a degree in economics. Despite what his degree says, Hayes's actual focus during this time was the theater, where he was able to really stretch himself as an actor through works as diverse as Ibsen's \"An Enemy of the People\" to Charles Busch's \"Psycho Beach Party.\" Studying abroad in both Australia and Spain also contributed heavily to the breadth of experiences that Hayes is able to draw on for each role that he plays. In 2007, almost immediately after graduating from college, Hayes took the plunge and moved out to Los Angeles. Within a year, Hayes booked the lead in his first feature film, \"The Loneliest Road in America,\" a story of three friends on a road-trip along America's beautiful and desolate Route 50. The film was shot on-location in Colorado, Nevada, Utah, and California. While working at a casting office, not long after wrapping this first film, Hayes displayed a bit of ingenuity in procuring his next feature film role. He asked to work as a \"reader\" during auditions for \"Beneath the Dark,\" which his office was casting. Hayes impressed the film's producers so much that towards the end of the process, they offered him a small role in the film. Not only did this role earn Hayes his SAG eligibility, but he also attended the film's world premier at the 2010 South by Southwest film festival in Austin, Texas, where his grandmother did him the honor of being his date on the red carpet. Since that time, Hayes has managed to increase his profile even more. He recently finished filming a principal role in \"Black Gold\" starring Billy Zane, Eric Roberts, Tom Sizemore and Michael Madsen. He has another film, \"The Grief Tourist,\" starring Melanie Griffith and Michael Cudlitz opening this year. Hayes provided a lead role in the short-film, \"Shooting for Something Else,\" which was recently accepted into the 2011 Cannes Film Festival. In addition, he was recently cast to appear in two more feature films set to begin filming soon. Though Hayes often plays the boy next door with a darker side, he is a versatile talent, whose sincerity and eagerness to learn have allowed him to find relative success in a short period of time. Strong relationships with family and friends will serve to keep him grounded as his star rises even higher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMTEyNDU3MF5BMl5BanBnXkFtZTgwNzkxNDcwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3252890","name":"Chris Hayes","idIMDB":"nm3252890"},"actorId":"nm3252890","character":"Chris Mitchel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Stearns","urlProfile":"http://www.imdb.com/name/nm0824182","urlPhoto":"","biography":{"dateOfBirth":"13 April 1977","placeOfBirth":"","birthName":"Jeffrey Allen Stearns","bio":"Jeff Stearns was born on April 13, 1977 as Jeffrey Allen Stearns. He is an actor and producer, known for Pacific Blue (1996), Fire Over Afghanistan (2003) and The Crying Dead (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824182","name":"Jeff Stearns","idIMDB":"nm0824182"},"actorId":"nm0824182","character":"Jeff Pierson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Becka Adams","urlProfile":"http://www.imdb.com/name/nm4274183","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWQ5YjA5ZjAtY2U2ZC00OThhLThmMTAtZjYzZDM4ZmI5OTU4XkEyXkFqcGdeQXVyMjI4NTM2Njg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1987","placeOfBirth":" Elizabeth, Colorado, USA","bio":"Becka Adams was born on April 21, 1987 in Elizabeth, Colorado, USA. She is an actress, known for The Crying Dead (2011), Alone (2014) and The Invoking 2 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWQ5YjA5ZjAtY2U2ZC00OThhLThmMTAtZjYzZDM4ZmI5OTU4XkEyXkFqcGdeQXVyMjI4NTM2Njg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4274183","name":"Becka Adams","idIMDB":"nm4274183"},"actorId":"nm4274183","character":"Becka Lassiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angelina Lyubomirova","urlProfile":"http://www.imdb.com/name/nm2945054","urlPhoto":"","biography":{"height":"5' 6\" (1.68 m)","bio":"Angelina Lyubomirova is an actress and producer, known for The Crying Dead (2011), Shooting for Something Else (2011) and Call to Action (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2945054","name":"Angelina Lyubomirova","idIMDB":"nm2945054"},"actorId":"nm2945054","character":"Angelina Becker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Callie Cameron","urlProfile":"http://www.imdb.com/name/nm3811505","urlPhoto":"","biography":{"bio":"Callie Cameron is beautiful, talented, and not afraid of reinventing herself. The actress and model has been building a solid career in Hollywood and is currently turning heads as the ultra-retro 1960's sexy Secretary in HBO's latest comedy series, \"Funny or Die Presents.\" Callie has been the face for numerous national advertising campaigns, first gaining notoriety as the Old Spice girl from a Super Bowl spot which creatively teamed up Chris Applebaum (director of Britney Spears music videos) and Robin Antin (Pussycat Dolls creator/choreographer). Her talent also caught the media's attention, appearing on \"EXTRA,\" in Maxim Magazine, named \"#1 on the Hit List\" for Stuff Magazine, and Esquire Magazine featured her as 'One of the Sexiest Women in the World'. Callie has always viewed life as a never-ending world of possibilities. Even when her parents divorce took her from Oklahoma City to San Diego, she viewed it as a new adventure. It would be this attitude that would lead her to model professionally, leaving home at a young age to travel and explore the world. Callie has lived in Sydney, Australia; Milan, Italy; Hamburg, Germany; London, England; Miami and Los Angeles. Always looking for a challenge, it was a natural progression for the young model to turn her sights to acting, bringing the experience and perspective she's gained from traveling the world to each character she portrays. Callie's dedication to her acting has brought her into other aspects of the industry, including working at Paramount Pictures and currently at Oxymoron Entertainment. Alongside producer Christopher Mallick (Middle Men), Callie is involved in Oxymoron's creative process for upcoming films. She is involved in public relations, on-set productions, budget meetings and casting negotiations. Later this year, Callie will be lending her talents both in front of and behind the camera for Oxymoron's new feature, \"Ninety.\"","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3811505","name":"Callie Cameron","idIMDB":"nm3811505"},"actorId":"nm3811505","character":"Callie Brooks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelsi Cullimore","urlProfile":"http://www.imdb.com/name/nm1570097","urlPhoto":"","biography":{"bio":"Kelsi Cullimore is an actress, known for Jackie & Ryan (2014), The Crying Dead (2011) and Nowhere Safe (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1570097","name":"Kelsi Cullimore","idIMDB":"nm1570097"},"actorId":"nm1570097","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Olson","urlProfile":"http://www.imdb.com/name/nm3744647","urlPhoto":"","biography":{"height":"5' 8\" (1.73 m)","bio":"Andrew Olson is an actor, known for The Channel (2016), The Crying Dead (2011) and The Survival Games (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3744647","name":"Andrew Olson","idIMDB":"nm3744647"},"actorId":"nm3744647","character":"Andrew Halstead","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brooke Johnson","urlProfile":"http://www.imdb.com/name/nm5117393","urlPhoto":"","biography":{"bio":"Brooke Johnson is an actress, known for The Crying Dead (2011) and South of Hell (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5117393","name":"Brooke Johnson","idIMDB":"nm5117393"},"actorId":"nm5117393","character":"Elizabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"GiGi LaMar","urlProfile":"http://www.imdb.com/name/nm4842527","urlPhoto":"","biography":{"bio":"GiGi LaMar is an actress, known for The Program (SSR-7) (2013), A Letter to Mom (2013) and Back in the Day (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4842527","name":"GiGi LaMar","idIMDB":"nm4842527"},"actorId":"nm4842527","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivia Prado","urlProfile":"http://www.imdb.com/name/nm4801917","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NDE2MzIyMF5BMl5BanBnXkFtZTgwNTA5MDI0NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Olivia Prado is an actress, known for Oksana (2014), Black and White (2015) and On the Fence (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NDE2MzIyMF5BMl5BanBnXkFtZTgwNTA5MDI0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4801917","name":"Olivia Prado","idIMDB":"nm4801917"},"actorId":"nm4801917","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Megan Richie","urlProfile":"http://www.imdb.com/name/nm4773343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM0MDI2NTAwNF5BMl5BanBnXkFtZTgwNzM4MTEyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Megan Richie is known for her work on Legendary Dudas (2016), Jake and the Never Land Pirates (2011) and Austin & Ally (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM0MDI2NTAwNF5BMl5BanBnXkFtZTgwNzM4MTEyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4773343","name":"Megan Richie","idIMDB":"nm4773343"},"actorId":"nm4773343","character":"Ghost Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liv von Oelreich","urlProfile":"http://www.imdb.com/name/nm2057935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzgwMDE4M15BMl5BanBnXkFtZTgwODA1ODQzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Liv von Oelreich is an actress and producer, known for The Girl with the Dragon Tattoo (2011), Choice (2016) and A Companion for All Occasions (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzgwMDE4M15BMl5BanBnXkFtZTgwODA1ODQzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2057935","name":"Liv von Oelreich","idIMDB":"nm2057935"},"actorId":"nm2057935","character":"Nurse Childers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sewell Whitney","urlProfile":"http://www.imdb.com/name/nm0926355","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4MTk0NzMzN15BMl5BanBnXkFtZTgwMTk5Mjk5MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sewell Whitney is an actor, known for He Was a Quiet Man (2007), Beyond a Reasonable Doubt (2009) and What Happened to Monday? (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4MTk0NzMzN15BMl5BanBnXkFtZTgwMTk5Mjk5MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926355","name":"Sewell Whitney","idIMDB":"nm0926355"},"actorId":"nm0926355","character":"Dr. Rangel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hunter G. Williams","urlProfile":"http://www.imdb.com/name/nm2598931","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDA3ODA5N15BMl5BanBnXkFtZTcwMzg1MjcwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1979","placeOfBirth":" Tarzana, California, USA","height":"6' 1\" (1.85 m)","bio":"Born June 23rd in Tarzana Ca, Hunter is the son of celebrated hair stylist Marlene D Williams and stunt man Richard Williams. Growing up on set was intriguing to young Hunter, getting to meet many of Hollywood's A list. He excelled in sports, and after high school traveled Europe playing minor league soccer. After a serious ankle injury, he returned home to Los Angeles. It is said that when one door shuts, another opens. An old friend asked Hunter if he wanted to go to an open casting call for a Drew Barrymore film, and he agreed. While standing in a line of two hundred hopefuls, Hunter was spotted by the casting director and offered a role in Never Been Kissed (1999). The production atmosphere seduced him, he quickly moved his soccer career to the back burner and dedicated his time to acting. Over the next few years Hunter was in countless casting rooms, tirelessly auditioning all over town. He was a reoccurring character on Spy Tv (2001), Who knows the Band? (2001), and The Jamie Kennedy Experiment (2002). He also did several photo shoots, appearing in ads for Levis and O'Neil. With his ankle now healed, Hunter went back to competitive soccer while still searching for his break out role. In 2007 his dream of playing pro soccer seemed ready to take flight when he was asked to try out for the LA Galaxy. Just days later, he was offered his first lead role in the suspense thriller, Divine Unrest (2008). The cross roads can be a lonely place, and the direction we choose may change things forever. Hunter took the role of Fin Griffin, a man tormented by guilt and addiction. The experience calcified his perception of the craft, and justified his many years of hard work. He has never looked back. Next he landed roles in several shorts, including G.S.I. Ghost Services International (2007), Diagonal (2009), and another lead in the feature length film Theft by Deception (2010). Hunters parents met on the set of Little Big Man (1970). And it goes with out saying that Hollywood has changed a bit in the last forty years. In 2009 Hunter decided to take charge of his career, and formed Busted Knuckle Productions. He surrounded himself with industry professionals and raw talent. His competitive nature and personable demeanor allow him to wear the producer's hat with confidence and grace. Consummate networking skills and efficient use of resources helped him produce, co-write and star in their first feature, Cornered (2011). Also due out this next is the paranormal thriller, The Whispering Dead (2013), and a short film titled The Riverside Shuffle (2011). Today Busted Knuckle Productions is a fully functioning production company, with complete top of the line camera and lighting departments, and a wide range of talent to pull from in all areas. Their up coming slate of projects is looking strong. The Mandess Within (2017) has begun Post-Production, their first animated feature, The Grundles has begun filming, and Pre production has begun on The Road Home (2017), and Killing Angels (2017). Hunter is quickly proving he is worth his salt in many ways, although he truly is an actor first. With Busted Knuckle Productions as the vehicle, and Hunter at the helm, we have only seen the beginning of a career bound for greatness.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDA3ODA5N15BMl5BanBnXkFtZTcwMzg1MjcwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2598931","name":"Hunter G. Williams","nicknames":["H.G."],"idIMDB":"nm2598931"},"actorId":"nm2598931","character":"Dr. Simon","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1814905","urlIMDB":"http://www.imdb.com/title/tt1814905","business":{"budget":{"money":"$200,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Busted Knuckle Productions"},"technical":{"runtime":["1 hr 21 min (81 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.0","filmingLocations":[{"location":"California, USA"}],"awards":[],"votes":"787","type":"Movie","companyCreditsSimple":[{"idCompany":"co0259748","name":"Busted Knuckle Productions"}],"keywords":{"keywords":["reality show","disappearance","haunted hospital","supernatural"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:24:40"}}