{"data":{"movies":[{"title":"L'occupation intime","originalTitle":"","year":"2011","releaseDate":"20110925","directors":[{"name":"Isabelle Clarke","id":"nm0164793"}],"writers":[{"name":"Patrick Buisson","id":"nm5769305"},{"name":"Isabelle Clarke","id":"nm0164793"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWM4Y2IzMmYtNDZiZi00N2JmLWIzN2ItZjc1NmM2MmJhMDBmXkEyXkFqcGdeQXVyNjY4Mzc0NA@@._V1.jpg","countries":["France"],"languages":["French"],"genres":["Documentary"],"simplePlot":"","actors":[{"actorName":"Anouchka Delon","urlProfile":"http://www.imdb.com/name/nm1354819","urlPhoto":"","biography":{"dateOfBirth":"25 November 1990","placeOfBirth":" Paris, France","bio":"Anouchka Delon was born on November 25, 1990 in Paris, France. She is an actress, known for Amour et sexe sous l'occupation (2011), L'occupation intime (2011) and Sacrifice (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1354819","name":"Anouchka Delon","idIMDB":"nm1354819"},"actorId":"nm1354819","character":"Récitante / Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alain Delon","urlProfile":"http://www.imdb.com/name/nm0001128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MDI2MDY3OV5BMl5BanBnXkFtZTYwNDg5ODM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1935","placeOfBirth":" Sceaux, Seine [now Hauts-de-Seine], Île-de-France, France","height":"5' 9¾\" (1.77 m)","bio":"Alain Fabien Maurice Marcel Delon was born in Sceaux, Hauts-de-Seine, France, to Édith (Arnold) and Fabien Delon. His father was of French and Corsican Italian descent, and his mother was of French and German ancestry. His parents divorced early on, and Delon had a stormy childhood, being frequently expelled from school. In 1953/1954 he served with the French Marines in Indochina. In the mid-'50s he worked at various odd jobs including waiter, salesman and porter in Les Halles market. He decided to try an acting career and in 1957 made his film debut in Yves Allégret's Send a Woman When the Devil Fails (1957). He declined an offer of a contract from producer David O. Selznick, and in 1960 he received international recognition for his role in Luchino Visconti's Rocco and His Brothers (1960). In 1961 he appeared on the stage in \"'Tis a Pity She's a Whore\", directed by Visconti, in Paris. In 1964 he formed his own production company, Delbeau Productions, and he produced a short film directed by Guy Gilles. In 1968 he found himself involved in murder, drug and sex scandal that indirectly implicated major politicians and show-business personalities, but he was eventually cleared of all charges. In the late 1960s he formed another company. Adel Film, and the next year he began producing features. In 1981 he directed his first film, Pour la peau d'un flic (1981). Delon was a sensation early in his career; he came to embody the young, energetic, often morally corrupted man. With his breathtaking good looks he was also destined to play tender lovers and romantic heroes, and he was a French embodiment of the type created in America by James Dean. His first outstanding success came with the role of the parasite Tom Ripley in 'Rene Clement''s sun-drenched thriller Purple Noon (1960). Delon presented a psychological portrait of a murderous young cynic who attempts to take on the identity of his victim. A totally different role was offered to him by Visconti in Rocco and His Brothers (1960). In this film Delon plays the devoted Rocco, who accepts the greatest sacrifices to save his shiftless brother Simon. After several other films in Italy, Delon returned to the criminal genre with Jean Gabin in Any Number Can Win (1963). This work, a classic example of the genre, was distinguished not only by a soundly worked-out screenplay, but also by the careful production and the excellent performances of both Delon and Gabin. It was only in the late 1960s that the sleek and lethal Delon came to epitomize the calm, psychopathic hoodlum, staring into the camera like a cat assessing a mouse. His tough, ruthless side was first used to real effect by Jean-Pierre Melville in Le Samouraï (1967). In 1970 he had a huge success in the bloodstained Borsalino (1970)--which he also produced--playing a small-time gangster in the 1930s who, with Jean-Paul Belmondo, becomes king of the Marseilles underworld. Delon later won critical acclaim for his roles, against type, in Joseph Losey's Mr. Klein (1976) in which he played (brilliantly) the icily sinister title role, and the art-movie Swann in Love (1984). He has an older son Anthony Delon (who has also acted in a number of movies) from his first marriage to Nathalie Delon, and has a young son and daughter, Alain-Fabien and Anouchka with Rosalie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MDI2MDY3OV5BMl5BanBnXkFtZTYwNDg5ODM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001128","name":"Alain Delon","idIMDB":"nm0001128"},"actorId":"nm0001128","character":"Récitant / Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benoîte Groult","urlProfile":"http://www.imdb.com/name/nm0343909","urlPhoto":"","biography":{"dateOfBirth":"31 January 1920","placeOfBirth":" Paris, France","bio":"Benoîte Groult was born on January 31, 1920 in Paris, France. She was a writer, known for Une chambre à elle (2005), L'occupation intime (2011) and Amour et sexe sous l'occupation (2011). She was married to Paul Guimard, Georges de Caunes, Pierre Heuyer and Blaise Landon. She died on June 20, 2016 in Hyères, Var, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0343909","name":"Benoîte Groult","idIMDB":"nm0343909"},"actorId":"nm0343909","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gisèle Guillemot","urlProfile":"http://www.imdb.com/name/nm5756371","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Gisèle Guillemot yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5756371","name":"Gisèle Guillemot","idIMDB":"nm5756371"},"actorId":"nm5756371","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philippe Pétain","urlProfile":"http://www.imdb.com/name/nm0702457","urlPhoto":"","biography":{"dateOfBirth":"24 April 1856","placeOfBirth":" Cauchy-à-la-Tour, Pas-de-Calais, France","birthName":"Henri-Philippe Pétain","height":"5' 6½\" (1.69 m)","bio":"Philippe Pétain was born on April 24, 1856 in Cauchy-à-la-Tour, Pas-de-Calais, France as Henri-Philippe Pétain. He was a writer, known for La nuit merveilleuse (1940). He was married to Eugénie Hardon and François de Hérain. He died on July 23, 1951 in Île d'Yeu, Vendée, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0702457","name":"Philippe Pétain","idIMDB":"nm0702457"},"actorId":"nm0702457","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fernandel","urlProfile":"http://www.imdb.com/name/nm0272794","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzQ2Nzk2OF5BMl5BanBnXkFtZTgwNjE3NTYwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1903","placeOfBirth":" Marseille, Bouches-du-Rhône, France","birthName":"Fernand Joseph Désiré Contandin","bio":"The apocryphal biography of Fernand Contadin tells the invention of his artistic name Fernandel by his sister-in-law (\"Voici le Fernand d'elles\"). At the beginning of the thirties he became a typical actor of the comedy genre: popular, common, likable and with a concealed grain of drama. Marc Allégret was the director of his first successful film La meilleure bobonne (1930). He tried to work as director twice during World War II but did not succeed in that.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzQ2Nzk2OF5BMl5BanBnXkFtZTgwNjE3NTYwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272794","name":"Fernandel","idIMDB":"nm0272794"},"actorId":"nm0272794","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Francine S.","urlProfile":"http://www.imdb.com/name/nm5756372","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Francine S. yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5756372","name":"Francine S.","idIMDB":"nm5756372"},"actorId":"nm5756372","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Môquet","urlProfile":"http://www.imdb.com/name/nm7781774","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Guy Môquet yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7781774","name":"Guy Môquet","idIMDB":"nm7781774"},"actorId":"nm7781774","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yvette Lebon","urlProfile":"http://www.imdb.com/name/nm0495816","urlPhoto":"","biography":{"dateOfBirth":"14 August 1910","placeOfBirth":" Paris, France","birthName":"Simone Lebon","bio":"Yvette Lebon was born on August 14, 1910 in Paris, France as Simone Lebon. She was an actress, known for Abus de confiance (1937), Zouzou (1934) and Les mariages de Mademoiselle Lévy (1936). She was married to Nat Wachsberger and Roger Duchesne. She died on July 28, 2014 in Cannes, Alpes-Maritimes, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0495816","name":"Yvette Lebon","idIMDB":"nm0495816"},"actorId":"nm0495816","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danielle Darrieux","urlProfile":"http://www.imdb.com/name/nm0201638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDMyMjAzNV5BMl5BanBnXkFtZTcwMzk4MTM5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1917","placeOfBirth":" Bordeaux, Gironde, France","birthName":"Danielle Yvonne Marie Antoinette Darrieux","bio":"Danielle Darrieux was born in 1917 in Bordeaux, France, but raised in Paris. She was only 14 when she auditioned for a secondary role in Le bal (1931): she got the part, and the producer offered her a five-year contract. She had her first romantic lead in La crise est finie (1934) and scored an international hit with the historical drama Mayerling (1936) in which she played Marie Vetsera opposite Charles Boyer. In 1938, she went to Hollywood to appear in the fine comedy The Rage of Paris (1938) but quickly returned to Paris. Darrieux remained in France during the Occupation and was one of the leading actresses during this period, starring in major hits such as Premier Rendez-Vous (1941). In 1945, she appeared both on stage (in \"Tristan et Isolde\") and on screen (in Au petit bonheur (1946)). In the next three decades, she found several important roles, in films like La Ronde (1950), The Earrings of Madame de... (1953) -- in which she gave her best performance, as a society lady torn between her husband and her lover -- and The Young Girls of Rochefort (1967). In 1970, she replaced Katharine Hepburn on Broadway in \"Coco.\" Afterwards, she made occasional screen and stage appearances. But she made a triumphant comeback in 2002, playing Catherine Deneuve's mother in the international hit 8 femmes (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDMyMjAzNV5BMl5BanBnXkFtZTcwMzk4MTM5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0201638","name":"Danielle Darrieux","idIMDB":"nm0201638"},"actorId":"nm0201638","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pierre Barillet","urlProfile":"http://www.imdb.com/name/nm0054667","urlPhoto":"","biography":{"dateOfBirth":"24 August 1923","placeOfBirth":" Paris, France","bio":"Pierre Barillet was born on August 24, 1923 in Paris, France. He is a writer and actor, known for Just Go with It (2011), Cactus Flower (1969) and Potiche (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0054667","name":"Pierre Barillet","idIMDB":"nm0054667"},"actorId":"nm0054667","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sacha Guitry","urlProfile":"http://www.imdb.com/name/nm0347589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzUzNzA2YjUtYTcxMS00Y2E2LTk4ODYtODdlYzEwNjNlNzA0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1885","placeOfBirth":" St. Petersburg, Russian Empire [now Russia]","birthName":"Alexandre Georges Pierre Guitry","bio":"French actor, dramatist and director, Sacha Guitry was born in 1885 in Saint-Petersburg where his father, actor Lucien Guitry, was under contract with the city's French theater. Early on, Sacha knew he was going to be an artist. Therefore, his studies were mediocre. His acting debuts were not too encouraging either. It is as playwright that Guitry obtained his first success in 1905 with two comedies, the one act play 'Le K.W.T.Z' and the full-length play 'Nono'. Guitry's career as dramatist was launched. In the following years, he became a particularly prolific and popular writer, mostly of spiritual, caustic comedies. In 1907, Guitry went back on stage to act in his own play 'Chez les Zoaques' and would perform in most of his subsequent plays. In 1916, he directed his first film, 'Ceux de chez nous', a patriotic documentary illustrating the works of some French artists like Auguste Renoir or Auguste Rodin. In 1917, he wrote and played in the movie 'Un Roman d'amour et d'aventures' under the direction of René Hervil and Louis Mercanton, an experience that left him unsatisfied. It is only in 1935 that he came back in the movie studio to direct and act in 'Pasteur', a biography of the famous scientific. The film, based on a play Guitry wrote in 1919, was a commercial failure, but during the shooting, Guitry fell in love with the process of filmmaking. From then on, he would continue to write and act in new stage plays, but making movie also became an important part of his life. He followed 'Pasteur' with 'Bonne chance', a comedy written directly for the screen. In 1936 alone, Guitry released no less than four movies, including the film versions of two of his best known plays: 'Faisons un rêve' (written in 1916), and 'Mon Père avait raison' (written in 1919). He also directed 'Le Roman d'un tricheur', this time from a short story he published in 1934. Despite lukewarm reviews, the movie was well received by the public and was also successful in the USA. It is now considered his most innovative film. In 1937, he wrote 'Les perles de la couronne', and co-directed it with Christian-Jacque. An ambitious and expensive historical fantasy featuring a prestigious casting, the film was both a critical and commercial success. Guitry continued in the same vein the following year with 'Remontons les Champs Élysées'. The Second World War didn't stop his activities. During the occupation, he notably directed and played in the historical film 'Le Destin fabuleux de Désiré Clary' (1942), the sentimental drama 'Donne-moi tes yeux' (1943) and the biography 'La Malibran' (1944). It is well established that during that period, Guitry had occasional contacts with members of the occupying forces, though he worked only with French independents producers, didn't allowed his plays to be performed in Germany, and had some problems with the German censorship. But he also managed to maintain a lavish lifestyle that was in sharp contrast with the life of deprivation that was the fate of most of his contemporaries. It is possibly for that reason that, in August 1944, after the liberation of Paris, Guitry was arrested at his home following an anonymous denunciation. He was set free after two months in jail but though no official accusations were laid against him, he was forbidden to appear on stage or on screen. Finally, in 1947, he was cleared of any wrong-doings and allowed to resume his work. But his reputation was tarnished and in the years to come, he would frequently face the hostility of a certain press. For his come-back, Guitry wanted to make a movie about historical figure Charles-Maurice de Talleyrand, but his screenplay was rejected by the authorities. So, Guitry adapted his scenario for the theatre and took the title role. Many commentators accused him to indulge in a self-justification attempt, but the play was a success and Guitry was finally able to turn it into the movie 'Le Diable boîteux' (1948). Guitry continued to be as prolific, writing new plays, reviving old successes, penning screenplays, directing movies. But the cheerfulness of the pre-war works was replaced by a more acerbic humor like in the film 'La Poison' (1951), a movie that attracted mostly negative reviews when it came out but is today considered one of his best films. There was a change of mood in 1953 with the release of 'Si Versailles m'était conté', another high budget historical fantasy that obtained a great success. At that time, Guitry's health was deteriorating, forcing him to give-up stage acting at the end of 1953. Despite his poor shape; Guitry, galvanized by the reception of 'Si Versailles m'était conté', wrote and directed two other historical dramas 'Napoléon' (1954) and 'Si Paris nous était conté' (1956). His general condition was so bad that, for that last film, he authorized the producer to use Henri-George Clouzot and Marcel Achard as back-ups, should he be in the impossibility to complete the film. Guitry finished his career with two comedies 'Assasins et voleurs' (1955), and 'Les Trois font la paire' (1957). He died during the summer of 1957. Guitry's movies are only part of his legacy. He also left us above 100 plays, countless 'bons mots' and the memory of a flamboyant, often controversial personality. His films were often held in low esteem by the critics. Some of those movies were shot really fast (11 days for 'La Poison', 8 days for 'Faisons un rêve' and 'Mon Père avait raison'). Whether they are based on a play or not, dialogues are always paramount in his films, and when he adapted his plays, he never tried to hide their theatrical origin. Oddly enough, the films that were highly praised when they came out are not the ones best regarded today.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzUzNzA2YjUtYTcxMS00Y2E2LTk4ODYtODdlYzEwNjNlNzA0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0347589","name":"Sacha Guitry","idIMDB":"nm0347589"},"actorId":"nm0347589","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maurice Chevalier","urlProfile":"http://www.imdb.com/name/nm0002001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTgwOTU0Ml5BMl5BanBnXkFtZTYwNzA3MzU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1888","placeOfBirth":" Paris, France","birthName":"Maurice Auguste Chevalier","height":"5' 10½\" (1.79 m)","bio":"Maurice Chevalier's first working job was as an acrobat, until a serious accident ended that career. He turned his talents to singing and acting, and made several short films in France. During World War I he enlisted in the French army. He was wounded in battle, captured and placed in a POW camp by the Germans. During his captivity he learned English from fellow prisoners. After the war he returned to the film business, and when \"talkies\" came into existence, Chevalier traveled to the US to break into Hollywood. In 1929 he was paired with operatic singer/actress Jeanette MacDonald to make The Love Parade (1929). Although Chevalier was attracted to the beautiful MacDonald and made several passes at her, she rejected him firmly, as she had designs on actor Gene Raymond, who she eventually married. He did not take rejection lightly, being a somewhat vain man who considered himself quite a catch, and derided MacDonald as a \"prude\". She, in turn, called him \"the quickest derrière pincher in Hollywood\". They made three more pictures together, the most successful being Love Me Tonight (1932). In the late 1930s he returned to Europe, making several films in France and England. World War II interrupted his career and he was dogged by accusations of collaboration with the Nazi authorities occupying France, but he was later vindicated. In the 1950s he returned to Hollywood, older and gray-headed. He made Gigi (1958), from which he took his signature songs, \"Thank Heaven for Little Girls\" and \"I Remember it Well\". He also received a special Oscar that year. In the 1960s he made a few more films, and in 1970 he sang the title song for Walt Disney's Les aristochats (1970). This marked his last contribution to the film industry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTgwOTU0Ml5BMl5BanBnXkFtZTYwNzA3MzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002001","name":"Maurice Chevalier","nicknames":["Mo"],"idIMDB":"nm0002001"},"actorId":"nm0002001","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georges Briquet","urlProfile":"http://www.imdb.com/name/nm0109760","urlPhoto":"","biography":{"bio":"Georges Briquet is an actor, known for The Wild Oat (1953), Bichon (1948) and Les cinq sous de Lavarède (1939).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0109760","name":"Georges Briquet","nicknames":["Papy"],"idIMDB":"nm0109760"},"actorId":"nm0109760","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gérard Lenorman","urlProfile":"http://www.imdb.com/name/nm0502168","urlPhoto":"","biography":{"dateOfBirth":"9 February 1945","placeOfBirth":" Bénouville, Calvados, France","bio":"Gérard Lenorman was born on February 9, 1945 in Bénouville, Calvados, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0502168","name":"Gérard Lenorman","idIMDB":"nm0502168"},"actorId":"nm0502168","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1957943","urlIMDB":"http://www.imdb.com/title/tt1957943","business":{"budget":{"money":"€500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© CC&amp;C Clarke Costelle &amp; Cie - 2011"},"technical":{"runtime":["1 hr 21 min (81 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.6","filmingLocations":[],"rated":"12","awards":[],"votes":"26","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0316721","name":"CC&C"},{"idCompany":"co0028766","name":"TF1"}],"keywords":{"keywords":["f rated","german occupation","sexual freedom","collaboration","resistance","world war two"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 21:40:48"}}