{"data":{"movies":[{"title":"Have a Little Faith","originalTitle":"","year":"2011","releaseDate":"20111127","directors":[{"name":"Jon Avnet","id":"nm0000816"}],"writers":[{"name":"Mitch Albom","id":"nm0016880"}],"runtime":"82 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Njk2OTIxNV5BMl5BanBnXkFtZTgwMTUyNjAzMTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Writer Mitch Alboms reluctantly agrees to pen the eulogy of his childhood rabbi.","simplePlot":"Writer Mitch Alboms reluctantly agrees to pen the eulogy of his childhood rabbi.","actors":[{"actorName":"Laurence Fishburne","urlProfile":"http://www.imdb.com/name/nm0000401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjczNDc1MV5BMl5BanBnXkFtZTYwMDU0Mjg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1961","placeOfBirth":" Augusta, Georgia, USA","birthName":"Laurence John Fishburne III","height":"6' 0½\" (1.84 m)","bio":"One of Hollywood's most talented and versatile performers and the recipient of a truckload of NAACP Image awards, Laurence John Fishburne III was born in Augusta, Georgia on July 30, 1961, to Hattie Bell (Crawford), a teacher, and Laurence John Fishburne, Jr., a juvenile corrections officer. His mother transplanted her family to Brooklyn after his parents divorced. At the age of 10, he appeared in his first play, \"In My Many Names and Days,\" at a cramped little theater space in Manhattan. He continued on but managed to avoid the trappings of a child star per se, considering himself more a working child actor at the time. Billing himself as Larry Fishburne during this early phase, he never studied or was trained in the technique of acting. In 1973, at the age of 12, Laurence won a recurring role on the daytime soap One Life to Live (1968) that lasted three seasons and subsequently made his film debut in the ghetto-themed Cornbread, Earl and Me (1975). At 14 Francis Ford Coppola cast him in Apocalypse Now (1979), which filmed for two years in the Phillippines. Laurence didn't work for another year and a half after that long episode. A graduate of Lincoln Square Academy, Coppola was impressed enough with Laurence to hire him again down the line with featured roles in Rumble Fish (1983), The Cotton Club (1984), and Gardens of Stone (1987). Throughout the 1980s, he continued to build up his film and TV credit list with featured roles despite little fanfare. A recurring role as Cowboy Curtis on the kiddie show Pee-wee's Playhouse (1986) helped him through whatever lean patches there were at the time. With the new decade (1990s) came out-and-out stardom for Laurence. A choice lead in John Singleton's urban tale Boyz n the Hood (1991) catapulted him immediately into the front of the film ranks. Set in LA's turbulent South Central area, his potent role as a morally minded divorced father who strives to rise above the ignorance and violence of his surroundings, Laurence showed true command and the ability to hold up any film. On stage, he would become invariably linked to playwright August Wilson and his 20th Century epic African-American experience after starring for two years as the eruptive ex-con in \"Two Training Running.\" For this powerful, mesmerizing performance, Laurence won nearly every prestigious theater award in the books (Tony, Outer Critics Circle, Drama Desk and Theatre World). It was around the time of this career hallmark that he began billing himself as \"Laurence\" instead of \"Larry.\" More awards and accolades came his way. In addition to an Emmy for the pilot episode of the series \"Tribeca,\" he was nominated for his fine work in the quality mini-movies The Tuskegee Airmen (1995) and Miss Evers' Boys (1997). On the larger screen, both Laurence and Angela Bassett were given Oscar nominations for their raw, seething portrayals of rock stars Ike and Tina Turner in the film What's Love Got to Do with It (1993). To his credit, he managed to take an extremely repellent character and make it a sobering and captivating experience. A pulp box-office favorite as well, he originated the role of Morpheus, Keanu Reeves' mentor, in the exceedingly popular futuristic sci-fi The Matrix (1999), best known for its ground-breaking special effects. He wisely returned for its back-to-back sequels. Into the millennium, Laurence extended his talents by making his screenwriting and directorial debut in Once in the Life (2000), in which he also starred. The film is based on his own critically acclaimed play \"Riff Raff,\" which he staged five years earlier. In 1999, he scored a major theater triumph with a multi-racial version of \"The Lion in Winter\" as Henry II opposite Stockard Channing's Eleanor of Acquitaine. On film, Fishburne has appeared in a variety of interesting roles in not-always-successful films. Never less than compelling, a few of his more notable parts include an urban speed chess player in Searching for Bobby Fischer (1993); a military prisoner in Cadence (1990); a college professor in Singleton's Higher Learning (1995); a CIA operative in Bad Company (1995); the title role in Othello (1995) (he was the first black actor to play the part on film); a spaceship rescue team leader in the sci-fi horror Event Horizon (1997); a Depression-era gangster in Hoodlum (1997); a dogged police sergeant in Clint Eastwood's Mystic River (2003); a spelling bee coach in Akeelah and the Bee (2006); and prominent roles in the mainstream films Predators (2010) and Contagion (2011). He returned occasionally to the theatre. In April 2008, he played Thurgood Marshall in the one-man show \"Thurgood\" and won a Drama Desk Award. It was later transferred to the screen. In the fall of 2008, Fishburne replaced William Petersen as the male lead investigator on the popular CBS drama CSI: Crime Scene Investigation (2000), but left the show in 2011 to refocus on films and was in turn replaced by Ted Danson. Since then Fishburne has appeared in the Superman film Man of Steel (2013) as Daily Planet chief Perry White. Fishburne has two children, Langston and Montana, from his first marriage to actress Hajna O. Moss. In September 2002, Fishburne married Cuban-American actress Gina Torres.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjczNDc1MV5BMl5BanBnXkFtZTYwMDU0Mjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000401","name":"Laurence Fishburne","nicknames":["Fish","Larry"],"idIMDB":"nm0000401"},"actorId":"nm0000401","character":"Henry Covington","urlCharacter":"http://www.imdb.com/character/ch0415906","main":true},{"actorName":"Bradley Whitford","urlProfile":"http://www.imdb.com/name/nm0925966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NTIzNjc3Ml5BMl5BanBnXkFtZTYwNjgxNTA2._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1959","placeOfBirth":" Madison, Wisconsin, USA","height":"5' 11\" (1.8 m)","bio":"Bradley Whitford's credits in film, television and theater include work with some of the most noted writers, directors and playwrights in the arts, and constitute a career worthy of a Juilliard-trained actor -- which he is. But stardom is something else altogether, and it remained elusive, at least until 1999 and his appearance on NBC's acclaimed political drama, The West Wing (1999). Bradley Whitford was born in Madison, Wisconsin, to Genevieve Smith Whitford, a poet and writer, and George Van Norman Whitford. He studied theater and English literature at Wesleyan University and earned a master's degree in theater from the prestigious Juilliard Theater Center. Whitford's first professional performance was in the off-Broadway production of \"Curse of the Starving Class,\" with Kathy Bates. He also starred in the Broadway production of \"The West Wing\" creator Aaron Sorkin's \"A Few Good Men.\" His additional theater credits include \"Three Days of Rain\" at the Manhattan Theatre Club, \"Measure for Measure\" at the Lincoln Center, and the title role in \"Coriolanus\" at the Folger Shakespeare Theatre in Washington, D.C. Some of Whitford's most memorable performances include roles in such films as The Muse (1999) with Albert Brooks and Bicentennial Man (1999) with Robin Williams. He has also appeared in Scent of a Woman (1992), A Perfect World (1993), Philadelphia (1993), The Client (1994), My Life (1993), Red Corner (1997), Presumed Innocent (1990), and My Fellow Americans (1996). He also had a prominent supporting part in the horror thriller Get Out (2017), as a suspicious suburban father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NTIzNjc3Ml5BMl5BanBnXkFtZTYwNjgxNTA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925966","name":"Bradley Whitford","nicknames":["Brad"],"idIMDB":"nm0925966"},"actorId":"nm0925966","character":"Mitch","urlCharacter":"http://www.imdb.com/character/ch0262278","main":true},{"actorName":"Anika Noni Rose","urlProfile":"http://www.imdb.com/name/nm0741242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ4MzQyODI4Nl5BMl5BanBnXkFtZTgwMDk0ODgyMTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1972","placeOfBirth":" Bloomfield, Connecticut, USA","height":"5' 2\" (1.57 m)","bio":"Anika Noni Rose followed her work in the feature film \"Dreamgirls\" with a role in the comedy feature \"Just Add Water,\" in which she co-stars with Danny DeVito, Dylan Walsh, Jonah Hill and Justin Long, under the direction of Hart Bochner. In 2004, Rose was honored with a Tony Award for Best Performance by a Featured Actress in a Musical for her role in the widely acclaimed Broadway show \"Caroline, or Change.\" In addition, Rose won a Lucille Lortell Award, a Theatre World Award, and a Clarence Derwent Award, and was nominated for a Drama Desk Award for her work in the musical. Rose also reprised her role in the San Francisco and Los Angeles productions of \"Caroline, or Change.\" For her performance in the latter, she won the Los Angeles Critic's Circle Award and an Ovation Award. Classically trained in drama at San Francisco's American Conservatory Theater, Rose moved to New York City to pursue her career, with great hopes of appearing on Broadway. Her goal was first realized when she replaced another actor for the last few months of the Broadway run of \"Footloose.\" Her impressive theatre repertoire also includes \"Eli's Comin',\" for which she received an Obie Award; the role of Lutiebelle in the Encores! Production of \"Purlie\"; and \"Threepenny Opera\" and \"Tartuffe\" at A.C.T's Geary Theater. In addition, Rose received a Drama-Logue Ensemble Award for her role in \"Insurrection: Holding History,\" and won a Garland/Drama-Logue Award for \"Valley Song\" at the Berkeley Repertory Theatre. In the midst of all of this, Rose was a featured vocalist at the Vatican in Leonard Bernstein's \"Mass.\" It was during this time that she also work shopped Tony Kushner and Jeanine Tesori's \"Caroline, or Change,\" directed by the legendary George C. Wolfe. In 2003, the musical opened at New York's Public Theater, with Rose creating the role of Emmie Thibodeaux. In May 2004, \"Caroline, or Change\" moved to Broadway, taking Rose with it. In addition to her stage work, Rose has appeared on television in guest roles on such series as \"Third Watch\" and \"Hack.\" She also had a lead role in the film \"From Justin to Kelly.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ4MzQyODI4Nl5BMl5BanBnXkFtZTgwMDk0ODgyMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0741242","name":"Anika Noni Rose","idIMDB":"nm0741242"},"actorId":"nm0741242","character":"Annette","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mykelti Williamson","urlProfile":"http://www.imdb.com/name/nm0932112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MDY1NzU4Ml5BMl5BanBnXkFtZTcwMzYyNDUyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1957","placeOfBirth":" Saint Louis, Missouri, USA","birthName":"Michael T. Williamson","height":"6' 2\" (1.88 m)","bio":"Perhaps best remembered for his touching performance as \"Bubba\" opposite Tom Hanks in the Academy Award-winning Forrest Gump (1994), Mykelti Williamson is one of the most sought-after actors in Hollywood, who has been steadily honing his craft since he first began acting professionally at the age of 18. This past fall Williamson starred as Lt. Philip Gerard, the hardnosed detective determined to recapture escaped convict Dr. Richard Kimble (Tim Daly) in CBS' update of the classic 1960's action series The Fugitive (2000). The son of an Air Force Staff Sergeant (father) and certified public accountant (mother), Williamson was born in St. Louis, MO, and began performing on the stage at the age of 9. Like many youngsters, he was enamored with the concept of television, and thought that the images he was seeing on the small screen were reality. It wasn't until his mother put him in a church play that he realized that what the people on the small screen were doing was performing. He was instantly hooked. At the age of 15, Williamson and his family settled in Los Angeles. A superb athlete, he excelled at both football and basketball, but the acting bug led him to quit sports and dance with the cheerleading squad, much to the chagrin of his coaches. Following graduation, Williamson began acting professionally, making appearances on television shows such as Starsky and Hutch (1975), Hill Street Blues (1981) and China Beach (1988), among others. He made his film debut in the Walter Hill-directed feature Streets of Fire (1984), opposite Diane Lane, Michael Paré and Willem Dafoe. He would subsequently appear in the feature The First Power (1990) with Lou Diamond Phillips, Miracle Mile (1988) with Anthony Edwards and Mare Winningham, Number One with a Bullet (1987), Wildcats (1986) and Free Willy (1993). Following his critically acclaimed performance in Forrest Gump (1994), Williamson starred in Forest Whitaker's Waiting to Exhale (1995); partnered with Al Pacino in Michael Mann's Heat (1995); Sauvez Willy 2 (1995), and starred alongside Nicolas Cage in Con Air (1997). Williamson was also seen in Mike Nichols' political drama Primary Colors (1998) (a cameo appearance which he did as a personal favor to Nichols and John Travolta) and Three Kings (1999), opposite George Clooney, Mark Wahlberg and Ice Cube. In 1996 Williamson returned to television when he starred opposite Delroy Lindo and Blair Underwood in the critically acclaimed HBO telefilm Soul of the Game (1996) and received rave reviews for his stirring portrayal of legendary Negro League baseball legend Josh Gibson. Williamson also starred in Buffalo Soldiers (1997) for TNT and 12 Angry Men (1997) for Showtime, as well as starring in the cable network's series The Hoop Life (1999). On stage Williamson starred with Samuel L. Jackson, D.B. Sweeney, Ellis Williams, Matt McGrath and Richard Reilly in Clark Gregg's (\"What Lies Beneath\") 1995's ensemble drama \"Distant Fires\", which earned the cast a prestigious L.A. Theatre Award. An avid sports fan and devoted family man, Williamson enjoys restoring classic cars and rodeoing in his free time. He currently lives in Los Angeles with his wife and two of his three daughters. Named by his grandfather for 'Spirit' or 'Silent Friend' in the language of Blackfeet Indians, Mykelti Williamson has quietly built a reputation in Hollywood as one of the most consistently proven actors in the business, delivering stirring and honest performances that always capture audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MDY1NzU4Ml5BMl5BanBnXkFtZTcwMzYyNDUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932112","name":"Mykelti Williamson","idIMDB":"nm0932112"},"actorId":"nm0932112","character":"Donnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deanna Dunagan","urlProfile":"http://www.imdb.com/name/nm0241759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MDM2MDc0NTFeQTJeQWpwZ15BbWU4MDI1OTQxMjcx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1940","placeOfBirth":" Monahans, Texas, USA","bio":"Deanna Dunagan is a Tony Award-winning actress who has had a prolific career acting on the Chicago stage. Originally from Monahans, Texas, Dunagan made her Broadway debut in the 1979 production of George Bernard Shaw's \"Man and Superman\" at Circle in the Square. In 1981, she performed in the first national tour of \"Children of a Lesser God\", during which time she visited Chicago for the first time. Having fallen in love with that city, Dunagan moved to Chicago after the tour ended and has lived there ever since. Over the last three decades, she has performed in more than 30 theaters in the Chicago area, garnering three Joseph Jefferson Awards and three \"After Dark\" Awards. In 2007, Dunagan returned to Broadway in the Steppenwolf Theatre's transplant production of Tracy Letts' \"August: Osage County\". For her performance, Dunagan won a Tony Award, Theatre World Award and a Drama Desk Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MDM2MDc0NTFeQTJeQWpwZ15BbWU4MDI1OTQxMjcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0241759","name":"Deanna Dunagan","idIMDB":"nm0241759"},"actorId":"nm0241759","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melinda McGraw","urlProfile":"http://www.imdb.com/name/nm0569927","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjk5OTcxOV5BMl5BanBnXkFtZTcwMjgyMjQ3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1963","placeOfBirth":" Nicosia, Cyprus","birthName":"Melinda Leigh McGraw","height":"5' 7\" (1.7 m)","bio":"Melinda McGraw is known for her range, playing a wide variety of roles in comedy and drama alike. She is perhaps best known for her critically acclaimed turn as Bobbie Barrett in Season 2 of \"Mad Men\" which earned her a Screen Actors' Guild Award as part of the Best Ensemble Cast, as well as an OFTA Television Award for Best Guest Actress in a Drama Series (2007). She is also known for her work as Barbara Gordon in \"The Dark Knight,\" as Scott Bakula's love interest in AMC's \"Men of a Certain Age,\" as Diane Gibbs-Fornell-Sterling in \"NCIS\" and as Dana's sister Melissa Scully in the \"X-Files.\" Ms. McGraw is a classically trained, journeyman actor. She grew up in the Boston area and was a member of the Boston Children's Theater. She attended Bennington College briefly until she was accepted at the Royal Academy of Dramatic Arts in London. Her school mates included Clive Owen, Ralph Fiennes, Iain Glen, Mark Addy, Alex Kingston and David Morrisey. After appearing in many theatrical productions in London's West End and around the UK (including \"Twelfth Night\", \"Don Carlos\", \"The Foreigner\") she returned to the States in 1990. She is shooting \"Outcast\" for Cinemax, which will be released in 2016. Ms. McGraw is married to composer/recording artist Steve Pierson and they have a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjk5OTcxOV5BMl5BanBnXkFtZTcwMjgyMjQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569927","name":"Melinda McGraw","idIMDB":"nm0569927"},"actorId":"nm0569927","character":"Janine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Landau","urlProfile":"http://www.imdb.com/name/nm0001445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzkxNzg0OF5BMl5BanBnXkFtZTcwNDUzOTc5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1928","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Oscar-winning character actor Martin Landau was born on June 20, 1928 in Brooklyn, New York. At age 17, he was hired by the New York Daily News as a staff cartoonist and illustrator. In his five years on the paper, he served as the illustrator for Billy Rose's \"Pitching Horseshoes\" column. He also worked for cartoonist Gus Edson on \"The Gumps\" comic strip. Landau's major ambition was to act, and in 1951, he made his stage debut in \"Detective Story\" at the Peaks Island Playhouse in Peaks Island, Maine. He made his off-Broadway debut that year in \"First Love\". Landau was one of 2000 applicants who auditioned for Lee Strasberg's Actors Studio in 1955 - only he and Steve McQueen were accepted. Landau was a friend of James Dean and McQueen, in a conversation with Landau, mentioned that he knew Dean and had met Landau. When Landau asked where they had met, McQueen informed him he had seen Landau riding into the New York City garage where he worked as a mechanic on the back of Dean's motorcycle. He acted during the mid-1950s in the television anthologies Playhouse 90 (1956), Studio One in Hollywood (1948), The Philco-Goodyear Television Playhouse (1948), Kraft Theatre (1947), Goodyear Playhouse (1951) and Omnibus (1952). He began making a name for himself after replacing star Franchot Tone in the 1956 off-Broadway revival of Anton Chekhov's \"Uncle Vanya\", a famous production that helped put off-Broadway on the New York theatrical map. In 1957, he made a well-received Broadway debut in the play \"Middle of the Night\". As part of the touring company with star Edward G. Robinson, he made it to the West Coast. He made his movie debut in Pork Chop Hill (1959) but scored on film as the heavy in Alfred Hitchcock's classic thriller North by Northwest (1959), in which he was shot on top of Mount Rushmore while sadistically stepping on the fingers of Cary Grant, who was holding on for dear life to the cliff face. He also appeared in the blockbuster Cleopatra (1963), the most expensive film ever made up to that time, which nearly scuttled 20th Century-Fox and engendered one of the great public scandals, the Elizabeth Taylor-Richard Burton love affair that overshadowed the film itself. Despite the difficulties with the film, Landau's memorable portrayal in the key role of Rufio was highly favored by the audience and instantly catapulted his popularity. In 1963, Landau played memorable roles on two episodes of the science-fiction anthology series The Outer Limits (1963), \"The Bellero Shield\" and \"The Man Who Was Never Born\". He was Gene Roddenberry's first choice to play Mr. Spock on Star Trek (1966), but the role went to Leonard Nimoy, who later replaced Landau on Mission: Impossible (1966), the show that really made Landau famous. He originally was not meant to be a regular on the series, which co-starred his wife Barbara Bain, whom he had married in 1957. His character, Rollin Hand, was supposed to make occasional, though recurring appearances, on Mission: Impossible (1966), but when the producers had problems with star Steven Hill, Landau was used to take up the slack. Landau's characterisation was so well-received and so popular with the audience that he was made a regular. Landau received Emmy nominations as Outstanding Lead Actor in a Drama Series for each of the three seasons he appeared. In 1968, he won the Golden Globe award as Best Male TV Star. Eventually, he quit the series in 1969 after a salary dispute when the new star, Peter Graves, was given a contract that paid him more than Landau, whose own contract stated he would have parity with any other actor on the show who made more than he did. The producers refused to budge and he and Bain, who had become the first actress in the history of television to be awarded three consecutive Emmy Awards (1967-69) while on the show, left the series, ostensibly to pursue careers in the movies. The move actually held back their careers, and Mission: Impossible (1966) went on for another four years with other actors. Landau appeared in support of Sidney Poitier in They Call Me Mister Tibbs! (1970), the less successful sequel to the Oscar-winning In the Heat of the Night (1967), but it did not generate more work of a similar caliber. He starred in the television movie Welcome Home, Johnny Bristol (1972) on CBS, playing a prisoner of war returning to the United States from Vietnam. The following year, he shot a pilot for NBC for a proposed show, \"Savage\". Though it was directed by emerging wunderkind Steven Spielberg, NBC did not pick up the show. Needing work, Landau and Bain moved to England to play the leading roles in the syndicated science-fiction series Space: 1999 (1975). Landau's and Bain's careers stalled after Space: 1999 (1975) went out of production, and they were reduced to taking parts in the television movie The Harlem Globetrotters on Gilligan's Island (1981). It was the nadir of both their careers, and Bain's acting days, and their marriage, soon were over. Landau, one of the most talented character actors in Hollywood, and one not without recognition, had bottomed out career-wise. In 1983, he was stuck in low-budget sci-fi and horror movies like The Being (1983), a role far beneath his talent. His career renaissance got off to a slow start with a recurring role in the NBC sitcom Buffalo Bill (1983), starring Dabney Coleman. On Broadway, he took over the title role in the revival of \"Dracula\" and went on the road with the national touring company. Finally, his career renaissance began to gather momentum when Francis Ford Coppola cast him in a critical supporting role in his Tucker: The Man and His Dream (1988), for which Landau was nominated for an Academy Award as Best Supporting Actor. He won his second Golden Globe for the role. The next year, he received his second consecutive Best Supporting Actor Oscar nomination for his superb turn as the adulterous husband in Woody Allen's Crimes and Misdemeanors (1989). He followed this up by playing famed Nazi hunter Simon Wiesenthal in the TNT movie Max and Helen (1990). However, the summit of his post-\"Mission: Impossible\" carer was about to be scaled. He portrayed Bela Lugosi in Tim Burton's biopic Ed Wood (1994) and won glowing reviews. For his performance, he won the Best Supporting Actor Oscar. Martin Landau, the superb character actor, finally had been recognized with his profession's ultimate award. His performance, which also won him his third Golden Globe, garnered numerous awards in addition to the Oscar and Golden Globe, including top honors from the New York Film Critics Circle and the National Society of Film Critics. Landau continued to play a wide variety of roles in motion pictures and on television, turning in a superb performance in a supporting role in The Majestic (2001). He received his fourth Emmy nomination in 2004 as Outstanding Guest Actor in a Drama Series for Without a Trace (2002). Martin Landau was honored with his own star on the Hollywood Walk of Fame, located at 6801 Hollywood Boulevard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzkxNzg0OF5BMl5BanBnXkFtZTcwNDUzOTc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001445","name":"Martin Landau","nicknames":["Marty"],"idIMDB":"nm0001445"},"actorId":"nm0001445","character":"Rabbi Albert Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Castelow","urlProfile":"http://www.imdb.com/name/nm4515870","urlPhoto":"","biography":{"bio":"Anthony Castelow is an actor, known for Have a Little Faith (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4515870","name":"Anthony Castelow","idIMDB":"nm4515870"},"actorId":"nm4515870","character":"Cass","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryce Clyde Jenkins","urlProfile":"http://www.imdb.com/name/nm3257311","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjIwMTQ5MV5BMl5BanBnXkFtZTcwMzczNDY4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Bryce Clyde Jenkins moved from New Orleans to Los Angeles with his family in 2003 when he was just three years old so Bryce's father could pursue his acting career. At that time, it was unforeseen that Bryce would soon be following in his father's footsteps. In 2008, Bryce landed a lead in the short film, \"My Homework Ate My Dog,\" and since that time, has landed roles in feature films such as \"Easy A\" and \"The To-Do-List.\" Bryce has also appeared on various TV shows such as \"CSI Miami,\" \"Outlaw,\" \"The Mentalist,\" and Hallmark TV movies, \"Have A Little Faith\" and \"The Watsons Go To Birmingham.\" In \"The Watsons Go To Birmingham,\" Bryce plays 11 year old Kenny Watson, from whose perspective the story of the historically factual 1963 Birmingham church bombings is told. Under further guidance from Director Leon, Bryce's greatest accomplishment thus far has been his recent role as Travis Younger in Broadway's A Raisin in the Sun, where Bryce at 13 years old made his Broadway debut performing opposite such greats as Denzel Washington, LaTanya Richardson Jackson and Sophie Okonedo. When he ran for Student Council President of his elementary school, he won hands down. To top off his last year in elementary school, Bryce earned the President's Gold Award for Educational Excellence, receiving the Outstanding Academic Excellence Award. Bryce loves basketball, swimming and playing video games with his friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjIwMTQ5MV5BMl5BanBnXkFtZTcwMzczNDY4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3257311","name":"Bryce Clyde Jenkins","idIMDB":"nm3257311"},"actorId":"nm3257311","character":"Young Henry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Langston Fishburne","urlProfile":"http://www.imdb.com/name/nm2076356","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTc2ZGU3MWYtNWFiMi00MzhmLTkwYjAtYzI4MTFmMmRlZTlmXkEyXkFqcGdeQXVyNjM1MzkzMDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Langston Fishburne is an actor, known for Have a Little Faith (2011), R-Naught 15 (2017) and The Dunning Man.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTc2ZGU3MWYtNWFiMi00MzhmLTkwYjAtYzI4MTFmMmRlZTlmXkEyXkFqcGdeQXVyNjM1MzkzMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2076356","name":"Langston Fishburne","idIMDB":"nm2076356"},"actorId":"nm2076356","character":"Henry at 20","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wayne David Parker","urlProfile":"http://www.imdb.com/name/nm0202795","urlPhoto":"","biography":{"bio":"Wayne David Parker is known for his work on Stone (2010), Escanaba in da Moonlight (2001) and Have a Little Faith (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0202795","name":"Wayne David Parker","idIMDB":"nm0202795"},"actorId":"nm0202795","character":"Gene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Adams","urlProfile":"http://www.imdb.com/name/nm4515917","urlPhoto":"","biography":{"bio":"Jonathan Adams is an actor, known for Have a Little Faith (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4515917","name":"Jonathan Adams","idIMDB":"nm4515917"},"actorId":"nm4515917","character":"Willie Covington","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"April Parker-Jones","urlProfile":"http://www.imdb.com/name/nm1087565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzEyMjM1Ml5BMl5BanBnXkFtZTcwNzMwMDQxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"April Parker-Jones is an actress, known for Spider-Man 3 (2007), If Loving You Is Wrong (2014) and Jericho (2006). She has been married to Joseph J. Jones since June 30, 2007. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzEyMjM1Ml5BMl5BanBnXkFtZTcwNzMwMDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1087565","name":"April Parker-Jones","idIMDB":"nm1087565"},"actorId":"nm1087565","character":"Wilma Covington","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry VanBuren Jr.","urlProfile":"http://www.imdb.com/name/nm3344944","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0NTIzMTcwNl5BMl5BanBnXkFtZTgwOTk3MTE0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8½\" (1.74 m)","bio":"Larry VanBuren Jr. is an actor, known for Have a Little Faith (2011), Super Athlete (2013) and Black Gloves (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0NTIzMTcwNl5BMl5BanBnXkFtZTgwOTk3MTE0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3344944","name":"Larry VanBuren Jr.","idIMDB":"nm3344944"},"actorId":"nm3344944","character":"Derrick Covington","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Hardy","urlProfile":"http://www.imdb.com/name/nm5473131","urlPhoto":"","biography":{"bio":"John Hardy is an actor, known for Have a Little Faith (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5473131","name":"John Hardy","idIMDB":"nm5473131"},"actorId":"nm5473131","character":"Baptist Preacher","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1942922","urlIMDB":"http://www.imdb.com/title/tt1942922","business":{"budget":{"money":"$11,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"07","year":"2011","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 22 min (82 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.8","filmingLocations":[{"location":"Detroit, Michigan, USA"}],"awards":[{"award":"Humanitas Prize 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Humanitas Prize","categories":[{"category":"90 Minute Category","names":[{"name":"Mitch Albom","id":"nm0016880","role":"writer"}]}]}]},{"award":"Image Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Television Movie, Mini-Series or Dramatic Special","names":[{"name":"American Broadcasting Company (ABC)","id":null,"role":null}]},{"category":"Outstanding Actress in a Television Movie, Mini-Series or Dramatic Special","names":[{"name":"Anika Noni Rose","id":"nm0741242","role":null},{"name":"American Broadcasting Company (ABC)","id":null,"role":null}]}]}]},{"award":"MovieGuide Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Grace Award","categories":[{"category":"Most Inspirational Television Acting","names":[{"name":"Laurence Fishburne","id":"nm0000401","role":null}]},{"category":"Most Inspiring TV Program","names":[]}]}]}],"votes":"356","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0078555","name":"Hallmark Hall of Fame Productions"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:05:18"}}