{"data":{"movies":[{"title":"Battlefield America","originalTitle":"","year":"2012","releaseDate":"20120621","directors":[{"name":"Chris Stokes","id":"nm0831321"}],"writers":[{"name":"Marques Houston","id":"nm0396867"},{"name":"Chris Stokes","id":"nm0831321"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxOTUwNTc0Nl5BMl5BanBnXkFtZTcwODM5MjI3Nw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Musical"],"plot":"A young businessman who lands a community service sentence falls in with a group of misfit kids who need mentoring. With the help of a pro instructor, he works to get the kids ready for a big underground dance competition.","simplePlot":"A young businessman who lands a community service sentence falls in with a group of misfit kids who need mentoring. With the help of a pro instructor, he works to get the kids ready for a big underground dance competition.","actors":[{"actorName":"Marques Houston","urlProfile":"http://www.imdb.com/name/nm0396867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0Nzk4NjcwMF5BMl5BanBnXkFtZTYwMjIwMjQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1981","placeOfBirth":" Los Angeles, California, USA","birthName":"Marques Barrett Houston","height":"5' 10\" (1.78 m)","bio":"Marques Houston was born on August 4, 1981 in Los Angeles, California, USA as Marques Barrett Houston. He is an actor, known for Sister, Sister (1994), You Got Served (2004) and Fat Albert (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0Nzk4NjcwMF5BMl5BanBnXkFtZTYwMjIwMjQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0396867","name":"Marques Houston","nicknames":["Batman","MH"],"idIMDB":"nm0396867"},"actorId":"nm0396867","character":"Sean Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mekia Cox","urlProfile":"http://www.imdb.com/name/nm2065368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI5MDQxNjM0NF5BMl5BanBnXkFtZTcwODEzNDMyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Mekia Cox was born on November 18, 1981 in Saint Croix, U.S. Virgin Island, but moved to Orlando, Florida at age 7. As a child, she had roles in various Nickelodeon shows such as \"Kenan & Kel\" (1996)_. She is a graduate of Dr. Phillips High School and earned a Bachelor of Music degree from Florida State University. She is known for her work in Crazy, Stupid, Love. (2011), Battlefield America (2012), and I Kissed a Vampire (2010). She is also known for recurring roles on 90210 (2008) as Sasha, Secrets and Lies (2015) as Amanda Warner and Chicago Med (2015) as Robyn Charles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI5MDQxNjM0NF5BMl5BanBnXkFtZTcwODEzNDMyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2065368","name":"Mekia Cox","idIMDB":"nm2065368"},"actorId":"nm2065368","character":"Sarah Miller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lynn Whitfield","urlProfile":"http://www.imdb.com/name/nm0005551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MTU0NTg0Ml5BMl5BanBnXkFtZTcwOTYxMTQ5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1953","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Lynn Butler-Smith","height":"5' 5\" (1.65 m)","bio":"With roots that lead back to Louisiana southern aristocracy, lovely leading lady Lynn Whitfield was born in 1953, the eldest of four children and a third-generation BFA graduate from Howard University. Her dentist father was instrumental in developing Lynn's initial interest in acting as he was a prime figure in forming community theater in her native Baton Rouge. She is of African American and Native American descent, specifically Cherokee. First garnering attention on the stage by studying and performing with the Black Repertory Company in Washington, D.C, she married one of the company's co-founders and pioneers of black theatre, playwright/director/actor Vantile Whitfield in 1974. She eventually moved to New York and appeared off-Broadway in such shows as \"The Great Macdaddy\" and \"Showdown\" before earning acclaim in the 1977 Los Angeles production of the landmark black play \"For Colored Girls Who Have Considered Suicide...When the Rainbow Is Enuf\" co-starring Alfre Woodard. Lynn eventually became a force to be reckoned with intelligent and principled roles on quality film and TV as well Lynn's Hollywood career unfolded under a talent development program at Columbia Pictures in 1979. Appearing on such established TV shows as \"Hill Street Blues\" and in a 1982 PBS version of her \"For Colored Girls...\" stage hit, she made her film debut with Doctor Detroit (1983) and doled out a number of support roles in other popular films as well such as Silverado (1985), The Slugger's Wife (1985), Jaws: The Revenge (1987), and Dead Aim (1987). It was TV, however, that garnered her the most attention, working her way into top lead and co-star roles. The topical social dramas The George McKenna Story (1986) co-starring Denzel Washington, Johnnie Mae Gibson: FBI (1986) opposite Howard E. Rollins Jr. and Oprah Winfrey's historical miniseries The Women of Brewster Place (1989) were her early highlights. In addition, she found some steadier work on series TV playing classy professionals, including two for ABC (a doctor in Heartbeat (1988) and a news anchorwoman in Equal Justice (1990).) The peak of her acclaimed career arguably came in the form of highly popular but deeply troubled Follies Bergere headliner-turned civil rights activist Josephine Baker. In the HBO biopic The Josephine Baker Story (1991), Lynn played the legendary entertainer with Emmy-winning gusto, a role that stretched her to the limits as she played the role from age 18 to 68. Earning an NAACP Image Award in 1992 for her role in the miniseries Stompin' at the Savoy (1992), she later appeared in Pauly Shore's comedy In the Army Now (1994) and went back to series TV alongside Bill Cosby in the short-lived The Cosby Mysteries (1994). Lynn had an upsurge in the late 90s with roles in the films A Thin Line Between Love and Hate (1996) with Martin Lawrence and Gone Fishin' (1997) with \"Silverado\" co-star Danny Glover. She also earned excellent reviews for her supporting work in Eve's Bayou (1997), a role that drew on her Louisiana heritage. More quality TV came her way when she starred as Sophie in Sophie & the Moonhanger (1996), a mini-movie that focused on the relationship of the wife of a Klansman and her longtime black housekeeper. She kept up the momentum with an unsympathetic role in the Oprah Winfrey miniseries The Wedding (1998), where she again had to cover a long life span, this time from 19 to 47, and Redemption (2004) with Jamie Foxx, an urban film that chronicled the turbulent life of (now) imprisoned L.A. Crips gang founder Stan \"Tookie\" Williams. More recent turns have come with a recurring role in the series Without a Trace (2002), a part in an updated version of Clare Boothe Luce's The Women (2008) and a lead role opposite Ciara in the film Mama I Want to Sing (2011). Divorced from Vantile Whitfield in the late 70s, Lynn later married British director Brian Gibson in 1990, by whom she has a daughter, Grace. They parted ways in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MTU0NTg0Ml5BMl5BanBnXkFtZTcwOTYxMTQ5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005551","name":"Lynn Whitfield","idIMDB":"nm0005551"},"actorId":"nm0005551","character":"Ms. Parker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tristen M. Carter","urlProfile":"http://www.imdb.com/name/nm4784623","urlPhoto":"","biography":{"bio":"Tristen M. Carter is an actor, known for Battlefield America (2012) and You, Me & The Circus (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4784623","name":"Tristen M. Carter","idIMDB":"nm4784623"},"actorId":"nm4784623","character":"Eric Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chandler Kinney","urlProfile":"http://www.imdb.com/name/nm3934768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMzIxMjI0MV5BMl5BanBnXkFtZTcwMTI3MjQzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Chandler Kinney is an actress, known for Lethal Weapon (2016), Gortimer Gibbon's Life on Normal Street (2014) and Girl Meets World (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMzIxMjI0MV5BMl5BanBnXkFtZTcwMTI3MjQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3934768","name":"Chandler Kinney","idIMDB":"nm3934768"},"actorId":"nm3934768","character":"Chantel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracey Heggins","urlProfile":"http://www.imdb.com/name/nm2422410","urlPhoto":"","biography":{"bio":"Tracey Heggins is known for her work on The Twilight Saga: Breaking Dawn - Part 2 (2012), Medicine for Melancholy (2008) and LUV (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2422410","name":"Tracey Heggins","idIMDB":"nm2422410"},"actorId":"nm2422410","character":"Kimberly Aimes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Jones","urlProfile":"http://www.imdb.com/name/nm0427757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMzNTIyNDkzMV5BMl5BanBnXkFtZTYwNjY4NjA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1982","placeOfBirth":" Myrtle Beach, South Carolina, USA","birthName":"Christopher Michael Jones","height":"5' 11\" (1.8 m)","bio":"Christopher Jones was born on February 4, 1982 in Myrtle Beach, South Carolina, USA as Christopher Michael Jones. He is known for his work on Forrest Gump (1994), You Got Served (2004) and Big Momma's House 2 (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMzNTIyNDkzMV5BMl5BanBnXkFtZTYwNjY4NjA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0427757","name":"Christopher Jones","nicknames":["Chris"],"idIMDB":"nm0427757"},"actorId":"nm0427757","character":"Hank 'The Shockwave' Adams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"JoJo Wright","urlProfile":"http://www.imdb.com/name/nm1392352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzIxNTcyOF5BMl5BanBnXkFtZTcwMTkwNzYyMg@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"JoJo Wright is an actor and producer, known for Bring It On: All or Nothing (2006), No Vacancy (2012) and Battlefield America (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzIxNTcyOF5BMl5BanBnXkFtZTcwMTkwNzYyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1392352","name":"JoJo Wright","idIMDB":"nm1392352"},"actorId":"nm1392352","character":"Ernie Garrison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valarie Pettiford","urlProfile":"http://www.imdb.com/name/nm0678656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDU4NTM4Ml5BMl5BanBnXkFtZTcwODM0MzQ2Nw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1960","placeOfBirth":" Queens, New York, USA","height":"5' 8½\" (1.74 m)","bio":"Valarie Pettiford's career glitters like the lights on Broadway. An award-winning triple-threat, Valarie has worked with some of the biggest names in entertainment, but has never let her brushes with fame go to her head. Although some would argue that she is a celebrity in her own right, Valarie is still a humble girl from Queens. On screen, at age 14, Pettiford starred in the chorus of the film The Wiz (1978). She has appeared in such films as The Cotton Club (1984), Glitter (2001), Stomp the Yard (2007), Why Did I Get Married Too? (2010), the short film musical Not Your Time (2010), the award-winning short film Response (2009) and Jumping the Broom (2011) from Sony Pictures. Her role in the acclaimed independent film Why Am I Doing This? (2009) earned her a glowing mention in the L.A. Times. Her role as Big Dee Dee Thorne on the hit sitcom Half & Half (2002) earned her three NAACP Image Award nominations. Valarie plays the recurring role of Sandra Lucas on Tyler Perry's House of Payne (2006). Other notable television appearances include guest-starring roles on Criminal Minds (2005), CSI: Crime Scene Investigation (2000), CSI: Miami (2002), The District (2000), The West Wing (1999), Frasier (1993), One Life to Live (1968), Bones (2005), The Cape (1996) and The Finder (2012). She had a recurring guest star on the hit HBO series Treme (2010). Valarie's theatre credits read like a prestigious shopping list, with numerous accolades for the execution of her craft. Valarie won NAACP Theatre and Garland Awards for Best Actress in \"The Wild Party.\" She was honored with NAACP, Robby and Reader's Choice Awardsfor for her role in \"Show Boat.\" Both performances were nominated for Ovation Awards. Valarie was a member of the original casts of \"Sophisticated Ladies\", understudying Judith Jamison, and \"Fosse\", for which she was recognized by the Drama League and nominated for Outer Critics Circle, Dora Mavor Moore and Tony Awards. Valarie performed alongside Chita Rivera in the West End debut of \"Chicago\", and subsequently performed \"All That Jazz\" as a tribute to Rivera at the Kennedy Center Honors. However, her self-proclaimed career highlight was the fulfillment of a life-long dream; she recorded her first album, \"Hear My Soul\". An accomplished stage performer, Valarie has performed her successful one-woman shows to sold-out audiences coast to coast. She has performed with Lucille Ball and Desi Arnaz in New York and Miami in the musical tribute to their father, called \"Babalu\". Valarie enjoyed stellar reviews in both cities. Proving that her voice ad presence are both Broadway bold, she is a regular guest soloist with the Pasadena Symphony for their annual Pops program. In the traditional sense of the word, Valarie Pettiford is a diva, a master of her craft who has the ability to command attention. Whether she would agree, or try to harness that power, is anyone's guess.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDU4NTM4Ml5BMl5BanBnXkFtZTcwODM0MzQ2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0678656","name":"Valarie Pettiford","idIMDB":"nm0678656"},"actorId":"nm0678656","character":"Ms. Williams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Anthony Sturgis","urlProfile":"http://www.imdb.com/name/nm0836365","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MTI3NTczMF5BMl5BanBnXkFtZTcwNjkwMzg1Nw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1966","placeOfBirth":" New Orleans, Louisiana, USA","height":"6' 1\" (1.85 m)","bio":"Gary Anthony Sturgis is a New Orleans born actor/writer/director best-known for his portrayal of the villain in two of Tyler Perry's biggest hit films, \"Diary of A Mad Black Woman\" (as Jamison Jackson) and \"Daddy's Little Girls\" (as Joseph Woods). He also co-starred opposite Terrence Howard in \"Pride\", as the charming yet sinister pimp/drug dealer Franklin Washington. Recently, he has stepped out the role of bad guy to co-star in the comedy \"Chicago Pulaski Jones\" with Kel Mitchell and Cedric the Entertainer. Also a professional voice artist, Sturgis has voiced network promos for UPN, CBS, PBS and ABC, cartoons and video games (Static Shock, Batman, Scooby Doo and The Cyber Chase, Fairly Odd Parents, Spiderman) and is heard on countless commercials for radio and television. His raspy bass-baritone voice that the women find hard to resist has even been heard on national movie trailers and promotions for; \"Bones\", \"Two Can Play That Game\", \"The Others\", \"The Brothers\" and \"The Wood\" to name a select few. In addition, he is also the voice for the History Channel's \"K-9 Cops\". For another surprise, Gary also produces and writes rap music and has a successful recording under the moniker Illuminati called Fahrenheit, which is still available on iTunes. As a writer/producer, Gary is producing some of his own feature-length screenplays (he has written more than ten), and has packaged his works into three and four picture deals and commenced to shopping them around town for financing and distribution. We have only scratched the surface of this multi-faceted creative soul. Since Sturgis had been writing for years, the next natural progression was to direct. After directing \"Lend A Hand\", a 90-second short film for the American Black Film Festival (ABFF), Gary realized that directing was yet another feather he could stick in his talented cap. He also exercises his writing chops daily as a regular staff writer on the number-one urban comedy in the history of cable television, \"House of Payne\" and the latest Tyler Perry series, \"Meet The Browns\", on which he also plays a recurring character. Gary will be directing two of his own films, a comedy, \"The Inheritance\" and an action drama, \"Le Bon Temps Rouler\", in the near future as the first two films from his production company, GEMFilmworks. The multi-hyphenated talent is already respected as an actor and plans to make an even bigger mark in the entertainment business while he perpetually broadens his horizons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MTI3NTczMF5BMl5BanBnXkFtZTcwNjkwMzg1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0836365","name":"Gary Anthony Sturgis","idIMDB":"nm0836365"},"actorId":"nm0836365","character":"Eric Smith Sr.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kida Burns","urlProfile":"http://www.imdb.com/name/nm4855565","urlPhoto":"","biography":{"bio":"Leon Akida Burns, best known by his stage name Kida The Great is a talented 14 year old dancer/choreographer from Sacramento. Kida learned the art of dance from his big brother at the young age of four and is now apart of the amazing groups, Family First Crew, The Art Of Teknique, and Chapkidz who are now HHI World Champions. The newest addition to that is his very own squad he has picked and groomed to his perfection known as New Generation. \"keep praying, keep planning, keep pushing is his motto and a mindset that his father left with him. 2014 was a bittersweet year as he lost his father, one of his biggest motivators, but won the internet breaking battle that reached millions of views, was re-posted by thousands, and really grew his fan base. He carries that mindset to motivate and push him daily. Kida was named Most Inspirational Dancer, and Best Kid Dancer at the Sacramento Music Festival amongst many other contests and events in his hometown. Kida has also recently won So You Think You Can Dance: Next Generation. He grew alot as a dancer and person as he was partnered with ,So You Think You Can Dance All-Star, Fik-Shun. Working hard like this daily has given him the opportunity to be on Ellen, The Queen Latifah Show, Rachael Ray, Battlefield America, a number of commercials and music videos and he doesn't plan to stop there. He's accomplished his goal of starting a dance workshop tour teaching city to city with the aim to go worldwide.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4855565","name":"Kida Burns","idIMDB":"nm4855565"},"actorId":"nm4855565","character":"Thomas 'Tommy' Brown","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neiko Keiyan","urlProfile":"http://www.imdb.com/name/nm2980979","urlPhoto":"","biography":{"bio":"Neiko Keiyan is an actor, known for Battlefield America (2012), Rituals (2007) and Funny or Die Net Neutrality (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2980979","name":"Neiko Keiyan","idIMDB":"nm2980979"},"actorId":"nm2980979","character":"Jeremiah Williams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gavin Pecson","urlProfile":"http://www.imdb.com/name/nm5077489","urlPhoto":"","biography":{"bio":"Gavin Pecson is an actor, known for Battlefield America (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5077489","name":"Gavin Pecson","idIMDB":"nm5077489"},"actorId":"nm5077489","character":"Tyrone 'Chocolate' Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Cravens","urlProfile":"http://www.imdb.com/name/nm5077386","urlPhoto":"","biography":{"bio":"Adam Cravens is an actor, known for Battlefield America (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5077386","name":"Adam Cravens","idIMDB":"nm5077386"},"actorId":"nm5077386","character":"Trey 'Mute' Jordan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zach Belandres","urlProfile":"http://www.imdb.com/name/nm4883577","urlPhoto":"","biography":{"bio":"Zach Belandres is an actor, known for Battlefield America (2012) and Teens Wanna Know (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4883577","name":"Zach Belandres","idIMDB":"nm4883577"},"actorId":"nm4883577","character":"Chu","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1995260","urlIMDB":"http://www.imdb.com/title/tt1995260","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red One Camera (MX sensor)"],"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (4.5K) (source format)"],"printedFilmFormat":["D-Cinema"]},"rating":"2.6","metascore":"31","filmingLocations":[],"rated":"PG-13","awards":[],"votes":"1,332","type":"Movie","companyCreditsSimple":[{"idCompany":"co0366704","name":"Brian & Barrett Pictures"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:59:56"}}