{"data":{"movies":[{"title":"Thor: The Dark World","originalTitle":"","year":"2013","releaseDate":"20131108","directors":[{"name":"Alan Taylor","id":"nm0851930"}],"writers":[{"name":"Christopher Yost","id":"nm1236653"},{"name":"Christopher Markus","id":"nm1321655"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzAwOTUxOF5BMl5BanBnXkFtZTcwMTE0OTc5OQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Fantasy","Sci-Fi"],"plot":"Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stop them but their leader Malekith escapes to wait for another opportunity. The warriors find the Aether and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster awaits the return of Thor although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth but his father, Odin refuses to let him. Thor learns from Heimdall, who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to ...","simplePlot":"When Dr. Jane Foster gets cursed with a powerful entity known as the Aether, Thor is heralded of the cosmic event known as the Convergence and the genocidal Dark Elves.","actors":[{"actorName":"Chris Hemsworth","urlProfile":"http://www.imdb.com/name/nm1165110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2MTI0NTIyNV5BMl5BanBnXkFtZTcwMTA4Nzc3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1983","placeOfBirth":" Melbourne, Victoria, Australia","height":"6' 2¾\" (1.9 m)","bio":"Chris Hemsworth was born in Melbourne, Australia, to Leonie (van Os), a teacher of English, and Craig Hemsworth, a social-services counselor. His brothers are actors Liam Hemsworth and Luke Hemsworth. He is of Dutch (from his immigrant maternal grandfather), Irish, English, Scottish, and German ancestry. His uncle, by marriage, was Rod Ansell, the bushman who inspired the film Crocodile Dundee (1986). Chris saw quite a bit of the country in his youth, after his family moved to the Northern Territory before finally settling on Phillip Island, to the south of Melbourne. In 2004, he unsuccessfully auditioned for the role of Robbie Hunter in the Australian soap opera Summer Bay (1988) but was recalled for the role of Kim Hyde which he played until 2007. In 2006, he entered the Australian version of Dancing with the Stars (2004) and his popularity in the soap enabled him to hang on until show 7 (Dancing with the Stars: Episode #5.7 (2006) when he became the fifth contestant to be eliminated. His first Hollywood appearance was in Star Trek (2009), but it was his titular role in Thor (2011) which propelled him to prominence worldwide. He reprised the character in the science fiction blockbuster The Avengers (2012). Chris's American representative, management company ROAR, also manages actress Elsa Pataky, and it was through them that the two met, marrying in 2010. The couple have a daughter and twin sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2MTI0NTIyNV5BMl5BanBnXkFtZTcwMTA4Nzc3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1165110","name":"Chris Hemsworth","nicknames":["Kip"],"idIMDB":"nm1165110"},"actorId":"nm1165110","character":"Thor","urlCharacter":"http://www.imdb.com/character/ch0560636","main":true},{"actorName":"Natalie Portman","urlProfile":"http://www.imdb.com/name/nm0000204","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODE3Mjg1NV5BMl5BanBnXkFtZTcwNzA4ODcxNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1981","placeOfBirth":" Jerusalem, Israel","birthName":"Natalie Hershlag","height":"5' 3\" (1.6 m)","bio":"Natalie Portman is the first person born in the 1980s to have won the Academy Award for Best Actress (for Black Swan (2010)). Natalie was born Natalie Hershlag on June 9, 1981, in Jerusalem, Israel, to a Jewish family. She is the only child of Avner Hershlag, an Israeli-born doctor, and Shelley Stevens, an American-born artist (from Cincinnati, Ohio), who also acts as Natalie's agent. She left Israel for Washington, D.C., when she was still very young. After a few more moves, her family finally settled in New York, where she still lives to this day. She graduated with honors, and her academic achievements allowed her to attend Harvard University. She was discovered by an agent in a pizza parlor at the age of 11. She was pushed towards a career in modeling but she decided that she would rather pursue a career in acting. She was featured in many live performances, but she made her powerful film debut in the movie Léon: The Professional (1994) (aka \"Léon\"). Following this role Natalie won roles in such films as Heat (1995), Beautiful Girls (1996), and Mars Attacks! (1996). It was not until 1999 that Natalie received worldwide fame as Queen Amidala in the highly anticipated US$431 million-grossing prequel Star Wars: Episode I - The Phantom Menace (1999). She then she starred in two critically acclaimed comedy dramas, Anywhere But Here (1999) and Where the Heart Is (2000), followed by Closer (2004), for which she received an Oscar nomination. She reprised her role as Padme Amidala in the last two episodes of the Star Wars prequel trilogy: Star Wars: Episode II - Attack of the Clones (2002) and Star Wars: Episode III - Revenge of the Sith (2005). She received an Academy Award and a Golden Globe Award for Best Actress in Black Swan (2010). She received a second nomination for Best Actress, for playing Jacqueline Kennedy in Jackie (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODE3Mjg1NV5BMl5BanBnXkFtZTcwNzA4ODcxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000204","name":"Natalie Portman","nicknames":["Nat"],"idIMDB":"nm0000204"},"actorId":"nm0000204","character":"Jane Foster","urlCharacter":"http://www.imdb.com/character/ch0036544","main":true},{"actorName":"Tom Hiddleston","urlProfile":"http://www.imdb.com/name/nm1089991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNjE0Njg2MTReQTJeQWpwZ15BbWU3MDEyODM1ODc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1981","placeOfBirth":" Westminster, London, England, UK","birthName":"Thomas William Hiddleston","height":"6' 2\" (1.88 m)","bio":"Thomas William Hiddleston was born in Westminster, London, to English-born Diana Patricia (Servaes) and Scottish-born James Norman Hiddleston. His mother is a former stage manager, and his father, a scientist, was the managing director of a pharmaceutical company. He started off at the preparatory school, The Dragon School in Oxford, and by the time he was 13, he boarded at Eton College, at the same time that his parents were going through a divorce. He continued on to the University of Cambridge, where he earned a double first in Classics. He continued to study acting at the Royal Academy of Dramatic Art, from which he graduated in 2005. Whilst at University of Cambridge, he was seen by the agency 'Hamilton Hodell' in the play \"A Streetcar Named Desire\" and was signed. Following this, he was cast in his first television role in The Life and Adventures of Nicholas Nickleby (2001). Hiddleston won his first film role as Oakley in Joanna Hogg's award-winning first feature, Unrelated (2007). His breakthrough role came when he portrayed the nemesis Loki in the Marvel Cinematic Universe feature film Thor (2011). He reprised the character in The Avengers (2012), Thor: The Dark World (2013), Thor: Ragnarok (2017) and Avengers: Infinity War (2018). He has also appeared in Steven Spielberg's War Horse (2011), The Deep Blue Sea (2011), Woody Allen's romantic comedy Midnight in Paris (2011), and the romantic vampire film Only Lovers Left Alive (2013). On television, he appeared on the BBC series The Hollow Crown (2012), in the adaptations of Shakespeare's \"Henry IV\" and \"Henry V\". In theatre, he has been in the productions of \"Cymbeline\" (2007) and \"Ivanov\" (2008). In December 2013, he starred as the title character in the Donmar Warehouse production of \"Coriolanus\" which played until February 2014. He won the Laurence Olivier Award for Best Newcomer in a Play for his role in \"Cymbeline\" while also being nominated for the same award the same year for his role as Cassio in \"Othello\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNjE0Njg2MTReQTJeQWpwZ15BbWU3MDEyODM1ODc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1089991","name":"Tom Hiddleston","idIMDB":"nm1089991"},"actorId":"nm1089991","character":"Loki","urlCharacter":"http://www.imdb.com/character/ch0039559","main":true},{"actorName":"Anthony Hopkins","urlProfile":"http://www.imdb.com/name/nm0000164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk1NTc5Ml5BMl5BanBnXkFtZTYwMjAwOTI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1937","placeOfBirth":" Margam, Port Talbot, West Glamorgan, Wales, UK","birthName":"Philip Anthony Hopkins","height":"5' 8½\" (1.74 m)","bio":"Anthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre, invited by Laurence Olivier, who could see the talent in Hopkins. In 1967, he made his first film for television, A Flea in Her Ear (1967). From this moment on, he enjoyed a successful career in cinema and television. In 1968, he worked on The Lion in Winter (1968) with Timothy Dalton. Many successes came later, and Hopkins' remarkable acting style reached the four corners of the world. In 1977, he appeared in two major films: A Bridge Too Far (1977) with James Caan, Gene Hackman, Sean Connery, Michael Caine, Elliott Gould and Laurence Olivier, and Maximilian Schell. In 1980, he worked on The Elephant Man (1980). Two good television literature adaptations followed: Othello (1981) and The Hunchback of Notre Dame (1982). In 1987 he was awarded with the Commander of the order of the British Empire. This year was also important in his cinematic life, with 84 Charing Cross Road (1987), acclaimed by specialists. In 1993, he was knighted. In the 1990s, Hopkins acted in movies like Desperate Hours (1990) and Howards End (1992), The Remains of the Day (1993) (nominee for the Oscar), Legends of the Fall (1994), Nixon (1995) (nominee for the Oscar), Surviving Picasso (1996), Amistad (1997) (nominee for the Oscar), The Mask of Zorro (1998), Meet Joe Black (1998) and Instinct (1999). His most remarkable film, however, was The Silence of the Lambs (1991), for which he won the Oscar for Best Actor. He also got a B.A.F.T.A. for this role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk1NTc5Ml5BMl5BanBnXkFtZTYwMjAwOTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000164","name":"Anthony Hopkins","nicknames":["Tony"],"idIMDB":"nm0000164"},"actorId":"nm0000164","character":"Odin","urlCharacter":"http://www.imdb.com/character/ch0036545","main":true},{"actorName":"Christopher Eccleston","urlProfile":"http://www.imdb.com/name/nm0001172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTI1NjUxMl5BMl5BanBnXkFtZTYwMTAzNjI3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1964","placeOfBirth":" Salford, Lancashire, England, UK","height":"6' (1.83 m)","bio":"Christopher Eccleston trained at the Central School of Speech and Drama and first came to public attention as Derek Bentley in L'âge de vivre (1991). However, it was a regular role in the television series Cracker (1993) that made him a recognizable figure in the United Kingdom. He appeared in the low-budget thriller Shallow Grave (1994), and in the same year, won the part of Nicky Hutchinson in the epic BBC drama serial Our Friends in the North (1996). It was the transmission of the latter series on BBC Two that really made him into a household name in the United Kingdom. In his film career, he has starred as a leading man alongside a number of major actresses, such as Renée Zellweger in A Price Above Rubies (1998), Cate Blanchett in Elizabeth (1998), and Cameron Diaz and Jordana Brewster in The Invisible Circus (2001), and Nicole Kidman in Les autres (2001). In addition to his successful film career, he has continued to work in his favourite medium, appearing in some of the most challenging and thought-provoking British television dramas of recent years. These have included Clocking Off (2000) and Flesh and Blood (2002) for the BBC and Hillsborough (1996), the Iago character in a modern adaptation of Shakespeare's \"Othello\", and the religious epic The Second Coming (2003), playing Steve Baxter, the son of God. His stage career, while not as extensive as his screen credits, has nevertheless shown him to be a formidable actor. He has given intense, focused performances in such plays as \"Hamlet\", \"Electricity\" and \"Miss Julie\", for which he received excellent reviews. A very highly regarded actor, Eccleston has twice been nominated in the Best Actor category at the BAFTA Television Awards, the British premiere television awards ceremony. His first nomination came in 1997 for \"Our Friends in the North\". Although he didn't win those awards, however, he did triumph in the Best Actor categories at the 1997 Broadcasting Press Guild Awards and the Royal Television Society Awards, winning for \"Our Friends in the North\". He won the RTS Best Actor award for a second time in 2003, this time for his performance in \"Flesh and Blood\". In 2005, he received the Most Popular Actor award in the National Television Awards for Doctor Who.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTI1NjUxMl5BMl5BanBnXkFtZTYwMTAzNjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001172","name":"Christopher Eccleston","nicknames":["Chris"],"idIMDB":"nm0001172"},"actorId":"nm0001172","character":"Malekith","urlCharacter":"http://www.imdb.com/character/ch0321653","main":true},{"actorName":"Jaimie Alexander","urlProfile":"http://www.imdb.com/name/nm1526352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzAzMzQyNl5BMl5BanBnXkFtZTgwMTU3OTA2MDE@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1984","placeOfBirth":" Greenville, South Carolina, USA","birthName":"Jaimie Lauren Tarbush","height":"5' 9\" (1.75 m)","bio":"Jaimie Alexander was born in Greenville, South Carolina, but moved with her family to Grapevine, Texas, when she was four years old. She took theatre classes in grade school as a hobby but was kicked out in high school because she could not sing, and so she took up sports instead. At age 17 she substituted for a friend at a meeting with a scouting agency and she met her manager, Randy James, who sent her some scripts. After graduating from high school she moved to Los Angeles, California, to pursue acting. Her career was launched in 2003 when she was cast in the leading role of Hanna Thompson in the low-budget award-winning film The Other Side (2006). According to the DVD commentary, she was originally at the audition to help out by reading against the male actors, but director Gregg Bishop decided to cast her in the leading role after hearing her perform the lines. Her second role was in 2004 in Squirrel Trap (2004), in which she played the co-lead role of Sara. A year later she was cast as Jessi XX on the ABC Family series Kyle XY (2006), in which she played the role of a superhuman being created by scientists as a laboratory experiment. She was nominated for the Saturn Awards as \"Best Supporting Actress on Television\" for that role in 2008. Her biggest role came in 2011, when she was cast as Lady Sif, a warrior goddess of Asgard, in the blockbuster from Marvel Comics, Thor (2011). She later reprised her role in its sequel, Thor: The Dark World (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzAzMzQyNl5BMl5BanBnXkFtZTgwMTU3OTA2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1526352","name":"Jaimie Alexander","nicknames":["James"],"idIMDB":"nm1526352"},"actorId":"nm1526352","character":"Sif","urlCharacter":"http://www.imdb.com/character/ch0062967","main":true},{"actorName":"Zachary Levi","urlProfile":"http://www.imdb.com/name/nm1157048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNTAzMTA4OTJeQTJeQWpwZ15BbWU3MDA4NDI2Njk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1980","placeOfBirth":" Lake Charles, Louisiana, USA","birthName":"Zachary Levi Pugh","height":"6' 3¼\" (1.91 m)","bio":"The middle child between two sisters, Zachary Levi was born as Zachary Levi Pugh, on September 29, 1980, in Lake Charles, Louisiana, to Susan (Hoctor) and Darrell Pugh. He uses his middle name as his stage surname, because his birth name, \"Pugh\", which is of Welsh origin, sounds too much like \"Pew\"; his other ancestry is English, German, and Irish. He grew up all over the country before his family put down roots in Ventura County, California. At the early age of six, Zachary began acting, singing and dancing in school and local theater productions. After graduating from Buena High School, he headed to Los Angeles to pursue his dream of acting. Zachary began acting in theater, performing roles in such regional productions like Grease, The Outsiders, Oliver, The Wizard of Oz and Big River. It was his portrayal of Jesus in Ojai's Godspell that brought him to the attention of Hollywood. Most recently he completed a supporting role in the television movie Big Shot: Confessions of a Campus Bookie (2002) with David Krumholtz, Tory Kittles, Jennifer Morrison and Nicholas Turturro. He then began acting as Kipp Steadman in the TV series Less Than Perfect (2002) with Sara Rue, Andrea Parker, Eric Roberts, Andy Dick and Sherri Shepherd. He recently was seen in the television movie Une célibataire à New-York (2003) on the WB with Charisma Carpenter, Holly Marie Combs, Linda Dano and Rachelle Lefevre. In his spare time, Zachary enjoys skateboarding, snowboarding, skydiving and participating in various other sports. He lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNTAzMTA4OTJeQTJeQWpwZ15BbWU3MDA4NDI2Njk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1157048","name":"Zachary Levi","nicknames":["Zac"],"idIMDB":"nm1157048"},"actorId":"nm1157048","character":"Fandral","urlCharacter":"http://www.imdb.com/character/ch0127923","main":true},{"actorName":"Ray Stevenson","urlProfile":"http://www.imdb.com/name/nm0829032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjczMDYzMV5BMl5BanBnXkFtZTcwMDQzMDIzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1964","placeOfBirth":" Lisburn, Northern Ireland, UK","birthName":"George Raymond Stevenson","height":"6' 4\" (1.93 m)","bio":"Tall, dark, but somewhat gentle-looking actor Ray Stevenson was born in Lisburn, Northern Ireland on 25 May 1964, on a British army base. His father was a British pilot in the Royal Air Force, and his mother is Irish. He moved with his family to Lemington, Newcastle-Upon-Tyne, England in 1972 at the age of eight, and later to Cramlington, Northumberland, where he was raised. As a child, he dreamed to become an actor, but he also thought that dream was impossible. So he pursued his other love, art, and went to art school instead. He was an interior designer with an architectural firm in London when he at 25 decided to try out acting. Eventually he attended Bristol Old Vic Theatre School, graduating at the age of 29. At the beginning of 90s, he began his career on films. He did a few TV films, one of them is The Return of the Native (1994), where he appeared opposite Clive Owen, Catherine Zeta-Jones and Steven Mackintosh. He also filmed The Theory of Flight (1998) Greenwich Mean Time (1999), Green-Eyed Monster (2001) (TV) and a lot of TV guest roles in series. Finally, he made a international breakout with King Arthur (2004), as quiet, but loyal knight Dagonet, again with Clive Owen (who played Arthur), Keira Knightley, Ioan Gruffudd, Mads Mikkelsen, Ray Winstone and Stellan Skarsgard. After a few more TV films, Stevenson's popularity started to rise by each film. But, his real fame came with HBO's \"Rome\" (2005 - 2007), as funny, but heroically fearless legionary Titus Pullo, opposite Kevin McKidd. Another two well-known roles were in the action horror Outpost (2008) and as comic book dark hero The Punisher / Frank Castle in the extremely violent Punisher: War Zone (2008), opposite Dominic West (Jigsaw), Doug Hutchison, Colin Salmon, Wayne Knight (Microchip), Dash Mihok (Det. Marin Soap) and Julie Benz. Stevenson also worked on the stage where he played the part of Christ in the York Mystery Plays in 2000 at York Minster. In 2001, he took the part of Roger in the play Mouth to Mouth by Kevin Elyot, at the Albery Theatre in London with Lindsay Duncan and Michael Maloney. His most well-known part is perhaps that of the Cardinal in The Duchess of Malfi by John Webster with Janet McTeer at the Royal National Theatre in 2003. Ray was married to actress Ruth Gemmell from 1997 to 2005. His girlfriend Elisabetta Caraccia have a son, Sebastiano Derek Stevenson, who was born in 2007. Besides acting, he loves art and has a passion for water color painting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjczMDYzMV5BMl5BanBnXkFtZTcwMDQzMDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829032","name":"Ray Stevenson","idIMDB":"nm0829032"},"actorId":"nm0829032","character":"Volstagg","urlCharacter":"http://www.imdb.com/character/ch0127921","main":true},{"actorName":"Tadanobu Asano","urlProfile":"http://www.imdb.com/name/nm0038355","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzM5MTk5OV5BMl5BanBnXkFtZTgwMTcxMTY1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1973","placeOfBirth":" Yokohama, Japan","birthName":"Tadanobu Satô","height":"5' 10½\" (1.79 m)","bio":"Asano Tadanobu is a Japanese film actor. His father, an actors' agent, suggested he take on what became his first role, in the TV show \"Kimpachi Sensei,\" at the age of 16. His film debut was in the 1990 Swimming Upstream (Bataashi kingyo (1990)), though his first major critical success was in Shunji Iwai's Fried Dragon Fish (1993). His first critical success in the West was in Hirokazu Koreeda's Maborosi (1995), in which he played a man who inexplicably throws himself in front of a train, widowing his wife and orphaning his infant son. His best known works internationally are the samurai films Gohatto (1999) and The Blind Swordsman: Zatoichi (2003). It was on the set of Iwai's Picnic (1996) that he met and fell in love with J-Pop idol Chara. They married soon after learning she was pregnant with their first child, Sumire. While best known for characters who are psychologically offbeat, if not downright psychotic (e.g. Kakihara in Ichi the Killer (2001)), Asano has been described by those who know him as a down-to-earth family man. He has directed commercial TV spots for Chara. Hesistant to identify himself as an actor, he most readily describes himself as a vocalist, referring to Mach 1.67, the band he has with director Gakuryû Ishii. He's also an artist, and sometimes works as a model, most notably for the Japanese designers Takeo Kikuchi and Jun Takahashi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzM5MTk5OV5BMl5BanBnXkFtZTgwMTcxMTY1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0038355","name":"Tadanobu Asano","idIMDB":"nm0038355"},"actorId":"nm0038355","character":"Hogun","urlCharacter":"http://www.imdb.com/character/ch0127922","main":true},{"actorName":"Idris Elba","urlProfile":"http://www.imdb.com/name/nm0252961","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1972","placeOfBirth":" Hackney, London, England, UK","birthName":"Idrissa Akuna Elba","height":"6' 2¾\" (1.9 m)","bio":"An only child, Idris Elba was born and raised in Hackney, London, England. His father, Winston, is from Sierra Leone and worked at a Ford motor factory. His mother, Eve, is from Ghana and had a clerical duty. Idris attended school in Canning Town, where he first became involved in acting. He gained a place in the National Youth Music Theatre - thanks to a £1,500 Prince's Trust grant. He worked as a disc jockey in nightclubs under the nickname DJ Big Driis at age 19. However, he began auditioning for television roles in his early twenties. He has starred in both British and American productions. His first acting roles were on the soap opera Family Affairs (1997) and the television serial Ultraviolet (1998). His best known roles are as drug baron Russell \"Stringer\" Bell on the HBO series The Wire (2002) and as DCI John Luther on the BBC One series Luther (2010). He later starred in the films Daddy's Little Girls (2007), Prom Night (2008), RocknRolla (2008), The Unborn (2009) and Obsessed (2009). He also appeared in the films American Gangster (2007), Takers (2010), Thor (2011), Prometheus (2012), Pacific Rim (2013) and Thor: The Dark World (2013). Idris Elba was appointed Officer of the Order of the British Empire (OBE) by Queen Elizabeth II in the 2016 New Years Honours for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0252961","name":"Idris Elba","nicknames":["DJ Big Driis"],"idIMDB":"nm0252961"},"actorId":"nm0252961","character":"Heimdall","urlCharacter":"http://www.imdb.com/character/ch0150888","main":true},{"actorName":"Rene Russo","urlProfile":"http://www.imdb.com/name/nm0000623","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MDI4MDE3MF5BMl5BanBnXkFtZTYwNzI3NjE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1954","placeOfBirth":" Burbank, California, USA","birthName":"Rene Marie Russo","height":"5' 8\" (1.73 m)","bio":"Rene Russo was born in Burbank, California, to Shirley (Balocca), a barmaid and factory laborer, and Nino Russo. She grew up on the wrong side of the tracks. Her father, a sculptor and mechanic, left the family when Rene was just two, and thus her mother raised Rene and her sister, Toni, as a single mom. Her father was of Italian descent, and her mother was of Italian and German-English-Irish ancestry. In junior high school, Rene was plagued with scoliosis and had to wear a full-torso brace. She was already a tall girl, which earned her the nickname \"Jolly Green Giant\" from her classmates. She entered Burroughs High School, along with classmate Ron Howard, and even though her brace had been removed, she was still somewhat of a loner. Unable to deal with academics and the school social scene, Rene dropped out of school in the tenth grade. Since money was tight, she began to take a variety of part-time jobs over the next 18 months, many for the free benefits. She sold refreshments at a movie theater, where she could see free movies; worked as a restaurant hostess, where her meals were free; and worked as a store cashier at Disneyland, where she had free admission. She often had two jobs at one time. Her last job, which was solely for the paycheck, was a full-time job at an eyeglass factory, inspecting contact lenses. In 1972, the 17-year-old was attending a Rolling Stones concert when she was approached by John Crosby, a scout and manager from International Creative Management. He told her she should be a model and had test photos made of her. Within a few months, Rene signed a contract with Ford Modeling Agency and within a year had become a successful print and photographers model. Soon her modeling breakthrough came when she graced the cover of Vogue. By 1975, she had appeared on numerous magazine covers, was one of the most successful models in America, and was also starting to be seen in several TV commercials through the 1980s. She would define what a top fashion model was for years to come. By her 30th birthday, demand for her began to dwindle, as it did for most models at that age. She did a few more commercials and then turned her back on modeling and show business for a while. Financially secure for the next several years, she began an intense period of literature and Christian theology. She also began to study theater and acting, and began appearing in theater roles at small regional theaters in Los Angeles and elsewhere in California. Her television series debut came in 1987 with a supporting part on the short-lived TV series Sable (1987). In 1989 she made her motion picture debut with the part of the lead characters girlfriend in the film Major League (1989). Her subsequent roles were that of girlfriends and supportive wives in a few films, until her breakthrough as an Internal Affairs detective in Lethal Weapon 3 (1992). Rene Russo has been praised for her ability to hold her own against her major male co-stars, who have included Mel Gibson, Clint Eastwood, Kevin Costner and Pierce Brosnan. Two of her performances within the last few years have gotten her recognition as both a major dramatic actress and a talented character actress. One was as the mother of a kidnapped son in Ransom (1996). The other was as the cartoon femme fatale foreign spy in The Adventures of Rocky & Bullwinkle (2000). Although the latter received mixed reviews among moviegoers and critics, Russo was praised for her performance of a role originally slated for Meryl Streep in 1992. Rene Russo has been married to screenwriter Dan Gilroy since 1992, and they have one daughter, named Rose. They reside in Brentwood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MDI4MDE3MF5BMl5BanBnXkFtZTYwNzI3NjE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000623","name":"Rene Russo","idIMDB":"nm0000623"},"actorId":"nm0000623","character":"Frigga","urlCharacter":"http://www.imdb.com/character/ch0173777","main":true},{"actorName":"Adewale Akinnuoye-Agbaje","urlProfile":"http://www.imdb.com/name/nm0015382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1967","placeOfBirth":" Islington, London, England, UK","birthName":"Adewale Rotimi O. C. E. Akinnuoye Agbaje","height":"6' 2\" (1.88 m)","bio":"Born and raised in London, England, Adewale Akinnuoye-Agbaje began his career as a model in Milan. He graduated with a masters degree in Law from London's prestigious Kings College, before moving to Los Angeles to make the transition to acting. Fluent in several languages, including English, Italian, Yoruba and Swahili, he is best known for his roles in the movies Congo (1995) and The Mummy Returns (2001), and the HBO series Oz (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015382","name":"Adewale Akinnuoye-Agbaje","nicknames":["Triple A","Wally"],"idIMDB":"nm0015382"},"actorId":"nm0015382","character":"Algrim / Kurse","urlCharacter":"http://www.imdb.com/character/ch0492204","main":true},{"actorName":"Kat Dennings","urlProfile":"http://www.imdb.com/name/nm0993507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjk2NzA5Ml5BMl5BanBnXkFtZTcwNzIxMDcwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1986","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Katherine Victoria Litwack","height":"5' 4½\" (1.64 m)","bio":"Kat Dennings was born Katherine Victoria Litwack in Bryn Mawr, Pennsylvania, near Philadelphia, to Ellen (Schatz), a speech therapist and poet, and Gerald Litwack, a molecular pharmacologist. She is the youngest of five children. Her family is of Russian Jewish descent. Kat was predominantly home-schooled, graduating at the age of fourteen. Her family subsequently moved to Los Angeles, California to support Kat acting full-time. After work doing commercials, she began work in television, starting with a role on HBO's Sex and the City (1998), following up with roles on Raising Dad (2001), The Scream Team (2002), Everwood (2002), Without a Trace (2002) and ER (1994), among others. Kat made the move to the big screen with supporting roles in Raise Your Voice (2004), The 40-Year-Old Virgin (2005) and Big Momma's House 2 (2006). She later achieved a level of fame with roles in The House Bunny (2008) and Nick and Norah's Infinite Playlist (2008). Kat continues to act in feature films and is an avid video blogger. Since 2011, she has starred with Beth Behrs in the CBS television series 2 Broke Girls (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjk2NzA5Ml5BMl5BanBnXkFtZTcwNzIxMDcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0993507","name":"Kat Dennings","idIMDB":"nm0993507"},"actorId":"nm0993507","character":"Darcy Lewis","urlCharacter":"http://www.imdb.com/character/ch0188123","main":true},{"actorName":"Stellan Skarsgård","urlProfile":"http://www.imdb.com/name/nm0001745","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDUzOTY0N15BMl5BanBnXkFtZTYwNjYxODE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1951","placeOfBirth":" Gothenburg, Västra Götalands län, Sweden","birthName":"John Stellan Skarsgård","height":"6' 3\" (1.91 m)","bio":"Stellan Skarsgård was born in Gothenburg, Västra Götalands län, Sweden, to Gudrun (Larsson) and Jan Skarsgård. He became a star in his teens through the title role in the TV-series Bombi Bitt och jag (1968). Between the years 1972-88 he was employed at The Royal Dramatic Theatre in Stockholm, where he participated in \"Vita rum\" (1988), August Strindberg's \"Ett drömspel\" (1986) and \"Mäster Olof\" (1988). Simultaneously Skarsgård did outstanding film roles, notably in The Simple-Minded Murderer (1982) by Hans Alfredson and with Fred Ward in American Playhouse: Noon Wine (1985). The fantastic performance gave him both a well-earned Guldbagge and Silver Berlin Bear. He portrayed the Skagen-painter Sören Kröyer in Hip Hip Hurrah! (1987) and the Swedish ambassador Raoul Wallenberg in Good Evening, Mr. Wallenberg (1990), both directed by Kjell Grede. Täcknamn Coq Rouge (1989) and Den demokratiske terroristen (1992) he played Jan Guillou's Swedish superagent Carl Hamilton. He also had the leading part in the Oscar nominated Oxen (1991) directed by the world-famous cinematographer Sven Nykvist. Skarsgård did his first (but small) role in an big American film with The Unbearable Lightness of Being (1988). The role of Captain Tupolev in The Hunt for Red October (1990) was at supposed to be biggest part in a Hollywood-film, but unfortunately it was cut down. His breakthrough instead came with Lars von Trier's Breaking the Waves (1996) opposite newcomer Emily Watson. After that Skarsgård got several supporting roles in American films, such as in My Son the Fanatic (1997), Gus Van Sant's Good Will Hunting (1997) and Steven Spielberg's Amistad (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDUzOTY0N15BMl5BanBnXkFtZTYwNjYxODE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001745","name":"Stellan Skarsgård","nicknames":["Skarzie"],"idIMDB":"nm0001745"},"actorId":"nm0001745","character":"Erik Selvig","urlCharacter":"http://www.imdb.com/character/ch0188124","main":true},{"actorName":"Alice Krige","urlProfile":"http://www.imdb.com/name/nm0000481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDk5NDQ3M15BMl5BanBnXkFtZTYwNzcwNTk2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1954","placeOfBirth":" Upington, South Africa","birthName":"Alice Maud Krige","height":"5' 5\" (1.65 m)","bio":"Alice Maud Krige was born on June 28, 1954 in Upington, South Africa where her father, Dr. Louis Krige, worked as a young physician. The Kriges later moved to Port Elizabeth where Alice grew up in what she describes as a \"very happy family\", a family that also included two brothers (both of whom became physicians) and her mother, Pat, a clinical psychologist. Interestingly, Alice also grew up without television, something which the actress calls a \"huge black hole in my education\" (South Africa did not start getting television until 1976, a year after Alice left the country to pursue an acting career in London). While growing up, she had no dreams or aspirations of pursuing an acting career, in fact as a child she had wanted to become a dancer, but her father disapproved. Instead, she prepared to follow in the footsteps of her mother by attending Rhodes University in Grahamstown where she pursued an undergraduate degree in psychology and literature (graduating in 1975). However, as luck or fate would have it, Alice decided to \"take up a bit of timetable\" by enrolling in a drama class in order to make use of a free credit. This decision would prove to be a life-altering one, resulting in an honors degree in drama from Rhodes, a move to London and a new career path. As Alice explains, \"I really got into it and it took over my life... it became my life-calling, all consuming.\" After arriving in England, she began three years of study at London's Central School of Speech and Drama. Her first professional acting performance was a tiny television role in a 1979 BBC Play for Today. In 1980, Alice made her feature film debut as Sybil Gordon in the Academy Award winning Best Picture, Chariots of Fire (1981). She then appeared in the television adaptation of Charles Dickens' A Tale of Two Cities (1980), which was followed by her memorable, dual role as the avenging spirit in Ghost Story (1981). Also in 1981, she debuted in a West End theatre production of Bernard Shaw's Arms and the Man, for which she received the honors of both a Plays and Players Award and a Laurence Olivier Award for Most Promising Newcomer. It was this early success in theatre that she decided to focus her career on next by spending some time working with the prestigious Royal Shakespeare Company. During her two seasons with the RSC (1982-83), Alice performed in such productions as \"King Lear\", \"The Tempest\", \"The Taming of the Shrew\" and \"Cyrano de Bergerac\". After her stint with the Royal Shakespeare Company, she returned to work in film and television. Her career could best be described as an eclectic mix of both mediums. She appeared in a diverse range of films, such as King David (1985), Barfly (1987), Haunted Summer (1988), Spies Inc. (1992) and See You in the Morning (1989). Her work in television included critically acclaimed miniseries, such as Ellis Island (1984) and Wallenberg: A Hero's Story (1985), as well as a healthy dose of what Alice herself calls, \"kitchen sink dramas\". This eclectic trend continued into the 1990s. In addition to numerous roles in television (including appearances on Beverly Hills, 90210 (1990) and Becker (1998), Alice also appeared in the films Sleepwalkers (1992), Institute Benjamenta, or This Dream That One Calls Human Life (1995), Donor Unknown (1995), Amanda (1996), Twilight of the Ice Nymphs (1997), Habitat (1997), The Commissioner (1998) and Molokai (1999). However, one notable standout was the film First Contact (1996) for which she won a 1997 Saturn Award for her portrayal of the Borg Queen. This is without a doubt the most commercial, mainstream film with which she has been involved. However, due to the amount of make-up and prosthetics that the role required, Alice claims that even today she is still most recognized from her role in Ghost Story (1981). One obvious and lasting impact of her experience with Star Trek: First Contact has been her initiation into the world of Star Trek/sci-fi conventions. These weekend-long conventions take place all over the United States and Europe (primarily in the United Kingdom and Germany). They feature \"guests\", such as Alice, who give presentations, sign autographs, etc. The new millennium finds her with several new projects to her credit, which include such works as Le petit vampire (2000), the Star Trek: Voyager (1995) series finale \"Endgame\", Attila (2001), Dinotopia (2002), Reign of Fire (2002), Children of Dune (2003), Natalie Wood - Le prix de la gloire (2004) and a recurring guest role in the HBO series Deadwood (2004). Current projects include a film about the life of Julius Caesar, the horror film Silent Hill (2006), Coeurs perdus (2006) and Le contrat (2006). In addition, she continues to make sporadic convention appearances and was recently awarded an honorary doctorate in literature from Rhodes University. Alice Krige is married to writer/director Paul Schoolman, and lives what she describes as an \"itinerant\" lifestyle. Although she and her husband maintain a permanent home in the United States, they spend much of their time living and working abroad.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDk5NDQ3M15BMl5BanBnXkFtZTYwNzcwNTk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000481","name":"Alice Krige","idIMDB":"nm0000481"},"actorId":"nm0000481","character":"Eir","urlCharacter":"http://www.imdb.com/character/ch0479084","main":true}],"seasons":[],"idIMDB":"tt1981115","urlIMDB":"http://www.imdb.com/title/tt1981115","business":{"budget":{"money":"$170,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$85,737,841","country":"USA","day":"10","month":"11","year":"2013","remarks":"3,841 Screens"},{"money":"£8,668,172","country":"UK","day":"03","month":"11","year":"2013","remarks":"510 Screens"},{"money":"HUF 102,559,964","country":"Hungary","day":"17","month":"11","year":"2013","remarks":""},{"money":"$7,461,487","country":"Russia","day":"10","month":"11","year":"2013","remarks":"1,150 Screens"}],"gross":[{"money":"$206,362,140","country":"USA","day":"28","month":"02","year":"2015","remarks":""},{"money":"$206,360,018","country":"USA","day":"13","month":"04","year":"2014","remarks":""},{"money":"$206,344,131","country":"USA","day":"06","month":"04","year":"2014","remarks":""},{"money":"$206,314,559","country":"USA","day":"30","month":"03","year":"2014","remarks":""},{"money":"$206,287,713","country":"USA","day":"23","month":"03","year":"2014","remarks":""},{"money":"$206,246,287","country":"USA","day":"16","month":"03","year":"2014","remarks":""},{"money":"$206,147,943","country":"USA","day":"09","month":"03","year":"2014","remarks":""},{"money":"$205,808,339","country":"USA","day":"23","month":"02","year":"2014","remarks":""},{"money":"$205,517,634","country":"USA","day":"16","month":"02","year":"2014","remarks":""},{"money":"$204,674,790","country":"USA","day":"02","month":"02","year":"2014","remarks":""},{"money":"$204,509,243","country":"USA","day":"26","month":"01","year":"2014","remarks":""},{"money":"$200,766,000","country":"USA","day":"22","month":"12","year":"2013","remarks":""},{"money":"$198,125,000","country":"USA","day":"15","month":"12","year":"2013","remarks":""},{"money":"$193,711,187","country":"USA","day":"08","month":"12","year":"2013","remarks":""},{"money":"$186,705,086","country":"USA","day":"01","month":"12","year":"2013","remarks":""},{"money":"$167,837,000","country":"USA","day":"24","month":"11","year":"2013","remarks":""},{"money":"$146,965,000","country":"USA","day":"17","month":"11","year":"2013","remarks":""},{"money":"$85,737,841","country":"USA","day":"10","month":"11","year":"2013","remarks":""},{"money":"£13,973,977","country":"UK","day":"10","month":"11","year":"2013","remarks":""},{"money":"£8,668,172","country":"UK","day":"03","month":"11","year":"2013","remarks":""},{"money":"$644,783,140","country":"Worldwide","day":"28","month":"02","year":"2015","remarks":""},{"money":"$479,765,000","country":"Worldwide","day":"18","month":"11","year":"2013","remarks":""},{"money":"$327,009,000","country":"Worldwide","day":"11","month":"11","year":"2013","remarks":""},{"money":"$109,400,000","country":"Non-USA","day":"04","month":"11","year":"2013","remarks":""},{"money":"PHP 349,966,374","country":"Philippines","day":"15","month":"12","year":"2013","remarks":""},{"money":"PHP 348,321,152","country":"Philippines","day":"08","month":"12","year":"2013","remarks":""},{"money":"PHP 345,274,057","country":"Philippines","day":"01","month":"12","year":"2013","remarks":""},{"money":"PHP 343,959,657","country":"Philippines","day":"24","month":"11","year":"2013","remarks":""},{"money":"PHP 329,151,389","country":"Philippines","day":"17","month":"11","year":"2013","remarks":""},{"money":"PHP 291,538,606","country":"Philippines","day":"10","month":"11","year":"2013","remarks":""},{"money":"$1,485,608","country":"Portugal","day":"28","month":"02","year":"2015","remarks":""},{"money":"€903,995","country":"Portugal","day":"18","month":"12","year":"2013","remarks":""},{"money":"€897,103","country":"Portugal","day":"11","month":"12","year":"2013","remarks":""},{"money":"€881,214","country":"Portugal","day":"04","month":"12","year":"2013","remarks":""},{"money":"€838,401","country":"Portugal","day":"27","month":"11","year":"2013","remarks":""},{"money":"€752,798","country":"Portugal","day":"20","month":"11","year":"2013","remarks":""},{"money":"€620,975","country":"Portugal","day":"13","month":"11","year":"2013","remarks":""},{"money":"€394,524","country":"Portugal","day":"06","month":"11","year":"2013","remarks":""},{"money":"$35,835,927","country":"Russia","day":"17","month":"04","year":"2014","remarks":""}],"weekendGross":[{"money":"$10,322","country":"USA","day":"13","month":"04","year":"2014","remarks":"16 Screens"},{"money":"$22,933","country":"USA","day":"06","month":"04","year":"2014","remarks":"35 Screens"},{"money":"$16,833","country":"USA","day":"30","month":"03","year":"2014","remarks":"41 Screens"},{"money":"$24,449","country":"USA","day":"23","month":"03","year":"2014","remarks":"59 Screens"},{"money":"$50,751","country":"USA","day":"16","month":"03","year":"2014","remarks":"100 Screens"},{"money":"$91,472","country":"USA","day":"09","month":"03","year":"2014","remarks":"148 Screens"},{"money":"$255,421","country":"USA","day":"23","month":"02","year":"2014","remarks":"199 Screens"},{"money":"$371,845","country":"USA","day":"16","month":"02","year":"2014","remarks":"212 Screens"},{"money":"$105,227","country":"USA","day":"02","month":"02","year":"2014","remarks":"121 Screens"},{"money":"$167,296","country":"USA","day":"26","month":"01","year":"2014","remarks":"153 Screens"},{"money":"$1,328,000","country":"USA","day":"22","month":"12","year":"2013","remarks":"1,116 Screens"},{"money":"$2,700,000","country":"USA","day":"15","month":"12","year":"2013","remarks":"2,264 Screens"},{"money":"$4,811,545","country":"USA","day":"08","month":"12","year":"2013","remarks":"3,074 Screens"},{"money":"$11,085,296","country":"USA","day":"01","month":"12","year":"2013","remarks":"3,286 Screens"},{"money":"$14,117,000","country":"USA","day":"24","month":"11","year":"2013","remarks":"3,713 Screens"},{"money":"$38,454,000","country":"USA","day":"17","month":"11","year":"2013","remarks":"3,841 Screens"},{"money":"$85,737,841","country":"USA","day":"10","month":"11","year":"2013","remarks":"3,841 Screens"},{"money":"£2,979,564","country":"UK","day":"10","month":"11","year":"2013","remarks":"520 Screens"},{"money":"£8,668,172","country":"UK","day":"03","month":"11","year":"2013","remarks":"510 Screens"},{"money":"PHP 77,195","country":"Philippines","day":"15","month":"12","year":"2013","remarks":"3 Screens"},{"money":"PHP 354,146","country":"Philippines","day":"08","month":"12","year":"2013","remarks":"10 Screens"},{"money":"PHP 1,595,630","country":"Philippines","day":"01","month":"12","year":"2013","remarks":"21 Screens"},{"money":"PHP 7,580,700","country":"Philippines","day":"24","month":"11","year":"2013","remarks":"140 Screens"},{"money":"PHP 26,418,818","country":"Philippines","day":"17","month":"11","year":"2013","remarks":"146 Screens"},{"money":"PHP 65,619,137","country":"Philippines","day":"10","month":"11","year":"2013","remarks":"242 Screens"}],"admissions":[{"money":"159,427","country":"Portugal","day":"18","month":"12","year":"2013","remarks":""},{"money":"157,955","country":"Portugal","day":"11","month":"12","year":"2013","remarks":""},{"money":"154,991","country":"Portugal","day":"04","month":"12","year":"2013","remarks":""},{"money":"146,841","country":"Portugal","day":"27","month":"11","year":"2013","remarks":""},{"money":"131,303","country":"Portugal","day":"20","month":"11","year":"2013","remarks":""},{"money":"108,128","country":"Portugal","day":"13","month":"11","year":"2013","remarks":""},{"money":"67,373","country":"Portugal","day":"06","month":"11","year":"2013","remarks":""}],"productionDates":{"money":null,"country":null,"day":"14","month":"12","year":"2012","remarks":null},"filmingDates":null,"copyrightHolder":"Marvel"},"technical":{"runtime":["1 hr 52 min (112 min)"],"soundMix":["Dolby Digital","Datasat","Dolby Atmos"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus 4:3, Panavision C-, G-Series, ATZ and AWZ2 Lenses","Canon EOS 5D Mark II, Canon Lenses (second unit: crash camera)","Phantom Flex, Panavision G-Series Lenses (high-speed shots)","Red Epic, Panavision G-Series Lenses (some shots)"],"laboratory":["Technicolor, Hollywood (CA), USA (digital intermediate)"],"filmLength":["3,070 m (7 reels)"],"negativeFormat":["Codex ARRIRAW (2.8K)","Redcode RAW (5K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3514DI)","D-Cinema (also 3-D version)"]},"rating":"7.0","metascore":"54","filmingLocations":[{"location":"Shepperton Studios, Shepperton, Surrey, England, UK"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Comic-to-Film Motion Picture","names":[]},{"category":"Best Supporting Actor","names":[{"name":"Tom Hiddleston","id":"nm1089991","role":null}]},{"category":"Best Costumes","names":[{"name":"Wendy Partridge","id":"nm0664069","role":null}]},{"category":"Best Special Effects","names":[{"name":"Jake Morrison","id":"nm0607172","role":null},{"name":"Paul Corbould","id":"nm0179274","role":null},{"name":"Mark Breakspear","id":"nm0106421","role":null}]},{"category":"Best Make-Up","names":[{"name":"Karen Cohen","id":"nm1751832","role":null},{"name":"David White","id":"nm1396895","role":null},{"name":"Elizabeth Yianni-Georgiou","id":"nm0947958","role":null}]}]}]},{"award":"Acapulco Black Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Hollywood Award","categories":[{"category":"Artist of the Year","names":[{"name":"Idris Elba","id":"nm0252961","role":null},{"name":"Mandela: Long Walk to Freedom","id":"tt2304771","role":null},{"name":"Pacific Rim","id":"tt1663662","role":null}]}]}]},{"award":"BET Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actor","names":[{"name":"Idris Elba","id":"nm0252961","role":null},{"name":"Mandela: Long Walk to Freedom","id":"tt2304771","role":null}]}]}]},{"award":"Empire Awards, UK 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Tom Hiddleston","id":"nm1089991","role":null}]}]}]},{"award":"Golden Schmoes Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Golden Schmoes","categories":[{"category":"Coolest Character of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Action TV Spot","names":[{"name":"Walt Disney Studios Motion Pictures","id":null,"role":null},{"name":"Marvel Studios","id":null,"role":null},{"name":"Create Advertising Group","id":null,"role":null}]}]}]},{"award":"Huading Award 2015","titlesAwards":[{"titleAwardOutcome":"Won Huading Award","categories":[{"category":"Best Global Actor in a Motion Picture","names":[{"name":"Chris Hemsworth","id":"nm1165110","role":null}]}]}]},{"award":"IGN Summer Movie Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Comic Book Adaptation Movie","names":[]}]}]},{"award":"MTV Movie Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Shirtless Performance","names":[{"name":"Chris Hemsworth","id":"nm1165110","role":null}]},{"category":"Best Hero","names":[{"name":"Chris Hemsworth","id":"nm1165110","role":null}]},{"category":"Favorite Character","names":[{"name":"Tom Hiddleston","id":"nm1089991","role":null}]}]}]},{"award":"People's Choice Awards, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Year End Movie","names":[]}]}]},{"award":"Rondo Hatton Classic Horror Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Rondo Statuette","categories":[{"category":"Best Film","names":[{"name":"Alan Taylor","id":"nm0851930","role":null}]}]}]},{"award":"Russian National Movie Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Georges Award","categories":[{"category":"Best Foreign Action of the Year","names":[]},{"category":"Best Foreign Duo of the Year","names":[{"name":"Chris Hemsworth","id":"nm1165110","role":null},{"name":"Tom Hiddleston","id":"nm1089991","role":null}]}]}]},{"award":"St. Louis Film Critics Association, US 2013","titlesAwards":[{"titleAwardOutcome":"Nominated SLFCA Award","categories":[{"category":"Best Visual Effects","names":[]}]}]},{"award":"Teen Choice Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Sci-Fi/Fantasy","names":[]},{"category":"Choice Movie Actor: Sci-Fi/Fantasy","names":[{"name":"Chris Hemsworth","id":"nm1165110","role":null}]},{"category":"Choice Movie Actress: Sci-Fi/Fantasy","names":[{"name":"Natalie Portman","id":"nm0000204","role":null}]}]}]}],"votes":"438,268","type":"Movie","companyCreditsSimple":[{"idCompany":"co0051941","name":"Marvel Studios"}],"keywords":{"keywords":["open ended","end of the world","adopted brother","funeral","warrior","weapon","portal","arrest","army","scientist","murder","fight","revenge","elf","abandoned factory","intern","battle","alien superhero","death of adoptive mother","adoptive mother adoptive son relationship","cliffhanger ending","hammer as weapon","fistfight","marvel cinematic universe","fake injury","ruse","flock of starlings","force field","caught in the rain","car keys","falling object","levitation","public nudity","astrophysicist","male nudity","body armor","sparring","raven","cityscape","starts with narration","genocide","bound in chains","no opening credits","self sacrifice","disguise","handcuffs","eye patch","heir","adopted son","library","showdown","car accident","invisibility","knight","science fantasy","dark fantasy","surprise during end credits","surprise after end credits","prisoner","bridge","x rayed skeleton","restaurant","statue","good versus evil","fictional war","village","female warrior","action heroine","tough girl","female soldier","one man army","tough guy","action hero","cave","prison guard","palace","throne","planet","turned to stone","betrayal","hologram","vortex","sorcerer","prince","family relationships","husband wife relationship","waterfall","drunkenness","tavern","babe scientist","map","observatory","lightning","rainstorm","heavy rain","race against time","fighter jet","alien race","parasite","human alien","teleportation","warrior race","space travel","outer space","laser gun","spacecraft","giant creature","giant monster","giant","see you in hell","shot in the back","stabbed in the leg","violence","spear","hammer","axe","threatened with a knife","dagger","axe fight","sword fight","brawl","mixed martial arts","battlefield","combat","megalomaniac","world domination","exploding ship","exploding car","marvel entertainment","final showdown","martial arts","epic battle","hand to hand combat","opening action scene","crushed by a car","hit by a car","soldier","shapeshifting","woman slaps a man","face slap","eaten alive","monster","scene after end credits","scene during end credits","faked death","crushed to death","body landing on a car","character repeating someone else's dialogue","cameo","mental institution","double impalement","impalement","invasion","shot to death","shot in the chest","exploding body","spaceship","chase","subtitled scene","death","super strength","prison escape","funeral pyre","returning character killed off","death of wife","queen","king","stabbed in the side","infection","supernatural power","stonehenge","american abroad","cell phone","explosion","flashback","date","earth viewed from space","neck breaking","stabbed to death","stabbed in the back","stabbed in the chest","mother son relationship","3 dimensional","grenade","severed arm","london england","facial scar","knife","severed hand","prison","deception","magic","illusion","hit with a hammer","creature","transformation","news report","pixilated nudity","bare chested male","blockbuster","sword","voice over narration","father son relationship","brother brother relationship","superhero","second part","based on comic","marvel comics","norse mythology","based on comic book","sequel","death of mother","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:11:39"}}