{"data":{"movies":[{"title":"Noah","originalTitle":"","year":"2014","releaseDate":"20140328","directors":[{"name":"Darren Aronofsky","id":"nm0004716"}],"writers":[{"name":"Darren Aronofsky","id":"nm0004716"},{"name":"Ari Handel","id":"nm0359504"}],"runtime":"138 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNThkMjExYTEtMGYyNi00MWIzLThkNGQtMTM3YzBkZjFhZGI3XkEyXkFqcGdeQXVyMjQ2MTk1OTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Drama"],"plot":"Noah unquestioningly follows the command of the world's creator to undertake a momentous mission before an apocalyptic flood cleanses the cursed lands of mankind.","simplePlot":"A man is chosen by his world's creator to undertake a momentous mission before an apocalyptic flood cleanses the world.","actors":[{"actorName":"Russell Crowe","urlProfile":"http://www.imdb.com/name/nm0000128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTExNTMxOF5BMl5BanBnXkFtZTcwNDg1NzkzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1964","placeOfBirth":" Wellington, New Zealand","birthName":"Russell Ira Crowe","height":"5' 11½\" (1.82 m)","bio":"Russell Ira Crowe was born in Wellington, New Zealand, to Jocelyn Yvonne (Wemyss) and John Alexander Crowe, both of whom catered movie sets. His maternal grandfather, Stanley Wemyss, was a cinematographer. Crowe's recent ancestry includes Welsh (where his paternal grandfather was born, in Wrexham), English, Irish, Scottish, Norwegian, Swedish, and Maori (one of Crowe's maternal great-grandmothers, Erana Putiputi Hayes Heihi, was Maori). Crowe's family moved to Australia when he was a small child, and Russell got the acting bug early in life. Beginning as a child star on a local Australian TV show, Russell's first big break came with two films ... the first, Romper Stomper (1992), gained him a name throughout the film community in Australia and the neighboring countries. The second, The Sum of Us (1994), helped put him on the American map, so to speak. Sharon Stone heard of him from Romper Stomper (1992) and wanted him for her film, Mort ou vif (1995). But filming on The Sum of Us (1994) had already begun. Sharon is reported to have held up shooting until she had her gunslinger-Crowe, for her film. With Mort ou vif (1995) under his belt as his first American film, the second was offered to him soon after. Virtuosity (1995), starring Denzel Washington, put Russell in the body of a Virtual Serial Killer, Sid6.7 ... a role unlike any he had played so far. Virtuosity (1995), a Sci-Fi extravaganza, was a fun film and, again, opened the door to even more American offers. L.A. Confidential (1997), Russell's third American film, brought him the US fame and attention that his fans have felt he deserved all along. Missing the Oscar nod this time around, he didn't seem deterred and signed to do his first film with The Walt Disney Company, Mystery, Alaska (1999). He achieved even more success and awards for his performances in Gladiator (2000) and A Beautiful Mind (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTExNTMxOF5BMl5BanBnXkFtZTcwNDg1NzkzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000128","name":"Russell Crowe","nicknames":["Rusty","Russ"],"idIMDB":"nm0000128"},"actorId":"nm0000128","character":"Noah","urlCharacter":"http://www.imdb.com/character/ch0031818","main":true},{"actorName":"Jennifer Connelly","urlProfile":"http://www.imdb.com/name/nm0000124","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTczNTgzODYyMF5BMl5BanBnXkFtZTcwNjk4ODk4Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1970","placeOfBirth":" Catskill Mountains, New York, USA","birthName":"Jennifer Lynn Connelly","height":"5' 6½\" (1.69 m)","bio":"Jennifer Connelly was born in the Catskill Mountains, New York, to Ilene (Schuman), a dealer of antiques, and Gerard Connelly, a clothing manufacturer. Her father had Irish and Norwegian ancestry, and her mother was from a Jewish immigrant family. Jennifer grew up in Brooklyn Heights, just across the Brooklyn Bridge from Manhattan, except for the four years her parents spent in Woodstock, New York. Back in Brooklyn Heights, she attended St. Ann's school. A close friend of the family was an advertising executive. When Jennifer was ten, he suggested that her parents take her to a modeling audition. She began appearing in newspaper and magazine ads (among them \"Seventeen\" magazine), and soon moved on to television commercials. A casting director saw her and introduced her to Sergio Leone, who was seeking a young girl to dance in his gangster epic Il était une fois en Amérique (1984). Although having little screen time, the few minutes she was on-screen were enough to reveal her talent. Her next role after that was an episode of the British horror anthology TV series Tales of the Unexpected (1979) in 1984. After Leone's movie, horror master Dario Argento signed her to play her first starring role in his thriller Phenomena (1985). The film made a lot of money in Europe but, unfortunately, was heavily cut for American distribution. Around the same time, she appeared in the rock video \"I Drove All Night,\" a Roy Orbison song, co-starring Jason Priestley. She released a single called \"Monologue of Love\" in Japan in the mid-1980s, in which she sings in Japanese a charming little song with semi-classical instruments arrangement. On the B-side is \"Message Of Love,\" which is an interview with music in background. She also appeared in television commercials in Japan. She enrolled at Yale, and then transferred two years later to Stanford. She trained in classical theater and improvisation, studying with the late drama coach Roy London, Howard Fine, and Harold Guskin. The late 1980s saw her starring in a hit and three lesser seen films. Amongst the latter was her roles in Étoile (1989), as a ballerina and in Some Girls (1988), where she played a self-absorbed college freshman. The hit was Labyrinth (1986), released in 1986. Jennifer got the job after a nationwide talent search for the lead in this fantasy directed by Jim Henson and produced by George Lucas. Her career entered in a calm phase after those films, until Dennis Hopper, who was impressed after having seen her in \"Some Girls\", cast Jennifer as an ingénue small-town girl in The Hot Spot (1990), based upon the 1950s crime novel \"Hell Hath No Fury\". It received mixed critical reviews, but it was not a box office success. The Rocketeer (1991), an ambitious Touchstone super-production, came to the rescue. The film was an old-fashioned adventure flick about a man capable of flying with rockets on his back. Critics saw in \"Rocketeer\" a top-quality movie, a homage to those old films of the 1930s in which the likes of Errol Flynn starred. After \"Rocketeer,\" Jennifer made Career Opportunities (1991), The Heart of Justice (1992), Mulholland Falls (1996), and Inventing the Abbotts (1997). In 1998, she was invited by director Alex Proyas to make Dark City (1998), a strange, visually stunning science-fiction extravaganza. In this movie, Jennifer played the main character's wife, and she delivered an acclaimed performance. The film itself didn't break any box-office record but received positive reviews. This led Jennifer to a contract with Fox for the television series The $treet (2000), a main part in the memorable and dramatic love-story Waking the Dead (2000) and, more important, a breakthrough part in the polemic and applauded independent Requiem for a Dream (2000), a tale about the haunting lives of drug addicts and the subsequent process of decadence and destruction. In \"Requiem for a Dream,\" Jennifer had her career's most courageous, difficult part, a performance that earned her a Spirit Award Nomination. She followed this role with Pollock (2000), in which she played Pollock's mistress, Ruth Klingman. Most recently, Ron Howard chose her to co-star with Russell Crowe in A Beautiful Mind (2001), the film that tells the true story of John Nash, a man who suffered from mental illness but eventually beats this and wins the Nobel Prize in 1994. Jennifer played Nash's wife and won a Golden Globe, BAFTA, AFI and Oscar as Best Supporting Actress. Jennifer lives in New York. She is 5'7\", and speaks fluent Italian and French. She enjoys physical activities such as swimming, gymnastics, and bike riding. She is also an outdoors person -- camping, hiking and walking, and is interested in quantum physics and philosophy. She likes horses, Pearl Jam, SoundGarden, Jesus Jones, and occasionally wears a small picture of the The Dalai Lama on a necklace. Her favorite colors are cobalt blue, forest green, and \"very pale green/gray -- sort of like the color of the sea\". She likes to draw.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTczNTgzODYyMF5BMl5BanBnXkFtZTcwNjk4ODk4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000124","name":"Jennifer Connelly","nicknames":["Jenny C"],"idIMDB":"nm0000124"},"actorId":"nm0000124","character":"Naameh","urlCharacter":"http://www.imdb.com/character/ch0034756","main":true},{"actorName":"Ray Winstone","urlProfile":"http://www.imdb.com/name/nm0935653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTM2MTU1OV5BMl5BanBnXkFtZTcwNDAzNTQyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1957","placeOfBirth":" Hackney, London, England, UK","birthName":"Raymond Andrew Winstone","height":"5' 10\" (1.78 m)","bio":"Ray Winstone was born on February 19, 1957, in Hackney Hospital in London, England, to Margaret (Richardson) and Raymond J. Winstone. He moved to Enfield, at age seven, where his parents had a fruit and vegetable business. He started boxing at the age of twelve at the famous Repton Amateur Boxing Club, was three times London Schoolboy Champion and fought twice for England, UK. In ten years of boxing, he won over 80 medals and trophies. Ray studied acting at the Corona School before being cast by director Alan Clarke as Carlin in the BBC Play production of Scum (1979). He has appeared in numerous TV series over the past 20 years including Robin Hood (1984), Palmer (1991), Birds of a Feather (1989), Between the Lines (1992), Ghostbusters of East Finchley (1995), Births, Marriages and Deaths (1999), and Vincent (2005). His film career has burgeoned since his award-winning role in Gary Oldman's Nil by Mouth (1997), and he has appeared in multiple films including Fanny and Elvis (1999), Tim Roth's The War Zone (1999), The Departed (2006), Hugo (2011), and Snow White and the Huntsman (2012). Known for his signature gritty voice, Winstone has also done a number of voiceover roles including Rango (2011), The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005), as well as the Beowulf (2007) film and video games. He married Elaine Winstone in 1979, and the couple have three children: Lois Winstone (born 1982), a singer with the London-based hip-hop group \"Crack Village\" who also played his on-screen daughter in Last Orders (2001) and got a part in four episodes of The Bill (1984), Jaime Winstone (born 1985) also an actress with ambitions to be a director, and Ellie Rae Winstone (born 2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTM2MTU1OV5BMl5BanBnXkFtZTcwNDAzNTQyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935653","name":"Ray Winstone","idIMDB":"nm0935653"},"actorId":"nm0935653","character":"Tubal-cain","urlCharacter":"http://www.imdb.com/character/ch0420604","main":true},{"actorName":"Anthony Hopkins","urlProfile":"http://www.imdb.com/name/nm0000164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk1NTc5Ml5BMl5BanBnXkFtZTYwMjAwOTI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1937","placeOfBirth":" Margam, Port Talbot, West Glamorgan, Wales, UK","birthName":"Philip Anthony Hopkins","height":"5' 8½\" (1.74 m)","bio":"Anthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre, invited by Laurence Olivier, who could see the talent in Hopkins. In 1967, he made his first film for television, A Flea in Her Ear (1967). From this moment on, he enjoyed a successful career in cinema and television. In 1968, he worked on The Lion in Winter (1968) with Timothy Dalton. Many successes came later, and Hopkins' remarkable acting style reached the four corners of the world. In 1977, he appeared in two major films: A Bridge Too Far (1977) with James Caan, Gene Hackman, Sean Connery, Michael Caine, Elliott Gould and Laurence Olivier, and Maximilian Schell. In 1980, he worked on The Elephant Man (1980). Two good television literature adaptations followed: Othello (1981) and The Hunchback of Notre Dame (1982). In 1987 he was awarded with the Commander of the order of the British Empire. This year was also important in his cinematic life, with 84 Charing Cross Road (1987), acclaimed by specialists. In 1993, he was knighted. In the 1990s, Hopkins acted in movies like Desperate Hours (1990) and Howards End (1992), The Remains of the Day (1993) (nominee for the Oscar), Legends of the Fall (1994), Nixon (1995) (nominee for the Oscar), Surviving Picasso (1996), Amistad (1997) (nominee for the Oscar), The Mask of Zorro (1998), Meet Joe Black (1998) and Instinct (1999). His most remarkable film, however, was The Silence of the Lambs (1991), for which he won the Oscar for Best Actor. He also got a B.A.F.T.A. for this role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk1NTc5Ml5BMl5BanBnXkFtZTYwMjAwOTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000164","name":"Anthony Hopkins","nicknames":["Tony"],"idIMDB":"nm0000164"},"actorId":"nm0000164","character":"Methuselah","urlCharacter":"http://www.imdb.com/character/ch0042497","main":true},{"actorName":"Emma Watson","urlProfile":"http://www.imdb.com/name/nm0914612","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODE2NTMxMV5BMl5BanBnXkFtZTgwOTIzOTQzMjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1990","placeOfBirth":" Paris, France","birthName":"Emma Charlotte Duerre Watson","height":"5' 5\" (1.65 m)","bio":"Emma Charlotte Duerre Watson was born in Paris, France, to English parents, Jacqueline Luesby and Chris Watson, both lawyers. She moved to Oxfordshire when she was five, where she attended the Dragon School. From the age of six, Emma knew that she wanted to be an actress and, for a number of years, she trained at the Oxford branch of Stagecoach Theatre Arts, a part-time theatre school where she studied singing, dancing and acting. By the age of ten, she had performed and taken the lead in various Stagecoach productions and school plays. In 1999, casting began for Harry Potter and the Sorcerers (2001), the film adaptation of British author J.K. Rowling's bestselling novel. Casting agents found Emma through her Oxford theatre teacher. After eight consistent auditions, producer David Heyman told Emma and fellow applicants, Daniel Radcliffe and Rupert Grint, that they had been cast for the roles of the three leads, Hermione Granger, Harry Potter and Ron Weasley. The release of Harry Potter and the Sorcerer's Stone (2001) was Emma's cinematic screen debut. The film broke records for opening-day sales and opening-weekend takings and was the highest-grossing film of 2001. Critics praised the film and the performances of the three leading young actors. The highly distributed British newspaper, 'The Daily Telegraph', called her performance \"admirable\". Later, Emma was nominated for five awards for her performance in the film, winning the Young Artist Award for Leading Young Actress in a Feature Film. After the release of the first film of the highly successful franchise, Emma became one of the most well-known actresses in the world. She continued to play the role of Hermione Granger for nearly ten years, in all of the following Harry Potter films: Harry Potter and the Sorcerer's Stone (2001), Harry Potter and the Chamber of Secrets (2002), Harry Potter and the Prisoner of Azkaban (2004), Harry Potter and the Goblet of Fire (2005), Harry Potter and the Order of the Phoenix (2007), Harry Potter and the Half-Blood Prince (2009), Harry Potter and the Deathly Hallows: Part 1 (2010), and Harry Potter and the Deathly Hallows: Part 2 (2011). Emma acquired two Critics' Choice Award nominations from the Broadcast Film Critics Association for her work in Harry Potter And The Prisoner Of Azkaban and Harry Potter And The Goblet Of Fire. The completion of the seventh and eight movies saw Emma receive nominations in 2011 for a Nickelodeon Kids' Choice Award, and for Best Actress at the Jameson Empire Awards. The Harry Potter franchise won the BAFTA for Outstanding British Contribution to Cinema in February 2011. 2011 saw Emma in Simon Curtis's My Week With Marilyn (2011), alongside a stellar cast of Oscar nominees including Michelle Williams as Marilyn Monroe and Kenneth Branagh as Sir Laurence Olivier, in addition to Eddie Redmayne, Dame Judi Dench, Dougray Scott, Zoe Wanamaker, Toby Jones and Dominic Cooper. Chronicling a week in Marilyn Monroe's life, the film featured Emma in the supporting role of Lucy, a costume assistant to Colin Clark (Redmayne). The film was released by The Weinstein Company and was nominated for a Golden Globe for Best Motion Picture - Comedy or Musical. In 2012 Emma was seen in Stephen Chbosky's adaptation of his coming-of-age novel The Perks Of Being A Wallflower (2012), starring opposite Logan Lerman and Ezra Miller. This independent drama centered around Charlie (Lerman), an introverted freshman who is taken under the wings of two seniors (Watson and Miller) who welcome him to the real world. The film premiered at the 2012 Toronto International Film Festival and received rave reviews. The film won the People's Choice Award for Favourite Dramatic Movie and Emma also picked up the People's Choice Award for Favourite Dramatic Movie Actress. Emma was awarded a second time for this role with the Best Supporting Actress Award at the San Diego Film Critics Society Awards where the film also won the Best Ensemble Performance Award. In summer 2013, Emma starred in Sofia Coppola's American satirical black comedy crime film, The Bling Ring (2013). The film took inspiration from real events and followed a group of teenagers who, obsessed with fashion and fame, burgled the homes of celebrities in Los Angeles. The film opened the Un Certain Regard section of the 2013 Cannes Film Festival. Emma also appeared in a cameo role as herself in Seth Rogen's apocalypse comedy This Is The End (2013). The film tells the story about what happens to some of Hollywood's best loved celebrities when the apocalypse strikes during a party at James Franco's house. Emma was most recently seen in Darren Aronofsky's Noah (2014) opposite Russell Crowe, Jennifer Connelly, Ray Winstone, Douglas Booth, Logan Lerman and Anthony Hopkins. The film told the epic, biblical tale of Noah and the ark. Emma plays the role of Ila, a young woman who develops a close relationship with Noah's son, Shem (Booth). Noah has made an outstanding $300m since its release in March. Emma has completed filming her next project, Regression, written and directed by Alejandro Amenábar. Emma will star in the thriller opposite Oscar nominated Ethan Hawke. Set in Minnesota 1990, Regression tells the story of Detective Bruce Kenner (Hawke) who investigates the case of young Angela, played by Emma, who accuses her father of sexual abuse. The film is expected to be released in 2015. Emma will next play Kelsea Glynn in the film adaptation of The Queen Of The Tearling, Erika Johansen's page-turner of a novel about a young woman raised by foster parents in a cottage hidden away in a remote forest. On her 19th birthday, Kelsea is removed from her home to take her rightful place as sovereign of a fictional post-Utopian country that hides dark secrets and is menaced by a neighboring monarch. The screenplay for The Queen Of The Tearling has been written by Mark L. Smith. David Heyman will be producing the film and Emma will also serve as an executive producer. David and Emma worked together on all the Harry Potter films. The producer snapped up the rights to J.K. Rowling's Harry Potter series very early, before publication; and he and Warner Bros have done the same thing with the Tearling trilogy. Filming is due to commence next year. In 2012, Emma was honored with the Calvin Klein Emerging Star Award at the ELLE Women in Hollywood Awards. In 2013, Emma was awarded the Trailblazer Award at the MTV Movie Awards in April and was honored with the GQ Woman of the Year Award at the GQ Awards in September. Further to her acting career, Emma is a Goodwill Ambassador for the UN, promoting gender equality and the empowerment of women. Emma graduated from Brown University in May 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODE2NTMxMV5BMl5BanBnXkFtZTgwOTIzOTQzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0914612","name":"Emma Watson","nicknames":["Em"],"idIMDB":"nm0914612"},"actorId":"nm0914612","character":"Ila","urlCharacter":"http://www.imdb.com/character/ch0307348","main":true},{"actorName":"Logan Lerman","urlProfile":"http://www.imdb.com/name/nm0503567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzI3MjEzN15BMl5BanBnXkFtZTcwMzI5NzAwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1992","placeOfBirth":" Beverly Hills, Los Angeles, California, USA","birthName":"Logan Wade Lerman","height":"5' 9\" (1.75 m)","bio":"Logan was born in Beverly Hills, to a Jewish family. His parents are Lisa (Goldman), who works as his manager, and Larry Lerman, an orthotist and businessman. He has two siblings, Lindsey and Lucas, both older. His relatives operate the orthotics and prosthetics company Lerman & Son, which was founded by his great-grandfather, Jacob Lerman. When he was two and a half years old, Logan told his mother that he wanted to be an actor. At the age of four, Logan had an agent and was booked for two commercials. His first appearance on the big screen was as William, the youngest son of Mel Gibson's character in The Patriot (2000). Also in 2000, he appeared with the same actor (Gibson), this time as the younger version of his character Nick Marshall, in What Women Want (2000). After a small role in 2001's Riding in Cars with Boys (2001), he starred in John Grisham's A Painted House (2003). Logan played the younger version of Ashton Kutcher's character, Evan, in The Butterfly Effect (2004). After making his small screen debut in a guest-starring role in 10-8: Officers on Duty (2003), he stared as Bobby (Robert) McCallister in the WB Network's series Jack & Bobby (2004), where he portrayed a teenager who will be a future president of the United States. After the show's cancellation in 2005, Logan returned to film, starring in the family adventure Hoot (2006). The next year, he played the son of Walter Sparrow (Jim Carrey) in the dark thriller The Number 23 (2007), and co-starred with Russell Crowe and Christian Bale in the well-reviewed Western remake 3:10 to Yuma (2007). His next two roles were playing a foul-mouthed private school student in the comedy Meet Bill (2007) and a younger version of actor George Hamilton in the period drama My One and Only (2009). Both were independent films that received limited releases. Also in 2009, Logan appeared with Gerard Butler in the R-rated action thriller Gamer (2009), as a teenager who controls Butler's character in a real-life video game. In 2010, Logan played the title character in the fantasy adventure Percy Jackson & the Olympians: The Lightning Thief (2010), giving him notice among a wider audience. Subsequently, he starred as D'Artagnan in a remake of Les Trois Mousquetaires (2011), headlined The Perks of Being a Wallflower (2012), a film adaptation of the 1999 book of the same name, had a supporting role in the independent film Stuck in Love (2012), and returned to star in Percy Jackson: Sea of Monsters (2013). His first 2014 role was in the epic Biblical film Noah (2014), playing one of the title character's sons, Ham; the film grossed over $100 million at the North American box office. Logan next starred with Brad Pitt, Shia LaBeouf, Jon Bernthal, and Michael Peña in the World War II-set action drama Fury (2014); in the film, he played one of several American soldiers engaged in tank combat against the German forces, during the last weeks of the Nazi regime. In 2016, Logan starred in the 1950s-set drama Indignation (2016), playing Marcus Messner, a Jewish student from New Jersey who attends a midwestern college. Written and directed by James Schamus, the film is an adaptation of Philip Roth's 2008 novel. When Logan is not working, he likes to play soccer and baseball. He is an LA Lakers fan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzI3MjEzN15BMl5BanBnXkFtZTcwMzI5NzAwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0503567","name":"Logan Lerman","nicknames":["Loggie"],"idIMDB":"nm0503567"},"actorId":"nm0503567","character":"Ham","urlCharacter":"http://www.imdb.com/character/ch0044496","main":true},{"actorName":"Douglas Booth","urlProfile":"http://www.imdb.com/name/nm3150488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM3NDE4MTMtZDQwOC00NGNkLWEwMGMtZGQ5NzZhMjI1MDE1L2ltYWdlXkEyXkFqcGdeQXVyMjMzMDc2ODM@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1992","placeOfBirth":" Greenwich, London, England, UK","birthName":"Douglas John Booth","height":"6' 1\" (1.85 m)","bio":"Douglas John Booth is an English actor. Booth was born in London, England, the son of Vivien (De Cala), an artist, and Simon Booth, who works in shipping for Citigroup. He has appeared on English television as (Christopher and His Kind (2011), Great Expectations (2011)), starred in the film Romeo & Juliet (2013), and played Shem, one of the sons of Noah, in Noah (2014). More recently, he played Harry Villiers in The Riot Club (2014) and Titus Abrasax in Jupiter Ascending (2015). Booth was educated at at Solefield School, a boys independent school in Sevenoaks, Kent, followed by Bennett Memorial Diocesan School, and Lingfield Notre Dame School, an independent school in Lingfield, Surrey. His mother is of half Spanish and half Dutch ancestry, and his father is of English descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczM2NmMDAtOTY4Yy00ZjZlLWFmOTQtYTM2MDgyMjlhODU0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3150488","name":"Douglas Booth","nicknames":["Doug"],"idIMDB":"nm3150488"},"actorId":"nm3150488","character":"Shem","urlCharacter":"http://www.imdb.com/character/ch0046209","main":true},{"actorName":"Nick Nolte","urlProfile":"http://www.imdb.com/name/nm0000560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODAzMDk3Ml5BMl5BanBnXkFtZTYwOTEzMzE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1941","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Nicholas King Nolte","height":"6' (1.83 m)","bio":"Nick Nolte was born in Omaha, Nebraska, to Helen (King) and Franklin Arthur Nolte, who worked in irrigation pump sales. He has German and British Isles ancestry. Nolte began his career on stage at the Pasadena (California) Playhouse and in regional theatre productions. His breakthrough role was in the TV mini-series Rich Man, Poor Man (1976), playing the role of \"Tom/Tommy Jordache\". Nick Nolte said that when he played a young man in the early scenes of the project, he weighed about 160 pounds. When he played a middle aged man in the later scenes, he weighed over 180 pounds.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODAzMDk3Ml5BMl5BanBnXkFtZTYwOTEzMzE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000560","name":"Nick Nolte","idIMDB":"nm0000560"},"actorId":"nm0000560","character":"Samyaza","urlCharacter":"http://www.imdb.com/character/ch0405033","main":true},{"actorName":"Mark Margolis","urlProfile":"http://www.imdb.com/name/nm0546797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzMzMjk1N15BMl5BanBnXkFtZTcwOTQyNDgyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1939","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 10¾\" (1.8 m)","bio":"He was born in Philadelphia, Pennsylvania, in 1939 and attended Temple University briefly before moving to New York where he studied drama with Stella Adler and at Actors Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzMzMjk1N15BMl5BanBnXkFtZTcwOTQyNDgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0546797","name":"Mark Margolis","idIMDB":"nm0546797"},"actorId":"nm0546797","character":"Magog","urlCharacter":"http://www.imdb.com/character/ch0405033","main":true},{"actorName":"Kevin Durand","urlProfile":"http://www.imdb.com/name/nm0243806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTA3Mzg3Nl5BMl5BanBnXkFtZTgwNDk1NTUwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1974","placeOfBirth":" Thunder Bay, Ontario, Canada","birthName":"Kevin Serge Durand","height":"6' 6\" (1.98 m)","bio":"Kevin Durand was born on January 14, 1974 in Thunder Bay, Ontario, Canada as Kevin Serge Durand. He is an actor, known for X-Men Origins: Wolverine (2009), Real Steel (2011) and I Am Number Four (2011). He has been married to Sandra Cho since October 1, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTA3Mzg3Nl5BMl5BanBnXkFtZTgwNDk1NTUwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0243806","name":"Kevin Durand","nicknames":["Tree"],"idIMDB":"nm0243806"},"actorId":"nm0243806","character":"Rameel","urlCharacter":"http://www.imdb.com/character/ch0425481","main":true},{"actorName":"Leo McHugh Carroll","urlProfile":"http://www.imdb.com/name/nm5162411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzAzMjk5MV5BMl5BanBnXkFtZTgwODYwMTcwMDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Leo and his twin brother Lucas are the youngest of five children including older brothers Vincent and Xavier, and only sister Tori. Born 5/5/2000 in Chicago, Illinois, Leo resides across the lake from the city on the Southwest shore of Michigan. Leo's interest in acting began as a preschooler when he joined the cast of The Music Man with his siblings. He has continued to enjoy acting throughout his elementary school years as he landed roles in various community theater productions commercials and film. In 2007 Leo played the role of \"giggling boy\" in Fred Claus (2007) starring Vince Vaughn. In 2012 Leo was cast by Darren Aronofsky as Japheth in the Paramount production of Noah (2014). In 2013, Leo received rave reviews as Romeo in the Night Blue Theater production of Romeo and Juliet. Leo attends a Montessori Elementary school run by his mother and aunt where he is an excellent student who enjoys basketball, sailing, snow and water skiing, tennis, running, and swimming. Leo looks forward to high school and his next movie role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzAzMjk5MV5BMl5BanBnXkFtZTgwODYwMTcwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5162411","name":"Leo McHugh Carroll","idIMDB":"nm5162411"},"actorId":"nm5162411","character":"Japheth","urlCharacter":"http://www.imdb.com/character/ch0046211","main":true},{"actorName":"Marton Csokas","urlProfile":"http://www.imdb.com/name/nm0190744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTcyNDEyMV5BMl5BanBnXkFtZTgwMjMzMzYyNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1966","placeOfBirth":" Invercargill, New Zealand","height":"6' 1¼\" (1.86 m)","bio":"Marton was born in Invercargill, Aotearoa, to Margaret Christine (Rayner), a nurse, and Márton Csókás, a mechanical engineer. His father is Hungarian and his mother is Australian (of English, Irish, and Danish origin). He inherited some of his talents from his father, a trained opera singer and at one time, a trapeze artist in the Hungarian Circus. His academic training began at Canterbury University, Christchurch, New Zealand, where he commenced a Bachelor of Arts degree, majoring in Art History, and then transferred to, Te Kura Toi Whakaari o Aotearoa/ The New Zealand Drama School, graduating in December, 1989. His first acting role was in Te Whanau a Tuanui Jones by Apairana Taylor at the Taki Rua Theatre in Wellington New Zealand, (1990). He has since had an eclectic career of theatre, television and film. He appeared in the 1994 movie Jack Brown Genius (1996) in which he played the role of Dennis. After starring for 2 years in the New Zealand soap opera Shortland Street (1992), he starred in the 1996 movie Broken English (1996) as Darko. After performing in a great number of theatrical plays, writing his own and co-founding his own theatre company, the Stronghold Theatre, Marton got the role of Tarlus in an episode of Hercules: The Legendary Journeys (1995). After that, he continued working with Renaissance Pictures, playing the roles of Khrafstar and Borias in the 1997-1998 seasons of Xena: Warrior Princess (1995). He continued appearing in many other shows in both NZ and Australia, such as Farscape (1999), BeastMaster, le dernier des survivants (1999), Brigade des mers (1996), Cleopatra 2525 (2000), and more, returning for the role of Borias in three episodes of the 2000-2001 season of Xena: Warrior Princess (1995). He was also in many movies produced in NZ and Australia, such as Hurrah (1998), Cercle intime (2000) and the mini-series The Farm (2001). He is a citizen of the European Union and Hungary, and is a permanent resident of the United States. Most recently, Csokas starred opposite Denzel Washington in Sony's hit film The Equalizer. He played a brutal fixer for the Russian mafia and a formidable villain to Washington's reluctant hero. Csokas appeared in Darren Aronofsky's Noah as well as Robert Rodriguez's Sin City: A Dame to Kill For, a sequel to the 2005 hit film Sin City. Csokas also played the psychiatrist, \"Dr. Kafka,\" in the hit movie sequel, The Amazing Spiderman 2, alongside Andrew Garfield, Emma Stone and Jamie Foxx. Csokas most famously starred as \"Lord Celeborn\" in one of the highest-grossing film series of all time, Peter Jackson's Lord of the Rings trilogy. Some of his other film credits include 2010's The Debt opposite Jessica Chastain and Paul Greengrass' The Bourne Supremacy with Matt Damon. His depth of experience is illustrated in Asylum in which he starred opposite Natasha Richardson and Ian McKellen, as well as the Ridley Scott epic, Kingdom of Heaven, with Jeremy Irons, Brendan Gleeson and Liam Neeson. On the small screen, Csokas recently starred on the History Channel's miniseries Sons of Liberty as well as Discovery Channel's miniseries Klondike with Tim Roth and Sam Shepard. On stage, Csokas continues to work internationally, most recently starring in a production of Lillian Hellman's \"Little Foxes\" at The New York Theatre Workshop by acclaimed director, Ivo van Hove. The play was noted by Time Magazine as one of the \"Top 10 of Everything of 2010.\" The actor has numerous classical credits, including 'Orsino' in Shakespeare's \"Twelfth Night\" at the National Theatre of Great Britain, 'Anthony' in \"Anthony and Cleopatra\" at the Theatre of a New Audience, 'Brutus' in \"Julius Caesar\" and as 'Septimus' in Tom Stoppard's \"Arcadia\" in his birthplace of New Zealand. On the Australian stage, Csokas has appeared as 'George' in \"Who's Afraid of Virginia Woolf,\" directed by Benedict Andrews of the Schaubuhne Theatre in Berlin and in \"Riflemind,\" directed by Phillip Seymour Hoffman at the Sydney Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTcyNDEyMV5BMl5BanBnXkFtZTgwMjMzMzYyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0190744","name":"Marton Csokas","idIMDB":"nm0190744"},"actorId":"nm0190744","character":"Lamech","urlCharacter":"http://www.imdb.com/character/ch0416772","main":true},{"actorName":"Finn Wittrock","urlProfile":"http://www.imdb.com/name/nm1587729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTMzMzQzN15BMl5BanBnXkFtZTgwNDAxODcwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1984","placeOfBirth":" Lenox, Massachusetts, USA","height":"5' 9\" (1.75 m)","bio":"Finn Wittrock was born in Lenox, Massachusetts, to Kate Claire Crowley, a professor of occupational therapy, and Peter Wittrock, an actor and voice teacher. Finn grew up near the stage of Shakespeare and Company, where his father worked. He made his Broadway debut as Happy in \"Death of a Salesman\", directed by Mike Nichols. Recently he has also appeared at the Goodman Theatre opposite Diane Lane in Tennessee Williams's \"Sweet Bird of Youth\", directed by David Cromer, and alongside Sarah Wayne Callies in The Guardsman, directed by Gregory Mosher at The Kennedy Center. Off-Broadway he starred in Tony Kushner's play \"The Illusion\" at the Signature Theatre. Shortly after graduating from Juilliard, he played Romeo at the Shakespeare Theatre In DC, and Marchbanks in Bernard Shaw's \"Candida\" at the Berkshire Theatre Festival. His 2014 films included Winter's Tale (2014), Noah (2014), and Unbroken (2014). On television, he appeared in Masters of Sex (2013) on Showtime as well as The Normal Heart (2014) on HBO. Wittrock originated the role of Damon on All My Children (1970), and has made appearances on shows such as Criminal Minds (2005), Harry's Law (2011), CSI: Miami (2002), Cold Case (2003), and ER (1994). He attended the Los Angeles County High School for the Arts. He is a member of The Mechanicals Theatre Group in Los Angeles, where he has also directed. His screenplay The Submarine Kid (2015), which he wrote with lifelong friend Eric Bilitch, has been turned into a film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTMzMzQzN15BMl5BanBnXkFtZTgwNDAxODcwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1587729","name":"Finn Wittrock","nicknames":["Finn"],"idIMDB":"nm1587729"},"actorId":"nm1587729","character":"Young Tubal-cain","urlCharacter":"http://www.imdb.com/character/ch0420604","main":true},{"actorName":"Madison Davenport","urlProfile":"http://www.imdb.com/name/nm1956478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY4MmY0NDctMDE5Yi00OGIyLTlmYTQtZDc3Y2E3M2JkYThkL2ltYWdlXkEyXkFqcGdeQXVyNjIwNzY0Ng@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1996","placeOfBirth":" San Antonio, Texas, USA","birthName":"Madison Danielle Davenport","height":"5' 3\" (1.6 m)","bio":"Madison Danielle Davenport was born in San Antonio, Texas. She started her career in 2005 when she had a small role in Conversations with Other Women. Soon after she appeared in the television series Numb3rs, Close to Home, CSI: NY, and Hot Properties. In 2006, Davenport's voice could be heard in Over the Hedge as Quillo, one of the porcupines in the film. She also had a guest starring role in Bones as Megan, a little girl who helps Temperance Brennan and Seeley Booth. Davenport appeared in Legion of Super Heroes and While the Children Sleep in 2007. In 2008, Davenport was seen in ER and also had a voice over appearance in Special Agent Oso as Stacey & Fiona. She also had many film credits in 2008 including Humboldt County, Kit Kittredge: An American Girl, The Attic Door and Christmas Is Here Again. In 2010, Davenport starred in the Lifetime television movie Amish Grace, as Mary Beth Graber, a little girl who dies in a school shooting. She also played Destiny in Jack and the Beanstalk, and had a leading role in the television movie Dad's Home as Lindsay Westman. In 2011, Davenport had a guest appearance in CSI: Crime Scene Investigation as Camryn Pose, and began a recurring role in the U.S. television series Shameless. She played the supporting role of Hannah in the 2012 film The Possession. Davenport played Na'el, a potential romantic partner of Ham (Logan Lerman), in the biblical epic film Noah, alongside Russell Crowe, Anthony Hopkins, Jennifer Connelly, and Emma Watson. The 2014 film was directed by Darren Aronofsky.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY4MmY0NDctMDE5Yi00OGIyLTlmYTQtZDc3Y2E3M2JkYThkL2ltYWdlXkEyXkFqcGdeQXVyNjIwNzY0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1956478","name":"Madison Davenport","idIMDB":"nm1956478"},"actorId":"nm1956478","character":"Na'el","urlCharacter":"http://www.imdb.com/character/ch0425486","main":true},{"actorName":"Gavin Casalegno","urlProfile":"http://www.imdb.com/name/nm3918709","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGVjYTQ1MDAtYjdhNC00MjAyLWE5YzQtYTM1MWY2ZThiN2Q5L2ltYWdlXkEyXkFqcGdeQXVyMjMyOTg0NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1999","placeOfBirth":"","height":"6' (1.83 m)","bio":"Gavin began acting at the age of 7. He has since starred in feature films such as Darren Aronofsky's \"Noah\" alongside Russell Crowe, Anthony Hopkins and Jennifer Connelly. He can be seen on a recent episode of \"The Vampire Diaries\" as \"Young Damon\", as well as numerous commercials and print campaigns for national retailers/magazines. He has trained and studied with several of the most highly regarded acting coaches and casting directors in the industry and has developed a great emotional range and memorization skills in the process. When Gavin is not acting, he can be found on the soccer field. He is also an honor roll student and enjoys spending time with his family and friends when time allows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGVjYTQ1MDAtYjdhNC00MjAyLWE5YzQtYTM1MWY2ZThiN2Q5L2ltYWdlXkEyXkFqcGdeQXVyMjMyOTg0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3918709","name":"Gavin Casalegno","idIMDB":"nm3918709"},"actorId":"nm3918709","character":"Young Shem","urlCharacter":"http://www.imdb.com/character/ch0046209","main":true}],"seasons":[],"idIMDB":"tt1959490","urlIMDB":"http://www.imdb.com/title/tt1959490","business":{"budget":{"money":"$125,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$43,720,472","country":"USA","day":"30","month":"03","year":"2014","remarks":"3,567 Screens"},{"money":"HUF 68,145,853","country":"Hungary","day":"30","month":"03","year":"2014","remarks":"52 Screens"},{"money":"€2,665,566","country":"Italy","day":"13","month":"04","year":"2014","remarks":"853 Screens"}],"gross":[{"money":"$101,160,529","country":"USA","day":"15","month":"06","year":"2014","remarks":""},{"money":"$101,044,092","country":"USA","day":"08","month":"06","year":"2014","remarks":""},{"money":"$99,877,650","country":"USA","day":"11","month":"05","year":"2014","remarks":""},{"money":"$99,025,287","country":"USA","day":"04","month":"05","year":"2014","remarks":""},{"money":"$97,314,552","country":"USA","day":"27","month":"04","year":"2014","remarks":""},{"money":"$93,277,129","country":"USA","day":"20","month":"04","year":"2014","remarks":""},{"money":"$84,975,242","country":"USA","day":"13","month":"04","year":"2014","remarks":""},{"money":"$72,386,905","country":"USA","day":"06","month":"04","year":"2014","remarks":""},{"money":"$43,720,472","country":"USA","day":"30","month":"03","year":"2014","remarks":""},{"money":"$320,014,552","country":"worldwide","day":"27","month":"04","year":"2014","remarks":""},{"money":"€2,665,566","country":"Italy","day":"13","month":"04","year":"2014","remarks":""}],"weekendGross":[{"money":"$61,203","country":"USA","day":"15","month":"06","year":"2014","remarks":"103 Screens"},{"money":"$93,834","country":"USA","day":"08","month":"06","year":"2014","remarks":"136 Screens"},{"money":"$502,108","country":"USA","day":"11","month":"05","year":"2014","remarks":"477 Screens"},{"money":"$900,538","country":"USA","day":"04","month":"05","year":"2014","remarks":"929 Screens"},{"money":"$2,283,681","country":"USA","day":"27","month":"04","year":"2014","remarks":"1,604 Screens"},{"money":"$5,003,303","country":"USA","day":"20","month":"04","year":"2014","remarks":"2,537 Screens"},{"money":"$7,553,607","country":"USA","day":"13","month":"04","year":"2014","remarks":"3,282 Screens"},{"money":"$17,045,744","country":"USA","day":"06","month":"04","year":"2014","remarks":"3,571 Screens"},{"money":"$43,720,472","country":"USA","day":"30","month":"03","year":"2014","remarks":"3,567 Screens"},{"money":"€2,665,566","country":"Italy","day":"13","month":"04","year":"2014","remarks":"853 Screens"}],"admissions":[{"money":"240,803","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":{"money":null,"country":null,"day":"30","month":"09","year":"2013","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"20","month":"07","year":"2012","remarks":null},{"money":null,"country":null,"day":"17","month":"11","year":"2012","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["2 hr 18 min (138 min)"],"soundMix":["Datasat","Dolby Digital","Dolby Atmos","Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa Plus, Zeiss Ultra Prime and Angenieux Optimo Lenses","Arricam LT, Zeiss Ultra Prime and Angenieux Optimo Lenses","Arriflex 435, Angenieux Optimo Lenses","Canon EOS 5D Mark II"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Kodak Vision3 250D 5207, Vision2 100T 5212, Vision3 500T 5219)","Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)","Super 35 (also 3-perf) (source format)"],"printedFilmFormat":["35 mm (spherical)","D-Cinema"]},"rating":"5,8","metascore":"68","filmingLocations":[{"location":"Iceland"}],"rated":"PG-13","awards":[{"award":"Golden Globes, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Original Song - Motion Picture","names":[{"name":"Lenny Kaye","id":"nm0443339","role":null},{"name":"Patti Smith","id":"nm0005446","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Action/Adventure Film","names":[]}]}]},{"award":"Annie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Outstanding Achievement in Animated Effects in a Live Action Production","names":[{"name":"Raul Essig","id":"nm0261419","role":null},{"name":"Karin Cooper","id":"nm2902481","role":null},{"name":"Rick Hankins","id":"nm2014538","role":null},{"name":"Owen Calouro","id":"nm2360902","role":null}]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Drama TV Spot","names":[{"name":"Paramount Pictures","id":null,"role":null},{"name":"Big Picture","id":null,"role":null}]}]}]},{"award":"Hollywood Music In Media Awards (HMMA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated HMMA Award","categories":[{"category":"Best Original Score - Sci-Fi/Fantasy Film","names":[{"name":"Clint Mansell","id":"nm0543739","role":null}]}]}]},{"award":"Hollywood Post Alliance, US 2014","titlesAwards":[{"titleAwardOutcome":"Nominated HPA Awards","categories":[{"category":"Outstanding Sound - Feature Film","names":[{"name":"Craig Henighan","id":"nm0003357","role":null},{"name":"Jill Purdy","id":"nm0700829","role":null},{"name":"Skip Lievsay","id":"nm0509792","role":null},{"name":"Warner Bros. Sound","id":null,"role":null}]}]}]},{"award":"International 3D & Advanced Imaging Society's Creative Arts Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Creative Arts Award","categories":[{"category":"3D Feature - Live Action","names":[]},{"category":"Outstanding Use of 2D to 3D Conversion","names":[]}]}]},{"award":"People's Choice Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Dramatic Movie","names":[]}]}]},{"award":"Satellite Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Art Direction &amp; Production Design","names":[{"name":"Debra Schutt","id":"nm0776897","role":null},{"name":"Mark Friedberg","id":"nm0295004","role":null}]},{"category":"Best Costume Design","names":[{"name":"Michael Wilkinson","id":"nm0929452","role":null}]},{"category":"Best Visual Effects","names":[{"name":"Ben Snow","id":"nm0811240","role":null},{"name":"Burt Dalton","id":"nm0198245","role":null},{"name":"Dan Schrecker","id":"nm0775190","role":null},{"name":"Marc Chu","id":"nm0160860","role":null}]},{"category":"Best Sound (Editing &amp; Mixing)","names":[{"name":"Craig Henighan","id":"nm0003357","role":null},{"name":"Ken Ishii","id":"nm0411004","role":null},{"name":"Skip Lievsay","id":"nm0509792","role":null}]}]}]},{"award":"Seattle Film Critics Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Seattle Film Critics Award","categories":[{"category":"Best Production Design","names":[{"name":"Mark Friedberg","id":"nm0295004","role":"production design"},{"name":"Debra Schutt","id":"nm0776897","role":"set decoration"}]}]}]},{"award":"St. Louis Film Critics Association, US 2014","titlesAwards":[{"titleAwardOutcome":"Nominated SLFCA Award","categories":[{"category":"Best Visual Effects","names":[]}]}]},{"award":"Teen Choice Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actor: Drama","names":[{"name":"Russell Crowe","id":"nm0000128","role":null}]},{"category":"Choice Movie Actress: Drama","names":[{"name":"Emma Watson","id":"nm0914612","role":null}]}]}]},{"award":"Visual Effects Society Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Created Environment in a Photoreal/Live Action Feature Motion Picture","names":[{"name":"Grady Cofer","id":"nm0168819","role":null},{"name":"Dan Wheaton","id":"nm2186209","role":null},{"name":"Susumu Yukuhiro","id":"nm1101190","role":null},{"name":"Ben O'Brien","id":"nm1784097","role":null}]}]}]},{"award":"Yoga Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Yoga Award","categories":[{"category":"Worst Foreign Film","names":[{"name":"Darren Aronofsky","id":"nm0004716","role":null}]}]}]}],"votes":"208 155","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0021592","name":"Regency Enterprises"},{"idCompany":"co0062935","name":"Protozoa Pictures"}],"keywords":{"keywords":["water","wrath of god","ark","noah's ark","flood","reference to god","hostage","escape attempt","torch","raft","fire","rescue","army","anti hero","destiny","field","mother son relationship","moral dilemma","boyfriend girlfriend relationship","apocalypse","end of the world","desperation","supernatural power","vision","obsession","brother brother relationship","pregnancy","infertility","axe","berry","woods","husband wife relationship","storytelling","snake","pig","forest","time lapse photography","self sacrifice","family relationships","adopted daughter","adopted sister","orphan","village","campfire","christ allegory","heavy rain","giant creature","creature","giant","ship","no opening credits","tent","dream","underwater scene","mountain","cave","blindness","film starts with text","premonition","survival","brawl","fight","fistfight","good versus evil","warlord","battle","violence","death","stabbed in the shoulder","stabbed in the arm","stabbed in the side","stabbed in the back","stabbed in the chest","explosion","weapon","spear","knife","world creation","eating live animal","animal","dove with a branch in its mouth","white dove","son hits father","father hits son","father son conflict","dysfunctional family","family conflict","stabbed to death","murder","angel","fallen angel","garden of eden","forbidden fruit","snake skin","one word title","loss of father","grandfather grandson relationship","father son relationship","living in a cave","singing in a cave","based on biblical story","miracle","storm","noah","noah's flood","boat","epic","religion","sword and sandal","bible story","old testament","bible","based on the bible","death of father","title spoken by character","character name in title","surrealism","christianity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:58:12"}}