{"data":{"movies":[{"title":"Stash House","originalTitle":"","year":"2012","releaseDate":"20120511","directors":[{"name":"Eduardo Rodriguez","id":"nm1161979"}],"writers":[{"name":"Gary Spinelli","id":"nm0818889"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTQwMTA2OF5BMl5BanBnXkFtZTcwNTYzMDE3Nw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller"],"plot":"A couple love their new house, bought for a steal out of a foreclosure. During their first visit they find illegal drugs stashed in the walls, and they realize this is not their dream house. As they are about to leave, suddenly their exit is blocked by a gun-wielding neighbor Spector and his accomplice. They come to realize the house is hiding more than drugs - it's the operation center for mass drug czar who is buried beneath the floorboards. On the run from the professional killers who want the drugs and evidence, the resourceful couple will need to turn the tables on their attackers to survive.","simplePlot":"Dave and Amy have found the perfect house, until they discover a stash of heroin and end up imprisoned in it by violent thugs.","actors":[{"actorName":"Sean Faris","urlProfile":"http://www.imdb.com/name/nm0267511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGFkN2MzNDktYzE1OC00ZDZjLTgxODMtYTZlNjE2M2ZjOGY3XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1982","placeOfBirth":" Houston, Texas, USA","birthName":"Sean Hardy Faris","height":"6' (1.83 m)","bio":"Sean Hardy Faris was born in Houston, Texas, to Katherine (Miller) and Warren Stephen Faris. His ancestry is English, along with some German, Scottish, and Irish. Faris moved to Ohio at age 12 and has been honing his craft in Los Angeles since moving four years upon his high school graduation. He received an MTV Movie Award for his lead role in Summit Entertainment's hit Never Back Down, and starred as Betty White's grandson and Jennifer Love Hewitt's love interest in the CBS Hallmark Hall of Fame telefilm The Lost Valentine. In addition to his central role in the rugby-inspired feature Forever Strong, he appeared as Dennis Quaid's eldest son in Paramount's hit remake of the classic Yours, Mine & Ours and previously starred as the hunky object of affection in MGM's comedy romp Sleepover. Next on the horizon is the crime thriller Pawn in which he stars opposite Academy Award-winner Forest Whitaker, and the coveted title role in The Story of Bonnie & Clyde. In direct contrast, Faris starred as the lead in FOX's acclaimed drama series Reunion which followed six close friends from their high school graduation to their 20th reunion. He previously led the cast of ABC's dramatic series Life As We Know It. Based upon British author Melvin Burgess' controversial novel Doing It, the acclaimed show chronicled the sexual antics of a group of high school friends in Seattle. For his role as sensitive jock Dino Whitman, he was heralded as a breakout talent by the likes of Daily Variety, The Hollywood Reporter, and USA Today. A more recent foray into television included a multi-episode arc on The CW's top-rated Vampire Diaries. No stranger to television, Faris has also guest-starred on such shows as Smallville, One Tree Hill, and Boston Public. His big screen debut featured him alongside the likes of Ben Affleck and Josh Hartnett in Michael Bay's epic Pearl Harbor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGFkN2MzNDktYzE1OC00ZDZjLTgxODMtYTZlNjE2M2ZjOGY3XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267511","name":"Sean Faris","idIMDB":"nm0267511"},"actorId":"nm0267511","character":"David Nash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Briana Evigan","urlProfile":"http://www.imdb.com/name/nm0263759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mzg1NzY3MV5BMl5BanBnXkFtZTcwMjU5NDE2OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Briana Barbara-Jane Evigan","height":"5' 6\" (1.68 m)","bio":"Briana Evigan was born on October 23, 1986 in Los Angeles, California, USA as Briana Barbara-Jane Evigan. She is an actress, known for Step Up 2: The Streets (2008), Step Up All In (2014) and Sorority Row (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mzg1NzY3MV5BMl5BanBnXkFtZTcwMjU5NDE2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0263759","name":"Briana Evigan","idIMDB":"nm0263759"},"actorId":"nm0263759","character":"Amy Nash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dolph Lundgren","urlProfile":"http://www.imdb.com/name/nm0000185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1957","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Hans Lundgren","height":"6' 5\" (1.96 m)","bio":"Dolph Lundgren was born in Stockholm, Sweden, to Sigrid Birgitta (Tjerneld), a language teacher, and Karl Johan Hugo Lundgren, an engineer and economist for the Swedish government. He lived in Stockholm until the age of 13, when he moved in with his grandparents in Nyland, Ångermanland, Sweden. Despite an early interest in music and the fine arts, Dolph decided to follow in his father's footsteps and pursue an Engineering degree. After having completed his military service, he enrolled at the Royal Institute of Technology in Stockholm. It was in the military when Dolph first came in contact with the martial arts. Five years later, Dolph had become a World-Class competitor in Japanese Karate and was deeply involved with a discipline that was to become an important part of his life. After graduating High School, Dolph spent considerable time studying in the United States and abroad on various academic scholarships. He attended Washington State University and Clemson University in South Carolina. In 1982, he received a scholarship to complete his Masters Degree in Chemical Engineering at the University of Sydney, Australia. In 1983, he was awarded a Fulbright scholarship to the Massachusetts Institute of Technology in Boston, one of the world's top engineering schools. That same year, Dolph decided to move to New York City and take up acting. He started studying drama at the Warren Robertson Theatre Workshop in Manhattan, not knowing how quickly his life was about to change. Dolph's motion picture debut came in the \"James Bond\" feature, A View to a Kill (1985). However, it was his performance in Rocky IV (1985) later that year that definitely got him noticed. After a 9-month audition process among 5,000 hopefuls, he was cast opposite writer-director Sylvester Stallone, as his Russian opponent, \"Ivan Drago\". Following the success of Rocky IV (1985), Lundgren moved to Los Angeles and has since starred in more than thirty feature films. Lundgren portrayed the classic action-heroic lead in such films as Gary Goddard's Masters of the Universe (1987), Showdown in Little Tokyo (1991) co-starring Brandon Lee and Blackjack (1998), by Hong-Kong action legend, John Woo. Lundgren has also continued to turning in memorable performances as the main adversary to other action-stars, most notably in Universal Soldier (1992) opposite Jean-Claude Van Damme, directed by Roland Emmerich, as well as Robert Longo's Johnny Mnemonic (1995) opposite Keanu Reeves. In February 2004, Dolph Lundgren directed his first feature film, the thriller The Defender (2004), in which he also starred. In 2005, he directed and starred in yet another feature, The Russian Specialist (2005) (a.k.a \"The Russian Specialist\"). In January 2006, he finished principal photography of The Final Inquiry (2006), an Italian/American/Spanish co-production, directed by Giulio Base, in which he played against, amongst others, Daniele Liotti, Max von Sydow and F. Murray Abraham. In the fall 2006, Lundgren starred in Diamond Dogs (2007), a Chinese/American co-production filmed on location in Mongolia. In the Spring 2007, he directed a modern day western shot in Texas, Missionary Man (2007). In 2009, he completed two new directorial efforts, the action-packed Command Performance (2009), which showcases Lundgren's longtime musical talents as a drummer; and the neo-noir thriller The Killing Machine (2010). Lundgren also reunited with co-stars Jean-Claude Van Damme and Sylvester Stallone for Universal Soldier: Regeneration (2009) and the highly anticipated action blockbuster, The Expendables (2010). Dolph has managed to not let his Hollywood career stand in the way of his athletic background. He has been awarded his Third Degree Black Belt by the World Karate Organization in Tokyo. His accomplishments include being the Captain of the Swedish National Karate Team, as well as a Champion of the Swedish, European and Australian Heavyweight Division titles. Lundgren still regularly performs Karate exhibitions at international tournaments worldwide. In addition to his Karate expertise, Dolph was selected by the U.S. Olympic Committee to serve as the Team Leader of the 1996 U.S. Olympic Pentathlon Team during the Atlanta Games. He is actively involved in promoting the image of this sport. Lundgren's production company, Thor Pictures, is developing several projects in which he will produce, star and/or direct. He is also a founding member of \"Group of Eight\", a New York theater group started in 1994. Lundgren has also been working on a fitness book and sports wear line for men, the creation and launch of a new Dolph Lundgren brand, a licensing, media and publishing program and the development of future entertainment and media projects. Lundgren is married to Anette Qviberg-Lundgren, an interior decorator and fashion designer. The couple, along with their two daughters, resides in Marbella, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000185","name":"Dolph Lundgren","idIMDB":"nm0000185"},"actorId":"nm0000185","character":"Andy Spector","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Huertas","urlProfile":"http://www.imdb.com/name/nm0005030","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmI1YThmMDgtNGM3ZS00OWM1LTliZmEtMDZkOWU3OGYwZTBhXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"birthName":"Jon William Scott Hofstedt","height":"5' 11\" (1.8 m)","bio":"Jon Huertas was born as Jon William Scott Hofstedt. He is an actor and producer, known for Castle (2009), The Objective (2008) and Right at Your Door (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmI1YThmMDgtNGM3ZS00OWM1LTliZmEtMDZkOWU3OGYwZTBhXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005030","name":"Jon Huertas","idIMDB":"nm0005030"},"actorId":"nm0005030","character":"Ray Jaffe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Holden","urlProfile":"http://www.imdb.com/name/nm0390259","urlPhoto":"","biography":{"bio":"Richard Holden is an actor, known for 12 Years a Slave (2013), This Is the End (2013) and The Grifters (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0390259","name":"Richard Holden","idIMDB":"nm0390259"},"actorId":"nm0390259","character":"Millard Hanson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alyshia Ochse","urlProfile":"http://www.imdb.com/name/nm1865462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4NjI2OTgwMF5BMl5BanBnXkFtZTcwODMwNTY2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1980","placeOfBirth":"","birthName":"Alyshia N. Ochse","height":"5' 6½\" (1.69 m)","bio":"Alyshia Ochse was born on November 2, 1980 as Alyshia N. Ochse. She is an actress and producer, known for True Detective (2014), The Other Woman (2014) and Marauders (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4NjI2OTgwMF5BMl5BanBnXkFtZTcwODMwNTY2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1865462","name":"Alyshia Ochse","idIMDB":"nm1865462"},"actorId":"nm1865462","character":"Trish Garrett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Yesso","urlProfile":"http://www.imdb.com/name/nm0947742","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTYyNDE4N15BMl5BanBnXkFtZTgwNTQ4ODU3OTE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1954","placeOfBirth":" New Orleans, Louisiana, USA","bio":"Don Yesso was born on November 27, 1954 in New Orleans, Louisiana, USA. He is an actor and writer, known for Bad Country (2014), Hocus Pocus (1993) and Fantastic Four (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTYyNDE4N15BMl5BanBnXkFtZTgwNTQ4ODU3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0947742","name":"Don Yesso","idIMDB":"nm0947742"},"actorId":"nm0947742","character":"Benz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Scharpf","urlProfile":"http://www.imdb.com/name/nm0770179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1Mzk3NzE2OV5BMl5BanBnXkFtZTgwNDI2MTY3ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"William Scharpf is known for his work on Now You See Me (2013), Jurassic World (2015) and Looper (2012). He has been married to Brandy Johnson-Scharpf since 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1Mzk3NzE2OV5BMl5BanBnXkFtZTgwNDI2MTY3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0770179","name":"William Scharpf","idIMDB":"nm0770179"},"actorId":"nm0770179","character":"Cop with Crew Cut","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger J. Timber","urlProfile":"http://www.imdb.com/name/nm2502250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NDc3MjQzNF5BMl5BanBnXkFtZTgwMjk2MTIxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1982","placeOfBirth":" Monroe, Louisiana, USA","birthName":"Roger Johann Timber","height":"5' 11\" (1.8 m)","bio":"Roger J. Timber was born on June 14, 1982 in Monroe, Louisiana, USA as Roger Johann Timber. He is known for his work on Black-ish (2014), Shark Island (2015) and Joe Dirt 2: Beautiful Loser (2015). He has been married to Latoya Sharlow since May 29, 2010. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NDc3MjQzNF5BMl5BanBnXkFtZTgwMjk2MTIxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2502250","name":"Roger J. Timber","nicknames":["Johann"],"idIMDB":"nm2502250"},"actorId":"nm2502250","character":"Cop","urlCharacter":"http://www.imdb.com/character/ch0248564","main":true},{"actorName":"Lawrence Turner","urlProfile":"http://www.imdb.com/name/nm1005663","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ5NDM5NTg3Nl5BMl5BanBnXkFtZTgwNjYzMzMzOTE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Lawrence Turner was born in Sulphur, Louisiana, USA. He is a talent agent and actor, known for Free State of Jones (2016), Dallas Buyers Club (2013) and Underground (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ5NDM5NTg3Nl5BMl5BanBnXkFtZTgwNjYzMzMzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1005663","name":"Lawrence Turner","nicknames":["L.T."],"idIMDB":"nm1005663"},"actorId":"nm1005663","character":"Max Farrell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Javier Carrasquillo","urlProfile":"http://www.imdb.com/name/nm2583280","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjU1MTU4OV5BMl5BanBnXkFtZTcwNDMyNzQyNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Javier Carrasquillo is an actor, known for Freelancers (2012), The Baytown Outlaws (2012) and Stash House (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjU1MTU4OV5BMl5BanBnXkFtZTcwNDMyNzQyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2583280","name":"Javier Carrasquillo","idIMDB":"nm2583280"},"actorId":"nm2583280","character":"Cop #1","urlCharacter":"http://www.imdb.com/character/ch0248564","main":true},{"actorName":"Lance E. Nichols","urlProfile":"http://www.imdb.com/name/nm0629634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTMwNTQ3NV5BMl5BanBnXkFtZTgwODQ1OTExMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1955","placeOfBirth":" New Orleans, Louisiana, USA","height":"6' 1\" (1.85 m)","bio":"Distinguished New Orleans actor, Lance Nichols, stars in the Emmy nominated HBO drama series TREME, which follows several New Orleans natives as they try to rebuild their lives after the devastation left behind by Hurricane Katrina. Nichols plays the dentist 'Larry Williams', supportive and devoted husband to 'LaDonna Baptiste-Williams' (Khandi Alexander) and loving father to his two stepchildren. Born in the 12th ward of New Orleans, Nichols grew up attending McDonough 35 and remained in the city through his college years, attending the University of New Orleans in 1973. Having begun as a pre-med major, Nichols knew quickly that this was not his calling. A freshman drama class spurred his decision to change his major, which resulted in a GPA jump and a Bachelors degree in Dramatic Arts and Communications. After attending a national dramatic audition for graduate studies, Nichols was offered entrance into seven different programs. Budget cuts eventually made it impossible for him to attend, however, and he remised to manual labor work, loading trucks for UPS. Not one to give up on his true passion for acting, Nichols made the decision to move to Los Angeles in 1978 where he quickly landed his first on-screen gig on the widely popular game show \"The Dating Game.\" Though love never sparked for him on the show, following his appearance he was fortunate enough to run into another New Orleans native at a Baskin Robbins, whom he married less than a year later. Today, after 31 years of marriage and three children, the couple are still going strong, having battled the plight of Hurricane Katrina not only on the small screen of TREME but also in real life as a working family. Nichols is most widely known for his role as the preacher in the 2008 Academy Award nominated film, THE CURIOUS CASE OF BENJAMIN BUTTON, alongside Brad Pitt and Cate Blanchett. Following the success of this role, Nichols landed a part in the Warner Bros. summer blockbuster THE CAMPAIGN (2012), starring Will Ferrell and Zach Galifianakis. Throughout his 30+ years of acting, spanning from the early 80s to present day, Nichols has made over 75 appearances on multiple award winning and critically acclaimed television series including: CHEERS, MURDER SHE WROTE, MATLOCK, EVERYBODY LOVES RAYMOND and DESPERATE HOUSEWIVES. After a long stint in Los Angeles pursuing his passion, Nichols returned to his roots in New Orleans where he landed a role close to his heart - his current role on TREME. Nichols is currently filming the fourth and final season of TREME and has recently wrapped filming on the feature film adaptation of BEAUTIFUL CREATURES alongside Academy Award nominee Viola Davis and Academy Award winning actress Emma Thompson. When he's not on set, Nichols and wife Zardis stay busy operating Lanzardis Productions, their company that specializes in acting and dialogue coaching. In his free time, Nichols can be found at home in New Orleans with his wife and kids, most likely at a Saints game cheering his team to victory.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTMwNTQ3NV5BMl5BanBnXkFtZTgwODQ1OTExMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629634","name":"Lance E. Nichols","idIMDB":"nm0629634"},"actorId":"nm0629634","character":"Priest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caleb Michaelson","urlProfile":"http://www.imdb.com/name/nm2735492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTUyNTc5N15BMl5BanBnXkFtZTgwMzA2OTIwOTE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Caleb Michaelson is an actor and director, known for Now You See Me (2013), Journey to Promethea (2010) and Supernatural Swamp Slaughter (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTUyNTc5N15BMl5BanBnXkFtZTgwMzA2OTIwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2735492","name":"Caleb Michaelson","idIMDB":"nm2735492"},"actorId":"nm2735492","character":"Paramedic","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Bagneris","urlProfile":"http://www.imdb.com/name/nm3823393","urlPhoto":"","biography":{"bio":"Dennis Bagneris is an actor, known for Vertiges (2014), Stash House (2012) and Free Spirits (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3823393","name":"Dennis Bagneris","idIMDB":"nm3823393"},"actorId":"nm3823393","character":"Fed #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Boyd","urlProfile":"http://www.imdb.com/name/nm1546201","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc0Mjc4NDU0OF5BMl5BanBnXkFtZTgwNzEwMzEyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1967","placeOfBirth":" Tulsa, Oklahoma, USA","birthName":"Sean Christopher Boyd","height":"5' 11\" (1.8 m)","bio":"Sean Boyd was born on January 31, 1967 in Tulsa, Oklahoma, USA as Sean Christopher Boyd. He is an actor, known for Jack Reacher: Never Go Back (2016), Dallas Buyers Club (2013) and The Magnificent Seven (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc0Mjc4NDU0OF5BMl5BanBnXkFtZTgwNzEwMzEyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1546201","name":"Sean Boyd","idIMDB":"nm1546201"},"actorId":"nm1546201","character":"Fed #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1919090","urlIMDB":"http://www.imdb.com/title/tt1919090","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"05","year":"2011","remarks":null},{"money":null,"country":null,"day":"02","month":"06","year":"2011","remarks":null}],"copyrightHolder":"© 2012 Autonomous Films, LLC."},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Canon 5D Mark II","Canon FX 105 (infrared) (second unit)","Red One Camera","Red One MX"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[{"location":"Baton Rouge, Louisiana, USA"}],"rated":"R","awards":[],"votes":"2,221","type":"Movie","companyCreditsSimple":[{"idCompany":"co0166161","name":"After Dark Films"},{"idCompany":"co0217659","name":"Autonomous Films"},{"idCompany":"co0050870","name":"Dark Castle Entertainment"}],"keywords":{"keywords":["die hard scenario","two word title","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:59:40"}}