{"data":{"movies":[{"title":"Innocent","originalTitle":"","year":"2011","releaseDate":"20111129","directors":[{"name":"Mike Robe","id":"nm0730500"}],"writers":[{"name":"Mike Robe","id":"nm0730500"},{"name":"Scott Turow","id":"nm0878017"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM3NjY1ODAxMl5BMl5BanBnXkFtZTgwOTE0ODg1MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Mystery"],"plot":"Twenty years after being cleared in the death of his mistress, Judge Rusty Sabich is charged with the murder of his late wife. During the trial, a secret affair from Rusty's recent past threatens to hamper his defense and fracture his relationship with his son.","simplePlot":"Twenty years after being cleared in the death of his mistress, Judge Rusty Sabich is charged with the murder of his late wife. During the trial, a secret affair from Rusty's recent past ... ","actors":[{"actorName":"Bill Pullman","urlProfile":"http://www.imdb.com/name/nm0000597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mzk2MDEyM15BMl5BanBnXkFtZTgwMTczMDQzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1953","placeOfBirth":" Hornell, New York, USA","birthName":"William James Pullman","height":"6' 1½\" (1.87 m)","bio":"William James Pullman was born in Hornell, New York, one of seven children of Johanna (Blaas), a nurse, and James Pullman, a doctor. He is of Dutch (mother) and English, Northern Irish, and Scottish (father) descent. After high school, Bill went into a building construction program at SUNY Delhi in New York. He transferred to State University of New York College at Oneonta where he received his BA in Theater. He received both his MFA in Theater/Directing and an honorary PHD from University of Massachusetts at Amherst. While teaching Directing at Montana State University in Bozeman, Montana, one of Bill's students was the soon-to-be film director John Dahl, who later cast Mr. Pullman in \"The Last Seduction\". Moving to New York City, he worked with Kathy Bates in the acclaimed stage production of \"Curse of the Starving Class\". However, it was his first work in three strikingly diverse films that brought him to the attention of his audience: \"Ruthless People\" with Danny DeVito and Bette Milder, the Mel Brooks hit \"Spaceballs\" and the Oscar-nominated (and winner for Best Actress Gina Davis) \"The Accidental Tourist\". Still attracted to the art and study of building construction, Bill has designed and/or restored three \"barns\": In Montana, he converted a 1933 barn at his ranch into his family home. In Los Angeles, he built a Truss barn in the style of LA's 1910 fruit storage barns. In western New York State, he restored a '3-bay' barn that sometimes serves as a community center near his hometown of Hornell, New York. Focused more on neighborhoods than show business-based charities and societies, Pullman has defined himself by his work with his local communities. He works to bridge communities of Los Angeles through his board work with Cornerstone Theater. Pullman continues to work with his neighbors who formed \"Concerned Citizens Montana\" to secure a place at the table regarding the national need for a smart grid for energy transmission. He also works with the local university (Alfred University, New York) as well as supports local health services (\"The Pullman Women's Health and Birthing Center\" at St James Hospital, Hornell, NY). Pullman is also an MS Society Ambassador. Based in Los Angeles, New York City and Western Montana, Pullman is married to the dancer, Tamara Hurwitz Pullman, and they have three children, daughter singer/songwriter Maesa Rae, and multi-talented sons Jack and Lewis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mzk2MDEyM15BMl5BanBnXkFtZTgwMTczMDQzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000597","name":"Bill Pullman","idIMDB":"nm0000597"},"actorId":"nm0000597","character":"Rusty Sabich","urlCharacter":"http://www.imdb.com/character/ch0017364","main":true},{"actorName":"Marcia Gay Harden","urlProfile":"http://www.imdb.com/name/nm0001315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5Njg2ODgyNF5BMl5BanBnXkFtZTcwMzkzMjQ3OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1959","placeOfBirth":" La Jolla, California, USA","height":"5' 4½\" (1.64 m)","bio":"Marcia Gay Harden was born on August 14, 1959, in La Jolla, California, the third of five children. Her mother, Beverly (Bushfield), was a homemaker, and her father, Thad Harold Harden, was in the military. The family relocated often -- she first became interested in the theater when the family was living in Greece, and she had attended plays in Athens. Harden began her college education at American universities in Europe and returned to the US to complete her studies at the University of Texas in 1983; went on to earn an MFA at NYU, and, thereafter, embarked on her acting career. Although she had acted in a movie as early as 1986, in the little-known The Imagemaker (1986), her first mainstream role, coming alongside some TV movie work, was as a sultry femme fatale in the Coen Brothers' cleverly offbeat homage to the gangster movie, Miller's Crossing (1990). Harden received good reviews for her sultry performance as Verna, a seductive, trouble-making moll. Harden thereafter worked steadily in supporting roles, including the portrayal of Ava Gardner in Sinatra (1992), a television biopic about Frank Sinatra. Harden also worked in the theater and, in 1993, was part of the Broadway cast of Tony Kushner's \"Angels in America\", playing Harper, the alienated wife of a closeted gay man. It was a demanding dramatic role, and Harden won acclaim for her work, including a Tony award nomination. She returned to movie making in the mid-1990s, continuing to turn in superb supporting performances in films and television. Harden's road to success was a long one, her work generally being overlooked because the productions were either critically panned or ignored by audiences. However, it was just a matter of time before Harden got a chance to truly show her quality on-screen, and that time came in 2000, with Ed Harris's Pollock (2000), in which she played Lee Krasner, artist and long-suffering wife of Jackson Pollock. Harden's performance was deeply moving and unforgettable and earned her the Oscar and New York Film Critic's Circle awards for best supporting actress. Continuing to work prolifically in features and television, she earned another Oscar nomination in 2003 for her supporting role in Clint Eastwood's Mystic River (2003), Harden having earlier worked with Eastwood in 2000's Space Cowboys (2000). Harden's work often makes otherwise mediocre productions worth watching, fully inhabiting any character she portrays. She married Thaddaeus Scheel, with whom she worked on The Spitfire Grill (1996), in 1996 and the couple have three children, a daughter Eulala Scheel and twins Julitta and Hudson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5Njg2ODgyNF5BMl5BanBnXkFtZTcwMzkzMjQ3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001315","name":"Marcia Gay Harden","idIMDB":"nm0001315"},"actorId":"nm0001315","character":"Barbara Sabich","urlCharacter":"http://www.imdb.com/character/ch0017367","main":true},{"actorName":"Richard Schiff","urlProfile":"http://www.imdb.com/name/nm0771493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDE5MzIwNF5BMl5BanBnXkFtZTYwNjgzMDI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1955","placeOfBirth":" Bethesda, Maryland, USA","height":"5' 10\" (1.78 m)","bio":"Richard was the middle of three sons born to Edward, a real estate lawyer, and Charlotte, a cable TV and publishing executive. His parents divorced when he was 12. He dropped out of high school but obtained an equivalency diploma. He tried studying at the City College of New York (CCNY) in 1973, but had no interest. After not bothering to show up for finals, he headed to Colorado where he cut firewood and lived a hippie life. He returned to New York in 1975 and started studying acting at CCNY and eventually was accepted into their theater program. He initially disliked acting and studied to be a director. He directed several off-Broadway plays, including \"Antigone\" with a then just-graduated Angela Bassett in 1983. He also met present wife, Sheila Kelley, during auditions for this play. The two married in 1996. In the mid-1980s, Richard says he conquered his fears and decided to take a stab at acting. He got several TV roles, but he was seen by Steven Spielberg in an episode of the TV drama High Incident (1996). Spielberg then cast him in The Lost World: Jurassic Park (1997) and his career has been on an upward climb ever since that has led to his co-starring role in The West Wing (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDE5MzIwNF5BMl5BanBnXkFtZTYwNjgzMDI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0771493","name":"Richard Schiff","idIMDB":"nm0771493"},"actorId":"nm0771493","character":"Tommy Molto","urlCharacter":"http://www.imdb.com/character/ch0286355","main":true},{"actorName":"Mariana Klaveno","urlProfile":"http://www.imdb.com/name/nm1674570","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzNiOWQ2ZjYtNjAwYS00OThhLWI0MDQtZGE5ODRkOTcyYjVmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1979","placeOfBirth":" Endicott, Washington, USA","height":"5' 10\" (1.78 m)","bio":"Mariana Klaveno (b. 25th October) is an American actress best known for her role as Lorena in HBO's True Blood. She also starred in the feature film While the Children Sleep (released as The Sitter on DVD) in the role of Abby Read in 2007. She's guest starred in TV show episodes of Standoff, ER, and others. She appeared in the HBO Series True Blood, alongside Anna Paquin and Stephen Moyer, in the fifth episode of season one as the vampire Lorena, who turned Bill Compton into a vampire. Her character became a regular with starring credits in the second half of season two and into season three. She was nominated along with the starring cast of True Blood for the \"Outstanding Performance by an Ensemble in a Drama Series\" at the 16th Annual Screen Actors Guild awards in January 2010. Mariana Klaveno grew up in Endicott, Washington on the family owned and operated farm, with her three older siblings. After graduating valedictorian of her high school class, she pursued her B.A. in theatre at the University of Washington in Seattle. She trained there with Jon Jory, erstwhile Artistic Director of Actor's Theatre of Louisville. After graduating with honors, Mariana moved to Los Angeles and continued her training with noted acting coach, Cameron Thor. After a chance meeting with acclaimed Producer\\Director J.J.Abrams, he cast Mariana in Alias, her network television debut. However, it wasn't until her standout guest performance as a modern day Bonnie Parker on Standoff opposite Ron Livingston and Rosemarie DeWitt, that people really began to stop and take notice. Guest star roles followed on ER, K-Ville and Laws of Chance. She also starred in the television movie Final Approach (2007). For the 2010 LA Shorts Film Festival - held at Laemmle Sunset 5 Theaters on Sunset Blvd - Mariana was one of the judges, along with fellow True Blood co-star Carrie Preston. Mariana currently resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzNiOWQ2ZjYtNjAwYS00OThhLWI0MDQtZGE5ODRkOTcyYjVmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1674570","name":"Mariana Klaveno","idIMDB":"nm1674570"},"actorId":"nm1674570","character":"Anna Vostick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Callard Harris","urlProfile":"http://www.imdb.com/name/nm1675076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MjczNTY1MF5BMl5BanBnXkFtZTcwOTg4NDYwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Callard Harris is an actor and director, known for Welcome to the Jungle (2007), The Real St. Nick (2012) and USS Indianapolis: Men of Courage (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MjczNTY1MF5BMl5BanBnXkFtZTcwOTg4NDYwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1675076","name":"Callard Harris","idIMDB":"nm1675076"},"actorId":"nm1675076","character":"Nat Sabich","urlCharacter":"http://www.imdb.com/character/ch0386240","main":true},{"actorName":"Tahmoh Penikett","urlProfile":"http://www.imdb.com/name/nm0671886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjMwMDYyNl5BMl5BanBnXkFtZTcwMDY4ODYyMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1975","placeOfBirth":" Whitehorse, Yukon, Canada","height":"6' 3\" (1.91 m)","bio":"He is the son of former Yukon premier Anthony David John Penikett (Tony). A graduate of the Victoria Motion picture school, Tahmoh also studied at the Lyric School of Acting in Vancouver. Tahmoh and his family (his father, and his twin sisters Sarah and Stephanie) make their home in Vancouver, British Columbia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjMwMDYyNl5BMl5BanBnXkFtZTcwMDY4ODYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671886","name":"Tahmoh Penikett","idIMDB":"nm0671886"},"actorId":"nm0671886","character":"Jimmy Brand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janet Kidder","urlProfile":"http://www.imdb.com/name/nm0452286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzcyMDM3Ml5BMl5BanBnXkFtZTgwMjA0MDIxODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Janet Kidder was born in Toronto, Ontario, Canada. She is an actress, known for La fiancée de Chucky (1998), Ginger Snaps - Résurrection (2004) and Tom Stone (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzcyMDM3Ml5BMl5BanBnXkFtZTgwMjA0MDIxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452286","name":"Janet Kidder","idIMDB":"nm0452286"},"actorId":"nm0452286","character":"Marta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alfred Molina","urlProfile":"http://www.imdb.com/name/nm0000547","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNTgzNzgxNzNeQTJeQWpwZ15BbWU3MDQ5NzU1NjM@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1953","placeOfBirth":" London, England, UK","height":"6' 2½\" (1.89 m)","bio":"Alfred Molina was born in 1953 in London, England. His mother, Giovanna (Bonelli), was an Italian-born cook and cleaner, and his father, Esteban Molina, was a Spanish-born waiter and chauffeur. He studied at the Guildhall School of Music and Drama, London. His stage work includes two major Royal National Theatre productions, Tennessee Williams' \"The Night of the Iguana\" (as Shannon) and David Mamet's \"Speed the Plow\" (as Fox), plus a splendid performance in Yasmina Reza's \"Art\" (his Broadway debut), for which he received a Tony Award nomination in 1998. He made his film debut in Raiders of the Lost Ark (1981) and got a good part in Letter to Brezhnev (1985) (as a Soviet sailor who spends a night in Liverpool), but his movie breakthrough came two years later when he played--superbly--Kenneth Halliwell, the tragic lover of playwright Joe Orton, in Stephen Frears' Prick Up Your Ears (1987). He was also outstanding in Enchanted April (1991), The Perez Family (1995) (as a Cuban immigrant), Anna Karenina (1997) (as Levin) and Chocolat (2000) (as the narrow-minded mayor of a small French town circa 1950s, who tries to shut down a chocolate shop).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNTgzNzgxNzNeQTJeQWpwZ15BbWU3MDQ5NzU1NjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000547","name":"Alfred Molina","nicknames":["Fred"],"idIMDB":"nm0000547"},"actorId":"nm0000547","character":"Sandy Stern","urlCharacter":"http://www.imdb.com/character/ch0017365","main":true},{"actorName":"Nicole Oliver","urlProfile":"http://www.imdb.com/name/nm0646955","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0OTM3NzI1NV5BMl5BanBnXkFtZTgwODEwNTE3MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8¾\" (1.75 m)","bio":"Nicole Lyn Oliver was born in Ottawa, Ontario. She has a Bachelor of Fine Arts degree from York University, a Masters Degree in Communication from Royal Roads University, and additional training from the British American Drama Academy in Oxford and London. She was a prominent member of the Union of BC Performers, she served on its executive board (2002-2005), chaired several committees, and continues to be part of the negotiation team during collective bargaining. She is married to Chris Ainscough, an award-winning composer in the film industry. They live in Vancouver with their two sons William and Grady.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0OTM3NzI1NV5BMl5BanBnXkFtZTgwODEwNTE3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0646955","name":"Nicole Oliver","idIMDB":"nm0646955"},"actorId":"nm0646955","character":"Elaine Reese","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Catherine Lough Haggquist","urlProfile":"http://www.imdb.com/name/nm0521723","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODkyNjQzMV5BMl5BanBnXkFtZTcwNDgxNzE3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Catherine Lough Haggquist is an actress, known for Godzilla (2014), Elysium (2013) and TRON: Legacy (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODkyNjQzMV5BMl5BanBnXkFtZTcwNDgxNzE3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0521723","name":"Catherine Lough Haggquist","idIMDB":"nm0521723"},"actorId":"nm0521723","character":"Detective Rory Gissling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nimet Kanji","urlProfile":"http://www.imdb.com/name/nm1631188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NzY2Njc0N15BMl5BanBnXkFtZTgwMzExNzkzNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Born in Nairobi, Kenya Nimet began acting on stage with the local theatre company. She emigrated to Vancouver, Canada in 1989 where she continued to work on stage. Nimet began her career in film and TV in 2001 and has had the pleasure of working with Edward James Olmos (Battlestar Galactica), Kevin Sorbo (Paradox) and John Cusack (Martian Child) amongst others. Asked if she regretted giving up her day job. She replied \"nope\". She is represented by Lucas Talent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NzY2Njc0N15BMl5BanBnXkFtZTgwMzExNzkzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1631188","name":"Nimet Kanji","idIMDB":"nm1631188"},"actorId":"nm1631188","character":"Judge Malek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom McBeath","urlProfile":"http://www.imdb.com/name/nm0564245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk0MTc5OTY5MF5BMl5BanBnXkFtZTgwNzMwNDIyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Tom McBeath was born in Vancouver, British Columbia, Canada. He is known for his work on Watchmen (2009), Double Jeopardy (1999) and Along Came a Spider (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk0MTc5OTY5MF5BMl5BanBnXkFtZTgwNzMwNDIyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564245","name":"Tom McBeath","idIMDB":"nm0564245"},"actorId":"nm0564245","character":"George Mason","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Ackerman","urlProfile":"http://www.imdb.com/name/nm0009964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjE2Njc5MV5BMl5BanBnXkFtZTgwODAxMjM3NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1968","placeOfBirth":" Unity, Saskatchewan, Canada","height":"5' 10\" (1.78 m)","bio":"Don started his career playing tree number three in the wildly popular Charlie Brown's Christmas at the St. Pete's Elementary School in fourth grade. his young career would be cut short having to bow out of the performance because of stage fright, getting sick only hours before the performance. He would make glorious returns to the stage with the local Little Theatre Productions. This allowed him to get over the stage fright and lead him to many stages from Saskatoon to Toronto to Vancouver to New York. Don has worked in the industry for over 20 years, studying and working with some of the greatest teachers and actors in the world. In NYC, Don attended HB Studios and studied with Carol Rosenfeld and Uta Hagen. Don has expanded his career beyond the stage to various Film and Television projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjE2Njc5MV5BMl5BanBnXkFtZTgwODAxMjM3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0009964","name":"Don Ackerman","idIMDB":"nm0009964"},"actorId":"nm0009964","character":"John Harnason","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jarod Joseph","urlProfile":"http://www.imdb.com/name/nm3523076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODE3MjEzMl5BMl5BanBnXkFtZTcwMjI3MTE1OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Few actors are able to create a diverse and impressive body of work as quickly as Jarod Joseph has. Born in Calgary, Alberta, Jarod grew up as an athlete, excelling in both hockey and basketball. Always the entertainer, Jarod never considered a career in the entertainment industry until a friend pointed out how suited to the business he would be. In 2007, Jarod packed up a few belongings and relocated to Vancouver in hopes of trying his luck as an actor. In a relatively quick manner, Jarod had established himself as a newcomer to watch, securing recurring roles on major American networks. Jarod was first cast in the blockbuster fantasy adventure film Percy Jackson & the Olympians: The Lightning Thief alongside an all-star cast including Sean Bean and Uma Thurman. This break was soon followed by guest star appearances on FOX's Human Target and AMC's The Killing. Jarod's red-hot career continued to build momentum with recurring roles on ABC's fantasy series Once Upon a Time, the J.J Abrams produced, FOX cult hit show Fringe, The CW's hit drama series The LA Complex and a series regular position opposite Thandie Newton, in DirecTV's original series Rogue. Jarod's star is on the rise and there are no signs of it slowing down. IN 2015, Jarod joined the cast of ABC's summer hit Mistresses for the show's third season and recently returned to shooting The CW's futuristic drama The 100 in the role of fan favorite Nathan Miller. He can also be seen starring as the lead on the Canadian series Coded, a role in which he received a UBCP/ACTRA Awards Best Actor nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODE3MjEzMl5BMl5BanBnXkFtZTcwMjI3MTE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3523076","name":"Jarod Joseph","nicknames":["Bobby"],"idIMDB":"nm3523076"},"actorId":"nm3523076","character":"Orestes Mauro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig March","urlProfile":"http://www.imdb.com/name/nm0545285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTAwOTcxNV5BMl5BanBnXkFtZTcwMjA1MjA3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Stephen Craig March","height":"5' 10\" (1.78 m)","bio":"Craig has accumulated over 100 film, television and stage credits with appearances on Wayward Pines, The Killing, Alcatraz, and Fringe, with Guest Star roles on the TV series The Dead Zone, Romeo!, DaVinci's Inquest, Cold Squad and The Chris Isaak Show. Lead roles include the made-for-TV movies, Jinnah on Crime:Pizza 911, Fatal Performance and He Sees You When You're Sleeping. Some of his favorite film credits include The Big White, Along Came a Spider, MVP2 and the indie gems, Even Lambs Have Teeth, Suspension, and The Rhino Brothers. He also has extensive experience on stage playing such diverse roles as Brutus in Julius Caesar and Mitch in A Streetcar Named Desire. His directorial debut, The Beast of Bottomless Lake, for Provost Pictures garnered Best Feature Film at the Mississauga Independent Film Festival as well as the People's Choice Award at the Okanagan International Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTAwOTcxNV5BMl5BanBnXkFtZTcwMjA1MjA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0545285","name":"Craig March","nicknames":["Bear"],"idIMDB":"nm0545285"},"actorId":"nm0545285","character":"Marco Cantu","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1942887","urlIMDB":"http://www.imdb.com/title/tt1942887","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"08","year":"2011","remarks":null},{"money":null,"country":null,"day":"02","month":"09","year":"2011","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Clairmont Cameras and Lenses","Red One Camera, Cooke S4 and Angenieux Optimo Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.4","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"awards":[{"award":"Cinema Audio Society, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated C.A.S. Award","categories":[{"category":"Outstanding Achievement in Sound Mixing for Television Movies and Mini-Series","names":[{"name":"Shane Connelly","id":"nm0175110","role":"production mixer"},{"name":"Mark Hensley","id":"nm0972296","role":"re-recording mixer"},{"name":"Tamara Johnson","id":"nm0004189","role":"re-recording mixer"},{"name":"Tom Brissette","id":"nm3120132","role":"scoring mixer"}]}]}]},{"award":"Directors Guild of Canada 2012","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Craft Award","categories":[{"category":"Production Design - Television Movie/Mini-Series","names":[{"name":"Eric Fraser","id":"nm0292121","role":null}]}]}]}],"votes":"310","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0151542","name":"Mike Robe Productions"}],"keywords":{"keywords":["affair","lawyer","based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:41:13"}}