{"data":{"movies":[{"title":"Standing Up","originalTitle":"","year":"2013","releaseDate":"20130816","directors":[{"name":"D.J. Caruso","id":"nm0142286"}],"writers":[{"name":"D.J. Caruso","id":"nm0142286"},{"name":"Brock Cole","id":"nm4426504"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMzIzMDM2NF5BMl5BanBnXkFtZTcwMTE4MjQ5OQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Based on one of the most beloved Young Adult novels of all time: Two kids are stripped naked and left together on an island in a lake - victims of a vicious summer camp prank; But rather than have to return to camp and face the humiliation, they decide to take off, on the run together. What follows is a three day odyssey of discovery and self-discovery.","simplePlot":"Two kids befriend each other after being left stripped nude in a lake as the victims of an immature summer camp prank. They run away from camp and for three days learn more about each other than they've ever known before.","actors":[{"actorName":"Chandler Canterbury","urlProfile":"http://www.imdb.com/name/nm2425105","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjM4NDQ1MF5BMl5BanBnXkFtZTgwMDY5Mjg0MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1998","placeOfBirth":" Houston, Texas, USA","bio":"Chandler was born and raised in Houston, Texas. He is the middle child of three with an older brother and a younger sister. Chandler has always resided full time in Houston and attends public school despite steadily working in the film industry. Chandler began his film career playing a young version of Seann William Scott in Balls Out: Gary the Tennis Coach (2009). From there, he jumped right in to playing a young version of Brad Pitt in David Fincher's The Curious Case of Benjamin Button (2008). Chandler has worked with many great actors including Cate Blanchett in The Curious Case of Benjamin Button (2008), Forest Whitaker and Jude Law in Repo Men (2010), and Jessica Biel and Ray Liotta in Powder Blue (2009). Chandler moved from supporting actor to a leading actor opposite of Nicolas Cage and Rose Byrne in Knowing (2009). Other leading roles include After.Life (2009) opposite Liam Neeson and Christina Ricci, A Bag of Hammers (2011) opposite Jason Ritter and Rebecca Hall, and The Host (2013) opposite Saoirse Ronan, William Hurt and Diane Kruger. He will soon be seen in Angels Sing (2013) opposite Harry Connick, Jr. and Connie Britton, and Black Eyed Dog (2014) opposite Hilarie Burton and Mackenzie Foy. Chandler has had the opportunity to \"carry\" or \"co-carry\" a few films as well. In the family drama Standing Up (2013) Chandler plays Howie, a boys who escapes the humiliation of being the victim of bullying with his new found friend Grace and teaches that you can stand up and become stronger. Chandler had to change his hair color for Little Red Wagon (2012) playing the real Zach Bonner, extraordinary child philanthropist. Chandler has also done a couple of television guest starring roles including his Young Artist Award winning role on Criminal Minds (2005) and playing Young Peter on Fringe (2008). When Chandler is not acting, the high school freshman loves to hang out with his friends, play video games, run and play guitar.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjM4NDQ1MF5BMl5BanBnXkFtZTgwMDY5Mjg0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2425105","name":"Chandler Canterbury","nicknames":["Chan"],"idIMDB":"nm2425105"},"actorId":"nm2425105","character":"Howie","urlCharacter":"http://www.imdb.com/character/ch0393261","main":true},{"actorName":"Annalise Basso","urlProfile":"http://www.imdb.com/name/nm2399383","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDQzNjIxNl5BMl5BanBnXkFtZTgwMTQ4OTU2NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Annalise Basso (born on December 2, 1998) is an American film and television actress and model. Her older siblings, Alexandria Basso and Gabriel Basso, are also actors. She has starred in the films, Bedtime Stories (2008), Love Takes Wing (2009), Standing Up (2013), and Oculus (2013). From 2014 until 2015, she starred in the television series, The Red Road (2014). Basso is the youngest child of Marcia and Louis J. Basso. Most of her initial roles have been on television commercials or small guest appearances roles on television series. Her first role, that caught the attention of people, was her role as \"Eden Hamby\" on True Blood (2008). In 2009, she played a main role in the television film, \"Love Takes Wing\", from the \"Love Comes Softly\" series. When she was 10, she had a part on Are You Smarter Than a 5th Grader? (2007), as a student. More recently, she has had roles in episodes of New Girl (2011) and Nikita (2010). Basso's first lead role in a feature film was in D.J. Caruso's \"Standing Up\", a coming-of-age story based on the novel, \"The Goats\" by Brock Cole. The film debuted at the 2012 Cannes Film Festival. The story centers on two children, played by Basso and Chandler Canterbury, who are stripped naked and left stranded together on an island, as part of a summer camp prank. In 2014, she starred in the horror film, \"Oculus\", alongside Karen Gillan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDQzNjIxNl5BMl5BanBnXkFtZTgwMTQ4OTU2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2399383","name":"Annalise Basso","nicknames":["Annie"],"idIMDB":"nm2399383"},"actorId":"nm2399383","character":"Grace","urlCharacter":"http://www.imdb.com/character/ch0393262","main":true},{"actorName":"Radha Mitchell","urlProfile":"http://www.imdb.com/name/nm0593664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1973","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Radha Rani Amber Indigo Anunda Mitchell","height":"5' 5¾\" (1.67 m)","bio":"Radha Mitchell (born 12 November 1973) is an Australian actress. She started her career acting in various Australian TV series and movies, and later became known for her appearance in Hollywood films. Mitchell, a native of Melbourne, began acting when she was still in high school and had her professional debut on the popular Australian soap, Les voisins (1985) in 1994. Two years later, she made her film debut in the romantic comedy Love and Other Catastrophes (1996), in which she starred as a college student experiencing a messy breakup. The film proved to be fairly popular in Australia, but it wasn't until she was cast in High Art (1998) that Mitchell gained an introduction to a wider audience. The critical success of \"High Art\" made it possible for her to do more international work, and her increasing popularity was reflected by her subsequent casting in a number of projects. Among them were Pitch Black (2000), a sci-fi horror film in which Mitchell played a pilot whose ship crashes on a hostile planet, and Everything Put Together (2000), a drama where she plays a suburban woman shunned by her peers after the death of her baby. Her career continued with a diverse run of films, including Nobody's Baby (2001), Man on Fire (2004), Finding Neverland (2004), and landing the lead in Woody Allen's Melinda and Melinda (2004). Those last three films all hit the screens in 2004, and although kept working steadily, she never quite capitalized on the buzz she generated that year. Her other credits include Silent Hill (2006), Henry Poole Is Here (2008), Surrogates (2009) and The Crazies (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593664","name":"Radha Mitchell","idIMDB":"nm0593664"},"actorId":"nm0593664","character":"Meg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Val Kilmer","urlProfile":"http://www.imdb.com/name/nm0000174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODIzMDA5Ml5BMl5BanBnXkFtZTcwNDY0NTU4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1959","placeOfBirth":" Los Angeles, California, USA","birthName":"Val Edward Kilmer","height":"5' 11¾\" (1.82 m)","bio":"Val Kilmer was born in Los Angeles, California, to Gladys Swanette (Ekstadt) and Eugene Dorris Kilmer, who was a real estate developer and aerospace equipment distributor. His mother, born in Indiana, was from a Swedish family, and his father was from Texas. Val studied at Hollywood's Professional's School and, in his teens, entered Juilliard's drama program. His professional acting career began on stage, and he still participates in theater; he played Hamlet at the 1988 Colorado Shakespeare Festival. His film debut was in the 1984 spoof Top Secret! (1984), wherein he starred as blond rock idol Nick Rivers. He was in a number of films throughout the 1980s, including the 1986 smash Top Gun (1986). Despite his obvious talent and range, it wasn't until his astonishingly believable performance as Jim Morrison in Oliver Stone's The Doors (1991) that the world sat up and took notice. Kilmer again put his good baritone to use in the movie, performing all of the concert pieces. Since then, he has played two more American legends, Elvis Presley in True Romance (1993) and Doc Holliday in Tombstone (1993). In July 1994, it was announced that Kilmer would be taking over the role of Batman/Bruce Wayne from Michael Keaton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODIzMDA5Ml5BMl5BanBnXkFtZTcwNDY0NTU4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000174","name":"Val Kilmer","idIMDB":"nm0000174"},"actorId":"nm0000174","character":"Hofstadder","urlCharacter":"http://www.imdb.com/character/ch0393263","main":true},{"actorName":"Kate Maberly","urlProfile":"http://www.imdb.com/name/nm0531069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk2NTM3NDM5OF5BMl5BanBnXkFtZTcwODY1NjY2OQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1982","placeOfBirth":" Surrey, England, UK","birthName":"Kate Elizabeth Cameron Maberly","bio":"Born and raised in Surrey in England Kate Maberly started acting aged 8 landing her first major motion picture role as the star of Francis Ford Coppola's \"The Secret Garden\". Directed by Agnieszka Holland, the film achieved international acclaim and has gone on to become a family classic. Following this success Kate came to the States to take on a number of leading roles which included; 'Dinah' in Stephen King's \"The Langoliers\" alongside David Morse and Patricia Wettig; and 'Glumdalclitch' in \"Gulliver's Travels\" with Ted Danson, Kristen Scott Thomas and Mary Steenburgen. Back in England Kate continued to work on various high caliber Period Dramas for the BBC, including; the Bafta-winning \"Anglo-Saxon-Attitudes\" with Kate Winslet and Daniel Craig; the Bafta / Golden Globe-winning \"The Last of the Blond Bombshells\" with Judi Dench and Ian Holm; the Emmy-winning \"Victoria & Albert\", the Bafta-winning \"Daniel Deronda\" directed by Tom Hooper, and the enchanting Hollywood blockbuster \"Finding Neverland\", with Johnny Depp and Dustin Hoffman. She took to the stage as Shakespeare's 'Juliet', and then as 'Mathilde' in Christopher Hampton's \"Total Eclipse\" at the Royal Court Theatre in London, alongside Ben Wishaw and Matthew Macfadyen. Taking some time out to achieve double-honors in Classical Piano and Cello from the prestigious London Conservatoire Trinity College of Music, Kate has also composed and produced her own music, including songs for film. Additionally, whilst in college she produced and directed Music videos, utilizing the facilities of the London Film Schools. Now based in Hollywood, Kate has spent the last few years building a library and developing a slate of high quality features. Her most prominent piece being the post-apocalyptic adventure love story \"The Forest of Hands and Teeth\", based on the New York Times best selling novel by Carrie Ryan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk2NTM3NDM5OF5BMl5BanBnXkFtZTcwODY1NjY2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531069","name":"Kate Maberly","idIMDB":"nm0531069"},"actorId":"nm0531069","character":"Margo Cutter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Carroll","urlProfile":"http://www.imdb.com/name/nm0138954","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDAwNDAyOF5BMl5BanBnXkFtZTgwMDgyMjAzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1952","placeOfBirth":" Los Angeles, California, USA","bio":"Charles Carroll was born on May 12, 1952 in Los Angeles, California, USA. He is an actor, known for Eagle Eye (2008), RoboCop (1987) and Disturbia (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDAwNDAyOF5BMl5BanBnXkFtZTgwMDgyMjAzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0138954","name":"Charles Carroll","idIMDB":"nm0138954"},"actorId":"nm0138954","character":"Mr. Carlson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexus Lapri Geier","urlProfile":"http://www.imdb.com/name/nm4821684","urlPhoto":"","biography":{"bio":"Alexus Lapri Geier is an actress, known for Standing Up (2013), Core: A Short Film About Bullying (2014) and Reed Between the Lines (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4821684","name":"Alexus Lapri Geier","nicknames":["Alix Lapri"],"idIMDB":"nm4821684"},"actorId":"nm4821684","character":"Tiwana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deidra Shores","urlProfile":"http://www.imdb.com/name/nm4710025","urlPhoto":"","biography":{"bio":"Deidra Shores is an actress, known for Standing Up (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4710025","name":"Deidra Shores","idIMDB":"nm4710025"},"actorId":"nm4710025","character":"Lydia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adrian Kali Turner","urlProfile":"http://www.imdb.com/name/nm2648101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MzgyNjc2Ml5BMl5BanBnXkFtZTcwNzcxNzQwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 1\" (1.55 m)","bio":"Adrian Kali Turner is an actor, singer, dancer, writer, entrepreneur and community activist. Adrian is from Atlanta, Georgia and lives in the Los Angeles area where he is pursuing a Bachelors of Fine Arts degree. From portraying the emotionally compelling Duane in The Walking Dead to the hilariously funny and scene stealing Shawn in Bad Teacher, Adrian is a young actor with the skill, range and experience of a heavy-hitter. His acting repertoire includes roles in major film and network projects such as, The Walking Dead (AMC), Bad Teacher (Columbia Pictures), My Name is Khan (Fox Searchlight Pictures), Arrested Development (20th Century Fox), Camp Fred (Nickelodeon Network), iCarly (Nickelodeon), Don't Trust the B _ in Apartment 23 (20th Century Fox) Standing Up and Saving Westbrook High ( Swirl Films). At 9 years old, Adrian earned top recognition for Monologue and Commercial competitions at the Actor's Modeling and Talent Competition and qualified as a finalist for the Best Overall Child Actor award. Soon after moving to Los Angeles, at 10 years old, Adrian received an invitation to join the Screen Actor's Guild. In addition to acting, Adrian is an avid singer, starting out as a soloist for the children's choir at church. While in the children's choir, Adrian developed and honed his rapping and writing skills. He performed on Donna Summer's final album, sang with Jason Mraz and performed with Will.i.am during President Obama's Inaugural Ball celebrations. Adrian was a member of the short-lived boy band, Boyz Crew. He wrote an original piece, which her performed on the Peace in our Hearts CD Project, which is the brainchild of Ms. Hanalea, He also performed alongside international activist, Fred Nassiri for the I Want Peace--the World's First Portal to Peace Organization Project. Adrian is the Owner and CEO of the independent record label, Golden Zed. Under the label, Adrian performs his collection of original music as house/dance music personality - DJ Bludwork. Adrian is active in the community through his charity, \"Toys for Teens.\" Adrian formed this non-profit entity to benefit foster youth in the Atlanta, GA. Also, each year, Adrian emcees the International Earth Day Celebration held in Culver City, CA. He is a regular volunteer for the Star Eco Center in Culer City, CA, ( a rescue center and shelter for abandoned animals) and served as youth ambassador for the US Forestry Campaign aimed at encouraging youth and parents to re-connect with Nature.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MzgyNjc2Ml5BMl5BanBnXkFtZTcwNzcxNzQwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2648101","name":"Adrian Kali Turner","idIMDB":"nm2648101"},"actorId":"nm2648101","character":"Calvin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Tinucci","urlProfile":"http://www.imdb.com/name/nm3597808","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTY1ODkzOV5BMl5BanBnXkFtZTgwMTczMDgxODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1999","placeOfBirth":" Denver, Colorado, USA","height":"5' 10\" (1.78 m)","bio":"Justin Tinucci was born in Denver, Colorado. He started acting at the age of 10. He now lives in Los Angeles, CA where he works in film, television, commercials and music. Justin loves being on set and filming- whether its television, features, commercials or short films. While he has enjoyed all of the projects he's worked on, some of his favorite projects were Trophy Wife The Muppets, Big Love, and iCarly. His most challenging and enjoyable role so far has been the role of \"Butch\" in the feature film Standing Up, written and directed by DJ Caruso. Justin started playing guitar at the age of 11 and has been the lead guitarist for the band Breaking Tempo since June 2013. The band has been on tour visiting high schools to expand their fan base since late 2013. He is consistently busy playing at local venues in Los Angeles and the surrounding states and is known for his energetic performance and strong stage presence. In addition to acting, Justin enjoys indoor skydiving. He is also known for being a professional indoor skydiver. Indoor skydiving is like outdoor skydiving, but you \"fly\" in a wind tunnel rather than jumping out of an airplane. He and his sister Kayla have a wind tunnel team and are called \"Team Future\" they have been widely recognized as the nation's youngest indoor skydiving team and they compete in wind tunnels against skydivers worldwide. Justin is also very involved with several different charities and really enjoys doing hands on charitable work. In 2012 Justin and his sister headed up planning and organizing several major efforts to provide shoes and clothing for kids in need. They later started a kids philanthropic group called \"The Shoe Crew\" which collects and distributes new shoes and clothing for underprivileged kids.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTY1ODkzOV5BMl5BanBnXkFtZTgwMTczMDgxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3597808","name":"Justin Tinucci","idIMDB":"nm3597808"},"actorId":"nm3597808","character":"Butch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith Flippen","urlProfile":"http://www.imdb.com/name/nm0282436","urlPhoto":"","biography":{"bio":"Keith Flippen grew up in Lafayette, LA as an outcast \"geek.\" In 1984, he and his family moved to VA where, to satisfy a school half-credit in the fine arts, Keith studied acting. In the theatre, he discovered a place of acceptance where his years of playing alone with his imagination would be of use. After graduating from Green Run High School, Keith attended VA Tech with the intention of becoming an Aerospace Engineer. Alas, based on his poor grades in Calculus, Keith decided that, if he were to ever design an aircraft, there would be a 40% chance of everyone aboard dying a terrifying and fiery death. He opted to pursue the thing for which he had a natural aptitude - acting. Upon graduation in 1990, Keith studied at the Eugene O'Neil Theatre Center and the Leningrad State Institute of Theatre, Music, and Film as part of a Soviet/American exchange program. There he met his dear friend and Russian \"bother\" Igor Kopilov. After a summer of in-depth study and performance, Keith returned to VA and began working in film, television, and theatre. He returned to Russia in 1992 as the US Administrator of the Russian American Theatre in St. Petersburg, Moscow, and Minsk to oversee the creation, promotion, and performance of a bi-cultural Christmas program for every 6th grated in Byelorus - 40,000 children were brought to Minsk over 10 days to view the spectacle. Once back in the US, Keith performed with Young Audiences of VA bringing theatrical performances to children across the state. Soon, however, the demands of his film/TV work meant giving up his first love","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0282436","name":"Keith Flippen","idIMDB":"nm0282436"},"actorId":"nm0282436","character":"Mr. Russell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William J. Harrison","urlProfile":"http://www.imdb.com/name/nm4140011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg2MzYxODQzNl5BMl5BanBnXkFtZTgwOTY0NDgzNDE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"William J. Harrison is an actor, known for Three Billboards Outside Ebbing, Missouri (2017), Lawless (2012) and The Odd Life of Timothy Green (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg2MzYxODQzNl5BMl5BanBnXkFtZTgwOTY0NDgzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4140011","name":"William J. Harrison","idIMDB":"nm4140011"},"actorId":"nm4140011","character":"Bryce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jared Kemmerling","urlProfile":"http://www.imdb.com/name/nm4721342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5OTc1MzEwN15BMl5BanBnXkFtZTgwODg2NjgxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jared Kemmerling is an actor, known for Standing Up (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5OTc1MzEwN15BMl5BanBnXkFtZTgwODg2NjgxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4721342","name":"Jared Kemmerling","idIMDB":"nm4721342"},"actorId":"nm4721342","character":"Murphy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Caruso","urlProfile":"http://www.imdb.com/name/nm2596139","urlPhoto":"","biography":{"bio":"Daniel Caruso is an actor, known for Disturbia (2007), Eagle Eye (2008) and Standing Up (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2596139","name":"Daniel Caruso","idIMDB":"nm2596139"},"actorId":"nm2596139","character":"Arnold","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Blake Cooper Griffin","urlProfile":"http://www.imdb.com/name/nm2968223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDgxMjY2Ml5BMl5BanBnXkFtZTgwODk5OTE3NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Having already garnered huge successes with key roles opposite Hollywood A-listers including Helen Hunt and Cuba Gooding Jr., Griffin excels at taking on a variety of different characters, in both film and television. Appearing on a slew of popular prime time series, Blake notably transformed in an almost unrecognizable turn as bad boy 'Trent Rogers' on USA Network's \"Necessary Roughness\" and demonstrated his strong comedic chops as the memorable 'Brad Pearson' on TNT's \"Major Crimes.\" In 2016, Griffin had guest role on Showtime's \"House of Lies\" and starred as one of the leads in the highly anticipated feature film Love is All You Need? based off the successful, award winning short film from Kim Rocco Shields. Other TV and film projects include \"Jessie,\" \"Game of Your Life,\" \"Greek,\" \"Law & Order: Criminal Intent,\" \"Mad Love,\" \"90210,\" \"NCIS: Los Angeles, and films \"Ride\" with Helen Hunt, \"Standing Up\" with Val Kilmer and \"Life of a King\" with Cuba Gooding Jr.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDgxMjY2Ml5BMl5BanBnXkFtZTgwODk5OTE3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2968223","name":"Blake Cooper Griffin","idIMDB":"nm2968223"},"actorId":"nm2968223","character":"Eric","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1905042","urlIMDB":"http://www.imdb.com/title/tt1905042","business":{"budget":{"money":"$6,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.0","metascore":"40","filmingLocations":[{"location":"Lake Chatuge, Towns County, Georgia, USA"}],"rated":"PG","awards":[{"award":"Young Artist Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Leading Young Actor","names":[{"name":"Chandler Canterbury","id":"nm2425105","role":null}]},{"category":"Best Performance in a Feature Film - Leading Young Actress","names":[{"name":"Annalise Basso","id":"nm2399383","role":null}]},{"category":"Best Performance in a Feature Film - Supporting Young Actor","names":[{"name":"Justin Tinucci","id":"nm3597808","role":null}]}]}]}],"votes":"2,605","type":"Movie","companyCreditsSimple":[{"idCompany":"co0343139","name":"AR Films"},{"idCompany":"co0335687","name":"Aldamisa Entertainment"},{"idCompany":"co0258636","name":"Seven Star Pictures"}],"keywords":{"keywords":["prank","summer camp","island","stripped naked","run away","tween girl","sheriff","child driving car","redhead girl","redhead","fireworks","sparkler","firewood","belief in god","12 year old","11 year old","jumping into water","ostracism","misfit","child's point of view","friend","friendship","glasses","girl with glasses","boy with glasses","dancing","runaway child","runaway","bullying","children","first love","orphan","outcast","dance","theft","mother daughter relationship","missing children","coming of age","camera","boy girl relationship","bully comeuppance","bully","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:04:09"}}