{"data":{"movies":[{"title":"Muhammad Ali's Greatest Fight","originalTitle":"","year":"2013","releaseDate":"20131005","directors":[{"name":"Stephen Frears","id":"nm0001241"}],"writers":[{"name":"Howard L. Bingham","id":"nm0082935"},{"name":"Shawn Slovo","id":"nm0806256"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTc4NjkyMV5BMl5BanBnXkFtZTgwNDExODAxMzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"In 1964, world champion boxer Muhammad Ali requested exemption from the military draft based on his religious beliefs. His request was denied and when he refused induction into the army, he was convicted and sentenced to 5 years imprisonment. His case eventually works itself up the Supreme Court. In their first conference after the case is presented, the justices decide by majority vote to uphold the conviction and Justice John Harlan is tasked with preparing the majority opinion. He assigns one of his clerks, Kevin Connolly, to prepare a first draft but try as he might he believes that decision his wrong. His draft argues for overturning the conviction and Harlan agrees with him. The justice must now find a way to convince his colleagues.","simplePlot":"Ali's biggest match, his fight with the US government. A film about the politics and hubris surrounding the Vietnam War and the revenge exacted on America's greatest sportsman of the 20th century because he refused to fight in that war.","actors":[{"actorName":"Christopher Plummer","urlProfile":"http://www.imdb.com/name/nm0001626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1929","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Arthur Christopher Orme Plummer","height":"5' 10½\" (1.79 m)","bio":"Arthur Christopher Orme Plummer was born in Toronto, Ontario. He is the only child of Isabella Mary (Abbott), a secretary to the Dean of Sciences at McGill University, and John Orme Plummer, who sold securities and stocks. He is a great-grandson of John Abbott, who was Canada's third Prime Minister (from 1891 to 1892), and a great-great-great-grandson of Anglican clergyman John Bethune. He has Scottish, English, and Anglo-Irish ancestry. Plummer was raised in Senneville, Quebec, by Montreal. Until the 2009 Academy Awards were announced, it could be said about Plummer that he was the finest actor of the post-World War II period to fail to get an Academy Award. In that, he was following in the footsteps of the late great John Barrymore, whom Plummer so memorably portrayed on Broadway in a one-man show that brought him his second Tony Award. In 2010, Plummer finally got an Oscar nod for his portrayal of another legend, Leo Tolstoy in Tolstoï, le dernier automne (2009). Two years later, the first paragraph of his obituary was written when the 82-year-old Plummer became the oldest person in Academy history to win an Oscar. He won for playing a senior citizen who comes out as gay after the death of his wife in the movie Beginners (2010). As he clutched his statuette, the debonaire thespian addressed it thusly: \"You're only two years older than me darling, where have you been all of my life?\" Plummer then told the audience that at birth, \"I was already rehearsing my Academy acceptance speech, but it was so long ago mercifully for you I've forgotten it.\" The Academy Award was a long time in coming and richly deserved. Aside from the youngest member of the Barrymore siblings (which counted Oscar-winners Ethel Barrymore and Lionel Barrymore in their number), Christopher Plummer is the premier Shakespearean actor to come out of North America in the 20th century. He was particularly memorable as Hamlet, Iago and Lear, though his Macbeth opposite Glenda Jackson was -- and this was no surprise to him due to the famous curse attached to the \"Scottish Play\" -- a failure. Plummer also has given many fine portrayals on film, particularly as he grew older and settled down into a comfortable marriage with his third wife Elaine. He thanked her from the stage during the 2012 Oscar telecast, quipping that she \"deserves the Nobel Peace Prize for coming to my rescue every day of my life.\" Like another great stage actor, Richard Burton, the younger Plummer failed to connect with the screen in a way that would make him a star. Dynamic on stage, the charisma failed to transfer through the lens onto celluloid. Burton's early film career, when he was a contract player at 20th Century-Fox, failed to ignite despite his garnering two Oscar nominations early on. He did not become a superstar until the mid-1960s, after hooking up with Elizabeth Taylor on the set of Cleopatra (1963). It was Liz whom he credited with teaching him how to act on film. Christopher Plummer never made it as a leading man in films. Perhaps if he had been born earlier, and acted in the studio system of Hollywood's golden age, he could have been carefully groomed for stardom. As it was he shared the English stage actors' disdain -- and he was equally at home in London as he was on the boards of Broadway or on-stage in his native Canada -- for the movies, which did not help him in that medium, as he has confessed. As he aged, Plummer excelled at character parts. He was always a good villain, this man who garnered kudos playing Lucifer on Broadway in Archibald Macleish's Pulitzer Prize-winning \"J.B.\". Though he likely always be remembered as \"Captain Von Trapp\" in the atomic bomb-strength blockbuster The Sound of Music (1965) (a film he publicly despised until softening his stance in his 2008 autobiography \"In Spite of Me\"), his later film work includes such outstanding performances as the best cinema Sherlock Holmes--other than Basil Rathbone -- in Murder by Decree (1979), the chilling villain in L'argent de la banque (1978), his iconoclastic Mike Wallace in The Insider (1999), the empathetic psychiatrist in A Beautiful Mind (2001), and as Leo Tolstoy in Tolstoï, le dernier automne (2009). It was this last role that finally brought him recognition from the Academy of Motion Picture Arts & Sciences, when he was nominated as Best Actor in a supporting role. Plummer remains one of the most respected and honored actors performing in the English language. He's won two Emmy Awards out of six nominations stretching 46 years from 1959 and 2005, and one Genie Award in five nominations from 1980 to 2004. For his stage work, Plummer has racked up two Tony Awards on six nominations, the first in 1974 as Best Actor (Musical) for the title role in \"Cyrano\" and the second in 1997, as Best Actor (Play), in \"Barrymore\". Surprisingly, he did not win (though he was nominated) for his masterful 2004 performance of \"King Lear\", which he originated at the Stratford Festival in Ontario and brought down to Broadway for a sold-out run. His other Tony nominations show the wide range of his talent, from a 1959 nod for the Elia Kazan-directed production of Macleish's \"J.B.\" to recognition in 1994 for Harold Pinter's \"No Man's Land\", with a 1982 Best Actor (Play) nomination for his \"Iago\" in William Shakespeare's \"Othello\". He continues to be a very in-demand character actor in prestigious motion pictures. If he were English rather than Canadian, he'd have been knighted long ago. (In 1968, he was awarded Companion of the Order of Canada, the country's highest civilian honor and one which required the approval of the sovereign, Queen Elizabeth II.) If he lived in the company town of Los Angeles rather than in Connecticut, he likely would have several more Oscar nominations before winning his first for \"The Last Station\". As it is, as attested to in his witty and well-written autobiography, Christopher Plummer has been amply rewarded in life. In 1970, Plummer - a self-confessed 43-year-old \"bottle baby\" - married his third wife, dancer Elaine Taylor, who helped wean him off his dependency on alcohol. They live happily with their dogs on a 30-acre estate in Weston, Connecticut. Although he spends the majority of his time in the United States, he remains a Canadian citizen. His daughter, with actress Tammy Grimes, is actress Amanda Plummer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001626","name":"Christopher Plummer","nicknames":["Chris"],"idIMDB":"nm0001626"},"actorId":"nm0001626","character":"John Harlan","urlCharacter":"http://www.imdb.com/character/ch0364828","main":true},{"actorName":"Frank Langella","urlProfile":"http://www.imdb.com/name/nm0001449","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDc0NTI3Nl5BMl5BanBnXkFtZTcwMTgzNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1938","placeOfBirth":" Bayonne, New Jersey, USA","birthName":"Frank A. Langella Jr.","height":"6' 3\" (1.91 m)","bio":"Frank Langella was born in Bayonne, New Jersey, to Angelina and Frank A. Langella, a business executive. He is of Italian descent. A stage and screen actor of extreme versatility, Frank Langella won acclaim on the New York stage in \"Seascape\" and followed it up with the title role in the Edward Gorey production of \"Dracula\". He repeated the role for the screen in Dracula (1979) and became an international star. Over the years, he has done occasional films but prefers to concentrate on his first love, the legitimate theatre. His stage performance ranged from Strindberg drama (\"The Father\") to Noël Coward comedy (\"Present Laughter\"). He also appeared in several productions for the New York Shakespeare festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDc0NTI3Nl5BMl5BanBnXkFtZTcwMTgzNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001449","name":"Frank Langella","idIMDB":"nm0001449"},"actorId":"nm0001449","character":"Warren Burger","urlCharacter":"http://www.imdb.com/character/ch0384057","main":true},{"actorName":"Ed Begley Jr.","urlProfile":"http://www.imdb.com/name/nm0000893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODI0NDgxN15BMl5BanBnXkFtZTYwODU1MDcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Edward James Begley Jr.","height":"6' 4\" (1.93 m)","bio":"Ed Begley Jr. was born on September 16, 1949 in Los Angeles, California, USA as Edward James Begley Jr. He is an actor and producer, known for Ghostbusters (2016), St. Elsewhere (1982) and Pineapple Express (2008). He has been married to Rachelle Carson since August 23, 2000. They have one child. He was previously married to Ingrid Taylor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODI0NDgxN15BMl5BanBnXkFtZTYwODU1MDcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000893","name":"Ed Begley Jr.","idIMDB":"nm0000893"},"actorId":"nm0000893","character":"Harry Blackmun","urlCharacter":"http://www.imdb.com/character/ch0541881","main":true},{"actorName":"Peter Gerety","urlProfile":"http://www.imdb.com/name/nm0314253","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTgzNjYwOV5BMl5BanBnXkFtZTcwMjIwNDkwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1940","placeOfBirth":" Providence, Rhode Island, USA","height":"5' 6½\" (1.69 m)","bio":"Peter Gerety was born on May 17, 1940 in Providence, Rhode Island, USA. He is an actor, known for Inside Man (2006), War of the Worlds (2005) and K-PAX (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTgzNjYwOV5BMl5BanBnXkFtZTcwMjIwNDkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0314253","name":"Peter Gerety","idIMDB":"nm0314253"},"actorId":"nm0314253","character":"William Brennan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Levinson","urlProfile":"http://www.imdb.com/name/nm0001469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjY5MjYzN15BMl5BanBnXkFtZTcwOTc1MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1942","placeOfBirth":" Baltimore, Maryland, USA","height":"5' 11\" (1.8 m)","bio":"Barry Levinson was born in Baltimore, Maryland, to Violet (Krichinsky) and Irvin Levinson, who worked in furniture and appliance. He is of Russian Jewish descent. Levinson graduated from high school in 1960, attended college at American University in Washington, DC. He did well, but decided he wanted to go to Los Angeles. In LA, Levinson worked for the Oxford Company, studying acting, improvisation, and production; worked in comedy clubs, where he learned how to write; and began dating Valerie Curtin. In 1967, won a job writing for a local TV comedy show. He eventually performed his material on the show, winning a local Emmy. In the 70s, Levinson wrote for The Carol Burnett Show (1967) -- and won two Emmys in three years. Mel Brooks hired him for Silent Movie (1976), then, High Anxiety (1977). Levinson and Curtin married in 1975. They co-wrote: _...And Justice for All (1979)_, and other scripts. While Curtin performed in San Francisco, he wrote Diner (1982). MGM bought it and, with a budget of under $5 million, Levinson directed. Curtin and Levinson divorced in 1982. Levinson met Dianna Rhodes while he was filming Diner (1982). She lived in Baltimore, with her two children Patrick and Michelle Levinson. Levinson and Rhodes later married and had two more children, Sam Levinson and Jack Levinson. Proving himself as a director with The Natural (1984), he tackled his most ambitious project to that time in Rain Man (1988). Levinson went on to place his stamp on films like Good Morning, Vietnam (1987), and Bugsy (1991). After his many successes, Toys (1992) did poorly. Levinson had a hit with Disclosure (1994) in 1994, the same year the Levinsons moved to Marin County in Northern California to get away from the Hollywood scene.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjY5MjYzN15BMl5BanBnXkFtZTcwOTc1MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001469","name":"Barry Levinson","idIMDB":"nm0001469"},"actorId":"nm0001469","character":"Potter Stewart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Bedford Lloyd","urlProfile":"http://www.imdb.com/name/nm0066023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzQzMzQxNDheQTJeQWpwZ15BbWU3MDkzOTgzMDg@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1956","placeOfBirth":" New Haven, Connecticut, USA","height":"6' 5\" (1.96 m)","bio":"John Bedford Lloyd's interest in acting began accidentally, while he was a pre-med student at Williams College. A friend convinced him to take a part in a production of \"One Flew Over the Cuckoo's Nest,\" and the experience changed his life. He switched his curriculum to English and began regularly performing in plays, and went on to attend Yale, graduating from that school's prestigious School of Drama. Lloyd moved to Manhattan and began a career onstage, in film and on television in the early 1980s, generally in supporting roles. In the movies, the physically-imposing Lloyd (he is 6' 5\" tall) is probably best known for his supporting parts in Crossing Delancey (1988) and The Abyss (1989). He has more recently supplemented his stage and screen work with an prolific career as a reader of audiobooks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzQzMzQxNDheQTJeQWpwZ15BbWU3MDkzOTgzMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0066023","name":"John Bedford Lloyd","idIMDB":"nm0066023"},"actorId":"nm0066023","character":"Byron 'Whizzer' White","urlCharacter":"http://www.imdb.com/character/ch0499727","main":true},{"actorName":"Fritz Weaver","urlProfile":"http://www.imdb.com/name/nm0915851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjQxNzkxMF5BMl5BanBnXkFtZTgwMTE0MzE3MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1926","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Francis William Weaver","height":"6' 3\" (1.91 m)","bio":"Fritz Weaver, the American actor, was born on January 19, 1926, in Pittsburgh, Pennsylvania. He served in Civilian Public Service as a conscientious objector during World War II, breaking into acting in the early 1950s. He made his Broadway debut in October 1955 in \"The Chalk Garden,\" which garnered five Tony Award nominations, including one for Weaver as Best Featured Actor in a Play. He also won a 1956 Theatre World Award for his performance. The first of literally scores of television appearances came in 1957, in \"The Playwright and the Stars\" broadcast as part of the drama omnibus Studio One in Hollywood (1948). He continued to appear on Broadway, winning a Tony Award for Best Actor in Play his performance as Jermome Malley in Robert Marasco's \"Child's Play.\" Though Weaver has appeared in many movies, it generally was as a supporting actor or in small parts, and the role of Malley was given to James Mason in the 1972 film version (Child's Play (1972)) of the play. His most memorable role, arguably, was that of the doomed German Jewish patriarch Dr. Josef Weiss in the watershed TV mini-series Holocaust (1978), for which he was nominated for an Emmy Award as Outstanding Lead Actor in a Limited Series. Since 1995, Weaver is known as the narrator of programs on the History Channel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NjQxNzkxMF5BMl5BanBnXkFtZTgwMTE0MzE3MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915851","name":"Fritz Weaver","idIMDB":"nm0915851"},"actorId":"nm0915851","character":"Hugo Black","urlCharacter":"http://www.imdb.com/character/ch0499728","main":true},{"actorName":"Harris Yulin","urlProfile":"http://www.imdb.com/name/nm0950867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0Njk2MzgyNF5BMl5BanBnXkFtZTYwMDUwMDc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1937","placeOfBirth":" Los Angeles, California, USA","height":"5' 11¾\" (1.82 m)","bio":"Another one of those frustratingly nameless but omnipresent and talented faces of stage, film and TV, chameleon-like player Harris Yulin has avoided the severe stereotyping lost to many a prolific actor. Benign, balding and often bearded, Yulin off camera was a stark contrast to the tough, unsympathetic men he presented on camera. Born in Los Angeles in 1937, Yulin traveled extensively throughout Europe and Israel before deciding on an acting career. Attending UCLA, he studied acting with Jeff Corey before making his off-Broadway debut in \"Next Time I'll Sing for You\" in 1963. From there, Harris continued to forge a respectable name for himself in the classical arena, particularly in the works of Shakespeare. With credits including \"A Midsummer Night's Dream\" (1964), \"Richard III\" (1966) and \"King John\" (1967), he proved to be a stellar Hamlet in 1974, and subsequently played the role of Claudius to Kevin Kline's dour Dane in a 1986 production. Marking his Broadway debut in \"Watch on the Rhine\" in 1980, he impressed later that year alongside James Earl Jones in the contemporary drama \"A Lesson from Aloes\" (1980). His classical repertoire over the years has included \"Uncle Vanya\" (1981), \"Hedda Gabler\" (1981) and (2001), \"The Doctor's Dilemma\" (1982) \"Tartuffe\" (1984), \"The Seagull\" (1985), and a Broadway return with \"The Visit\" (1992). More recently, he won Drama Desk nominations for his superb work in \"The Price\" (1999) and \"The Diary of Anne Frank\" (2001). Keeping his base firmly in Los Angeles for most his career, he was one of the founders of the Los Angeles Classic Theater and has kept active on the regional theater scene over the years. A noted New York stage director, he helmed the off-Broadway productions \"Baba Goya,\" \"This Lime Tree Bower,\" and \"The Trip to Bountiful\". He is the the possessor of an intriguingly solemn, autocratic-looking mug, and his glowering intensity usually invites suspicion, scorn or skepticism... or all three. Yulin began appearing in films and TV in mid-life (1970), and a high percentage of his work earned standout notices, if not awards and outright stardom. He started impressively enough in Terry Southern's thoroughly bizarre film adaptation of John Barth's novel End of the Road (1970) amid a dream ensemble cast that included Stacy Keach, James Earl Jones, Dorothy Tristan, and James Coco. He then formed a strong acting bond with Keach, again playing best friend Wyatt Earp to Keach's Doc Holliday in an offbeat, revisionist version of their OK Corral story in 'Doc' (1971) that also co-starred Faye Dunaway. While strong supporting turns in The Midnight Man (1974), Night Moves (1975), Scarface (1983), Woody Allen's Another Woman (1988), Narrow Margin (1990), and Clear and Present Danger (1994) kept his name alive on the larger screen, his career found a stronger focus on TV. Over time, he played a number of flashy historical figures on the quality small screen, including Machine Gun Kelly (George Kelly), J. Edgar Hoover, Senator Joseph McCarthy, Israeli General Forman, Jesse James, George Marshall, Leonardo DaVinci and even the Bard himself. He could always be counted on to play a maniacal genius or the embodiment of white-collar corruption in a career piled with genuinely unsympathetic characters. His more mainstream filming has included lightweight comedies and horrors, such as Bad Dreams (1988), Ghostbusters II (1989), Multiplicity (1996) and Rush Hour 2 (2001), and the more familiar heavy drama, including the brutal urban tale Training Day (2001) starring Oscar-winner Denzel Washington, and the somber biopic Fur: An Imaginary Portrait of Diane Arbus (2006) with Nicole Kidman. Though Yulin has been unable to find the one transcending role to catapult him to the very top of his character ranks, he continues to enjoy an enviable career broaching age 70. Fresher audiences might recognize him from episodes of Star Trek: Deep Space Nine (1993), Law & Order (1990), Buffy the Vampire Slayer (1997), 24 (2001) and Frasier (1993), for which he earned a \"guest\" Emmy nomination. His late wife Gwen Welles, who succumbed to cancer at age 42 in 1993, was an actress of note (Robert Altman's Nashville (1975), in particular). A documentary chronicling his wife's illness and untimely death appeared at the 1998 Berlin Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0Njk2MzgyNF5BMl5BanBnXkFtZTYwMDUwMDc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950867","name":"Harris Yulin","idIMDB":"nm0950867"},"actorId":"nm0950867","character":"William O. Douglas","urlCharacter":"http://www.imdb.com/character/ch0499729","main":true},{"actorName":"Danny Glover","urlProfile":"http://www.imdb.com/name/nm0000418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1946","placeOfBirth":" San Francisco, California, USA","birthName":"Danny Lebern Glover","height":"6' 4\" (1.93 m)","bio":"Actor, producer and humanitarian Danny Glover has been a commanding presence on screen, stage and television for more than 25 years. Glover was born in San Francisco, California, to Carrie (Hunley) and James Glover, postal workers who were also active in civil rights. Glover trained at the Black Actors' Workshop of the American Conservatory Theater. It was his Broadway debut in Fugard's Master Harold...and the Boys, which brought him to national recognition and led director Robert Benton to cast Glover in his first leading role in 1984's Oscar®-nominated Best Picture Places in the Heart. The following year, Glover starred in two more Best Picture nominees: Peter Weir's Witness and Steven Spielberg's The Color Purple. In 1987, Glover partnered with Mel Gibson in the first Lethal Weapon film and went on to star in three hugely successful Lethal Weapon sequels. Glover has also invested his talents in more personal projects, including the award-winning To Sleep With Anger, which he executive produced and for which he won an Independent Spirit Award for Best Actor; Bopha!; Manderlay; Missing in America; and the film version of Athol Fugard's play Boesman and Lena. On the small screen, Glover won an Image Award and a Cable ACE Award and earned an Emmy nomination for his performance in the title role of the HBO movie Mandela. He has also received Emmy nominations for his work in the acclaimed miniseries Lonesome Dove and the telefilm Freedom Song. As a director, he earned a Daytime Emmy nomination for Showtime's Just a Dream. Glover's film credits range from the blockbuster Lethal Weapon franchise to smaller independent features, some of which Glover also produced. He co-starred in the critically acclaimed feature Dreamgirls directed by Bill Condon and in Po' Boy's Game for director Clement Virgo. He appeared in the hit feature Shooter for director Antoine Fuqua, Honeydripper for director John Sayles, and Be Kind, Rewind for director Michel Gondry. Glover has also gained respect for his wide-reaching community activism and philanthropic efforts, with a particular emphasis on advocacy for economic justice, and access to health care and education programs in the United States and Africa. For these efforts, Glover received a 2006 DGA Honor. Internationally, Glover has served as a Goodwill Ambassador for the United Nations Development Program from 1998-2004, focusing on issues of poverty, disease, and economic development in Africa, Latin America, and the Caribbean, and serves as UNICEF Ambassador. In 2005, Glover co-founded Louverture Films dedicated to the development and production of films of historical relevance, social purpose, commercial value and artistic integrity. The New York based company has a slate of progressive features and documentaries including Trouble the Water, which won the Grand Jury Prize at the 2008 Sundance Film Festival, Africa Unite, award winning feature Bamako, and most recent projects Uncle Boonmee Who Can Recall His Past Lives, and The Disappearance of McKinley Nolan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000418","name":"Danny Glover","idIMDB":"nm0000418"},"actorId":"nm0000418","character":"Thurgood Marshall","urlCharacter":"http://www.imdb.com/character/ch0065881","main":true},{"actorName":"Benjamin Walker","urlProfile":"http://www.imdb.com/name/nm0907548","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTI2NzQ3NF5BMl5BanBnXkFtZTgwMTgzMTY5ODE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1982","placeOfBirth":" Georgia, USA","birthName":"Benjamin Walker Davis","height":"6' 3\" (1.91 m)","bio":"Benjamin Walker was born Benjamin Walker Davis in Georgia, and was raised in Cartersville, GA, the son of Jeannine (Walker), a music teacher, and Greg Davis, who worked in finance and owned a movie rental store. He has one older brother. Walker was educated at Cartersville High School in Georgia and the Interlochen Arts Academy in Traverse City, Michigan, before studying acting at the Juilliard School in New York. Whilst at Juilliard, Walker got his first experiences of performing for paying audiences as a stand-up comedian. His acting break came in 2007, when he was cast as Bertram Cates in a Broadway production of 'Inherit the Wind'. Further theater roles followed, including playing Andrew Jackson in the rock musical 'Bloody Bloody Andrew Jackson', which was critically acclaimed. Walker first came to film-goers' attention when he played the young Kinsey in Kinsey (2004). Other film and TV roles followed including Harlon Block in Clint Eastwood's Flags of Our Fathers (2006), and playing another president, Abraham Lincoln in Abraham Lincoln: Vampire Hunter (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTI2NzQ3NF5BMl5BanBnXkFtZTgwMTgzMTY5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907548","name":"Benjamin Walker","nicknames":["Ben"],"idIMDB":"nm0907548"},"actorId":"nm0907548","character":"Kevin Connolly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pablo Schreiber","urlProfile":"http://www.imdb.com/name/nm1032567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MTM2MjQ3OF5BMl5BanBnXkFtZTcwNDU4NDIxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1978","placeOfBirth":" Ymir, British Columbia, Canada","birthName":"Pablo Tell Schreiber","height":"6' 4¾\" (1.95 m)","bio":"Pablo Tell Schreiber was born in Ymir, British Columbia, Canada, to Lorraine Reaveley, a Canadian psychotherapist, and Tell Schreiber, an American actor. His paternal half-brother is actor Liev Schreiber. Pablo, who is named after Chilean poet Pablo Neruda, was raised in Ymir, and moved to Seattle, Washington, as a teenager. Pablo Schreiber was nominated for a Tony Award for his Broadway debut performance in the revival of Clifford Odets' classic Awake and Sing! directed by Bartlett Sher. Schreiber has appeared in many films, including: Josh Radnor's Happythankyoumoreplease, which won the Audience Award at Sundance, Vicky Christina Barcelona, The Lords of Dogtown, Tell Tale, Nights in Rodanthe, The Manchurian Candidate, Allegiance, Breaking Upwards, Into the Fire, The Mudge Boy and Invitation to a Suicide. Upcoming he appears in the independent features Fort Bliss, The Dramatics and Preservation. Television credits include his classic role as \"Nick Sobolka\" in HBO's critically acclaimed The Wire; and most recently as the menacing villain \"William Lewis\" on Law & Order: SVU, NBC's \"Ironside\" and as \"Pornstache\" in Jenji Kohan's hit series Orange Is The New Black. He's also appeared in Stephen Frears' Muhammad Ali's Greatest Fight for HBO and on Weeds, A Gifted Man, Light's Out, The Good Wife, White Collar, The Beast, Life on Mars, It's Always Sunny in Philadelphia, Fear Itself, Dirt, John Grisham's A Painted House, Law & Order, Law & Order: Criminal Intent, and The Black Donnelly's. Schreiber has performed in numerous Broadway and off-Broadway plays including: Desire Under the Elms on Broadway directed by Robert Falls, Rajiv Joseph's Gruesome Playground Injuries at Second Stage, Neil LaBute's Reasons to be Pretty at MCC (for which he won the Drama Desk Award), Dying City at Lincoln Center, Mr. Marmalade at Roundabout, Sin: A Cardinal Deposed at The New Group, Manuscript at the Daryl Roth Theatre, Julius Caesar at the New York Shakespeare Festival, and Blood Orange, his professional debut.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MTM2MjQ3OF5BMl5BanBnXkFtZTcwNDU4NDIxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1032567","name":"Pablo Schreiber","idIMDB":"nm1032567"},"actorId":"nm1032567","character":"Covert Becker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Steinfeld","urlProfile":"http://www.imdb.com/name/nm3489422","urlPhoto":"","biography":{"bio":"Ben Steinfeld is an actor, known for Muhammad Ali's Greatest Fight (2013), Still Dreaming (2014) and Law & Order: Criminal Intent (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3489422","name":"Ben Steinfeld","idIMDB":"nm3489422"},"actorId":"nm3489422","character":"Sam Edelstein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dana Ivey","urlProfile":"http://www.imdb.com/name/nm0412374","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTg4OTM3M15BMl5BanBnXkFtZTgwNzI1MzMzMjE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1941","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Dana Robins Ivey","bio":"Dana Ivey was born in Atlanta, Georgia. She decided at age six that she wanted to act, and throughout school she pursued it. She majored in theatre at Rollins College in Florida. She received a grant to study drama in England at the London Academy of Music and Art. She has received critical acclaim on the stage, winning many honors, such as a Tony Nomination, an Outer Critics award, a Drama Desk Award. She has appeared on such television shows as Law & Order (1990) and Frasier (1993). She currently lives in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTg4OTM3M15BMl5BanBnXkFtZTgwNzI1MzMzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0412374","name":"Dana Ivey","idIMDB":"nm0412374"},"actorId":"nm0412374","character":"Mrs. Paige","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Chalfant","urlProfile":"http://www.imdb.com/name/nm0149910","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjg3NzY3N15BMl5BanBnXkFtZTcwNzYxNDgzMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1945","placeOfBirth":" San Francisco, California, USA","birthName":"Kathleen Ann Bishop","bio":"Kathleen Chalfant was born on January 14, 1945 in San Francisco, California, USA as Kathleen Ann Bishop. She is an actress, known for The Laramie Project (2002), Kinsey (2004) and Junior (1994). She has been married to Henry Chalfant since November 26, 1966. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjg3NzY3N15BMl5BanBnXkFtZTcwNzYxNDgzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0149910","name":"Kathleen Chalfant","idIMDB":"nm0149910"},"actorId":"nm0149910","character":"Ethel Harlan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lisa Joyce","urlProfile":"http://www.imdb.com/name/nm2436809","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDQwNjkyOF5BMl5BanBnXkFtZTgwMzI2NzI0OTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Born and raised in Chicago, Lisa Joyce received her BFA in Acting from the Theater School at DePaul University. She received a Joseph Jefferson nomination for her performance in Adam Rapp's \"Red Light Winter\", which premiered at the Steppenwolf Theater Company before transferring off-Broadway and being named a finalist for The Pulitzer Prize. Lisa made her West End/Broadway debut in \"La Bete\", starring Mark Rylance and David Hyde Pierce, and toured nationally, alongside Cherry Jones in the Tony Award-winning production of \"Doubt\". Some of her favorite off-Broadway credits include: Nora Ephron and Delia Ephron's beloved production of \"Love, Loss and What I Wore\" and Soho Rep.'s \"The Ugly One\", for which she earned a Drama Desk nomination. Lisa has also appeared in productions at The Public, New York Theater Workshop, The Signature, Classic Stage Company, Rattlestick, Transport Group, StageFARM, Williamstown and The Studio Theater in D.C., where she received a Helen Hayes Award for her role in \"Blackbird\". Lisa is a member of the LAByrinth Theater Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDQwNjkyOF5BMl5BanBnXkFtZTgwMzI2NzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2436809","name":"Lisa Joyce","idIMDB":"nm2436809"},"actorId":"nm2436809","character":"Donna Connolly","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2061756","urlIMDB":"http://www.imdb.com/title/tt2061756","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":["Arri Alexa Plus, Zeiss Master Prime and Fujinon Alura Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","ProRes 4:4:4 (1080p/24) (source format)"],"printedFilmFormat":["Video (HDTV)"]},"rating":"6.8","filmingLocations":[{"location":"Baruch College, Manhattan, New York City, New York, USA"}],"awards":[{"award":"Primetime Emmy Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Directing for a Miniseries, Movie or a Dramatic Special","names":[{"name":"Stephen Frears","id":"nm0001241","role":null}]},{"category":"Outstanding Television Movie","names":[{"name":"Frank Doelger","id":"nm0230361","role":"executive producer"},{"name":"Tracey Scoffield","id":"nm0778597","role":"executive producer"},{"name":"Jonathan Cameron","id":"nm5164297","role":"executive producer"},{"name":"Scott Ferguson","id":"nm0272605","role":"produced by"},{"name":"Home Box Office (HBO)","id":null,"role":null}]}]}]},{"award":"Black Reel Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Supporting Actor, TV Movie or Mini-Series","names":[{"name":"Danny Glover","id":"nm0000418","role":null}]}]}]},{"award":"Directors Guild of America, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Movies for Television and Mini-Series","names":[{"name":"Stephen Frears","id":"nm0001241","role":null}]}]}]},{"award":"Image Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Television Movie, Mini-Series or Dramatic Special","names":[]},{"category":"Outstanding Actor in a Television Movie, Mini-Series or Dramatic Special","names":[{"name":"Danny Glover","id":"nm0000418","role":null}]}]}]},{"award":"NAMIC Vision Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Vision Award","categories":[{"category":"Original Movie or Special","names":[]}]}]},{"award":"Writers Guild of America, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won WGA Award (TV)","categories":[{"category":"Long Form - Adapted","names":[{"name":"Shawn Slovo","id":"nm0806256","role":null}]}]}]}],"votes":"1,877","type":"Movie","companyCreditsSimple":[{"idCompany":"co0492279","name":"Sakura Films"},{"idCompany":"co0005861","name":"HBO Films"},{"idCompany":"co0215713","name":"Rainmark Films"}],"keywords":{"keywords":["fight","court","boxer","supreme court","vietnam war","black american","pregnancy","african american","medo persian empire","dictatorship","championship","heavyweight champion","hospital","walter reed army medical center","baby","interview","illness","whiskey","unanimous decision","religion","black muslim","racism","appeal","bruise","fistfight","punched in the face","sweat","dying man","letter of resignation","court ruling","republican","conscientous objector","jewish man","failing eyesight","bad eyesight","poor eyesight","pornographic film","typewriter","coughing","shouting","argument","marijuana","magnifying glass","bathroom","shower","male in shower","bare chested male","lawyer","koran quotation","cancer","u.s. constitution","constitution","constitutional law","reference to the vietnam war","anti war protest","anti war","vietnam war veteran","vietnam era","protesting vietnam war","oral argument","koran","basketball","cigarette smoking","archival footage","husband wife relationship","dog","bus station","draft dodger","black power","liberal conservative conflict","liberal","conservative","year 1971","old age","boxing","reference to malcolm x","reference to richard nixon","muslim","court clerk","free speech","reference to plessy v. ferguson","appeal to the supreme court","secretary","supreme court building","supreme court justice","u.s. supreme court","washington d.c.","chief justice","punctuation in title","apostrophe in title","based on book","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:51:38"}}