{"data":{"movies":[{"title":"Neighbors","originalTitle":"","year":"2014","releaseDate":"20140509","directors":[{"name":"Nicholas Stoller","id":"nm0831557"}],"writers":[{"name":"Andrew Jay Cohen","id":"nm1157527"},{"name":"Brendan O'Brien","id":"nm1895993"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ0OTkzODgyNF5BMl5BanBnXkFtZTgwOTA3OTE4MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Kelly and Mac are settling down in a quiet neighborhood with their newborn child, until the frat brothers move into the house next door. Teddy is the President, and Pete is his right hand man, and they're quick to accept friendship when Kelly and Mac introduce themselves as the neighbors. Night after night, Mac asks Teddy to lower the fraternity's noise, even accepting the invitation to the party one evening. When Teddy goes back on his word to keep the partying down, Mac calls the police to deal with the problem. The police quickly blame Mac for their presence, and the war begins. As the family feuds with the frat brothers, things get hilariously dangerous and the fraternity ends up on thin ice with their college. After receiving their final warning and being placed on probation, Mac and Kelly pull a prank so ingenious that Teddy and Pete are forced to respond. All hell breaks loose, from Robert DeNiro parties to Christopher Mintz-Plasse having sex in the bushes, this comedy shows ...","simplePlot":"After they are forced to live next to a fraternity house, a couple with a newborn baby do whatever they can to take them down.","actors":[{"actorName":"Seth Rogen","urlProfile":"http://www.imdb.com/name/nm0736622","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjgzNzcwNV5BMl5BanBnXkFtZTcwODExMDYxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1982","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Seth Aaron Rogen","height":"5' 11\" (1.8 m)","bio":"An actor, comedian and writer, Seth Rogen has come a long way from doing stand-up comedy as a teen. Rogen was born in Vancouver, British Columbia, to Sandy (Belogus), a social worker, and Mark Rogen, who worked for non-profits. His father is American-born and his mother is Canadian. He is of Russian Jewish descent. He attended Vancouver Talmud Torah Elementary School and Point Grey Secondary School (although he dropped out of high school to move to Los Angeles) and was known for the stand-up comedy he performed at Camp Miriam, a Habonim Dror camp. At 16, Rogan came in second place in the 1998 Vancouver Amateur Comedy Contest. Soon after that he landed his first role in Judd Apatow's short-lived but well regarded TV series Freaks and Geeks (1999), taking on the role of Ken Miller. Though the show only lasted one season, it was the launching pad for many careers, including Rogen, Apatow, James Franco, and Jason Segel. This early work sharpened Rogen's keen improvisational skills, which he's used on many projects since. Following Freaks and Geeks (1999), he participated in a few unsuccessful television projects, and then joined the American television version of Da Ali G Show (2003) as a writer during its second and last season, along with his childhood friend and writing partner Evan Goldberg. The writing team received an Emmy nomination. As a huge fan of the first season, Rogen was thrilled to get the chance to work with Sacha Baron Cohen. Continuing his work with Apatow, he joined the cast of Apatow's debut film The 40-Year-Old Virgin (2005) and is credited as co-producer. After that he took the lead in Knocked Up (2007), Apatow's second movie and a huge success. He's since been a frequent collaborator with Apatow, in projects such as Superbad (2007), Pineapple Express (2008) and Funny People (2009). He co-wrote Superbad (2007), with Goldberg; the pair started the project when they were teens. They won the Canadian Comedy Award for Best Writing in a Film in 2008. They later wrote Pineapple Express (2008) and The Green Hornet (2011), also starring Rogen. A talented voice artist, Rogen is in the animated films Horton Hears a Who! (2008), Kung Fu Panda (2008), and Monsters vs. Aliens (2009), and has voiced characters for The Simpsons (1989) and American Dad! (2005). Rogen was named the Canadian Comedy Person of the Year by the Canadian Comedy Awards in both 2008 and 2009. Rogen lives in Los Angeles with Lauren Miller, whom he met in 2004. They became engaged in September 2010 and married in October 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjgzNzcwNV5BMl5BanBnXkFtZTcwODExMDYxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0736622","name":"Seth Rogen","idIMDB":"nm0736622"},"actorId":"nm0736622","character":"Mac Radner","urlCharacter":"http://www.imdb.com/character/ch0435785","main":true},{"actorName":"Rose Byrne","urlProfile":"http://www.imdb.com/name/nm0126284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1979","placeOfBirth":" Balmain, Sydney, New South Wales, Australia","birthName":"Mary Rose Byrne","height":"5' 6¼\" (1.68 m)","bio":"Rose Byrne was born in Balmain, Sydney, Australia. She is the daughter of Jane, a primary school administrator, and Robin Byrne, a semi-retired statistician and market researcher. She landed her first role in a movie, Dallas Doll (1994), when she was 15 years old. Since then, Rose has appeared in a variety of Australian televisions shows including Hartley, coeurs à vif (1994), Echo Point (1995), and the film Two Hands (1999) alongside Heath Ledger. After this, she appeared in various movies like The Date (1999), My Mother Frank (2000), and Clara Law's The Goddess of 1967 (2000) for which she obtained the Female Volpi Cup at the Venice Festival in 2000. Her first experience on a big-budget movie came when she played handmaiden, Dormé, to Natalie Portman, Padmé Amidala, in Star Wars: Episode II - Attack of the Clones (2002). In 2003, she starred, coincidentally, as Rose Mortmain in the adaptation of Dodie Smith's I Capture the Castle (2003). In 2004, she acted in Wicker Park (2004) with Diane Kruger and Josh Hartnett. Here, she heard Wolfgang Petersen was looking for an actress for Briseis in his next movie Troy (2004) with Brad Pitt, she got the part and was recognised as one of the most promising actresses in Hollywood. After Troy (2004), she played Edith in a TV adaptation of Casanova (2005). In September 2005, she started to act in Sunshine (2007), a Danny Boyle movie, where she plays the pilot in a space mission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126284","name":"Rose Byrne","nicknames":["Rosie"],"idIMDB":"nm0126284"},"actorId":"nm0126284","character":"Kelly Radner","urlCharacter":"http://www.imdb.com/character/ch0404479","main":true},{"actorName":"Elise Vargas","urlProfile":"http://www.imdb.com/name/nm5746224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzM2MzYwMl5BMl5BanBnXkFtZTgwMTE5Mzg4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"4' (1.22 m)","bio":"Elise Vargas is an actress, known for Neighbors (2014), Alexander and the Terrible, Horrible, No Good, Very Bad Day (2014) and Neighbors 2: Sorority Rising (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzM2MzYwMl5BMl5BanBnXkFtZTgwMTE5Mzg4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5746224","name":"Elise Vargas","idIMDB":"nm5746224"},"actorId":"nm5746224","character":"Stella","urlCharacter":"http://www.imdb.com/character/ch0506637","main":true},{"actorName":"Zoey Vargas","urlProfile":"http://www.imdb.com/name/nm5746225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzOTI2NjM4NV5BMl5BanBnXkFtZTgwOTM2Mzg4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Zoey Vargas is an actress, known for Neighbors (2014), Neighbors 2: Sorority Rising (2016) and Alexander and the Terrible, Horrible, No Good, Very Bad Day (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzOTI2NjM4NV5BMl5BanBnXkFtZTgwOTM2Mzg4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5746225","name":"Zoey Vargas","idIMDB":"nm5746225"},"actorId":"nm5746225","character":"Stella","urlCharacter":"http://www.imdb.com/character/ch0506637","main":true},{"actorName":"Brian Huskey","urlProfile":"http://www.imdb.com/name/nm1111656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjA4OTkwMF5BMl5BanBnXkFtZTcwNzE5NDU2OA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1968","placeOfBirth":" Charlotte, North Carolina, USA","height":"5' 11\" (1.8 m)","bio":"Brian Huskey was born on September 8, 1968 in Charlotte, North Carolina, USA. He is an actor and writer, known for Another Period (2015), Veep (2012) and Bob's Burgers (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjA4OTkwMF5BMl5BanBnXkFtZTcwNzE5NDU2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1111656","name":"Brian Huskey","idIMDB":"nm1111656"},"actorId":"nm1111656","character":"Bill Wazowkowski","urlCharacter":"http://www.imdb.com/character/ch0278553","main":true},{"actorName":"Ike Barinholtz","urlProfile":"http://www.imdb.com/name/nm0054697","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDY0NjMwOV5BMl5BanBnXkFtZTgwMDE4MTYxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1977","placeOfBirth":" Chicago, Illinois, USA","birthName":"Isaac Barinholtz","height":"6' 3\" (1.91 m)","bio":"Isaac \"Ike\" Barinholtz, born February 18, 1977, is an American actor, comedian, voice actor and writer, best known for his role as a cast member on MADtv (1995), from 2002-2007, and for his roles on The Mindy Project (2012), and Eastbound & Down (2009). He spent two years in Amsterdam with the famed comedy troupe, \"Boom Chicago\", along with Jordan Peele, Josh Meyers and Nicole Parker. Barinholtz hosted the \"Worst of Boom Night\", during a 10-year anniversary of the improve troupe, \"Boom Chicago\", where they performed their worst material from previous shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDY0NjMwOV5BMl5BanBnXkFtZTgwMDE4MTYxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0054697","name":"Ike Barinholtz","idIMDB":"nm0054697"},"actorId":"nm0054697","character":"Jimmy","urlCharacter":"http://www.imdb.com/character/ch0441550","main":true},{"actorName":"Carla Gallo","urlProfile":"http://www.imdb.com/name/nm0303013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5Njg5Njg4OV5BMl5BanBnXkFtZTcwMDEyNjAzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1975","placeOfBirth":" Brooklyn, New York, USA","birthName":"Carla Paolina Gallo","height":"5' 4\" (1.63 m)","bio":"Carla Gallo was born on June 24, 1975 in Brooklyn, New York, USA as Carla Paolina Gallo. She is an actress, known for Neighbors (2014), Superbad (2007) and Mission: Impossible III (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5Njg5Njg4OV5BMl5BanBnXkFtZTcwMDEyNjAzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0303013","name":"Carla Gallo","idIMDB":"nm0303013"},"actorId":"nm0303013","character":"Paula","urlCharacter":"http://www.imdb.com/character/ch0478397","main":true},{"actorName":"Zac Efron","urlProfile":"http://www.imdb.com/name/nm1374980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NjEwODI2NDBeQTJeQWpwZ15BbWU3MDM0NTc3NjM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1987","placeOfBirth":" San Luis Obispo, California, USA","birthName":"Zachary David Alexander Efron","height":"5' 8\" (1.73 m)","bio":"Zachary David Alexander Efron was born October 18, 1987 in San Luis Obispo, California. He is the son of Starla Baskett, a former secretary, and David Efron, an electrical engineer. He has a younger brother, Dylan. His surname, \"Efron\", is a Biblical place name, and comes from Zac's Polish Jewish paternal grandfather. The rest of Zac's recent ancestry is English, German, and Scottish. Zac was raised in Arroyo Grande, CA. He took his first step toward acting at the age of eleven, after his parents noticed his singing ability. Singing and acting lessons soon led to an appearance in a production of \"Gypsy\" that ran 90 performances, and he was hooked. After appearing on-stage in \"Peter Pan\", \"Auntie Mame\", \"Little Shop of Horrors\" and \"The Music Man\", guest parts quickly followed on television series, including Firefly (2002), ER (1994), CSI: Miami (2002), NCIS (2003), and The Guardian (2001). After guest-starring in several episodes of Summerland (2004), Zac joined the regular cast as girl-crazy Cameron Bale. He also starred in several pilots, such as The Big Wide World of Carl Laemke (2003) and Triple Play (2004), and played an autistic child in the television movie Miracle Run (2004), alongside Mary-Louise Parker and Aidan Quinn. He graduated from Arroyo Grande High School in June 2006. Efron came to fame for starring in the Disney Channel original film High School Musical (2006), for which he won the Teen Choice Award for Breakout Star. He returned to the role of Troy Bolton in High School Musical 2 (2007), which broke cable TV records with 17.5 million viewers. He played title roles of the fantasy romance Charlie St. Cloud (2010) and the comedy 17 Again (2009), both from director Burr Steers, and as the lovable Link Larkin in 2007's smash hit musical Hairspray (2007), directed by Adam Shankman. As part of the all-star cast he shared a Critics Choice Award for Best Acting Ensemble, the 2007 Hollywood Film Festival Award for Ensemble of the Year, and was honored with a Screen Actors Guild Award® nomination for Outstanding Motion Picture Cast. In addition, he won an MTV Movie Award for Breakthrough Performance. Efron also starred in Richard Linklater's Me and Orson Welles (2008), an adaptation of the novel by Robert Kaplow, which premiered to rave reviews at the 2008 Toronto Film Festival. That same year, he starred in Kenny Ortega's High School Musical 3: Senior Year (2008), which set a box office record for the highest grossing opening weekend for a musical. In 2012, Efron took the lead in The Lucky One (2012), a film adaptation of the Nicholas Sparks novel, playing a marine who returns to North Carolina after serving in Iraq in search for the unknown woman he believes was his good luck charm during the war. He also lent his voice to the animated feature Dr. Seuss' The Lorax (2012), and co-starred in Lee Daniels' thriller The Paperboy (2012), alongside Nicole Kidman, John Cusack, Matthew McConaughey and Scott Glenn, as well as Josh Radnor's Liberal Arts (2012), which premiered to rave reviews at the Sundance Film Festival. Another indie film he co-starred in, At Any Price (2012), was released in 2013. Most recently, Zac starred with Seth Rogen in the hit comedy film Neighbors (2014), headlined the 2015 drama We Are Your Friends (2015), and carried three 2016 comedies, Dirty Grandpa (2016), Neighbors 2: Sorority Rising (2016), and Mike and Dave Need Wedding Dates (2016). Efron's favorite sports include golf, skiing, rock climbing, and snowboarding. He added surfing after spending days on the beach for \"Summerland.\" He played the piano at home. He has also fixed up two cars in his spare time, a Delorean and '65 Mustang convertible, both treasured hand-me-downs from his even-more-treasured grandfather.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NjEwODI2NDBeQTJeQWpwZ15BbWU3MDM0NTc3NjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1374980","name":"Zac Efron","nicknames":["Zefron"],"idIMDB":"nm1374980"},"actorId":"nm1374980","character":"Teddy Sanders","urlCharacter":"http://www.imdb.com/character/ch0559371","main":true},{"actorName":"Dave Franco","urlProfile":"http://www.imdb.com/name/nm2002649","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMzYzMzYxMV5BMl5BanBnXkFtZTcwNTk2MDg4NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1985","placeOfBirth":" Palo Alto, California, USA","birthName":"David John Franco","height":"5' 7\" (1.7 m)","bio":"David John Franco was born in Palo Alto, California, to Betsy Franco, an author, and Douglas Eugene \"Doug\" Franco, who ran a Silicon Valley business. His mother is Jewish and his father was of Portuguese and Swedish descent. He has two older brothers, actor James Franco and Tom Franco. Dave made his first television appearance at the age of 21, in 2006, in an episode of 7th Heaven (1996). A string of high-profile TV work followed, interspersed with roles in some moderately successful movies, including Charlie St. Cloud (2010) and Fright Night (2011), and he came to bigger prominence when he played Eric Molson in the hit movie version of the cult TV series 21 Jump Street (2012). He subsequently co-starred in the zombie romance Warm Bodies (2013) and the thriller Now You See Me (2013), and provided a voice role for The Lego Movie (2014). His upcoming films include Neighbors (2014), 22 Jump Street (2014), and Unfinished Business (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMzYzMzYxMV5BMl5BanBnXkFtZTcwNTk2MDg4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2002649","name":"Dave Franco","nicknames":["Davy"],"idIMDB":"nm2002649"},"actorId":"nm2002649","character":"Pete","urlCharacter":"http://www.imdb.com/character/ch0419636","main":true},{"actorName":"Halston Sage","urlProfile":"http://www.imdb.com/name/nm4296013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDY5MDQyNV5BMl5BanBnXkFtZTcwMTIyMzcxNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1993","placeOfBirth":" Los Angeles, California, USA","birthName":"Halston Jean Schrage","height":"5' 5½\" (1.66 m)","bio":"A charming and striking actress, Halston Sage continues to gain fame, working alongside notable actors and filmmakers. She was most recently seen in the film Before I Fall (2017), based on the 2010 novel of the same name by Lauren Oliver. Later in 2017, Sage will appear on television in Seth MacFarlane's dramedy for Fox, Orville (2017). She was born Halston Jean Schrage in Los Angeles, California, to Lenny and Tema Schrage, and has two younger siblings, Max and Kate. In addition to her acting credits, Sage rode horses for eight years and is an award-winning equestrian. She possesses a great love for writing and was the editor of her school newspaper. Sage broke into modeling at the age of fourteen, when she realized she had a passion for acting. She guest-starred on Nickelodeon's Victorious (2010) and Bucket & Skinner's Epic Adventures, and starred as Brianna in the Jon Kasdan-directed teen drama film, The First Time (2012), opposite Britt Robertson, which premiered at the 2012 Sundance Film Festival. Sage also starred as Grace King, as one of the \"Perfs\", alongside Samantha Boscarino, on the Nickelodeon show, How to Rock (2012). In 2013, the actress joined Adam Sandler and an all-star cast in the ensemble hit, Grown Ups 2 (2013) for Sony Pictures. She also starred in Greg Francis' indie, Poker Night (2013), alongside Ron Perlman and Titus Welliver, and was seen alongside Emma Watson in Oscar®-winning director Sofia Coppola's biography drama, The Bling Ring (2013), and as Amber in Rand Ravich's NBC series, Crisis (2014), opposite Gillian Anderson and Dermot Mulroney. In 2014, she had a role in the film Neighbours (2014), with Zac Efron. Sage was a nominee for the MTV Movie Award \"Best Kiss\", for her onscreen kiss with Rose Byrne in the film. In 2015, Sage played Lacey Pemberton in the film Paper Towns (2015), alongside Nat Wolff and Cara Delevingne, based on the 2008 novel of the same name by John Green. Later that year, she co-starred in Sony Pictures' Goosebumps (2015), opposite Jack Black, Dylan Minnette, and Odeya Rush. Based on the popular children's book series of the same name by writer R.L. Stine, the film tells the story of a teenage boy who moves from New York City to the small town of Greendale, Maryland, only to discover his next door neighbor is the famed, but strange, bestselling author. Directed by Rob Letterman with a screenplay from Darren Lemke and Mike White, Also in 2015, she had a role in Paramount's Scouts Guide to the Zombie Apocalypse (2015), which centers on a group of boy scouts who rise to the occasion as their small town is faced with a zombie outbreak. Sage's co-stars include Tye Sheridan and Patrick Schwarzenegger. She is repped by CAA and Untitled.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDY5MDQyNV5BMl5BanBnXkFtZTcwMTIyMzcxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4296013","name":"Halston Sage","idIMDB":"nm4296013"},"actorId":"nm4296013","character":"Brooke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Mintz-Plasse","urlProfile":"http://www.imdb.com/name/nm2395586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjUzMDk5N15BMl5BanBnXkFtZTcwNzk0Nzk5Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1989","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Charles Mintz-Plasse","height":"5' 7½\" (1.71 m)","bio":"Christopher Mintz-Plasse was born on June 20, 1989 in Los Angeles, California, USA as Christopher Charles Mintz-Plasse. He is an actor, known for Superbad (2007), How to Train Your Dragon (2010) and Kick-Ass (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjUzMDk5N15BMl5BanBnXkFtZTcwNzk0Nzk5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2395586","name":"Christopher Mintz-Plasse","nicknames":["Chris"],"idIMDB":"nm2395586"},"actorId":"nm2395586","character":"Scoonie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerrod Carmichael","urlProfile":"http://www.imdb.com/name/nm4273797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUxOTA4NjI2M15BMl5BanBnXkFtZTcwMjg1MjQyOQ@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Jerrod Carmichael is a writer and actor, known for Neighbors (2014), Neighbors 2: Sorority Rising (2016) and The Carmichael Show (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUxOTA4NjI2M15BMl5BanBnXkFtZTcwMjg1MjQyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4273797","name":"Jerrod Carmichael","idIMDB":"nm4273797"},"actorId":"nm4273797","character":"Garf","urlCharacter":"http://www.imdb.com/character/ch0558432","main":true},{"actorName":"Craig Roberts","urlProfile":"http://www.imdb.com/name/nm1064292","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0N2U5ZDYtY2Q1ZS00YWE3LWFlYjUtMDhhNzFhNzYwZTk5XkEyXkFqcGdeQXVyNjA3MDE2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1991","placeOfBirth":" Bargoed, Wales, UK","height":"5' 8\" (1.73 m)","bio":"Craig Roberts was born on January 21, 1991 in Bargoed, Wales. He is an actor and director, known for Submarine (2010), 22 Jump Street (2014) and Neighbors (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0N2U5ZDYtY2Q1ZS00YWE3LWFlYjUtMDhhNzFhNzYwZTk5XkEyXkFqcGdeQXVyNjA3MDE2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1064292","name":"Craig Roberts","idIMDB":"nm1064292"},"actorId":"nm1064292","character":"Assjuice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ali Cobrin","urlProfile":"http://www.imdb.com/name/nm3196681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjgzMDE0MV5BMl5BanBnXkFtZTgwNzUzMzQ3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1989","placeOfBirth":" Chicago, Illinois, USA","birthName":"Alexandra Arley Cobrin","height":"5' 8\" (1.73 m)","bio":"Alexandra Alrey \"Ali\" Cobrin is an American actress. She is best known for her role as Molly in the Showtime series Look, and as Kara in the 2012 film American Reunion. Cobrin was born and raised in Chicago, Illinois. She attended high school at the Chicago Academy for the Arts where she majored in musical theater. Growing up, she trained to become a classical ballerina and competed in the Junior Olympics. Cobrin began her entertainment career as an improvisation player in the Second City's teen ensemble and danced with the Burklyn Ballet Theater touring Scotland, where she performed at the Edinburgh Fringe Festival. During that same time, Cobrin had work-shopped Broadway musicals, including All That Jazz and Wonderland, which were directed by Ben Verreen and Frank Wildhorn, respectively. After graduating high school at the age of 17, Cobrin moved to Los Angeles, California to pursue an acting career. Upon moving to Los Angeles, Cobrin had her first movie acting role in a 2008 short film entitled, One. That same year, she starred in another short film called, Jack Turner and the Reluctant Vampire, where it won two awards in the Los Angeles Accolade Competition. In 2009, Cobrin had a supporting role in The Hole, a 3D film directed by internationally renown sci-fi and comedy director Joe Dante. The film would win the first Premio Persol award for best 3-D movie at the 2009 Venice Film Festival. In 2010, Cobrin made her debut television appearance in Kings by Night, a comedy pilot for Spike TV, and Showtime's LOOK. Later that year, she had a lead actress role in the movie, Cold Cabin, and appeared opposite to rap superstar B.o.B in the Adidas Originals shoe campaign commercial, MEGA Diner. In 2011, she guest starred in the television series, Friends with Benefits. In 2012, Cobrin had a breakout supporting role in American Reunion, a sequel in American Pie film series. Her most current role is in Life's an Itch, which is still in post-production.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjgzMDE0MV5BMl5BanBnXkFtZTgwNzUzMzQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3196681","name":"Ali Cobrin","idIMDB":"nm3196681"},"actorId":"nm3196681","character":"Whitney","urlCharacter":"http://www.imdb.com/character/ch0006401","main":true},{"actorName":"Kira Sternbach","urlProfile":"http://www.imdb.com/name/nm2407665","urlPhoto":"","biography":{"height":"5' 4\" (1.63 m)","bio":"Kira Sternbach is an actress and casting director, known for Neighbors (2014), My Normal (2009) and Lately There Have Been Many Misunderstandings in the Zimmerman Home (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2407665","name":"Kira Sternbach","idIMDB":"nm2407665"},"actorId":"nm2407665","character":"Brittany","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2004420","urlIMDB":"http://www.imdb.com/title/tt2004420","business":{"budget":{"money":"$18,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$49,033,915","country":"USA","day":"11","month":"05","year":"2014","remarks":"3,279 Screens"},{"money":"HUF 51,369,481","country":"Hungary","day":"18","month":"05","year":"2014","remarks":""},{"money":"€352,000","country":"Italy","day":"25","month":"08","year":"2014","remarks":""},{"money":"€610,611","country":"Netherlands","day":"11","month":"05","year":"2014","remarks":"80 Screens"}],"gross":[{"money":"$149,771,255","country":"USA","day":"03","month":"08","year":"2014","remarks":""},{"money":"$149,093,030","country":"USA","day":"20","month":"07","year":"2014","remarks":""},{"money":"$148,636,110","country":"USA","day":"13","month":"07","year":"2014","remarks":""},{"money":"$147,241,155","country":"USA","day":"29","month":"06","year":"2014","remarks":""},{"money":"$145,716,950","country":"USA","day":"22","month":"06","year":"2014","remarks":""},{"money":"$143,022,215","country":"USA","day":"15","month":"06","year":"2014","remarks":""},{"money":"$137,925,650","country":"USA","day":"08","month":"06","year":"2014","remarks":""},{"money":"$128,601,000","country":"USA","day":"01","month":"06","year":"2014","remarks":""},{"money":"$116,908,000","country":"USA","day":"25","month":"05","year":"2014","remarks":""},{"money":"$91,517,000","country":"USA","day":"18","month":"05","year":"2014","remarks":""},{"money":"$49,033,915","country":"USA","day":"11","month":"05","year":"2014","remarks":""},{"money":"€827,000","country":"Italy","day":"07","month":"09","year":"2014","remarks":""},{"money":"€2,607,627","country":"Netherlands","day":"23","month":"07","year":"2014","remarks":""},{"money":"€2,574,452","country":"Netherlands","day":"16","month":"07","year":"2014","remarks":""},{"money":"€2,516,007","country":"Netherlands","day":"09","month":"07","year":"2014","remarks":""},{"money":"€2,449,774","country":"Netherlands","day":"02","month":"07","year":"2014","remarks":""},{"money":"€2,343,375","country":"Netherlands","day":"25","month":"06","year":"2014","remarks":""},{"money":"€2,233,423","country":"Netherlands","day":"18","month":"06","year":"2014","remarks":""},{"money":"€2,151,380","country":"Netherlands","day":"11","month":"06","year":"2014","remarks":""},{"money":"€2,020,039","country":"Netherlands","day":"04","month":"06","year":"2014","remarks":""},{"money":"€1,646,798","country":"Netherlands","day":"28","month":"05","year":"2014","remarks":""},{"money":"€1,239,959","country":"Netherlands","day":"21","month":"05","year":"2014","remarks":""},{"money":"€881,190","country":"Netherlands","day":"14","month":"05","year":"2014","remarks":""}],"weekendGross":[{"money":"$174,295","country":"USA","day":"03","month":"08","year":"2014","remarks":"177 Screens"},{"money":"$252,975","country":"USA","day":"20","month":"07","year":"2014","remarks":"230 Screens"},{"money":"$357,625","country":"USA","day":"13","month":"07","year":"2014","remarks":"267 Screens"},{"money":"$785,770","country":"USA","day":"29","month":"06","year":"2014","remarks":"510 Screens"},{"money":"$1,368,375","country":"USA","day":"22","month":"06","year":"2014","remarks":"1,033 Screens"},{"money":"$2,369,250","country":"USA","day":"15","month":"06","year":"2014","remarks":"1,896 Screens"},{"money":"$5,325,155","country":"USA","day":"08","month":"06","year":"2014","remarks":"2,674 Screens"},{"money":"$7,715,000","country":"USA","day":"01","month":"06","year":"2014","remarks":"2,939 Screens"},{"money":"$17,228,000","country":"USA","day":"25","month":"05","year":"2014","remarks":"3,266 Screens"},{"money":"$25,991,000","country":"USA","day":"18","month":"05","year":"2014","remarks":"3,311 Screens"},{"money":"$49,033,915","country":"USA","day":"11","month":"05","year":"2014","remarks":"3,279 Screens"},{"money":"€17,277","country":"Netherlands","day":"27","month":"07","year":"2014","remarks":"21 Screens"},{"money":"€18,242","country":"Netherlands","day":"20","month":"07","year":"2014","remarks":"35 Screens"},{"money":"€36,100","country":"Netherlands","day":"13","month":"07","year":"2014","remarks":"51 Screens"},{"money":"€40,890","country":"Netherlands","day":"06","month":"07","year":"2014","remarks":"67 Screens"},{"money":"€71,201","country":"Netherlands","day":"29","month":"06","year":"2014","remarks":"78 Screens"},{"money":"€85,203","country":"Netherlands","day":"22","month":"06","year":"2014","remarks":"83 Screens"},{"money":"€63,591","country":"Netherlands","day":"15","month":"06","year":"2014","remarks":"91 Screens"},{"money":"€95,750","country":"Netherlands","day":"08","month":"06","year":"2014","remarks":"92 Screens"},{"money":"€324,068","country":"Netherlands","day":"01","month":"06","year":"2014","remarks":"90 Screens"},{"money":"€262,343","country":"Netherlands","day":"25","month":"05","year":"2014","remarks":"87 Screens"},{"money":"€289,148","country":"Netherlands","day":"18","month":"05","year":"2014","remarks":"80 Screens"},{"money":"€610,611","country":"Netherlands","day":"11","month":"05","year":"2014","remarks":"80 Screens"}],"admissions":[{"money":"334,677","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"24","month":"05","year":"2013","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus 4:3, Panavision E- and G-Series Lenses","Red Epic, Panavision E- and G-Series Lenses"],"laboratory":["ColorWorks, Culver City (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA"],"filmLength":["2,649.42 m (6 reels)"],"negativeFormat":["Redcode RAW (5K)","SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6.4","metascore":"68","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Broadcast Film Critics Association Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Actress in a Comedy Movie","names":[{"name":"Rose Byrne","id":"nm0126284","role":null}]}]}]},{"award":"Denver Film Critics Society 2015","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Comedy Film","names":[]}]}]},{"award":"Golden Schmoes Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Comedy of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Golden Trailer","categories":[{"category":"Best Comedy TV Spot","names":[{"name":"Universal Pictures","id":null,"role":null},{"name":"Creative Workshop","id":null,"role":null}]},{"category":"Best Comedy Poster","names":[{"name":"Universal Pictures","id":null,"role":null},{"name":"Ignition Creative","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Comedy","names":[{"name":"Universal Pictures","id":null,"role":null},{"name":"Workhouse Creative","id":null,"role":null}]}]}]},{"award":"IGN Summer Movie Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won IGN Award","categories":[{"category":"Best Comedy Movie","names":[]}]}]},{"award":"MTV Movie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Best Shirtless Performance","names":[{"name":"Zac Efron","id":"nm1374980","role":null}]},{"category":"Best Duo","names":[{"name":"Zac Efron","id":"nm1374980","role":null},{"name":"Dave Franco","id":"nm2002649","role":null}]},{"category":"Best WTF Moment","names":[{"name":"Seth Rogen","id":"nm0736622","role":null},{"name":"Rose Byrne","id":"nm0126284","role":null}]}]},{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Fight","names":[{"name":"Seth Rogen","id":"nm0736622","role":null},{"name":"Zac Efron","id":"nm1374980","role":null}]},{"category":"Best Kiss","names":[{"name":"Rose Byrne","id":"nm0126284","role":null},{"name":"Halston Sage","id":"nm4296013","role":null}]},{"category":"Best Musical Moment","names":[{"name":"Seth Rogen","id":"nm0736622","role":null},{"name":"Zac Efron","id":"nm1374980","role":null}]},{"category":"Best Comedic Performance","names":[{"name":"Rose Byrne","id":"nm0126284","role":null}]}]}]},{"award":"People's Choice Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Comedic Movie","names":[]}]}]},{"award":"Young Hollywood Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Young Hollywood Award","categories":[{"category":"Best Threesome","names":[{"name":"Zac Efron","id":"nm1374980","role":null},{"name":"Dave Franco","id":"nm2002649","role":null},{"name":"Christopher Mintz-Plasse","id":"nm2395586","role":null}]},{"category":"Best Cast Chemistry - Film","names":[]}]}]}],"votes":"234,522","type":"Movie","companyCreditsSimple":[{"idCompany":"co0380492","name":"Good Universe"},{"idCompany":"co0345956","name":"Point Grey Pictures"}],"keywords":{"keywords":["friendship","topless female nudity","urination","jewish","broken leg","crotch grab","erection","sex scene","feuding neighbors","newspaper headline","reference to batman","fireworks","marijuana","reference to barack obama","reference to ray romano","reference to anne hathaway","police officer","condom","airbag","revenge","breast milk","cheating girlfriend","interrupted sex","hidden camera","dance off","dildo","lesbian kiss","beer pong","sex in a chair","bare chested male","male rear nudity","film starts with sex","character says i love you","neighbor neighbor relationship","husband wife relationship","party","male frontal nudity","fraternity","gay couple","police car explosion","one word title","realtor","finger gun","reference to samuel l. jackson","hospital","no opening credits","diversion","infant","cameo","rape joke","pool party","drawing","reference to the mario bros.","reference to christian bale","reference to michael keaton","slow motion scene","car crash","fistfight","kicked in the crotch","kicked in the stomach","punched in the stomach","punched in the face","reference to julius caesar","year 1985","year 1971","year 1930","college student","college dean","boyfriend girlfriend relationship","manipulation","scheming","hazing","gay kiss","flashback","montage","drunkenness","magic mushroom","marijuana joint","raised middle finger","character repeating someone else's dialogue","woman on top","father daughter relationship","mother daughter relationship","reference to robert deniro","fraternity brother","title spoken by character","black and white scene"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:49:33"}}