{"data":{"movies":[{"title":"Les voies du destin","originalTitle":"The Railway Man","year":"2013","releaseDate":"20140523","directors":[{"name":"Jonathan Teplitzky","id":"nm0855300"}],"writers":[{"name":"Frank Cottrell Boyce","id":"nm0101639"},{"name":"Andy Paterson","id":"nm0665466"}],"runtime":"116 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNDU1NjE0NF5BMl5BanBnXkFtZTgwODA3NDczMDE@._V1.jpg","countries":["Switzerland","UK","Australia"],"languages":["English","Japanese"],"genres":["Biography","Drama","Romance","War"],"plot":"Eric Lomax was one of thousands of Allied prisoners of war forced to work on the construction of the Thai/Burma railway during WW2. His experiences, after the secret radio he built to bring news and hope to his colleagues was discovered, left him traumatised and shut off from the world. Years later, he met Patti, a beautiful woman, on a train and fell in love. Patti was determined to rid Eric of his demons. Discovering that the young Japanese officer who haunted her husband was still alive, she faced a terrible decision. Should Eric be given a chance to confront his tormentor? Would she stand by him, whatever he did?","simplePlot":"A former British Army officer, who was tormented as a prisoner of war at a Japanese labor camp during World War II, discovers that the man responsible for much of his treatment is still alive and sets out to confront him.","actors":[{"actorName":"Jeremy Irvine","urlProfile":"http://www.imdb.com/name/nm3528539","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRhOGI3MWEtNTZjYy00MzA0LTlkM2UtZTM1MTE1NjY4NTM1XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1990","placeOfBirth":" Cambridge, Cambridgeshire, England, UK","birthName":"Jeremy William Fredric Smith","height":"6' (1.83 m)","bio":"Jeremy Irvine is an English stage and screen actor. He was born Jeremy William Fredric Smith in Gamlingay, Cambridgeshire, England, to Bridget (Glockling), a local politician, and Christopher Fredric Smith, an engineer. His stage surname, \"Irvine\", was his grandfather's first name. He attended one year of drama school at the London Academy of Music and Dramatic Art before catching Hollywood's eye starring in Steven Spielberg's 2011 epic war film \"War Horse.\" Irvine earned widespread critical acclaim for his role opposite Dakota Fanning in the independent film \"Now Is Good,\" leading critics to list him among Hollywood's fastest-rising stars. In 2013, he gained a reputation as a method actor after he dropped more than 25 pounds and performed his own torture scene stunts in the film adaptation of \"The Railway Man.\" Irvine will appear in several 2015 films, including \"The World Made Straight,\" \"Stonewall,\" \"Fallen\" and \"Beyond the Reach,\" in which he stars alongside Michael Douglas. His first role of the year was in The Woman in Black 2: Angel of Death (2014), which was released in theaters January 2.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRhOGI3MWEtNTZjYy00MzA0LTlkM2UtZTM1MTE1NjY4NTM1XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3528539","name":"Jeremy Irvine","idIMDB":"nm3528539"},"actorId":"nm3528539","character":"Young Eric","urlCharacter":"http://www.imdb.com/character/ch0274067","main":true},{"actorName":"Colin Firth","urlProfile":"http://www.imdb.com/name/nm0000147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDMwMTI4MF5BMl5BanBnXkFtZTcwMzE2MzQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1960","placeOfBirth":" Grayshott, Hampshire, England, UK","birthName":"Colin Andrew Firth","height":"6' 1½\" (1.87 m)","bio":"Colin Andrew Firth was born into an academic family in Grayshott, Hampshire, England. His mother, Shirley Jean (Rolles), was a comparative religion lecturer at the Open University, and his father, David Norman Lewis Firth, lectured on history at Winchester University College (formerly King Alfred's College) in Winchester, and worked on education for the Nigerian government. His grandparents were missionaries. His siblings Katie Firth and Jonathan Firth are also actors. Firth's first acting experience came in infant's school when he played \"Jack Frost\" in a Christmas pantomime. Three of his four grandparents were Methodist missionaries and he spent his early childhood in Nigeria, returning to England at age five where he entered a comprehensive school in Winchester. He spent two years at the Drama Centre London in Chalk Farm where he was \"discovered\" while playing \"Hamlet\" during his final term. His first professional role was as \"Bennet\" in the West End production of \"Another Country\". From this performance, he was chosen to play the character of \"Judd\" in the movie of the play. He went on to play a variety of character parts in both film and television. For his portrayal of \"Robert Lawrence\" in the 1989 TV production Tumbledown (1988), he received the Royal Television Society Best Actor award and also a BAFTA nomination. He also received a BAFTA nomination for \"Mr. Darcy\" in the 1995 TV version of Pride and Prejudice (1995). In 2011, he won the Oscar for Best Actor for his commanding leading role, playing British King George VI in The King's Speech (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDMwMTI4MF5BMl5BanBnXkFtZTcwMzE2MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000147","name":"Colin Firth","idIMDB":"nm0000147"},"actorId":"nm0000147","character":"Eric","urlCharacter":"http://www.imdb.com/character/ch0274067","main":true},{"actorName":"Stellan Skarsgård","urlProfile":"http://www.imdb.com/name/nm0001745","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDUzOTY0N15BMl5BanBnXkFtZTYwNjYxODE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1951","placeOfBirth":" Gothenburg, Västra Götalands län, Sweden","birthName":"John Stellan Skarsgård","height":"6' 3\" (1.91 m)","bio":"Stellan Skarsgård was born in Gothenburg, Västra Götalands län, Sweden, to Gudrun (Larsson) and Jan Skarsgård. He became a star in his teens through the title role in the TV-series Bombi Bitt och jag (1968). Between the years 1972-88 he was employed at The Royal Dramatic Theatre in Stockholm, where he participated in \"Vita rum\" (1988), August Strindberg's \"Ett drömspel\" (1986) and \"Mäster Olof\" (1988). Simultaneously Skarsgård did outstanding film roles, notably in The Simple-Minded Murderer (1982) by Hans Alfredson and with Fred Ward in American Playhouse: Noon Wine (1985). The fantastic performance gave him both a well-earned Guldbagge and Silver Berlin Bear. He portrayed the Skagen-painter Sören Kröyer in Hip Hip Hurrah! (1987) and the Swedish ambassador Raoul Wallenberg in Good Evening, Mr. Wallenberg (1990), both directed by Kjell Grede. Täcknamn Coq Rouge (1989) and Den demokratiske terroristen (1992) he played Jan Guillou's Swedish superagent Carl Hamilton. He also had the leading part in the Oscar nominated Oxen (1991) directed by the world-famous cinematographer Sven Nykvist. Skarsgård did his first (but small) role in an big American film with The Unbearable Lightness of Being (1988). The role of Captain Tupolev in The Hunt for Red October (1990) was at supposed to be biggest part in a Hollywood-film, but unfortunately it was cut down. His breakthrough instead came with Lars von Trier's Breaking the Waves (1996) opposite newcomer Emily Watson. After that Skarsgård got several supporting roles in American films, such as in My Son the Fanatic (1997), Gus Van Sant's Good Will Hunting (1997) and Steven Spielberg's Amistad (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDUzOTY0N15BMl5BanBnXkFtZTYwNjYxODE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001745","name":"Stellan Skarsgård","nicknames":["Skarzie"],"idIMDB":"nm0001745"},"actorId":"nm0001745","character":"Finlay","urlCharacter":"http://www.imdb.com/character/ch0365304","main":true},{"actorName":"Michael MacKenzie","urlProfile":"http://www.imdb.com/name/nm0533369","urlPhoto":"","biography":{"dateOfBirth":"1943","placeOfBirth":" Scotland, UK","bio":"Michael MacKenzie was born in 1943 in Scotland. He is an actor, known for Les voies du destin (2013), Ace of Wands (1970) and Lorna Doone (1990). He was previously married to Ann Holloway.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0533369","name":"Michael MacKenzie","idIMDB":"nm0533369"},"actorId":"nm0533369","character":"Sutton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicole Kidman","urlProfile":"http://www.imdb.com/name/nm0000173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1967","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Nicole Mary Kidman","height":"5' 11\" (1.8 m)","bio":"Elegant blonde Nicole Kidman, known as one of Hollywood's top Australian imports, was actually born in Honolulu, Hawaii, while her Australian parents were there on educational visas. Kidman is the daughter of Janelle Ann (Glenny), a nursing instructor, and Antony David Kidman, a biochemist and clinical psychologist. She is of English, Irish, and Scottish descent. Shortly after her birth, the family moved to Washington, D.C., where Nicole's father pursued his research on breast cancer, and then, three years later, made the pilgrimage back to her parents' native Sydney in Australia, where Nicole was raised. Young Nicole's first love was ballet, but she eventually took up mime and drama as well (her first stage role was a bleating sheep in an elementary school Christmas pageant). In her adolescent years, acting edged out the other arts and became a kind of refuge -- as her classmates sought out fun in the sun, the fair-skinned Kidman retreated to dark rehearsal halls to practice her craft. She worked regularly at the Philip Street Theater, where she once received a personal letter of praise and encouragement from audience member Jane Campion (then a film student). Kidman eventually dropped out of high school to pursue acting full-time. She broke into movies at age 16, landing a role in the Australian holiday favorite Bush Christmas (1983). That appearance touched off a flurry of film and television offers, including a lead in Le gang des BMX (1983) and a turn as a schoolgirl-turned-protester in the miniseries Vietnam (1987) (for which she won her first Australian Film Institute Award). With the help of an American agent, she eventually made her US debut opposite Sam Neill in the at-sea thriller Calme blanc (1989). Kidman's next casting coup scored her more than exposure. While starring as Tom Cruise's doctor/love interest in the racetrack romance Days of Thunder (1990), she won over the Hollywood hunk hook, line and sinker. After a whirlwind courtship (and decent box office returns), the couple wed on December 24, 1990. Determined not to let her new marital status overshadow her fledgling career, the actress pressed on. She appeared as a catty high school senior in the Australian film Flirting (1991), then as Dustin Hoffman's moll in the gangster flick Billy Bathgate (1991). She reunited with Cruise for Far and Away (1992), the story of young Irish lovers who flee to America in the late 1800s, and starred opposite Michael Keaton in the tear-tugger My Life (1993). Despite her steady employment, critics and moviegoers still had not quite warmed to Kidman as a leading lady. She tried to spice up her image by seducing Val Kilmer in Batman Forever (1995), but achieved her real breakthrough with Gus Van Sant's To Die For (1995). As a fame-crazed housewife determined to eliminate any obstacle in her path, Kidman proved that she had an impressive range and deadly comic timing. She took home a Golden Globe and several critics' awards for the performance. In 1996, Kidman stepped into a corset to work with her countrywoman and onetime admirer, Jane Campion, on the adaptation of Henry James's The Portrait of a Lady (1996). A few months later, she tore across the screen as a nuclear weapons expert in The Peacemaker (1997), adding \"action star\" to her professional repertoire. She and Cruise then disappeared into a notoriously long, secretive shoot for Stanley Kubrick's sexual thriller Eyes Wide Shut (1999). The couple's on-screen shenanigans prompted an increase in public speculation about their sex life (rumors had long been circulating that their marriage was a cover-up for Cruise's homosexuality); tired of denying tabloid attacks, they successfully sued The Star for a story alleging that they needed a sex therapist to coach them through love scenes. Family life has always been a priority for Kidman. Born to social activists (mother was a feminist; father, a labor advocate), Nicole and her little sister, Antonia Kidman, discussed current events around the dinner table and participated in their parents' campaigns by passing out pamphlets on street corners. When her mother was diagnosed with breast cancer, 17-year-old Nicole stopped working and took a massage course so that she could provide physical therapy (her mother eventually beat the cancer). She and Cruise adopted two children: Isabella Jane (born 1993) and Connor Antony (born 1995). Despite their rock-solid image, the couple announced in early 2001 that they were separating due to career conflicts. Her marriage to Cruise ended mid-summer of 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000173","name":"Nicole Kidman","nicknames":["Nic"],"idIMDB":"nm0000173"},"actorId":"nm0000173","character":"Patti","urlCharacter":"http://www.imdb.com/character/ch0273761","main":true},{"actorName":"Jeffrey Daunton","urlProfile":"http://www.imdb.com/name/nm0202401","urlPhoto":"","biography":{"bio":"Jeffrey Daunton is an actor, known for Les voies du destin (2013), The Princess Stallion (1997) and Personal Services (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0202401","name":"Jeffrey Daunton","idIMDB":"nm0202401"},"actorId":"nm0202401","character":"Burton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tanroh Ishida","urlProfile":"http://www.imdb.com/name/nm4437969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDY4OTE3MV5BMl5BanBnXkFtZTcwMDc0NDA3Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Tanroh Ishida, is a London based Japanese actor. He is both a classically trained actor from Guildhall School of Music and Drama, and a professionally trained Japanese Traditional Theatre actor. Tanroh started training in Japanese Traditional Noh/Kyogen Theatre at the age of three. His father and his father's master were his own masters in Japan, during this period. With his theatre company he performed at a number of theatres nationally and internationally; including the Carnegie Hall and Shakespeare's Globe. At the age of 15 Tanroh became interested in learning about the western style of theatre. He moved to England to study and audition for drama schools. He was accepted at the prestigious Guildhall School of Music and Drama. After graduating from Guildhall, Tanroh formed his own theatre company to explore his rare experiences as an actor, having had the unique privilege of classical training in both the East and West. This \"Tea Leaf Theatre\" company is based on his life time ambition of marrying Japanese and Western theatre and has received critical acclaim; such as 5 star reviews at the Edinburgh festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDY4OTE3MV5BMl5BanBnXkFtZTcwMDc0NDA3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4437969","name":"Tanroh Ishida","idIMDB":"nm4437969"},"actorId":"nm4437969","character":"Young Takeshi Nagase","urlCharacter":"http://www.imdb.com/character/ch0365305","main":true},{"actorName":"Tom Stokes","urlProfile":"http://www.imdb.com/name/nm2266493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1ODU4NDM2OV5BMl5BanBnXkFtZTgwODg5NzA0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tom Stokes is an actor, known for Equals (2015), Les voies du destin (2013) and Wasted on the Young (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1ODU4NDM2OV5BMl5BanBnXkFtZTgwODg5NzA0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2266493","name":"Tom Stokes","idIMDB":"nm2266493"},"actorId":"nm2266493","character":"Withins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan Probets","urlProfile":"http://www.imdb.com/name/nm2159255","urlPhoto":"","biography":{"bio":"Bryan Probets is an actor, known for Gatsby le magnifique (2013), Triangle (2009) and The Proposition (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2159255","name":"Bryan Probets","idIMDB":"nm2159255"},"actorId":"nm2159255","character":"Major York","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Hobbs","urlProfile":"http://www.imdb.com/name/nm2007534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyODEwMDUyN15BMl5BanBnXkFtZTgwNzU4NDAxNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Hobbs attended studied at the Victorian College of the Arts where he appeared onstage in productions such as, Innocence, Christie in Love, Much Ado About Nothing, Ghetto, and The Hollow. Hobbs also co-created and starred in Womb Division. Hobbs made his film debut in Peter Jackson's and later worked with Jackson again on the short film Crossing the Line. He has appeared in the short film Fetch, and featured in the docudrama Murder on the Blade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyODEwMDUyN15BMl5BanBnXkFtZTgwNzU4NDAxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2007534","name":"Tom Hobbs","idIMDB":"nm2007534"},"actorId":"nm2007534","character":"Thorlby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Reid","urlProfile":"http://www.imdb.com/name/nm2730580","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0Mjk5MjUwMV5BMl5BanBnXkFtZTgwMjkxNTEwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1987","placeOfBirth":" Australia","bio":"Sam Reid was born on February 19, 1987 in New South Wales Australia. He relocated to London where he graduated from the London Academy of Music and Dramatic Art as the 'star' student in 2010. During his final semester at LAMDA, he was cast in Anonymous (2011). He has worked with some of the biggest names in the British film industry including Vanessa Redgrave, Tom Wilkinson and Miranda Richardson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0Mjk5MjUwMV5BMl5BanBnXkFtZTgwMjkxNTEwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2730580","name":"Sam Reid","idIMDB":"nm2730580"},"actorId":"nm2730580","character":"Young Finlay","urlCharacter":"http://www.imdb.com/character/ch0365304","main":true},{"actorName":"Akos Armont","urlProfile":"http://www.imdb.com/name/nm3148809","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM4ODg2MDM0Ml5BMl5BanBnXkFtZTgwNDg2ODY3NTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Akos Armont is an actor and writer, known for Les voies du destin (2013), Lichen (2012) and Andy X (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM4ODg2MDM0Ml5BMl5BanBnXkFtZTgwNDg2ODY3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3148809","name":"Akos Armont","idIMDB":"nm3148809"},"actorId":"nm3148809","character":"Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Takato Kitamoto","urlProfile":"http://www.imdb.com/name/nm5498998","urlPhoto":"","biography":{"bio":"Takato Kitamoto is an actor and producer, known for Les voies du destin (2013), The Tsunami Warrior (2008) and Hand in the Glove (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5498998","name":"Takato Kitamoto","idIMDB":"nm5498998"},"actorId":"nm5498998","character":"Japanese Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith Fleming","urlProfile":"http://www.imdb.com/name/nm0281717","urlPhoto":"","biography":{"bio":"Keith Fleming is an actor, known for Les voies du destin (2013), Split Second (1999) and Reflections Upon the Origin of the Pineapple (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0281717","name":"Keith Fleming","idIMDB":"nm0281717"},"actorId":"nm0281717","character":"Removal Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Aldridge","urlProfile":"http://www.imdb.com/name/nm3198781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkxMzgwM15BMl5BanBnXkFtZTcwMzQ2MTQ0NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1985","placeOfBirth":" Devon, England, UK","birthName":"Ben Charles Aldridge","height":"6' 1\" (1.85 m)","bio":"Ben Aldridge was born on November 12, 1985 in Devon, England as Ben Charles Aldridge. He is an actor, known for Our Girl (2014), Fleabag (2016) and Toast (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzkxMzgwM15BMl5BanBnXkFtZTcwMzQ2MTQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3198781","name":"Ben Aldridge","idIMDB":"nm3198781"},"actorId":"nm3198781","character":"Baliff","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2058107","urlIMDB":"http://www.imdb.com/title/tt2058107","business":{"budget":{"money":"$18,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$61,845","country":"USA","day":"13","month":"04","year":"2014","remarks":"4 Screens"},{"money":"£1,230,483","country":"UK","day":"12","month":"01","year":"2014","remarks":"464 Screens"}],"gross":[{"money":"$4,435,083","country":"USA","day":"13","month":"07","year":"2014","remarks":""},{"money":"$4,407,458","country":"USA","day":"29","month":"06","year":"2014","remarks":""},{"money":"$4,361,685","country":"USA","day":"22","month":"06","year":"2014","remarks":""},{"money":"$4,306,993","country":"USA","day":"15","month":"06","year":"2014","remarks":""},{"money":"$4,232,898","country":"USA","day":"08","month":"06","year":"2014","remarks":""},{"money":"$2,260,440","country":"USA","day":"11","month":"05","year":"2014","remarks":""},{"money":"$1,629,354","country":"USA","day":"04","month":"05","year":"2014","remarks":""},{"money":"$895,291","country":"USA","day":"27","month":"04","year":"2014","remarks":""},{"money":"$252,402","country":"USA","day":"20","month":"04","year":"2014","remarks":""},{"money":"$61,845","country":"USA","day":"13","month":"04","year":"2014","remarks":""}],"weekendGross":[{"money":"$3,284","country":"USA","day":"13","month":"07","year":"2014","remarks":"11 Screens"},{"money":"$16,549","country":"USA","day":"29","month":"06","year":"2014","remarks":"38 Screens"},{"money":"$35,075","country":"USA","day":"22","month":"06","year":"2014","remarks":"84 Screens"},{"money":"$25,307","country":"USA","day":"15","month":"06","year":"2014","remarks":"50 Screens"},{"money":"$54,091","country":"USA","day":"08","month":"06","year":"2014","remarks":"177 Screens"},{"money":"$437,644","country":"USA","day":"11","month":"05","year":"2014","remarks":"181 Screens"},{"money":"$502,556","country":"USA","day":"04","month":"05","year":"2014","remarks":"164 Screens"},{"money":"$578,452","country":"USA","day":"27","month":"04","year":"2014","remarks":"156 Screens"},{"money":"$164,252","country":"USA","day":"20","month":"04","year":"2014","remarks":"26 Screens"},{"money":"$61,845","country":"USA","day":"13","month":"04","year":"2014","remarks":"4 Screens"},{"money":"£1,230,483","country":"UK","day":"12","month":"01","year":"2014","remarks":"464 Screens"}],"admissions":[{"money":"25,131","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":{"money":null,"country":null,"day":"24","month":"02","year":"2013","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"30","month":"04","year":"2012","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 56 min (116 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus, Zeiss Standard Speed, Super Speed and Angenieux Optimo Lenses"],"laboratory":["Deluxe Australia"],"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"7.1","metascore":"59","filmingLocations":[{"location":"Gold Coast, Queensland, Australia"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best International Film","names":[]}]}]},{"award":"Australian Cinematographers Society 2015","titlesAwards":[{"titleAwardOutcome":"Won Cinematographer of the Year","categories":[{"category":"The Mill Award","names":[{"name":"Garry Phillips","id":"nm0680407","role":null}]}]},{"titleAwardOutcome":"Won Golden Tripod","categories":[{"category":"Features - Cinema","names":[{"name":"Garry Phillips","id":"nm0680407","role":null}]}]}]},{"award":"Australian Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won AFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Nicole Kidman","id":"nm0000173","role":null}]}]},{"titleAwardOutcome":"Nominated AFCA Award","categories":[{"category":"Best Film","names":[]},{"category":"Best Director","names":[{"name":"Jonathan Teplitzky","id":"nm0855300","role":null}]},{"category":"Best Actor","names":[{"name":"Colin Firth","id":"nm0000147","role":null}]},{"category":"Best Screenplay","names":[{"name":"Frank Cottrell Boyce","id":"nm0101639","role":null},{"name":"Andy Paterson","id":"nm0665466","role":null}]},{"category":"Best Cinematography","names":[{"name":"Garry Phillips","id":"nm0680407","role":null}]}]}]},{"award":"Australian Screen Sound Guild 2014","titlesAwards":[{"titleAwardOutcome":"Nominated ASSG Award","categories":[{"category":"Feature Film Soundtrack of the Year","names":[]},{"category":"Best Achievement in Sound for Film Sound Mixing","names":[{"name":"Gethin Creagh","id":"nm0187098","role":null},{"name":"David White","id":"nm0924674","role":null},{"name":"Duncan McRae","id":"nm6384653","role":null},{"name":"Glenn Butler","id":"nm1713306","role":null}]},{"category":"Best Achievement in Sound for a Feature Film - Sound Design","names":[{"name":"Jared Dwyer","id":"nm3114153","role":null},{"name":"Justine Angus","id":"nm0029978","role":null},{"name":"Thom Kellar","id":"nm4650284","role":null},{"name":"Stuart Morton","id":"nm1157624","role":null},{"name":"Bronwyn Murphy","id":"nm0614133","role":null},{"name":"David White","id":"nm0924674","role":null},{"name":"Andrew Plain","id":"nm0686413","role":null},{"name":"Mick Boraso","id":"nm4928232","role":null},{"name":"Dan Johnston","id":"nm2738572","role":null},{"name":"Andrew Simmons","id":"nm3617460","role":null},{"name":"Blair Slater","id":"nm0805347","role":null},{"name":"Duncan McAllister","id":"nm0563969","role":null}]}]}]},{"award":"Film Critics Circle of Australia Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won FCCA Award","categories":[{"category":"Best Script","names":[{"name":"Frank Cottrell Boyce","id":"nm0101639","role":null},{"name":"Andy Paterson","id":"nm0665466","role":null}]}]},{"titleAwardOutcome":"Nominated FCCA Award","categories":[{"category":"Best Film","names":[{"name":"Chris Brown","id":"nm0113244","role":null},{"name":"Bill Curbishley","id":"nm0192612","role":null},{"name":"Andy Paterson","id":"nm0665466","role":null}]},{"category":"Best Director","names":[{"name":"Jonathan Teplitzky","id":"nm0855300","role":null}]},{"category":"Best Actor","names":[{"name":"Colin Firth","id":"nm0000147","role":null}]},{"category":"Best Actress","names":[{"name":"Nicole Kidman","id":"nm0000173","role":null}]},{"category":"Best Editing","names":[{"name":"Martin Connor","id":"nm0175438","role":null}]},{"category":"Best Production Design","names":[{"name":"Steven Jones-Evans","id":"nm0429497","role":null}]}]}]},{"award":"San Sebastián International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won SIGNIS Award","categories":[{"category":"","names":[{"name":"Jonathan Teplitzky","id":"nm0855300","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Seashell","categories":[{"category":"Best Film","names":[{"name":"Jonathan Teplitzky","id":"nm0855300","role":null}]}]}]}],"votes":"29,999","type":"Movie","companyCreditsSimple":[{"idCompany":"co0104308","name":"Archer Street Productions"},{"idCompany":"co0306455","name":"Latitude Media"},{"idCompany":"co0179392","name":"Lionsgate"}],"keywords":{"keywords":["physical torture","japanese soldier","pow camp","reference to adolf hitler","prisoner of war","englishwoman abroad","psychological torture","interpreter","what happened to epilogue","interrogation","violence","englishman abroad","suicide","forgiveness","forced labor","torture","based on true story","reference to celia johnson","burning tree","japanese","secret radio","radio","british","railway","train","world war two veteran","veteran","post traumatic stress disorder","order","beating","humans in cages","loss of friend","traumatic experience","traumatic past","war criminal","train ride","based on fact","based on autobiography","shouting","best friend","burma","thailand","husband wife relationship","prisoner transport","war crime","building a railroad","elephant","japanese flag","year 1980","passenger train","starvation","emaciation","suicide by hanging","hanging","railway station","bamboo cage","railroad building","revenge","flashback","bare chested male","waterboarding","world war two","comeuppance","map","funeral","museum","cemetery","vacuum tube","british flag","year 1942","lie"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:17:49"}}