{"data":{"movies":[{"title":"Hercules Saves Christmas","originalTitle":"Santa's Dog","year":"2012","releaseDate":"20121119","directors":[{"name":"Edward Hightower","id":"nm3509900"}],"writers":[{"name":"John Pizzo","id":"nm2122294"}],"runtime":"79 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5OTU4ODUyOV5BMl5BanBnXkFtZTcwOTM1MjQ3Ng@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Family"],"plot":"HERCULES SAVES CHRISTMAS takes us on a magical, fun-filled and touching journey. Max, an adorable yet mischievous twelve year old boy meets a talking dog named Hercules who takes him to the North Pole to meet Santa and argue his way onto the \"nice list.\"","simplePlot":"HERCULES SAVES CHRISTMAS takes us on a magical, fun-filled and touching journey. Max, an adorable yet mischievous twelve year old boy meets a talking dog named Hercules who takes him to the... ","actors":[{"actorName":"Hercules Rossi","urlProfile":"http://www.imdb.com/name/nm2726167","urlPhoto":"","biography":{"dateOfBirth":"20 November 2004","placeOfBirth":" Las Vegas, Nevada, USA","bio":"Hercules was rescued 2004 in Las Vegas when he was just six weeks old. Hercules was a destructive puppy during his first nine months of life and was almost adopted to a family when Shorty moved from Las Vegas to San Francisco. Shorty decided not to give Hercules away, and the rest is history! After some intense training, Hercules became Shorty's closest companion. When Shorty injured his back, Hercules was trained as his second service animal; Geisha is his first. Hercules' training as a service animal and entertainment dog was a complete success for Shorty. On his first day as a service animal, Hercules traveled by train. From the start, he acted as if he'd doing this for years. Switching trains, Hercules encountered his first challenge. The train system had delays due to technical problems; this led to overcrowding. Hercules completely was surrounded; as he could do nothing, he sat still and slept the entire ride. Upon arrival at the train station, Hercules and Shorty caught a San Francisco cable car. Once again, Hercules acted as if he'd been doing this for years. Following his cable-car trip, Hercules and Shorty said their prayers at a local church, and then they had play time in Washington Square Park. Then, they went to lounge and drink wine with old \"paisons.\" Once the break was over, they took a mini bus back to the train station to return home. Not bad for a day's work! Hercules does all sorts of service-dog work and also attends charity events. He's also a performer having been in film, commercials and television. With chaos and excitement frequently surrounding him, Hercules always is pleased to be around people. Hercules has become the number one service animal in Shorty's group. He has traveled all over the country and promoted himself in a positive light...even thought pit bulls usually have such a bad rap. Hercules certainly has established himself in the LA scene.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2726167","name":"Hercules Rossi","nicknames":["Herk"],"idIMDB":"nm2726167"},"actorId":"nm2726167","character":"Hercules","urlCharacter":"http://www.imdb.com/character/ch0385842","main":true},{"actorName":"Luigi Francis Shorty Rossi","urlProfile":"http://www.imdb.com/name/nm0744263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMzk3NzMxMl5BMl5BanBnXkFtZTcwNTAzNDIzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1969","placeOfBirth":" Los Angeles, California, USA","birthName":"Melvyn Louis Rossi II","height":"4' (1.22 m)","bio":"Shorty, grew up in two different worlds - one a middle/upper-class almost completely white suburban neighborhood of Los Angeles with his dwarf parents and the other in Nickerson Gardens Housing Projects in Watts, a section of South Central Los Angeles, where he lived with a family friend to avoid conflict at home. By the age of 15, Shorty was living on his own. When he was 18 years old, he was involved in a gang-related shooting and convicted of several felonies. He was sent to a youth facility and later to Folsom State Prison to serve a total sentence of 10 years, 10 months and 10 days. While in prison, Shorty turned his life around, and by the time he was released, he was determined to make something better out of his life. Looking to make a fresh start, Shorty turned to entertainment jobs and soon learned he could earn lucrative gigs as a little person. Shorty landed his first job in show business at Universal Studios Hollywood as \"Alvin\" for an Alvin and the Chipmunks stage show. Since then, he has appeared in several commercials and worked on several movies such as The Grinch with Jim Carrey; The Kid with Bruce Willis; Call Me Clause with Whoopie Goldberg; and ShowTime and Daddy Day Care with Eddie Murphy, among others. He's appeared on dozens of TV shows and has performed live on theatre for years. In 2000, Shorty founded his own company, Shortywood Productions, to provide and manage little people entertainers for all types of shows, private parties and corporate events. But Shorty has a special passion that's been a major part of his life since he was a teenager - championing the cause of pit bulls. Shorty has owned pit bulls since he was 14 and credits them with \"saving his life\" for being such loyal companions through some of the roughest times in his life. Because of this, Shorty took on another huge endeavor, forming Shorty's Pit Bull Rescue, a second business ;which rescues, rehabilitates and places neglected and abused pit bulls in loving, nurturing homes. Shorty's Rescue is not a shelter or a charity; its employees work tirelessly to help relieve the suffering of and prevent cruelty to pit bulls through education and activism. Through positive pit bull involvement in the community, Shorty's Pit Bull Rescue influences a healthy/much-deserved reputation for the breed. Shorty's Pit Bull Pet Stars have worked on several independent, student and short films as well as public-service commercials and various print ads. The group does volunteer work by visiting nursing homes, schools, functions and hospitals. After injuring himself in a stunt, Shorty became interested in service animal training. He trained one of his own pit bulls to be a service animal, and he actively has been involved in the Americans with Disabilities Act (ADA) community ever since. Currently, two of Shorty's dogs are registered service animals with one in training. Shorty is a workaholic by nature; therefore, he doesn't have much spare time for socializing. When in social settings, he often surrounds himself with people of all backgrounds in his home in Los Angeles and his second home in Mexico, where he also spends a lot of time promoting pit bull awareness. Shorty has a special place in his heart for his employees Ashley, Sebastian and Ronald, who are all little people. Shorty loves cigars, wine and relaxing with friends and his five pit bulls. As of September 2011, Shorty is working on new episodes of Pit Boss, producing a movie called \"Hercules Saves Christmas\" with his pit bull Hercules and writing a memoir of his life story which comes out in January 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMzk3NzMxMl5BMl5BanBnXkFtZTcwNTAzNDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0744263","name":"Luigi Francis Shorty Rossi","nicknames":["Shorty"],"idIMDB":"nm0744263"},"actorId":"nm0744263","character":"Brother Shorty / Hercules","urlCharacter":"http://www.imdb.com/character/ch0385842","main":true},{"actorName":"George Maguire","urlProfile":"http://www.imdb.com/name/nm0536574","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTk2NTIzN15BMl5BanBnXkFtZTgwNTAyNDIzODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1946","placeOfBirth":" Wilmington, Delaware, USA","height":"6' (1.83 m)","bio":"George Maguire is a renowned stage and film actor, director, and voice over artist. He has also been in the entertainment business since childhood appearing on stage and film. He is Professor Emeritius at Solano College Theater where he co-founded the Actor Training Program. His career began in as a teenager 1964 with Pittsburgh Civic Light Opera, it encompasses Broadway, Off- Broadway, regional theaters, Shakespeare Festivals and numerous films and TV shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTk2NTIzN15BMl5BanBnXkFtZTgwNTAyNDIzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0536574","name":"George Maguire","idIMDB":"nm0536574"},"actorId":"nm0536574","character":"Santa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mackenzie Phillips","urlProfile":"http://www.imdb.com/name/nm0680603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODg5OTM0NV5BMl5BanBnXkFtZTYwNDEzMzY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1959","placeOfBirth":" Alexandria, Virginia, USA","birthName":"Laura Mackenzie Phillips","height":"5' 7½\" (1.71 m)","bio":"Mackenzie Phillips was known for her role in the 1973 hit movie American Graffiti (1973). Two years later, she got the role that changed her life in the 1975 sitcom One Day at a Time (1975). The show was an instant success, and everything was going well until the third season was launched, when she was arrested for cocaine possession and lied about the incident on her uncredited appearance on Dinah and Her New Best Friends (1980). During the run of the 1979-1980 season, Mackenzie started to fall off the deep end. The producers didn't know what was wrong; she started getting tired and showing up late for rehearsals. On the set she was incoherent and the producers gave her a six-week leave of absence. In 1980, she was fired from the series, went to rehab, then returned in the fall of 1981. Sadly, in 1983, she fell asleep during a rehearsal. Producer Patricia Fass Palmer told her that she had to take another drug test, but she refused and left. She has since recovered and returned to acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODg5OTM0NV5BMl5BanBnXkFtZTYwNDEzMzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0680603","name":"Mackenzie Phillips","nicknames":["Mack"],"idIMDB":"nm0680603"},"actorId":"nm0680603","character":"Helen Dunn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marc McClure","urlProfile":"http://www.imdb.com/name/nm0566013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0OTk5MjUyMl5BMl5BanBnXkFtZTYwNDc4Njgy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1957","placeOfBirth":" San Mateo, California, USA","height":"5' 10\" (1.78 m)","bio":"Marc McClure was born on March 31, 1957 in San Mateo, California, USA. He is an actor, known for Back to the Future (1985), Back to the Future Part III (1990) and Apollo 13 (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0OTk5MjUyMl5BMl5BanBnXkFtZTYwNDc4Njgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566013","name":"Marc McClure","idIMDB":"nm0566013"},"actorId":"nm0566013","character":"Mr. Rosco","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Robinson","urlProfile":"http://www.imdb.com/name/nm4693806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MzQ0ODEyNF5BMl5BanBnXkFtZTcwNjI3NzgwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Anthony Robinson is an actor, known for Hercules Saves Christmas (2012) and I'm in Love with a Church Girl (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MzQ0ODEyNF5BMl5BanBnXkFtZTcwNjI3NzgwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4693806","name":"Anthony Robinson","idIMDB":"nm4693806"},"actorId":"nm4693806","character":"Max Moogle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Arroyo","urlProfile":"http://www.imdb.com/name/nm0037423","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE5NDQzMDg1Nl5BMl5BanBnXkFtZTgwMjA1Mzk3OTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1979","placeOfBirth":" Bronx, New York, USA","birthName":"Daniel Luis Arroyo","bio":"Danny Arroyo is the talented and charismatic producer/actor/writer who loves reading books (especially comics), working out, writing, fantasy football, boxing, video games, and attending movie revivals of classic films. He caught the \"acting bug\" after watching an interview by Christopher Reeve talking about playing \"Superman\". He has also won three \"Best Actor\" awards at various film festivals for his many roles and projects. Arroyo plays Rico Fisher in the true story film THE LAST SMILE, for which Arroyo won Best Actor at the 2017 Silicon Valley Film Festival. He stars in the horror film THE BEFORE TIME, the romantic comedy A MOVING ROMANCE, and the feature film cop drama thriller BRANDED for which Arroyo also produced. He can next be seen in the thriller BODY OF SIN, the adventure film PIRATE OF SOMALIA: AFRICAN MYSTIQUE, and the true story OUT OF CUBA which Arroyo will star, produce and co-wrote. Arroyo is a series regular on the TV series SANGRE NEGRA, for which he won the \"Best Actor\" award at the 2015 Vive Latino America Awards Show for playing Detective Christian Santos. SANGRE NEGRA stars veteran actors Erik Estrada and Eric Roberts. Arroyo won \"Best Actor\" at the California Film Festival for his work in the indie drama CHIMERA HOUSE, and has shared the big screen with some established film stars, including Danny Glover, Salma Hayek, Mel Gibson, Casper Van Dien, Amy Poehler, Seth Meyers, Rosanna Arquette, Eric Roberts, and David Carradine. He has memorable roles in the films, LETHAL WEAPON 4, THE VELOCITY OF GARY, WHITE RUSH, KILL KATIE MALONE, SPRING BREAKDOWN, GROUPIE, REPO CHICK, and FIVE THIRTEEN with Danny Trejo. On the small screen, Arroyo has made guest appearances on countless hit TV shows. He starred in the SyFy pilot The Resistance, and in TV movies including the TNT movie HARD TIME opposite Burt Reynolds, DEATH ROW opposite Stacy Keach, the Spike TV movie STREET WARRIOR alongside action star Max Martini; and Arroyo plays Rick Wilder in Animal Planet's first original holiday film HERCULES SAVES CHRISTMAS. Arroyo's completed feature screenplay, GAMERS, a comedic suspense cop thriller about the phenomena of obsessive video game playing, has been optioned. Arroyo is penning his 2nd and 3rd scripts titled \"ORION'S BELT\" and the romantic comedy, \"LONELY SATURDAY NIGHT SYNDROME\". Arroyo serves as an ambassador to The Christopher & Dana Reeve Foundation. He is a regular fixture on the Red Carpets for the Primetime and Daytime Emmy Awards, the Prism Awards, ALMA Awards, Imagen Awards and many more. Danny Arroyo is a member of the Television Academy (Emmys) where he stays active being a member of various committees. He produced, wrote and hosted a very successful live event for the TV Academy titled, \"HOLA: THE PHENOMENAL GROWTH OF LATINO TV\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE5NDQzMDg1Nl5BMl5BanBnXkFtZTgwMjA1Mzk3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0037423","name":"Danny Arroyo","idIMDB":"nm0037423"},"actorId":"nm0037423","character":"Rick Wilder","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathy Garver","urlProfile":"http://www.imdb.com/name/nm0308744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg5MjY2MjleQTJeQWpwZ15BbWU3MDEzNjI1ODY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1945","placeOfBirth":" Long Beach, California, USA","birthName":"Kathleen Marie Garver","height":"5' 1\" (1.55 m)","bio":"Kathy Garver was born in Long Beach, California Her break-through performance came as one of the young slaves in The Ten Commandments She is most well known for starring as the teenage niece of Uncle Bill Davis, Cissy Davis on Family Affair (1966). The show was nominated for Emmys in various categories during its five year run.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg5MjY2MjleQTJeQWpwZ15BbWU3MDEzNjI1ODY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0308744","name":"Kathy Garver","idIMDB":"nm0308744"},"actorId":"nm0308744","character":"Sister Augustus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Williams","urlProfile":"http://www.imdb.com/name/nm0930149","urlPhoto":"","biography":{"dateOfBirth":"13 January 1984","placeOfBirth":" Los Angeles, California, USA","height":"4' 4\" (1.32 m)","bio":"Brad Williams was born on January 13, 1984 in Los Angeles, California, USA. He is an actor and writer, known for Brad Williams: Fun Size (2015), Hercules Saves Christmas (2012) and Mascots (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0930149","name":"Brad Williams","idIMDB":"nm0930149"},"actorId":"nm0930149","character":"Elf Joseph","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arturo Gil","urlProfile":"http://www.imdb.com/name/nm0317727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2Njc2MTIyMl5BMl5BanBnXkFtZTYwNDIwOTAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1960","placeOfBirth":" New Orleans, Louisiana, USA","height":"3' 6\" (1.07 m)","bio":"Arturo Gil has a rare form of dwarfism and only stands three and half feet tall. His height hasn't stopped him from doing anything unless it's a vertical issue. A step stool or a ladder comes in handy. Gil was born in New Orleans, Louisiana but was raised in San Juan, Puerto Rico and is bilingual English/Spanish. Art's career expands over two decades and has traveled the world working on various films. He's a versatile actor and has played many different kinds of roles from mythical, to aliens, monsters, and even a drag queen. Gil would like to encourage writers, producers, directors and film companies to use actors with dwarfism or disabilities in films and television, to create a more realistic reflection of our world. \"Let's make it real!\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2Njc2MTIyMl5BMl5BanBnXkFtZTYwNDIwOTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317727","name":"Arturo Gil","idIMDB":"nm0317727"},"actorId":"nm0317727","character":"Evil Elf Rocky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dana Michael Woods","urlProfile":"http://www.imdb.com/name/nm0940561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjc1ODUzOF5BMl5BanBnXkFtZTcwMzE0NzgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Dana Michael Woods","height":"4' 9½\" (1.46 m)","bio":"Dana Michael Woods is known for his work on Girl in Progress (2012), Who's Your Caddy? (2007) and Swearnet: The Movie (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjc1ODUzOF5BMl5BanBnXkFtZTcwMzE0NzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940561","name":"Dana Michael Woods","idIMDB":"nm0940561"},"actorId":"nm0940561","character":"Elf Mickey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Van Vleet","urlProfile":"http://www.imdb.com/name/nm0888186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2I0YWE4NjQtNmQzOC00MmExLTg2OTAtNGI4YWExYmQ5MTdiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1942","placeOfBirth":" Denver, Colorado, USA","bio":"Richard Van Vleet, is a veteran actor who is best known for 13-year role as Dr. Chuck Tyler on the daytime Soap Opera All My Children. Mr. Van Vleet other television credits include Guiding Light, The Virginian, Cannon, Name of the Game, Dan August and Night Gallery. His film credits include Airport, Angel In My Pocket, Ben, and The Man Hunters. In recent years, Mr. Van Vleet has produced several Independent films including the award winning Judge Me Not, Mr. Van Vleet has instructed acting and film directing at the University of California Sacramento, Central Arizona College, JF Images and the Actors Workshop in Denver, and Japan. He last projects include the children's animated feature film \"Bongee Bear and the Kingdom of Rhythm\" and the 2006 Horror/Thriller \"Fallen Angels\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2I0YWE4NjQtNmQzOC00MmExLTg2OTAtNGI4YWExYmQ5MTdiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0888186","name":"Richard Van Vleet","idIMDB":"nm0888186"},"actorId":"nm0888186","character":"Rondo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maggie VandenBerghe","urlProfile":"http://www.imdb.com/name/nm2323235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWM5YjQ0NzgtNDQ1ZC00MTM1LTgxYzEtY2JhYzc5YWQ5NTMwXkEyXkFqcGdeQXVyNTIyMjc3MDc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Maggie VandenBerghe is an actress, known for Aliens in the Attic (2009), Junk Love (2007) and The Lonely (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWM5YjQ0NzgtNDQ1ZC00MTM1LTgxYzEtY2JhYzc5YWQ5NTMwXkEyXkFqcGdeQXVyNTIyMjc3MDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2323235","name":"Maggie VandenBerghe","idIMDB":"nm2323235"},"actorId":"nm2323235","character":"Sally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ronald Lee Clark","urlProfile":"http://www.imdb.com/name/nm1472251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0NTIyNTIyMl5BMl5BanBnXkFtZTcwNzgwMDgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ronald Lee Clark is an actor, known for Mirror Mirror (2012), Pit Boss (2010) and Epic Movie (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0NTIyNTIyMl5BMl5BanBnXkFtZTcwNzgwMDgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1472251","name":"Ronald Lee Clark","idIMDB":"nm1472251"},"actorId":"nm1472251","character":"Evil Elf Rocky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Abasolo","urlProfile":"http://www.imdb.com/name/nm4677319","urlPhoto":"","biography":{"bio":"Nick Abasolo is known for his work on Hercules Saves Christmas (2012), The Right Regrets (2013) and The Girl and the Graduate (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4677319","name":"Nick Abasolo","idIMDB":"nm4677319"},"actorId":"nm4677319","character":"Theater goer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2048854","urlIMDB":"http://www.imdb.com/title/tt2048854","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 19 min (79 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.2","filmingLocations":[],"rated":"PG","awards":[{"award":"Young Artist Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a TV Movie, Miniseries or Special - Leading Young Actor","names":[{"name":"Anthony Robinson","id":"nm4693806","role":null}]}]}]}],"votes":"132","type":"Movie","companyCreditsSimple":[{"idCompany":"co0353876","name":"Shortywood Productions"}],"keywords":{"keywords":["christmas"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:08:04"}}