{"data":{"movies":[{"title":"Perfect Sisters","originalTitle":"","year":"2014","releaseDate":"20141007","directors":[{"name":"Stanley M. Brooks","id":"nm0112253"}],"writers":[{"name":"Fab Filippo","id":"nm0277116"},{"name":"Bob Mitchell","id":"nm7850004"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjk4MzcyOF5BMl5BanBnXkFtZTgwMzQ3OTQyMTE@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"plot":"On January 18, 2003, police, alerted by a frantic 911 call from a distraught pair of teenage girls, arrived at the girls Toronto area town house to find their mother dead. It appeared the 44-year-old alcoholic, having slipped into a booze-and-pill stupor, drowned in her own bathwater. The death was ruled accidental by the authorities. In the months that followed, however, police were alerted to rumours and reports that the teenagers had been gossiping to friends about the accident. Police began piecing together rumours that suggested the teens might have had a hand in their mother's death. In fact, rather than an accident, the story that emerged portrayed the two teens as cold-blooded, premeditated killers.","simplePlot":"Tired of their mother's alcoholism and a string of her abusive boyfriends, two sisters plot to kill her.","actors":[{"actorName":"Abigail Breslin","urlProfile":"http://www.imdb.com/name/nm1113550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU5MTA5MzYzOF5BMl5BanBnXkFtZTcwODc4OTIxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1996","placeOfBirth":" New York City, New York, USA","birthName":"Abigail Kathleen Breslin","height":"5' 1\" (1.55 m)","bio":"Academy Award-nominated actress Abigail Breslin is one of the most sought-after actors of her generation. Her unique and charismatic talents have contributed to her versatile roles in both comedy and drama. Most recently, Breslin starred in the first season of the horror-comedy series, \"Scream Queens\" opposite Emma Roberts, Lea Michele and Jamie Lee Curtis. Next, Breslin will star in the coveted role of \"Baby\" in ABC/Lionsgate's recreation of the pop-culture classic, \"Dirty Dancing.\" On the big screen, Breslin was most recently seen in the Lionsgate film \"Maggie\" opposite Arnold Schwarzenegger. The film follows a teenage girl (Breslin) from a small town in the Midwest, who becomes infected by a disease that slowly turns her into a zombie. The film premiered at the 2015 Tribeca Film Festival in New York and was released on May 8, 2015. In October of 2015, Harper Collins published Breslin's first book \"This May Sound Crazy\". The book is based on her popular Tumblr \"Mixtapes & Winter Coats,\" in which she writes honest, funny and emotional observations on her daily life as a young adult. Breslin was seen in The Weinstein Company film \"August: Osage County\" opposite Meryl Streep, Ewan McGregor, Julia Roberts, Sam Shepard, Dermot Mulroney and Juliette Lewis. She starred in the coveted role of 'Jean Fordham' the daughter of Julia Roberts' and Ewan McGregor's characters. Most widely recognized for her role in the critically-acclaimed \"Little Miss Sunshine,\" the irreverent, antic comedy which created a sensation at the 2006 Sundance Film Festival, Breslin played the role of 'Olive,' an ambitious young girl who is obsessed with winning a beauty pageant. For her performance, she received a Best Actress Award from the Tokyo International Film Festival and was nominated for an Academy Award, SAG and BAFTA Best Supporting Actress awards. In addition, she was honored as ShoWest's \"Female Star of Tomorrow\" in 2008, and made her Broadway debut in 2010 in \"The Miracle Worker.\" Other film credits include \"Enders Game,\" \"Haunter,\" \"The Call,\" \"Rango,\" \"Janie Jones,\" \"Zombieland,\" \"My Sister's Keeper,\" \"New Year's Eve,\" \"Raising Helen, \"The Ultimate Gift,\" \"Santa Claus 3,\" \"No Reservations,\" \"Definitely Maybe,\" \"Nim's Island,\" \"Kit Kittredge: An American Girl\" and M. Night Shyamalan's 2012 film \"Signs\" opposite Mel Gibson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU5MTA5MzYzOF5BMl5BanBnXkFtZTcwODc4OTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1113550","name":"Abigail Breslin","nicknames":["Abbie"],"idIMDB":"nm1113550"},"actorId":"nm1113550","character":"Sandra Anderson","urlCharacter":"http://www.imdb.com/character/ch0281317","main":true},{"actorName":"Georgie Henley","urlProfile":"http://www.imdb.com/name/nm1670137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyOTEyODc1MDZeQTJeQWpwZ15BbWU3MDA5MjcwMzQ@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1995","placeOfBirth":" Ilkley, Yorkshire, England, UK","birthName":"Georgina Helen Henley","height":"5' 4\" (1.63 m)","bio":"Georgina Helen Henley was born July 9, 1995 in Ilkley, Yorkshire, England, the youngest of three daughters of Mike and Helen Henley. When she was young, she joined a local drama group called \"Upstagers\". It was there that she started her acting career, participating in stage performances such as \"Babushka: A Christmas Story\" and \"The Pied Piper\", prior to landing her first role in a film. When Pippa Hall, casting director for The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005) came to Georgie's town in search of children to play the four Pevensies, she knew Georgie was perfect for the role of \"Lucy\" after only one audition. Finally, after 18 months of auditioning, Georgie was picked from thousands of girls to play \"Lucy Pevensie\" in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005), which was her movie debut. She reprised her role in The Chronicles of Narnia: Prince Caspian (2008) and The Chronicles of Narnia: The Voyage of the Dawn Treader (2010). Georgie's promotion of the three Narnia films took her to New York, Orlando, Tokyo, Paris, and lots of other places around the world. Georgie has finished 6th form this summer at Bradford Grammar School, and will be attending Cambridge University, starting in fall 2013, to study English. She is no longer a part of her drama club \"Upstagers\", but hopes to continue her acting career on the big screen, and has also done some theater work at her school. In her free time, she enjoys watching films with her friends, and listening to and writing music. She says that if she doesn't keep acting in the future, she'd like to teach, or experiment with music or writing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyOTEyODc1MDZeQTJeQWpwZ15BbWU3MDA5MjcwMzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1670137","name":"Georgie Henley","idIMDB":"nm1670137"},"actorId":"nm1670137","character":"Beth Anderson","urlCharacter":"http://www.imdb.com/character/ch0281345","main":true},{"actorName":"Mira Sorvino","urlProfile":"http://www.imdb.com/name/nm0000227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDU1NDgwNl5BMl5BanBnXkFtZTYwNDIyOTM3._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1967","placeOfBirth":" New York City, New York, USA","birthName":"Mira Katherine Sorvino","height":"5' 10\" (1.78 m)","bio":"Mira Katherine Sorvino was born on September 28, 1967 in Manhattan. She is the daughter of Lorraine Davis, an actress turned drama therapist, and veteran character actor Paul Sorvino. Her father's family were Italian immigrants. The young Sorvino was intelligent, an avid reader and an exceptional scholar. Her father discouraged her from becoming an actor, as he knew how the industry often chews up young stars. She attended Harvard, majoring in Chinese, graduating magna cum laude in 1989, largely on the strength of her thesis, a Hoopes Prize-winning thesis on racial conflict in China, written and researched during the year spent in Beijing, which helped her fluency in Mandarin Chinese. However, she showed interest in a career in acting from an early age, and moved to New York City to try her hand in the City's film industry, waitressing, auditioning and working at the Tribeca production company of Robert De Niro. She succeeded in getting a little television work in the early 1990s, but got her first film job in the independent gangster movie Amongst Friends (1993), on which she worked her way up the ladder behind the camera to eventually associate-produce the film, and, more importantly, was eventually cast as the female lead. The indie production was well-received, and Sorvino's performance attracted enough buzz to get her cast in two more movies, one a more prominent indie, Barcelona (1994), the other her first Hollywood feature, Quiz Show (1994), and her skillful performances brought her yet more attention. An exceptionally poised and articulate young woman, she may have seemed inappropriate to play a crazy hooker, but Woody Allen took the chance, and her magnificent performance as the female lead in his Mighty Aphrodite (1995) proved her range as a performer and earned her an Oscar (at the tender age of 29) for Best Supporting Actress. Since winning the Oscar, Sorvino has continued to take a wide range of roles, including another stretch as Marilyn Monroe in Norma Jean & Marilyn (1996), co-starring with another very intelligent and skilled young actress, Ashley Judd. Forays into action and horror, such as Mimic (1997) and The Replacement Killers (1998) show that Sorvino is not above being playful in the film roles she chooses. However, what forever cemented her role in popular culture was her performance as charmingly silly California beach girl Romy White in Romy and Michele's High School Reunion (1997), in which she and co-star Lisa Kudrow utter one hilarious absurdity after another. Mira Sorvino married Christopher Backus on June 11, 2004, and the couple have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDU1NDgwNl5BMl5BanBnXkFtZTYwNDIyOTM3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000227","name":"Mira Sorvino","idIMDB":"nm0000227"},"actorId":"nm0000227","character":"Linda / Perfect Mom","urlCharacter":"http://www.imdb.com/character/ch0281397","main":true},{"actorName":"James Russo","urlProfile":"http://www.imdb.com/name/nm0751638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTExMjczMTIyNF5BMl5BanBnXkFtZTgwNTAxNTI5MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1953","placeOfBirth":" New York City, New York, USA","birthName":"James Vincent Russo","height":"5' 10\" (1.78 m)","bio":"A Manhattan-born character player who attended New York University, actor James Russo wrote and starred in a prize-winning short film, \"The Candy Store\", while attending college. His first big film break was as a convenience store robber in Fast Times at Ridgemont High (1982). Possessed with a stare that can bring shivers down one's back, he has been quite the accessible villain over the years, memorably portraying a number of gritty psychopaths and gangsters, among other undesirables. Surprisingly, Russo is not a name or commodity, yet an intense and dependable \"tough guy\" performer he has proven to be. One only needs to be reminded of his sadistic sexual animal role in \"Extremities\" on stage (in which he won a 1983 Theatre World) and in film (in which he terrorized Farrah Fawcett), to recall how chillingly effective he can be. Other decent roles in films include Kevin Costner's The Postman (1997) and Open Range (2003), plus Beverly Hills Cop (1984), We're No Angels (1989), Donnie Brasco (1997), No Way Home (1996), and a number of low-budget crimers. On stage, he has \"Welcome to Andromeda\", \"Deathwatch\", \"Marat/Sade\" and the afore-mentioned \"Extremities\" to his credit. Russo appeared opposite Johnny Depp in Roman Polanski's La neuvième porte (1999), and portrayed mobster \"Victor Mura\" in TV's short-lived, Falcone (2000), the following year. More recently, he offered a penetrating cameo as Frank Sinatra in Stealing Sinatra (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTExMjczMTIyNF5BMl5BanBnXkFtZTgwNTAxNTI5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751638","name":"James Russo","idIMDB":"nm0751638"},"actorId":"nm0751638","character":"Steve Bowman","urlCharacter":"http://www.imdb.com/character/ch0281348","main":true},{"actorName":"Rusty Schwimmer","urlProfile":"http://www.imdb.com/name/nm0005404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0MTM2ODU1NjVeQTJeQWpwZ15BbWU4MDcwNTU2MzQx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1962","placeOfBirth":" Chicago, Illinois, USA","birthName":"Deborah Schwimmer","bio":"Rusty Schwimmer was raised in Chicago, where she grew up a fan of the theater, music and the Chicago Cubs, Chicago Bears and Chicago Bulls. In her formative years, she endeavored to be a singer but quickly found her way to acting and was soon drawn from the world of theater in Chicago to the land of opportunity in Los Angeles. Rusty quickly found work in film and television. Some of her favorite films are A Little Princess (1995), Twister (1996), Edtv (1999), The Perfect Storm (2000), Runaway Jury (2003) and North Country (2005). She also enjoyed roles in the television film, The Man Who Captured Eichmann (1996), for HBO and the series, The Guardian (2001), Gilmore Girls (2000), Picket Fences (1992), Ned Blessing: The Story of My Life and Times (1993), as well as a guest starring role on Six Feet Under (2001). Schwimmer will next be seen in the feature, The Hawk Is Dying (2006), opposite Paul Giamatti, and recently appeared in the television mini-series, Broken Trail (2006), opposite Robert Duvall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0MTM2ODU1NjVeQTJeQWpwZ15BbWU4MDcwNTU2MzQx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005404","name":"Rusty Schwimmer","idIMDB":"nm0005404"},"actorId":"nm0005404","character":"Aunt Martha","urlCharacter":"http://www.imdb.com/character/ch0281347","main":true},{"actorName":"Zoë Belkin","urlProfile":"http://www.imdb.com/name/nm2629010","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5OTI5NzM0NF5BMl5BanBnXkFtZTcwODIyMDIzOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1993","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 4\" (1.63 m)","bio":"Zoë Belkin was born on May 3, 1993 in Toronto, Ontario, Canada. She is an actress, known for Carrie (2013), The Latest Buzz (2007) and Perfect Sisters (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5OTI5NzM0NF5BMl5BanBnXkFtZTcwODIyMDIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2629010","name":"Zoë Belkin","idIMDB":"nm2629010"},"actorId":"nm2629010","character":"Ashley","urlCharacter":"http://www.imdb.com/character/ch0281324","main":true},{"actorName":"Jeffrey Ballard","urlProfile":"http://www.imdb.com/name/nm0050629","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5OTg1MjI4NV5BMl5BanBnXkFtZTgwMjcyNzE1NDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1987","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Jeffrey Charles Ballard","height":"5' 8\" (1.73 m)","bio":"Jeff Ballard was born and raised in Vancouver, Canada. He has been acting for a number of years. He has appeared in a number of local films since he was young. His earlier works include Children of the corn; and more recently he has had roles in Riding the Bullet, Agent Cody Banks, John Tucker and others. Jeff recently shot four back to back leads in \"Forever 17\", \"Kid Cannabis\", \"The Marine Home front\" and \"Perfect Sisters\" alongside Abigail Breslin and Mira Sorvino. He is a familiar face in film and television and has appeared in more than forty diverse projects, including recurring leads on \"The Guard\", \"Kyle XY\", \"Tower Prep\" and \"The Haunting Hour\". Guest starring roles include \"Supernatural\", \"Painkiller Jane\", \"Smallville\" and \"Dark Angel\". No stranger to Features and MOW's, Jeff performed lead roles in \"National Lampoon's Ratko\", \"Pressed\", \"Snowmaggedon\", Jeff was also nominated for a \"Leo\" BC Film & Television Award for his work in \"Renegade Press.com\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5OTg1MjI4NV5BMl5BanBnXkFtZTgwMjcyNzE1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0050629","name":"Jeffrey Ballard","idIMDB":"nm0050629"},"actorId":"nm0050629","character":"Justin","urlCharacter":"http://www.imdb.com/character/ch0281349","main":true},{"actorName":"Jonathan Malen","urlProfile":"http://www.imdb.com/name/nm0539347","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgzOTU2MjQyNF5BMl5BanBnXkFtZTgwMjcwMDM5MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1987","placeOfBirth":" Toronto, Ontario, Canada","bio":"Jonathan Malen was born on October 23, 1987 in Toronto, Ontario, Canada. He is an actor and producer, known for Mean Girls (2004), Wild Kratts (2011) and Charlie Bartlett (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgzOTU2MjQyNF5BMl5BanBnXkFtZTgwMjcwMDM5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0539347","name":"Jonathan Malen","idIMDB":"nm0539347"},"actorId":"nm0539347","character":"David","urlCharacter":"http://www.imdb.com/character/ch0281346","main":true},{"actorName":"Stephan James","urlProfile":"http://www.imdb.com/name/nm4150847","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc0NTM4Njc2NF5BMl5BanBnXkFtZTgwNTk4NTYxMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1993","placeOfBirth":" Scarborough, Toronto, Ontario, Canada","height":"6' (1.83 m)","bio":"Stephan James was born on December 16, 1993 in Scarborough, Toronto, Ontario, Canada. He is an actor, known for La couleur de la victoire (2016), Selma (2014) and When the Game Stands Tall (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc0NTM4Njc2NF5BMl5BanBnXkFtZTgwNTk4NTYxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4150847","name":"Stephan James","idIMDB":"nm4150847"},"actorId":"nm4150847","character":"Donny","urlCharacter":"http://www.imdb.com/character/ch0281328","main":true},{"actorName":"Zak Santiago","urlProfile":"http://www.imdb.com/name/nm0015865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTA1MjQ4MV5BMl5BanBnXkFtZTcwNDM4NjEzMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1981","placeOfBirth":" Vancouver, British Columbia, Canada","bio":"Zak has also been a successful club and radio DJ in Canada and Europe throughout the last decade. A professional film and TV actor, dancer, and musician, he brings a complete and distinct energy as a performance artist.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTA1MjQ4MV5BMl5BanBnXkFtZTcwNDM4NjEzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015865","name":"Zak Santiago","idIMDB":"nm0015865"},"actorId":"nm0015865","character":"Detective Santiago Gates","urlCharacter":"http://www.imdb.com/character/ch0281327","main":true},{"actorName":"Caleb Pederson","urlProfile":"http://www.imdb.com/name/nm6432041","urlPhoto":"","biography":{"bio":"Caleb Pederson is an actor, known for Perfect Sisters (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6432041","name":"Caleb Pederson","idIMDB":"nm6432041"},"actorId":"nm6432041","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Braden Pederson","urlProfile":"http://www.imdb.com/name/nm6432042","urlPhoto":"","biography":{"bio":"Braden Pederson is an actor, known for Perfect Sisters (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6432042","name":"Braden Pederson","idIMDB":"nm6432042"},"actorId":"nm6432042","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sarah Constible","urlProfile":"http://www.imdb.com/name/nm0176164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTE2OTc2OF5BMl5BanBnXkFtZTcwODYyNDEzMQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1976","placeOfBirth":" Winnipeg, Manitoba, Canada","bio":"Sarah Constible was born on February 24, 1976 in Winnipeg, Manitoba, Canada. She is an actress and writer, known for The Haunting in Connecticut (2009), My Awkward Sexual Adventure (2012) and Inertia (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTE2OTc2OF5BMl5BanBnXkFtZTcwODYyNDEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176164","name":"Sarah Constible","idIMDB":"nm0176164"},"actorId":"nm0176164","character":"Female Police Officer","urlCharacter":"http://www.imdb.com/character/ch0281322","main":true},{"actorName":"Ed Sutton","urlProfile":"http://www.imdb.com/name/nm1285269","urlPhoto":"","biography":{"bio":"Ed Sutton is an actor and editor, known for Perfect Sisters (2014), Cannibalism: A New Taste in Style (2004) and East of Euclid (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1285269","name":"Ed Sutton","idIMDB":"nm1285269"},"actorId":"nm1285269","character":"Prosecutor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Huculak","urlProfile":"http://www.imdb.com/name/nm0399625","urlPhoto":"","biography":{"bio":"Robert Huculak is an actor and writer, known for Capote (2005), ATM (2012) and Inside Job (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0399625","name":"Robert Huculak","idIMDB":"nm0399625"},"actorId":"nm0399625","character":"Lawyer","urlCharacter":"http://www.imdb.com/character/ch0281325","main":true}],"seasons":[],"idIMDB":"tt2027231","urlIMDB":"http://www.imdb.com/title/tt2027231","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","metascore":"44","filmingLocations":[{"location":"Winnipeg, Manitoba, Canada"}],"rated":"TV-MA","awards":[{"award":"Prism Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Prism Award","categories":[{"category":"Performance in a Feature Film","names":[{"name":"Mira Sorvino","id":"nm0000227","role":null}]}]}]},{"award":"The Joey Awards, Vancouver 2014","titlesAwards":[{"titleAwardOutcome":"Won Joey Award","categories":[{"category":"Young Actor in a Television or Internet Show Series with less than 5 lines","names":[{"name":"Bryan Young","id":"nm5098035","role":null}]}]}]}],"votes":"4,793","type":"Movie","companyCreditsSimple":[{"idCompany":"co0124569","name":"Julijette"},{"idCompany":"co0402211","name":"Stan & Deliver Films"}],"keywords":{"keywords":["teenager"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:18:01"}}