{"data":{"movies":[{"title":"Non-Stop","originalTitle":"","year":"2014","releaseDate":"20140228","directors":[{"name":"Jaume Collet-Serra","id":"nm1429471"}],"writers":[{"name":"John W. Richardson","id":"nm1622147"},{"name":"Christopher Roach","id":"nm1496753"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3NzcxMjkzMl5BMl5BanBnXkFtZTgwMDY0NTQ0MDE@._V1.jpg","countries":["UK","France","USA","Canada"],"languages":["English","German"],"genres":["Action","Mystery","Thriller"],"plot":"Bill Marks, a former cop dealing with his daughter's death by drinking, is now a federal air marshal. While on a flight from New York to London, Marks gets a text telling him that unless 150 million dollars is transferred to an offshore account, someone will die every 20 minutes. Can he find the terrorist in time and save everyone?","simplePlot":"An air marshal springs into action during a transatlantic flight after receiving a series of text messages demanding $150 million into an off-shore account, or someone will die every 20 minutes.","actors":[{"actorName":"Liam Neeson","urlProfile":"http://www.imdb.com/name/nm0000553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1952","placeOfBirth":" Ballymena, Co. Antrim, Northern Ireland, UK","birthName":"William John Neeson","height":"6' 4\" (1.93 m)","bio":"Liam Neeson was born on June 7, 1952 in Ballymena, Northern Ireland, UK, to Katherine (Brown), a cook, and Bernard Neeson, a school caretaker. Liam worked as a forklift operator for Guinness, truck driver, assistant architect and an amateur boxer. He had originally sought a career as a teacher by attending St. Mary's Teaching College, Newcastle. However, in 1976, Neeson joined the Belfast Lyric Players' Theater and made his professional acting debut in the play \"The Risen People\". After two years, Neeson moved to Dublin's Abbey Theater where he performed the classics. It was here that he was spotted by director John Boorman and was cast in the film Excalibur (1981) as Sir Gawain, his first high-profile film role. Through the 1980s Neeson appeared in a handful of films and British TV series - including The Bounty (1984), A Woman of Substance (1984), The Mission (1986), and Duet for One (1986) - but it was not until he moved to Hollywood to pursue larger roles that he began to get noticed. His turn as a mute homeless man in Suspect (1987) garnered good reviews, as did supporting roles in The Good Mother (1988) and High Spirits (1988) - though he also starred in the best-to-be-forgotten Satisfaction (1988), which also featured a then-unknown Julia Roberts - but leading man status eluded him until the cult favorite Darkman (1990), directed by Sam Raimi. From there, Neeson starred in Under Suspicion (1991) and Ethan Frome (1993), was hailed for his performance in Woody Allen's Husbands and Wives (1992), and ultimately was picked by Steven Spielberg to play Oskar Schindler in Schindler's List (1993). The starring role in the Oscar-winning Holocaust film brought Neeson Academy Award, BAFTA and Golden Globe nominations for Best Actor. Also in 1993, he made his Broadway debut with a Tony-nominated performance in \"Anna Christie\", in which he co-starred with his future wife Natasha Richardson. The next year, the two also starred opposite Jodie Foster in the movie Nell (1994), and were married in July of that year. Leading roles as the 18th century Scottish Highlander Rob Roy (1995) and the Irish revolutionary leader Michael Collins (1996) followed, and soon Neeson was solidified as one of Hollywood's top leading men. He starred in the highly-anticipated Star Wars: Episode I - The Phantom Menace (1999) as Qui-Gon Jinn, received a Golden Globe nomination for Kinsey (2004), played the mysterious Ducard in Christopher Nolan's Batman Begins (2005), and provided the voice for Aslan in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). Neeson found a second surprise career as an action leading man with the release of Taken (2008) in early 2009, an unexpected box office hit about a retired CIA agent attempting to rescue his daughter from being sold into prostitution. However, less than two months after the release of the film, tragedy struck when Richardson suffered a fatal head injury while skiing and passed away days afterward. Neeson returned to high-profile roles in 2010 with two back-to-back big-budget films, Clash of the Titans (2010) and The A-Team (2010), and returned to the action genre with Unknown (2011), The Grey (2011), Battleship (2012) and Taken 2 (2012), as well as the sequel La colère des Titans (2012). Neeson was awarded Officer of the Order of the British Empire in the 1999 Queen's New Year's Honours List for his services to drama. He has two sons from his marriage to Richardson: Micheal Richard Antonio Neeson (born June 22, 1995) and Daniel Jack Neeson (born August 27, 1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000553","name":"Liam Neeson","idIMDB":"nm0000553"},"actorId":"nm0000553","character":"Bill Marks","urlCharacter":"http://www.imdb.com/character/ch0363446","main":true},{"actorName":"Julianne Moore","urlProfile":"http://www.imdb.com/name/nm0000194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDI1MjE2Ml5BMl5BanBnXkFtZTgwNDE0Nzk0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1960","placeOfBirth":" Fayetteville, North Carolina, USA","birthName":"Julie Anne Smith","height":"5' 3\" (1.6 m)","bio":"Julianne Moore was born Julie Anne Smith in Fort Bragg, North Carolina on December 3, 1960, the daughter of Anne (Love), a social worker, and Peter Moore Smith, a paratrooper, colonel, and later military judge. Her mother moved to the U.S. in 1951, from Greenock, Scotland. Her father, from Burlington, New Jersey, has German, Irish, German-Jewish, and English ancestry. Moore spent the early years of her life in over two dozen locations around the world with her parents, during her father's military career. She finally found her place at Boston University, where she earned her Bachelor of Fine Arts (B.F.A.) degree in acting from the School of the Performing Arts. After graduation (in 1983), She took the stage name \"Julianne Moore\" because there was another actress named \"Julie Anne Smith\". Julianne moved to New York and worked extensively in theater, including appearances off-Broadway in two Caryl Churchill plays, Serious Money and Ice Cream With Hot Fudge and as Ophelia in Hamlet at The Guthrie Theatre. But despite her formal training, Julianne fell into the attractive actress' trap of the mid-1980's: TV soaps and miniseries. She appeared briefly in the daytime serial The Edge of Night (1956) and from 1985 to 1988 she played two half-sisters Frannie and Sabrina on the soap As the World Turns (1956). This performance later led to an Outstanding Ingénue Daytime Emmy Award in 1988. Her subsequent appearances were in mostly forgettable TV-movies, such as Money, Power, Murder. (1989), The Last to Go (1991) and Cast a Deadly Spell (1991). She made her entrance into the big screen with 1990's Tales from the Darkside: The Movie (1990), where she played the victim of a mummy. Two years later, Julianne appeared in feature films with supporting parts in The Hand That Rocks the Cradle (1992) and the comedy The Gun in Betty Lou's Handbag (1992). She kept winning better and more powerful roles as time went on, including a small but memorable role as a doctor who spots Kimble Harrison Ford and attempts to thwart his escape in The Fugitive (1993). (A role that made such an impression on Steven Spielberg that he cast her in the Jurassic Park (1993) sequel without an audition in 1997). In one of Moore's most distinguished performances, she recapitulated her \"beguiling Yelena\" from Andre Gregory's workshop version of Chekhov's Uncle Vanya in Louis Malle's critically acclaimed Vanya on 42nd Street (1994). Director Todd Haynes gave Julianne her first opportunity to take on a lead role in Safe (1995). Her portrayal of Carol White, an affluent L.A. housewife who develops an inexplicable allergic reaction to her environment, won critical praise as well as an Independent Spirit Award nomination. Later that year she found her way into romantic comedy, co-starring as Hugh Grant's pregnant girlfriend in Nine Months (1995). Following films included Assassins (1995), where she played an electronics security expert targeted for death (next to Sylvester Stallone and Antonio Banderas) and Surviving Picasso (1996), where she played Dora Maar, one of the numerous lovers of Picasso (portrayed by her hero, Anthony Hopkins). A year later, after co-starring in Spielberg's The Lost World: Jurassic Park (1997), opposite Jeff Goldblum, a young and unknown director, Paul Thomas Anderson asked Julianne to appear in his movie, Boogie Nights (1997). Despite her misgivings, she finally was won over by the script and her decision to play the role of Amber Waves, a loving porn star who acts as a mother figure to a ragtag crew, proved to be a wise one, since she received both Golden Globe and Academy Award nominations. Julianne started 1998 by playing an erotic artist in The Big Lebowski (1998), continued with a small role in the social comedy Chicago Cab (1997) and ended with a subtle performance in Gus Van Sant's remake of Psycho (1960). 1999 had Moore as busy as an actress can be. She starred in a number of high-profile projects, beginning with Robert Altman's Cookie's Fortune (1999) , in which she was cast as the mentally challenged but adorable sister of a decidedly unhinged Glenn Close. A portrayal of the scheming Mrs. Cheveley followed in Oliver Parker's An Ideal Husband (1999) with a number of critics asserting that Moore was the best part of the movie. She then enjoyed another collaboration with director Anderson in Magnolia (1999) and continued with an outstanding performance in The End of the Affair (1999), for which she garnered another Oscar nomination. She ended 1999 with another great performance, that of a grieving mother in A Map of the World (1999), opposite Sigourney Weaver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDI1MjE2Ml5BMl5BanBnXkFtZTgwNDE0Nzk0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000194","name":"Julianne Moore","nicknames":["Juli"],"idIMDB":"nm0000194"},"actorId":"nm0000194","character":"Jen Summers","urlCharacter":"http://www.imdb.com/character/ch0363447","main":true},{"actorName":"Scoot McNairy","urlProfile":"http://www.imdb.com/name/nm1058940","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzMzc1NzM5M15BMl5BanBnXkFtZTcwNjAzOTc1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1977","placeOfBirth":" Dallas, Texas, USA","birthName":"John Marcus Mcnairy","height":"5' 8½\" (1.74 m)","bio":"During the early 2000s, actor Scoot McNairy quickly came to specialize in portrayals of colorful and individualistic young men with a slightly rebellious edge. McNairy began during the early to mid-2000s, with bit parts in films including Wonderland (2003), Herbie: Fully Loaded (2005), and Art School Confidential (2006). He took his first bow as a producer with 2007's In Search of a Midnight Kiss, in which he also starred. That indie romantic comedy concerns a young man (McNairy) all washed up on New Year's Eve -- until an impulsive ad on Craigslist leads him to the great love of his life (Sara Simmonds) and an extraordinary night on the town.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzMzc1NzM5M15BMl5BanBnXkFtZTcwNjAzOTc1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1058940","name":"Scoot McNairy","nicknames":["Scooter"],"idIMDB":"nm1058940"},"actorId":"nm1058940","character":"Tom Bowen","urlCharacter":"http://www.imdb.com/character/ch0416496","main":true},{"actorName":"Michelle Dockery","urlProfile":"http://www.imdb.com/name/nm1890784","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODEwMTk0MV5BMl5BanBnXkFtZTgwNzI5NTcxMDI@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1981","placeOfBirth":" Barking, Essex, England, UK","birthName":"Michelle Suzanne Dockery","height":"5' 8\" (1.73 m)","bio":"Michelle Suzanne Dockery born 15 December 1981 is an English actress and singer. She is best known for her role as Lady Mary Crawley in the ITV drama series Downton Abbey (2010-2015), for which she has been nominated for three consecutive Emmy Awards and a Golden Globe Award. She made her professional stage debut in His Dark Materials in 2004. For her role as Eliza Doolittle in the 2007 London revival of Pygmalion, she was nominated for the Evening Standard Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5ODEwMTk0MV5BMl5BanBnXkFtZTgwNzI5NTcxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1890784","name":"Michelle Dockery","idIMDB":"nm1890784"},"actorId":"nm1890784","character":"Nancy","urlCharacter":"http://www.imdb.com/character/ch0414518","main":true},{"actorName":"Nate Parker","urlProfile":"http://www.imdb.com/name/nm1676649","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk3MjE5NjE4NF5BMl5BanBnXkFtZTcwOTUzODY0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1979","placeOfBirth":" Norfolk, Virginia, USA","bio":"Nate Parker was born on November 18, 1979 in Norfolk, Virginia, USA. He is an actor and producer, known for The Birth of a Nation (2016), Non-Stop (2014) and The Great Debaters (2007). He has been married to Sarah DiSanto since 2007. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk3MjE5NjE4NF5BMl5BanBnXkFtZTcwOTUzODY0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1676649","name":"Nate Parker","idIMDB":"nm1676649"},"actorId":"nm1676649","character":"Zack White","urlCharacter":"http://www.imdb.com/character/ch0457672","main":true},{"actorName":"Corey Stoll","urlProfile":"http://www.imdb.com/name/nm1015684","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU5MjUwMDYzOF5BMl5BanBnXkFtZTcwMDcwOTkwOQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1976","placeOfBirth":" New York City, New York, USA","birthName":"Corey Daniel Stoll","height":"6' 2\" (1.88 m)","bio":"Corey Stoll was born on March 14, 1976 in New York City, New York, USA as Corey Daniel Stoll. He is an actor, known for Ant-Man (2015), The Bourne Legacy (2012) and The Strain (2014). He has been married to Nadia Bowers since June 21, 2015. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU5MjUwMDYzOF5BMl5BanBnXkFtZTcwMDcwOTkwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1015684","name":"Corey Stoll","idIMDB":"nm1015684"},"actorId":"nm1015684","character":"Austin Reilly","urlCharacter":"http://www.imdb.com/character/ch0457671","main":true},{"actorName":"Lupita Nyong'o","urlProfile":"http://www.imdb.com/name/nm2143282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTQ4MDY2Nl5BMl5BanBnXkFtZTgwNDk1MTEyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1983","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Lupita Amondi Nyong'o","height":"5' 5\" (1.65 m)","bio":"Lupita Amondi Nyong'o was born March 1, 1983 in Mexico City, Mexico, to Kenyan parents, Dorothy and Peter Anyang' Nyong'o. Her father, a senator, was then a visiting lecturer in political science. She was raised in Kenya. At age 16, her parents sent her back to Mexico for seven months to learn Spanish. She read film studies at Hampshire College, Massachusetts and, after working as a production assistant on several films, graduated from the Yale School of Drama's acting program. In 2013, she impressed cinema audiences in her film debut, as brutalized slave Patsey in acclaimed director Steve McQueen's 12 Years a Slave (2013). She was also the lead in MTV's award-winning drama series, Shuga (2009), appeared in the thriller Non-Stop (2014), and will have roles in the big-budget films Star Wars: The Force Awakens (2015) and The Jungle Book (2016). Lupita's stage credits include playing \"Perdita\" in \"The Winter's Tale\", (Yale Repertory Theater), \"Sonya\" in \"Uncle Vanya\", \"Katherine\" in \"The Taming of the Shrew\", as well as being in the original production of Michael Mitnick's \"Elijah\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTQ4MDY2Nl5BMl5BanBnXkFtZTgwNDk1MTEyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2143282","name":"Lupita Nyong'o","idIMDB":"nm2143282"},"actorId":"nm2143282","character":"Gwen","urlCharacter":"http://www.imdb.com/character/ch0409246","main":true},{"actorName":"Omar Metwally","urlProfile":"http://www.imdb.com/name/nm1272540","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI0OWVmMTAtMDNhMS00MGZkLThiZTgtNjhiNTY5ZGZjYzlhL2ltYWdlXkEyXkFqcGdeQXVyMjU0OTI0MTQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1974","placeOfBirth":" Queens, New York, USA","bio":"Omar Metwally was born in Queens, New York in 1975 to an Egyptian father and a Dutch mother, and moved with the family to Orange County, California at age three where he was raised. Metwally gained a BA in History from the University of California, Berkeley, and while acting around the Bay area gained an Master of Fine Arts in Acting from the American Conservatory Theater, San Francisco.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI0OWVmMTAtMDNhMS00MGZkLThiZTgtNjhiNTY5ZGZjYzlhL2ltYWdlXkEyXkFqcGdeQXVyMjU0OTI0MTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1272540","name":"Omar Metwally","idIMDB":"nm1272540"},"actorId":"nm1272540","character":"Dr. Fahim Nasir","urlCharacter":"http://www.imdb.com/character/ch0457670","main":true},{"actorName":"Jason Butler Harner","urlProfile":"http://www.imdb.com/name/nm0124798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODg0NjY0MV5BMl5BanBnXkFtZTcwNTAxNTk5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1970","placeOfBirth":" Elmira, New York, USA","height":"6' 1\" (1.85 m)","bio":"Jason Butler Harner was born on October 9, 1970 in Elmira, New York, USA. He is an actor, known for Changeling (2008), Ray Donovan (2013) and Non-Stop (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODg0NjY0MV5BMl5BanBnXkFtZTcwNTAxNTk5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0124798","name":"Jason Butler Harner","idIMDB":"nm0124798"},"actorId":"nm0124798","character":"Kyle Rice","urlCharacter":"http://www.imdb.com/character/ch0457669","main":true},{"actorName":"Linus Roache","urlProfile":"http://www.imdb.com/name/nm0730070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4Njc5MTk3NV5BMl5BanBnXkFtZTgwNDg3OTIxMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1964","placeOfBirth":" Manchester, Greater Manchester, England, UK","birthName":"Linus William Roache","height":"5' 10\" (1.78 m)","bio":"Linus Roache began his acting career with a two-week appearance as a young Barlow on Coronation Street (1960) at the age of 11. He also played a boy with the bubonic plague in The Onedin Line (1971). He spent much of the next two decades on stage. In 1986 he had brief appearances in a few films, including Link (1986). He was brought to attention in 1994 after appearing in the BBC TV series Seaforth (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4Njc5MTk3NV5BMl5BanBnXkFtZTgwNDg3OTIxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0730070","name":"Linus Roache","idIMDB":"nm0730070"},"actorId":"nm0730070","character":"David McMillan","urlCharacter":"http://www.imdb.com/character/ch0457668","main":true},{"actorName":"Shea Whigham","urlProfile":"http://www.imdb.com/name/nm0924154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMDUwNjg1NF5BMl5BanBnXkFtZTgwMzE0NjcxNDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1969","placeOfBirth":" Tallahassee, Florida, USA","birthName":"Franklin Shea Whigham Junior","height":"5' 8½\" (1.74 m)","bio":"Born in Florida, educated at Purchase, and coming from the NYC based theatre scene, Shea Whigham's big break came when director Joel Schumacher cast him opposite Colin Farrell in Tigerland (2000). Since then he has racked up impressive credits working with such legendary Hollywood directors as Martin Scorcese, Robert Redford, Terrence Malick, Werner Herzog, Oliver Stone, David O'Russell and Robert Rodriguez as well as the next generation such as Tim Van Patten, David Gordon Green and Jeff Nichols, among others. Shea has worked opposite such forces as Robert DeNiro, Anthony Hopkins, Christian Bale, Sean Penn and many others; and continues his role as 'Eli Thompson' on HBO's award-winning series Boardwalk Empire. He is married with 4 children and splits his time between NY and LA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMDUwNjg1NF5BMl5BanBnXkFtZTgwMzE0NjcxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0924154","name":"Shea Whigham","idIMDB":"nm0924154"},"actorId":"nm0924154","character":"Agent Marenick","urlCharacter":"http://www.imdb.com/character/ch0451465","main":true},{"actorName":"Anson Mount","urlProfile":"http://www.imdb.com/name/nm0609845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk5ODY0NTkzMV5BMl5BanBnXkFtZTgwNjY3Mzc5NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1973","placeOfBirth":" White Bluff, Tennessee, USA","birthName":"Anson Adams Mount IV","height":"6' (1.83 m)","bio":"Anson is an American actor, born in Mount Prospect, IL and grew up in White Bluff, Tennessee. His mother is Nancy Smith, a former professional golfer. His father Anson Adams Mount II was one of the original contributing editors to Playboy magazine. Anson has an older brother Anson Adams III and a sister Kristin from his father's first marriage. His great-great-great grandfather was a Confederate cavalry colonel in the Civil War. Anson attended the University of the South and Columbia University for MFA Acting Program from 1995-1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk5ODY0NTkzMV5BMl5BanBnXkFtZTgwNjY3Mzc5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0609845","name":"Anson Mount","idIMDB":"nm0609845"},"actorId":"nm0609845","character":"Jack Hammond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Quinn McColgan","urlProfile":"http://www.imdb.com/name/nm3824412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3Njk0Nzc3OV5BMl5BanBnXkFtZTgwNzE5ODc5NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"Quinn Kathleen Kersey McColgan","height":"5' 2½\" (1.59 m)","bio":"Quinn McColgan developed a love for acting at a young age. Since 2009 she has worked in the industry, pursuing modeling, commercials and legit work. Quinn's resume boasts playing the lead role of Ray Pierce opposite Kate Winslet in the EMMY award-winning HBO mini-series Mildred Pierce. She has also booked several pilots and episodics, including Blacklist, Member's Only, ABC's Dark Horse (Supporting), Polly (Lead) in PBS' The Odd Squad, and CBS' Unforgettable. In 2012 she was cast in the feature film 'Non-Stop' opposite Liam Neeson and Julianne Moore in the supporting role of Becca. During the 2014 holiday season she starred as Rosalie Twerski in Lifetime Network's Wishin' and Hopin, based on the best-selling novel by Wally Lamb. In 2015, Quinn was cast as the lead in the Sony Pictures' feature 'Extinction' where she filmed on location in Budapest, Hungary! She co-stared along with Matthew Fox and Jeffrey Donovan. In 'Love the Cooper's, based on the book \"Let it Snow\" by John Green, she plays the young version of Diane Keaton. Outside of acting, Quinn is an A student at her school, where she is on the soccer and lacrosse teams. She also plays the piano, guitar, and sings. But her favorite hobby is reading.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3Njk0Nzc3OV5BMl5BanBnXkFtZTgwNzE5ODc5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3824412","name":"Quinn McColgan","idIMDB":"nm3824412"},"actorId":"nm3824412","character":"Becca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corey Hawkins","urlProfile":"http://www.imdb.com/name/nm3659660","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNzA4MjA5OF5BMl5BanBnXkFtZTgwOTcyMjk1NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1988","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Corey Antonio Hawkins","height":"6' 3\" (1.91 m)","bio":"Corey Hawkins was born on October 22, 1988 in Washington, District of Columbia, USA as Corey Antonio Hawkins. He is an actor, known for Straight Outta Compton (2015), Non-Stop (2014) and Kong: Skull Island (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNzA4MjA5OF5BMl5BanBnXkFtZTgwOTcyMjk1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3659660","name":"Corey Hawkins","idIMDB":"nm3659660"},"actorId":"nm3659660","character":"Travis Mitchell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Deal","urlProfile":"http://www.imdb.com/name/nm1478067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MTIwOTI1Nl5BMl5BanBnXkFtZTcwOTI3NjA1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1958","placeOfBirth":" Birmingham, Alabama, USA","height":"5' 10\" (1.78 m)","bio":"Upon graduating from NYU's Graduate Acting Program, Frank began a 10 year career as a stage director. In the early 2000's he left directing to pursue an acting career full time. In 2001, he landed the recurring part of ADA Don Newvine on \"Law and Order: SVU. Since then he has performed in theatre, television, and film. He has appeared On and Off-Broadway in premieres of \"August: Osage County\" (The Music Box), \"The Most Fabulous Story Ever Told\" (by Paul Rudick / Minetta Lane), \"One Neck\" (The Atlantic w/ Alison Janney), \"Second-Hand Smoke\" (w/ Vera Farmiga at Primary Stages) and \"The Vietnamization of New Jersey\" (by Durang at The Beckett), among many others. Films include: \"The App\", \"Non-Stop\" (w/ Liam Neeson), \"The Bay\" (directed by Oscar winner Barry Levinson), \"The Amazing Spiderman 2\", \"Deception\" (w/ Ewan MacGregor / Hugh Jackman), \"The Corrections\" (Noah Baumbach), \"The House is Burning\" (Cannes), \"Flannel Pajamas\" (Sundance) and \"Body/Antibody\", among others. TV: FBI Special Agent O'Connell on Law and Order: SVU. Guest spots on, \"The Blacklist\", \"The Knick\" (Steven Soderbergh), \"Hostages\", \"Alpha House\", \"Boardwalk Empire\", \"Elementary\", \"Person of Interest\", \"Blue Bloods\", \"Nurse Jackie\", \"Unforgettable\", \"Royal Pains\", \"Fringe\", \"Onion News Network\", \"Sopranos\", \"Law & Order\" and others. Faculty member of The Juilliard School (Drama Division) since 2000. Regional credits include, Mister Roberts (Kennedy Center), Side Man (as Genie Glimmer at The Guthrie), Six Years (by Sharr White at ATL's Humana Festival), The Black Dahlia (Yale Rep), among many others. Frank has had the great pleasure of working with such actors as Robert DeNiro, Al Pacino, Christopher Walken, Andy Garcia, Julianne Moore, Diane Weist, Maggie Gyllenhall, Stacey Keach, Melissa Leo, Michael Stuhlbarg, Estelle Parsons, Michelle Dockery, and Lupita Nyong'o among others... And with directors that include, Barry Levinson, Jaume Collet-Serra, Mark Wing-Davey, Noah Baumbach, Liviu Culei, Christopher Ashley, Ethan McSweeney, Moises Kaufman, etc. In addition to a busy schedule acting these days, Frank has enjoyed teaching (and being taught) \"Play\" at The Juilliard School's Drama Division, his artistic home for the last 15 years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MTIwOTI1Nl5BMl5BanBnXkFtZTcwOTI3NjA1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1478067","name":"Frank Deal","idIMDB":"nm1478067"},"actorId":"nm1478067","character":"Charles Wheeler","urlCharacter":"http://www.imdb.com/character/ch0507635","main":true}],"seasons":[],"idIMDB":"tt2024469","urlIMDB":"http://www.imdb.com/title/tt2024469","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$28,875,635","country":"USA","day":"02","month":"03","year":"2014","remarks":"3,090 Screens"},{"money":"£2,652,364","country":"UK","day":"02","month":"03","year":"2014","remarks":"453 Screens"},{"money":"HUF 48,381,563","country":"Hungary","day":"02","month":"03","year":"2014","remarks":""}],"gross":[{"money":"$92,168,600","country":"USA","day":"05","month":"02","year":"2015","remarks":""},{"money":"$91,104,080","country":"USA","day":"11","month":"05","year":"2014","remarks":""},{"money":"$90,716,200","country":"USA","day":"04","month":"05","year":"2014","remarks":""},{"money":"$90,490,705","country":"USA","day":"27","month":"04","year":"2014","remarks":""},{"money":"$90,147,130","country":"USA","day":"20","month":"04","year":"2014","remarks":""},{"money":"$89,454,530","country":"USA","day":"13","month":"04","year":"2014","remarks":""},{"money":"$88,104,120","country":"USA","day":"06","month":"04","year":"2014","remarks":""},{"money":"$85,091,060","country":"USA","day":"30","month":"03","year":"2014","remarks":""},{"money":"$78,709,555","country":"USA","day":"23","month":"03","year":"2014","remarks":""},{"money":"$68,805,115","country":"USA","day":"16","month":"03","year":"2014","remarks":""},{"money":"$52,568,530","country":"USA","day":"09","month":"03","year":"2014","remarks":""},{"money":"$28,875,635","country":"USA","day":"02","month":"03","year":"2014","remarks":""},{"money":"£6,905,787","country":"UK","day":"16","month":"03","year":"2014","remarks":""},{"money":"£5,364,237","country":"UK","day":"09","month":"03","year":"2014","remarks":""},{"money":"£2,652,364","country":"UK","day":"02","month":"03","year":"2014","remarks":""},{"money":"$173,201","country":"Portugal","day":"05","month":"02","year":"2015","remarks":""}],"weekendGross":[{"money":"$328,145","country":"USA","day":"11","month":"05","year":"2014","remarks":"236 Screens"},{"money":"$152,530","country":"USA","day":"04","month":"05","year":"2014","remarks":"218 Screens"},{"money":"$203,175","country":"USA","day":"27","month":"04","year":"2014","remarks":"252 Screens"},{"money":"$379,270","country":"USA","day":"20","month":"04","year":"2014","remarks":"360 Screens"},{"money":"$750,225","country":"USA","day":"13","month":"04","year":"2014","remarks":"762 Screens"},{"money":"$1,793,330","country":"USA","day":"06","month":"04","year":"2014","remarks":"1,724 Screens"},{"money":"$4,010,885","country":"USA","day":"30","month":"03","year":"2014","remarks":"2,515 Screens"},{"money":"$6,434,825","country":"USA","day":"23","month":"03","year":"2014","remarks":"2,945 Screens"},{"money":"$10,615,305","country":"USA","day":"16","month":"03","year":"2014","remarks":"3,183 Screens"},{"money":"$10,615,305","country":"USA","day":"16","month":"03","year":"2014","remarks":"3,183 Screens"},{"money":"$15,829,605","country":"USA","day":"09","month":"03","year":"2014","remarks":"3,113 Screens"},{"money":"$15,829,605","country":"USA","day":"09","month":"03","year":"2014","remarks":"3,113 Screens"},{"money":"$28,875,635","country":"USA","day":"02","month":"03","year":"2014","remarks":"3,090 Screens"},{"money":"£901,107","country":"UK","day":"16","month":"03","year":"2014","remarks":"453 Screens"},{"money":"£1,496,108","country":"UK","day":"09","month":"03","year":"2014","remarks":"453 Screens"},{"money":"£2,652,364","country":"UK","day":"02","month":"03","year":"2014","remarks":"453 Screens"}],"admissions":[{"money":"178,439","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"11","year":"2012","remarks":null},{"money":null,"country":null,"day":"29","month":"01","year":"2013","remarks":null}],"copyrightHolder":"(C) 2013 Dark Castle Holding, LLC. All Rights Reserved."},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Cooke S4 and Angenieux Optimo Lenses","Arricam ST, Cooke S4 and Angenieux Optimo Lenses","Arriflex 235, Cooke S4 and Angenieux Optimo Lenses","Arriflex 435, Cooke S4 and Angenieux Optimo Lenses"],"laboratory":["Company 3, New York (NY), USA (digital intermediate)","Technicolor, New York (NY), USA"],"filmLength":["2,918.17 m (6 reels)"],"negativeFormat":["35 mm (Fuji)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"7,0","metascore":"56","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG-13","awards":[{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Thriller","names":[{"name":"Universal Pictures","id":null,"role":null},{"name":"Giaranamo Productions","id":null,"role":null}]}]}]}],"votes":"210 313","type":"Movie","companyCreditsSimple":[{"idCompany":"co0047476","name":"StudioCanal"},{"idCompany":"co0413801","name":"Anton Capital Entertainment (ACE)"},{"idCompany":"co0019968","name":"Silver Pictures"}],"keywords":{"keywords":["suspense","die hard scenario","mystery villain","mind game","psychological thriller","deception","passenger","containment","cat and mouse","hitchcockian","psycho thriller","psychological manipulation","hidden truth","hostage","anti villain","knife","child in peril","no opening credits","cell phone","little girl","surprise ending","terrorist","death","air marshal","transatlantic flight","flight attendant","bomb","alcoholic","hijacking","hijacker","hijack","police shootout","dead pilot","cockpit","2010s","multiple suspects","bomb explosion","bomb timer counting down","emergency landing","suspected terrorist","ribbon","off duty cop","instant messaging","hyphen in title","framed for crime","wristwatch","betrayal","government agent","fear","sociopath","federal agent","firefighter","fire truck","ambulance","passport","threatened with a knife","power outage","burned alive","bar","dereliction of duty","lawyer","explosive decompression","airplane accident","product placement","camera phone","duct tape","held at gunpoint","badge","englishwoman","fighter jet","timebomb","drug smuggling","violence","gunfight","shootout","hand to hand combat","mixed martial arts","martial arts","brawl","nosebleed","surveillance","rogue agent","strangulation","fight","stabbed to death","stabbed in the arm","torture","interrogation","tattoo","news report","false accusation","set up","one day","paranoia","text messaging","beating","desert eagle","terrorist plot","redemption","pilot","teacher","police officer","rain","airport","metal detector","new york city","ex cop","warrior","tough guy","one man army","anti hero","action hero","ps vita","playstation vita","cartoon on tv","disaster film","poisoned to death","fear of flying","aggressive passenger","riot","police brutality","in flight explosion","bomb on plane","nose","out of radar range","intercontinental airflight","crash landing","conspiracy","revenge","briefcase","red herring","american abroad","iceland","blowgun","police officer shot","scar","stabbed in the leg","terrorism","threat","ransom","slow motion scene","shot to death","shot in the forehead","shot in the shoulder","foaming at the mouth","pistol whip","doctor","airplane hijacking","suspicion","hands tied","poison dart","poison","cocaine","neck breaking","hit on the head with a fire extinguisher","head butt","kicked in the chest","broken nose","punched in the nose","punched in the stomach","punched in the face","ex soldier","character repeating someone else's dialogue","manipulation","one night","race against time","airplane pilot","airplane crash","explosion","death of daughter","fistfight","cellphone video","death of pilot","trust","cigarette smoking","toilet","smartphone","jfk international airport queens new york city","reference to september 11 2001","post september 11 2001","murder","pistol","airplane","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 21:54:55"}}