{"data":{"movies":[{"title":"Postman Pat: The Movie","originalTitle":"","year":"2014","releaseDate":"20140523","directors":[{"name":"Mike Disa","id":"nm1918538"}],"writers":[{"name":"Annika Bluhm","id":"nm1326421"},{"name":"Nicole Dubuc","id":"nm0239635"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0OTU3NTI4OF5BMl5BanBnXkFtZTgwMTc1MjUwMjE@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Animation","Comedy","Family"],"plot":"A veteran postman finds his beliefs challenged after he enters a TV talent show competition.","simplePlot":"A veteran postman finds his beliefs challenged after he enters a TV talent show competition.","actors":[{"actorName":"Stephen Mangan","urlProfile":"http://www.imdb.com/name/nm0542118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNDUxMzc3N15BMl5BanBnXkFtZTgwNDY4NzUxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1968","placeOfBirth":" Ponders End, London Borough of Enfield, North London, England, UK","height":"6' (1.83 m)","bio":"After graduating from RADA in 1994, Cambridge law graduate Mangan did not pursue lead roles on-screen, preferring to take what he saw as the less limited opportunities on the stage. Between 1994 and 2000, he performed in plays by (among others) Shakespeare, Shaw, Coward, Benn and Goldsmith throughout the UK and the West End before joining world-renowned theatre company Cheek by Jowl for an international tour of Much Ado About Nothing, earning him a nomination for a National Theatre Ian Charleson Award. He worked again for director Declan Donnellan at the Royal Shakespeare Company in School for Scandal, and at the Savoy Theatre, London in Hay Fever. In 2008 he played the title role in The Norman Conquests, directed by Matthew Warchus, at The Old Vic Theatre, London and then at the Circle in the Square on Broadway. The production earned several Tony Award nominations, including one for Mangan himself. In 2012 he appeared at the Royal Court, London (for the second time) in a Joe Penhall play, Birthday, directed by Roger Michell, playing a pregnant man. Mangan recently starred as Bertie Wooster in Jeeves and Wooster in Perfect Nonsense at the Duke of York's Theatre alongside Matthew Macfadyen as Jeeves. His breakthrough performance was Adrian Mole in the six-part TV show \"Adrian Mole: The Cappuccino Years\" (2001). In the same year he also appeared in \"Sword of Honour\" on Channel 4 alongside Daniel Craig. Since then he has worked extensively in British television as a lead actor in both serious drama and comedy. His most recent success is the British/American television comedy series \"Episodes\" created by David Crane and Jeffrey Klarik, starring Mangan alongside Matt Le Blanc and Tamsin Greig. It premiered on Showtime in the United States on January 9, 2011 and on BBC Two in the United Kingdom on January 10, 2011. His first film part was as Doctor Crane in Billy Elliot. He went on to appear in many other films such Chunky Monkey, Birthday Girl, Festival and Beyong The Pole. His most recent film is as the voice of Postman Pat in \"Postman Pat: The Movie\" a British 3D computer-animated comedy film. He was host of the Evening Standard British Film Awards for 4 years (2009-2013) and will host the Olivier Awards in 2014. In April 2014, Mangan will return to host the British Academy Television Craft Awards in London for a third time. He is a well-known voiceover artist - voicing animation, commercials and documentaries.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNDUxMzc3N15BMl5BanBnXkFtZTgwNDY4NzUxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0542118","name":"Stephen Mangan","idIMDB":"nm0542118"},"actorId":"nm0542118","character":"Postman Pat","urlCharacter":"http://www.imdb.com/character/ch0416249","main":true},{"actorName":"Jim Broadbent","urlProfile":"http://www.imdb.com/name/nm0000980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4ODgzMTg3MV5BMl5BanBnXkFtZTYwMDE4NTc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1949","placeOfBirth":" Lincoln, Lincolnshire, England, UK","birthName":"James Broadbent","height":"6' 2\" (1.88 m)","bio":"One of England's most versatile character actors, Jim Broadbent was born on May 24, 1949, in Lincolnshire, the youngest son of furniture maker Roy Laverick Broadbent and sculptress Doreen \"Dee\" (Findlay) Broadbent. Jim attended a Quaker boarding school in Reading before successfully applying for a place at an art school. His heart was in acting, though, and he would later transfer to the London Academy of Music and Dramatic Art (LAMDA). Following his 1972 graduation, he began his professional career on the stage, performing with the Royal National Theatre, the Royal Shakespeare Company, and as part of the National Theatre of Brent, a two-man troupe which he co-founded. In addition to his theatrical work, Broadbent did steady work on television, working for such directors as Mike Newell and Stephen Frears. Broadbent made his film debut in 1978 with a small part in Jerzy Skolimowski's The Shout (1978). He went on to work with Frears again in The Hit (1984) and with Terry Gilliam in Time Bandits (1981) and Brazil (1985), but it was through his collaboration with Mike Leigh that Broadbent first became known to an international film audience. In 1990 he starred in Leigh's Life Is Sweet (1990), a domestic comedy that cast him as a good-natured cook who dreams of running his own business. Broadbent gained further visibility the following year with substantial roles in Neil Jordan's The Crying Game (1992) and Mike Newell's Enchanted April (1991), and he could subsequently be seen in such diverse fare as Woody Allen's Bullets Over Broadway (1994), Widows' Peak (1994), Richard Loncraine's highly acclaimed adaptation of Shakespeare's Richard III (1995) and Little Voice (1998), the last of which cast him as a seedy nightclub owner. Appearing primarily as a character actor in these films, Broadbent took center stage for Leigh's Topsy-Turvy (1999), imbuing the mercurial W.S. Gilbert with emotional complexity and comic poignancy. Jim's breakthrough year was 2001, as he starred in three critically and commercially successful films. Many would consider him the definitive supporting actor of that year. First he starred as Bridget's dad (Colin Jones) in Bridget Jones's Diary (2001), which propelled Renée Zellweger to an Oscar nomination for Best Actress. Next came the multiple Oscar-nominated film (including Best Picture) Moulin Rouge (2001), for which he won a Best Supporting Actor BAFTA award for his scene-stealing performance as Harold Zidler. Lastly, came the small biopic Iris (2001), for which he won the Oscar for Best Supporting Actor as devoted husband John Bayley to Judi Dench's Iris Murdoch, the British novelist who suffered from Alzheimer's disease. The film hit home with Jim, since his own mother had passed away from Alzheimer's in 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4ODgzMTg3MV5BMl5BanBnXkFtZTYwMDE4NTc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000980","name":"Jim Broadbent","idIMDB":"nm0000980"},"actorId":"nm0000980","character":"CEO","urlCharacter":"http://www.imdb.com/character/ch0460514","main":true},{"actorName":"Rupert Grint","urlProfile":"http://www.imdb.com/name/nm0342488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDA3NjA1N15BMl5BanBnXkFtZTcwMDcyMDYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1988","placeOfBirth":" Stevenage, Hertfordshire, England, UK","birthName":"Rupert Alexander Lloyd Grint","height":"5' 8\" (1.73 m)","bio":"Rupert Alexander Lloyd Grint was born in Harlow, Essex, England, the elder son of Joanne (Parsons) and Nigel Grint, who dealt in memorabilia. The first of 5 children, Rupert has one brother and 3 sisters. His brother James was born when Rupert was a year old, Georgina and Samantha were born in 1993 and 1996 respectively, and last, but not least, Charlotte, who was born in 1999. Rupert grew up in Hertfordshire, the English county directly to the north of London, conveniently placed for commuting to Leavesden Film Studios. Before successfully auditioning for the Harry Potter films, Rupert attended Richard Hale Secondary School in Hertford: here he took an active interest in school plays, being cast as Rumplestilskin in the Brothers Grimm fairy tales. He was also a regular attendee at weekend drama classes at Top Hat Stage School, also in Hertford. Time at school was limited, as Rupert was needed on set for the Harry Potter films, where all of the child actors were tutored for four hours a day on set, to keep up with legal requirements. During the summer of 2004, he took his GCSE (General Certificate of Secondary Education) exams and completed his formal education.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDA3NjA1N15BMl5BanBnXkFtZTcwMDcyMDYzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342488","name":"Rupert Grint","idIMDB":"nm0342488"},"actorId":"nm0342488","character":"Josh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Tennant","urlProfile":"http://www.imdb.com/name/nm0855039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzOTA4NTAzOTReQTJeQWpwZ15BbWU4MDg1ODc4NzEx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1971","placeOfBirth":" Bathgate, West Lothian, Scotland, UK","birthName":"David John McDonald","height":"6' 1\" (1.85 m)","bio":"David Tennant was born David John McDonald in West Lothian, Scotland, to Essdale Helen (McLeod) and Sandy McDonald, who was a Presbyterian minister. He is of Scottish and Ulster-Scots descent. When he was about 3 or 4 years old, he decided to become an actor, inspired by his love of Doctor Who (1963). He was brought up in Bathgate, West Lothian and Paisley, Renfrewshire, Scotland and was a huge fan of the band The Proclaimers. He attended Paisley Grammar school and while there he wrote about how he wanted to become a professional actor and play the role of the Doctor in Doctor Who (1963). He made his first television appearance (which was also his first professional acting job) when he was 16, after his father sent some photos of him to a casting director at Scottish television. He also attended a youth theatre group at weekends run by the Royal Scottish Academy of Music and Drama (RSAMD - now renamed the Royal Conservatoire of Scotland [RCS]). When he was 16 he auditioned for and won a place at the RSAMD; the youngest student to ever do so, and started as a full time drama student when he was 17. He worked regularly in theatre and TV after leaving drama school, and his first big break came in 1994 when he was cast in a lead role in the Scottish drama Takin' Over the Asylum (1994). He then moved to London where his career thrived. Amongst other things, he spent several years as a member of the Royal Shakespeare Company, and became famous from his lead roles in TV dramas Blackpool (2004) and Casanova (2005). In 2005, his childhood wish came true. David was cast to play the role of the Doctor in Doctor Who (2005) alongside Billie Piper, after Christopher Eccleston decided to leave. Playing the Doctor made him a household name. Since leaving the series in 2010 his career has continued to rise, with lead roles in films, TV series and theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzOTA4NTAzOTReQTJeQWpwZ15BbWU4MDg1ODc4NzEx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0855039","name":"David Tennant","idIMDB":"nm0855039"},"actorId":"nm0855039","character":"Wilf","urlCharacter":"http://www.imdb.com/character/ch0468271","main":true},{"actorName":"Ronan Keating","urlProfile":"http://www.imdb.com/name/nm0444146","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MjQ0Mjc0MF5BMl5BanBnXkFtZTcwNzEwNjM4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1977","placeOfBirth":" Swords, Dublin, Ireland","birthName":"Ronan Patrick John Keating","height":"5' 9\" (1.75 m)","bio":"Ronan Patrick John Keating (born 3 March 1977) is an Irish recording artist, singer-songwriter, musician, and philanthropist. He debuted in 1994, alongside Keith Duffy, Michael Graham, Shane Lynch, and Stephen Gately, as the lead singer of Irish group Boyzone. His solo career started in 1999 and has spawned nine albums. He gained worldwide attention when his single \"When You Say Nothing at All\" was featured in the film Notting Hill and peaked at number one in several countries. As a solo artist, he has sold over 20 million records worldwide alongside the 25 million records with Boyzone and in Australia, he is best known as a judge on The X Factor. Keating is active in charity work and has been a charity campaigner for the Marie Keating Foundation, which raises awareness for breast cancer and is named after his mother, who died from the disease in 1998. At the age of 21 he married Yvonne Connolly after a brief two month romance. They had three children together: Jack Keating (1999), Marie Keating (2001) and Ali Keating (2005). In 2010 the couple separated and after 18 months Ronan started dating Australian TV Producer/Director, Storm Uechtritz in March 2012. After three years together Ronan proposed to Storm during a holiday in Thailand in March 2015. They were married in Scotland on the 17th August, the same year with his three children acting as best man, bridesmaid and flower girl.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MjQ0Mjc0MF5BMl5BanBnXkFtZTcwNzEwNjM4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444146","name":"Ronan Keating","nicknames":["Tin-Tin"],"idIMDB":"nm0444146"},"actorId":"nm0444146","character":"Postman Pat","urlCharacter":"http://www.imdb.com/character/ch0416249","main":true},{"actorName":"Susan Duerden","urlProfile":"http://www.imdb.com/name/nm0240267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczNTc3NTQwNF5BMl5BanBnXkFtZTYwNDQ1NDUy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Susan Duerden is an award-winning feature film and television actress. Critically acclaimed for her artistic versatility, she is known for hard-hitting, emotionally charged roles and lighthearted comedy, alike. In addition to her on-screen roles, she has also played lead theatre roles on London's West End and internationally. British by birth, she now lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczNTc3NTQwNF5BMl5BanBnXkFtZTYwNDQ1NDUy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240267","name":"Susan Duerden","idIMDB":"nm0240267"},"actorId":"nm0240267","character":"Sara Clifton","urlCharacter":"http://www.imdb.com/character/ch0416254","main":true},{"actorName":"Sandra Teles","urlProfile":"http://www.imdb.com/name/nm1720203","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTQ3MTg1Ml5BMl5BanBnXkFtZTgwNjI0NzY4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sandra Teles is an actress, known for Doctor Who (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTQ3MTg1Ml5BMl5BanBnXkFtZTgwNjI0NzY4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1720203","name":"Sandra Teles","idIMDB":"nm1720203"},"actorId":"nm1720203","character":"Julian Clifton","urlCharacter":"http://www.imdb.com/character/ch0441862","main":true},{"actorName":"T.J. Ramini","urlProfile":"http://www.imdb.com/name/nm1421522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTAzNTkzMl5BMl5BanBnXkFtZTgwNDk3MzQ3NTE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1975","placeOfBirth":" London, England, UK","birthName":"Tarek Jafar Ramini","height":"6' 2\" (1.88 m)","bio":"TJ is a British actor, writer and producer who was born and raised in London. He has enjoyed a fruitful career in multiple platforms from television and film, theatre and several voice overs in numerous video games. TV fans will most likely recognize TJ from his recurring roles on 24, NCIS and Twisted and from his comedic turn on Desperate Housewives as Gabby's maniacal personal trainer! Video game fans will most likely not recognize TJ's actual voice as he is constantly changing it to suit various characters. He's lent his vocal abilities to characters in Uncharted 3, Epic Micky 2, DOTA 2 to name but a few.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTAzNTkzMl5BMl5BanBnXkFtZTgwNDk3MzQ3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1421522","name":"T.J. Ramini","nicknames":["Teej"],"idIMDB":"nm1421522"},"actorId":"nm1421522","character":"Ben Taylor","urlCharacter":"http://www.imdb.com/character/ch0416252","main":true},{"actorName":"Peter Woodward","urlProfile":"http://www.imdb.com/name/nm0940974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExODUyNzAyMjheQTJeQWpwZ15BbWU3MDc5MTAxMjg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1956","placeOfBirth":" London, England, UK","bio":"Peter Woodward was born into a family of actors. His father, Edward Woodward, brother Tim Woodward and sister Sarah Woodward, are all well-known British actors. Peter graduated from the Royal Academy of Dramatic Art (RADA) and then joined the Royal Shakespeare Company, starring in many of their productions including \"Winter's Tale\", \"Comedy of Errors\" and \"A Midsummer Night's Dream\". Peter has also played a wide range of major character roles in films and television including the role of the German \"Captain Stossel\" in the feature film The Brylcreem Boys (1998). As a member of the British Academy of Dramatic Combat, Peter is known in the film industry for his work as a Fight Arranger and also as a post production supervisor, writing the ADR dialogue for films including: 1492: Christophe Colomb (1992), 20,000 Leagues Under the Sea (1997), The Scarlet Tunic (1998), Les Misérables (1998) and Ossessione fatale (1991). Branching out, Peter recently formed a production company, \"TRIPAL PRODUCTIONS\", with his father Edward Woodward, and, for this company, Peter wrote and produced his first feature film The House of Angelo (1997), with his father, Edward, in the starring role as \"Angleo\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExODUyNzAyMjheQTJeQWpwZ15BbWU3MDc5MTAxMjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940974","name":"Peter Woodward","idIMDB":"nm0940974"},"actorId":"nm0940974","character":"Carbunkle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robin Atkin Downes","urlProfile":"http://www.imdb.com/name/nm0235960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NTQ5MjU4NV5BMl5BanBnXkFtZTgwMzk4OTEyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1976","placeOfBirth":" London, England, UK","height":"6' 2\" (1.88 m)","bio":"Robin Atkin Downes has an extensive and distinguished career in all aspects of the film and television industry, not only as an accomplished actor but also as a director, producer, voice-over artist, motion capture artist and music producer. Born and raised in the U.K., he was trained in the United States, with a Masters of Fine Arts degree from Temple University in Philadelphia. Robin's on-camera credits include series regular, recurring and guest starring roles on many shows, including Criminal Minds (2005), NCIS: Los Angeles (2009), Entourage (2004), CSI: Miami (2002), The Starter Wife (2008) and In Plain Sight (2008), among others. He has also worked on many features, including Pirates of the Caribbean: At World's End (2007), Transformers: Revenge of the Fallen (2009), How to Train Your Dragon (2010), and Mission: Impossible - Ghost Protocol (2011). His creature vocal effects can be heard in many films, including Aliens vs. Predator: Requiem (2007), The Tale of Despereaux (2008), X-Men Origins: Wolverine (2009), The Wolfman (2010), Immortals (2011), and Happy Feet 2 (2011). As a voice-over artist, Robin is one of the most prolific voice actors in Los Angeles and is proficient in over 60 dialects. He has acted in 100's of the top interactive titles in the industry, as well as work on commercials and animated shows. His current animated series work includes roles in Thundercats (2011), Star Wars: The Clone Wars (2008), The Avengers: Earth's Mightiest Heroes (2010), Regular Show in Space (2009), and Green Lantern: The Animated Series (2011), among many others. Robin performed the role of David in Katsuhiro Ôtomo's Steamboy (2004), with Patrick Stewart, Alfred Molina and Anna Paquin. Other interactive credits include Talbot in Uncharted 3: Drake's Deception (2011), Joseph Capelli in Resistance 3 (2011), Atoq Navarro in Uncharted: Drake's Fortune (2007), Sean Devlin in The Saboteur (2009), and Travis Touchdown in No More Heroes (2007). His vocal creature skills were used for several of the locust creatures in the Gears of War (2006) franchise as well as the characters Kim Minh, Niles and Chaps. In addition, he also voices promos and trailers for television and film. Robin's stage credits include performances in London, Prague and the United States, including \"John Wilkes Booth\" in the Philadelphia premiere of \"Assassins\", \"Cyranau De Bergerac\" at the famed Walnut Street Theatre, \"Skinlad/Brink\" in \"Road\", performed at The Wilma Theatre, and in Prague and the title role in \"Dracula\" at the Hermosa Playhouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NTQ5MjU4NV5BMl5BanBnXkFtZTgwMzk4OTEyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235960","name":"Robin Atkin Downes","idIMDB":"nm0235960"},"actorId":"nm0235960","character":"Simon Cowbell","urlCharacter":"http://www.imdb.com/character/ch0034501","main":true},{"actorName":"Brian George","urlProfile":"http://www.imdb.com/name/nm0313364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAwNzI3MjU0N15BMl5BanBnXkFtZTcwNjI2NjI0Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1952","placeOfBirth":" Jerusalem, Israel","bio":"The youngest of four siblings, Brian George was born in Jerusalem to Jewish parents in July 1952. Both of his parents had immigrated to Israel from India. His father was born in Iraq but raised in Bombay and his mother was born and raised in India. When Brian was a year old, the family immigrated to London. Brian attended an all-boys school in London. In 1966, the family moved to Toronto and he attended public high school, followed by the University of Toronto, where he became involved in theater. George left before graduation and formed an unsuccessful theater group. He joined The Second City, where he trained with comedy greats including John Candy, among others. His career in acting and voice-over work has flourished ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAwNzI3MjU0N15BMl5BanBnXkFtZTcwNjI2NjI0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0313364","name":"Brian George","idIMDB":"nm0313364"},"actorId":"nm0313364","character":"Ajay Bains","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Parminder Nagra","urlProfile":"http://www.imdb.com/name/nm0619406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDcwODEzMl5BMl5BanBnXkFtZTcwMTAwODE1OQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1975","placeOfBirth":" Leicester, Leicestershire, England, UK","birthName":"Parminder Kaur Nagra","height":"5' 3\" (1.6 m)","bio":"Parminder Nagra was born on October 5, 1975 in Leicester, Leicestershire, England as Parminder Kaur Nagra. She is an actress, known for Bend It Like Beckham (2002), ER (1994) and Ella Enchanted (2004). She was previously married to James Stenson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDcwODEzMl5BMl5BanBnXkFtZTcwMTAwODE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0619406","name":"Parminder Nagra","nicknames":["Mindi"],"idIMDB":"nm0619406"},"actorId":"nm0619406","character":"Nisha Bains","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jo Wyatt","urlProfile":"http://www.imdb.com/name/nm0943557","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MTcyOTU3OV5BMl5BanBnXkFtZTgwMDAzNjE0MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Jo Wyatt is an actress, known for The Witcher 3: Wild Hunt (2015), Dragon Age II (2011) and The Octonauts (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MTcyOTU3OV5BMl5BanBnXkFtZTgwMDAzNjE0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943557","name":"Jo Wyatt","idIMDB":"nm0943557"},"actorId":"nm0943557","character":"Meera Brains","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Enn Reitel","urlProfile":"http://www.imdb.com/name/nm0718572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMDE4OTAwNV5BMl5BanBnXkFtZTcwOTU1ODE2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1950","placeOfBirth":" Forfar, Angus, Scotland, UK","bio":"Enn Reitel was born on June 21, 1950 in Forfar, Angus, Scotland. He is an actor and writer, known for The Adventures of Tintin (2011), The Prestige (2006) and Corpse Bride (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMDE4OTAwNV5BMl5BanBnXkFtZTcwOTU1ODE2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0718572","name":"Enn Reitel","idIMDB":"nm0718572"},"actorId":"nm0718572","character":"PC Selby / Reverend Timms / Pat Wannabe 2 / Raed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Carr","urlProfile":"http://www.imdb.com/name/nm0139732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTUzNTMyNF5BMl5BanBnXkFtZTgwMzkxNjM0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1950","placeOfBirth":" Loughton, Essex, England, UK","height":"5' 7½\" (1.71 m)","bio":"Since the late 1980s, American audiences have embraced the \"veddy British\" talents of character actress Jane Carr -- she with the close-set eyes, lilting voice, trowel jaw and bubbly disposition. It helps, of course, having natural comedic timing and the necessary vocal skills to be in constant demand. She was born Ellen Jane Carr on August 13, 1950, in Loughton, Essex. The daughter of Patrick Carr, a steel erector, and Gwendoline Rose (née Clark), a postal employee, an innate gift for performing was discovered early on by a teacher. As a result, she took acting classes at the Arts Educational School and Corona Stage School, both in London. Jane made her stage debut at age 14 in a production of \"The Spider's Web\", then went on to appear as the impressionable, ill-fated student \"Mary McGregor\" in \"The Prime of Miss Jean Brodie\", starring Vanessa Redgrave at the Wyndham's Theatre in 1966. Earning smashing reviews, Jane recreated her shy, stuttering misfit with a delicate mixture of pathos and poignancy in the film version of The Prime of Miss Jean Brodie (1969), this time with Oscar-winning Maggie Smith at the helm as the dangerously influential schoolteacher. A year later, Jane displayed just how extensive her range is projecting devilish menace and merriment in the little known but excellent cult black comedy Something for Everyone (1970), which became a cinematic highlight in the careers of both Michael York and Angela Lansbury, as well. In the early 70s, Jane made fine use of her prim, \"plain Jane\" looks for comic effect on several British TV series and in guest appearances. Loftier moments came with the superb series Upstairs, Downstairs (1971) and a production of Daphne Laureola (1978), that starred esteemed acting couple Laurence Olivier and Joan Plowright. Never far from the stage, Jane appeared in \"Spring Awakening\" in 1974 and earned a 1977 Laurence Olivier nomination for her work in \"Once a Catholic\". In 1978, she became a member of the Royal Shakespeare Company (RSC) and added a solid body of classics to her theatrical resumé, including \"A Midsummer Night's Dream\" (Olivier nomination), \"The Tempest\", \"As You Like It\", \"Much Ado About Nothing\", \"The Merchant of Venice\" (with Alec Guinness) and \"The Merry Wives of Windsor\". She also reconnected with her \"Jean Brodie\" co-star Maggie Smith in a production of \"The Way of the World\" in 1985. It was not until 1986 that Jane came to the States playing multiple key roles in the epic RSC revival of \"The Life and Adventures of Nicholas Nickleby\" on Broadway. When the touring company returned to England, Jane elected to stay in Los Angeles. The following year, she married Chicago-born actor Mark Arnott. They have a son, Dash Arnott (aka Dashiel James Arnott). Jane proceeded to develop an American fanbase after being cast in the role of warm and fizzy Louise Mercer in the sitcom Dear John (1988), which lasted four seasons. With her chirpy British tones, she also managed to carve a career for herself in animated voicework. While she continues to appear occasionally on TV and in films, she hasn't found quite the showcase she did with Dear John (1988), but has enhanced a number of such off-kiltered shows as Curb Your Enthusiasm (2000) and Monk (2002) with her unique brand of comedy. Recent plays have included \"The Cider House Rules\", \"Noises Off\", \"Blithe Spirit\" (as \"Madame Arcati\"), \"Habeas Corpus\" and David Hare's \"Stuff Happens (as \"First Lady Laura Bush\" opposite Keith Carradine's bemused \"President Bush\"). Jane's latest venture on Broadway has been as \"Mrs. Brill\" in the musical, \"Mary Poppins\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTUzNTMyNF5BMl5BanBnXkFtZTgwMzkxNjM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0139732","name":"Jane Carr","idIMDB":"nm0139732"},"actorId":"nm0139732","character":"Mrs. Goggins / Granny","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2062622","urlIMDB":"http://www.imdb.com/title/tt2062622","business":{"budget":null,"openingWeekend":[{"money":"HUF 3,398,611","country":"Hungary","day":"07","month":"09","year":"2014","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2014/\">2014</a>"}],"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["Digital"],"cinematographicProcess":null,"printedFilmFormat":["DCP"]},"rating":"4.6","metascore":"44","filmingLocations":[],"awards":[{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Foreign Animation/Family Trailer","names":[{"name":"Gkids","id":null,"role":null},{"name":"Zealot Productions","id":null,"role":null}]}]}]}],"votes":"1,227","type":"Movie","companyCreditsSimple":[{"idCompany":"co0309880","name":"Classic Media"},{"idCompany":"co0363991","name":"RGH Entertainment"},{"idCompany":"co0354776","name":"Rubicon Group Holding"}],"keywords":{"keywords":["postman","based on tv series","1980s","cat"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:56:04"}}