{"data":{"movies":[{"title":"Horrible Bosses 2","originalTitle":"","year":"2014","releaseDate":"20141126","directors":[{"name":"Sean Anders","id":"nm1890845"}],"writers":[{"name":"Sean Anders","id":"nm1890845"},{"name":"John Morris","id":"nm1898234"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU4OTEzNzAwN15BMl5BanBnXkFtZTgwMTgwODAwMzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Crime"],"plot":"Fed up with answering to higher-ups, Nick, Dale and Kurt decide to become their own bosses by launching their own business. But a slick investor soon pulls the rug out from under them. Outplayed and desperate, and with no legal recourse, the three would-be entrepreneurs hatch a misguided plan to kidnap the investor's adult son and ransom him to regain control of their company.","simplePlot":"Dale, Kurt and Nick decide to start their own business but things don't go as planned because of a slick investor, prompting the trio to pull off a harebrained and misguided kidnapping scheme.","actors":[{"actorName":"Jason Bateman","urlProfile":"http://www.imdb.com/name/nm0000867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTQ0MDUyNF5BMl5BanBnXkFtZTcwNTQ1MzY1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1969","placeOfBirth":" Rye, New York, USA","birthName":"Jason Kent Bateman","height":"5' 11\" (1.8 m)","bio":"Jason Bateman is an American film and television actor best known for his role as Michael Bluth on the television sitcom Arrested Development (2003), as well as his role on Valerie (1986). He was born in Rye, New York, USA. His father, Kent Bateman, from a Utah-based family, is a film and television director, and founder of a Hollywood repertory stage company. His mother, Victoria Bateman, was born in England and worked as a flight attendant. His sister is actress Justine Bateman. In 1981, at the age of 12, young Bateman made his debut on television as James Cooper Ingalls in Little House on the Prairie (1974): Uncle Jed, appearing in 18 more episodes in one season. Jason also appeared in the original Knight Rider with David Hasselhoff for the season 3 episode \"Lost Knight\" (aired Dec 1984) playing the character \"Doug\" who befriends Kitt when he loses his memory. In the mid-1980s, he became the DGA's youngest-ever director when he directed three episodes of Valerie (1986) at age 18. During the 2000s, Bateman's film career has been on soaring trajectory. In 2005, he won the Golden Globe Award for Best Performance by an Actor in a Television Series, Musical or Comedy, for Arrested Development (2003), and received other awards and nominations. Bateman has been enjoying a happy family life with his wife, actress Amanda Anka (daughter of singer Paul Anka). Their first child, Francesca Nora Bateman, was born in Los Angeles on October 28, 2006. The Batemans reside in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTQ0MDUyNF5BMl5BanBnXkFtZTcwNTQ1MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000867","name":"Jason Bateman","idIMDB":"nm0000867"},"actorId":"nm0000867","character":"Nick Hendricks","urlCharacter":"http://www.imdb.com/character/ch0212604","main":true},{"actorName":"Jason Sudeikis","urlProfile":"http://www.imdb.com/name/nm0837177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjIyNjExMV5BMl5BanBnXkFtZTgwOTQ4NzcyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1975","placeOfBirth":" Fairfax, Virginia, USA","birthName":"Daniel Jason Sudeikis","height":"6' 1\" (1.85 m)","bio":"Daniel Jason Sudeikis was born on September 18, 1975 in Fairfax, Virginia, to Kathryn (Wendt), a former travel agent at Brennco and president of the American Society of Travel Agents, and Daniel Joseph Sudeikis, a vice president of business development. He is of Lithuanian and Irish descent on his father's side, and German and Irish ancestry on his mother's. As a child, he moved with his family to Overland Park, Kansas, which he has described as his hometown. He attended Brookridge Elementary School before transferring to Holy Cross Catholic School; both are located in Overland Park. He began high school at the Jesuit Rockhurst High School in 1990, later transferring due to academic reasons to Shawnee Mission West High School. He began performing at ComedySportz (now Comedy City) in Kansas City. After moving to Chicago, he studied at the Annoyance Theatre and ImprovOlympic, where he was one of the founding members of the long-form team J.T.S. Brown. He was later cast in The Second City's National Touring Company, and also performed with Boom Chicago in Amsterdam. In the early 2000s, he became a founding member of Second City Las Vegas. He continues to frequently perform at the Upright Citizens Brigade Theatre's weekly improv show ASSSCAT 3000 in New York City. In 2003, while a regular performer at Second City Las Vegas, he was hired as a sketch writer for NBC's Saturday Night Live (1975) and would occasionally make bit appearances as audience members or extras. In May 2005, he became a featured player and was upgraded to repertory status in 2006. In July 2013, he announced that he was leaving SNL. In 2007-2010, he had a recurring role as Floyd on NBC's 30 Rock (2006), playing the love interest of Liz Lemon (played by friend Tina Fey) and appearing in 12 episodes. His voice-over work include video-game Grand Theft Auto IV (2008), playing the role of right-wing radio host Richard Bastion. In 2008, he also appeared in the comedy What Happens in Vegas (2008), playing the role of Cameron Diaz's character's ex-fiancé, in The Rocker (2008) as David Marshall, opposite Rainn Wilson, Emma Stone, and Josh Gad, in Semi-Pro (2008) as Nacho Fan, in Childrens Hospital (2008) as Dr. Robert 'Bobby' Fiscus, and co-starred with Bill Hader and Joe Lo Truglio in the Lorne Michaels-produced web-series \"The Line on Crackle\". In 2010, he appeared in The Bounty Hunter (2010), alongside Jennifer Aniston and Gerard Butler, playing a colleague of Aniston's character, who falls in love with her, in Going the Distance (2010) as Box, and also co-hosted WWE Raw: Episode #18.33 (2010) with his \"Going the Distance\" co-stars Charlie Day and Justin Long at the Staples Center in Los Angeles. He also worked with Day on It's Always Sunny in Philadelphia (2005) playing Schmitty on two episodes. In FOX's animated comedy The Cleveland Show (2009), he provided the voices of Holt Richter and Terry Kimple in almost all of episodes until the series' end in 2013, and had a recurring role on the cult comedy Eastbound & Down (2009). His first lead film role, alongside Owen Wilson, was in Farrelly brothers comedy Hall Pass (2011). That year, he also appeared in Seth Gordon comedy Horrible Bosses (2011), opposite Jamie Foxx, Kevin Spacey, Jennifer Aniston, Colin Farrell, Charlie Day, and Jason Bateman, and in A Good Old Fashioned Orgy (2011). He also hosted 2011 MTV Movie Awards (2011). His other movies include The Campaign (2012), opposite Will Ferrell and Zach Galifianakis, Movie 43 (2013), Drinking Buddies (2013), Epic (2013), and We're the Millers (2013). He also starred in Horrible Bosses 2 (2014), and in Sleeping with Other People (2015). He can also be seen in the romantic comedy, Tumbledown (2015) opposite Rebecca Hall and in La couleur de la victoire (2016) as Larry Snyder, Jesse Owens' coach. He is also Henry, a widowed and introverted architect, in The Book of Love (2016), in Mother's Day (2016), opposite Jennifer Aniston for the fifth time, is the voice of Red in The Angry Birds Movie (2016), and is playing a recurring character, Mike Miller, on The Last Man on Earth (2015). He is also starring in Masterminds (2016), opposite Zach Galifianakis, Owen Wilson, and Kristen Wiig, in Colossal (2016), opposite Anne Hathaway, in Permission (2017), again with Rebecca Hall, in Son of Zorn (2016) as the voice of Zorn, and in Alexander Payne's Downsizing (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NjIyNjExMV5BMl5BanBnXkFtZTgwOTQ4NzcyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0837177","name":"Jason Sudeikis","nicknames":["Suds"],"idIMDB":"nm0837177"},"actorId":"nm0837177","character":"Kurt Buckman","urlCharacter":"http://www.imdb.com/character/ch0222338","main":true},{"actorName":"Charlie Day","urlProfile":"http://www.imdb.com/name/nm0206359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODAzNzQ5M15BMl5BanBnXkFtZTcwMzQ1ODI4Mg@@._V1._CR171,167,156,217_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1976","placeOfBirth":" New York City, New York, USA","birthName":"Charles Peckham Day","height":"5' 6½\" (1.69 m)","bio":"Charles Peckham Day was born in New York City, NY, and raised in Middletown, Rhode Island. His parents are both music teachers - his mother, Mary (Peckham), is a piano teacher, and his father, Dr. Thomas Charles Day, was a professor of music at Salve Regina University in Newport, Rhode Island. Charlie plays both piano and guitar. He has Italian (from his paternal grandfather), Irish, and English ancestry. He attended Merrimack College in Massachusetts, majoring in art history. After graduating, he began acting at the Williamstown Theatre Festival and in small television roles. He supplemented his income by waiting tables and answering phones for a telethon selling a Motown anthology. He got his first agent after performing a funny blues song he'd written at a cabaret night. His big break came in 2005 after he pitched a home video he shot with his friends Rob McElhenney and Glenn Howerton. This eventually became the hit series It's Always Sunny in Philadelphia (2005). As well as starring in the show, Charlie is also an Executive Producer and one of the writers. His breakthrough film role was Horrible Bosses (2011). He resides in Los Angeles with his wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODAzNzQ5M15BMl5BanBnXkFtZTcwMzQ1ODI4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206359","name":"Charlie Day","nicknames":["Green Man"],"idIMDB":"nm0206359"},"actorId":"nm0206359","character":"Dale Arbus","urlCharacter":"http://www.imdb.com/character/ch0222337","main":true},{"actorName":"Jennifer Aniston","urlProfile":"http://www.imdb.com/name/nm0000098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk1MjIxNjUxNF5BMl5BanBnXkFtZTcwODk2NzM4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1969","placeOfBirth":" Sherman Oaks, California, USA","birthName":"Jennifer Joanna Aniston","height":"5' 4½\" (1.64 m)","bio":"Jennifer Aniston was born in Sherman Oaks, California, to actors John Aniston and Nancy Dow. Her father is Greek, and her mother was of English, Irish, Scottish, and Italian descent. Jennifer spent a year of her childhood living in Greece with her family. Her family then relocated to New York City where her parents divorced when she was nine. Jennifer was raised by her mother and her father landed a role, as \"Victor Kiriakis\", on the daytime soap Days of Our Lives (1965). Jennifer had her first taste of acting at age 11 when she joined the Rudolf Steiner School's drama club. It was also at the Rudolf Steiner School that she developed her passion for art. She began her professional training as a drama student at New York's School of Performing Arts, aka the \"Fame\" school. It was a division of Fiorello H. LaGuardia High School of Music and the Arts. In 1987, after graduation, she appeared in such Off-Broadway productions as \"For Dear Life\" and \"Dancing on Checker's Grave\". In 1989, she landed her first television role, as a series regular on Molloy (1989). She also appeared in The Edge (1992), Ferris Bueller (1990), and had a recurring part on Herman's Head (1991). By 1993, she was floundering. Then, in 1994, a pilot called \"Friends Like These\" came along. Originally asked to audition for the role of \"Monica\", Aniston refused and auditioned for the role of \"Rachel Green\", the suburban princess turned coffee peddler. With the success of the series Friends (1994), Jennifer has become famous and sought-after as she turns her fame into movie roles during the series hiatus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk1MjIxNjUxNF5BMl5BanBnXkFtZTcwODk2NzM4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000098","name":"Jennifer Aniston","nicknames":["Jen","Jenny"],"idIMDB":"nm0000098"},"actorId":"nm0000098","character":"Dr. Julia Harris, D.D.S.","urlCharacter":"http://www.imdb.com/character/ch0206112","main":true},{"actorName":"Kevin Spacey","urlProfile":"http://www.imdb.com/name/nm0000228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NhY2U2YjgtNTFhZS00NjkwLWI2YzAtYWViNmRhMmQ5YWZjXkEyXkFqcGdeQXVyMDkxMjMwMA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1959","placeOfBirth":" South Orange, New Jersey, USA","birthName":"Kevin Spacey Fowler","height":"5' 10\" (1.78 m)","bio":"Kevin Spacey Fowler better known by his stage name Kevin Spacey, is an American actor of screen and stage, film director, producer, screenwriter and singer. He began his career as a stage actor during the 1980s before obtaining supporting roles in film and television. He gained critical acclaim in the early 1990s that culminated in his first Academy Award for Best Supporting Actor for the neo-noir crime thriller The Usual Suspects (1995), and an Academy Award for Best Actor for midlife crisis-themed drama American Beauty (1999). His other starring roles have included the comedy-drama film Swimming with Sharks (1994), psychological thriller Seven (1995), the neo-noir crime film L.A. Confidential (1997), the drama Pay It Forward (2000), the science fiction-mystery film K-PAX (2001) In Broadway theatre, Spacey won a Tony Award for his role in Lost in Yonkers. He was the artistic director of the Old Vic theatre in London from 2004 until stepping down in mid-2015. Since 2013, Spacey has played Frank Underwood in the Netflix political drama series House of Cards. His work in House of Cards earned him Golden Globe Award and Emmy Award nominations for Best Actor. As enigmatic as he is talented, Kevin Spacey has always kept the details of his private life closely guarded. As he explained in a 1998 interview with the London Evening Standard, \"the less you know about me, the easier it is to convince you that I am that character on screen. It allows an audience to come into a movie theatre and believe I am that person\". There are, however, certain biographical facts to be had - for starters, Kevin Spacey Fowler was the youngest of three children born to Kathleen Ann (Knutson) and Thomas Geoffrey Fowler, in South Orange, New Jersey. His ancestry includes Swedish (from his maternal grandfather) and English. His mother was a personal secretary, his father a technical writer whose irregular job prospects led the family all over the country. The family eventually settled in southern California, where young Kevin developed into quite a little hellion - after he set his sister's tree house on fire, he was shipped off to the Northridge Military Academy, only to be thrown out a few months later for pinging a classmate on the head with a tire. Spacey then found his way to Chatsworth High School in the San Fernando Valley, where he managed to channel his dramatic tendencies into a successful amateur acting career. In his senior year, he played \"Captain von Trapp\" opposite classmate Mare Winningham's \"Maria\" in \"The Sound of Music\" (the pair later graduated as co-valedictorians). Spacey claims that his interest in acting - and his nearly encyclopedic accumulation of film knowledge - began at an early age, when he would sneak downstairs to watch the late late show on TV. Later, in high school, he and his friends cut class to catch revival films at the NuArt Theater. The adolescent Spacey worked up celebrity impersonations (James Stewart and Johnny Carson were two of his favorites) to try out on the amateur comedy club circuit. He briefly attended Los Angeles Valley College, then left (on the advice of another Chatsworth classmate, Val Kilmer) to join the drama program at Juilliard. After two years of training he was anxious to work, so he quit Juilliard sans diploma and signed up with the New York Shakespeare Festival. His first professional stage appearance was as a messenger in the 1981 production of \"Henry VI\". Festival head Joseph Papp ushered the young actor out into the \"real world\" of theater, and the next year Spacey made his Broadway debut in Henrik Ibsen's \"Ghosts\". He quickly proved himself as an energetic and versatile performer (at one point, he rotated through all the parts in David Rabe's \"Hurlyburly\"). In 1986, he had the chance to work with his idol and future mentor, Jack Lemmon, on a production of Eugene O'Neill's \"Long Day's Journey Into Night\". While his interest soon turned to film, Spacey would remain active in the theater community - in 1991, he won a Tony Award for his turn as \"Uncle Louie\" in Neil Simon's Broadway hit \"Lost in Yonkers\" and, in 1999, he returned to the boards for a revival of O'Neill's \"The Iceman Cometh\". Spacey's film career began modestly, with a small part as a subway thief in Heartburn (1986). Deemed more of a \"character actor\" than a \"leading man\", he stayed on the periphery in his next few films, but attracted attention for his turn as beady-eyed villain \"Mel Profitt\" on the TV series Wiseguy (1987). Profitt was the first in a long line of dark, manipulative characters that would eventually make Kevin Spacey a household name: he went on to play a sinister office manager in Glengarry Glen Ross (1992), a sadistic Hollywood exec in Swimming with Sharks (1994), and, most famously, creepy, smooth-talking eyewitness Verbal Kint in The Usual Suspects (1995). The \"Suspects\" role earned Spacey an Oscar for Best Supporting Actor and catapulted him into the limelight. That same year, he turned in another complex, eerie performance in David Fincher's thriller Se7en (1995) (Spacey refused billing on the film, fearing that it might compromise the ending if audiences were waiting for him to appear). By now, the scripts were pouring in. After appearing in Al Pacino's Looking for Richard (1996), Spacey made his own directorial debut with Albino Alligator (1996), a low-key but well received hostage drama. He then jumped back into acting, winning critical accolades for his turns as flashy detective Jack Vincennes in L.A. Confidential (1997) and genteel, closeted murder suspect Jim Williams in Midnight in the Garden of Good and Evil (1997). In October 1999, just four days after the dark suburban satire American Beauty (1999) opened in US theaters, Spacey received a star on the Hollywood Walk of Fame. Little did organizers know that his role in Beauty would turn out to be his biggest success yet - as Lester Burnham, a middle-aged corporate cog on the brink of psychological meltdown, he tapped into a funny, savage character that captured audiences' imaginations and earned him a Best Actor Oscar. No longer relegated to offbeat supporting parts, Spacey seems poised to redefine himself as a Hollywood headliner. He says he's finished exploring the dark side - but, given his attraction to complex characters, that mischievous twinkle will never be too far from his eyes. In February 2003 Spacey made a major move back to the theatre. He was appointed Artistic Director of the new company set up to save the famous Old Vic theatre, The Old Vic Theatre Company. Although he did not undertake to stop appearing in movies altogether, he undertook to remain in this leading post for ten years, and to act in as well as to direct plays during that time. His first production, of which he was the director, was the September 2004 British premiere of the play Cloaca by Maria Goos (made into a film, Cloaca (2003)). Spacey made his UK Shakespearean debut in the title role in Richard II in 2005. In 2006 he got movie director Robert Altman to direct for the stage the little-known Arthur Miller play Resurrection Blues, but that was a dismal failure. However Spacey remained optimistic, and insisted that a few mistakes are part of the learning process. He starred thereafter with great success in Eugene O'Neill's A Moon for the Misbegotten along with Colm Meaney and Eve Best, and in 2007 that show transferred to Broadway. In February 2008 Spacey put on a revival of the David Mamet 1988 play Speed-the-Plow in which he took one of the three roles, the others being taken by Jeff Goldblum and Laura Michelle Kelly. In 2013, Spacey took on the lead role in an original Netflix series, House of Cards (2013). Based upon a British show of the same name, House of Cards is an American political drama. The show's first season received a Primetime Emmy Award nomination to include outstanding lead actor in a drama series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NhY2U2YjgtNTFhZS00NjkwLWI2YzAtYWViNmRhMmQ5YWZjXkEyXkFqcGdeQXVyMDkxMjMwMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000228","name":"Kevin Spacey","idIMDB":"nm0000228"},"actorId":"nm0000228","character":"Dave Harken","urlCharacter":"http://www.imdb.com/character/ch0250011","main":true},{"actorName":"Jamie Foxx","urlProfile":"http://www.imdb.com/name/nm0004937","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1967","placeOfBirth":" Terrell, Texas, USA","birthName":"Eric Marlon Bishop","height":"5' 9\" (1.75 m)","bio":"Jamie Foxx is an American actor, singer, and comedian. He won an Academy Award for Best Actor, BAFTA Award for Best Actor in a Leading Role, and Golden Globe Award for Best Actor in a Musical or Comedy, for his work in the 2004 biographical film Ray (2004). The same year, he was nominated for the Academy Award for Best Supporting Actor for his role in the action film Collateral (2004). Other prominent acting roles include the title role in the film Django Unchained (2012), the super villain Electro in The Amazing Spider-Man 2 (2014), and William Stacks in the 2014 version of Annie (2014). Jamie Foxx was born Eric Marlon Bishop in Terrell, Texas, to Louise Annette Talley and Darrell Bishop, who worked as a stockbroker and had later changed his name to Shahid Abdula. His mother was an adopted child. When her marriage to his father failed, his maternal grandparents, Mark and Estelle Talley, stepped in and, at age seven months, adopted Jamie too. He has said that he had a very rigid upbringing that placed him in the Boy Scouts and the church choir. During high school, he played quarterback for his high school team and was good enough that he got press in Dallas newspapers. He studied music in college. He released a music album in 1994, \"Peep This\", and sings the theme song for his 1999 movie, Any Given Sunday (1999). However, in 1989, his life changed when a girl friend challenged him to get up onstage at the Comedy Club. In fact, he says he took his androgynous stage name because he learned that women got preference for mike time on open stage nights. That led to his being cast in Roc (1991) and In Living Color (1990). Foxx had his own WB television show from 1996 to 2001, the sitcom The Jamie Foxx Show (1996), in which he played Jamie King Jr. Foxx is also a Grammy Award-winning musician, producing four albums which have charted highly on the US Billboard 200: Unpredictable (2005), which topped the chart, Intuition (2008), Best Night of My Life (2010), and Hollywood: A Story of a Dozen Roses (2015). In 2012, Foxx starred in the title role of the Quentin Tarantino written and directed Django Unchained. Foxx starred alongside his Ray co-star Kerry Washington, as well as Christoph Waltz, Leonardo DiCaprio and Samuel L. Jackson. In 2013, Foxx was cast as President James Sawyer in White House Down alongside Channing Tatum. The following year, Foxx appeared in The Amazing Spider-Man 2 as the villain Electro, and co-starred with Quvenzhané Wallis in Annie, Sony's Will Smith and Jay-Z produced update of the comic strip-turned-musical. He has two children, including Corinne Foxx, born in 1995, who lives with her mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004937","name":"Jamie Foxx","idIMDB":"nm0004937"},"actorId":"nm0004937","character":"Dean \"MF\" Jones","urlCharacter":"http://www.imdb.com/character/ch0251366","main":true},{"actorName":"Chris Pine","urlProfile":"http://www.imdb.com/name/nm1517976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTQ4NTU3NV5BMl5BanBnXkFtZTcwNjEwNDU0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Whitelaw Pine","height":"6' (1.83 m)","bio":"Chris Pine was born in Los Angeles. His parents are actors Robert Pine and Gwynne Gilford, and his maternal grandparents were Max M. Gilford, a president of the Hollywood Bar Association, and actress Anne Gwynne. His sister, Katherine Pine, has also acted. Chris's ancestry is Russian Jewish (from his maternal grandfather), English, German, Welsh, and French. Pine attended Oakwood School in the San Fernando Valley, and went on to study English at the University of California, Berkeley where he received a bachelor's degree. During this time, he spent one year studying at the University of Leeds in England. Pine also studied acting at the American Conservatory Theater in San Francisco. After embarking on an acting career, Pine won guest roles in many television series, and made his feature film debut opposite Anne Hathaway in The Princess Diaries 2: Royal Engagement (2004). Other roles in film and television followed, but he became an international star when he was cast as James T. Kirk in the hugely successful franchise reboot, Star Trek (2009). He has subsequently starred in the films Unstoppable (2010), This Means War (2012), People Like Us (2012), and the sequel Star Trek Into Darkness (2013). In 2014, Pine co-starred in Horrible Bosses 2 (2014) and, as Cinderella's Prince, in the musical Into the Woods (2014), alongside Meryl Streep and Anna Kendrick. His upcoming roles include Les Survivants (2015), The Finest Hours (2016), and the third film in the new Star Trek series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTQ4NTU3NV5BMl5BanBnXkFtZTcwNjEwNDU0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1517976","name":"Chris Pine","nicknames":["Peenè","Pinewood","Piney"],"idIMDB":"nm1517976"},"actorId":"nm1517976","character":"Rex Hanson","urlCharacter":"http://www.imdb.com/character/ch0491066","main":true},{"actorName":"Christoph Waltz","urlProfile":"http://www.imdb.com/name/nm0910607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDk3OTYxOF5BMl5BanBnXkFtZTcwMDk5OTUwOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1956","placeOfBirth":" Vienna, Austria","height":"5' 7\" (1.7 m)","bio":"Christoph Waltz is an Austrian-German actor. He is known for his works with American filmmaker Quentin Tarantino, receiving acclaim for portraying SS-Standartenführer Hans Landa in Inglourious Basterds (2009) and bounty hunter Dr. King Schultz in Django Unchained (2012). For each performance, he won an Academy Award, a BAFTA Award, and a Golden Globe Award for Best Supporting Actor. Additionally, he received the Best Actor Award at the Cannes Film Festival and a Screen Actors Guild Award for his portrayal of Landa. Christoph Waltz was born in Vienna, Austria, to Elisabeth Urbancic, an Austrian-born costume designer, and Johannes Waltz, a German-born stage builder. He has three siblings. He was born into a theater family, as his maternal grandmother was Viennese Burgtheater actress Maria Mayen, and his step-grandfather was fellow Burgtheater actor Emmerich Reimers. His maternal grandfather, Rudolf von Urban, was a psychologist and psychiatrist who wrote the 1949 book \"Sex Perfection and Marital Happiness\". Waltz attended the Theresianium and Billrothstrasse in Vienna. Upon graduation, he attended the Max-Reinhardt-Seminar before going to New York to the Lee Strasberg Institute. While in New York, Christoph met his first wife, and moved back to Vienna, then to London. During the 80s, Christoph worked primarily in theater, commuting from his home in London to Germany. Slowly he began to work in TV, taking one-off roles on series, and TV movies. Film roles soon followed, however, attempts to break into English-speaking film and TV were unsuccessful. Christoph has stated he is grateful to have made a living and supported his family through acting. For thirty years he worked steadily, tirelessly, in this manner. It was not until he met Quentin Tarantino that his career in Hollywood took off. The role of Colonel Hans Landa in Inglourious Basterds (2009) catapulted Christoph from a lifetime working in German TV/film to the new life of an international superstar and Academy Award-winning actor. He won 27 awards for his performance as Hans Landa, including the Cannes prix d'interpretation Masculin for 2009, the Golden Globe for Best Supporting Actor, the BAFTA Best Supporting Actor award, and the Academy Award for Best Supporting Actor (which he won again for 2012's Django Unchained (2012)). He also portrayed computer genius Qohen Leth in the film The Zero Theorem (2013), American plagiarist Walter Keane in the biographical film _Big Eyes (2014), and 007's nemesis and head of SPECTRE Ernst Stavro Blofeld in _Spectre (2015)_. In Quentin Tarantino's 2009 film Inglourious Basterds, Waltz portrayed SS-Standartenführer Hans Landa, aka \"The Jew Hunter\". Clever, courteous, and multilingual - but also self-serving, cunning, implacable, and murderous. Waltz played gangster Benjamin Chudnofsky in The Green Hornet (2011). That same year, he starred in Water for Elephants (2011), Roman Polanski's Carnage (2011), and a remake of Les Trois Mousquetaires (2011). He played German bounty hunter Dr. King Schultz in Quentin Tarantino's Django Unchained (2012), a role Tarantino wrote specifically for Waltz. Christoph resides in Berlin and Los Angeles. His wife is costume builder Judith Holste.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDk3OTYxOF5BMl5BanBnXkFtZTcwMDk5OTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910607","name":"Christoph Waltz","idIMDB":"nm0910607"},"actorId":"nm0910607","character":"Bert Hanson","urlCharacter":"http://www.imdb.com/character/ch0491065","main":true},{"actorName":"Jonathan Banks","urlProfile":"http://www.imdb.com/name/nm0052186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MTE0OTI0MF5BMl5BanBnXkFtZTcwMzc2MzU3NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1947","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Jonathan Ray Banks","height":"5' 8½\" (1.74 m)","bio":"Versatile veteran character actor Jonathan Banks was born in Washington D.C in 1947. While growing up he always had an interest in acting and stage work, so decided to pursue a career in entertainment. To this day he is a very accomplished stage actor. While acting in film, he usually plays sinister types or villains. He can be seen in Better Call Saul (2015) as Mike Ehrmantraut.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MTE0OTI0MF5BMl5BanBnXkFtZTcwMzc2MzU3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0052186","name":"Jonathan Banks","idIMDB":"nm0052186"},"actorId":"nm0052186","character":"Detective Hatcher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lindsay Sloane","urlProfile":"http://www.imdb.com/name/nm0005441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY4ODkxN15BMl5BanBnXkFtZTcwMjc4NjE4MQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1977","placeOfBirth":" Long Island, New York, USA","birthName":"Lindsay Sloane Leikin","height":"5' 4\" (1.63 m)","bio":"Admitting to her own lively nature as a child, Sloane took up acting as an outlet for her energy. She developed a real love for the art and signed with an agent at the tender age of 8. Sloane was a television series regular on Mr. Rhodes (1996) and had a recurring role on The Wonder Years (1988). She has also appeared on Dharma & Greg (1997), Working (1997) and My So-Called Life (1994), as well as the made-for-television movie, CBS Schoolbreak Special: Between Mother and Daughter (1995). Sloane's theater experience included \"Emperor's New Clothes\", \"Say Yo Ho Ho\", \"Rumors\" and \"Cabaret\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY4ODkxN15BMl5BanBnXkFtZTcwMjc4NjE4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005441","name":"Lindsay Sloane","idIMDB":"nm0005441"},"actorId":"nm0005441","character":"Stacy Arbus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keegan-Michael Key","urlProfile":"http://www.imdb.com/name/nm1221047","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1Mjc5MzUwOF5BMl5BanBnXkFtZTcwMzc3ODk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1971","placeOfBirth":" Southfield, Michigan, USA","height":"6' (1.83 m)","bio":"Keegan-Michael Key was born in Southfield, Michigan and raised in Detroit. He was adopted as a child by a black father and a white mother. In 1989, he graduated from Shrine Catholic High School in Royal Oak, Michigan. Key attended the University of Detroit Mercy as an undergraduate and earned his Master of Fine Arts in Theater at Pennsylvania State University. While at The University of Detroit Mercy, he was a brother of Phi Kappa Theta.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1Mjc5MzUwOF5BMl5BanBnXkFtZTcwMzc3ODk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1221047","name":"Keegan-Michael Key","idIMDB":"nm1221047"},"actorId":"nm1221047","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Stables","urlProfile":"http://www.imdb.com/name/nm1261587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUyNjY5MDE3NF5BMl5BanBnXkFtZTgwMjMzNDYzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1978","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Kelly Michelle Stables","height":"4' 11\" (1.5 m)","bio":"Kelly Stables was born on January 26, 1978 in St. Louis, Missouri, USA as Kelly Michelle Stables. She is known for her work on W.I.T.C.H. (2004), The Exes (2011) and Horrible Bosses 2 (2014). She has been married to Kurt Patino since March 26, 2005. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUyNjY5MDE3NF5BMl5BanBnXkFtZTgwMjMzNDYzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1261587","name":"Kelly Stables","idIMDB":"nm1261587"},"actorId":"nm1261587","character":"Rachel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Lambert","urlProfile":"http://www.imdb.com/name/nm1208801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxOTgzMTM5MTheQTJeQWpwZ15BbWU4MDMyMDg4MDAy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1957","placeOfBirth":" Shelton, Washington, USA","bio":"Jerry Lambert was born on August 8, 1957 in Shelton, Washington, USA. He is an actor, known for Graves (2016), Sons & Daughters (2006) and The Odd Couple (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxOTgzMTM5MTheQTJeQWpwZ15BbWU4MDMyMDg4MDAy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1208801","name":"Jerry Lambert","idIMDB":"nm1208801"},"actorId":"nm1208801","character":"Skip","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Richardson","urlProfile":"http://www.imdb.com/name/nm3931538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk0Mzc2OTIzNV5BMl5BanBnXkFtZTgwNDE1OTE4MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10¾\" (1.8 m)","bio":"Sam Richardson is an actor and writer, known for Veep (2012), Detroiters (2017) and Mike and Dave Need Wedding Dates (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk0Mzc2OTIzNV5BMl5BanBnXkFtZTgwNDE1OTE4MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3931538","name":"Sam Richardson","idIMDB":"nm3931538"},"actorId":"nm3931538","character":"Producer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brianne Howey","urlProfile":"http://www.imdb.com/name/nm3526370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MjE0MTg4Nl5BMl5BanBnXkFtZTgwMDIxNzEyMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1989","placeOfBirth":" Los Angeles, California, USA","birthName":"Brianne Nicole Howey","height":"5' 6\" (1.68 m)","bio":"Brianne Howey was born on May 24, 1989 in Los Angeles, California, USA as Brianne Nicole Howey. She is an actress, known for Horrible Bosses 2 (2014), I Live with Models (2015) and The Exorcist (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MjE0MTg4Nl5BMl5BanBnXkFtZTgwMDIxNzEyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3526370","name":"Brianne Howey","idIMDB":"nm3526370"},"actorId":"nm3526370","character":"Candy","urlCharacter":"http://www.imdb.com/character/ch0066510","main":true}],"seasons":[],"idIMDB":"tt2170439","urlIMDB":"http://www.imdb.com/title/tt2170439","business":{"budget":{"money":"$42,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$54,414,716","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$54,271,869","country":"USA","day":"25","month":"01","year":"2015","remarks":""}],"weekendGross":[{"money":"$31,447","country":"USA","day":"08","month":"02","year":"2015","remarks":"93 Screens"},{"money":"$102,281","country":"USA","day":"25","month":"01","year":"2015","remarks":"208 Screens"}],"admissions":[{"money":"136,635","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)","1 hr 56 min (116 min) (Extended Edition)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Leica Summilux-C and Angenieux Optimo Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA (nextLAB dailies)","Warner Bros. Motion Picture Imaging, Burbank (CA), USA (digital intermediate)"],"filmLength":["2,970.5 m (6 reels)"],"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.3","metascore":"40","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Alliance of Women Film Journalists 2015","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Special Mention Award","categories":[{"category":"Actress Most in Need of a New Agent","names":[{"name":"Jennifer Aniston","id":"nm0000098","role":null}]}]}]},{"award":"MTV Movie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best WTF Moment","names":[{"name":"Jason Sudeikis","id":"nm0837177","role":null},{"name":"Charlie Day","id":"nm0206359","role":null}]}]}]},{"award":"Russian National Movie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Georges Award","categories":[{"category":"Best Foreign Comedy of the Year","names":[]}]}]},{"award":"Women Film Critics Circle Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won WFCC Award","categories":[{"category":"Worst Female Images in a Movie","names":[]}]}]}],"votes":"123,450","type":"Movie","companyCreditsSimple":[{"idCompany":"co0044439","name":"BenderSpink"},{"idCompany":"co0046718","name":"New Line Cinema"},{"idCompany":"co0430860","name":"RatPac Entertainment"}],"keywords":{"keywords":["scene during end credits","singing in a car","reference to franz beckenbauer","kidnapping","second part","prison","credit card","break in","self help group","husband wife relationship","triplets","tv interview","double cross","car chase","parking garage","sex addict","fratricide","crude humor","sex tape","reference to eli manning","reference to peyton manning","sequel","number in title","reference to sandra bullock","pegging","implied lesbianism","outtakes during end credits","bloopers during credits"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:01:02"}}