{"data":{"movies":[{"title":"Hallows' Eve","originalTitle":"","year":"2014","releaseDate":"20141014","directors":[{"name":"Sean McGarry","id":"nm1395630"}],"writers":[{"name":"Raymond Mamrak","id":"nm3018179"}],"runtime":"78 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzUxNTA4OV5BMl5BanBnXkFtZTcwMzAzODgwNw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"Years after a tragic accident leaves a young child scarred for life, the people responsible pay - with their lives.","simplePlot":"Years after a tragic accident leaves a young child scarred for life, the people responsible pay - with their lives.","actors":[{"actorName":"Danielle Harris","urlProfile":"http://www.imdb.com/name/nm0364583","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMDE5Mjk0Nl5BMl5BanBnXkFtZTcwMTI1MzgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1977","placeOfBirth":" Plainview, Long Island, New York, USA","birthName":"Danielle Andrea Harris","height":"4' 11\" (1.5 m)","bio":"Danielle Harris was born on June 1, 1977 in Plainview, Long Island, New York, USA as Danielle Andrea Harris. She is an actress, known for One Life to Live (1968), The Wild Thornberrys (1998) and The Last Boy Scout (1991). She has been married to David Gross since January 4, 2014. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMDE5Mjk0Nl5BMl5BanBnXkFtZTcwMTI1MzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364583","name":"Danielle Harris","idIMDB":"nm0364583"},"actorId":"nm0364583","character":"Nicole Bates","urlCharacter":"http://www.imdb.com/character/ch0393710","main":true},{"actorName":"Raymond Mamrak","urlProfile":"http://www.imdb.com/name/nm3018179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkyN2E5YjktOTVlMi00YzJjLThmZTEtN2U1ZTkyOGNmYmY4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1972","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Ray is a union affiliate with The Writers Guild of America (WGA), The Directors Guild of America (DGA), as well as SAG-AFTRA and AEA. Recognized by The Screen Actors Guild in 2013 as one of the most active producers in areas of the North Eastern United States, Ray continues to develop and create new projects for television, film and new media release. Starting as an amateur filmmaker with his Super8 camera in his youth Ray knew his calling, but truly fell in love with the business after working on the set of the film Eddie And The Cruisers in his freshman year of high school. After a stint in the US Army's 3rd Ranger Battalion and receiving his degree Ray started feeling out all the avenues of the entertainment business working for different studios, networks and independent film outfits in any capacity they would take him. \"I wanted to learn it all. I studied films, watching the great ones over and over to see what made them great and the bad ones to see what made them bad. How can someone be a great filmmaker and performer if they don't understand all the facets of the business that is who they are?,\" Ray said in and interview for SAG Magazine. From working as a writer, director, producer, actor, stuntman, and even credited as an editor and costume designer, Ray has fulfilled his goal of learning it all and has begun taking that knowledge and experience into his own production company's, Automatic Art Pictures and KMR Entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkyN2E5YjktOTVlMi00YzJjLThmZTEtN2U1ZTkyOGNmYmY4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3018179","name":"Raymond Mamrak","nicknames":["Jake","Hollywood"],"idIMDB":"nm3018179"},"actorId":"nm3018179","character":"Matthew Bates","urlCharacter":"http://www.imdb.com/character/ch0393711","main":true},{"actorName":"Courtney Baxter","urlProfile":"http://www.imdb.com/name/nm2068197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzcwMTQ1OF5BMl5BanBnXkFtZTgwNTQyMDA0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1993","placeOfBirth":" West Chester, Pennsylvania, USA","height":"5' 6\" (1.68 m)","bio":"Courtney Baxter is from West Chester PA and joined both SAG and AFTRA at age 11 working around the country from that point forward. As a seasoned performer, those experiences helped develop her interest in all parts of film production. At 16, Courtney became an Executive Producer and lead in the drama \"Reco\" which did well on the festival circuit. As an 18 year old, she Executive Produced and starred as Eve in the horror feature film \"Hallow's Eve\" which gained eOne distribution in 2012, the same year she began college. In 2013 while interning at Tribeca Films, Courtney collaborated with her mentor and helped develop, produce, and star in the feature film \"Running on Empty\" which will premier in the US in 2014. In 2014, Courtney is proud to be part of the \"Sharknado 2\" team and had an awesome time filming the sequel to the instant cult classic \"Sharknado.\" The film is set to premiere on the SYFY channel on July 31, 2014. Courtney became a community activist at a young age and she is a founding member of a youth mentor program and a dance instructor and counselor in the crime ravaged city of Chester PA. She became active with community food banks, anti bullying and equal rights campaigns as a teen. In 2012 she represented America's oldest teen scholarship organization, ANTSO, as Miss National Sweetheart 2012 where she became involved in national charitable initiatives. Courtney has influenced many young people with her presence and constantly demonstrates the importance of an unbiased loving heart, strong work ethic, and the will to make a positive difference wherever she can by example and engagement. Equally important to Courtney is her pursuit of a double Film Studies/Economics degree at Pace University in NYC as the recipient of their Presidential Scholarship. Additionally, she still tries to find a few weekends every year to travel around the country as a founding member of the Artists Simply Human/ASH Productions, National Dance Convention. As a full time student and actor Courtney maintains a busy schedule, but believes her efforts are worthwhile as she loves the career path she has chosen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzcwMTQ1OF5BMl5BanBnXkFtZTgwNTQyMDA0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2068197","name":"Courtney Baxter","idIMDB":"nm2068197"},"actorId":"nm2068197","character":"Eve Bates","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashley C. Williams","urlProfile":"http://www.imdb.com/name/nm2280521","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODQ3Mjc4M15BMl5BanBnXkFtZTgwMTU1NTk2NzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1984","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Ashley Christina Williams","height":"5' 3\" (1.6 m)","bio":"Ashley C. Williams is best known for playing \"Lindsay\" in the cult horror film The Human Centipede (First Sequence) (2009). She grew up in Charlottesville, VA, and began acting on stage at the age of ten in the role of Tiger Lily in \"Peter Pan\". Her father is a sales manager and consultant in the natural/organic foods industry and her mother is a poet, spiritual healer and full-time mother. Ashley was home-schooled during her high school years while pursuing acting full time. She then moved to New York City to attend The American Academy of Dramatic Arts (where she received the Charles Jehlenger Award for Excellence in Acting). Ashley has \"trod the boards\" at New York's La MaMa E.T.C, the Cherry Lane Theaters, 59E59 Theaters and Center Stage NY.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODQ3Mjc4M15BMl5BanBnXkFtZTgwMTU1NTk2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2280521","name":"Ashley C. Williams","idIMDB":"nm2280521"},"actorId":"nm2280521","character":"Ashley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tiffany Shepis","urlProfile":"http://www.imdb.com/name/nm0791898","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ2MTQ3MDA2NF5BMl5BanBnXkFtZTgwNzAxMjkxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1979","placeOfBirth":" New York City, New York, USA","height":"5' 3\" (1.6 m)","bio":"Tiffany Shepis born and raised in NYC. She got her start in James Gunn (Guardians of the Galaxy)Tromeo and Juliet when she was just 16 years old. Since then Tiffany has made over 100 independent films. Most notably the SYFY hit Abominable, the late night fan favorite The Hazing, After dark horror fests Nightmare Man, Sundance' The Violent Kind, as well as The multi award winning The Frankenstein Syndrome and the mega cult hit Sharknado 2! Tiffany continues to work as an actress, host and producer and is constantly on fan favorite lists such as Playboys top sexiest scream queens.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ2MTQ3MDA2NF5BMl5BanBnXkFtZTgwNzAxMjkxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0791898","name":"Tiffany Shepis","idIMDB":"nm0791898"},"actorId":"nm0791898","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chance Michael Corbitt","urlProfile":"http://www.imdb.com/name/nm0179253","urlPhoto":"","biography":{"dateOfBirth":"1976","placeOfBirth":"","height":"5' 7\" (1.7 m)","bio":"Chance Michael Corbitt was born in 1976. He is an actor, known for The Lost Boys (1987), Pumpkinhead (1988) and After the Promise (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0179253","name":"Chance Michael Corbitt","idIMDB":"nm0179253"},"actorId":"nm0179253","character":"Tommy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Flitter","urlProfile":"http://www.imdb.com/name/nm1346160","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMDI0MzYzNl5BMl5BanBnXkFtZTgwOTc5NjcwMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1994","placeOfBirth":" Ridgewood, New Jersey, USA","height":"5' 3\" (1.6 m)","bio":"Josh Flitter was born in Ridgewood NJ and grew up in Marlboro NJ. Josh was discovered by a local management company TM Talent when he was 5 years old and began to book commercials and small parts on various TV shows. Josh got a great break at the age of 8 when he auditioned for Bravos reality series \"Situation Comedy\" and was chosen out of hundreds of boys to play the lead of Stephen in \"Stephens Life\" . Sean Hayes and Todd Millner produced the series and Fred Savage directed. Josh was also cast as the youngest brother of 4 in \"My Life With Men\" for and ABC pilot which starred Wendi Malick. At the ripe age of 10, Josh auditioned for Bill Paxton who then directed him along with Shia LeBeouf in \"The Greatest Game Ever Played\". Josh was cast as Eddie Lowery , the pint sizes caddie to the amateur golfer Francis Ouimet portrayed by Shia Le Beouf. Josh was spotted by the great producer Jerry Weintraub while appearing on the Jay Leno show and Jerry personally called him to ask him to play the role of Corky in \" Nancy Drew\" starring Emma Roberts. Jerry said that he would re write the role for him if he took it and he did! After the success of Nancy Drew , Josh was offered many opportunities and landed the role of Mike, choir boy in \"License to Wed' opposite the great Robin Williams. While promoting the film on Larry King, Robin Williams said he never saw such comedy timing in a young kid like he did in Josh. Josh went on to appear in several episodics and feature films into his teen years. Josh recently graduated for SVA in New York City with his BFA in Directing. Josh continues to work when the opportunities arise and also studies and takes classes with the improv company ,The Upright Citizens Brigade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMDI0MzYzNl5BMl5BanBnXkFtZTgwOTc5NjcwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1346160","name":"Josh Flitter","idIMDB":"nm1346160"},"actorId":"nm1346160","character":"Marty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ricky Rude","urlProfile":"http://www.imdb.com/name/nm4764546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMjM0MjE2MF5BMl5BanBnXkFtZTgwMDY1MTI1MDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Following a series of critically acclaimed underground releases, Ricky Rude is set to drop \"No Guts, No Glory\" in the near future. His best body of work to date, the album capitalizes on the clever wordplay and catchy one-liners characteristic of his early work and incorporates them into a new dimension of high minded cohesion. Having grown up listening to Scarface and battle rapping in the school cafeteria, Ricky's musical style took an eclectic turn when he was introduced to guitar-heavy alternative punk bands like Nirvana and The Smashing Pumpkins. A rebel by nature, he spent his youth as an enfant terrible, stirring up trouble beneath the dark, polluted clouds of New Jersey. After being arrested twice the week of his high school graduation-a ceremony that his family members, doubting his ability to graduate, did not attend-Ricky found within himself a new determination to make his life significant. Leaving his life in Jersey behind, he relocated to Southern California. Working out of Compton, he quickly immersed himself in the local music scene, forming relationships with rappers such as Compton Menace and Glasses Malone. Not a stationary body, however, Ricky also spent this time in Los Angeles working with DJ Khalil and in Hollywood corrupting Tinseltown's classiest bachelorettes. Since returning to the East Coast, Ricky has been making headway as the troubadour of South Jersey with a new brand of hip hop entitled Punk Rap. This innovative genre embraces Modernist tropes of making it new, while at the same time paying tribute to the great artists that paved the way. Today, Ricky not only looks up to, but also works with these legends-such as his longtime hero and favorite living rapper, Scarface, who makes a guest appearance on \"No Guts, No Glory.\" Ricky's songwriting focuses on passion, truth to life, and enjoying himself in a manner that speaks equally to the hood as it does to the 'burbs. Although the faint of heart may find his edginess off-putting, Ricky's commitment to honesty will not be contained by political filters. And, those willing to hear the truths about life will experience the inspirational tales of unparalleled ambition, fearlessness, and perseverance that have come to define Ricky Rude.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMjM0MjE2MF5BMl5BanBnXkFtZTgwMDY1MTI1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4764546","name":"Ricky Rude","idIMDB":"nm4764546"},"actorId":"nm4764546","character":"Kerone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Bagnell","urlProfile":"http://www.imdb.com/name/nm2869914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGM0ZDc1ZWQtYjY0MC00ZTRjLTllYWUtYzFhNmNkYjE3ZWJmL2ltYWdlXkEyXkFqcGdeQXVyMTg2MjgwMDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"James Bagnell is an actor, known for No Boundaries (2009), The Suspect (2013) and Terminal Happiness (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGM0ZDc1ZWQtYjY0MC00ZTRjLTllYWUtYzFhNmNkYjE3ZWJmL2ltYWdlXkEyXkFqcGdeQXVyMTg2MjgwMDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2869914","name":"James Bagnell","idIMDB":"nm2869914"},"actorId":"nm2869914","character":"Eugene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Blake Baxter","urlProfile":"http://www.imdb.com/name/nm1393098","urlPhoto":"","biography":{"bio":"Blake Baxter is an actor, known for High Tech Soul: The Creation of Techno Music (2006), SubBerlin - Underground United (2008) and Universal Techno (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1393098","name":"Blake Baxter","idIMDB":"nm1393098"},"actorId":"nm1393098","character":"Teen in Cuffs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nikki Bell","urlProfile":"http://www.imdb.com/name/nm3923793","urlPhoto":"","biography":{"height":"5' 7\" (1.7 m)","bio":"Former NFL Eagles Cheerleader, Nikki Bell revived her acting career starring in three Indie Feature FIlms in 2010 including Down the Road written by Jason Mayer and revised by Victor Miller (Friday the 13th). Keeping the momentum going she jumped into 2011 with another three Feature Films, a rockin Web Series as well as various shorts, music videos and more. You can see her Working with the likes of Corey Feldman ( the lost boys), Danielle Harris ( Halloween among numerous other films), Ashley C. Williams ( Human Centipede), Scream Queen Tiffany Shepis, and the ever popular and \"BIG\" deal Ron Jeremy. The now 5'7\" blond hair blue eyed beauty began her acting career at the age of three while living in Ontario, Canada modeling for various clothing companies and department stores and working in commercials. Up for the role of the younger Cecilia 'CC' Carol Bloom in the film Beaches ultimately losing out after the final round of call backs, the process started her on her path. Soon after, she moved back to the states where her acting career took a back seat to her family legacy of dance in which her grandmother performed as a Rocket and her mother as a dancer with the Philadelphia Ballet. Through dance she toured and performed in Disney Theme Parks, Cruise Lines as well as up and coming artists music videos and Various Theater Productions. She was also privileged to work as the soul choreographer for many productions while still in high school and became nationally recognized as a Nominated National Dancer of The Year for 2002. That same year she was sought out and sponsored to travel and compete in IMTA where she left with the title of National Soap Actress Of the Year 2002. Upon graduation from high school she entered PSU Main's theater program. After a year in the program a beloved teacher pulled her aside and urged her to follow her heart in taking on a more intensified program. She left PSU and began training in NYC at the Atlantic Theater Conservatory under the direction of David Mamet and WIlliam H. Macey. After school Bell left NYC and moved to Philadelphia to cheer for two season for the Philadelphia Eagles. While cheering she became Miss December 2007 as well as graced the back cover of the 2008/2009 Eagles Calendars. While working for the NFL she was chosen along side 4 other girls to represent the NFL on a military tour through Iraq and Kuwait. In her second season, Bell was joined on the squad by her two sisters, Paige and Danni-lynn completing the trio of the \"Bell Sisters.\" Soon after she found herself back on the screen playing Chrystie Brinklie's daughter on the final episode of Ugly Betty and was currently seen on stage as a Miss Pennsylvania USA 2010 contestant. With so much accomplished over the past two year this can only be the beginning.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3923793","name":"Nikki Bell","idIMDB":"nm3923793"},"actorId":"nm3923793","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Bergh","urlProfile":"http://www.imdb.com/name/nm3357905","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmYzZDIxNTEtZjlhYy00Mzc4LWI0MzAtZmIxOGYwNTExMjRhL2ltYWdlXkEyXkFqcGdeQXVyMjAxNTYzMjQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1999","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Michelle Rose Bergh","height":"5' 6\" (1.68 m)","bio":"Michelle Bergh was born on May 30, 1999 in Minneapolis, Minnesota, USA as Michelle Rose Bergh. She is known for her work on Absence of Grey (2009), Ghost from the Machine (2010) and Hallows' Eve (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmYzZDIxNTEtZjlhYy00Mzc4LWI0MzAtZmIxOGYwNTExMjRhL2ltYWdlXkEyXkFqcGdeQXVyMjAxNTYzMjQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3357905","name":"Michelle Bergh","idIMDB":"nm3357905"},"actorId":"nm3357905","character":"Young Nichole Bates","urlCharacter":"http://www.imdb.com/character/ch0393710","main":true},{"actorName":"Kelly Boeckle","urlProfile":"http://www.imdb.com/name/nm4952033","urlPhoto":"","biography":{"bio":"Kelly Boeckle is an actress, known for Hallows' Eve (2014) and Bob and Me (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4952033","name":"Kelly Boeckle","idIMDB":"nm4952033"},"actorId":"nm4952033","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dylan Caltabiano","urlProfile":"http://www.imdb.com/name/nm5162290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjM4MzUxNF5BMl5BanBnXkFtZTgwOTA3MjYyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Dylan Caltabiano is known for her work on Chasing Yesterday (2015), Parallax (2015) and Hallows' Eve (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjM4MzUxNF5BMl5BanBnXkFtZTgwOTA3MjYyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5162290","name":"Dylan Caltabiano","idIMDB":"nm5162290"},"actorId":"nm5162290","character":"Young Woman on Wagon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beth Campbell","urlProfile":"http://www.imdb.com/name/nm2977369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwOTY2NjE2N15BMl5BanBnXkFtZTgwMjQyODg2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Beth Campbell is an actress, known for Marathon (2010), Fake (2011) and Julie & Julia (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwOTY2NjE2N15BMl5BanBnXkFtZTgwMjQyODg2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2977369","name":"Beth Campbell","idIMDB":"nm2977369"},"actorId":"nm2977369","character":"Mama","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2106440","urlIMDB":"http://www.imdb.com/title/tt2106440","business":{"budget":{"money":"$300,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"10","year":"2011","remarks":null},{"money":null,"country":null,"day":"21","month":"11","year":"2011","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 18 min (78 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.3","filmingLocations":[{"location":"Kennett Square, Pennsylvania, USA"}],"awards":[],"votes":"516","type":"Movie","companyCreditsSimple":[{"idCompany":"co0145873","name":"Kphat Productions"}],"keywords":{"keywords":["throat slitting","head cut in half","blood splatter","chainsaw","killer","decapitation","gore","blood","exposed intestines","nudity","bare breasts","slasher","pot smoking","tractor accident","clown","corn maze","disfigured face","halloween","haunted house attraction"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:01:55"}}