{"data":{"movies":[{"title":"The Sublime and Beautiful","originalTitle":"","year":"2014","releaseDate":"20141215","directors":[{"name":"Blake Robbins","id":"nm1083077"}],"writers":[{"name":"Blake Robbins","id":"nm1083077"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2NTc3Mjk3M15BMl5BanBnXkFtZTgwMzYzOTczMTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"David Conrad is a college professor and sometimes philanderer raising three children in a small Kansas suburb with his wife Kelly. When sudden tragedy strikes the family in the days before Christmas, David and Kelly's marriage is brought to its breaking point and David's desire for retribution leads him into uncharted moral territory with the question: what can we forgive?","simplePlot":"David Conrad is a college professor and sometimes philanderer raising three children in a small Kansas suburb with his wife Kelly. When sudden tragedy strikes the family in the days before ... ","actors":[{"actorName":"Blake Robbins","urlProfile":"http://www.imdb.com/name/nm1083077","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMzU2NTg2NDdeQTJeQWpwZ15BbWU3MDU5MzE5NDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1965","placeOfBirth":" Turkey","birthName":"William Blake Robbins","height":"6' 3\" (1.91 m)","bio":"Blake Robbins was born in Karamousel, Turkey (his father was stationed there with the US Navy). After getting his college degree in business marketing, he attended The American Academy of Dramatic Arts in NYC. Best known for playing Tom Halpert on the hit NBC show The Office, and for his role as C.O. Dave Brass on the critically acclaimed HBO series Oz. He's gaining a reputation for being one of the most versatile actors in Hollywood. He's played a US Congressman on Cold Case, a murdering pedophile on Wanted, a grieving husband on Eli Stone, an angry father on Private Practice, a rapist State Trooper on Medium, and a stuttering prison guard in the feature film Love Comes to the Executioner. He recently appeared in The Ugly Truth opposite Gerard Butler. He appears in Bunker Hill for director Kevin Willmott. For the film, Robbins portrays \"Delmar,\" a lead character, and is also an Associate Producer. Bunker Hill also stars James McDaniel (NYPD Blue) and Saeed Jaffrey (Gandhi). He also appears in Kevin Willmott's The Only Good Indian opposite Wes Studi, which was in the 2009 Sundance Film Festival. He played Thomas Blake in the feature film Arc opposite Peter Facinelli. Among his TV appearances are recurring roles on The O.C. and Firefly, from creator Joss Whedon, as well as a memorable performance on 24 as the drunk who gets tasered by Chloe (season 5). Having spent almost ten years in New York, Blake has an extensive theater background. He made his Broadway debut in the Arthur Miller play The Man Who Had All the Luck opposite Chris O'Donnell, directed by Scott Ellis. Just a few of his over sixty theatrical productions are Tape with the Naked Angels, Joe Fearless at the Atlantic Theater Company, Hard Times at the Evidence Room, Hedda Gabler at the Odyssey Theater, and Placement at the Black Dahlia Theater. This performance earned him an LA Weekly Award for \"Best Solo Performance\" of the year. Robbins is co-author of Acting Qs: Conversations with Working Actors with casting director and author Bonnie Gillespie. Blake resides in the Los Angeles area with his wife Karen, daughters Molly and Emma and son Cooper.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMzU2NTg2NDdeQTJeQWpwZ15BbWU3MDU5MzE5NDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1083077","name":"Blake Robbins","idIMDB":"nm1083077"},"actorId":"nm1083077","character":"David Conrad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Kirk","urlProfile":"http://www.imdb.com/name/nm0456507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzM1NDEyM15BMl5BanBnXkFtZTgwOTk3ODY3ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Laura Kirk grew up in rural Kansas where she attended high school and got her degree in theater and film from the University of Kansas. In New York, she studied with Wynn Handman, Suzanne Esper, and improv with Alan Arkin. Her debut was as co-writer and star in the critically acclaimed film Lisa Picard Is Famous, directed by Griffin Dunne. It premiered at the Cannes Film Festival and was featured in many international and American festivals. After its premiere at the Film Forum in New York City, Lisa Picard Is Famous was called \"hilarious\" by Stephen Holden of The New York Times and \"squirmingly funny\" by Owen Gleiberman of Entertainment Weekly. It is included in John Gaspard's book Fast, Cheap and Under Control ...Lessons Learned from the Greatest Low Budget Movies of All Time. Laura has continued acting and producing independent films in Kansas where she now lives.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NzM1NDEyM15BMl5BanBnXkFtZTgwOTk3ODY3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0456507","name":"Laura Kirk","idIMDB":"nm0456507"},"actorId":"nm0456507","character":"Kelly Conrad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Del Negro","urlProfile":"http://www.imdb.com/name/nm0215682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDU3NjIwM15BMl5BanBnXkFtZTgwNjc2MDU1NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1972","placeOfBirth":" Mount Kisco, New York, USA","height":"6' 4\" (1.93 m)","bio":"Matthew Del Negro has built a solid career with varied roles in features, television and theater. His hot start to 2015 is simply a continuation of a busy 2014 where he had significant arcs on several hit shows, including ABC's Scandal (2012) and Mistresses (2013), MTV's Teen Wolf (2011), and CBS's NCIS: Los Angeles (2009). This Spring, Matt can be seen as Interim Fire Chief Pat Pridgen in the 3rd season of the critically acclaimed NBC drama Chicago Fire (2012) while simultaneously continuing his controversial role of Michael Ambruso on Shonda Rhimes' Scandal (2012). Matt also stars in the MGM action comedy feature Hot Pursuit (2015) alongside Reese Witherspoon and Sofía Vergara. Matt's Hollywood success has been well earned, as he began his career in small theater productions in New York before landing a pivotal recurring role on Season 4 of HBO's groundbreaking series The Sopranos (1999) opposite James Gandolfini and Edie Falco. Building on that momentum, Matt went on to land major arcs on NBC's critically-acclaimed The West Wing (1999) and Showtime's United States of Tara (2009), as well as ABC Family's Beautiful People (2005). In addition to these arcs, he kept himself busy with guest spots on shows across the television landscape, including recurring roles on Parenthood (2010), Rizzoli & Isles (2010) and CSI: Miami (2002). He also continued to grab notice with flashy spots on shows like The Good Wife (2009), Damages (2007) and Marry Me (2014), toggling the line between drama and comedy while returning to the boards in A.C.T.'s sold-out run of David Mamet's \"Speed the Plow\" to play the role of Bobby Gould, directed by Loretta Greco. Having made his own short film, Christmas Break, in 2007, Matt stepped behind the camera again as creative consultant to help fellow actor Chris Messina with his directorial debut, Alex of Venice (2014). Matt also acts in the film which premieres in April, starring Don Johnson, Mary Elizabeth Winstead and Derek Luke. He has had similarly prominent roles in an assortment of festival and independent films such as the gritty The Sublime and Beautiful (2014), Celeste & Jesse Forever (2012) starring Andy Samberg and Rashida Jones, Ira & Abby (2006) for Magnolia Pictures, and the Ethan Hawke directed Chelsea Walls (2001). Matthew grew up in Westchester County, New York and graduated from Boston College, where he played Division I Lacrosse and and consistently made the Dean's List. He lives with his family in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDU3NjIwM15BMl5BanBnXkFtZTgwNjc2MDU1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0215682","name":"Matthew Del Negro","idIMDB":"nm0215682"},"actorId":"nm0215682","character":"Mike Embree","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anastasia Baranova","urlProfile":"http://www.imdb.com/name/nm1325199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFiNzMxOWYtYmE1MC00YzZlLWJmMDMtNDkwNGY2NjFmMjVjL2ltYWdlXkEyXkFqcGdeQXVyNDA2Nzc1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1989","placeOfBirth":" Moscow, RSFSR, USSR [now Russia]","height":"5' 6¼\" (1.68 m)","bio":"Anastasia Baranova was born on April 23, 1989 in Moscow, RSFSR, USSR. She is known for her work on Z Nation (2014), Scout's Safari (2002) and Yaiba: Ninja Gaiden Z (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGNiMTU5ZDAtMzFlZC00ZWE5LWI0NjUtNjYwOTc1MjdhODI4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1325199","name":"Anastasia Baranova","idIMDB":"nm1325199"},"actorId":"nm1325199","character":"Katie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Boyle","urlProfile":"http://www.imdb.com/name/nm0102302","urlPhoto":"","biography":{"dateOfBirth":"8 May 1984","placeOfBirth":" Andrews Air Force Base, Maryland, USA","bio":"Matthew Boyle was born on May 8, 1984 in Andrews Air Force Base, Maryland, USA. He is an actor and editor, known for Undead (2003), Die Watching (1993) and The Sublime and Beautiful (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0102302","name":"Matthew Boyle","idIMDB":"nm0102302"},"actorId":"nm0102302","character":"Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Bylsma","urlProfile":"http://www.imdb.com/name/nm3856319","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMxYWUxNzAtZTVhZi00ZjNlLWJiNzItMWYyOTU4YmU2YWU0L2ltYWdlXkEyXkFqcGdeQXVyMjMyNTM1OTA@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Chris is known for his appearances on THE NIGHT SHIFT (NBC) with Ken Leung & Robert Rodriguez's FROM DUSK TIL DAWN (El Rey), alongside series lead Zane Holtz - in addition to nearly 200 other roles. Chris was born on February 25th in Topeka, KS, where he was also raised. His father moved from the West Coast to the Midwest & starting his own business, which he's run successfully for 40 years. His mother got her degree in education & raised 9 kids born over a 20 year range. While working in his hometown as an editor for a Fortune 500 company, Chris discovered the indie film & commercial scene in nearby Kansas City, & in 2009 he received a part in the first film he auditioned for. When he wasn't acting & learning on set, he was studying the craft & as many details as possible of each crew position. By 2012 he'd brought characters to life in over 20 films & been involved behind the scenes in nearly every possible facet in at least that many more, before resigning his job & moving to Kansas City to pursue acting full-time. By 2015, he had been in nearly 200 films (features or shorts), TV shows, webisodes, & commercials in Kansas City & various other states; over 20 of which won awards, including Regional Emmys & 4 individual Best Acting awards. He'd also worked behind the camera as director, producer, editor, & in casting - winning 7 awards for films directed, & receiving the 2014 Emerging Filmmaker Award from the Kansas City Film Fest. This culminated in a move to Albuquerque, NM, mid-2015, where he booked four episodic roles and three features in his first year, as well as continuing to travel for additional film & commercial work in other states.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMxYWUxNzAtZTVhZi00ZjNlLWJiNzItMWYyOTU4YmU2YWU0L2ltYWdlXkEyXkFqcGdeQXVyMjMyNTM1OTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3856319","name":"Chris Bylsma","idIMDB":"nm3856319"},"actorId":"nm3856319","character":"Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Carey","urlProfile":"http://www.imdb.com/name/nm2323697","urlPhoto":"","biography":{"bio":"Joe Carey is an actor and director, known for Businesses and Bosses (2014), The Donald Gordon Story (2014) and Normal Life (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2323697","name":"Joe Carey","idIMDB":"nm2323697"},"actorId":"nm2323697","character":"Father Lynch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael D. Coffey","urlProfile":"http://www.imdb.com/name/nm2397087","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1Mzk3MDMwNV5BMl5BanBnXkFtZTgwODA3MjcyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michael D. Coffey was born in Ulysses, Kansas and grew up mostly there. He is a graduate of Amarillo College and West Texas A&M University, where he earned a bachelors in business administration with a major in computer information systems. Michael has been an extra actor in three feature films: \"Air\", \"Lenexa One Mile\" and \"The Only Good Indian\". He has a speaking part in the film \"The Sublime and Beautiful\". Michael is credited as an Associate Producer for the feature film, \"Nailbiter\". He founded Catalyst Film Productions, LLC. and has written three feature-length screenplays, one of which he is working on producing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1Mzk3MDMwNV5BMl5BanBnXkFtZTgwODA3MjcyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2397087","name":"Michael D. Coffey","idIMDB":"nm2397087"},"actorId":"nm2397087","character":"Kansas Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith Loneker","urlProfile":"http://www.imdb.com/name/nm0518828","urlPhoto":"","biography":{"height":"6' 4\" (1.93 m)","bio":"Despite growing up in a small town in New Jersey, Keith Loneker knew early in life that he had bigger things in store for him. You'd never know by his hulking body that this giant is an underdog. Loneker has overcome many personal obstacles to defy the odds his entire life. In high school he endured a painful hip injury. Doctors said he would never play sports again. Keith decided not to accept the doctor's opinion. He became a gym rat working out 3 hours a day to rehabilitate his ailing hip. After a year of training, Loneker proved doctors wrong when he stepped onto a football field for the first time in 2 years. Loneker, who was just happy to be back among his pals playing ball, was not aware that his raw talent on the football field would land him a Division 1 scholarship with the University of Kansas. The scholarship also did not come easy to Loneker. Many local Division 1 football programs passed on Loneker. They said he was too short, injury prone, or he just didn't have the talent. Glen Mason, the former head coach of the University of Kansas, balked at Loneker's critics and offered him a full scholarship. It was apparent early in Loneker's college career that he was a special player. He played as a true freshman. Loneker was an all Big Eight tackle three years at the University of Kansas. After graduation Loneker prepared for the NFL draft. His agent and many publications projected he would be a third round draft choice. Loneker had a party at his house in New Jersey on draft day with family and close friends. Loneker was shocked when after eight rounds his name was not called by an NFL club. His family and friends could see the disappointment in his eyes after the NFL draft had finished. Then as everyone thought he may get upset, Keith turned his misfortune into fuel.. Not getting drafted made Loneker hungry to prove his critics wrong once again. He walked on with the LA Rams and immediately began turning heads with vicious play on the field. The coaches knew they had plucked a gem and Loneker not only made the team but went on to start by the end of his rookie season. Keith enjoyed his five years in the NFL and is thankful he had the chance to fulfill his childhood dream. Keith didn't realize that his football career was about to transition into a movie career. A former teammate who was working in Hollywood as an agent called Loneker and told him he had a part that he thought he'd fit perfect. Loneker had never acted before, but decided to make a tape for an audition. The producers of the film hired him off his tape alone. To Keith's surprise he landed the role of \"White Boy Bob\" in a Steven Soderbergh film \"Out Of Sight\". The part was small, but Loneker got to showcase his talent with stars like George Clooney, Jennifer Lopez, and Ving Rhames. Loneker continued his career in film and landed a small part in, \"Rock Star\" with Mark Wahlberg and Jennifer Anniston. Nothing has come easy for Loneker during his life, but that doesn't stop this man from trying to fulfill all of his dreams. This small town Jersey boy has shown all his critics who judged him that nothing can stand in the way of a motivated man. Some people might call Loneker's success luck, but those who know him say it is character, hard work, and a big heart that made this underdog what he is today.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0518828","name":"Keith Loneker","nicknames":["Big Daddy"],"idIMDB":"nm0518828"},"actorId":"nm0518828","character":"Craig","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shanda Lee Munson","urlProfile":"http://www.imdb.com/name/nm0078693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjkxMTg5NV5BMl5BanBnXkFtZTcwNzI4OTI4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Shanda Lee Munson, grew up in Iowa, and performed in several community productions in her youth. Having always wanted to pursue a professional acting career, her feature film debut came in 2000 in the critically acclaimed \"Remember the Titans\" starring Denzel Washington. With over 25 professional film and television credits to her name, numerous National Commercials, and several projects as an Actress, Producer and Writer in development, Shanda continues to build her already impressive resume. She can currently be seen on the TV show \"Ghostbreakers\" on the YouToo network. She can also be seen this summer in the web series \"Project Phoenix,\" which also stars Lee Meriwether (Catwoman) and Sherilyn Fenn (Twin Peaks) and directed by the award winning Chad Darnell. In 2013, two of her Independent films will be released, \"The Sublime and Beautiful\" which also stars Blake Robbins (The Office, Monday Mornings), and \"Birthday Cake\" which is the feature length sequel to the award winning short \"Groom's Cake.\" Shanda had the thrilling opportunity to play the daughter of one of her industry idols, Helen Shaver (Actor, Director). In addition to acting, Shanda has added Producer to her credits. One of many projects she has in development is \"The Book of Job\" with New Palace Films. Shanda will be producing and the lead actress. In January of 2013, Shanda and her business partner, Chevy White, officially formed their production company \"Play Nice Productions LLC.\" They have a full slate of films and TV shows in various stages of development. In the spring of 2013, two of their short films will be in production, and in the summer their first feature \"Boys of Summer Avenue\" will go into production. Eriq La Salle has signed onto direct. She graduated from college with degrees in Business Administration, Public Relations and Spanish. She is married to Eric Munson, a professional baseball player. They have a son and daughter together.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjkxMTg5NV5BMl5BanBnXkFtZTcwNzI4OTI4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0078693","name":"Shanda Lee Munson","idIMDB":"nm0078693"},"actorId":"nm0078693","character":"Jamie Weston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Armin Shimerman","urlProfile":"http://www.imdb.com/name/nm0001734","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MzE0NDM5MV5BMl5BanBnXkFtZTcwMTY5MDYxMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1949","placeOfBirth":" Lakewood, New Jersey, USA","height":"5' 6\" (1.68 m)","bio":"Armin Shimerman was born on November 5, 1949 in Lakewood, New Jersey, USA. He is an actor, known for Star Trek: Deep Space Nine (1993), The Hitcher (1986) and BioShock 2 (2010). He has been married to Kitty Swink since May 16, 1981.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MzE0NDM5MV5BMl5BanBnXkFtZTcwMTY5MDYxMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001734","name":"Armin Shimerman","idIMDB":"nm0001734"},"actorId":"nm0001734","character":"Lee Westin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Stone","urlProfile":"http://www.imdb.com/name/nm3984118","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Chris Stone yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3984118","name":"Chris Stone","idIMDB":"nm3984118"},"actorId":"nm3984118","character":"College Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laurie Catherine Winkel","urlProfile":"http://www.imdb.com/name/nm3212274","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzgyNjQzOV5BMl5BanBnXkFtZTgwMzk0ODg5OTE@._V1_UY44_CR21,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Born on August 23, 1990 in Topeka, Kansas, Laurie Catherine Winkel is an actress of stage, screen and voiceover, known for her work in the Lawrence and Kansas City film circuit, including The Sublime and Beautiful (2014), State of the Union (2015) with Bruce Branit FX, The Profit (2017), and The Donald Gordon Story (2014), the latter of which went on to feature in the Cannes Film Festival in France. Since 2009 she has participated in half a dozen Wild West Film Festival shorts, including the horror movie-musical First Date (2012). She frequently features in horror films, hoping to be considered a \"scream queen\" of the Midwest. Laurie, who sometimes goes by her middle name, Catherine, is a fluent French speaker and while living in France has acted onstage at Disneyland Paris in the 2015 musical production of \"Chantons la Reine des Neiges\", or \"Frozen Sing-Along,\" in English and French versions. She received a Bachelor of Arts from Kansas University in Theatre Performance. She studied Dialects under Paul Meier, including Original Shakespearean Pronunciation (OP). In 2014 she toured to New Orleans Fringe Festival with Buran Theatre Company in their eclectic production of Nightmares: A Demonstration of the Sublime. Laurie frequently collaborates with Through A Glass Productions. In 2014 she acted in an international commercial for Monsanto. She frequently does voiceover and commercial work in Kansas City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzgyNjQzOV5BMl5BanBnXkFtZTgwMzk0ODg5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3212274","name":"Laurie Catherine Winkel","idIMDB":"nm3212274"},"actorId":"nm3212274","character":"Mandy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott William Winters","urlProfile":"http://www.imdb.com/name/nm0936001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzgwOTE4M15BMl5BanBnXkFtZTYwOTQ3MTEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1965","placeOfBirth":" New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Scott William Winters is the brother of actor Dean Winters and writer Brad Winters. His sister Blair is married to executive producer/writer Jorge Zamacona. Scott is married to Jennifer Logan Winters. They have 2 daughters, Grace and Faith. Scott is from New York and attended Northwestern University in Chicago. Following the 2010 earthquake in Haiti, he went down with friends to serve as an EMT, which he works as part time. He and his wife are completing a documentary on the experience in Haiti. He enjoys surfing, writing, family-time, and reading the Bible.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzgwOTE4M15BMl5BanBnXkFtZTYwOTQ3MTEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936001","name":"Scott William Winters","idIMDB":"nm0936001"},"actorId":"nm0936001","character":"John Denton","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2271685","urlIMDB":"http://www.imdb.com/title/tt2271685","business":{"budget":{"money":"$300,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Red One Camera"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","filmingLocations":[{"location":"Lawrence, Kansas, USA"}],"awards":[{"award":"Kansas City FilmFest 2014","titlesAwards":[{"titleAwardOutcome":"Won Festival Prize","categories":[{"category":"Heartland - Best Feature Narrative","names":[{"name":"Blake Robbins","id":"nm1083077","role":null}]},{"category":"Heartland - Best Narrative Feature","names":[{"name":"Blake Robbins","id":"nm1083077","role":null}]}]}]},{"award":"Milano International Film Festival Awards (MIFF Awards) 2014","titlesAwards":[{"titleAwardOutcome":"Won Leonardo's Horse","categories":[{"category":"Best Actor","names":[{"name":"Blake Robbins","id":"nm1083077","role":null}]}]},{"titleAwardOutcome":"Nominated Leonardo's Horse","categories":[{"category":"Best Director","names":[{"name":"Blake Robbins","id":"nm1083077","role":null}]},{"category":"Best Screenwriting","names":[{"name":"Blake Robbins","id":"nm1083077","role":null}]},{"category":"Best Actress","names":[{"name":"Laura Kirk","id":"nm0456507","role":null}]},{"category":"Best Cinematography","names":[{"name":"Lyn Moncrief","id":"nm1371498","role":null}]},{"category":"Best Editing","names":[{"name":"Jennifer Vecchiarello","id":"nm1719204","role":null}]},{"category":"Best Music","names":[{"name":"Lili Haydn","id":"nm0370768","role":null}]}]}]},{"award":"Newport Beach Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Achievement Award","categories":[{"category":"Directing","names":[{"name":"Blake Robbins","id":"nm1083077","role":null}]}]},{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Best Feature Film","names":[{"name":"Blake Robbins","id":"nm1083077","role":null},{"name":"Jon Niccum","id":"nm1425638","role":null},{"name":"James B. Cox","id":"nm3740231","role":null},{"name":"Marci Liroff","id":"nm0513924","role":null},{"name":"Kevin Slee","id":"nm5905733","role":null}]},{"category":"Best Actor","names":[{"name":"Blake Robbins","id":"nm1083077","role":null}]},{"category":"Best Cinematographer","names":[{"name":"Lyn Moncrief","id":"nm1371498","role":null}]}]},{"titleAwardOutcome":"Won Special Prize","categories":[{"category":"Best Actress","names":[{"name":"Laura Kirk","id":"nm0456507","role":null}]}]}]},{"award":"Slamdance Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Jury Prize","categories":[{"category":"Best Narrative Feature","names":[{"name":"Blake Robbins","id":"nm1083077","role":null}]}]}]}],"votes":"209","type":"Movie","companyCreditsSimple":[{"idCompany":"co0206993","name":"Vitamin A Films"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:25:54"}}