{"data":{"movies":[{"title":"The Love Punch","originalTitle":"","year":"2013","releaseDate":"20140523","directors":[{"name":"Joel Hopkins","id":"nm0394199"}],"writers":[{"name":"Joel Hopkins","id":"nm0394199"},{"name":"Tess Morris","id":"nm2208729"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjAyOTMxMV5BMl5BanBnXkFtZTgwMTM5NDc3MTE@._V1.jpg","countries":["France","UK"],"languages":["English","French"],"genres":["Comedy"],"plot":"Richard and Kate are a divorced couple who have an amicable relationship. Richard who's about to retire learns that his company's assets have been frozen because it's under investigation and that includes the pension fund. When the owner goes out of the country, Richard decides to pursue him and Kate goes with him. When they learn the man doesn't care about the employees, they decide to get the money some other way; by stealing the diamond he gave his girlfriend. So they follow them and Kate gets close to the girlfriend.","simplePlot":"A divorced couple scheme to recover the retirement money that was stolen from them.","actors":[{"actorName":"Emma Thompson","urlProfile":"http://www.imdb.com/name/nm0000668","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTAyOTg0MF5BMl5BanBnXkFtZTcwNTg0MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1959","placeOfBirth":" Paddington, London, England, UK","height":"5' 8\" (1.73 m)","bio":"Emma Thompson was born in London on April 15, 1959, into a family of actors - her father was Eric Thompson, who has passed away, and her mother, Phyllida Law, has co-starred with Thompson in several films (her sister, Sophie Thompson, is an actor as well). Her father was English-born and her mother is Scottish-born. Thompson's wit was cultivated by a cheerful, clever, creative family atmosphere, and she was a popular and successful student. She attended Cambridge University, studying English Literature, and was part of the university's Footlights Group, the famous group where, previously, many of the Monty Python members had first met. Thompson graduated in 1980 and embarked on her career in entertainment, beginning with stints on BBC radio and touring with comedy shows. She soon got her first major break in television, on the comedy skit program Alfresco (1983), writing and performing along with her fellow Footlights Group alums Stephen Fry and Hugh Laurie. She also worked on other TV comedy review programs in the mid-1980s, occasionally with some of her fellow Footlights alums, and often with actor Robbie Coltrane. Thompson found herself collaborating again with Fry in 1985, this time in his stage adaptation of the play \"Me and My Girl\" in London's West End, in which she had a leading role, playing Sally Smith. The show was a success and she received favorable reviews, and the strength of her performance led to her casting as the lead in the BBC television miniseries Fortunes of War (1987), in which Thompson and her co-star, Kenneth Branagh, play an English ex-patriate couple living in Eastern Europe as the Second World War erupts. Thompson won a BAFTA award for her work on the program. She married Branagh in 1989, continued to work with him professionally, and formed a production company with him. In the late 80s and early 90s, she starred in a string of well-received and successful television and film productions, most notably her lead role in the Merchant-Ivory production of Howards End (1992), which confirmed her ability to carry a movie on both sides of the Atlantic and appropriately showered her with trans-Atlantic honors - both an Oscar and a BAFTA award. Since then, Thompson has continued to move effortlessly between the art film world and mainstream Hollywood, though even her Hollywood roles tend to be in more up-market productions. She continues to work on television as well, but is generally very selective about which roles she takes. She writes for the screen as well, such as the screenplay for Ang Lee's Sense and Sensibility (1995), in which she also starred as Elinor Dashwood, and the teleplay adaptation of Margaret Edson's acclaimed play Wit (2001), in which she also starred. Thompson is known for her sophisticated, skillful, though her critics say somewhat mannered, performances, and of course for her arch wit, which she is unafraid to point at herself - she is a fearless self-satirist. Thompson and Branagh divorced in 1994, and Thompson is now married to fellow actor Greg Wise, who had played Willoughby in Ang Lee's Sense and Sensibility (1995). Thompson and Wise have one child, Gaia, born in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTAyOTg0MF5BMl5BanBnXkFtZTcwNTg0MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000668","name":"Emma Thompson","idIMDB":"nm0000668"},"actorId":"nm0000668","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pierce Brosnan","urlProfile":"http://www.imdb.com/name/nm0000112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMjMxNzM4OV5BMl5BanBnXkFtZTcwNDM5NzkxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1953","placeOfBirth":" Drogheda, County Louth, Ireland","birthName":"Pierce Brendan Brosnan","height":"6' 2\" (1.88 m)","bio":"Pierce Brendan Brosnan was born in Drogheda, County Louth, Ireland, to May (Smith), a nurse, and Thomas Brosnan, a carpenter. He lived in Navan, County Meath, until he moved to England, UK, at an early age (thus explaining his ability to play men from both backgrounds convincingly). His father left the household when Pierce was a child and although reunited later in life, the two have never had a close relationship. His most popular role is that of British secret agent James Bond. The death, in 1991, of Cassandra Harris, his wife of eleven years, left him with three children - Christopher and Charlotte from Cassandra's first marriage and Sean from their marriage. Since her death, he has had two children with his second wife, Keely Shaye Brosnan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMjMxNzM4OV5BMl5BanBnXkFtZTcwNDM5NzkxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000112","name":"Pierce Brosnan","idIMDB":"nm0000112"},"actorId":"nm0000112","character":"Richard","urlCharacter":"http://www.imdb.com/character/ch0446557","main":true},{"actorName":"Celia Imrie","urlProfile":"http://www.imdb.com/name/nm0408309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1952","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"Celia Diana Savile Imrie","height":"5' 5½\" (1.66 m)","bio":"Celia Diana Savile Imrie is an English actress. She is known for her appearances with Victoria Wood; including Claire in Pat and Margaret (1994), Philippa Moorcroft in Dinnerladies (1998-2000) and playing various characters in the sketch show Victoria Wood As Seen On TV (1985-87), including Miss Babs in the spoof soap opera sketches Acorn Antiques. She reprised the role of Miss Babs in Acorn Antiques: The Musical! in 2005, and won the Olivier Award for Best Supporting Performance in a Musical. Imrie's other television roles include Marianne Bellshade in Bergerac (1983), Diana Neal in After You've Gone (2007-08), Gloria Millington in Kingdom (2007-09), and Miss Kizlet in the 2013 Doctor Who season opener The Bells of Saint John. Her film appearances include Highlander (1986), Hilary and Jackie (1998), Bridget Jones's Diary (2001), Calendar Girls (2003), Bridget Jones: The Edge of Reason (2004), Imagine Me & You (2005), The Best Exotic Marigold Hotel (2012) and The Second Best Exotic Marigold Hotel (2015). She has been described as \"one of the most successful British actresses of recent decades\". Imrie was born in 1952 in Guildford, Surrey, the fourth of five children of Diana Elizabeth Blois (née Cator) and David Andrew Imrie, a radiologist. Her father was from Glasgow, Scotland. Imrie was educated at Guildford High School, an independent school for girls in her hometown of Guildford, followed by the Guildford School of Acting. Imrie's varied career spans films, television and radio drama, and the theatre. Her film credits include Nanny McPhee, Hilary and Jackie (playing Iris du Pré) and the 1997 film of The Borrowers where she played Homily Clock. Other films include Bridget Jones's Diary, Calendar Girls, Highlander and, as Fighter Pilot Bravo 5, in Star Wars: Episode I - The Phantom Menace. In 2004, Imrie played Doctor Imogen Reed in the schoolgirl thriller, Out of Bounds. In 2007 Imrie appeared in St Trinian's. Television series to feature Imrie include The Nightmare Man, Oranges Are Not the Only Fruit, Casualty, Absolutely Fabulous, \"Bergerac\",The Darling Buds of May and Upstairs, Downstairs. In the 2000 miniseries of Gormenghast, she played Lady Gertrude. She also had a guest appearance in an episode of the BBC Scotland sitcom Still Game in 2003, where she played a home help called Mrs Begg. She also appeared in the 2005 BBC television drama Mr. Harvey Lights a Candle, playing the part of a teacher taking an unruly party of pupils on a day-trip to Salisbury Cathedral. She starred in the BBC sitcom, After You've Gone, alongside Nicholas Lyndhurst and in the ITV1 drama Kingdom, with Stephen Fry. Her part in After You've Gone has, whilst being critically acclaimed, been described as \"criminally squandered\". In 2013 she guest starred in the BBC's Doctor Who where she played the villainous Miss Kizlet in the series opener The Bells of Saint John. Her radio work includes parts in BBC Radio 4's No Commitments, Adventures of a Black Bag, and Bleak Expectations. In early 2007, she narrated the book Arabella, broadcast over two weeks as the Book at Bedtime. In May 2016, she made her US television debut in the DC action-adventure series Legends of Tomorrow. Imrie is perhaps best known for her frequent collaborations with Victoria Wood, with whom she has appeared in TV programmes such as the sitcom Dinnerladies and sketch show Victoria Wood As Seen On TV. It was on the latter show in 1985 that she first played the infamous part of Miss Babs, owner of Acorn Antiques, a parody of the low budget British soap opera Crossroads. These sketches became such a British institution that the show was turned into a West End musical in 2005 starring most of the original cast (see the picture on the right). Imrie won an Olivier Award for her performance. The character has curly blonde hair, and is known for her frequent parodic flirtations with the customers, and her abuse of the housekeeper Mrs Overall (portrayed by Julie Walters). Imrie was the guest on Desert Island Discs on BBC Radio 4 on 13 February 2011. On 18 October 2013 she was awarded an honorary doctorate by the University of Winchester.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY2ODkzOTE2NF5BMl5BanBnXkFtZTgwNDAwODA2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408309","name":"Celia Imrie","nicknames":["Impie","Ceals","Celia Impie"],"idIMDB":"nm0408309"},"actorId":"nm0408309","character":"Pen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Timothy Spall","urlProfile":"http://www.imdb.com/name/nm0001758","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzE2NzAxOF5BMl5BanBnXkFtZTYwNzIzODY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1957","placeOfBirth":" Battersea, London, England, UK","birthName":"Timothy Leonard Spall","height":"5' 8\" (1.73 m)","bio":"Timothy Leonard Spall was born in Battersea, London, to Sylvia R. (Leonard), a hairdresser, and Joseph L. Spall, a postal worker. He was raised in London. Spall auditioned and earned a spot with the National Youth Theatre and later showed great promise at RADA where he portrayed the title roles in \"Macbeth\" and \"Othello.\" In 1979 he joined the Royal Shakespeare Company and stayed for approximately two years performing in \"The Merry Wives of Windsor,\" \"Cymbeline,\" \"The Three Sisters\" and \"Nicholas Nickleby.\" In the early 80s he moved into TV roles with Leigh's \"Home Sweet Home\" and later had his own drama series \"Frank Stubbs Promotes\" in 1993. With Leigh, Timothy's appeared in a number of award-winning features, particularly Life Is Sweet (1990) and Secrets & Lies (1996), for which he earned a BAFTA Award nomination, and the Gilbert & Sullivan biopic Topsy-Turvy (1999). He also worked for noted directors Ken Russell in Gothic (1986), Clint Eastwood in White Hunter Black Heart (1990), Bernardo Bertolucci in The Sheltering Sky (1990), and Kenneth Branagh in Hamlet (1996) as Rosenkrantz. A chronic illness curtailed his momentum in the mid-90s, coming back resourcefully on stage and TV. On a roll recently with more of his odd characterizations he lent his voice to the popular animated feature Chicken Run (2000) and appeared in Harry Potter and the Prisoner of Azkaban (2004) as Peter Pettigrew, and A Series of Unfortunate Events (2004) as Mr. Poe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzE2NzAxOF5BMl5BanBnXkFtZTYwNzIzODY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001758","name":"Timothy Spall","idIMDB":"nm0001758"},"actorId":"nm0001758","character":"Jerry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louise Bourgoin","urlProfile":"http://www.imdb.com/name/nm2864046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzEyOTM1MV5BMl5BanBnXkFtZTcwNjI5ODQzMg@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1981","placeOfBirth":" Vannes, Morbihan, France","birthName":"Ariane Bourgoin","height":"5' 11\" (1.8 m)","bio":"Louise Bourgoin was born on November 28, 1981 in Vannes, Morbihan, France as Ariane Bourgoin. She is an actress, known for Le grand journal de Canal+ (2004), Les aventures extraordinaires d'Adèle Blanc-Sec (2010) and Un heureux événement (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzEyOTM1MV5BMl5BanBnXkFtZTcwNjI5ODQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2864046","name":"Louise Bourgoin","idIMDB":"nm2864046"},"actorId":"nm2864046","character":"Manon Fontaine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laurent Lafitte","urlProfile":"http://www.imdb.com/name/nm0480850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA5OTA2NDE1NV5BMl5BanBnXkFtZTgwMjU2NzQ1MDI@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1973","placeOfBirth":" Paris, France","height":"6' 2½\" (1.89 m)","bio":"Laurent Lafitte was born on August 22, 1973 in Paris, France. He is an actor and writer, known for Elle (2016), The Crimson Rivers (2000) and Les petits mouchoirs (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA5OTA2NDE1NV5BMl5BanBnXkFtZTgwMjU2NzQ1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0480850","name":"Laurent Lafitte","idIMDB":"nm0480850"},"actorId":"nm0480850","character":"Vincent Kruger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marisa Berenson","urlProfile":"http://www.imdb.com/name/nm0001943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM1NzY4ODMzNF5BMl5BanBnXkFtZTcwMTQwMjY5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1947","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"Marisa Berenson was born on February 15, 1947 in New York City, New York, USA. She is an actress, known for Barry Lyndon (1975), Cabaret (1972) and Death in Venice (1971). She was previously married to Aaron Richard Golub and Jim Randall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM1NzY4ODMzNF5BMl5BanBnXkFtZTcwMTQwMjY5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001943","name":"Marisa Berenson","idIMDB":"nm0001943"},"actorId":"nm0001943","character":"Clothilde","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivier Chantreau","urlProfile":"http://www.imdb.com/name/nm3495330","urlPhoto":"","biography":{"bio":"Olivier Chantreau is an actor, known for Coeur océan (2006), The Love Punch (2013) and Les Lyonnais (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3495330","name":"Olivier Chantreau","idIMDB":"nm3495330"},"actorId":"nm3495330","character":"Jean-Baptiste Durain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ellen Thomas","urlProfile":"http://www.imdb.com/name/nm0858794","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2M2MzQxOGYtYTVmYy00Y2I4LThhZDQtZjkyNWIzNTM0NTk1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1964","placeOfBirth":" Sierra Leone","birthName":"Ellen Dorothy Thomas","bio":"Ellen Thomas was born on February 3, 1964 in Sierra Leone as Ellen Dorothy Thomas. She is an actress, known for EastEnders (1985), Basic Instinct 2 (2006) and Johnny English Reborn (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2M2MzQxOGYtYTVmYy00Y2I4LThhZDQtZjkyNWIzNTM0NTk1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0858794","name":"Ellen Thomas","idIMDB":"nm0858794"},"actorId":"nm0858794","character":"Doreen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tuppence Middleton","urlProfile":"http://www.imdb.com/name/nm3095562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcyNTI1NDA4MV5BMl5BanBnXkFtZTgwNDE2NTA4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1987","placeOfBirth":" Bristol, England, UK","height":"5' 7\" (1.7 m)","bio":"Tuppence Middleton was born on February 21, 1987 in Bristol, England. She is an actress, known for The Imitation Game (2014), Jupiter Ascending (2015) and Trance (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcyNTI1NDA4MV5BMl5BanBnXkFtZTgwNDE2NTA4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3095562","name":"Tuppence Middleton","nicknames":["Tupps"],"idIMDB":"nm3095562"},"actorId":"nm3095562","character":"Sophie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Wilkinson","urlProfile":"http://www.imdb.com/name/nm5117497","urlPhoto":"","biography":{"birthName":"Christopher Daniel Wilkinson","height":"5' 7¾\" (1.72 m)","bio":"Jack Wilkinson was born as Christopher Daniel Wilkinson. He is an actor, known for The Love Punch (2013), Marvellous (2014) and Kettled (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5117497","name":"Jack Wilkinson","idIMDB":"nm5117497"},"actorId":"nm5117497","character":"Matt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Byron","urlProfile":"http://www.imdb.com/name/nm5162227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNTYyMTE4Nl5BMl5BanBnXkFtZTgwMzYzODk0MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Adam Byron is an actor, known for The Love Punch (2013), Doctors (2000) and Peep Show (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNTYyMTE4Nl5BMl5BanBnXkFtZTgwMzYzODk0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5162227","name":"Adam Byron","idIMDB":"nm5162227"},"actorId":"nm5162227","character":"Tyler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Ramm","urlProfile":"http://www.imdb.com/name/nm0708436","urlPhoto":"","biography":{"bio":"John Ramm is an actor and writer, known for Shakespeare in Love (1998), The Love Punch (2013) and The Nine Lives of Tomas Katz (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0708436","name":"John Ramm","idIMDB":"nm0708436"},"actorId":"nm0708436","character":"Ken","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean-Louis Barcelona","urlProfile":"http://www.imdb.com/name/nm2061168","urlPhoto":"","biography":{"dateOfBirth":"1 January 1975","placeOfBirth":" Mazamet, Tarn, France","bio":"Jean-Louis Barcelona was born on January 1, 1975 in Mazamet, Tarn, France. He is an actor, known for Taxi 4 (2007), The Love Punch (2013) and Les aventures extraordinaires d'Adèle Blanc-Sec (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2061168","name":"Jean-Louis Barcelona","idIMDB":"nm2061168"},"actorId":"nm2061168","character":"Minion","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eleanor Matsuura","urlProfile":"http://www.imdb.com/name/nm1915282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzQ0MjYyMF5BMl5BanBnXkFtZTgwNTY1MDI2MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Eleanor Matsuura is an actress, known for Breaking and Entering (2006), Alan Partridge (2013) and The Lady in the Van (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzQ0MjYyMF5BMl5BanBnXkFtZTgwNTY1MDI2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1915282","name":"Eleanor Matsuura","idIMDB":"nm1915282"},"actorId":"nm1915282","character":"Michaela","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2234261","urlIMDB":"http://www.imdb.com/title/tt2234261","business":{"budget":null,"openingWeekend":[{"money":"$26,420","country":"USA","day":"01","month":"06","year":"2014","remarks":"40 Screens"},{"money":"$26,420","country":"USA","day":"30","month":"05","year":"2014","remarks":"40 Screens"},{"money":"HUF 8,167,960","country":"Hungary","day":"27","month":"04","year":"2014","remarks":"30 Screens"}],"gross":[{"money":"$303,586","country":"USA","day":"22","month":"06","year":"2014","remarks":""}],"weekendGross":[{"money":"$4,302","country":"USA","day":"22","month":"06","year":"2014","remarks":"5 Screens"},{"money":"$22,950","country":"UK","day":"18","month":"05","year":"2014","remarks":"68 Screens"},{"money":"$106,906","country":"UK","day":"11","month":"05","year":"2014","remarks":"194 Screens"},{"money":"$246,047","country":"UK","day":"04","month":"05","year":"2014","remarks":"290 Screens"},{"money":"$581,352","country":"UK","day":"27","month":"04","year":"2014","remarks":"374 Screens"},{"money":"$1,030,184","country":"UK","day":"20","month":"04","year":"2014","remarks":"371 Screens"},{"money":"$1,030,184","country":"UK","day":"18","month":"04","year":"2014","remarks":"371 Screens"}],"admissions":[{"money":"19,195","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"11","month":"06","year":"2012","remarks":null},{"money":null,"country":null,"day":"01","month":"08","year":"2012","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus, Hawk V-Lite 1.3x, V-Plus 1.3x and Angenieux Optimo Lenses"],"laboratory":["Arane Gulliver, Paris, France"],"filmLength":null,"negativeFormat":["SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Hawk Scope (anamorphic) (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"5.7","metascore":"44","filmingLocations":[{"location":"Coye-la-Forêt, Oise, France"}],"rated":"PG-13","awards":[{"award":"AARP Movies for Grownups Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Movies for Grownups Award","categories":[{"category":"Best Grownup Love Story","names":[{"name":"Emma Thompson","id":"nm0000668","role":null},{"name":"Pierce Brosnan","id":"nm0000112","role":null}]}]}]}],"votes":"9,791","type":"Movie","companyCreditsSimple":[{"idCompany":"co0210895","name":"Process Media"},{"idCompany":"co0427968","name":"Love Punch"},{"idCompany":"co0163472","name":"Radar Films"}],"keywords":{"keywords":["divorced couple","diamond","pension fund","caper","middle aged couple","wedding","online dating","metal detector","chateau","gate crashing","disguise","cat","allergy","diamond theft","abduction","heist"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:24:20"}}