{"data":{"movies":[{"title":"The Book of Life","originalTitle":"","year":"2014","releaseDate":"20141017","directors":[{"name":"Jorge R. Gutiérrez","id":"nm1509613"}],"writers":[{"name":"Jorge R. Gutiérrez","id":"nm1509613"},{"name":"Douglas Langdale","id":"nm0486007"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTgzNDYzOF5BMl5BanBnXkFtZTgwOTgxMTkyMjE@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Animation","Adventure","Comedy","Family","Fantasy","Romance"],"plot":"From producer Guillermo del Toro and director Jorge Gutierrez comes an animated comedy with a unique visual style. THE BOOK OF LIFE is the journey of Manolo, a young man who is torn between fulfilling the expectations of his family and following his heart. Before choosing which path to follow, he embarks on an incredible adventure that spans three fantastical worlds where he must face his greatest fears. Rich with a fresh take on pop music favorites, THE BOOK OF LIFE encourages us to celebrate the past while looking forward to the future.","simplePlot":"Manolo, a young man who is torn between fulfilling the expectations of his family and following his heart, embarks on an adventure that spans three fantastic worlds where he must face his greatest fears.","actors":[{"actorName":"Diego Luna","urlProfile":"http://www.imdb.com/name/nm0526019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0MjI2NDczMl5BMl5BanBnXkFtZTcwMTgwMDgyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1979","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Diego Luna Alexander","height":"5' 10\" (1.78 m)","bio":"Diego Luna Alexander was born on December 29, 1979 in Mexico City, Mexico, to Alejandro Luna and Fiona Alexander, who worked as a costume designer. His father is Mexican and his mother was British, of Scottish and English descent. His mother died when Diego was only two, in a car accident. He soon became immersed in his father's passion, entertainment - he is the most acclaimed living theatre, cinema and opera set designer in Mexico. From an early age he began acting working in tv, movies, and theater. His first television role was in the movie The Last New Year (1991). His next role in the Mexican soap opera El abuelo y yo (1992). His childhood best friend and fellow actor Gael Garcia Bernal played the title role. After 'El Abuelo y Yo', Diego began to receive more and more parts in theater, movies and TV. His big break came in 2001 when he was cast in the critically acclaimed Y Tu Mamá También (2001), once again alongside his best friend Gael Garcia Bernal, as Tenoch Iturbide. His star continues to shine and he is making a name for himself in the American market such as starring alongside Bon Jovi in Vampires: Los Muertos (2002) and the Oscar winning Frida (2002). He has just wrapped 'Havana Nights: Dirty Dancing 2', the prequel to 'Dirty Dancing' and is working on more projects in both Latin America and the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0MjI2NDczMl5BMl5BanBnXkFtZTcwMTgwMDgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0526019","name":"Diego Luna","idIMDB":"nm0526019"},"actorId":"nm0526019","character":"Manolo","urlCharacter":"http://www.imdb.com/character/ch0440244","main":true},{"actorName":"Zoe Saldana","urlProfile":"http://www.imdb.com/name/nm0757855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk1NTA1OV5BMl5BanBnXkFtZTcwMTIzMjQ4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1978","placeOfBirth":" Passaic, New Jersey, USA","birthName":"Zoë Yadira Saldaña Nazario","height":"5' 6½\" (1.69 m)","bio":"Zoe Saldana was born on June 19, 1978 in Passaic, New Jersey, to Asalia Nazario and Aridio Saldaña. Her father was Dominican and her mother is Puerto Rican. She was raised in Queens, New York. When she was 10 years old, she and her family moved to the Dominican Republic where they would live for the next seven years. While living in the Dominican Republic, Zoe discovered a keen interest in performance dance and began her training at the prestigious ECOS Espacio de Danza Dance Academy where she learned ballet as well as other dance forms. Not only did her training provide an excellent outlet for the enthusiastic and energetic youngster, it would also prove to be a fortunate precursor for the start of her professional acting career. At age 17, Zoe and her family moved back to the United States where her love for dance followed and an interest in theater performance became stronger. She began performing with the Faces theater troupe which put on plays geared to provide positive messages for teens with themes dealing with issues such as substance abuse and sex. These performances not only gave her valuable experience but also a source of great pride knowing that she was making a difference in the lives of young people like herself. While performing with the Faces troupe and also the New York Youth Theater, Zoe was recruited for a talent agency and her dance training years before coupled with her acting experience greatly helped her land her first big screen role as Eva Rodriguez, the talented and headstrong ballet dancer in the film Center Stage (2000). Since her professional career began several years ago, Zoe's talent and determination has allowed her to be involved in blockbuster films and act with major actors, actresses and industry insiders at a pace that very few young professionals have experienced. Zoe has not only held her own in major motion picture productions but gained the respect and praise from industry insiders such as Jerry Bruckheimer and Steven Spielberg and actors/actresses such as Tom Hanks, Bernie Mac, Keira Knightley, Ashton Kutcher, Kirsten Dunst and Orlando Bloom. According to many of her co-stars, producers and directors, the sky is no limit for this young star who has incredible range, intense concentration, and a steely determination to be involved with projects that challenge her professionally with wide-ranging subject matters and characters. Just to ask practically anyone who she has worked for or with about her, glowing comments abound and earned friendships and respect are readily revealed. A star has been born, and growing every day.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk1NTA1OV5BMl5BanBnXkFtZTcwMTIzMjQ4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0757855","name":"Zoe Saldana","idIMDB":"nm0757855"},"actorId":"nm0757855","character":"Maria","urlCharacter":"http://www.imdb.com/character/ch0423675","main":true},{"actorName":"Channing Tatum","urlProfile":"http://www.imdb.com/name/nm1475594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTI3Mzg2Nl5BMl5BanBnXkFtZTcwMDAxNTU3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1980","placeOfBirth":" Cullman, Alabama, USA","birthName":"Channing Matthew Tatum","height":"6' 1\" (1.85 m)","bio":"Channing Tatum was born in a small town, Cullman, Alabama, 50 miles north of Birmingham. He is the son of Kay (Faust), an airline worker, and Glenn Matthew Tatum, who worked in construction. Growing up, he was full of energy and somewhat troublesome, so his parents decided to enroll him in different sports such as track and field, baseball, soccer, and football to keep him out of trouble. In the ninth grade he was sent to Catholic school. It was there that he discovered his passion for football and his hopes became centered on earning an athletic college scholarship. Channing's goal was finally met, and in his senior year in high school, he was recruited and earned a full athletic college scholarship to a school in West Virginia. Tatum is also skilled in Kung Fu and in Gor-Chor Kung Fu, a form of martial arts, in which he has earned belts. Channing later left college and, in the meantime, worked as a construction worker, a stripper, a mortgage broker and salesman. He has modeled for Abercrombie & Fitch, Nautica, Gap, Aeropostale, Emporio Armani, and has been featured in television commercials for American Eagle, Pepsi, and some very popular Mountain Dew commercials. Channing can be seen on the big screen as a featured actor in Coach Carter (2005), in which he plays a high school basketball player. He was also in the very popular TV series CSI: Miami (2002) where he played the role of Bob Davenport.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTI3Mzg2Nl5BMl5BanBnXkFtZTcwMDAxNTU3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1475594","name":"Channing Tatum","nicknames":["Chan"],"idIMDB":"nm1475594"},"actorId":"nm1475594","character":"Joaquin","urlCharacter":"http://www.imdb.com/character/ch0423674","main":true},{"actorName":"Ron Perlman","urlProfile":"http://www.imdb.com/name/nm0000579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1950","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Francis Perlman","height":"6' 1\" (1.85 m)","bio":"Ron Perlman is a classically-trained actor who has appeared in countless stage plays, feature films and television productions. Ronald N. Perlman was born April 13, 1950 in Washington Heights, Manhattan, New York. His mother, Dorothy (Rosen), is retired from the City Clerk's Office. His father, Bertram \"Bert\" Perlman, now deceased, was a repairman and a drummer. His parents were both from Jewish families (from Hungary, Germany and Poland). With a career spanning over three decades, Perlman has worked alongside such diverse actors as Marlon Brando, Sean Connery, Dominique Pinon, Brad Dourif, Ed Harris, John Hurt, Jude Law, Christina Ricci, Federico Luppi, Sigourney Weaver, Michael Wincott and Elijah Wood to name a few. While he has never been a bankable star, Perlman has always had a large fanbase. He started out strong as Amoukar, one of the tribesmen in Jean-Jacques Annaud's Academy Award-winning film Quest for Fire (1981), for which he earned a Genie Award nomination. Perlman teamed up with Annaud again, this time as a hunchback named Salvatore in The Name of the Rose (1986). His first real breakthrough came later when he landed the role of the noble lion-man Vincent, opposite Linda Hamilton on the fantasy series Beauty and the Beast (1987). His work in this role earned him not only a Golden Globe Award but an underground fan following. Sadly the series was cancelled in its third season shortly after Hamilton's character's death. After that, he spent time doing supporting work on television and independent films such as Guillermo del Toro's debut Cronos (1993) (where a lifelong friendship and collaboration between the director and Perlman would blossom) as Angel and his first lead role as One in Jean-Pierre Jeunet's surreal The City of Lost Children (1995). His first real big role in a mainstream film came when Jeunet wanted him for the brutish Johner in his first Hollywood outing Alien: Resurrection (1997). Perlman has also used his distinctive voice to his advantage, appearing in many animated films/series, commercials and he is a video game fan favorite because of his work on such games as the Fallout series. It was not until much later he received worldwide fame when his good friend Guillermo del Toro helped him land the title role in the big-budget comic book movie Hellboy (2004). Del Toro fought the studio for four years because they wanted a more secure name, but he stood his ground and in 2004, after almost 25 years in and out of obscurity, Perlman became and household name and a sought out actor. Perlman has had one of the most offbeat careers in film, playing everything from a prehistoric ape-man to an aging transsexual and will always be a rarity in Hollywood. Other notable roles include the cunning Norman Arbuthnot in The Last Supper (1995), sniper expert Koulikov in Enemy at the Gates (2001), vampire leader Reinhardt in Blade II (2002), his reprisal of Hellboy in Hellboy II: The Golden Army (2008) and biker chief Clarence Morrow on the popular series Sons of Anarchy (2008). He currently resides in Los Angeles, California with his wife, Opal, and their two children, Blake and Brandon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000579","name":"Ron Perlman","idIMDB":"nm0000579"},"actorId":"nm0000579","character":"Xibalba","urlCharacter":"http://www.imdb.com/character/ch0423676","main":true},{"actorName":"Christina Applegate","urlProfile":"http://www.imdb.com/name/nm0000775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDc2OTE2Nl5BMl5BanBnXkFtZTcwMTc4NDcxNg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1971","placeOfBirth":" Hollywood, Los Angeles, California, USA","height":"5' 5\" (1.65 m)","bio":"Christina Applegate was born in Hollywood, Los Angeles, California, to record producer/executive Robert William Applegate and singer-actress Nancy Priddy. Her parents split-up shortly after her birth. She has two half-siblings from her father's re-marriage - Alisa (b. 10 October 1977) & Kyle (b. 15 July 1981). Alisa and Christina are best friends and even lived together while Alisa was going to college. Christina's mother took her along on all of her auditions and acting jobs. She made her acting debut at age five months, when her mother got her in a commercial for Playtex nursers. Her mother never remarried, but kept company with Stephen Stills. Christina still cherishes a guitar Stephen gave her when she was young. She played in a number of TV series before landing her breakout role in Married with Children (1987). Christina still studies jazz dance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDc2OTE2Nl5BMl5BanBnXkFtZTcwMTc4NDcxNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000775","name":"Christina Applegate","idIMDB":"nm0000775"},"actorId":"nm0000775","character":"Mary Beth","urlCharacter":"http://www.imdb.com/character/ch0423677","main":true},{"actorName":"Ice Cube","urlProfile":"http://www.imdb.com/name/nm0001084","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTE0NDQwMV5BMl5BanBnXkFtZTcwMDA1NjA1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1969","placeOfBirth":" Los Angeles, California, USA","birthName":"O'Shea Jackson","height":"5' 8\" (1.73 m)","bio":"Ice Cube was born in South Central Los Angeles, to Doris (Benjamin), a custodian and hospital clerk, and Hosea Jackson, a UCLA groundskeeper. He first came to public notice as a singer and songwriter with the controversial and influential band N.W.A. His compositions with that group included many of the classic cuts from their debut LP \"Straight Outta Compton\" (Ruthless/Priority, 1989), including the title track, \"Gangsta Gangsta\" and \"Express Yourself\". He quit the band over business differences in 1990 and began a still-growing series of commercially and critically acclaimed solo albums, starting with \"AmeriKKKa's Most Wanted\" (Priority, 1990). His second solo album, \"Death Certificate\" (Priority, 1991), a concept album about the fall and rise of the Black man, sold two million copies, and his subsequent solo output (six albums to date total) has sold over ten million copies. He has also discovered Yoyo, Del, K-Dee and Mack 10. He has also produced, written, toured and recorded with Public Enemy, The Red Hot Chili Peppers, George Clinton, The D.O.C., Michel'e, Big Daddy Kane, WC & The Madd Circle (which spawned the solo career of Coolio), former N.W.A. bandmate Dr. Dre and Cypress Hill. He has also recorded with two post-N.W.A. side-project bands, Da Lench Mob (\"Guerillas In Tha Mist\", Street Knowledge/East-West, 1991) and Westside Connection (\"Bow Down\", Priority, 1996). His movie career has been no less stellar. Ice Cube's debut in Boyz n the Hood (1991) led to more roles in such films as Trespass (1992), Dangerous Ground (1997) and Anaconda (1997). He also appeared as himself in the comedy CB4 (1993). He is also no stranger to the other side of the camera, directing videos for himself as well as Prince and Color Me Badd, as well as co-writing his screenwriting debut, Friday (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTE0NDQwMV5BMl5BanBnXkFtZTcwMDA1NjA1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001084","name":"Ice Cube","nicknames":["Cube"],"idIMDB":"nm0001084"},"actorId":"nm0001084","character":"Candle Maker","urlCharacter":"http://www.imdb.com/character/ch0480817","main":true},{"actorName":"Kate del Castillo","urlProfile":"http://www.imdb.com/name/nm0215487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzODI3MzU2NTReQTJeQWpwZ15BbWU4MDgwMDg0Nzcx._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1972","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Kate del Castillo Negrete Trillo","height":"5' 5\" (1.65 m)","bio":"One of Mexico's most acclaimed and popular actresses, Kate del Castillo broke through in America as a result of her award-winning performance in the hit Fox Searchlight/Weinstein movie Under the Same Moon (2007), which is to date the highest-grossing Spanish-language theatrical release in U.S. history. Kate is starring in the coveted role of \"Queen of the South\" in La Reina del Sur (2011) a short form prime-time telenovela for Telemundo (NBC/Universal) and Antena 3 (Spain.) This adaptation of the bestseller by Spanish novelist Arturo Perez-Reverte. drew more than 8.1 million viewers in its debut week, making it the most successful telenovela premiere week in the web's history. It continues to break records attracting male viewers and non-Spanish speaking viewers. Del Castillo appeared as a guest star in six episodes of the fifth season of the Showtime hit comedy series _Weeds_. She starred as 'Pilar Zuazo,' a powerful Mexican crime boss who threatened Nancy (Mary-Louise Parker) and Esteban's romance then hit with a mallet by Nancy's son. Del Castillo recently starred in Univision.com's first-ever webnovela (which she co-produced), \"Vidas Cruzadas\" (Crossed Lives). The series was a huge success and generated more than two million video streams through September 15, 2009 making it one of the three most-watched online properties ever according to the network. L'Oréal Paris signed del Castillo to an exclusive U.S. contract as a spokesperson for the company and its beauty brands. The advertising was shot in Los Angeles and Paris and is currently appearing in the U.S. and Mexico. The California Ford dealers tapped her as its spokesperson to star in their television and radio ads. The History Channel named her Network Spokesperson for Hispanic Heritage Month in 2007. Kate del Castillo, was appointed Ambassador for the Mexican Commission on Human Rights to combat human trafficking in 2009, and launched the Blue Heart campaign in Mexico City with U.N. Goodwill Ambassador Mira Sorvino in 2010.. She began her acting career as a child, but it wasn't until the enormously successful telenovela \"Muchachitas\" that she became a full-fledged star in Mexico. She went on to become the leading ingénue of nine telenovelas, including \"Ramona\" and \"La Mentira\" taking them to the top of the Nielsen charts every time. Her telenovelas have aired multiple times in more than 100 countries worldwide. Kate received various accolades for her critically acclaimed performance as a Bolivian dancer in American Visa (2005) including \"Best Actress\" awards in film festivals in Spain and Brazil, and a \"Best Actress\" nomination at the Ariel Awards, Mexico's equivalent to the Oscars. In the United States, the movie premiered at the AFI Film Festival in Los Angeles, to a sold-out crowd. She also did a cameo in Bordertown (2006) as Antonio Banderas's long-suffering wife. Kate returned to her theater roots in Mexico for a sold-out eight week theatre run in the two character David Harrower play \"Blackbird\" (\"Pájaro Negro.) She won the \"Best Actress\" award from the Theatre Critics Association in Mexico. Among her many awards, Kate received the \"Outstanding Performance in a Motion Picture\" award for her performances in _Trade_ and Under the Same Moon (2007) by the National Hispanic Media under the umbrella of the National Latino Media Council. In August 2008, she won the Imagen \"Best Actress\" award for \"Under the Same Moon.\" Kate has graced the covers of the top Spanish-language magazines, and was People en Español's 2007 cover Actress of the Year, as well as one of their \"Most Beautiful People.\" On September 13, 2009, Kate served as Grand Marshall in Los Angeles' Mexican Independence Day Parade. Kate was the voice of Sally Carrera in the Spanish version of Pixar/Disney's Cars (2006) and will soon appear in the animated Rio (2011)_ as a bird/wife to George Lopez. She made her crossover debut on television in the U.S. in the Golden Globe-nominated PBS series American Family (2002) alongside Edward James Olmos. She is currently developing a project for television, which she hopes will showcase her love of extreme sports. She published in Mexico her first novel called \"Tuya\" based on her screenplay, and it's now in its third printing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzODI3MzU2NTReQTJeQWpwZ15BbWU4MDgwMDg0Nzcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0215487","name":"Kate del Castillo","idIMDB":"nm0215487"},"actorId":"nm0215487","character":"La Muerte","urlCharacter":"http://www.imdb.com/character/ch0035562","main":true},{"actorName":"Hector Elizondo","urlProfile":"http://www.imdb.com/name/nm0001185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEzMTE4MDFeQTJeQWpwZ15BbWU3MDk3ODU3MTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1936","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Hector Elizondo was born in New York City, New York, where he was raised, on the Upper West Side of Manhattan. He is the son of Carmen Medina Reyes and Martín Echevarría Elizondo. Hector is of Basque and Puerto Rican descent, and \"Elizondo\" means \"at the foot of the church\" in Basque. His lifestyle in his pre-acting days was as diverse as the roles he plays today. He was a conga player with a Latin band, a classical guitarist and singer, a weightlifting coach, a ballet dancer and a manager of a bodybuilding gym. In his teens, he played basketball and baseball and was scouted by the New York Giants and Pittsburgh Pirates farm teams. After a knee injury ended his dance career, he switched to drama. Since then, he has frequently appeared on Broadway, most notably with George C. Scott in Arthur Penn's production of \"Sly Fox\" for which he received a Drama Desk nomination and for his role as \"God\" in \"Steambath\", which won him an Obie Award. Other theatre credits include; \"The Prisoner of Second Avenue\"; \"The Great White Hope\"; \"Dance of Death\" with Robert Shaw and \"The Rose Tattoo\" opposite Cicely Tyson. Countless starring roles in television include: Foley Square (1985); American Playhouse: Medal of Honor Rag (1982); Casablanca (1983) (in which he recreated the Claude Rains role of police chief \"Capt. Renault\"); Freebie and the Bean (1974); Popi (1975) and as Sophia Loren's husband in the CBS special Courage (1986). Guest appearances include: Kojak (1973); Kojak: Ariana (1989); Columbo: A Case of Immunity (1975); Baretta (1975); All in the Family (1971); The Rockford Files (1974) and Bret Maverick (1981). In addition, he also directed a.k.a. Pablo (1984), the first show to utilise seven cameras instead of the usual four. On the big screen, he has been seen in, among others, American Gigolo (1980); The Taking of Pelham One Two Three (1974); Cuba (1979); Valdez Is Coming (1971) and in four films directed by Garry Marshall: Young Doctors in Love (1982); The Flamingo Kid (1984); Nothing in Common (1986) and Overboard (1987). Elizondo starred with Dan Aykroyd and Michelle Pfeiffer in PBS' Great Performances: Tales from the Hollywood Hills: Natica Jackson (1987) (based on a collection of John O'Hara stories) and made his debut as a stage director with a production of \"Villa!\" starring Julio Medina. In addition, he performed in the 50th anniversary production of \"War of the Worlds\" co-starring Jason Robards and the TV-movie Addicted to His Love (1988) with Barry Bostwick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEzMTE4MDFeQTJeQWpwZ15BbWU3MDk3ODU3MTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001185","name":"Hector Elizondo","idIMDB":"nm0001185"},"actorId":"nm0001185","character":"Carlos Sanchez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Trejo","urlProfile":"http://www.imdb.com/name/nm0001803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1944","placeOfBirth":" Echo Park, Los Angeles, California, USA","birthName":"Dan Trejo","height":"5' 5¾\" (1.67 m)","bio":"Danny Trejo was born Dan Trejo in Echo Park, Los Angeles, to Alice (Rivera) and Dan Trejo, a construction worker. A child drug addict and criminal, Trejo was in and out of jail for 11 years. While serving time in San Quentin, he won the lightweight and welterweight boxing titles. Imprisoned for armed robbery and drug offenses, he successfully completed a 12-step rehabilitation program that changed his life. While speaking at a Cocaine Anonymous meeting in 1985, Trejo met a young man who later called him for support. Trejo went to meet him at what turned out to be the set of Runaway Train (1985). Trejo was immediately offered a role as a convict extra, probably because of his tough tattooed appearance. Also on the set was a screenwriter who did time with Trejo in San Quentin. Remembering Trejo's boxing skills, the screenwriter offered him $320 per day to train the actors for a boxing match. Director Andrey Konchalovskiy saw Trejo training Eric Roberts and immediately offered him a featured role as Roberts' opponent in the film. Trejo has subsequently appeared in many other films, usually as a tough criminal or villain. Trejo is of Mexican descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001803","name":"Danny Trejo","nicknames":["The Mayor"],"idIMDB":"nm0001803"},"actorId":"nm0001803","character":"Skeleton Luis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos Alazraqui","urlProfile":"http://www.imdb.com/name/nm0016141","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTk3MzIyOF5BMl5BanBnXkFtZTcwODA0MDk5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1962","placeOfBirth":" Yonkers, New York, USA","birthName":"Carlos Jaime Alazraqui","height":"5' 7\" (1.7 m)","bio":"Carlos Alazraqui was born on July 20, 1962 in Yonkers, New York, USA as Carlos Jaime Alazraqui. He is an actor and writer, known for Happy Feet (2006), Inside Out (2015) and Batman: Arkham City (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTk3MzIyOF5BMl5BanBnXkFtZTcwODA0MDk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0016141","name":"Carlos Alazraqui","idIMDB":"nm0016141"},"actorId":"nm0016141","character":"General Posada / Dali / Chuy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ana de la Reguera","urlProfile":"http://www.imdb.com/name/nm0478886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2ZkZDM1ZGItNmVlZC00NjdiLWFmY2EtNjI5MGQyYTcwNzM2XkEyXkFqcGdeQXVyNzM0OTExMA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1977","placeOfBirth":" Veracruz, Veracruz, Mexico","birthName":"Anabell Gardoqui De La Reguera","height":"5' 3\" (1.6 m)","bio":"Ana de la Reguera grew up in the tropical state of Veracruz, on the Gulf Coast of Mexico. She began her performance arts studies in the Cultural Institute of Veracruz, then left for Televisa's Center for Artistic Education (CEA) and TV Aztecas' artistic institute (CEFAC) in Mexico City, later taking study with Lisa Robertson and Aaron Spicer in Los Angeles and acting coach Juan 'Carlos Corzza in Spain. In theatre she participated in \"El Cartero\" (\"Il Postino\") for which she received two awards: one for \"Best Actress\" from the Association of Theatre Journalists in Mexico and the other for the year's \"Most Promising Actress\" from the Association of Theatre Critics and Journalists. De la Reguera's professional career began with her role in the telenovela Azul (1996), followed by Pueblo chico, infierno grande (1997)--for which she received the Heraldo Award for \"Best Breakout Female Actress\"--and Desencuentro (1997), which was her third telenovela under the direction of the internationally recognized Ernesto Alonso. _\"Tentaciones\" (1998)_ marked her beginning with powerhouse Argos Comunicación. She was immediately offered roles in _\"Destino\" (1998)_ and Todo por amor (2000), for which she received \"The Golden Palm Award.\" After that, it was non-stop work for de la Reguera. In 2002 she starred in Cara o Cruz (2001), which was the first telenovela co-produced by Argos Comunicación and Telemundo, made exclusively for the Hispanic audience living in the US. The following year she played María in the telenovela Por tí (2002) for TV Azteca and the mini-series that followed up on Pedro el escamoso (2001), Como Pedro por su casa (2003), which was a co-production between Colombia's Caracol and Telemundo. Additionally, de la Reguera also had the lead role in the Peruvian soap opera Luciana y Nicolás (2003). De la Reguera's introduction into film began with Dust to Dust (2000), which earned her two nominations: \"El Heraldo de la Revelación Femenina\" (Best New Actress) and \"Eres Mejor Actriz\" (Best Actress). Later she acted in A Beautiful Secret (2002) with Oscar nominee Katy Jurado. In 2003 Ana starred in the highly acclaimed comedy Ladies' Night (2003), alongside Ana Claudia Talancón. The movie became the box-office success of the year and won her three major awards: \"the Latin America MTV's Favorite Actress Award,\" the Mexican movie industry Award for Best Actress of the year, \"CANACINE,\" and the \"Diosa de Plata (Silver Godess) Award\" for Best Supporting Actress (2003). In 2005 she played the starring role in Gitanas (2004), which aired on Telemundo in the US and now has been seen as far away as Ukraine, Spain and Argentina. In 2006 de la Reguera had the lead in the powerful Así del precipicio (2006), which earned her her second \"Diosa de Plata [Silver Goddess] Award\" for best actress. In addition, she also starred in Paraiso Travel (2008), playing the role of Milagros, singing and dancing for the first time in a movie. John Leguizamo and Colombian star Margarita Rosa de Francisco were also in the cast. The film was shown at the Tribeca Film Festival and later released throughout the US and Latin America. That same year Ana received her big break into American cinema when she landed the role of Sister Encarnación in the comedy Super Nacho (2006). The film by Jared Hess--director of Napoleon Dynamite (2004)--and co-starring Jack Black gave her the opportunity to be seen around the world. In 2008 she became the new face for Cover Girl worldwide, alongside celebrities like Drew Barrymore, Queen Latifah, Ellen DeGeneres and Rihanna. From there her career springboarded into many other impressive endorsements, including campaigns with Pantene, Special K and Flip, Macy's, Coca-Cola (Ciel), Pepsi (Be Light) and Caress, among many others. She began 2010 with a worldwide publicity campaign for Lipton Tea alongside actor Hugh Jackman. Most recently, she did an international campaign with Kahlúa benefiting her hometown of Veracruz, Mexico, left demolished after the resent destruction of Huricaine Karl. In the action-thriller film Les Seigneurs du Sud (2007), filmed mainly in Argentina, she plays Monica Silvari, a mean and sophisticated bank robber alongside Spanish actors Jordi Mollà and Tony Dalton. In the spring of 2008 Ana began filming Capadocia (2008), an HBO mega-production TV show about the chaotic and miserable life in a women's prison in Mexico. The show aired with record-breaking ratings in Mexico and Latin America, and was released in the US in the fall of 2008 for HBO OLE. Three of the most recognized directors in Latin America participated in this HBO original production: Epigmenio Ibarra, Jorge Aragón and Luis Peraza. The successful series got three International Emmy nominations for its first season, and this fall marked the opening of \"Capadocia\"'s second season. In 2009 she shot _Di Di Hollywood (2009)_, from famed _Jamón, Jamón (2000)_ director Bigas Luna. That same year she went back to the Mexican theatre for six months where she played \"Desdemona\" in William Shakespeare \"Othello\". The play was hugely successful in Mexico's renowned Juan Ruiz de Alarcón theater, and she was named \"Best Actress\" by the Journalist Theatre Association at the annual Bravo Awards and by the ACTP. Later that year she filmed the extremely moving Mexican film Backyard (2009), in which she played a cop in an outlaw border city controlled by drug traffickers and killers. Directed by Carlos Carrera (El crimen del padre Amaro (2002), nominated for an Oscar for \"Best Foreign Film\"), the picture was chosen to represent Mexico in the 2010 Academy Awards in the Best Foreign Film category, and earned de la Reguera the \"Best Actress Award\" at the Imagen Awards and the CANACINE Awards, and won the \"Silver Plaque\" in the Chicago Film Festival. The beginning of 2010 brought the opening of her Hollywood film Cop Out (2010), co-starring Bruce Willis and Tracy Morgan and directed by Kevin Smith. She played Gabriela, a strong-willed woman with very picante and colorful language, who gets rescued by Willis and Tracy--and gets them in trouble in the process. In that same year brought the release of her film Hidalgo - La historia jamás contada. (2010), about the controversial life of Mexico's independence hero, priest Miguel Hidalgo. She plays Hidalgo's second wife and shares credit with Demián Bichir (Weeds (2005), Che - 1ère partie - L'Argentin (2008)). In the US she also had a recurring role on the USA Network's series Royal Pains (2009), and starred in the critically-acclaimed, Will Farrell-produced HBO comedy Eastbound & Down (2009) co-starring Danny McBride as down-and-out baseball player and love interest Kenny Powers. She also had a role in the Jon Favreau-directed Cowboys & Aliens (2011) starring Harrison Ford, Daniel Craig and Sam Rockwell, produced by Steven Spielberg, Ron Howard and Brian Grazer. The film crosses the classic Western with the alien-invasion movie in its story about a lone cowboy leading an uprising against murderous aliens from outer space. As if her busy acting career isn't enough, de la Reguera is also heavily involved with charity work. Most recently she uploaded a video to YouTube in order to help raise awareness for Veracruz, her home state, affected by heavy rains and a devastating Hurricane Karl. In the video she speaks about a variety fo options for support and help that victims of the Hurrcane can utilize, and offers methods to make donations. The viral campaign went all over Twitter and other online sites, raising much needed money for the victims of the hurricane. She also founded the organization VeracruzANA AC, which is a philanthropic organization whose mission is to raise funds and build a tourist boulevard of Antigua--something that has been promised by political organizations for years. Antigua is one of the most important and historical communities in Veracruz, and also one of the areas the most damaged by the hurricane. This June marked the culmination of her hard work and the grando Opening ceremony for the touristic boulevard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2ZkZDM1ZGItNmVlZC00NjdiLWFmY2EtNjI5MGQyYTcwNzM2XkEyXkFqcGdeQXVyNzM0OTExMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0478886","name":"Ana de la Reguera","idIMDB":"nm0478886"},"actorId":"nm0478886","character":"Skeleton Carmen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emil-Bastien Bouffard","urlProfile":"http://www.imdb.com/name/nm4069076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMDMwMDA5Ml5BMl5BanBnXkFtZTgwNTY1OTI3ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 1\" (1.55 m)","bio":"Emil-Bastien Bouffard is an actor, known for The Book of Life (2014), How Jimmy Got Leverage (2012) and Maxwell (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMDMwMDA5Ml5BMl5BanBnXkFtZTgwNTY1OTI3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4069076","name":"Emil-Bastien Bouffard","idIMDB":"nm4069076"},"actorId":"nm4069076","character":"Young Manolo","urlCharacter":"http://www.imdb.com/character/ch0440244","main":true},{"actorName":"Elijah Rodriguez","urlProfile":"http://www.imdb.com/name/nm6413679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJjZGU4MDMtYmJkYi00YTU1LTkyZmUtZjdmNjFiODViNmE5L2ltYWdlXkEyXkFqcGdeQXVyNDQ4MzI3OTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Elijah Rodriguez is an actor, known for The Book of Life (2014) and Soldado (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJjZGU4MDMtYmJkYi00YTU1LTkyZmUtZjdmNjFiODViNmE5L2ltYWdlXkEyXkFqcGdeQXVyNDQ4MzI3OTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6413679","name":"Elijah Rodriguez","nicknames":["Elijah Rodriguez"],"idIMDB":"nm6413679"},"actorId":"nm6413679","character":"Young Joaquin","urlCharacter":"http://www.imdb.com/character/ch0423674","main":true},{"actorName":"Genesis Ochoa","urlProfile":"http://www.imdb.com/name/nm4874050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2EzZjcxNjktOTIxNy00MDNmLWI0MTMtMGFlODg1NDI2MWJmXkEyXkFqcGdeQXVyMzEwMDAwODc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Genesis Ochoa is an actress, known for The Book of Life (2014), The Shift (2013) and Only Yesterday (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2EzZjcxNjktOTIxNy00MDNmLWI0MTMtMGFlODg1NDI2MWJmXkEyXkFqcGdeQXVyMzEwMDAwODc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4874050","name":"Genesis Ochoa","idIMDB":"nm4874050"},"actorId":"nm4874050","character":"Young Maria","urlCharacter":"http://www.imdb.com/character/ch0423675","main":true},{"actorName":"Plácido Domingo","urlProfile":"http://www.imdb.com/name/nm0004881","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjE3ODcyNF5BMl5BanBnXkFtZTYwNDI4NTk3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1941","placeOfBirth":" Madrid, Spain","birthName":"José Plácido Domingo Embil","height":"6' 2\" (1.88 m)","bio":"Although born in Madrid, Spain, Placido Domingo spent a major portion of his life living in Mexico City where he graduated from the Mexico City Conservatory. His first operatic performance was in a staging of La Traviata in Monterrey playing Alfredo. He was then a Tenor for the Israel National Opera and subsequently moved to Europe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjE3ODcyNF5BMl5BanBnXkFtZTYwNDI4NTk3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004881","name":"Plácido Domingo","nicknames":["Placido Flamingo"],"idIMDB":"nm0004881"},"actorId":"nm0004881","character":"Skeleton Jorge","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2262227","urlIMDB":"http://www.imdb.com/title/tt2262227","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$50,150,619","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$50,123,408","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$50,000,318","country":"USA","day":"25","month":"01","year":"2015","remarks":""}],"weekendGross":[{"money":"$3,190","country":"USA","day":"22","month":"02","year":"2015","remarks":"12 Screens"},{"money":"$37,296","country":"USA","day":"08","month":"02","year":"2015","remarks":"57 Screens"},{"money":"$81,006","country":"USA","day":"25","month":"01","year":"2015","remarks":"90 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["FotoKem Laboratory, Burbank (CA), USA (prints)","Modern VideoFilm, Burbank (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["Digital"],"cinematographicProcess":["Digital 3-D (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema (also 3-D version)"]},"rating":"7.3","metascore":"67","filmingLocations":[],"rated":"PG","awards":[{"award":"Golden Globes, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Animated Feature Film","names":[]}]}]},{"award":"Annie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Annie","categories":[{"category":"Outstanding Achievement in Character Design in an Animated Feature Production","names":[{"name":"Paul Sullivan","id":"nm1467476","role":null},{"name":"Sandra Equihua","id":"nm1216370","role":null},{"name":"Jorge R. Gutiérrez","id":"nm1509613","role":null}]}]},{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Animated Feature","names":[]},{"category":"Outstanding Achievement in Animated Effects in an Animated Production","names":[{"name":"Augusto Schillaci","id":"nm1598721","role":null},{"name":"Erich Turner","id":"nm0877543","role":null},{"name":"Bill Konersman","id":"nm0465011","role":null},{"name":"Chris Rasch","id":"nm4808279","role":null},{"name":"N. Joseph Burnette","id":"nm4688219","role":null}]},{"category":"Outstanding Achievement in Directing in an Animated Feature Production","names":[{"name":"Jorge R. Gutiérrez","id":"nm1509613","role":null}]},{"category":"Outstanding Achievement in Production Design in an Animated Feature Production","names":[{"name":"Simon Valdimir Varela","id":"nm0889646","role":null},{"name":"Paul Sullivan","id":"nm1467476","role":null}]}]}]},{"award":"Behind the Voice Actors Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BTVA Feature Film Voice Acting Award","categories":[{"category":"Best Female Lead Vocal Performance in a Feature Film","names":[{"name":"Zoe Saldana","id":"nm0757855","role":null}]},{"category":"Best Male Vocal Performance in a Feature Film in a Supporting Role","names":[{"name":"Ron Perlman","id":"nm0000579","role":null}]},{"category":"Best Female Vocal Performance in a Feature Film in a Supporting Role","names":[{"name":"Kate del Castillo","id":"nm0215487","role":null}]}]}]},{"award":"Black Reel Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Voice Performance","names":[{"name":"Zoe Saldana","id":"nm0757855","role":null}]}]}]},{"award":"Broadcast Film Critics Association Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Casting Society of America, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Animation Feature","names":[{"name":"Christian Kaplan","id":"nm0438215","role":null}]}]}]},{"award":"Central Ohio Film Critics Association 2015","titlesAwards":[{"titleAwardOutcome":"Nominated COFCA Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Georgia Film Critics Association (GFCA) 2015","titlesAwards":[{"titleAwardOutcome":"Nominated GFCA Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Golden Schmoes Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Animated Movie of the Year","names":[]}]}]},{"award":"Guild of Music Supervisors Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated GMS Award","categories":[{"category":"Best Music Supervision for Films Budgeted Over 25 Million Dollars","names":[{"name":"John Houlihan","id":"nm0396545","role":null}]}]}]},{"award":"Hollywood Music In Media Awards (HMMA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated HMMA Award","categories":[{"category":"Best Original Score - Animated Film","names":[{"name":"Gustavo Santaolalla","id":"nm0763395","role":null}]},{"category":"Outstanding Music Supervision - Film","names":[{"name":"John Houlihan","id":"nm0396545","role":null}]}]}]},{"award":"Houston Film Critics Society Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Image Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Character Voice-Over Performance","names":[{"name":"Zoe Saldana","id":"nm0757855","role":null}]}]}]},{"award":"Imagen Foundation Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Imagen Award","categories":[{"category":"Best Actress - Feature Film","names":[{"name":"Zoe Saldana","id":"nm0757855","role":null}]}]},{"titleAwardOutcome":"Nominated Imagen Award","categories":[{"category":"Best Supporting Actress - Feature Film","names":[{"name":"Kate del Castillo","id":"nm0215487","role":null}]},{"category":"Best Picture","names":[]},{"category":"Best Actor - Feature Film","names":[{"name":"Diego Luna","id":"nm0526019","role":null}]}]}]},{"award":"International 3D & Advanced Imaging Society's Creative Arts Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Creative Arts Award","categories":[{"category":"3D Feature - Animated","names":[]}]}]},{"award":"Motion Picture Sound Editors, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Animated Feature","names":[{"name":"Scott Martin Gershin","id":"nm0314832","role":"supervising sound editor, sound designer"},{"name":"Stephen P. Robinson","id":"nm0004595","role":"sound designer"},{"name":"Margit Pfeiffer","id":"nm0679428","role":"supervising dialogue editor, supervising adr editor"},{"name":"Dan O'Connell","id":"nm0640006","role":"foley artist"},{"name":"John T. Cucci","id":"nm0190961","role":"foley artist"},{"name":"Tim Walston","id":"nm0909949","role":"sound effects editor"},{"name":"Scott Wolf","id":"nm0937931","role":"sound effects editor"},{"name":"Masanobu 'Tomi' Tomita","id":"nm0866732","role":"sound effects editor"},{"name":"Peter Zinda","id":"nm0956926","role":"sound effects editor"},{"name":"Charlie Campagna","id":"nm2153148","role":"sound effects editor"},{"name":"Christopher T. Welch","id":"nm0919527","role":"dialogue editor, adr editor"},{"name":"Julie Feiner","id":"nm0270704","role":"dialogue editor, adr editor"},{"name":"Jessie Pariseau","id":"nm3611106","role":"sound effects editor, dialogue editor"},{"name":"Charles Martin Inouye","id":"nm0409335","role":"supervising music editor"}]}]}]},{"award":"PGA Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated PGA Award","categories":[{"category":"Outstanding Producer of Animated Theatrical Motion Pictures","names":[{"name":"Brad Booker","id":"nm0095374","role":null},{"name":"Guillermo del Toro","id":"nm0868219","role":null}]}]}]},{"award":"Satellite Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Motion Picture, Animated or Mixed Media","names":[]}]}]},{"award":"St. Louis Film Critics Association, US 2014","titlesAwards":[{"titleAwardOutcome":"Nominated SLFCA Award","categories":[{"category":"Best Animated Feature Film","names":[]}]}]},{"award":"Visual Effects Society Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Created Environment in an Animated Feature Motion Picture","names":[{"name":"Glo Minaya","id":"nm0590990","role":null},{"name":"Amy Chen","id":"nm3724563","role":null},{"name":"Sean Ryan McEwan","id":"nm6318092","role":null},{"name":"Jeff Masters","id":"nm3522323","role":null}]}]}]},{"award":"Washington DC Area Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated WAFCA Award","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"World Soundtrack Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won World Soundtrack Award","categories":[{"category":"Best Original Song Written Directly for a Film","names":[{"name":"Gustavo Santaolalla","id":"nm0763395","role":"music by"},{"name":"Paul Williams","id":"nm0931437","role":"lyrics by"},{"name":"Diego Luna","id":"nm0526019","role":"performed by"}]}]}]}],"votes":"49,849","type":"Movie","companyCreditsSimple":[{"idCompany":"co0051162","name":"Reel FX Creative Studios"},{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0215981","name":"Chatrone"}],"keywords":{"keywords":["mexico","bullfight","afterlife","love triangle","bullfighting","day of the dead","cgi animation","3 dimensional","medallion","museum","bandit","serenade","wager","father son relationship","nether world","story within a story","howling dog","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:15:06"}}