{"data":{"movies":[{"title":"John Heffron: Middle Class Funny","originalTitle":"","year":"2009","releaseDate":"200908","runtime":"66 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDI4NDMxMTIzOV5BMl5BanBnXkFtZTgwMDI3NjA2MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":[],"plot":"Funny is the only word that truly captures John Heffron (well, MESSY if you ask his wife). Hailing from the small town of South Lyon, MI (Detroit just sounds tougher), John's middle class upbringing has shaped his comedic voice.","simplePlot":"Funny is the only word that truly captures John Heffron (well, MESSY if you ask his wife). Hailing from the small town of South Lyon, MI (Detroit just sounds tougher), John's middle class upbringing has shaped his comedic voice.","actors":[{"actorName":"John Heffron","urlProfile":"http://www.imdb.com/name/nm0373611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjg2MTM5Nl5BMl5BanBnXkFtZTgwMDI0ODY4MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1970","placeOfBirth":" Detroit, Michigan, USA","bio":"The winner of the second season of NBC's hit reality series \"Last Comic Standing,\" comedian John Heffron has become a comic to watch and love. The Detroit funnyman, who Phyllis Diller referred to as \"the cute one,\" won a talent contract with NBC as well as other great opportunities. When asked about his experience on the show, John said, \"It's a lot like high school ... there are good and bad memories, in the end, I think I will only remember the good ones.\" John started his comedy career as a student at Eastern Michigan University, skipping night classes to perform stand-up comedy. He got his first gig as an emcee at the Main Street Comedy Showcase on the University of Michigan campus. After making his way to graduation, John immediately began working in his field of choice. He started touring the college circuit, performing at more than 80 colleges a year. By that time, he was already a seasoned comic with more than four years of experience. The college audience related to his type of humor, which talked about his days in college, the retro music that he and his classmates listened to and the Pop Rocks that he played with as a kid. This material made him a hit on college campuses, where he recorded his first comedy CD, \"Kid With A Cape.\" By the age of 25, John was a successful headlining comedian who decided to also put his degrees in communications and psychology to work by taking a job as radio sidekick to Danny Bonaduce on a highly-rated Detroit morning show. He worked for five years before making his way back to Los Angeles. Since arriving in LA and making his home in Hollywood, he has made numerous television appearances including NBC's \"The Tonight Show with Jay Leno,\" CBS's \"The Late Late Show with Craig Kilborn,\" two of his own half-hour \"Comedy Central Presents\" specials and many others. In addition, John has performed at the prestigious Just For Laughs Comedy Festivals in Montreal and Bermuda, as well as the HBO Comedy Festival in Aspen. Also an entrepreneur, John -- along with partner Joel Zimmer -- created a card game called The \"That Guy!\" Game, which puts girls on a scavenger hunt for guys. According to InStyle, Entertainment Weekly and Glamour magazines, it became an immediate hit when Julia Roberts, Drew Barrymore and SNL's Rachel Dratch were spotted buying the game. Entrepreneur magazine even featured John and Joel in its 2001 \"Hot 100\" issue. John took the idea a step further by developing a pilot based on the concept, which received a significant amount of industry attention. \"The idea took nearly three years to come to fruition,\" John said. \"It was while we were both recovering from breakups that we decided to really focus in on it.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjg2MTM5Nl5BMl5BanBnXkFtZTgwMDI0ODY4MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0373611","name":"John Heffron","idIMDB":"nm0373611"},"actorId":"nm0373611","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2222754","urlIMDB":"http://www.imdb.com/title/tt2222754","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 6 min (66 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[],"awards":[],"type":"Movie","companyCreditsSimple":[]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:04:53"}}