{"data":{"movies":[{"title":"The Hooligan Factory","originalTitle":"","year":"2014","releaseDate":"20140613","directors":[{"name":"Nick Nevern","id":"nm2339680"}],"writers":[{"name":"Michael Lindley","id":"nm2811337"},{"name":"Nick Nevern","id":"nm2339680"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUxOTI0MTMzN15BMl5BanBnXkFtZTgwMjcxMTM3MTE@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy"],"plot":"Danny wants something more. Expelled from school and living in his grandfathers flat, he longs to live up to the image of his estranged father Danny Senior. Sent to prison for force feeding a judge his own wig Danny Senior was a legend and Danny is looking for a way to emulate his father's achievements and rise to be \"top boy\". Meanwhile in Wormwood Scrubs prison legendary football hooligan Dex is about to be released. Dex is on a quest of his own, one of vengeance against his nemesis and rival firm leader Yeti. But when Danny and Dex's paths cross they embark on a journey as old as hooliganism itself. Dex, Danny and The Hooligan Factory travel the length of the country on a mission to re-establish their firm's glory days. However, the police are closing in and we get a sense that the Hooligan Factory's best days may be behind them, but with Danny on their side, and Dex finding his old form who knows where this may lead. After all... Its a funny old game.","simplePlot":"Danny wants something more. Expelled from school and living in his grandfathers flat, he longs to live up to the image of his estranged father Danny Senior. Sent to prison for force feeding... ","actors":[{"actorName":"Jason Maza","urlProfile":"http://www.imdb.com/name/nm1961009","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE1NzUyMjAyOF5BMl5BanBnXkFtZTgwOTU2Mjc4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1987","placeOfBirth":" London, England, UK","bio":"Jason Maza was born on April 24, 1987 in London, England. He is an actor and producer, known for Fish Tank (2009), The Hooligan Factory (2014) and Welcome to the Punch (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE1NzUyMjAyOF5BMl5BanBnXkFtZTgwOTU2Mjc4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1961009","name":"Jason Maza","idIMDB":"nm1961009"},"actorId":"nm1961009","character":"Danny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Nevern","urlProfile":"http://www.imdb.com/name/nm2339680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM0NjA3OTcyMV5BMl5BanBnXkFtZTcwODIyOTY1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1980","placeOfBirth":" Exeter, Devon, England, UK","bio":"Nick Nevern is a British actor and Director. Nick spent some time in Russia, returning years later to London, where he started his acting career. He first appeared on our TV screens in 2002 in the 'made-for-tv' film Out Of Control, a depiction of the lives of three boys sent to a young offenders institute. His next appearance would be in the TV football drama Dream Team, where he played Pavel Kovac for 2 episodes in 2006. In 2007 he appeared in Bonkers, Hotel Babylon and played the role of Viktor in 4 episodes of The English Class, as well as appearing in the film I Want Candy. 2008 saw him appear in the films West 10 LDN (2008) and Adulthood (2008), Eastenders, TV mini series Matroesjka's 2 and Spooks. In 2009 he played the role of Rogowski in Shameless, Lenny in Jonathan Creek and Elliot Johns in The Bill. Nick appeared in the film Mission London and also played the role of Ely in the TV mini series The Deep in 2010. In 2011, Nick Nevern appeared in the films 7lives and The Tapes. He also played the roles of Andrew in the film Turnout, Roger in Demon Never Dies and Marky in Victim. This was also the year of the release of Nick Nevern's most noted roles in the film Terry which Nick wrote, directed and played the role of Terry Jones, a documentary style film following his life of petty crime, drugs and extreme violence. 2012 sees the biggest year in Nicks career as he stars in some of the biggest British films of the year including The Sweeney (2012) and The Rise & Fall of a White Collar Hooligan (2012) and Riot (2012) (formally Riot).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM0NjA3OTcyMV5BMl5BanBnXkFtZTcwODIyOTY1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2339680","name":"Nick Nevern","idIMDB":"nm2339680"},"actorId":"nm2339680","character":"Dex","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Burke","urlProfile":"http://www.imdb.com/name/nm0121895","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjk4MjgyMl5BMl5BanBnXkFtZTcwODk1MjgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1981","placeOfBirth":" Kent, England, UK","birthName":"Tom Liam Benedict Burke","height":"6' (1.83 m)","bio":"Tom Burke was born on June 30, 1981 in Kent, England as Tom Liam Benedict Burke. He is an actor, known for Only God Forgives (2013), Third Star (2010) and Chéri (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjk4MjgyMl5BMl5BanBnXkFtZTcwODk1MjgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0121895","name":"Tom Burke","idIMDB":"nm0121895"},"actorId":"nm0121895","character":"Bullet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Fearon","urlProfile":"http://www.imdb.com/name/nm0269909","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ4NzQ5NjI2MF5BMl5BanBnXkFtZTcwODU4MDkwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1973","placeOfBirth":" London, England, UK","height":"5' 11\" (1.8 m)","bio":"Ray Fearon was born in London in 1967, one of eight children, and was a junior international tennis player in his teens. He trained as an actor at the Rose Bruford College of Speech and Drama. His early stage roles included Othello, Charles Surface in 'The School for Scandal', Betty/Martin in 'Cloud Nine', Longaville in 'Love's Labour's Lost', Ferdinand in 'The Tempest', and Pete in 'Blues for Mr Charlie'. His early work in London included Caryl Churchill's 'Serious Money' at the Royal Court Theatre at the age of 17, Hugo/Fred in 'Ring Round the Moon' at the Lilian Baylis Theatre, the one-man show 'The Invisible Man' at the Bridewell Theatre, and Pierre in 'Venice Preserv'd' at the Almeida Theatre. He has also worked at the Liverpool Everyman Theatre, Manchester Contact Theatre, Manchester Royal Exchange Theatre, Oxford Playhouse, and the Barn Theatre, Kent. His film credits include Harry Potter and the Sorcerer's Stone (2001), Kenneth Branagh's Hamlet (1996), and The Clandestine Marriage (1999). On television, he has made appearances in The Bill (1984), _\"Waking the Dead\" (2000/II)_, A Christmas Carol (2000), and _\"As If\" (2001/I)_ amongst others. His radio work includes 'Who Killed Palamino Milero?', 'Pawn Shop Blues', 'The Good Doctor Johnson', 'The Toko Losh', and 'A Raisin in the Sun'. With the Royal Shakespeare Company, he has performed First Knight/First Tempter in 'Murder in the Cathedral', Prince of Morocco in 'The Merchant of Venice', Stubb in 'Moby Dick', Brachiano in 'The White Devil', Paris in 'Troilus and Cressida', the Marquis of Posa in 'Don Carlos' and, for Michael Attenborough, Romeo in 'Romeo and Juliet' and Othello in 'Othello'. In 2002, he played the title role for Adrian Noble in Shakespeare's 'Pericles' for the RSC at the Roundhouse and then at Stratford. A year later, he appeared as Oberon in 'A Midsummer Night's Dream' at the Crucible Theatre, Sheffield. In 2004, he starred in Steve Water's 'World Music' at the Donmar Warehouse and in Roy Williams' 'Sing Yer Heart Out For The Lads' at the National Theatre. The following year, he joined the cast of the UK's most popular television serial, Coronation Street (1960), playing Nathan Cooper.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ4NzQ5NjI2MF5BMl5BanBnXkFtZTcwODU4MDkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269909","name":"Ray Fearon","idIMDB":"nm0269909"},"actorId":"nm0269909","character":"Midnight","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven O'Donnell","urlProfile":"http://www.imdb.com/name/nm0640838","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NDgyMjI5NV5BMl5BanBnXkFtZTgwMzkxOTM1MDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1963","placeOfBirth":"","height":"6' 1\" (1.85 m)","bio":"Steven O'Donnell was born in 1963. He is an actor, known for Shakespeare in Love (1998), A Knight's Tale (2001) and Conan the Barbarian (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NDgyMjI5NV5BMl5BanBnXkFtZTgwMzkxOTM1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0640838","name":"Steven O'Donnell","idIMDB":"nm0640838"},"actorId":"nm0640838","character":"Old Bill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan Watkins","urlProfile":"http://www.imdb.com/name/nm2744497","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYwMDA1ODkwMl5BMl5BanBnXkFtZTgwMDQzOTY3OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Morgan Watkins is an actor and producer, known for Kingsman: The Secret Service (2014), Wild Bill (2011) and Chicken (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYwMDA1ODkwMl5BMl5BanBnXkFtZTgwMDQzOTY3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2744497","name":"Morgan Watkins","idIMDB":"nm2744497"},"actorId":"nm2744497","character":"Trumpet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josef Altin","urlProfile":"http://www.imdb.com/name/nm1086981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5Mjc5NzQ0OV5BMl5BanBnXkFtZTcwNTQ3MzQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1983","placeOfBirth":" London, England, UK","height":"5' 6\" (1.68 m)","bio":"Josef Altin was born on February 12, 1983 in London, England. He is an actor, known for Eastern Promises (2007), Les Misérables (2012) and Boy A (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5Mjc5NzQ0OV5BMl5BanBnXkFtZTcwNTQ3MzQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1086981","name":"Josef Altin","idIMDB":"nm1086981"},"actorId":"nm1086981","character":"Weasel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ronnie Fox","urlProfile":"http://www.imdb.com/name/nm0289234","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQyNDMyMjk4OF5BMl5BanBnXkFtZTcwNjAzNDgxNg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Ronnie Fox is an actor, known for Lock, Stock and Two Smoking Barrels (1998), Quartet (2012) and The Sweeney (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQyNDMyMjk4OF5BMl5BanBnXkFtZTcwNjAzNDgxNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0289234","name":"Ronnie Fox","idIMDB":"nm0289234"},"actorId":"nm0289234","character":"Danny Snr","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo Gregory","urlProfile":"http://www.imdb.com/name/nm0339877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTI3NDU4Nl5BMl5BanBnXkFtZTcwNzc1Mjc3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1978","placeOfBirth":" UK","height":"5' 10\" (1.78 m)","bio":"Leo Gregory was born on November 22, 1978 in the UK. He is an actor and producer, known for Green Street Hooligans (2005), Stoned (2005) and Tristan + Isolde (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTI3NDU4Nl5BMl5BanBnXkFtZTcwNzc1Mjc3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339877","name":"Leo Gregory","idIMDB":"nm0339877"},"actorId":"nm0339877","character":"Slasher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith-Lee Castle","urlProfile":"http://www.imdb.com/name/nm0145290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTcwMjYzNF5BMl5BanBnXkFtZTgwMDcyNjc0MzE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1959","placeOfBirth":" England, UK","height":"5' 10\" (1.78 m)","bio":"Keith-Lee Castle was born on September 14th, 1968 in England. He is a British actor, best known for his role of Dracula, in the popular children's series, Young Dracula (2006-2014). More recently, he played The Baron, in football hooligan spoof, The Hooligan Factory (2014) and starred in horror move short, A Stranger Kind (2014) which he won 3 awards for..ConCarolinas Short Film Festival...Best Actor. FilmQuest...Best Supporting Actor and NOLA Horror Film Festival ..Best Actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTcwMjYzNF5BMl5BanBnXkFtZTgwMDcyNjc0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0145290","name":"Keith-Lee Castle","idIMDB":"nm0145290"},"actorId":"nm0145290","character":"The Baron","urlCharacter":"http://www.imdb.com/character/ch0369085","main":true},{"actorName":"Lorraine Stanley","urlProfile":"http://www.imdb.com/name/nm1041607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTgxMzczMF5BMl5BanBnXkFtZTgwMTcxNTg4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1976","placeOfBirth":" Portsmouth, Hampshire, England, UK","birthName":"Lorraine Marie Stanley","bio":"Lorraine Stanley was born on June 28, 1976 in Portsmouth, Hampshire, England as Lorraine Marie Stanley. She is an actress and producer, known for London to Brighton (2006), Made in Dagenham (2010) and Eden Lake (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTgxMzczMF5BMl5BanBnXkFtZTgwMTcxNTg4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1041607","name":"Lorraine Stanley","nicknames":["Lou"],"idIMDB":"nm1041607"},"actorId":"nm1041607","character":"Sharon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig Fairbrass","urlProfile":"http://www.imdb.com/name/nm0265492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMDQ3NjMwNzheQTJeQWpwZ15BbWU4MDA5NTU3Mzgx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1964","placeOfBirth":" London, England, UK","height":"6' 3\" (1.91 m)","bio":"At six foot three, Craig Fairbrass is an experienced award winning British actor. Craig has starred in over forty feature films, including the lead role in fifteen independent films in the U.K and U.S as well as Award winning British TV along with lead guest star roles in five major U.S. TV series. Craig also became one of the most iconic voices within the most successful video game franchise of all time, Call Of Duty Modern Warfare by lending his voice to Gaz, Ghost and Walcroft in Call of Duty MW: 1, 2 and 3 and now the new Infinite Warfare. Craig was born in Mile End hospital in London's East End, his father Jack was one of nine kids and was a Stevedore the best you could be as a London docker, his mother Maureen was a machinist dressmaker in Petticoat Lane, she was one of ten kids. Along with his younger sister Lindsey they lived in Stepney where Craig grew up. It was at Eaglesfield boys secondary comprehensive in Woolwich where Craig became fascinated with films and acting, although struggling from one year to the next and not top of the class academically he found drama an outlet, winning a place with the National Theatre youth company, it was here that he got the acting bug. After being expelled at 15 he worked as a roofer's labourer, a job he would return to time and time again in the coming years for support while securing acting roles, this earned him enough money to attend a course at drama school. Leaving drama school Craig soon realised that to survive he needed a second string to his bow if he was to pursue his dream as an actor, so he returned to roofing in the day and working on the doors of some of S.E. London's less desirable nightspots for the next five years until securing enough money to buy his own business, a sandwich bar in Woolwich market. Movie experience began as well in the breakout role of Challoner, opposite Denzel Washington in the powerful British film For Queen And Country. Television soon followed, with the BBC drama Big Deal a regular role in LWT'S award winning London's Burning and the highly acclaimed BAFTA /EMMY award-winning TV series Prime Suspect 1 and 2 in which Craig played hard-bitten detective Frank Burkin opposite Helen Mirren. 1992 saw Craig use this as a calling card in Los Angeles, securing a starring a role in one of the biggest action movies of the 90s, Cliffhanger with Sylvester Stallone, which opened doors in the U.S independent film arena, starring in the action films, Nightscare, Terminal Force and Proteus before returning to the UK to star in the British thriller Killing Time and the award-winning horror, Darklands. In 1999 Craig joined the cast of the BBC's flagship show EastEnders where his recurring character of Dan Sullivan over three years won record viewing figures and a four-hander Sunday evening special Directed by Tom Hooper won a TV BAFTA for best drama. Other strong roles followed, lead villain Ray Betson in TV movie - The Great Dome Robbery, then to Rome to complete his role on Moro, for controversial award-winning Italian art-house director Aurellio Grimaldi and guest lead in Radio 4's afternoon play Fair Maids Are Shining. Craig's role of the killer Henry Caine in White Noise 2, the sequel to the No. 1 box office hit White Noise reaches no. 5 in the top ten cinema films in London. It was in 2007 that saw Craig in his most powerful performance to date, that of true life gangster Pat Tate in Rise Of The Footsoldier the gangster epic based on true life events directed by BAFTA nominee Julian Gilbey, followed by a strong supporting role in The Bank Job, opposite Jason Statham. Craig returned to L.A to guest-star in U.S TV series Terminator The Sarah Connor Chronicles. David Mamet's top rated action drama series The Unit, Stargate SG1 and the action film Far Cry. Craig continues to forge a strong position in the independent film arena with lead roles in Freight, Dead Cert and Devils Playground - comedy cameos in The Shouting Men and Just For The Record. 2011 sees Craig in U.S action thriller House Of The Rising Sun opposite Dave Bautista, co-lead in British thriller St Georges Day, U.S actioner Hijacked and Universal's multi-million dollar Vikingdom 3D. 2012 kicks off with Universal's Get Lucky and Bula Quo the Status Quo action comedy and the male lead in Let Me Survive a drama based on the best selling book. Oct 2012 Craig plays the lead role of British mercenary Lex Walker opposite Jason Patric and James Caan in the L.A based U.S action thriller The Outsider, followed by Universal's gangster spoof The Hooligan Factory. In recent years, Craig takes the lead role of Alfie Jennings in Jonnie Malachi's violent, stylized contract killer movie Breakdown and Mark McQueens slick revenge thriller London Heist written by Craig - set in Spain's glamorous Marbella and London's underworld. The eagerly anticipated motion capture sci-fi game - Star Citizen/ Squadron 42 alongside Gary Oldman, Gillian Anderson and Mark Strong and the new Call of Duty Infinite Warfare with Kit Harrington. Craig has just completed filming on Rise of the Footsoldier 3 - The Pat Tate years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMDQ3NjMwNzheQTJeQWpwZ15BbWU4MDA5NTU3Mzgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0265492","name":"Craig Fairbrass","idIMDB":"nm0265492"},"actorId":"nm0265492","character":"Mickey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil Large","urlProfile":"http://www.imdb.com/name/nm4018388","urlPhoto":"","biography":{"height":"5' 7\" (1.7 m)","bio":"Neil Large is an actor, known for Ill Manors (2012), Tony (2009) and Abducted (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4018388","name":"Neil Large","nicknames":["Largie"],"idIMDB":"nm4018388"},"actorId":"nm4018388","character":"Manchester's Top Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Juliet Oldfield","urlProfile":"http://www.imdb.com/name/nm2957851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTExMjgzNDg3MV5BMl5BanBnXkFtZTgwNjQwODI2NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Juliet Oldfield is an actress, known for Bronson (2008), Greyhawk (2014) and Borrowed Time (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTExMjgzNDg3MV5BMl5BanBnXkFtZTgwNjQwODI2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2957851","name":"Juliet Oldfield","idIMDB":"nm2957851"},"actorId":"nm2957851","character":"Karen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Matthews","urlProfile":"http://www.imdb.com/name/nm4975478","urlPhoto":"","biography":{"bio":"Billy Matthews is an actor, known for The Hooligan Factory (2014), One Night (2012) and New Tricks (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4975478","name":"Billy Matthews","idIMDB":"nm4975478"},"actorId":"nm4975478","character":"Danny JNR","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2360446","urlIMDB":"http://www.imdb.com/title/tt2360446","business":{"budget":{"money":"£1,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.9","filmingLocations":[{"location":"Elstree Studios, Borehamwood, Hertfordshire, England, UK"}],"awards":[],"votes":"1,695","type":"Movie","companyCreditsSimple":[{"idCompany":"co0391509","name":"Think Big Productions"},{"idCompany":"co0282998","name":"Unstoppable Entertainment"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 21:49:51"}}