{"data":{"movies":[{"title":"Jessabelle","originalTitle":"","year":"2014","releaseDate":"20141107","directors":[{"name":"Kevin Greutert","id":"nm0340436"}],"writers":[{"name":"Robert Ben Garant","id":"nm0304830"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTM1MjYzOV5BMl5BanBnXkFtZTgwNjQwMjA1MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"Jessabelle \"Jessie\" Laurent is pregnant and accepts to move to the house of her boyfriend to raise a family of their own. However they have a car accident where her boyfriend and her baby die. Jessie is seriously wounded and trapped to a wheelchair, and the direction of the hospital asks her to contact her estranged father to help her. Leon Laurent brings his daughter to his house in Louisiana and lodges her in her mother's room. Jessie snoops around the room and finds a videotape where her mother Kate Laurent is pregnant and reads tarot cards to her. She tells that Jessie would never left Louisiana; she is attracted by water; and another woman wants her out of the house. However Leon arrives and destroys the tape. On the next morning, Jessie watches another videotape when her father is out of the house, and her mother talks about the man that had taught her to read cards, Moses. Jessie is haunted by the ghost of a woman and her father discovers the two other videotapes she has hidden...","simplePlot":"Returning to her childhood home in Louisiana to recuperate from a horrific car accident, Jessabelle comes face to face with a long-tormented spirit that has been seeking her return -- and has no intention of letting her escape.","actors":[{"actorName":"Sarah Snook","urlProfile":"http://www.imdb.com/name/nm3512758","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODA2Nzc1NV5BMl5BanBnXkFtZTgwODYwNDMxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Sarah Snook is a stage, television, and film actress from Adelaide, South Australia. Sarah attended St John's Grammar School in Belair (alongside Ben Nicholas), Scotch College in Mitcham, and NIDA in Sydney, graduating in 2008. While studying at NIDA, she performed in stage productions of Macbeth and Gallipoli, and since graduating appeared in King Lear performed by the State Theatre Company of South Australia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODA2Nzc1NV5BMl5BanBnXkFtZTgwODYwNDMxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3512758","name":"Sarah Snook","idIMDB":"nm3512758"},"actorId":"nm3512758","character":"Jessie Laurent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joelle Carter","urlProfile":"http://www.imdb.com/name/nm0141710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjUxNTk2MF5BMl5BanBnXkFtZTgwOTUyODY1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1972","placeOfBirth":" Thomasville, Georgia, USA","birthName":"Joelle Marie Carter","height":"5' 9\" (1.75 m)","bio":"Joelle Carter can be seen in such feature cult favorites as High Fidelity (2000) and American Pie 2 (2001), and indies, Swimming (2000) and Lisa Picard is Famous (2000). In addition, Carter has starred in numerous television projects, including the controversial series, Wonderland (2000), created by Peter Berg (Friday Night Lights (2004)). Furthermore, she is very proud of the documentary, Altered by Elvis (2006), which she co-produced. Carter also co-produced and starred in the short, A Girl and a Gun (2008), which won Best Original Short at the 2008 Washougal International Film Festival. She was thrilled to attend the 2008 Cannes Film Festival with the film, Jumping In (2008), in which she starred. Carter recently attended the Boston Film Festival, where her latest film, To Be Friends (2010), (directed by Jim Eckhart, executive-produced by Aaron Eckhart and co-starring Todd Stashwick) was honored and opened the festival. Carter's upcoming features include \"City of Jerks\" (directed by Phedon Papamichael), and Eyes to See (2010), both set to release in 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjUxNTk2MF5BMl5BanBnXkFtZTgwOTUyODY1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0141710","name":"Joelle Carter","idIMDB":"nm0141710"},"actorId":"nm0141710","character":"Kate Laurent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Webber","urlProfile":"http://www.imdb.com/name/nm0916406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ3OTAxOTA3Nl5BMl5BanBnXkFtZTgwMTk1NzU0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1980","placeOfBirth":" Minneapolis, Minnesota, USA","height":"5' 11½\" (1.82 m)","bio":"Actor Mark Webber was raised by his single mother, Cheri Lynn Honkala, in the slums of North Philadelphia, where they spent a great deal of time homeless - living in cars and abandoned buildings, and struggling to survive during the harsh winters. Mark and his mother were then the subject of a major TV network news magazine story; they have been outspoken homeless advocates for many years and continue to be, walking in protests, helping to educate voters, and volunteering to help provide food and shelter to the urban poor in Philadelphia and elsewhere. Mark's mother was the 2012 Green Party nominee for Vice President of the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ3OTAxOTA3Nl5BMl5BanBnXkFtZTgwMTk1NzU0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0916406","name":"Mark Webber","idIMDB":"nm0916406"},"actorId":"nm0916406","character":"Preston Sanders","urlCharacter":"http://www.imdb.com/character/ch0471243","main":true},{"actorName":"David Andrews","urlProfile":"http://www.imdb.com/name/nm0028625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzODM0OTQxMl5BMl5BanBnXkFtZTgwMjMyNTQ5NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1952","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Stanley David Andrews","bio":"David Andrews, born and raised in Baton Rouge, Louisiana, graduated summa cum-laude from Louisiana State University, before going on to study law at Duke University and earning his degree from Stanford Law School. After becoming a member of the California bar and practicing law for a short time, he took what he calls a \"hard right\", deciding to leave the legal profession for an acting career. Now a 35-year industry veteran, David Andrews has worked with some of Hollywood's top directors and Oscar-winning actors, and has been singled out by critics for his work on both stage and screen. A highly versatile actor and consummate professional, David's roles have run the gamut in films such as World War Z, Apollo 13, Fight Club, Hannibal, Walk to Remember, The Conspirator, Cherry 2000, and Fair Game, in which he was singled out for his powerful portrayal of Scooter Libby. On television, David has starred as a series regular on JAG, The Monroes, Mann & Machine, The Antagonist, HBO's 12 Miles of Bad Road, and the BBC's Pulaski, for which he received an ACE Award nomination for Best Actor in the title role. In addition to a very long list of guest starring roles, David has recurred on numerous series: Netflix' hit series House of Cards, Justified, Murder in the First, The Catch, Crisis, The Whispers, Necessary Roughness, CSI, Covert Affairs, Brothers and Sisters, Surface, Dragnet, and Murder One. He is currently recurring as Sam Vincent on USA's soon-to-be released series Shooter. MOW/mini-series projects, to name just a few, include HBO's Band of Brothers and From the Earth to the Moon, for which he earned a SAG Award for Outstanding Ensemble Performance and critical acclaim for his performance as astronaut Frank Borman. David recently finished co-writing his second feature film script, Bushido, a action/adventure tale of self discovery set in Japan amidst the chaos and destruction of the final days of WWII.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzODM0OTQxMl5BMl5BanBnXkFtZTgwMjMyNTQ5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0028625","name":"David Andrews","nicknames":["Wheels"],"idIMDB":"nm0028625"},"actorId":"nm0028625","character":"Leon Laurent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ana de la Reguera","urlProfile":"http://www.imdb.com/name/nm0478886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2ZkZDM1ZGItNmVlZC00NjdiLWFmY2EtNjI5MGQyYTcwNzM2XkEyXkFqcGdeQXVyNzM0OTExMA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1977","placeOfBirth":" Veracruz, Veracruz, Mexico","birthName":"Anabell Gardoqui De La Reguera","height":"5' 3\" (1.6 m)","bio":"Ana de la Reguera grew up in the tropical state of Veracruz, on the Gulf Coast of Mexico. She began her performance arts studies in the Cultural Institute of Veracruz, then left for Televisa's Center for Artistic Education (CEA) and TV Aztecas' artistic institute (CEFAC) in Mexico City, later taking study with Lisa Robertson and Aaron Spicer in Los Angeles and acting coach Juan 'Carlos Corzza in Spain. In theatre she participated in \"El Cartero\" (\"Il Postino\") for which she received two awards: one for \"Best Actress\" from the Association of Theatre Journalists in Mexico and the other for the year's \"Most Promising Actress\" from the Association of Theatre Critics and Journalists. De la Reguera's professional career began with her role in the telenovela Azul (1996), followed by Pueblo chico, infierno grande (1997)--for which she received the Heraldo Award for \"Best Breakout Female Actress\"--and Desencuentro (1997), which was her third telenovela under the direction of the internationally recognized Ernesto Alonso. _\"Tentaciones\" (1998)_ marked her beginning with powerhouse Argos Comunicación. She was immediately offered roles in _\"Destino\" (1998)_ and Todo por amor (2000), for which she received \"The Golden Palm Award.\" After that, it was non-stop work for de la Reguera. In 2002 she starred in Cara o Cruz (2001), which was the first telenovela co-produced by Argos Comunicación and Telemundo, made exclusively for the Hispanic audience living in the US. The following year she played María in the telenovela Por tí (2002) for TV Azteca and the mini-series that followed up on Pedro el escamoso (2001), Como Pedro por su casa (2003), which was a co-production between Colombia's Caracol and Telemundo. Additionally, de la Reguera also had the lead role in the Peruvian soap opera Luciana y Nicolás (2003). De la Reguera's introduction into film began with Dust to Dust (2000), which earned her two nominations: \"El Heraldo de la Revelación Femenina\" (Best New Actress) and \"Eres Mejor Actriz\" (Best Actress). Later she acted in A Beautiful Secret (2002) with Oscar nominee Katy Jurado. In 2003 Ana starred in the highly acclaimed comedy Ladies' Night (2003), alongside Ana Claudia Talancón. The movie became the box-office success of the year and won her three major awards: \"the Latin America MTV's Favorite Actress Award,\" the Mexican movie industry Award for Best Actress of the year, \"CANACINE,\" and the \"Diosa de Plata (Silver Godess) Award\" for Best Supporting Actress (2003). In 2005 she played the starring role in Gitanas (2004), which aired on Telemundo in the US and now has been seen as far away as Ukraine, Spain and Argentina. In 2006 de la Reguera had the lead in the powerful Así del precipicio (2006), which earned her her second \"Diosa de Plata [Silver Goddess] Award\" for best actress. In addition, she also starred in Paraiso Travel (2008), playing the role of Milagros, singing and dancing for the first time in a movie. John Leguizamo and Colombian star Margarita Rosa de Francisco were also in the cast. The film was shown at the Tribeca Film Festival and later released throughout the US and Latin America. That same year Ana received her big break into American cinema when she landed the role of Sister Encarnación in the comedy Super Nacho (2006). The film by Jared Hess--director of Napoleon Dynamite (2004)--and co-starring Jack Black gave her the opportunity to be seen around the world. In 2008 she became the new face for Cover Girl worldwide, alongside celebrities like Drew Barrymore, Queen Latifah, Ellen DeGeneres and Rihanna. From there her career springboarded into many other impressive endorsements, including campaigns with Pantene, Special K and Flip, Macy's, Coca-Cola (Ciel), Pepsi (Be Light) and Caress, among many others. She began 2010 with a worldwide publicity campaign for Lipton Tea alongside actor Hugh Jackman. Most recently, she did an international campaign with Kahlúa benefiting her hometown of Veracruz, Mexico, left demolished after the resent destruction of Huricaine Karl. In the action-thriller film Les Seigneurs du Sud (2007), filmed mainly in Argentina, she plays Monica Silvari, a mean and sophisticated bank robber alongside Spanish actors Jordi Mollà and Tony Dalton. In the spring of 2008 Ana began filming Capadocia (2008), an HBO mega-production TV show about the chaotic and miserable life in a women's prison in Mexico. The show aired with record-breaking ratings in Mexico and Latin America, and was released in the US in the fall of 2008 for HBO OLE. Three of the most recognized directors in Latin America participated in this HBO original production: Epigmenio Ibarra, Jorge Aragón and Luis Peraza. The successful series got three International Emmy nominations for its first season, and this fall marked the opening of \"Capadocia\"'s second season. In 2009 she shot _Di Di Hollywood (2009)_, from famed _Jamón, Jamón (2000)_ director Bigas Luna. That same year she went back to the Mexican theatre for six months where she played \"Desdemona\" in William Shakespeare \"Othello\". The play was hugely successful in Mexico's renowned Juan Ruiz de Alarcón theater, and she was named \"Best Actress\" by the Journalist Theatre Association at the annual Bravo Awards and by the ACTP. Later that year she filmed the extremely moving Mexican film Backyard (2009), in which she played a cop in an outlaw border city controlled by drug traffickers and killers. Directed by Carlos Carrera (El crimen del padre Amaro (2002), nominated for an Oscar for \"Best Foreign Film\"), the picture was chosen to represent Mexico in the 2010 Academy Awards in the Best Foreign Film category, and earned de la Reguera the \"Best Actress Award\" at the Imagen Awards and the CANACINE Awards, and won the \"Silver Plaque\" in the Chicago Film Festival. The beginning of 2010 brought the opening of her Hollywood film Cop Out (2010), co-starring Bruce Willis and Tracy Morgan and directed by Kevin Smith. She played Gabriela, a strong-willed woman with very picante and colorful language, who gets rescued by Willis and Tracy--and gets them in trouble in the process. In that same year brought the release of her film Hidalgo - La historia jamás contada. (2010), about the controversial life of Mexico's independence hero, priest Miguel Hidalgo. She plays Hidalgo's second wife and shares credit with Demián Bichir (Weeds (2005), Che - 1ère partie - L'Argentin (2008)). In the US she also had a recurring role on the USA Network's series Royal Pains (2009), and starred in the critically-acclaimed, Will Farrell-produced HBO comedy Eastbound & Down (2009) co-starring Danny McBride as down-and-out baseball player and love interest Kenny Powers. She also had a role in the Jon Favreau-directed Cowboys & Aliens (2011) starring Harrison Ford, Daniel Craig and Sam Rockwell, produced by Steven Spielberg, Ron Howard and Brian Grazer. The film crosses the classic Western with the alien-invasion movie in its story about a lone cowboy leading an uprising against murderous aliens from outer space. As if her busy acting career isn't enough, de la Reguera is also heavily involved with charity work. Most recently she uploaded a video to YouTube in order to help raise awareness for Veracruz, her home state, affected by heavy rains and a devastating Hurricane Karl. In the video she speaks about a variety fo options for support and help that victims of the Hurrcane can utilize, and offers methods to make donations. The viral campaign went all over Twitter and other online sites, raising much needed money for the victims of the hurricane. She also founded the organization VeracruzANA AC, which is a philanthropic organization whose mission is to raise funds and build a tourist boulevard of Antigua--something that has been promised by political organizations for years. Antigua is one of the most important and historical communities in Veracruz, and also one of the areas the most damaged by the hurricane. This June marked the culmination of her hard work and the grando Opening ceremony for the touristic boulevard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2ZkZDM1ZGItNmVlZC00NjdiLWFmY2EtNjI5MGQyYTcwNzM2XkEyXkFqcGdeQXVyNzM0OTExMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0478886","name":"Ana de la Reguera","idIMDB":"nm0478886"},"actorId":"nm0478886","character":"Rosaura","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amber Stevens West","urlProfile":"http://www.imdb.com/name/nm0828226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzU2NjE2OF5BMl5BanBnXkFtZTcwMzM0NjI4Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Amber Dawn Stevens","height":"5' 8\" (1.73 m)","bio":"Stevens was born in Los Angeles, California. She is the daughter of actor and radio announcer Shadoe Stevens, and former model Beverly Cunningham. She has a younger sister named Chyna Stevens (Chyna Rose Stevens). She is a graduate of Beverly Hills High School. Her father is Caucasian (of Norwegian, German, English, and Dutch descent) and her mother is African-American (and part-Comanche).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzU2NjE2OF5BMl5BanBnXkFtZTcwMzM0NjI4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828226","name":"Amber Stevens West","idIMDB":"nm0828226"},"actorId":"nm0828226","character":"Dead Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Ellis","urlProfile":"http://www.imdb.com/name/nm0254760","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjgxMTIwOV5BMl5BanBnXkFtZTcwNzgwOTk5Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1956","placeOfBirth":" Dallas, Texas, USA","bio":"Chris Ellis was born on April 14, 1956 in Dallas, Texas, USA. He is an actor, known for The Dark Knight Rises (2012), Catch Me If You Can (2002) and Armageddon (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjgxMTIwOV5BMl5BanBnXkFtZTcwNzgwOTk5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0254760","name":"Chris Ellis","idIMDB":"nm0254760"},"actorId":"nm0254760","character":"Sheriff Pruitt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Hallisay","urlProfile":"http://www.imdb.com/name/nm1878999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU4NjM4NTczOV5BMl5BanBnXkFtZTcwODMxNjQ3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1978","placeOfBirth":" Washington, District of Columbia, USA","height":"6' 2\" (1.88 m)","bio":"Born on October 31, 1978 in Washington, D.C. Brian graduated, at the age of 18, from Gonzaga College High School in 1996 and went on to pursue a degree in Economics and History from Cornell, graduating in 2000. Brian Hallisay began his career in show business by appearing in The Inside (2005) episode, The Inside: Aidan (2005), playing \"Jake Carrington\", with Rachel Nichols and Adam Baldwin. He was next seen as \"Dr. George Harmon\" on the Lifetime network's series, Strong Medicine (2000), in the episode, Strong Medicine: Chief Complaints (2005). In 2006, he was given a role in the Kevin Rodney Sullivan-directed TV movie, A.K.A. (2006), a crime drama which also starred John Leguizamo. Hallisay made his feature film debut in the comedy, Bottoms Up (2006), where he portrayed \"Hayden Field\", alongside Jason Mewes, David Keith and Paris Hilton. This was followed by a series of television appearances. He was in Jerry Bruckheimer's Without a Trace (2002) as \"Alex Stark\", Meredith Stiehm's Cold Case (2003) and CSI: NY (2004) opposite Gary Sinise. He was also given a guest spot in the drama series, Bones (2005), which stars Emily Deschanel and David Boreanaz. His next project became Bionic Woman (2007), where he played \"Dr. Mark Stevens\" for the 2007 episode, Bionic Woman: Faceoff (2007). In 2008, he was given the role of \"Ryan Haas\" in Medium (2005), an NBC drama series starring Patricia Arquette. Hallisay was then approached to play the role of the wealthy and charming bachelor \"Will Davis\" in The CW's Privileged (2008). Will Davis is the potential love interest of the lead character, the smart and endearing \"Megan Smith\", played by JoAnna Garcia Swisher. After \"Privileged\" was canceled, he went on to another television series, The Client List (2012), starring Jennifer Love Hewitt, where he played her ex-husband. In real life, he and Hewitt became engaged in 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU4NjM4NTczOV5BMl5BanBnXkFtZTcwODMxNjQ3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1878999","name":"Brian Hallisay","idIMDB":"nm1878999"},"actorId":"nm1878999","character":"Mark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vaughn Wilson","urlProfile":"http://www.imdb.com/name/nm1535682","urlPhoto":"","biography":{"dateOfBirth":"24 December 1976","placeOfBirth":" Wilmington, North Carolina, USA","height":"5' 10\" (1.78 m)","bio":"Vaughn Wilson was born on December 24, 1976 in Wilmington, North Carolina, USA. He is an actor, known for One Tree Hill (2003), Jessabelle (2014) and Well Wishes (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1535682","name":"Vaughn Wilson","idIMDB":"nm1535682"},"actorId":"nm1535682","character":"Moses","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larisa Oleynik","urlProfile":"http://www.imdb.com/name/nm0646351","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNjU4NTI4OF5BMl5BanBnXkFtZTgwODE2NTMyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1981","placeOfBirth":" Santa Clara County, California, USA","birthName":"Larisa Romanovna Oleynik","height":"5' 7\" (1.7 m)","bio":"Larisa was born in Santa Clara County, California, to Lorraine (Allen), a nurse, and Roman Oleynik, an anesthesiologist. Her father is of Ukrainian and Slovak descent. Larisa's big break came when she was eight. She had gotten the part of young Cosette in a production of \"Les Misérables\". Her costar was Rider Strong, playing Gavroche. The two would be reunited when Larisa guested on Rider's sitcom, Boy Meets World (1993). Larisa's most well known roles are Bianca in 10 Things I Hate About You (1999), and Alex in The Secret World of Alex Mack (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNjU4NTI4OF5BMl5BanBnXkFtZTgwODE2NTMyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0646351","name":"Larisa Oleynik","nicknames":["Rissy"],"idIMDB":"nm0646351"},"actorId":"nm0646351","character":"Sam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fran Bennett","urlProfile":"http://www.imdb.com/name/nm0071754","urlPhoto":"","biography":{"dateOfBirth":"14 August 1937","placeOfBirth":" Malvern, Arkansas, USA","height":"6' 1\" (1.85 m)","bio":"Fran Bennett was born on August 14, 1937 in Malvern, Arkansas, USA. She is an actress, known for General Hospital (1963), 8 mm (1999) and New Nightmare (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0071754","name":"Fran Bennett","idIMDB":"nm0071754"},"actorId":"nm0071754","character":"Mrs. Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Garrett","urlProfile":"http://www.imdb.com/name/nm6889352","urlPhoto":"","biography":{"bio":"Paul Garrett is an actor, known for Jessabelle (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6889352","name":"Paul Garrett","idIMDB":"nm6889352"},"actorId":"nm6889352","character":"Christophe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Weetman","urlProfile":"http://www.imdb.com/name/nm0917430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjcxOTY0OF5BMl5BanBnXkFtZTgwOTY5MDI1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Barbara Weetman is an actress, known for The Notebook (2004), Stuck in Love (2012) and Jessabelle (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjcxOTY0OF5BMl5BanBnXkFtZTgwOTY5MDI1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0917430","name":"Barbara Weetman","idIMDB":"nm0917430"},"actorId":"nm0917430","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Davis","urlProfile":"http://www.imdb.com/name/nm1151921","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIzNzQ3MzY5M15BMl5BanBnXkFtZTgwNjYwMzI0NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Jason Davis was born in Pine Bluff, Arkansas, USA. He is an actor and producer, known for The Accountant (2016), Talladega Nights: The Ballad of Ricky Bobby (2006) and Step Brothers (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIzNzQ3MzY5M15BMl5BanBnXkFtZTgwNjYwMzI0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1151921","name":"Jason Davis","idIMDB":"nm1151921"},"actorId":"nm1151921","character":"Surgeon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lucius Baston","urlProfile":"http://www.imdb.com/name/nm2137633","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxOTcyNTQzOV5BMl5BanBnXkFtZTcwNTcwMjE2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Lucius Baston Junior, the youngest of three boys, was born in South Richmond Hill Queens, NY to a father who was Army veteran turned transportation (train) conductor and a mother who was a home maker. Lucius played high school basketball, and was an 11-year-old disk jockey (DJ) in the early days of Hip-Hop (1980s). Following grade school, he enlisted to the United States Air Force, where he was active for 11 years. After his service in the military, and a stint working in electronics, his love for music and passion for show business would lead him to fun times in radio broadcasting. His dedication to acting was cultivated when an aspiring actress showed him a set of head shots. Like a bolt of lightning, Lucius set out to pursue acting by attending the Performers Studio Workshop for over 4 years. In the past decade, Lucius has aggressively built an impressive body of work to include supporting roles in films such as Bad Lieutenant: Port of Call New Orleans (2009), Cassadaga (2011), Tooth Fairy 2 (2012), Frank vs. God (2014), Jessabelle (2014), Ride Along (2014), and Ride Along 2 (2016) with notable television roles in The Wronged Man (2010), House of Payne (2006), Teen Spirit (2011), HBO's Treme (2010), NBC's Revolution (2012), and Showtime's Emmy Award winning series Homeland (2011). Most recently the landmark min-series Roots (2016), Netflix's Stranger Things (2016), and FX's Golden Globe winning series Atlanta (2016). Lucius is an extraordinarily talented and versatile entertainer. He now lives in Atlanta, GA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxOTcyNTQzOV5BMl5BanBnXkFtZTcwNTcwMjE2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2137633","name":"Lucius Baston","idIMDB":"nm2137633"},"actorId":"nm2137633","character":"Mr. Woods","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2300975","urlIMDB":"http://www.imdb.com/title/tt2300975","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"21,226","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"04","year":"2012","remarks":null},{"money":null,"country":null,"day":"03","month":"05","year":"2012","remarks":null}],"copyrightHolder":"© 2014 Lions Gate Films Inc."},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"5.4","metascore":"37","filmingLocations":[{"location":"Wilmington, North Carolina, USA"}],"rated":"PG-13","awards":[],"votes":"17,969","type":"Movie","companyCreditsSimple":[{"idCompany":"co0173285","name":"Lionsgate"},{"idCompany":"co0098315","name":"Blumhouse Productions"},{"idCompany":"co0049718","name":"Principato-Young Entertainment"}],"keywords":{"keywords":["wheelchair","female protagonist","videotape","louisiana","woman","car accident","childhood home","spirit","haunting","tarot card","suicide","tired to a wheelchair","extramarital affair","lighting a candle","hit with a rifle butt","ambulance","shard of mirror","baby murdered","year 1988","baby skeleton","baby coffin","dead chicken","doll","mangrove swamp","flash of light","motor boat","screaming in fear","breaking a mirror","party","cockroach","sleeping in a wheelchair","seeing father burned alive","fire in a 55 gallon drum","attacked by a ghost","two women in bath tub","nightmare","strapped to a bed","sand painting","voodoo cult","mother's bracelet","some scenes in black and white","video tape from mother","porcelaine figurine","moving in with father","woman in a wheelchair","curtained bed","dripping faucet","husband killed in a car crash","crippled in a car crash","moving out","begins with text","begins with a quotation","video message","box","digging up a grave","recuperation","hidden room","motorboat","bathtub","voodoo","chicken","widower","dead mother","skull","coffin","grave","gravestone","headstone","swamp","boat","haunted house","talking to the camera","tarot reading","loss of mother","redhead","bedroom","coin","young woman","death of boyfriend","father daughter relationship","one word title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:11:43"}}