{"data":{"movies":[{"title":"The Expendables 3","originalTitle":"","year":"2014","releaseDate":"20140815","directors":[{"name":"Patrick Hughes","id":"nm0400850"}],"writers":[{"name":"Sylvester Stallone","id":"nm0000230"},{"name":"Creighton Rothenberger","id":"nm4950667"}],"runtime":"126 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU5ODMyMzg2MV5BMl5BanBnXkFtZTgwMTA2MTcxMjE@._V1.jpg","countries":["USA","France","Bulgaria"],"languages":["English","Romanian","Spanish"],"genres":["Action","Adventure","Thriller"],"plot":"Barney (Stallone), Christmas (Statham) and the rest of the team comes face-to-face with Conrad Stonebanks (Gibson), who years ago co-founded The Expendables with Barney. Stonebanks subsequently became a ruthless arms trader and someone who Barney was forced to kill... or so he thought. Stonebanks, who eluded death once before, now is making it his mission to end The Expendables -- but Barney has other plans. Barney decides that he has to fight old blood with new blood, and brings in a new era of Expendables team members, recruiting individuals who are younger, faster and more tech-savvy. The latest mission becomes a clash of classic old-school style versus high-tech expertise in the Expendables' most personal battle yet.","simplePlot":"Barney augments his team with new blood for a personal battle: to take down Conrad Stonebanks, the Expendables co-founder and notorious arms trader who is hell bent on wiping out Barney and every single one of his associates.","actors":[{"actorName":"Sylvester Stallone","urlProfile":"http://www.imdb.com/name/nm0000230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Sylvester Gardenzio Stallone","height":"5' 9½\" (1.77 m)","bio":"This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, Richard Burton or Alec Guinness; however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in New York's gritty Hell's Kitchen, to Jackie Stallone (née Labofish), an astrologer, and Frank Stallone, a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core The Party at Kitty and Stud's (1970), the thriller Klute (1971) and the comedy Bananas (1971). He got a crucial career break alongside fellow young actor Henry Winkler, sharing lead billing in the effectively written teen gang film The Lords of Flatbush (1974). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the Roger Corman-produced Death Race 2000 (1975). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 Muhammad Ali-Chuck Wepner fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. Rocky (1976) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members Talia Shire, Burgess Meredith and Burt Young, and director John G. Avildsen gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star. Stallone followed Rocky (1976) with F.I.S.T. (1978), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and Paradise Alley (1978) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel Rocky II (1979). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films Nighthawks (1981) and Victory (1981) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with Rocky III (1982) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard Mr. T. The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor. The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer David Morrell, and his novel was adapted to the screen with Stallone in the lead role in First Blood (1982), also starring Richard Crenna and Brian Dennehy. The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with Rambo: First Blood Part II (1985), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt Dolph Lundgren in Rocky IV (1985). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by Carl Weathers, at the hands of the unstoppable \"Siberian Express\". Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. Cobra (1986) was a clumsy mess, Over the Top (1987) was equally mediocre, Rambo III (1988) saw Rambo take on the Russians in Afghanistan, and cop buddy film Tango & Cash (1989) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star Kurt Russell. Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in Rocky V (1990) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter Tommy Morrison, the great-nephew of screen legend John Wayne. Sly quickly followed with the lukewarm comedy Oscar (1991), the painfully unfunny Stop! Or My Mom Will Shoot (1992), the futuristic action film Demolition Man (1993), and the comic book-inspired Judge Dredd (1995). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing Cop Land (1997), also starring Robert De Niro and Ray Liotta. It isn't a classic of the genre, but Cop Land (1997) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story Antz (1998), reprised the role made famous by Michael Caine in a terrible remake of Get Carter (2000), climbed back into a race car for Driven (2001), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, Spy Kids 3-D: Game Over (2003). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but Rocky Balboa (2006), and Vietnam veteran Rambo (2008) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand. Love him or loathe him, Sylvester Stallone has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000230","name":"Sylvester Stallone","nicknames":["Sly","Michael","The Italian Stallion","Binky","Sly Stallone"],"idIMDB":"nm0000230"},"actorId":"nm0000230","character":"Barney Ross","urlCharacter":"http://www.imdb.com/character/ch0133697","main":true},{"actorName":"Jason Statham","urlProfile":"http://www.imdb.com/name/nm0005458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk2MDkwOV5BMl5BanBnXkFtZTcwMDAxODQwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1967","placeOfBirth":" Shirebrook, Derbyshire, England, UK","height":"5' 10\" (1.78 m)","bio":"Jason Statham was born in Shirebrook, Derbyshire, to Eileen (Yates), a dancer, and Barry Statham, a street merchant and lounge singer. Statham has done quite a lot in a short time. He has been a Diver on the British National Diving Team and finished 12th in the World Championships in 1992. He has also been a fashion model, black market salesman and finally of course, actor. He got the audition for his debut role as Bacon in Lock, Stock and Two Smoking Barrels (1998) through French Connection, for whom he was modeling. They became a major investor in the film and introduced Jason to Guy Ritchie, who invited him to audition for a part in the film by challenging him to impersonate an illegal street vendor and convince him to purchase fake jewelery. Jason must have been doing something right because after the success of Lock, Stock and Two Smoking Barrels (1998) he teamed up again with Guy Ritchie for Snatch (2000), with co-stars including Brad Pitt, Dennis Farina and Benicio Del Toro. After Snatch (2000) came Turn It Up (2000) with US music star Ja Rule, followed by a supporting actor role in the Sci-Fi film Ghosts of Mars (2001), Jet Li's The One (2001) and another screen partnership with Vinnie Jones in Mean Machine (2001) under Guy Ritchie's and Matthew Vaughn's SKA Films. Finally in 2002 he was cast as the lead role of Frank Martin in Le transporteur (2002). Jason is also in the summer 2003 blockbuster remake of The Italian Job (1969), The Italian Job (2003), playing Handsome Rob.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk2MDkwOV5BMl5BanBnXkFtZTcwMDAxODQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005458","name":"Jason Statham","nicknames":["Jay","The Stath"],"idIMDB":"nm0005458"},"actorId":"nm0005458","character":"Lee Christmas","urlCharacter":"http://www.imdb.com/character/ch0133696","main":true},{"actorName":"Harrison Ford","urlProfile":"http://www.imdb.com/name/nm0000148","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Mjg0NjIxOV5BMl5BanBnXkFtZTcwMTM2NTI3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1942","placeOfBirth":" Chicago, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Harrison Ford was born on July 13, 1942 in Chicago, Illinois, to Dorothy (Nidelman), a radio actress, and Christopher Ford (born John William Ford), an actor turned advertising executive. His father was of Irish and German ancestry, while his maternal grandparents were Jewish immigrants from Minsk, Belarus. Harrison was a lackluster student at Maine Township High School East in Park Ridge Illinois (no athletic star, never above a C average). After dropping out of Ripon College in Wisconsin, where he did some acting and later summer stock, he signed a Hollywood contract with Columbia and later Universal. His roles in movies and television (Ironside (1967), The Virginian (1962)) remained secondary and, discouraged, he turned to a career in professional carpentry. He came back big four years later, however, as Bob Falfa in American Graffiti (1973). Four years after that, he hit colossal with the role of Han Solo in Star Wars: Episode IV - A New Hope (1977). Another four years and Ford was Indiana Jones in Raiders of the Lost Ark (1981). Four years later and he received Academy Award and Golden Globe nominations for his role as John Book in Witness (1985). All he managed four years after that was his third starring success as Indiana Jones; in fact, many of his earlier successful roles led to sequels as did his more recent portrayal of Jack Ryan in Patriot Games (1992). Another Golden Globe nomination came his way for the part of Dr. Richard Kimble in The Fugitive (1993). He is clearly a well-established Hollywood superstar. He also maintains an 800-acre ranch in Jackson Hole, Wyoming. Ford is a private pilot of both fixed-wing aircraft and helicopters, and owns an 800-acre (3.2 km2) ranch in Jackson, Wyoming, approximately half of which he has donated as a nature reserve. On several occasions, Ford has personally provided emergency helicopter services at the request of local authorities, in one instance rescuing a hiker overcome by dehydration. Ford began flight training in the 1960s at Wild Rose Idlewild Airport in Wild Rose, Wisconsin, flying in a Piper PA-22 Tri-Pacer, but at $15 an hour, he could not afford to continue the training. In the mid-1990s, he bought a used Gulfstream II and asked one of his pilots, Terry Bender, to give him flying lessons. They started flying a Cessna 182 out of Jackson, Wyoming, later switching to Teterboro, New Jersey, flying a Cessna 206, the aircraft he soloed in. Ford is an honorary board member of the humanitarian aviation organization Wings of Hope. On March 5, 2015, Ford's plane, believed to be a Ryan PT-22 Recruit, made an emergency landing on the Penmar Golf Course in Venice, California. Ford had radioed in to report that the plane had suffered engine failure. He was taken to Ronald Reagan UCLA Medical Center, where he was reported to be in fair to moderate condition. Ford suffered a broken pelvis and broken ankle during the accident, as well as other injuries.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Mjg0NjIxOV5BMl5BanBnXkFtZTcwMTM2NTI3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000148","name":"Harrison Ford","nicknames":["Harry"],"idIMDB":"nm0000148"},"actorId":"nm0000148","character":"Drummer","urlCharacter":"http://www.imdb.com/character/ch0418852","main":true},{"actorName":"Arnold Schwarzenegger","urlProfile":"http://www.imdb.com/name/nm0000216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDc4NzUyMV5BMl5BanBnXkFtZTcwMTQyMTc5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1947","placeOfBirth":" Thal, Styria, Austria","birthName":"Arnold Alois Schwarzenegger","height":"6' 2\" (1.88 m)","bio":"With an almost unpronounceable surname and a thick Austrian accent, who would have ever believed that a brash, quick talking bodybuilder from a small European village would become one of Hollywood's biggest stars, marry into the prestigious Kennedy family, amass a fortune via shrewd investments and one day be the Governor of California!? The amazing story of megastar Arnold Schwarzenegger is a true \"rags to riches\" tale of a penniless immigrant making it in the land of opportunity, the United States of America. Arnold Alois Schwarzenegger was born July 30, 1947, in the town of Thal, Styria, Austria, to Aurelia (Jadrny) and Gustav Schwarzenegger, the local police chief. From a young age, he took a keen interest in physical fitness and bodybuilding, going on to compete in several minor contests in Europe. However, it was when he emigrated to the United States in 1968 at the tender age of 21 that his star began to rise. Up until the early 1970s, bodybuilding had been viewed as a rather oddball sport, or even a mis-understood \"freak show\" by the general public, however two entrepreneurial Canadian brothers Ben Weider and Joe Weider set about broadening the appeal of \"pumping iron\" and getting the sport respect, and what better poster boy could they have to lead the charge, then the incredible \"Austrian Oak\", Arnold Schwarzenegger. Over roughly the next decade, beginning in 1970, Schwarzenegger dominated the sport of competitive bodybuilding winning five Mr. Universe titles and seven Mr. Olympia titles and, with it, he made himself a major sports icon, he generated a new international audience for bodybuilding, gym memberships worldwide swelled by the tens of thousands and the Weider sports business empire flourished beyond belief and reached out to all corners of the globe. However, Schwarzenegger's horizons were bigger than just the landscape of bodybuilding and he debuted on screen as \"Arnold Strong\" in the low budget Hercules in New York (1970), then director Bob Rafelson cast Arnold in Stay Hungry (1976) alongside Jeff Bridges and Sally Field, for which Arnold won a Golden Globe Award for \"Best Acting Debut in a Motion Picture\". The mesmerizing Pumping Iron (1977) covering the 1975 Mr Olympia contest in South Africa has since gone on to become one of the key sports documentaries of the 20th century, plus Arnold landed other acting roles in the comedy The Villain (1979) opposite Kirk Douglas, and he portrayed Mickey Hargitay in the well- received TV movie The Jayne Mansfield Story (1980). What Arnold really needed was a super hero / warrior style role in a lavish production that utilized his chiseled physique, and gave him room to show off his growing acting talents and quirky humor. Conan the Barbarian (1982) was just that role. Inspired by the Robert E. Howard short stories of the \"Hyborean Age\" and directed by gung ho director John Milius, and with a largely unknown cast, save Max von Sydow and James Earl Jones, \"Conan\" was a smash hit worldwide and an inferior, although still enjoyable sequel titled Conan the Destroyer (1984) quickly followed. If \"Conan\" was the kick start to Arnold's movie career, then his next role was to put the pedal to the floor and accelerate his star status into overdrive. Director James Cameron had until that time only previously directed one earlier feature film titled Piranha Part Two: The Spawning (1981), which stank of rotten fish from start to finish. However, Cameron had penned a fast paced, science fiction themed film script that called for an actor to play an unstoppable, ruthless predator - The Terminator (1984). Made on a relatively modest budget, the high voltage action / science fiction thriller The Terminator (1984) was incredibly successful worldwide, and began one of the most profitable film franchises in history. The dead pan phrase \"I'll be back\" quickly became part of popular culture across the globe. Schwarzenegger was in vogue with action movie fans, and the next few years were to see Arnold reap box office gold in roles portraying tough, no-nonsense individuals who used their fists, guns and witty one-liners to get the job done. The testosterone laden Commando (1985), Raw Deal (1986), Predator (1987), The Running Man (1987) and Red Heat (1988) were all box office hits and Arnold could seemingly could no wrong when it came to picking winning scripts. The tongue-in-cheek comedy Twins (1988) with co-star Danny DeVito was a smash and won Arnold new fans who saw a more comedic side to the muscle- bound actor once described by Australian author / TV host Clive James as \"a condom stuffed with walnuts\". The spectacular Total Recall (1990) and \"feel good\" Kindergarten Cop (1990) were both solid box office performers for Arnold, plus he was about to return to familiar territory with director James Cameron in Terminator 2: Judgment Day (1991). The second time around for the futuristic robot, the production budget had grown from the initial film's $6.5 million to an alleged $100 million for the sequel, and it clearly showed as the stunning sequel bristled with amazing special effects, bone-crunching chases & stunt sequences, plus state of the art computer-generated imagery. Terminator 2: Judgment Day (1991) was arguably the zenith of Arnold's film career to date and he was voted \"International Star of the Decade\" by the National Association of Theatre Owners. Remarkably, his next film Last Action Hero (1993) brought Arnold back to Earth with a hard thud as the self-satirizing, but confusing plot line of a young boy entering into a mythical Hollywood action film confused movie fans even more and they stayed away in droves making the film an initial financial disaster. Arnold turned back to good friend, director James Cameron and the chemistry was definitely still there as the \"James Bond\" style spy thriller True Lies (1994) co-starring Jamie Lee Curtis and Tom Arnold was the surprise hit of 1994! Following the broad audience appeal of True Lies (1994), Schwarzenegger decided to lean towards more family-themed entertainment with Junior (1994) and Jingle All the Way (1996), but he still found time to satisfy his hard-core fan base with Eraser (1996), as the chilling \"Mr. Freeze\" in Batman & Robin (1997) and battling dark forces in the supernatural action of End of Days (1999). The science fiction / conspiracy tale The 6th Day (2000) played to only mediocre fan interest, and Collateral Damage (2002) had its theatrical release held over for nearly a year after the tragic events of Sept 11th 2001, but it still only received a lukewarm reception. It was time again to resurrect Arnold's most successful franchise and, in 2003, Schwarzenegger pulled on the biker leathers for the third time for Terminator 3: Rise of the Machines (2003). Unfortunately, directorial duties passed from James Cameron to Jonathan Mostow and the deletion of the character of \"Sarah Connor\" aka Linda Hamilton and a change in the actor playing \"John Connor\" - Nick Stahl took over from Edward Furlong - making the third entry in the \"Terminator\" series the weakest to date. Schwarzenegger married TV journalist Maria Shriver in April, 1986 and the couple have four children. In October of 2003 Schwarzenegger, running as a Republican, was elected Governor of California in a special recall election of then governor Gray Davis. The \"Governator,\" as Schwarzenegger came to be called, held the office until 2011. Upon leaving the Governor's mansion it was revealed that he had fathered a child with the family's live-in maid and Shriver filed for divorce. Schwarzenegger contributed cameo roles to The Rundown (2003), Around the World in 80 Days (2004) and The Kid & I (2005). Recently, he starred in The Expendables 2 (2012), The Last Stand (2013), Escape Plan (2013), The Expendables 3 (2014), and Terminator Genisys (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDc4NzUyMV5BMl5BanBnXkFtZTcwMTQyMTc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000216","name":"Arnold Schwarzenegger","nicknames":["Arnie","Austrian Oak","Conan the Republican","Styrian Oak","The Governator","The Running Man","Conan the Governor","The Machine"],"idIMDB":"nm0000216"},"actorId":"nm0000216","character":"Trench","urlCharacter":"http://www.imdb.com/character/ch0186713","main":true},{"actorName":"Mel Gibson","urlProfile":"http://www.imdb.com/name/nm0000154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1956","placeOfBirth":" Peekskill, New York, USA","birthName":"Mel Columcille Gerard Gibson","height":"5' 9¾\" (1.77 m)","bio":"Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York, USA, as the sixth of eleven children of Hutton Gibson, a railroad brakeman, and Anne Patricia (Reilly) Gibson (who died in December of 1990). His mother was Irish, from County Longford, while his American-born father is of mostly Irish descent. Mel and his family moved to Australia in the late 1960s, settling in New South Wales, where Mel's paternal grandmother, contralto opera singer Eva Mylott, was born. After high school, Mel studied at the University of New South Wales in Sydney, performing at the National Institute of Dramatic Arts alongside future film thespians Judy Davis and Geoffrey Rush. After college, Mel had a few stints on stage and starred in a few TV shows. Eventually, he was chosen to star in Mad Max (1979) and in a movie called Tim (1979), co-starring Piper Laurie. The small budgeted movie Mad Max (1979) made him known worldwide, while Tim (1979) garnered him an award for Best Actor from the Australian Film Institute (equivalent to the Oscar). Later, he went on to star in Gallipoli (1981), which earned him a second award for Best Actor from the AFI. In 1980, he married Robyn Moore and had seven children. In 1984, Mel made his American debut in The Bounty (1984), which co-starred Anthony Hopkins. Then in 1987, Mel starred in what would become his signature series, Lethal Weapon (1987), in which he played \"Martin Riggs\". In 1990, he took on the interesting starring role in Hamlet (1990), which garnered him some critical praise. He also made the more endearing Forever Young (1992) and the somewhat disturbing The Man Without a Face (1993). 1995 brought his most famous role as \"Sir William Wallace\" in Braveheart (1995), for which he won two Oscars for Best Picture and Best Director. From there, he made such box office hits as The Patriot (2000), Ransom (1996), and Payback (1999). Today, Mel remains an international superstar mogul, continuously topping the Hollywood power lists as well as the Most Beautiful and Sexiest lists.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000154","name":"Mel Gibson","idIMDB":"nm0000154"},"actorId":"nm0000154","character":"Stonebanks","urlCharacter":"http://www.imdb.com/character/ch0402449","main":true},{"actorName":"Wesley Snipes","urlProfile":"http://www.imdb.com/name/nm0000648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4Mzk4MDk2NV5BMl5BanBnXkFtZTYwODgxNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1962","placeOfBirth":" Orlando, Florida, USA","birthName":"Wesley Trent Snipes","height":"5' 9\" (1.75 m)","bio":"Wesley Trent Snipes was born in Orlando, Florida, to Maryann (Long), a teacher's assistant, and Wesley Rudolph Snipes, an aircraft engineer. He grew up on the streets of the South Bronx in New York City, where he very early decided that the theater was to be his career. He attended the High School for the Performing Arts (popularized in Fame (1980)). But dreams of the musical theater (and maybe a few commercials) faded when his mother moved to Orlando, Florida before he could graduate from high school. But after graduation from a Florida high school he appeared in local dinner theaters and regional productions. An agent saw him in a competition and got him his first movie role with Goldie Hawn in Wildcats (1986). Athletic roles such as that gave way to tough guy roles as in New Jack City (1991), and to the action hero in Passenger 57 (1992). Wesley feels that at least with the Hollywood heavyweights he must be doing something right - Sylvester Stallone, Robert De Niro, Dennis Hopper and Sean Connery all had veto power over casting and all approved his role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4Mzk4MDk2NV5BMl5BanBnXkFtZTYwODgxNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000648","name":"Wesley Snipes","idIMDB":"nm0000648"},"actorId":"nm0000648","character":"Doc","urlCharacter":"http://www.imdb.com/character/ch0418853","main":true},{"actorName":"Dolph Lundgren","urlProfile":"http://www.imdb.com/name/nm0000185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1957","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Hans Lundgren","height":"6' 5\" (1.96 m)","bio":"Dolph Lundgren was born in Stockholm, Sweden, to Sigrid Birgitta (Tjerneld), a language teacher, and Karl Johan Hugo Lundgren, an engineer and economist for the Swedish government. He lived in Stockholm until the age of 13, when he moved in with his grandparents in Nyland, Ångermanland, Sweden. Despite an early interest in music and the fine arts, Dolph decided to follow in his father's footsteps and pursue an Engineering degree. After having completed his military service, he enrolled at the Royal Institute of Technology in Stockholm. It was in the military when Dolph first came in contact with the martial arts. Five years later, Dolph had become a World-Class competitor in Japanese Karate and was deeply involved with a discipline that was to become an important part of his life. After graduating High School, Dolph spent considerable time studying in the United States and abroad on various academic scholarships. He attended Washington State University and Clemson University in South Carolina. In 1982, he received a scholarship to complete his Masters Degree in Chemical Engineering at the University of Sydney, Australia. In 1983, he was awarded a Fulbright scholarship to the Massachusetts Institute of Technology in Boston, one of the world's top engineering schools. That same year, Dolph decided to move to New York City and take up acting. He started studying drama at the Warren Robertson Theatre Workshop in Manhattan, not knowing how quickly his life was about to change. Dolph's motion picture debut came in the \"James Bond\" feature, A View to a Kill (1985). However, it was his performance in Rocky IV (1985) later that year that definitely got him noticed. After a 9-month audition process among 5,000 hopefuls, he was cast opposite writer-director Sylvester Stallone, as his Russian opponent, \"Ivan Drago\". Following the success of Rocky IV (1985), Lundgren moved to Los Angeles and has since starred in more than thirty feature films. Lundgren portrayed the classic action-heroic lead in such films as Gary Goddard's Masters of the Universe (1987), Showdown in Little Tokyo (1991) co-starring Brandon Lee and Blackjack (1998), by Hong-Kong action legend, John Woo. Lundgren has also continued to turning in memorable performances as the main adversary to other action-stars, most notably in Universal Soldier (1992) opposite Jean-Claude Van Damme, directed by Roland Emmerich, as well as Robert Longo's Johnny Mnemonic (1995) opposite Keanu Reeves. In February 2004, Dolph Lundgren directed his first feature film, the thriller The Defender (2004), in which he also starred. In 2005, he directed and starred in yet another feature, The Russian Specialist (2005) (a.k.a \"The Russian Specialist\"). In January 2006, he finished principal photography of The Final Inquiry (2006), an Italian/American/Spanish co-production, directed by Giulio Base, in which he played against, amongst others, Daniele Liotti, Max von Sydow and F. Murray Abraham. In the fall 2006, Lundgren starred in Diamond Dogs (2007), a Chinese/American co-production filmed on location in Mongolia. In the Spring 2007, he directed a modern day western shot in Texas, Missionary Man (2007). In 2009, he completed two new directorial efforts, the action-packed Command Performance (2009), which showcases Lundgren's longtime musical talents as a drummer; and the neo-noir thriller The Killing Machine (2010). Lundgren also reunited with co-stars Jean-Claude Van Damme and Sylvester Stallone for Universal Soldier: Regeneration (2009) and the highly anticipated action blockbuster, The Expendables (2010). Dolph has managed to not let his Hollywood career stand in the way of his athletic background. He has been awarded his Third Degree Black Belt by the World Karate Organization in Tokyo. His accomplishments include being the Captain of the Swedish National Karate Team, as well as a Champion of the Swedish, European and Australian Heavyweight Division titles. Lundgren still regularly performs Karate exhibitions at international tournaments worldwide. In addition to his Karate expertise, Dolph was selected by the U.S. Olympic Committee to serve as the Team Leader of the 1996 U.S. Olympic Pentathlon Team during the Atlanta Games. He is actively involved in promoting the image of this sport. Lundgren's production company, Thor Pictures, is developing several projects in which he will produce, star and/or direct. He is also a founding member of \"Group of Eight\", a New York theater group started in 1994. Lundgren has also been working on a fitness book and sports wear line for men, the creation and launch of a new Dolph Lundgren brand, a licensing, media and publishing program and the development of future entertainment and media projects. Lundgren is married to Anette Qviberg-Lundgren, an interior decorator and fashion designer. The couple, along with their two daughters, resides in Marbella, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000185","name":"Dolph Lundgren","idIMDB":"nm0000185"},"actorId":"nm0000185","character":"Gunner Jensen","urlCharacter":"http://www.imdb.com/character/ch0128912","main":true},{"actorName":"Randy Couture","urlProfile":"http://www.imdb.com/name/nm1330276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDkwMTI5OV5BMl5BanBnXkFtZTgwMjQ3NzI4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1963","placeOfBirth":" Everett, Washington, USA","birthName":"Randy Duane Couture","height":"6' 0½\" (1.84 m)","bio":"Randy Couture is a collegiate wrestler and fighter turned actor from Everett, Washington. He served as a four time US Olympic wrestling team alternate as a soldier in the U.S. Army, and is also a 6 time world heavyweight and light heavyweight UFC champion and Hall of Famer. He is a graduate of Oklahoma State University with a bachelor's degree in foreign language literature and is also fluent in German. Randy's current girlfriend is actress Mindy Robinson. He is best known for starring in all three of The Expendables, Ambushed, and The Scorpion King 2.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDkwMTI5OV5BMl5BanBnXkFtZTgwMjQ3NzI4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1330276","name":"Randy Couture","nicknames":["The Natural","Captain America"],"idIMDB":"nm1330276"},"actorId":"nm1330276","character":"Toll Road","urlCharacter":"http://www.imdb.com/character/ch0165270","main":true},{"actorName":"Terry Crews","urlProfile":"http://www.imdb.com/name/nm0187719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1968","placeOfBirth":" Flint, Michigan, USA","birthName":"Terrence Alan Crews","height":"6' 3¼\" (1.91 m)","bio":"Terry Crews was born in Flint, Michigan, to Patricia and Terry Crews, Sr. He earned an Art Excellence Scholarship to attend Western Michigan University and also earned a full-ride athletic scholarship to play football. Crews was an All-Conference defensive end, and was a major contributor on the 1988 MAC champion WMU Broncos. His college success was rewarded in 1991, when he was drafted by the NFL's Los Angeles Rams. Crews played six years in the NFL, with stints at the L.A. Rams, San Diego Chargers , Rhein Fire (NFL Europe-Germany), Washington Redskins and Philadelphia Eagles. While in the NFL, used his art talent by painting a line of NFL licensed lithographs for Sierra Sun Editions. In 1996, Crews co-wrote and co-produced the independent feature film, \"Young Boys Incorporated\" (1996). Crews retired from the NFL in 1997 and moved to Los Angeles to pursue an acting career. Crews' first break came in 1999, when he auditioned for the extreme sports show called Battle Dome (1999), with other actor-athletes from around the country. Crews was chosen to be a series regular, known as the urban warrior, \"T-Money\". In 2000, Crews made his big screen debut in The 6th Day (2000). Since then, he has landed roles in Au service de Sara (2002), Friday After Next (2002), Deliver Us from Eva (2003), Malibu's Most Wanted (2003), Starsky & Hutch (2004), Soul Plane (2004), White Chicks (2004), and the Mike Judge film, Idiocracy (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187719","name":"Terry Crews","idIMDB":"nm0187719"},"actorId":"nm0187719","character":"Caesar","urlCharacter":"http://www.imdb.com/character/ch0186714","main":true},{"actorName":"Kelsey Grammer","urlProfile":"http://www.imdb.com/name/nm0001288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjkxODM5N15BMl5BanBnXkFtZTcwMTU3NDE1Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1955","placeOfBirth":" St. Thomas, U.S. Virgin Islands","birthName":"Allen Kelsey Grammer","height":"6' 1\" (1.85 m)","bio":"A five-time Emmy Award winner, Kelsey Grammer was born in Saint Thomas, U.S. Virgin Islands, to Sally (Cranmer), a singer, and Frank Allen Grammer, Jr., a musician and restaurateur. He was raised in New Jersey and Florida. Grammer was drawn to the works of William Shakespeare and spent two years at the prestigious Juilliard School. He then dove into the world of regional theater, eventually making the leap to Broadway with roles in \"Macbeth\" and \"Othello\". He joined the cast of the situation comedy Cheers (1982) in 1984. Grammer is the first actor in television history to receive multiple Emmy nominations for performing the same role on three series. He received two nominations for his original portrayal of Dr. Frasier Crane on Cheers (1982), another for his guest appearance in that role on Wings (1990), and nine nominations (earning four awards) as Outstanding Actor for his work on Frasier (1993). Over the years, Dr. Frasier Crane has become one of television's most endearing and enduring characters. In addition to his Emmy Awards, Grammer has won two Golden Globe Awards, two American Comedy Awards and a People's Choice Award for his portrait. Grammer's distinctive voice has been heard in several hit animated features, including the voice of Stinky Pete in Disney's hit Toy Story 2 (1999) and a role in Anastasia (1997). On television, he has also been seen in several mini-series and movies. In 1996, he hosted an hour-long salute to Jack Benny for which he served as executive producer. He also starred in HBO's award-winning comedy The Pentagon Wars (1998). Grammer's autobiography, \"So Far\", was published in fall 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjkxODM5N15BMl5BanBnXkFtZTcwMTU3NDE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001288","name":"Kelsey Grammer","idIMDB":"nm0001288"},"actorId":"nm0001288","character":"Bonaparte","urlCharacter":"http://www.imdb.com/character/ch0441328","main":true},{"actorName":"Glen Powell","urlProfile":"http://www.imdb.com/name/nm1412974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E5NzFmNTMtZWJiMi00YmMxLWExZGEtMjY5MGE4YTgxNTdmXkEyXkFqcGdeQXVyNDg0MzQyNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1988","placeOfBirth":" Austin, Texas, USA","height":"6' (1.83 m)","bio":"Glen Powell was born on October 21, 1988 in Austin, Texas, USA. He is an actor and producer, known for The Dark Knight Rises (2012), Hidden Figures (2016) and Everybody Wants Some!! (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E5NzFmNTMtZWJiMi00YmMxLWExZGEtMjY5MGE4YTgxNTdmXkEyXkFqcGdeQXVyNDg0MzQyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1412974","name":"Glen Powell","idIMDB":"nm1412974"},"actorId":"nm1412974","character":"Thorn","urlCharacter":"http://www.imdb.com/character/ch0441325","main":true},{"actorName":"Antonio Banderas","urlProfile":"http://www.imdb.com/name/nm0000104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ3NTYyNF5BMl5BanBnXkFtZTcwMTY2NjIzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1960","placeOfBirth":" Málaga, Málaga, Andalucía, Spain","birthName":"José Antonio Domínguez Banderas","height":"5' 8½\" (1.74 m)","bio":"Antonio Banderas, one of Spain's most famous faces, was a soccer player until breaking his foot at the age of fourteen; he is now an international film star known for playing Zorro in the eponymous film series. He was born José Antonio Domínguez Banderas on August 10, 1960, in Málaga, Andalusia, Spain. His father, Jose Dominguez, was a policeman in the Spanish civil guards. His mother, Doña Ana Banderas Gallego, was a school teacher. Young Banderas was brought up a Roman Catholic. He wanted to play soccer professionally and made much success playing for his school team until the age of 14, albeit his dream ended when he broke his foot. At that time he developed a passion for theatre after seeing the stage production of 'Hair'. Banderas began his acting studies at the School of Dramatic Art in Málaga, and made his acting debut at a small theatre in Málaga. He was arrested by the Spanish police for performance in a play by Bertolt Brecht, because of political censorship under the rule of General Francisco Franco. Banderas spent a whole night at the police station, he had three or four such arrests while he was working with a small theatre troupe that toured all over Spain and was giving performances in small town theatres and on the street. In 1979, at the age of 19, he moved to Madrid in pursuit of an acting career. Being a struggling young actor, he also worked as a waiter and took small modeling jobs. At that time he joined the troupe at the National Theatre of Spain, becoming the youngest member of the company. Banderas's stage performances caught the attention of film director Pedro Almodóvar, who cast the young actor in his film debut Labyrinth of Passion (1982). Banderas and Almodovar joined forces in making innovative and sexually provocative movies during the 1980s. In 1984 Banderas made headlines in Spain with his performance as a gay man, making his first male-to-male on-screen kiss in Almodovar's La loi du désir (1987). Banderas's long and fruitful collaboration with Pedro Almodóvar eventually prepared him for international recognition that came with his work in the Academy Award-nominated film Women on the Verge of a Nervous Breakdown (1988). In 1991 he appeared as an object of Madonna's affection in Madonna: Truth or Dare (1991). In 1992 Banderas made his Hollywood debut with Les mambo kings (1992). Because he did not speak English at that time, his dialogue for the film was taught to him phonetically. Banderas shot to international fame with his sensitive performance as a lover of Tom Hanks' AIDS-infected lawyer in Philadelphia (1993), then played opposite Tom Cruise and Brad Pitt in Interview with the Vampire: The Vampire Chronicles (1994). Banderas further established himself as one of Hollywood's leading men after co-starring in Evita (1996) opposite Madonna in the title role. In 1998 he won acclaim for his portrayal of Zorro, opposite Anthony Hopkins and Catherine Zeta-Jones, in The Mask of Zorro (1998). For the role as Zorro Banderas took training with the Olympic national fencing team in Spain, and practiced his moves with real steel swords, then he used the lighter aluminum swords in the movie. He also took a month-long course of horse-riding before the filming. He later returned to the role in The Legend of Zorro (2005). In 1999 Banderas made his directorial debut in La tête dans le carton à chapeaux (1999), starring his wife, Melanie Griffith. He received critical acclaim for his portrayal of Mexican artist David Alfaro Siqueiros opposite Salma Hayek in Frida (2002). He voiced Puss in Boots in the Shrek franchise. Banderas established himself as internationally known Latin heartthrob with charismatic looks, and was chosen as one of the 50 most beautiful people in the world by the People magazine in 1996. He won numerous awards and nominations for his works in film, including three ALMA awards and three Golden Globe nominations, among many other. From 1996 to 2014, Banderas was married to American actress Melanie Griffith and the couple have one daughter Stella born in 1996. Outside of his acting profession, Banderas has been a passionate soccer fan and a staunch supporter of the Real Madrid Football Club. He shares time between his two residencies, one is in the United States, and one in the South of Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ3NTYyNF5BMl5BanBnXkFtZTcwMTY2NjIzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000104","name":"Antonio Banderas","idIMDB":"nm0000104"},"actorId":"nm0000104","character":"Galgo","urlCharacter":"http://www.imdb.com/character/ch0418854","main":true},{"actorName":"Victor Ortiz","urlProfile":"http://www.imdb.com/name/nm4244770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTQwNzA2NF5BMl5BanBnXkFtZTgwNjIyMDYxODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Victor Ortiz is an actor, known for Southpaw (2015), The Expendables 3 (2014) and Dancing with the Stars (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTQwNzA2NF5BMl5BanBnXkFtZTgwNjIyMDYxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4244770","name":"Victor Ortiz","idIMDB":"nm4244770"},"actorId":"nm4244770","character":"Mars","urlCharacter":"http://www.imdb.com/character/ch0441324","main":true},{"actorName":"Ronda Rousey","urlProfile":"http://www.imdb.com/name/nm3313925","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzOTYwODY4NF5BMl5BanBnXkFtZTgwNzI2ODY4NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1987","placeOfBirth":" Riverside, California, USA","birthName":"Ronda Jean Rousey","height":"5' 7\" (1.7 m)","bio":"Ronda Rousey burst onto the women's MMA scene in August of 2010. Born in Riverside County, California on February 1, 1987 to parents Ron Rousey and AnnMaria DeMars, little Ronda was born with an umbilical cord wrapped around her neck that damaged her vocal cords. She didn't speak coherently until the age of six. Ronda was a self-professed tomboy and swam from the ages of 6 to 10. She competed on the Jr. Olympic swim team where she placed in the state level. Because of her mother, a 7th degree black belt and 1984 World Judo Champion, Ronda took up the sport. She had a hard time socializing with other kids and found that Judo gave her confidence. She holds a 4th degree black belt in the martial art. Ronda's Judo career is a storied one. At 17 she became the youngest judoka in the 2004 Olympic Games in Athens. That same year she won a gold medal at the World Junior Judo Championships in Budapest, and in 2006 she became the first U.S. female in almost 10 years to win an A-Level tournament going 5-0 to clench the gold at the World Cup in Great Britain. At 19 she won the bronze medal at the Junior World Championships. She is the first U.S. athlete to win two Junior World Medals. In 2007 she added a silver at the World Judo Championships and a gold at the Pan American Games. The pinnacle of her Judo career was a bronze at the 2008 Olympic Games in Beijing. Rousey became the first American to win an Olympic medal in women's Judo since it became an Olympic sport in 1992. After medaling in the Olympics, Ronda's career hit a dead end. She did some bartending to make ends meet and tried to find a better paying job, but it was tough finding anyone that needed her particular skill set. Throwing people down and putting them in armbars aren't really something you can put on a resume. By chance Ronda caught the Gina Carano vs. Julie Kedzie fight on television and things changed. She made her mixed martial arts debut as an amateur in 2010. Since then she has never lost a fight, winning the majority in the first round by armbar submission. Ronda took it upon herself to chase after and demand attention so that the UFC could no longer ignore women fighters. UFC President Dana White had publicly stated that women would never be allowed to fight in the UFC, but on February 23, 2013, Ronda did just that. She won the fight against Liz Carmouche in the first round with her signature armbar and became the first UFC Women's Bantamweight Champion. In 2014, Ronda appeared in her first motion picture - The Expendables 3 (2014). Other projects are Furious 7 (2015) and The Athena Project as well as Entourage (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzOTYwODY4NF5BMl5BanBnXkFtZTgwNzI2ODY4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3313925","name":"Ronda Rousey","nicknames":["Rowdy","The Rowdy One","Rowdy Ronda","The Arm Collector"],"idIMDB":"nm3313925"},"actorId":"nm3313925","character":"Luna","urlCharacter":"http://www.imdb.com/character/ch0441327","main":true},{"actorName":"Kellan Lutz","urlProfile":"http://www.imdb.com/name/nm1553725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjM2NTM5ZTQtNDQ1OC00MTNmLTkzZDUtNDVkOGEwNzRjMWMwXkEyXkFqcGdeQXVyMjQ5MTc1NzY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1985","placeOfBirth":" Dickinson, North Dakota, USA","birthName":"Kellan Christopher Lutz","height":"6' 1\" (1.85 m)","bio":"Actor and model Kellan Lutz was born in Dickinson, North Dakota, to Karla (Theesfeld) and Bradley Lutz. He has six brothers and a sister, and is of German, as well as smaller amounts of English, Swedish, and Dutch, descent. As a child, his family moved around, and he grew up in North Dakota, the Midwest and Arizona. Upon high school graduation, Lutz relocated to California to attend Chapman University and study Chemical Engineering, but left in order to pursue a career in acting. Lutz had picked up a few modeling jobs as a teenager, but got his first TV break with a small role in Amour, gloire et beauté (1987) in 2004. More television success followed, including parts in The Comeback (2005) and Generation Kill (2008). He was also cast in some film roles, including Accepted (2006) and Prom Night (2008), but his major break came in 2008 when he won the role of vampire Emmett Cullen in the smash hit Twilight (2008), and its subsequent sequels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjM2NTM5ZTQtNDQ1OC00MTNmLTkzZDUtNDVkOGEwNzRjMWMwXkEyXkFqcGdeQXVyMjQ5MTc1NzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1553725","name":"Kellan Lutz","idIMDB":"nm1553725"},"actorId":"nm1553725","character":"Smilee","urlCharacter":"http://www.imdb.com/character/ch0418855","main":true}],"seasons":[],"idIMDB":"tt2333784","urlIMDB":"http://www.imdb.com/title/tt2333784","business":{"budget":{"money":"$90,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"HUF 56,460,465","country":"Hungary","day":"31","month":"08","year":"2014","remarks":""},{"money":"PHP 18,540,381","country":"Philippines","day":"17","month":"08","year":"2014","remarks":"90 Screens"}],"gross":[{"money":"$38,988,855","country":"USA","day":"28","month":"09","year":"2014","remarks":""},{"money":"$33,139,000","country":"USA","day":"31","month":"08","year":"2014","remarks":""},{"money":"$204,200,583","country":"Worldwide","day":"15","month":"10","year":"2014","remarks":""},{"money":"PHP 25,323,784","country":"Philippines","day":"24","month":"08","year":"2014","remarks":""},{"money":"PHP 18,540,381","country":"Philippines","day":"17","month":"08","year":"2014","remarks":""}],"weekendGross":[{"money":"$71,011","country":"USA","day":"28","month":"09","year":"2014","remarks":"232 Screens"},{"money":"$3,500,000","country":"USA","day":"31","month":"08","year":"2014","remarks":"2,564 Screens"},{"money":"PHP 4,392,000","country":"Philippines","day":"24","month":"08","year":"2014","remarks":"25 Screens"},{"money":"PHP 18,540,381","country":"Philippines","day":"17","month":"08","year":"2014","remarks":"90 Screens"}],"admissions":[{"money":"184,583","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"08","year":"2013","remarks":null},{"money":null,"country":null,"day":"25","month":"10","year":"2013","remarks":null}],"copyrightHolder":"© 2014 EX3 PRODUCTIONS, INC."},"technical":{"runtime":["2 hr 6 min (126 min)","2 hr 11 min (131 min) (unrated)"],"soundMix":["Dolby Atmos","Datasat","Dolby Digital","Auro 11.1"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic, Zeiss Super Speed, Fujinon Alura and Premier Lenses","Red Scarlet, Zeiss Super Speed, Fujinon Alura and Premier Lenses"],"laboratory":["LightIRON Digital, Los Angeles (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Redcode RAW (4K) (5K) (source format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"6.1","metascore":"35","filmingLocations":[{"location":"New Boyana Film Studios, Sofia, Bulgaria"}],"rated":"PG-13","awards":[{"award":"Golden Schmoes Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Action Sequence of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Summer 2014 Blockbuster Poster","names":[{"name":"Lionsgate","id":null,"role":null},{"name":"Ignition Creative","id":null,"role":null}]}]}]},{"award":"Razzie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Razzie Award","categories":[{"category":"Worst Supporting Actor","names":[{"name":"Kelsey Grammer","id":"nm0001288","role":null},{"name":"Legends of Oz: Dorothy's Return","id":"tt0884726","role":null},{"name":"Think Like a Man Too","id":"tt2239832","role":null},{"name":"Transformers: Age of Extinction","id":"tt2109248","role":null}]}]},{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actor","names":[{"name":"Mel Gibson","id":"nm0000154","role":null}]},{"category":"Worst Supporting Actor","names":[{"name":"Arnold Schwarzenegger","id":"nm0000216","role":null}]}]}]}],"votes":"135,736","type":"Movie","companyCreditsSimple":[{"idCompany":"co0173285","name":"Lionsgate"},{"idCompany":"co0002572","name":"Millennium Films"},{"idCompany":"co0024720","name":"Nu Image / Millennium Films"}],"keywords":{"keywords":["pg 13 sequel to r rated franchise","mission","rescue","battle","fight","bucharest","has been","hospital","arms dealer","cia","bomb","death","train","view through camera viewfinder","art museum","mogadishu","romania","die hard scenario","building demolition","hanging from a rope","uh 1 huey helicopter","m 48 patton tank","duct tape gag","smoking a pipe","juarez mexico","woman wearing a miniskirt","female bouncer","apache junction arizona","gulfstream 150 business jet","grand teton wyoming","mk. 82 snake eye 500 pound bomb","car rollover","woman wearing a red dress","rocket propelled grenade","eurocopter dauphin","new york night cityscape","gantry crane","zodiac boat","minigun","shaving with a knife","jumping on a moving vehicle","antonov an 30","helicopter explosion","anti aircraft gun","train crash","finger ring","bo 105 bolkow helicopter","year 2014","21st century","2010s","playing against type","final showdown","terrorism","terrorist","fictional war","returning character killed off","bulletproof vest","bombardment","ghost town","shot through a window","forest","woods","commando raid","woman punches a man","sociopath","anti hero","body count","silencer","flashlight","wisecrack humor","sewer","van","parachute","jumping from an airplane","undercover","timebomb","race against time","surveillance","collapsing building","elevator shaft","painting","waterfall","one against many","construction site","one liner","computer cracker","product placement","power outage","ambush","hidden camera","shooting range","target practice","montage","karaoke","cell phone","martial artist","bare knuckle fighting","underwater scene","scar","shipping container","parkour","warehouse","docks","ship","pirate","rubber boat","betrayal","deception","friendship","war veteran","ex soldier","ex marine","air force base","mexico","moscow russia","bucharest romania","new york city","wyoming","helicopter crash","dog tag","mogadishu somalia","gadget","bound and gagged","breaking bottle over head","slow motion scene","crashing through a window","cigar smoking","cigarette smoking","falling from height","beret","prison break","jail cell","prisoner","prison guard","russian","subtitled scene","helicopter chase","car chase","bodyguard","albanian mafia","gangster","mafia boss","crime boss","tracking device","showdown","swimming pool","quick draw","abandoned hotel","armored car","car accident","car crash","motorcycle stunt","motorcycle","tank","helicopter","pilot","airplane","war criminal","photograph","airfield","nightclub","bar","mansion","hotel","art gallery","redemption","revenge","cia agent","knife fight","knife throwing","threatened with a knife","knife","honor","opening action scene","black comedy","held at gunpoint","hostage","kidnapping","rescue mission","presumed dead","c4 explosives","hand grenade","cannon","rocket launcher","grenade launcher","tattoo","bare chested male","gatling gun","sniper rifle","shotgun","uzi","camera","night vision binoculars","ak 47","assault rifle","machine gun","comic relief","gun fu","dual wield","revolver","pistol","culture clash","commando mission","commando unit","commando","no opening credits","special forces","army","soldier","mercenary","exploding tank","exploding train","exploding building","exploding helicopter","exploding truck","exploding car","explosion","violence","beating","head butt","murder","tough girl","warrior","tough guy","action hero","knife in chest","throat slitting","neck breaking","stabbed in the back","stabbed in the chest","shot to death","shot in the leg","shot in the back","shot in the chest","shot in the head","combat","battlefield","gunfight","shootout","woman kills a man","woman fights a man","man fights a woman","kicked in the crotch","punched in the face","punched in the chest","stylized violence","brawl","fistfight","hand to hand combat","mixed martial arts","martial arts","third part","sequel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:48:11"}}