{"data":{"movies":[{"title":"Lap Dance","originalTitle":"","year":"2014","releaseDate":"20141205","directors":[{"name":"Greg Carter","id":"nm0141646"}],"writers":[{"name":"Greg Carter","id":"nm0141646"},{"name":"Greg Carter","id":"nm0141646"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NTc5NzgyOV5BMl5BanBnXkFtZTgwNzc1NTI2MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"An aspiring actress makes a pact with her fiancé to take a job as an exotic dancer to care for her cancer stricken father. Once the pact the couple made is broken, their lives are changed forever. Based on the true story of director Greg Carter and his girlfriend prior to their moving to Los Angeles in 2005.","simplePlot":"An aspiring actress makes a pact with her fiancé to take a job as an exotic dancer to care for her cancer stricken father. Once the pact the couple made is broken, their lives are changed forever. Based on the true story of director Greg Carter and his girlfriend prior to their moving to Los Angeles in 2005.","actors":[{"actorName":"James Remar","urlProfile":"http://www.imdb.com/name/nm0001664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzMwNjAyN15BMl5BanBnXkFtZTgwNDA5NTkyMDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1953","placeOfBirth":" Boston, Massachusetts, USA","birthName":"William James Remar","height":"5' 10\" (1.78 m)","bio":"James is a rugged, intense character player with leading man good looks. Having first gained recognition in 1979 as Ajax, in his second film, The Warriors (1979). That same year he garnered acclaim on Broadway with Richard Gere in the concentration camp drama \"Bent\". In a career spanning nearly four decades, James has run the gamut of roles and solid career choices. Ranging from the psychopaths, Dutch Schultz in 'Francis Copolla''s The Cotton Club (1984) and 'Albert Ganz' in Walter Hill's 48 Hrs. (1982) to Samantha's lover, the billionaire playboy, Richard Wright, in the HBO series Sex and the City (1998).\" James has also garnered roles which highlight a more vulnerable side, such as his guitarist who gets a break in the Oscar-winning short, Session Man (1991) or his artist who falls in love with a gargoyle come to life in the best segment of the horror anthology, Tales from the Darkside: The Movie (1990) and as Mary Louise Parker's lover in Boys on the Side. More recently James starred along side Michael C. Hall in the hit Showtime series Dexter (2006) where he played Dexter's wise, compassionate, adoptive father, Harry Morgan. Grey's Anatomy fans have recently enjoyed seeing James as Karev's long-lost Dad. While remaining active with top feature films James enjoys the distinction of being the only actor to die twice, as two different characters in Quentin Tarintino's smash hit Django Unchained. James won the 8th annual SAG award as a member of the Outstanding Comedy Ensemble for his work in Sex and the City. As a member of the ensemble cast of Dexter, James has been nominated for the SAG award and the Emmy. In recognition for his work in Sci-Fi Fantasy and Horror James was honored with the Saturn Lifetime Achievement Award in 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzMwNjAyN15BMl5BanBnXkFtZTgwNDA5NTkyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001664","name":"James Remar","idIMDB":"nm0001664"},"actorId":"nm0001664","character":"Patrick Moore","urlCharacter":"http://www.imdb.com/character/ch0374439","main":true},{"actorName":"Carmen Electra","urlProfile":"http://www.imdb.com/name/nm0001182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODAzODM2OV5BMl5BanBnXkFtZTcwMzE5OTE2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1972","placeOfBirth":" Sharonville, Ohio, USA","birthName":"Tara Leigh Patrick","height":"5' 2½\" (1.59 m)","bio":"Carmen Electra was born Tara Leigh Patrick on April 20, 1972 in Sharonville, Ohio, to Patricia Rose (Kincade), a singer, and Harry Stanley Patrick, an entertainer and guitarist. She is of mostly English, German, and Irish descent. She grew up near Cincinnati, Ohio and got her first boost when a scout for Prince spotted her fronting for a rap group in Los Angeles, California. She released a self-titled album for Prince's Paisley Park label in 1993. She then toured Europe as Prince's opening act on his 1992 Diamonds and Pearls Tour. Carmen later returned to work for Prince at his Los Angeles nightclub \"Glam Slam\". She performed there every weekend with the Erotic City dancers, led by choreographer and director Jamie King. In March 1997, she appeared in cartoon form as the model for a character who is a singer and a vampire (\"but a good vampire\", says her publicist) in a comic book series called \"Embrace\". Carmen later went to co-star on the television series Baywatch (1989) as lifeguard Lani McKenzie, and as host of MTV's game show Singled Out (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODAzODM2OV5BMl5BanBnXkFtZTcwMzE5OTE2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001182","name":"Carmen Electra","idIMDB":"nm0001182"},"actorId":"nm0001182","character":"Lexus","urlCharacter":"http://www.imdb.com/character/ch0374443","main":true},{"actorName":"Briana Evigan","urlProfile":"http://www.imdb.com/name/nm0263759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mzg1NzY3MV5BMl5BanBnXkFtZTcwMjU5NDE2OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Briana Barbara-Jane Evigan","height":"5' 6\" (1.68 m)","bio":"Briana Evigan was born on October 23, 1986 in Los Angeles, California, USA as Briana Barbara-Jane Evigan. She is an actress, known for Step Up 2: The Streets (2008), Step Up All In (2014) and Sorority Row (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mzg1NzY3MV5BMl5BanBnXkFtZTcwMjU5NDE2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0263759","name":"Briana Evigan","idIMDB":"nm0263759"},"actorId":"nm0263759","character":"Tasha","urlCharacter":"http://www.imdb.com/character/ch0374450","main":true},{"actorName":"Stacey Dash","urlProfile":"http://www.imdb.com/name/nm0001107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMwNzY2MTQ4Ml5BMl5BanBnXkFtZTgwMzQ3NTgyMTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1967","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Stacey Lauretta Dash","height":"5' 5\" (1.65 m)","bio":"Stacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show (1984), The Fresh Prince of Bel-Air (1990), and also St. Elsewhere (1982). At 21 she made her feature film debut in Enemy Territory (1987), which was quickly followed by Moving (1988), in which she played Richard Pryor's teenage daughter. Four years later she was in Mo' Money (1992), with Damon Wayans. In 1994 she starred with Mark Wahlberg in Renaissance Man (1994). In 1995 she did the provocative erotic thriller Illegal in Blue (1995) and later that year got her big break when was cast as Dionne in the hit comedy Clueless (1995). She went on to star in the UPN sitcom Clueless (1996) that was based on the movie, and which lasted for two years. During that time she completed Oliver Stone's Cold Around the Heart (1997) and also the independent film Personals (1999). After leaving \"Clueless\" in 1999, Stacey seems to be moving along nicely. She has recently appeared in The Painting (2001) and Paper Soldiers (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMwNzY2MTQ4Ml5BMl5BanBnXkFtZTgwMzQ3NTgyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001107","name":"Stacey Dash","idIMDB":"nm0001107"},"actorId":"nm0001107","character":"Dr. Annie Jones","urlCharacter":"http://www.imdb.com/character/ch0374447","main":true},{"actorName":"Lynn Whitfield","urlProfile":"http://www.imdb.com/name/nm0005551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MTU0NTg0Ml5BMl5BanBnXkFtZTcwOTYxMTQ5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1953","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Lynn Butler-Smith","height":"5' 5\" (1.65 m)","bio":"With roots that lead back to Louisiana southern aristocracy, lovely leading lady Lynn Whitfield was born in 1953, the eldest of four children and a third-generation BFA graduate from Howard University. Her dentist father was instrumental in developing Lynn's initial interest in acting as he was a prime figure in forming community theater in her native Baton Rouge. She is of African American and Native American descent, specifically Cherokee. First garnering attention on the stage by studying and performing with the Black Repertory Company in Washington, D.C, she married one of the company's co-founders and pioneers of black theatre, playwright/director/actor Vantile Whitfield in 1974. She eventually moved to New York and appeared off-Broadway in such shows as \"The Great Macdaddy\" and \"Showdown\" before earning acclaim in the 1977 Los Angeles production of the landmark black play \"For Colored Girls Who Have Considered Suicide...When the Rainbow Is Enuf\" co-starring Alfre Woodard. Lynn eventually became a force to be reckoned with intelligent and principled roles on quality film and TV as well Lynn's Hollywood career unfolded under a talent development program at Columbia Pictures in 1979. Appearing on such established TV shows as \"Hill Street Blues\" and in a 1982 PBS version of her \"For Colored Girls...\" stage hit, she made her film debut with Doctor Detroit (1983) and doled out a number of support roles in other popular films as well such as Silverado (1985), The Slugger's Wife (1985), Jaws: The Revenge (1987), and Dead Aim (1987). It was TV, however, that garnered her the most attention, working her way into top lead and co-star roles. The topical social dramas The George McKenna Story (1986) co-starring Denzel Washington, Johnnie Mae Gibson: FBI (1986) opposite Howard E. Rollins Jr. and Oprah Winfrey's historical miniseries The Women of Brewster Place (1989) were her early highlights. In addition, she found some steadier work on series TV playing classy professionals, including two for ABC (a doctor in Heartbeat (1988) and a news anchorwoman in Equal Justice (1990).) The peak of her acclaimed career arguably came in the form of highly popular but deeply troubled Follies Bergere headliner-turned civil rights activist Josephine Baker. In the HBO biopic The Josephine Baker Story (1991), Lynn played the legendary entertainer with Emmy-winning gusto, a role that stretched her to the limits as she played the role from age 18 to 68. Earning an NAACP Image Award in 1992 for her role in the miniseries Stompin' at the Savoy (1992), she later appeared in Pauly Shore's comedy In the Army Now (1994) and went back to series TV alongside Bill Cosby in the short-lived The Cosby Mysteries (1994). Lynn had an upsurge in the late 90s with roles in the films A Thin Line Between Love and Hate (1996) with Martin Lawrence and Gone Fishin' (1997) with \"Silverado\" co-star Danny Glover. She also earned excellent reviews for her supporting work in Eve's Bayou (1997), a role that drew on her Louisiana heritage. More quality TV came her way when she starred as Sophie in Sophie & the Moonhanger (1996), a mini-movie that focused on the relationship of the wife of a Klansman and her longtime black housekeeper. She kept up the momentum with an unsympathetic role in the Oprah Winfrey miniseries The Wedding (1998), where she again had to cover a long life span, this time from 19 to 47, and Redemption (2004) with Jamie Foxx, an urban film that chronicled the turbulent life of (now) imprisoned L.A. Crips gang founder Stan \"Tookie\" Williams. More recent turns have come with a recurring role in the series Without a Trace (2002), a part in an updated version of Clare Boothe Luce's The Women (2008) and a lead role opposite Ciara in the film Mama I Want to Sing (2011). Divorced from Vantile Whitfield in the late 70s, Lynn later married British director Brian Gibson in 1990, by whom she has a daughter, Grace. They parted ways in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MTU0NTg0Ml5BMl5BanBnXkFtZTcwOTYxMTQ5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005551","name":"Lynn Whitfield","idIMDB":"nm0005551"},"actorId":"nm0005551","character":"Momma Pearl","urlCharacter":"http://www.imdb.com/character/ch0374469","main":true},{"actorName":"Nia Peeples","urlProfile":"http://www.imdb.com/name/nm0001604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODMyMzA1NV5BMl5BanBnXkFtZTcwMDI3NjQ0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1961","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Virenia Gwendolyn Peeples","height":"5' 2\" (1.57 m)","bio":"Nia Peeples was born in Hollywood, California, on December 10, 1961. Her family moved to West Covina, California, where she and her two sisters, Paula and Cynthia, grew up. At eight years old she began performing with her family, giving concerts for community groups and conventions and doing dances of different cultures, Polynesian, Spanish and Irish. She attended West Covina High School and was an \"A\" student and a member of the marching band, involved in cheerleading, tumbling, volleyball, student government, choral singing and singing for a rock 'n roll band. She starred in the school production of \"South Pacific\" as Bloody Mary. She got her first standing ovation for her performance. She attended UCLA on a music scholarship, during which time she performed as Liberace's opening act in Las Vegas on weekends. She took one semester as a voice major, dropped out of UCLA and took three jobs in order to afford acting lessons. She studied singing with Gloria Rush and the Sanford Meisner acting technique at Playhouse West. She accompanied a friend to a rehearsal one day and was spotted by the producers, who cast her in the play \"Music Shop\". This led to guest appearances in such TV series as Hardcastle and McCormick (1983) and T.J. Hooker (1982). Her first starring role came when she played a deaf girl opposite William Atherton in the HBO film A Single Light (1981). She auditioned for and won the part of Nicole Chapman in the series Fame (1982). Her hobbies include hiking, tandem surfing, rollerblading and skiing. She also does a lot of charity work. She is of Scottish/Filipino descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODMyMzA1NV5BMl5BanBnXkFtZTcwMDI3NjQ0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001604","name":"Nia Peeples","idIMDB":"nm0001604"},"actorId":"nm0001604","character":"Kelly","urlCharacter":"http://www.imdb.com/character/ch0374453","main":true},{"actorName":"K.D. Aubert","urlProfile":"http://www.imdb.com/name/nm1147702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTc2NzU5YTMtYjRkNS00ODE4LTk5NWEtN2VjYjNjYjI2MjU3XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1978","placeOfBirth":" Shreveport, Louisiana, USA","birthName":"Karen Denise Aubert","height":"5' 10\" (1.78 m)","bio":"Model & Actress KD Aubert started her modeling career with LA Models in 2001. As a runway model working overseas, she soon ventured into print modeling with Elite models (LA) where she was thrust into major campaigns. Soon after KD entered into the world of commercials where again, she was lucky enough into land some very memorable campaigns. In 2002, while hosting the MTV show Kidnapped with Dave Holmes, she landed her first major role, not surprisingly on her first audition, in the cult classic Friday After Next, followed shortly after with a role in The Scorpion King. The following year she replaced a recurring actress on the hit show Buffy the Vampire Slayer (aka Nikki Wood). While shooting Buffy, KD landed a leading role in the movie Hollywood Homicide starring Harrison Ford and Josh Hatrnett. She has also starred on independent movies such as Dysenchanted (starring Jim Belushi) and Easy. KD also starred alongside Kevin Hart, Tom Arnold and many other superstars while on the comedy Soul Plane. After shooting what was one her favorite sci-fi movies Frankenfish in Mobile, Alabama, she returned to LA to snatch a guest star role on FOX's Bones. Life in Politics In 2007, while recording music and partly residing in Chicago, she volunteered at Obama headquarters where she met Arne Duncan and Rahm Emmanuel. As a Democrat, KD will always stand with the people, especially those less fortunate. KD feels what makes America great, is the way we have always been able to look out for one another and lend a helping hand. Charities KD enjoys working alongside some very influential non-profit organizations, such as Urban Born out of Los Angeles, and the Sickle Cell Disease Foundation of California. Two of KD's sisters live with the Sickle Cell Disease and the foundation truly helped from childhood to now. In addition, KD works closely with the Charlie Mack Foundation out of Philadelphia, PA. Will Smith and his dear friend, Charlie Mack, founded this foundation. Every year KD is called upon to travel to Philly to visit with kids who suffer from illnesses at local medical facilities. She visits young kids and teens that have been incarcerated as well as host fun events for the inner city youths. Hobbies Aubert's hobbies include: playing golf, tennis, watching CNN & MSNBC, traveling, eating exotic foods, writing songs, spending time with family, going to the batting cages, and fishing to name a few. Religion KD's religious views are called \"non-denominational\" with a Christian foundation. She attends a worship center called \"Agape\" which means unconditional love. \"We do not judge, we believe that we are all beautiful intelligent expressions of GOD here on this planet.\" - KD Aubert","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTc2NzU5YTMtYjRkNS00ODE4LTk5NWEtN2VjYjNjYjI2MjU3XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1147702","name":"K.D. Aubert","idIMDB":"nm1147702"},"actorId":"nm1147702","character":"Jade Lee","urlCharacter":"http://www.imdb.com/character/ch0374470","main":true},{"actorName":"Christian Keyes","urlProfile":"http://www.imdb.com/name/nm1828818","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTQ0NzU4MV5BMl5BanBnXkFtZTcwMTI5MjA5NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Christian Keyes is an actor and producer, known for Note to Self (2012), The Man in 3B (2015) and Perfect Combination (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTQ0NzU4MV5BMl5BanBnXkFtZTcwMTI5MjA5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1828818","name":"Christian Keyes","idIMDB":"nm1828818"},"actorId":"nm1828818","character":"Mayor","urlCharacter":"http://www.imdb.com/character/ch0374478","main":true},{"actorName":"Quinton Aaron","urlProfile":"http://www.imdb.com/name/nm2466842","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODI3Mjg0N15BMl5BanBnXkFtZTcwMjAyNjcwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1984","placeOfBirth":" Bronx, New York City, New York, USA","height":"6' 8\" (2.03 m)","bio":"Quinton Aaron is best known for his portrayal of Michael Oher, aka Big Mike, alongside Oscar winner Sandra Bullock, in the Academy Award winning hit movie, The Blind Side (2009), which has grossed over $300 million in U.S. box office alone. Aaron has guest-starred on many television shows including Law & Order: Special Victims Unit (1999) playing the son of Jill Scott, NBC's Mercy (2009), and CBS' Harry's Law (2011). He also had recurring roles on _One Tree Hill_ and _Drop Dead Diva_. In 2016, Lions Gate released the film 1982 (2013), where Quinton starred opposite Hill Harper and Wayne Brady. Aaron has three films coming out in 2016. Halfway (2017) premiering at Dallas International Film Festival was filmed in Wisconsin, September-November 2014; My First Miracle (2016), was shot in New York February-April 2015; and It's Not My Fault and I Don't Care Anyway (2017) was shot in Canada June-July 2015. Quinton will also be appearing on the big screen May 6th 2016 in the feature film Mothers and Daughters (2016) starring Selma Blair, Susan Sarandon, Sharon Stone and Courteney Cox. He has also worked on 3 period piece films so far in 2016 2 westerns and a bio film called Heart Baby starring Gbenga Akinnagbe and Jackson Rathbone. Quinton is dedicated to advocating for the fight against bullying. He began The Quentin Aaron Foundation, whose mission is to provide hope, encouragement, confidence and resources to children on the brink of suicide or battling the damaging effects on self-esteem and confidence caused by the actions or words of others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODI3Mjg0N15BMl5BanBnXkFtZTcwMjAyNjcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2466842","name":"Quinton Aaron","nicknames":["Q"],"idIMDB":"nm2466842"},"actorId":"nm2466842","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mariel Hemingway","urlProfile":"http://www.imdb.com/name/nm0000446","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODI4ODc4MV5BMl5BanBnXkFtZTYwNjY1OTYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1961","placeOfBirth":" Mill Valley, California, USA","birthName":"Mariel Hadley Hemingway","height":"5' 11\" (1.8 m)","bio":"Mariel Hemingway was born on November 22, 1961 in Mill Valley, California, USA as Mariel Hadley Hemingway. She is an actress and producer, known for Manhattan (1979), Star 80 (1983) and Civil Wars (1991). She was previously married to Stephen Crisman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2ODI4ODc4MV5BMl5BanBnXkFtZTYwNjY1OTYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000446","name":"Mariel Hemingway","idIMDB":"nm0000446"},"actorId":"nm0000446","character":"Aunt Billie","urlCharacter":"http://www.imdb.com/character/ch0374455","main":true},{"actorName":"Kenny Wormald","urlProfile":"http://www.imdb.com/name/nm1552693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU1MTI4MV5BMl5BanBnXkFtZTcwNjYxOTU5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1984","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 10½\" (1.79 m)","bio":"Kenny Wormald grew up in Stoughton, Massachusetts, and began taking dancing lessons at the age of six. He won a string of dance contests throughout the Northeast in his teens and took to dancing professionally. He worked as a dancer and choreographer, appearing in a number of music videos and touring with Justin Timberlake. He made his television debut in an episode of The Drew Carey Show (1995) in 2002, but he rose to worldwide fame in 2010 when Paramount announced that he was to star in the remake of Footloose (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU1MTI4MV5BMl5BanBnXkFtZTcwNjYxOTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1552693","name":"Kenny Wormald","idIMDB":"nm1552693"},"actorId":"nm1552693","character":"Ray","urlCharacter":"http://www.imdb.com/character/ch0374445","main":true},{"actorName":"Omari Hardwick","urlProfile":"http://www.imdb.com/name/nm1165044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzE2OTIzNF5BMl5BanBnXkFtZTgwOTg5NzMzNjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1974","placeOfBirth":" Savannah, Georgia, USA","height":"5' 10\" (1.78 m)","bio":"Born \"Omari Latif Hardwick,\" he grew up in Decatur, Georgia. Hardwick's parents gave him a name to set a precedent, \"Omari\" meaning \"most high,\" and \"Latif\" meaning \"gentle.\" He shares, \"I in no way believe that I am the highest or most high, but I feel like my name gives me something to strive for.\" Growing up, sports were Hardwick's world, but early on he knew he had a passion for the arts. By the age of 14, Hardwick was writing poetry on a regular basis, a passion he would carry with him into adulthood. In high school, he excelled at basketball, baseball, and football, and went on to play football at the University of Georgia. Although a star on the field, Hardwick never gave up his passion for acting, and minored in theatre in college. He shares, \"I hugely attribute sports to my success in entertainment business. Being on the field taught me dedication and discipline - I already came from a strict household when I was growing up, sports just took that to another level. Whenever I approach a set, I always feel as though the cast, crew, director, are all part of a team. I have always married athletics and art, two huge parts of my life.\" After graduation, Hardwick relocated to San Diego for a spot on the San Diego Chargers (NFL) however a knee injury cut his football career short. He decided to revisit his original passion for acting, and moved to New York to study his craft more extensively. In New York, Hardwick studied off Broadway until 2000, when he made the move to Los Angeles. As a struggling actor, he worked odd jobs to pay for acting classes, however the security gigs and substitute teaching at times were not enough to make ends meet, and at one point he lived out of his car. Hardwick shares, \"what is so crazy, is that where I presently shoot my series 'Dark Blue,' is where I lived in my car when I first moved to Los Angeles. It is surreal at times.\" Hardwick's first big break came in 2003, when he was cast in his first major role as a series regular in Spike Lee's Sucker Free City (2004). Two years later, he landed the feature The Guardian (2006) and TNT's Saved (2006) - both of which he booked within a three-week span in 2005. He notes, \"I felt like I had arrived when I went back to one of my odd jobs that had let me go several years prior, and I looked out over Sunset Boulevard right next to the Chateau Marmont, and saw myself plastered on a billboard overlooking the city. I had to break down a little at that point, it was a big moment for me.\" Throughout 2007 - 2009 Hardwick worked on various projects, including guest starring on several television series, and filming several movies including Summit Entertainment's Next Day Air (2009) and Touchstone Picture's Miracle at St. Anna (2008). In 2008 he landed the role of \"Ty Curtis\" on the TNT series Dark Blue (2009). Season 1 aired throughout 2009. In addition to acting, Hardwick is a founding member of Plan B Inc. Theater Group, and a co-founder of Los Angeles Actor's Lounge. He has big plans for his production company, Bravelife, in 2010 as well, and plans on expanding the company. Hardwick also continues to work on his poetry, and has written over 4,000 poems.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzE2OTIzNF5BMl5BanBnXkFtZTgwOTg5NzMzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1165044","name":"Omari Hardwick","idIMDB":"nm1165044"},"actorId":"nm1165044","character":"Dr. Don Cook","urlCharacter":"http://www.imdb.com/character/ch0374463","main":true},{"actorName":"Ali Cobrin","urlProfile":"http://www.imdb.com/name/nm3196681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjgzMDE0MV5BMl5BanBnXkFtZTgwNzUzMzQ3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1989","placeOfBirth":" Chicago, Illinois, USA","birthName":"Alexandra Arley Cobrin","height":"5' 8\" (1.73 m)","bio":"Alexandra Alrey \"Ali\" Cobrin is an American actress. She is best known for her role as Molly in the Showtime series Look, and as Kara in the 2012 film American Reunion. Cobrin was born and raised in Chicago, Illinois. She attended high school at the Chicago Academy for the Arts where she majored in musical theater. Growing up, she trained to become a classical ballerina and competed in the Junior Olympics. Cobrin began her entertainment career as an improvisation player in the Second City's teen ensemble and danced with the Burklyn Ballet Theater touring Scotland, where she performed at the Edinburgh Fringe Festival. During that same time, Cobrin had work-shopped Broadway musicals, including All That Jazz and Wonderland, which were directed by Ben Verreen and Frank Wildhorn, respectively. After graduating high school at the age of 17, Cobrin moved to Los Angeles, California to pursue an acting career. Upon moving to Los Angeles, Cobrin had her first movie acting role in a 2008 short film entitled, One. That same year, she starred in another short film called, Jack Turner and the Reluctant Vampire, where it won two awards in the Los Angeles Accolade Competition. In 2009, Cobrin had a supporting role in The Hole, a 3D film directed by internationally renown sci-fi and comedy director Joe Dante. The film would win the first Premio Persol award for best 3-D movie at the 2009 Venice Film Festival. In 2010, Cobrin made her debut television appearance in Kings by Night, a comedy pilot for Spike TV, and Showtime's LOOK. Later that year, she had a lead actress role in the movie, Cold Cabin, and appeared opposite to rap superstar B.o.B in the Adidas Originals shoe campaign commercial, MEGA Diner. In 2011, she guest starred in the television series, Friends with Benefits. In 2012, Cobrin had a breakout supporting role in American Reunion, a sequel in American Pie film series. Her most current role is in Life's an Itch, which is still in post-production.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjgzMDE0MV5BMl5BanBnXkFtZTgwNzUzMzQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3196681","name":"Ali Cobrin","idIMDB":"nm3196681"},"actorId":"nm3196681","character":"Monica","urlCharacter":"http://www.imdb.com/character/ch0374441","main":true},{"actorName":"Lew Temple","urlProfile":"http://www.imdb.com/name/nm0854702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjc0MzY1MF5BMl5BanBnXkFtZTcwOTk2MjYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1967","placeOfBirth":" USA","height":"5' 10\" (1.78 m)","bio":"Lew Temple was born October 2, 1967 and is an American film actor, perhaps best known for his roles as Axel on \"The Walking Dead,\" the character of Ned Oldham in the action adventure thriller, \"Unstoppable\" which also starred Denzel Washington, Chris Pine and Rosario Dawson; directed by Tony Scott, and Cal the diner manager in the comedy-drama \"Waitress.\" Born and raised in the Bayou Country of Louisiana, Temple is an extraordinarily diverse actor who often is compared to a chameleon: he has the unique ability to take any character and make it his own. Other film credits include the ranger, Hollis in the summer, 2013 Disney blockbuster \"The Lone Ranger,\" alongside Johnny Depp and Armie Hammer; Locus Fender in the action film \"Domino,\" starring Kiera Knightley and Mickey Rourke, directed by Tony Scott and Rob Zombie's \"The Devil's Rejects\" with Bill Moseley, Sid Haig, William Forsythe, and Sherri Moon Zombie Temple began his acting career on the stage of the prestigious Alley Theatre in Houston, Texas, working alongside artists such as Vanessa Redgrave in \"Julius Caesar\" and \"Anthony & Cleopatra\", as well as acclaimed writer/directors Michael Wilson, Terrance McNally and Edward Albee. He next landed numerous television roles, as well as roles in independent and mainstream studio films, such as \"On the Borderline,\" \"The Newton Boys,\" and \"Angels in the Outfield.\" Prior to acting, Temple had a Minor League Baseball career with the Seattle Mariners\" and \"Houston Astros.\" He worked his way through the Astros system to become Assistant Director of Minor Leagues and Scouting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTNlMDA4OGItMzM2ZC00NGM3LWI4NzYtYzEzZjg3ZDY1YmQ2XkEyXkFqcGdeQXVyMTc4NzQxMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0854702","name":"Lew Temple","idIMDB":"nm0854702"},"actorId":"nm0854702","character":"Matt Ewing","urlCharacter":"http://www.imdb.com/character/ch0374457","main":true},{"actorName":"Robert Hoffman","urlProfile":"http://www.imdb.com/name/nm1382207","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDI1OTkyNl5BMl5BanBnXkFtZTcwMDQ4OTM3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1980","placeOfBirth":" Gainesville, Florida, USA","birthName":"Robert James Hoffman III","height":"6' 2\" (1.88 m)","bio":"Robert James Hoffman III was born in Gainesville, Florida, the son of Charlotte and Robert Hoffman II, and moved with his family to Madison, Alabama when he was seven. He has one younger brother, Chris, and two younger sisters, Ashley and Lauren. He attended Bob Jones High School. He discovered his passion for dancing after seeing Michael Jackson's Thriller. He briefly attended the Alabama School of Fine Arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDI1OTkyNl5BMl5BanBnXkFtZTcwMDQ4OTM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1382207","name":"Robert Hoffman","nicknames":["Rob"],"idIMDB":"nm1382207"},"actorId":"nm1382207","character":"Kevin Shepherd","urlCharacter":"http://www.imdb.com/character/ch0374461","main":true}],"seasons":[],"idIMDB":"tt2392385","urlIMDB":"http://www.imdb.com/title/tt2392385","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","filmingLocations":[],"rated":"R","awards":[],"votes":"2,727","type":"Movie","companyCreditsSimple":[{"idCompany":"co0247764","name":"Imprint Entertainment"},{"idCompany":"co0290318","name":"Datari Turner Productions"},{"idCompany":"co0339996","name":"Gordon Bijelonic / Datari Turner Films"}],"keywords":{"keywords":["female nudity","sex scene","stripper","strip club","lap dance","coitus","cuckold","drugs","truth or dare"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:25:48"}}