{"data":{"movies":[{"title":"Cuban Fury","originalTitle":"","year":"2014","releaseDate":"20140411","directors":[{"name":"James Griffiths","id":"nm2926263"}],"writers":[{"name":"Jon Brown","id":"nm2163353"},{"name":"Nick Frost","id":"nm0296545"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTgwMjkzM15BMl5BanBnXkFtZTgwNDYzMDY0MTE@._V1.jpg","countries":["UK"],"languages":["English","Persian","Spanish"],"genres":["Comedy","Romance","Sport"],"plot":"1987: A 13 year old natural born dancer with fire in his heels and snakes in his hips is working himself up to explode all over the UK Junior Salsa Championships. But then: a freakish bullying incident on the mean streets of London robs him of his confidence, and our young hero finds his life diverted down a very different path. So it is that 22 years later, an adult Bruce Garrett (Nick Frost) finds himself out-of-shape and unloved - trapped in a downward spiral of self-pity, repression and Nando's take-outs. Only Julia (Rashida Jones), his smart, funny, gorgeous new American boss, gives him reason to live. But she's untouchable. Out of his league, so he imagines, with her perfect smile and perfect life. Unknown to Bruce however, Julia has issues all of her own. Luckily for him, she also has a secret passion. Then there's Drew (Chris O'Dowd), his alpha male colleague and horny king-monkey of the office. With Drew making no secret of his desire to get (his words) \"all up inside Julia\",...","simplePlot":"Beneath Bruce Garrett's under-confident, overweight exterior, the passionate heart of a salsa king lies dormant. Now, one woman is about to reignite his Latin fire.","actors":[{"actorName":"Ben Radcliffe","urlProfile":"http://www.imdb.com/name/nm5181257","urlPhoto":"","biography":{"bio":"Ben Radcliffe is an actor, known for Cuban Fury (2014), Evermoor (2014) and Evermoor Digital (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5181257","name":"Ben Radcliffe","idIMDB":"nm5181257"},"actorId":"nm5181257","character":"Young Bruce","urlCharacter":"http://www.imdb.com/character/ch0415108","main":true},{"actorName":"Ian McShane","urlProfile":"http://www.imdb.com/name/nm0574534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1942","placeOfBirth":" Blackburn, Lancashire, England, UK","height":"5' 7½\" (1.71 m)","bio":"From a lawless, foul-mouthed saloon owner in \"Deadwood\" to a tough no-nonsense British gangster in \"Sexy Beast,\" Ian McShane has virtually cornered the market on playing rogues, villains and all-around bad asses. A natural at portraying complex anti-heroes and charismatic heavies, the classically trained actor was born in Blackburn, Lancashire, England, to parents Irene (Cowley) and Harry McShane, a soccer player for Manchester United. McShane caught his first break in 1962 when he landed a lead role in \"The Wild and the Willing.\" McShane later revealed that he had ditched class at the Royal Academy of Dramatic Art to audition for the role. Since then, the award-winning actor has gone on to grab the attention of audiences and critics alike with his unforgettable portrayals of scoundrels, kings, killers, and thieves. Coming soon, McShane will be reprising his role as club owner/ex-assassin Winston opposite Keanu Reeves in \"John Wick: Chapter 2\" in the film by director Chad Stahelski. He plays Leland, a retired sheriff with violent tendencies, opposite Patrick Wilson in \"The Hollow Point,\" the gritty drama directed by Gonzalo López-Gallego. Also, expect to see McShane in the upcoming films \"Jawbone,\" \"Bolden!\" and opposite Michael Shannon in \"Pottersville.\" On television, McShane next stars as Mr. Wednesday in Neil Gaiman's \"American Gods,\" the highly-anticipated event series for Starz produced by Michael Green and Bryan Fuller. \"Actor. Icon. And now god. It is a goddamn delight to be collaborating with the incomparable Ian McShane,\" said Michael Green recently. McShane previously starred in the Michael Green series \"Kings\" for NBC. McShane will also be seen opposite Dr. Dre for Apple TV's first scripted series \"Vital Signs,\" a semi-autobiographical series loosely based on the hip-hop icon's life. McShane's formidable acting resume is as long as it is varied. McShane starred as the notoriously fearsome pirate Blackbeard opposite Johnny Depp in Disney's worldwide blockbuster hit \"Pirates of the Caribbean: On Stranger Tides.\" He starred as priest/prophet/warrior Amphiarus opposite Dwayne Johnson in MGM's \"Hercules,\" played lead dwarf Beith in the dark fantasy flick \"Snow White and the Huntsman,\" and portrayed good King Bramwell in Bryan Singer's modern-day fairytale \"Jack the Giant Slayer.\" McShane also appeared as Joe Strombel in Woody Allen's \"Scoop.\" His universally praised performance as tough guy Teddy Bass in the cult indie hit \"Sexy Beast\" led one London critic to dub McShane as \"The King of Cool.\" In a change of pace, he portrayed soft-spoken Meredith in the darkly perverse crime drama \"44 Inch Chest,\" a film in which McShane not only starred, but also produced. McShane has also had a long and diverse career on both British and American television. Earning considerable critical acclaim as the fierce yet charismatic Al Swearengen in the much-loved David Milch HBO series \"Deadwood,\" McShane went on to win the Golden Globe Award for Best Performance by an Actor in a Drama Series. His compelling and gritty portrayal also scored him nominations for both Emmy and SAG Awards. He went on to collect yet another Golden Globe nomination for Best Actor in a Miniseries for his riveting portrayal of the scheming, corrupt Waleran Bigod in Starz' Emmy-nominated \"Pillars of the Earth.\" McShane also won over viewers in FX's \"American Horror Story\" as the very bad Santa/serial killer Leigh Emerson and as cold-blooded billionaire Andrew Finney opposite Liev Schreiber in Showtime's acclaimed series \"Ray Donovan.\" More recently, he portrayed Sir Roger Scatcherd in the Julian Fellows' miniseries \"Dr. Thorne\" for ITV and also made an appearance as peacenik Brother Ray in HBO's juggernaut \"Game of Thrones.\" Earlier in his television career McShane produced and starred as the irresistible rogue antiques dealer in the acclaimed series \"Lovejoy\" for the BBC and A&E, even directing several episodes himself. The show was one of the first independent co-productions with the BBC and aired in both the U.S. and U.K. Other notable portrayals on television have included his appearance in the landmark, blockbuster miniseries \"Roots\" and as Ken Harrison in \"Whose Life is it Anyway?\" McShane also played Sejanus in the miniseries \"A.D.,\" the eponymous \"Disraeli,\" produced by Masterpiece Theater, and Judas in NBC's \"Jesus of Nazareth.\" An accomplished, award-wining stage actor, McShane made his West End debut in \"The Promise,\" co-starring Dame Judi Dench and Sir Ian McKellen. The play went on to open on Broadway the following year. McShane also charmed audiences in the West End musical \"The Witches of Eastwick,\" originating the role of the seductive, sex-obsessed Darryl Van Horne on stage in London. At the esteemed L.A. Matrix Theatre, McShane appeared in Harold Pinter's \"Betrayal,\" Larry Atlas' \"Yield of the Long Bond\", as well as in John Osborne's \"Inadmissible Evidence,\" picking up a couple of Los Angeles Drama Critics' Awards for Lead Performance in the process. In addition, McShane appeared in the 40th Anniversary revival of Harold Pinter's \"The Homecoming\" on Broadway. With his low, distinctive voice, McShane has also made his mark in film and television as a voiceover artist. He narrated Disney's \"The Sorcerer's Apprentice,\" brought life to the eccentric magician Mr. Bobinsky in \"Coraline,\" and added a sinister edge to Tai Lung in \"Kung Fu Panda.\" McShane has also let his rich baritone to \"The Golden Compass,\" as well as to \"Shrek The Third\" as the notorious Captain Hook.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574534","name":"Ian McShane","idIMDB":"nm0574534"},"actorId":"nm0574534","character":"Ron Parfitt","urlCharacter":"http://www.imdb.com/character/ch0486281","main":true},{"actorName":"Isabella Steinbarth","urlProfile":"http://www.imdb.com/name/nm5181654","urlPhoto":"","biography":{"bio":"Isabella Steinbarth is an actress, known for Cuban Fury (2014), A Little Chaos (2014) and Offside (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5181654","name":"Isabella Steinbarth","idIMDB":"nm5181654"},"actorId":"nm5181654","character":"Young Sam","urlCharacter":"http://www.imdb.com/character/ch0367511","main":true},{"actorName":"Brandon Robinson","urlProfile":"http://www.imdb.com/name/nm2247674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NzQyOTAxMV5BMl5BanBnXkFtZTcwOTg2MzIzNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Brandon Robinson is an actor, known for Cuban Fury (2014), Speed Racer (2008) and Will (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NzQyOTAxMV5BMl5BanBnXkFtZTcwOTg2MzIzNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2247674","name":"Brandon Robinson","idIMDB":"nm2247674"},"actorId":"nm2247674","character":"Bully #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Kyriacou","urlProfile":"http://www.imdb.com/name/nm5181566","urlPhoto":"","biography":{"bio":"Louis Kyriacou is an actor, known for Cuban Fury (2014) and The Tide (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5181566","name":"Louis Kyriacou","idIMDB":"nm5181566"},"actorId":"nm5181566","character":"Bully #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kieran Gaffney","urlProfile":"http://www.imdb.com/name/nm3891675","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTU4NzMxNl5BMl5BanBnXkFtZTcwNjA4NzU1Mw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Kieran Gaffney is an actor, known for Cuban Fury (2014), Britain's Got Talent (2007) and Britain's Got More Talent (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTU4NzMxNl5BMl5BanBnXkFtZTcwNjA4NzU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3891675","name":"Kieran Gaffney","idIMDB":"nm3891675"},"actorId":"nm3891675","character":"Bully #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Frost","urlProfile":"http://www.imdb.com/name/nm0296545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3Mjg1MzU0M15BMl5BanBnXkFtZTcwNTM1MTE2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1972","placeOfBirth":" Hornchurch, Essex, England, UK","birthName":"Nicholas John Frost","height":"5' 8\" (1.73 m)","bio":"Nick Frost is an English actor, screenwriter and comedian. He is known for his work in the series of British comedic genre films The Three Flavours Cornetto trilogy, Shaun of the Dead (2004), Hot Fuzz (2007), and The World's End (2013). He also co-starred in Paul (2011), with frequent collaborator and friend Simon Pegg. Nicholas John \"Nick\" Frost is good friends with Simon Pegg and they have appeared alongside each other in several Movies. He resides with his half-Swedish wife, production executive Christina in St Margaret s, London. He previously lived in Fins-bury Park, which was also the filming location for Shaun of the Dead. In a 2005 interview, Frost stated that he was brought up as a Catholic. He is a supporter of West Ham United, as well as being a rugby player, formerly playing for Barking RFC. On 22 June 2011, Frost's wife gave birth to a son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3Mjg1MzU0M15BMl5BanBnXkFtZTcwNTM1MTE2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0296545","name":"Nick Frost","idIMDB":"nm0296545"},"actorId":"nm0296545","character":"Bruce","urlCharacter":"http://www.imdb.com/character/ch0415108","main":true},{"actorName":"Steve Oram","urlProfile":"http://www.imdb.com/name/nm1361530","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNTc0NjExMl5BMl5BanBnXkFtZTYwNzA5NDgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1973","placeOfBirth":" Melton Mowbray, Leicestershire, England, UK","bio":"Steve Oram was born on August 25, 1973 in Melton Mowbray, Leicestershire, England. He is an actor and writer, known for Sightseers (2012), The World's End (2013) and The Canal (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNTc0NjExMl5BMl5BanBnXkFtZTYwNzA5NDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1361530","name":"Steve Oram","idIMDB":"nm1361530"},"actorId":"nm1361530","character":"Security Guard Kevin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris O'Dowd","urlProfile":"http://www.imdb.com/name/nm1483369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTQwNzk5NF5BMl5BanBnXkFtZTgwOTgzMDEwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1979","placeOfBirth":" Sligo, Ireland","height":"6' 3\" (1.91 m)","bio":"Christopher \"Chris\" O'Dowd born 9 October 1979 is an Irish actor and comedian best known for his role as Roy Trenneman in the Channel 4 comedy The IT Crowd. O'Dowd created and is starring in the Sky 1 television series Moone Boy. He had a recurring role on the drama series Girls and starred in the television series Family Tree. O'Dowd is also known for his films, most notably Bridesmaids (2011), This Is 40 (2012), The Sapphires (2012), Thor: The Dark World (2013), Calvary (2014) and St. Vincent (2014). He made his Broadway debut in the play adaptation of Of Mice and Men in 2014, for which he was nominated for a Tony Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTQwNzk5NF5BMl5BanBnXkFtZTgwOTgzMDEwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1483369","name":"Chris O'Dowd","idIMDB":"nm1483369"},"actorId":"nm1483369","character":"Drew","urlCharacter":"http://www.imdb.com/character/ch0415068","main":true},{"actorName":"Alexandra Roach","urlProfile":"http://www.imdb.com/name/nm3789989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDY0MzI2OF5BMl5BanBnXkFtZTcwNTY5OTUxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1987","placeOfBirth":" Ammanford, Carmarthen, Wales, UK","height":"5' 7½\" (1.71 m)","bio":"Alexandra Roach was born in Ammanford, Carmarthenshire in Wales and was already a veteran of the Welsh television soap 'Pobol Y Cwm' by her early teens. In 2003 whilst studying for her GCSE exams at the local comprehensive school she learned that she had beaten out players in national soaps to win the award for the best juvenile actor in a soap at the Children in Entertainment Awards. Leaving 'Pobl Y Cwm' in 2005 she spent time with the National Youth Theatre of Wales before going on to R.A.D.A. from where she graduated with a B.A, in acting in 2010. A number of high profile roles followed including television series and the role of the younger Margaret Thatcher in the biopic 'The Iron Lady' with Meryl Streep.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDY0MzI2OF5BMl5BanBnXkFtZTcwNTY5OTUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3789989","name":"Alexandra Roach","idIMDB":"nm3789989"},"actorId":"nm3789989","character":"Helen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rashida Jones","urlProfile":"http://www.imdb.com/name/nm0429069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODM2MzQ2NV5BMl5BanBnXkFtZTcwMTAxNTUxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1976","placeOfBirth":" Los Angeles, California, USA","birthName":"Rashida Leah Jones","height":"5' 4\" (1.63 m)","bio":"Rashida Jones was born in Los Angeles, the younger daughter of media mogul, producer, and musician Quincy Jones and actress Peggy Lipton. She has an older sister, Kidada Jones, and five half-siblings by her father's other relationships. Her father is African-American, and also has Welsh ancestry. Her mother is Ashkenazi Jewish (a descendant of immigrants from Russia and Latvia). Rashida was raised in Reform Judaism; she attended Hebrew school, though she left at the age of ten, and did not have a Bat Mitzvah ceremony. She grew up in Bel Air, Los Angeles, California. Jones has stated of her mixed race parentage, \"It was the 1970s and still not that acceptable for them to be together.\" Jones made her professional acting debut in The Last Don, a 1997 mini-series based on the novel by Mario Puzo. Also in 1997, Rashida graduated from Harvard University.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODM2MzQ2NV5BMl5BanBnXkFtZTcwMTAxNTUxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0429069","name":"Rashida Jones","nicknames":["Rash or Rashi"],"idIMDB":"nm0429069"},"actorId":"nm0429069","character":"Julia","urlCharacter":"http://www.imdb.com/character/ch0415109","main":true},{"actorName":"Olivia Colman","urlProfile":"http://www.imdb.com/name/nm1469236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MDMxOTgzM15BMl5BanBnXkFtZTcwNzAwMDQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1974","placeOfBirth":" Norwich, Norfolk, England, UK","birthName":"Sarah Caroline Olivia Colman","height":"5' 7\" (1.7 m)","bio":"Olivia Colman was born on January 30, 1974 in Norwich, Norfolk, England as Sarah Caroline Olivia Colman. She is an actress, known for Locke (2013), The Lobster (2015) and Hot Fuzz (2007). She has been married to Ed Sinclair since August 2001. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MDMxOTgzM15BMl5BanBnXkFtZTcwNzAwMDQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1469236","name":"Olivia Colman","nicknames":["Collie"],"idIMDB":"nm1469236"},"actorId":"nm1469236","character":"Sam","urlCharacter":"http://www.imdb.com/character/ch0367511","main":true},{"actorName":"Janine Wood","urlProfile":"http://www.imdb.com/name/nm0939774","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY5NjQyMjQxNl5BMl5BanBnXkFtZTgwNjgzNjE3NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1963","placeOfBirth":" Bournemouth, Dorset, England, UK","bio":"Janine Wood was born on December 30, 1963 in Bournemouth, Dorset, England. She is an actress, known for After Henry (1988), Cuban Fury (2014) and Wuthering Heights (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY5NjQyMjQxNl5BMl5BanBnXkFtZTgwNjgzNjE3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0939774","name":"Janine Wood","idIMDB":"nm0939774"},"actorId":"nm0939774","character":"Female Client","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rory Kinnear","urlProfile":"http://www.imdb.com/name/nm1239499","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTMwMDM5OV5BMl5BanBnXkFtZTcwODQ1MDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1978","placeOfBirth":" London, England, UK","birthName":"Rory Stewart Kinnear","height":"6' (1.83 m)","bio":"Rory Kinnear was born on February 17, 1978 in London, England as Rory Stewart Kinnear. He is an actor, known for The Imitation Game (2014), Skyfall (2012) and Spectre (2015). He is married to Pandora Colin. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTMwMDM5OV5BMl5BanBnXkFtZTcwODQ1MDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1239499","name":"Rory Kinnear","idIMDB":"nm1239499"},"actorId":"nm1239499","character":"Gary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Plester","urlProfile":"http://www.imdb.com/name/nm1043031","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NTI0Njc3Ml5BMl5BanBnXkFtZTgwNDA2NDA5NzE@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1970","placeOfBirth":" Banbury, Oxfordshire, England, UK","bio":"Tim Plester was born on September 10, 1970 in Banbury, Oxfordshire, England. He is an actor and producer, known for Game of Thrones (2011), Way of the Morris (2011) and Kick-Ass (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NTI0Njc3Ml5BMl5BanBnXkFtZTgwNDA2NDA5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1043031","name":"Tim Plester","idIMDB":"nm1043031"},"actorId":"nm1043031","character":"Mickey","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2390237","urlIMDB":"http://www.imdb.com/title/tt2390237","business":{"budget":null,"openingWeekend":[{"money":"$57,105","country":"USA","day":"13","month":"04","year":"2014","remarks":"79 Screens"},{"money":"$1,618,222","country":"UK","day":"14","month":"02","year":"2014","remarks":"361 Screens"},{"money":"HUF 4,513,489","country":"Hungary","day":"04","month":"05","year":"2014","remarks":"19 Screens"}],"gross":[{"money":"$90,310","country":"USA","day":"20","month":"04","year":"2014","remarks":""},{"money":"$57,105","country":"USA","day":"13","month":"04","year":"2014","remarks":""}],"weekendGross":[{"money":"$7,493","country":"USA","day":"20","month":"04","year":"2014","remarks":"8 Screens"},{"money":"$57,105","country":"USA","day":"13","month":"04","year":"2014","remarks":"79 Screens"}],"admissions":[{"money":"14,621","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"24","month":"08","year":"2012","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["ARRIRAW","Codex"],"cinematographicProcess":["ArriRaw (2.8K) (source format)","Codex","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["D-Cinema"]},"rating":"6.2","metascore":"52","filmingLocations":[{"location":"Victoria and Albert Museum, South Kensington, London, England, UK"}],"rated":"R","awards":[{"award":"World Soundtrack Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won World Soundtrack Award","categories":[{"category":"Discovery of the Year","names":[{"name":"Daniel Pemberton","id":"nm1207404","role":null},{"name":"The Counselor","id":"tt2193215","role":null}]}]}]}],"votes":"15,424","type":"Movie","companyCreditsSimple":[{"idCompany":"co0131363","name":"Big Talk Productions"}],"keywords":{"keywords":["salsa","dancer","female boss","new boss","dance teacher","dance competition","mix tape","male rivalry","bullying","fanta","shaving chest","shaving chest hair","bowling alley","office party","dance club","dancing with partner","board game","water cooler","business presentation","road accident","sequin shirt","dance practice","drunkenness","dance class","dance off","dancing on the roof of a car","dancing shoe","fake tan","golf practice","golf driving range","cassette tape","unwanted sexual advances","f word","reference to al pacino","two word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:04:12"}}