{"data":{"movies":[{"title":"Assumed Killer","originalTitle":"","year":"2013","releaseDate":"20131101","directors":[{"name":"Bernard Salzmann","id":"nm0759574"}],"writers":[{"name":"Bernard Salzmann","id":"nm0759574"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODY1ODc1MV5BMl5BanBnXkFtZTcwMjk0MTAyOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Mystery","Thriller"],"plot":"Award winning news reporter Daria Valdez Morrow () was investigating a series of murders caused by a local serial killer when she gets into a car accident and suffers from Retrograde Amnesia. When she comes to, she begins to suspect that her husband, Sam Morrow () is the serial killer she had been reporting about and embarks on a journey to discover the truth.","simplePlot":"Could her husband be the notorious serial killer? or is her mind playing tricks on her?","actors":[{"actorName":"Casper Van Dien","urlProfile":"http://www.imdb.com/name/nm0000680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMTA2MTEzMzZeQTJeQWpwZ15BbWU4MDc4OTgzMTgx._V1_UY44_CR28,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1968","placeOfBirth":" Milton, Florida, USA","birthName":"Casper Robert Van Dien Jr.","height":"5' 9¼\" (1.76 m)","bio":"Casper Van Dien's breakthrough role was as the lead in Paul Verhoeven's sci-fi film Starship Troopers (1997). Still one of the most talked about films of 1997 that has one of the largest cult followings in film history. He was also in Tim Burton's critically acclaimed film Sleepy Hollow (1999), as Brom Bones. He was the 20th Tarzan and the only one to ever film in Africa and ride an African elephant in the Warner Bros. film Tarzan and the Lost City (1998). Other film credits include The Pact (2012), which was well received at Sundance. Casper played a down and out alcoholic detective opposite Caity Lotz. A Post Apocalyptic survivor in Beyond The Wave (2015) shot entirely in China. Starring opposite Sean Maher as part of a two man crew on a mission to the end of the universe in the much anticipated independent film ISRA 88 (2016) . Television credits include \"MONK\" (2008) Playing a Navy Doctor for the season finale, and \"Beverly Hills, 90210\" (1994). Casper has tackled the web recently playing Johnny Cage in the insanely popular Machinima web-series \"Mortal Kombat Legacy\" seasons 2 and 3. He won best actor for his comedic chops in the series. He stars as \"Hawk Guy\" in the upcoming Avengers spoof \"Interns of F.I.E.L.D.\" produced by Screen Junkies. You can also check him out as the hunky bartender in the popular series \"CONMAN\" starring Alan Tudyk and Nathan Fillion. He played the perfect version of himself in the comedy series \"Crunchtime\". His most recent victory has been behind the camera as a Director. He has directed three films in which he also starred in. His second film Patient Killer won best film and best director awards and was bought and aired on Lifetime.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMTA2MTEzMzZeQTJeQWpwZ15BbWU4MDc4OTgzMTgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000680","name":"Casper Van Dien","nicknames":["Van","Cap","Tarzan","Casper","Robb"],"idIMDB":"nm0000680"},"actorId":"nm0000680","character":"Sam Morrow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbie Castro","urlProfile":"http://www.imdb.com/name/nm3608565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE0MGRmMGYtZjE4My00ODI1LWIxNmYtYTA0OWM0MGEwMzM3XkEyXkFqcGdeQXVyMjIxMDczMDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Actress, Producer Barbie Castro born in Miami Beach, FL, is a hard working, dedicated woman who knows how to bring a project full circle from beginning to end. She has a keen eye for talent and a great sense of business and street smarts. Barbie decided to take her acting career into her own hands and create a name for herself as a prominent actress in South Florida. In 2011, Barbie Castro formed Concord Films, LLC and Produced Conduit (2011), a short film Directed by Alyn Darnay. She won 6 Best Actress Awards in the 2011 Film Festival Circuit. Including Best Actress in a short Film at the New York City International Film Festival, Buffalo Niagara Film Festival and FMPTA Crystal Reel Awards. In 2013 Barbie Castro was named a Semi Finalist in the NexTv Acting & Directing Talent Search for her work in Conduit (2011). Conduit (2011) received over 16 accolades, including Best Produced Script at the FMPTA Cystal Reel Awards, Golden Reel Award at the Nevada Film Festival and Best Faith Based Film at the Action on Films International Film Festival. In 2011 Barbie Castro, Wrote, Produced & Co-Directed a Pilot called \"Miami 3oh5.\" Miami 3oh5 won A Silver Award at the 2011 California Film Awards, in the Television Pilot Division, as well as a Silver Sierre Award at the 2012 Yosemite International Film Festival in the Television Pilot Competition. The passion didn't stop there as Barbie was determined to Produce her first feature film. That was the birth of Assumed Killer (2013), Directed by Bernard Salzmann. The film has Worldwide Distribution by Mar Vista Entertainment and is scheduled to be released in 2013 starring Casper Van Dien, Barbie Castro, Armand Assante, Christie Lynn Smith, Eric Roberts, William R. Moses, Nancy Stafford and various other talented actors. In between films, Barbie Castro is a prominent Real Estate Broker and Real Estate Investor in S FL since 1996. Barbie Castro is the wife of Eric R. Castro, the COO of Banker's Healthcare Group, Inc. and has two beautiful daughters Rhys Castro, 20 & Taylor Castro, 17.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE0MGRmMGYtZjE4My00ODI1LWIxNmYtYTA0OWM0MGEwMzM3XkEyXkFqcGdeQXVyMjIxMDczMDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3608565","name":"Barbie Castro","idIMDB":"nm3608565"},"actorId":"nm3608565","character":"Daria Valdez Morrow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Armand Assante","urlProfile":"http://www.imdb.com/name/nm0000800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU1OGFjNWUtMzkzZS00NWFjLWI4N2YtMmE1M2YwNjliZDEwL2ltYWdlXkEyXkFqcGdeQXVyNjAyMTAwMzk@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1949","placeOfBirth":" New York City, New York, USA","birthName":"Armand Anthony Assante Jr.","height":"5' 10\" (1.78 m)","bio":"Armand Assante is a coarsely handsome American actor who has successfully portrayed a wide range of intriguing characters from numerous ethnic backgrounds, both on screen and in the theater. Armand Anthony Assante, Jr. was born on October 4, 1949 in New York City, to Katherine (Healey), a music teacher and poet, and Armand Anthony Assante, Sr., an artist and painter. His father was of Italian descent and his mother was of Irish ancestry. Assante graduated from Cornwall Central High School and received his dramatic training at the American Academy of Dramatic Arts. His first screen role was as a wedding guest in the minor cult film The Lords of Flatbush (1974) starring Henry Winkler and Sylvester Stallone, then after guest appearances in several soap operas, he was back alongside Sylvester Stallone in Paradise Alley (1978). He played a wealthy Frenchman seducing army recruit Goldie Hawn in Private Benjamin (1980), portrayed literary \"hard boiled\" detective Mike Hammer in I, the Jury (1982) plus, he was excellent as the title role in Belizaire the Cajun (1986). Assante continued on into the 1990s with more strong performances as a drug baron in Q & A (1990) directed by Sidney Lumet, he made a sensational team with Antonio Banderas for the Cuban music spectacular Les mambo kings (1992), he was very impressive in the mob drama Hoffa (1992), and once more he was on screen with Sylvester Stallone in the film adaptation of the futuristic comic book Judge Dredd (1995), and Assante co-starred in the uneven Demi Moore film Striptease (1996). Assante's acting talents remain in strong demand, and he has continued to stay busy on screen with recent appearances in One Eyed King (2001), Citizen Verdict (2003) and Two for the Money (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU1OGFjNWUtMzkzZS00NWFjLWI4N2YtMmE1M2YwNjliZDEwL2ltYWdlXkEyXkFqcGdeQXVyNjAyMTAwMzk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000800","name":"Armand Assante","idIMDB":"nm0000800"},"actorId":"nm0000800","character":"Aaron Banfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christie Lynn Smith","urlProfile":"http://www.imdb.com/name/nm0807700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3YjMwYzAtNTY3OC00M2M2LWJiZDUtMTQ2MzhkMzliM2YwL2ltYWdlXkEyXkFqcGdeQXVyMTc2MTI2Ng@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"March1969","placeOfBirth":" USA","height":"5' 5\" (1.65 m)","bio":"One word that instantly comes to mind when describing Christie Lynn's acting talent is versatile. With her natural beauty and strong emotional depth, Christie has been termed a chameleon for her ability to morph from character to another character. Equally adept at drama and comedy, she is now a veteran of over forty television series and a wonderful collection of films. Christie spent most of her childhood growing up in the small town of Orange Park, Florida. Her acting career started during high school, doing local commercials and industrials. But her love for acting began years earlier when, as a child, she would pretend to be Olivia Newton-John from the film, Grease (1978), and act out scenes with neighborhood friends. She earned her Screen Actors Guild card right out of high school by landing a guest spot on the television show, Super Force (1990), and followed it up with an even bigger guest-starring role on the series, Swamp Thing (1990), that had local casting directors taking notice of this young talent. Christie Lynn knew she had to move to Hollywood to pursue her love of acting and storytelling and that's what she did. She dove into acting classes with famed acting coaches Cameron Thor, Howard Fine, Jay R. Goldenberg, the renowned Uta Hagen, Eric Morris and the Los Angeles comedy troupe, \"The Groundlings\". Her hard work was quickly rewarded. Christie was snapped up to star in the soap opera, Forever (1996), that would take her on location to film in Mexico City for a year. With 160 episodes under her belt, she returned to Los Angeles and landed her first lead role in a television pilot, USMA West Point (1998). Christie then started to work consistently in television, guest-starring on many of Aaron Spelling's hit shows, like Beverly Hills, 90210 (1990), 7th Heaven (1996) and Charmed (1998). Her most recent television credits range from recurring roles on Bones (2005), Malcolm in the Middle (2000), General Hospital (1963) and Days of Our Lives (1965) to guest appearances on Justified (2010), Chase (2010), Castle (2009), Boston Legal (2004), House (2004), Three Rivers (2009), Saving Grace (2007), ER (1994), Las Vegas (2003), Monk (2002), Without a Trace (2002) and CSI: Crime Scene Investigation (2000), to name a few. Christie Lynn's film career started out with a bang in 2001, when she was hand-picked by the most prestigious casting directors in Hollywood, Jane Jenkins and Janet Hirshenson (A Beautiful Mind (2001), The Da Vinci Code (2006)) for the lead role of \"Susie Downey\", the perky church girl with a hidden secret, in the comedy, What Boys Like (2003) (aka \"What Boys Like\"). She followed that film with the role of \"Catherine Carter Corbin\", the demure Southern belle in Ted Turner's Civil War epic, Gods and Generals (2003), starring Robert Duvall, Stephen Lang and Jeff Daniels. Other film roles include the thriller, The Last Stop Cafe (2003), for which she was nominated for Best Actress at the Eerie Horror Film Festival for her role as a serial killer on the run. Christie then starred in the dark psychological drama, Inside Irvin (2004), portraying a tortured agoraphobic. She received rave reviews, the most complimentary of all from Todd Davis at CBS Radio, who said, \"Kudos to... actress Christie Lynn Smith, whose work here is worthy of Academy Award acknowledgment\". Soon after, Christie starred in Grace (2006), as one of only two characters in the award-winning short film. Actor/director Laurence Fishburne praised the film's \"sensitive, illuminating performances\". Christie's raw portrayal of the suicidal \"Rae\" also garnered her a Leading Actor Accolade film award in 2007 and a Best Actress nomination from the film festival Method Fest. In 2008, Christie took on her biggest and best role yet, becoming a new mom. She gave birth to her beautiful daughter, Abby Ryder, on March 14, 2008. After taking some time off to spend with her new baby and husband, actor John Fortson, Christie booked two films back to back. The first was the lead role of \"May Keifner\", the dry-witted, ballsy woman in the feature Ticket Out (2012), also starring Ray Liotta and Billy Burke. The film was produced by Oscar-nominated director Chris Noonan (Babe, le cochon devenu berger (1995) and Miss Potter (2006)). Christie then went straight into production on The Crazies (2010), the remake of the classic George A. Romero film, playing \"Deardra Farnum\", a protective mother living in a small town beset by death. The film is directed by Breck Eisner (Sahara (2005)) and produced by Michael Aguilar (The Departed (2006)). When Christie is not acting, she loves spending time with her family, practicing yoga, hiking, traveling, surfing, cooking, having afternoon tea and playing gin rummy - more specifically, beating her husband at gin rummy. Great things lie ahead for this beautiful, multi-talented chameleon who continues to create real and moving characters time and time again.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3YjMwYzAtNTY3OC00M2M2LWJiZDUtMTQ2MzhkMzliM2YwL2ltYWdlXkEyXkFqcGdeQXVyMTc2MTI2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807700","name":"Christie Lynn Smith","idIMDB":"nm0807700"},"actorId":"nm0807700","character":"Sara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Roberts","urlProfile":"http://www.imdb.com/name/nm0000616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1956","placeOfBirth":" Biloxi, Mississippi, USA","birthName":"Eric Anthony Roberts","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's edgier, more intriguing characters running around and about for decades, Eric Anthony Roberts started life in Biloxi, Mississippi. He is the son of Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights. His siblings are actors Lisa Roberts Gillan and Julia Roberts, and he grew up in Atlanta, Georgia. He began his acting career at age 5 in a local theater company called the \"Actors and Writers Workshop\", founded by his late father. After his schooling at Grady High, he studied drama at age 17 in London for two years at the Royal Academy of Dramatic Arts, then returned to the States and continued his studies at the American Academy in New York. He made his NY stage debut in \"Rebel Women\" in 1976 at age 20 and appeared in regional productions, once playing the newspaper boy in a production of \"A Streetcar Named Desire\" starring Shirley Knight and Glenn Close. After appearing in such daytime soaps as Another World (1964) and How to Survive a Marriage (1974), his career began to shift fast forward when he copped a leading role in a major film. In King of the Gypsies (1978), based on Peter Maas' best-seller about a fracturing dynasty of New York City gypsies, he made his debut alongside an intimidating roster of stars including Judd Hirsch, Susan Sarandon, Shelley Winters and Sterling Hayden. Young Eric held his own expertly (winning a Golden Globe nomination) while his burning intensity and brooding charm marked sure signs of star potential. After this, he won the lead opposite Milo O'Shea in the 1980 stage production of \"Mass Appeal\". He suffered serious injuries in a car accident during his nascent film career but lost no fans by the time he returned to co-star with Sissy Spacek as a small-town stranger in Raggedy Man (1981). It was, however, his stark and frightening portrayal of two-bit hustler Paul Snider, the cast-off boyfriend who slays Playmate-turned-movie starlet Dorothy Stratten (played by Mariel Hemingway) in Star 80 (1983) that really put him on the movie map and earned him a second Golden Globe nomination. A wide range of fascinating, whacked-out roles were immediately offered to him on a silver plate. He played another dangerous streetwise hustler type in The Pope of Greenwich Village (1984) opposite fellow rebel Mickey Rourke; a cocky soda pop sales exec in the Australian comedy Coca-Cola kid (1985); appeared with more charm and restraint opposite Rosanna Arquette in the offbeat romantic comedy Nobody's Fool (1986) and topped his prolific period off with an Academy Award nomination as a young prison escapee hiding out with Jon Voight aboard an out-of-control train in the ultra-violent, character-driven action adventure Runaway Train (1985). Good things continued to happen when he was a replacement lead in the original run of \"Burn This\" and won a Theatre World Award for his 1988 Broadway debut. A risky, no-holds-barred actor, he was often guilty of overacting if given half the chance. His film career began to slide in the late 1980s, appearing in more quantity than quality pictures. A series of missteps led to unheralded appearances in such bombs as the karate-themed Best of the Best (1989); the NY urban thriller The Ambulance (1990); the action western Blood Red (1989), which took three years to release and is the only film Eric and his sister Julia Roberts appeared in together; and Rude Awakening (1989) when he filled in as a burned-out hippie opposite a Chong-less Cheech Marin. More under appreciated \"B\" filming came with the 1990s (Freefall (1994), Sensation (1994), The Nature of the Beast (1995), etc.), while also chewing the scenery with a number of mobster types in TV-movies, including one as \"Al Capone\". He soon began appearing as flashy secondary villains and creepies that showcased other stars instead, such as Final Analysis (1992) starring Richard Gere, Heaven's Prisoners (1996) top lining Alec Baldwin, and The Dark Knight (2008), part of the \"Batman\" series with Christian Bale and the late Heath Ledger. Eric's undeniable, unconventional talent would occasionally mesh with the perfect role. At the Sundance Film Festival in 1996, he received critical applause for his starring role as a man dying of AIDS in the uplifting and emotional film It's My Party (1996) and earned more honors as a writer marked for murder in the mob-themed story La Cucaracha (1998). He was also perfectly cast as one of the cold-blooded killers in the Emmy-nominated TV adaptation of Truman Capote's chiller In Cold Blood (1996). Eric continued to appear sporadically on TV in such dramatic series as Law & Order: Criminal Intent (2001), while sometimes showing a fun side as well in comedy (The King of Queens (1998)). His own series work included Less Than Perfect (2002) and, more recently, and in the cult program Heroes (2006) where promise for a longer participation ended with his character's death. Recovered from a long-standing cocaine problem, Eric wed, for the first time, actress/writer Eliza Roberts (nee Garrett). They have appeared in such films as Killer Weekend (2004) and Final Approach (2005). His daughter from a former relationship, Emma Roberts, is a newly popular and fast-rising \"tween\" actress from the series Unfabulous (2004) and has played youthful super-sleuth Nancy Drew (2007) on film. Eric's unpredictable, volatile nature which works so mesmerizing on screen has also led to troubling times off camera; his relationship with younger sis Julia Roberts has been seriously strained for quite some time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000616","name":"Eric Roberts","idIMDB":"nm0000616"},"actorId":"nm0000616","character":"Taxi Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William R. Moses","urlProfile":"http://www.imdb.com/name/nm0608632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTIyNDQxM15BMl5BanBnXkFtZTcwOTA0NTAzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1959","placeOfBirth":" Los Angeles, California, USA","birthName":"William Remington Moses","height":"6' 1\" (1.85 m)","bio":"William Remington Moses was born on November 17th, 1959 to actress Marian McCargo and businessman Richard Cantrell Moses Sr. William's parents divorced when he was young. His mother met and married Alphonzo E. Bell, Jr. in 1970. Alphonzo adopted William and his three brothers. Alphonzo later became one of the most loved congressmen in California. Growing up on in a citrus farm in Ojai, California, he was not interested in showbiz until he met his brother Rick Moses' agent and did a commercial for Sprite. William's first movie opportunity came with Choices (1981). Shortly after that, his big break came - he read and won for the part of \"Cole Gioberti\" in the prime time series Falcon Crest (1981). He stayed there for 5 seasons. He also guest-starred in episodes of Fantasy Island (1977), The Love Boat (1977), Finder of Lost Loves: Maxwell Ltd: Finder of Lost Loves Pilot (1984), Hotel (1983) and \"Battle Of The Network Stars\" (1983-1985). He excelled at the latter because of his athletic skills. This is also how he met actress Tracy Nelson, daughter of rock legend Ricky Nelson and Kristin Harmon. They were married on romantic Catalina Island in July 1987. A month after the wedding, Tracy was diagnosed with a form of cancer, Hodgkins' Disease. Because of her illness and waiting for her remission, they delayed having a baby. On August 11, 1992, their daughter, Remington Moses, was born. They divorced in 1997. William later found Sarah, whom he married in 2002. They have two daughters. He will probably always be remembered for two roles, Falcon Crest (1981) and the Perry Mason Mysteries series (1989-1995). He comes from a talented family. His brothers are actor Rick Moses, musician Graham Moses and minister/director Harry Moses. His late mother, Marian McCargo, was a tennis star and actress before becoming a mother and step-mother to seven boys. He also has three stepbrothers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTIyNDQxM15BMl5BanBnXkFtZTcwOTA0NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0608632","name":"William R. Moses","nicknames":["Billy","Bill"],"idIMDB":"nm0608632"},"actorId":"nm0608632","character":"Dr. Green","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Stafford","urlProfile":"http://www.imdb.com/name/nm0821328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzA4MDk4MF5BMl5BanBnXkFtZTcwNDM1Mjc4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1954","placeOfBirth":" Wilton Manors, Florida, USA","birthName":"Nancy Elizabeth Stafford","height":"5' 9\" (1.75 m)","bio":"Nancy Stafford was born in Wilton Manors, Florida, a suburb of Ft. Lauderdale, Florida, where she was raised in a Southern Baptist family home. She has starred in many TV shows, such as Riptide (1984), Remington Steele (1982), Scarecrow and Mrs. King (1983), Who's the Boss? (1984), Hunter (1984) and Quantum Leap (1989). She also guest-starred on an episode of Magnum, P.I. (1980). Her biggest claim to fame on television was with Andy Griffith on Matlock (1986). She also guest-starred in many shows in the late 1990s such as ER (1994), Frasier (1993), Babylon 5 (1994), Baywatch (1989) and The Mentalist (2008). Additionally, Stafford played \"The Lady in the Park\" in the 2004 Award-winning short film, The Proverb (2004), along with her friends, Jeff Andrus and Scott Waara.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzA4MDk4MF5BMl5BanBnXkFtZTcwNDM1Mjc4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0821328","name":"Nancy Stafford","idIMDB":"nm0821328"},"actorId":"nm0821328","character":"Dr. Weston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antoni Corone","urlProfile":"http://www.imdb.com/name/nm0139175","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTYyNzIwNl5BMl5BanBnXkFtZTcwNDI3NDkyOA@@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"When character actor Antoni Corone launched his screen career in the mid-'80s, producers immediately foresaw a perfect niche for him, and started casting him as rugged, slightly imposing and domineering types -- including club bouncers, security personnel, military men and officers of the law. He bowed with a slate of roles in 1986, including the telefilm Charley Hannah (1986), and eventually graduated to big-screen character actor with bit parts in such A-list Hollywood features as Blood and Wine (1996), Striptease (1996), Bad Boys II (2003) and Out of Time (2003). Corone rose to higher billing with a supporting turn in the Joaquin Phoenix / Mark Wahlberg crime saga We Own the Night (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTYyNzIwNl5BMl5BanBnXkFtZTcwNDI3NDkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0139175","name":"Antoni Corone","idIMDB":"nm0139175"},"actorId":"nm0139175","character":"Detective Maurer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marc Macaulay","urlProfile":"http://www.imdb.com/name/nm0531333","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODQwMjIzOF5BMl5BanBnXkFtZTcwNzg1ODk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1957","placeOfBirth":" Millinocket, Maine, USA","bio":"Marc Macaulay was born on October 13, 1957 in Millinocket, Maine, USA. He is known for his work on Bad Boys (1995), 12 Years a Slave (2013) and Monster (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODQwMjIzOF5BMl5BanBnXkFtZTcwNzg1ODk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531333","name":"Marc Macaulay","idIMDB":"nm0531333"},"actorId":"nm0531333","character":"Chief Grimaldi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carmen López","urlProfile":"http://www.imdb.com/name/nm0530043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTkzNjUxOV5BMl5BanBnXkFtZTcwNzM2OTUyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Carmen López is an actress, known for 16 Blocks (2006), Promises (2010) and Curdled (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTkzNjUxOV5BMl5BanBnXkFtZTcwNzM2OTUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0530043","name":"Carmen López","idIMDB":"nm0530043"},"actorId":"nm0530043","character":"Clara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Verea","urlProfile":"http://www.imdb.com/name/nm0893948","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwOTg4MzY5NV5BMl5BanBnXkFtZTgwOTI2NjU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"John Verea is an actor and producer, known for Collateral Damage (2002), Postcards from the Edge (1990) and Selena (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwOTg4MzY5NV5BMl5BanBnXkFtZTgwOTI2NjU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0893948","name":"John Verea","idIMDB":"nm0893948"},"actorId":"nm0893948","character":"Noah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexa Hamilton","urlProfile":"http://www.imdb.com/name/nm0357714","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTY2NjM5N15BMl5BanBnXkFtZTcwMTc3NjA0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Alexa Hamilton is an actress, known for Trash Fire (2016), The Poseidon Adventure (2005) and Three for the Road (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTY2NjM5N15BMl5BanBnXkFtZTcwMTc3NjA0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0357714","name":"Alexa Hamilton","idIMDB":"nm0357714"},"actorId":"nm0357714","character":"Sophia Summerfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cary Wayne Moore","urlProfile":"http://www.imdb.com/name/nm1211335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MTUwMjY2MF5BMl5BanBnXkFtZTcwMjQ4NjkzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1975","placeOfBirth":" Alvin, Texas, USA","birthName":"Cary Wayne Moore","bio":"Cary Wayne Moore was born on January 3, 1975 in Alvin, Texas, USA. He is an actor and writer, known for The Overnight (2010), Do Not Disturb (2009) and The Donner Party (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MTUwMjY2MF5BMl5BanBnXkFtZTcwMjQ4NjkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1211335","name":"Cary Wayne Moore","idIMDB":"nm1211335"},"actorId":"nm1211335","character":"Randy Summerfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sydney Rouviere","urlProfile":"http://www.imdb.com/name/nm3437020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBmZDQ0MzUtMTg0My00MzEwLWE3YmItMzU1ZWJhYWU4NWFmL2ltYWdlXkEyXkFqcGdeQXVyMjEyMTY0NDA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sydney Rouviere is best known and received rave reviews for her lead role as Jason Bateman and Leslie Mann's daughter, Cara, in the hit comedy film \"The Change-Up\". Sydney was only seven years old when she took on this physically challenging role which required her to not only learn how to dance, but to learn how to do her own stunts as well. Sydney had her first experience in front of a camera at the mere age of 6 weeks by appearing on packaging of Pampers diapers worldwide. Her little face then graced dozens of national and international ads and commercials including billboards and a national campaign for \"Disney\", the cover of \"Parents\" Magazine, Toys R Us and H&M. Sydney and her brother Koby appeared together in Ben Stiller's \"Greenberg\" and in a campaign for Visit Florida. Sydney is extremely athletic and plays competitive flag football. She also loves dancing and trains several days a week. An avid animal lover, Sydney owns and fosters seven rescue dogs. She also gives graciously to various charities of her choice, through donations to various dog rescue organizations and by adopting and donating to the ASPCA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBmZDQ0MzUtMTg0My00MzEwLWE3YmItMzU1ZWJhYWU4NWFmL2ltYWdlXkEyXkFqcGdeQXVyMjEyMTY0NDA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3437020","name":"Sydney Rouviere","idIMDB":"nm3437020"},"actorId":"nm3437020","character":"Daria at 5","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taylor Castro","urlProfile":"http://www.imdb.com/name/nm4967888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODM0NDU4OV5BMl5BanBnXkFtZTgwMTMzMTM1OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Taylor Castro is known for her work on Girlfriend Killer (2017), Boyfriend Killer (2017) and Assumed Killer (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODM0NDU4OV5BMl5BanBnXkFtZTgwMTMzMTM1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4967888","name":"Taylor Castro","idIMDB":"nm4967888"},"actorId":"nm4967888","character":"Daria at Age 10","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2321195","urlIMDB":"http://www.imdb.com/title/tt2321195","business":{"budget":{"money":"$1,800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Concord Films, LLC (Florida LLC)"},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.6","filmingLocations":[{"location":"Fort Lauderdale, Florida, USA"}],"awards":[],"votes":"279","type":"Movie","companyCreditsSimple":[{"idCompany":"co0350442","name":"Concord Films"}],"keywords":{"keywords":["serial killer","car accident","amnesia","reporter","retrograde amnesia","news reporter","florida","attorney","telephone call","suspicion","suspicious wife","funeral","snake tattoo","tattoo on arm","memory loss","tattoo","doctor","bloody hand","news report","flashback","therapist","husband wife relationship","hospital","female reporter","tv reporter","female protagonist","two word title","necklace","car crash"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:40:08"}}