{"data":{"movies":[{"title":"Captives","originalTitle":"The Captive","year":"2014","releaseDate":"20141212","directors":[{"name":"Atom Egoyan","id":"nm0000382"}],"writers":[{"name":"Atom Egoyan","id":"nm0000382"},{"name":"David Fraser","id":"nm1449098"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTIxNDg0OV5BMl5BanBnXkFtZTgwNTM0MzU0MzE@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"Teenager Cassandra is locked up against her will unable to contact her family to let them know she's still alive. Flashback to eight years ago when 9-year-old Cass was abducted from her father's truck and he goes straight to the authorities who immediately peg him as the prime suspect. Eight years later, her father, Matthew, is still being investigated by the police who are also trying to crack the bigger problem of crimes against children, Matthew's marriage has deteriorated and leads in the case are hard to come by. So much time but so little has changed and it's going to be up to Matthew and Cassandra herself to repair the estranged family.","simplePlot":"Eight years after the disappearance of Cassandra, some disturbing incidents seem to indicate that she's still alive. Police, parents and Cassandra herself, will try to unravel the mystery of her disappearance.","actors":[{"actorName":"Kevin Durand","urlProfile":"http://www.imdb.com/name/nm0243806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTA3Mzg3Nl5BMl5BanBnXkFtZTgwNDk1NTUwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1974","placeOfBirth":" Thunder Bay, Ontario, Canada","birthName":"Kevin Serge Durand","height":"6' 6\" (1.98 m)","bio":"Kevin Durand was born on January 14, 1974 in Thunder Bay, Ontario, Canada as Kevin Serge Durand. He is an actor, known for X-Men Origins: Wolverine (2009), Real Steel (2011) and I Am Number Four (2011). He has been married to Sandra Cho since October 1, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTA3Mzg3Nl5BMl5BanBnXkFtZTgwNDk1NTUwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0243806","name":"Kevin Durand","nicknames":["Tree"],"idIMDB":"nm0243806"},"actorId":"nm0243806","character":"Mika","urlCharacter":"http://www.imdb.com/character/ch0497682","main":true},{"actorName":"Alexia Fast","urlProfile":"http://www.imdb.com/name/nm2145177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzNhZGE5MjYtODUxMi00OTY0LWI2OWQtOTBiZDU2ZDdiYzQ0XkEyXkFqcGdeQXVyMjYxOTA1Mg@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1992","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 9\" (1.75 m)","bio":"Originally from Vancouver Canada and bilingual in French, Alexia first took an interest in acting at the early age of seven when she wrote, directed and starred in a short film entitled The Red Bridge. At 11 years old, Alexia booked her very first feature film role opposite Carrie Anne Moss. Fido premiered at the Toronto Film Festival and Sundance. Alexia booked her first leading role at 13 years old in the indie feature Past Tense. She won a Leo Award for her performance. Soon after came the opportunity to work with Ashley Judd in the feature film Helen which also premiered at Sundance. Her performance garnered rave reviews and a Leo Award nomination. During adolescence Alexia attended the Toronto Film Festival for the premiers of her various films, including the award winning drama Blackbird, the psychological thriller Repeaters, and in the indie western Hungry Hills. Alexia is most often recognized for her role of \"Sandy\" opposite Tom Cruise in the Paramount feature Jack Reacher. The film was directed by Academy Award winner Christopher McQuarrie. Alexia is also known for her supporting role opposite Ryan Reynolds in the psychological thriller The Captive which was in competition at Cannes 2014. At the age of 21 years old Alexia took an interest in behind the camera work and found an opportunity to do so in the Sony horror Grace. Alexia camera operated over half of the film as well as playing the title role of Grace and the secondary character of Mary. In 2014 Alexia booked series regular on the Lionsgate/Skydance/WGN drama series \"Manhattan\" directed by nine-time Emmy winner Thomas Schlamme. Because of her enthusiasm for Physics and Quantum Mechanics she was thrilled to be working on a series about the making of the atomic bomb. Alexia is an advocate of authenticity and an aspiring environmentalist.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzNhZGE5MjYtODUxMi00OTY0LWI2OWQtOTBiZDU2ZDdiYzQ0XkEyXkFqcGdeQXVyMjYxOTA1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2145177","name":"Alexia Fast","idIMDB":"nm2145177"},"actorId":"nm2145177","character":"Cass","urlCharacter":"http://www.imdb.com/character/ch0489839","main":true},{"actorName":"Mireille Enos","urlProfile":"http://www.imdb.com/name/nm0257969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYyODMyOV5BMl5BanBnXkFtZTgwMzAyMDQ5MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1975","placeOfBirth":" Houston, Texas, USA","height":"5' 2\" (1.57 m)","bio":"Mireille Enos was born in Houston, Texas, to Monique, a teacher, and Jon Goree Enos. Her Texas-born American father, and French mother, met while her father was serving on a Mission for the Church of Jesus Christ of Latter Day Saints. She is the fourth of five children and grew up in Houston, Texas, where, following in her older siblings footsteps, she attended The High School for the Performing and Visual Arts. She then went to Brigham Young University. She spent ten years living in New York City during which time she was nominated for a Tony Award for her portrayal of \"Honey\" in Edward Albee's \"Who's Afraid of Virginia Woolf?\". She is now married to actor Alan Ruck.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYyODMyOV5BMl5BanBnXkFtZTgwMzAyMDQ5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0257969","name":"Mireille Enos","idIMDB":"nm0257969"},"actorId":"nm0257969","character":"Tina","urlCharacter":"http://www.imdb.com/character/ch0451846","main":true},{"actorName":"Rosario Dawson","urlProfile":"http://www.imdb.com/name/nm0206257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1979","placeOfBirth":" New York City, New York, USA","birthName":"Rosario Isabel Dawson","height":"5' 7\" (1.7 m)","bio":"This stunning and resourceful actress has been primarily a film player thus far. Only recently has she been opening herself up more to doing television (the series Gemini Division (2008), which she executive-produced), and animated voice-overs. Dawson's powerhouse talent stands out the most in edgy, urban filming that dates back to 1995 when she was only sixteen. A rags-to-riches article entitled \"Rosario Dawson: From Tenement to Tinseltown\" probably says it all. Rosario was born in New York City on May 9, 1979. Her mother, Isabel Celeste, of Puerto Rican and Afro-Cuban descent, is a singer, and her stepfather, who raised her, Greg Dawson, of Irish descent, is a construction laborer. Her parents, who married when both were teenagers, eventually divorced. Rosario and her younger brother, Clay Dawson, had it hard while growing up and was cared for by family members, most of whom were poverty-stricken and some of whom were HIV-positive. Her career actually started as a child when she made a minor showing on the children's show, Sesame Street (1969). As the story goes, she was \"discovered\" as an adolescent on her front porch step by two photographers. One of them, Harmony Korine, was an aspiring screenwriter who thought the inexperienced sixteen-year-old was ideal for the controversial cult film Kids (1995), in which she would portray a sexually active adolescent. It took time for Rosario's film career to kick in after that, but by the late 1990s, she had nabbed several independent films. Since then, she has moved into main-stream hits (and misses) and has surprised viewers with her earthy, provocative, uninhibited approach to her roles. Reflecting New York's tougher, tawdrier side as assorted streetwalkers, homeless mothers, drug addicts, etc., her film highlights have included Light It Up (1999), Edward Burns' Sidewalks of New York (2001), Spike Lee's 25th Hour (2002) and Shattered Glass (2003). For Oliver Stone, she portrayed the duped bride of Colin Farrell's famed B.C. Macedonian warrior, Alexander (2004) (as in \"...the Great\"), which featured a notoriously violent-tinged nude/sex scene. Expanding her horizons beyond film, she has always expressed interest in singing. She hooked up with Prince for the re-release of his 1980s hit \"1999\" and appeared in The Chemical Brothers' video for the song \"Out of Control\" from the album \"Surrender\". She is also featured on the Outkast track, \"She Lives in My Lap\". On stage, she co-starred as Julia in a revival of \"Two Gentlemen of Verona\" at the Public Theater's \"Shakespeare in the Park\" and appeared in \"The Vagina Monologues\". She lucked into and got to show off her singing chops in the film adaptation of the hit New York musical Rent (2005), when Daphne Rubin-Vega, the original Mimi, became pregnant and was unable to reprise her exotic dancer role. Rosario also appeared as a prostitute in the adaptation of the graphic novel Sin City (2005). Of late, she has turned to producing. One of those, Descent (2007), had her playing a college coed who is brutally attacked and raped by a fellow student. Her more popular ventures have thus far included the role of Valerie Brown in the live-action version of the comic strip Josie et les Pussycats (2001), the Will Smith starrer Men in Black II (2002), Eagle Eye (2008) with Shia LaBeouf and Seven Pounds (2008), again with Smith, in which she offered one of her more tender-hearted performances as a woman with a potentially fatal heart condition. Off-camera, the still-single Dawson is highly active in political, social and environmental causes and has been involved with such organizations/charities/campaigns as the Lower East Side Girls Club, Global Cool, the O.N.E. Campaign, Oxfam, Amnesty International, Parents, Families and Friends of Lesbians and Gays, Control Arms, International Rescue Committee, Voto Latino (which she founded), Conservation International, Doctors Without Borders, National Geographic Society, The Nature Conservancy and Save the Children. In October 2008, she lent her voice to the RESPECT! Campaign, a movement aimed at preventing domestic violence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206257","name":"Rosario Dawson","idIMDB":"nm0206257"},"actorId":"nm0206257","character":"Nicole","urlCharacter":"http://www.imdb.com/character/ch0497683","main":true},{"actorName":"Aidan Shipley","urlProfile":"http://www.imdb.com/name/nm3868446","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1NDE5NDU1Ml5BMl5BanBnXkFtZTgwODM4OTQxMDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Aidan Shipley was born in Stratford, Ontario where he was quickly immersed into the theatre community which surrounded him. He played the young son in the Stratford Festival's production of Medea, as well as Prince Arthur (the largest Shakespearean children's role) in King John and learned on the job from some of the best stage actors in the country, including Peter Donaldson, Martha Henry, Tom McCamus and Seana McKenna. After spending two years in Ireland training in hip-hop and breakdance, Aidan returned to Canada for high school where he continued both acting and dancing. While in high school, he appeared in a variety of television and film roles including Family Channel's Vacation with Derek and Showcase's Pure Pwnage. Aidan entered Ryerson University's film program to pursue directing. In addition to his full time studies, Aidan continued to land a series of television and film roles highlights of which included working with Cillian Murphy in the film Red Lights, as well as working with Ryan Reynolds in Atom Egoyan's film, Queen of the Night. Aidan has also appeared in television shows such as Rookie Blue, What's up Warthogs and Flashpoint. He is currently in his final year at Ryerson where he continues to pursue both acting and directing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1NDE5NDU1Ml5BMl5BanBnXkFtZTgwODM4OTQxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3868446","name":"Aidan Shipley","idIMDB":"nm3868446"},"actorId":"nm3868446","character":"Albert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Reynolds","urlProfile":"http://www.imdb.com/name/nm0005351","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3ODk1MTMyNV5BMl5BanBnXkFtZTcwNDEyNTE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1976","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Ryan Rodney Reynolds","height":"6' 2\" (1.88 m)","bio":"Ryan Rodney Reynolds was born on October 23, 1976 in Vancouver, British Columbia, Canada, the youngest of four children. His father, James Chester Reynolds, was a food wholesaler, and his mother, Tammy, worked as a retail-store saleswoman. Between 1991-93, Ryan appeared in Fifteen (1990), a Nickleodeon series taped in Florida with many other Canadian actors. After the series ended, he returned to Vancouver where he played in a series of forgettable television movies. He did small roles in Glenn Close's Serving in Silence: The Margarethe Cammermeyer Story (1995) and CBS's update of In Cold Blood (1996). However, his run of luck had led him to decide to quit acting. One night, he ran into fellow Vancouver actor and native Chris William Martin. Martin found Ryan rather despondent and told him to pack everything: they were going to head to Los Angeles, California. The two stayed in a cheap Los Angeles motel. On the first night of their stay, Reynolds' jeep was rolled downhill and stripped. For the next four months, Ryan drove it without doors. In 1997, he landed the role of Berg in Two Guys, a Girl and a Pizza Place (1998). Initially, the show was reviled by critics and seemed desperate for any type of ratings success. However, it was renewed for a second season but with a provision for a makeover by former Roseanne (1988) writer Kevin Abbott. The show became a minor success and has led to additional film roles for Ryan, most notably in the last-ever MGM film, a remake of The Amityville Horror (2005). Ryan was engaged to Canadian singer-songwriter Alanis Morissette, another Nickelodeon veteran, between 2004-2006. He has been married to Blake Lively since September 9, 2012. They have two children. He was previous married to Scarlett Johansson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3ODk1MTMyNV5BMl5BanBnXkFtZTcwNDEyNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005351","name":"Ryan Reynolds","idIMDB":"nm0005351"},"actorId":"nm0005351","character":"Matthew","urlCharacter":"http://www.imdb.com/character/ch0443602","main":true},{"actorName":"Paige Baril","urlProfile":"http://www.imdb.com/name/nm7021363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY2OTY0NjY2M15BMl5BanBnXkFtZTgwNzQyMzkzNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Paige Baril is an actress, known for Captives (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY2OTY0NjY2M15BMl5BanBnXkFtZTgwNzQyMzkzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm7021363","name":"Paige Baril","idIMDB":"nm7021363"},"actorId":"nm7021363","character":"Paige","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Greenwood","urlProfile":"http://www.imdb.com/name/nm0339304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwMDI5MDM1Nl5BMl5BanBnXkFtZTYwODUyNjc4._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1956","placeOfBirth":" Noranda, Québec, Canada","birthName":"Stuart Bruce Greenwood","height":"6' 0½\" (1.84 m)","bio":"Bruce Greenwood was born on August 12, 1956 in Noranda, Québec, Canada as Stuart Bruce Greenwood. He is an actor and producer, known for Star Trek (2009), I, Robot (2004) and Star Trek Into Darkness (2013). He has been married to Susan Devlin since 1985. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwMDI5MDM1Nl5BMl5BanBnXkFtZTYwODUyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339304","name":"Bruce Greenwood","idIMDB":"nm0339304"},"actorId":"nm0339304","character":"Vince","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Speedman","urlProfile":"http://www.imdb.com/name/nm0005454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTkwMzI3Ml5BMl5BanBnXkFtZTgwNjA5MDgxMjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1975","placeOfBirth":" London, England, UK","birthName":"Robert Scott Speedman","height":"5' 11\" (1.8 m)","bio":"Scott Speedman was born in London, England, to Scottish parents, Mary (Campbell), a primary school teacher, and Roy Speedman, a department store buyer. He grew up in Toronto, Canada. He was an aspiring swimmer and held a record amongst the best for distance freestyle, unfortunately, an accident put that career path on hold forever. He went to Earl Haig High School in Toronto and went to the University of Toronto in 1994 - 1996. On a dare, he went on a show called \"Speakers Corner\" and later went to audition for the role of Robin in Batman Forever (1995). When the part went to Chris O'Donnell, he managed to land an agent. Other movies he has done include Kitchen Party (1997) and Duets (2000) starring Gwyneth Paltrow. The show Felicity (1998) introduced Scott to the world and has formed quite a standing amongst fans. When the show ended in 2002, Scott's movie career took off with his breakthrough role in Underworld (2003) starring Kate Beckinsale and Bill Nighy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTkwMzI3Ml5BMl5BanBnXkFtZTgwNjA5MDgxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005454","name":"Scott Speedman","idIMDB":"nm0005454"},"actorId":"nm0005454","character":"Jeffrey","urlCharacter":"http://www.imdb.com/character/ch0497684","main":true},{"actorName":"William MacDonald","urlProfile":"http://www.imdb.com/name/nm0531966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM1NTgxNTcyMF5BMl5BanBnXkFtZTgwMjQ1MjYwNzE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Besides his work in film and television , William has also appeared in over 70 theatrical productions as of 2013. He has played the title roles in \"MacBeth\" and \"Coriolanus\", as well as Petruchio in \"Taming of the Shrew\", Enobarbus in \"Antony and Cleopatra\", Ned Weeks in \"The Normal Heart\", John in \"Oleanna\", Aston in \"The Caretaker\", Starbuck in \"The Rainmaker\" and Johnny in \"Frankie and Johnny in the Claire De Lune\", to name a few. He has also directed over a dozen plays, including his own compositions \"Coco-Puffs and Caviar\" and \"Phantoms\". His son, Kaito, was born in March of 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM1NTgxNTcyMF5BMl5BanBnXkFtZTgwMjQ1MjYwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531966","name":"William MacDonald","nicknames":["Bill"],"idIMDB":"nm0531966"},"actorId":"nm0531966","character":"Frank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Blicker","urlProfile":"http://www.imdb.com/name/nm0088379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NDc0NzM3N15BMl5BanBnXkFtZTgwNTAwODQyNzE@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"bio":"Jason Blicker is an actor and producer, known for Ally McBeal (1997), Bark Ranger (2015) and State of Grace (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NDc0NzM3N15BMl5BanBnXkFtZTgwNTAwODQyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0088379","name":"Jason Blicker","idIMDB":"nm0088379"},"actorId":"nm0088379","character":"Sam","urlCharacter":"http://www.imdb.com/character/ch0489842","main":true},{"actorName":"Aaron Poole","urlProfile":"http://www.imdb.com/name/nm0690803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc3OTkxOTY4NF5BMl5BanBnXkFtZTgwMjEzNzQxMTE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Most recently nominated for his portrayal of Captain John Slotter in the Netflix and CBC drama \"Strange Empire\", Aaron Poole is no stranger in Canada's screen community. Since appearing in Ed Gass-Donnelly's \"This Beautiful City\" at TIFF '08 (a role that garnered him ACTRA's Award for Best Actor and another Canadian Academy nomination), his work has received much acclaim. With roles that include two seasons in BBC America and Tom Fontana's \"Copper\"; starring in and producing Christopher MacBride's cult hit, \"The Conspiracy\"; and leading opposite both Donald and Kiefer Sutherland in \"Forsaken\", Aaron's opportunities have just begun to expand outside Canada. This year he will be seen stateside starring opposite Will Patton, Maggie Grace, and Maika Munroe in \"The Scent of Rain and Lightning\"; recurring opposite Dennis Haysbert and Julia Ormond in CBS/Syfy series \"Incorporated\", and supporting James Badge Dale in up-and-coming director David Prior's \"The Empty Man\" from 20th Century Fox.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc3OTkxOTY4NF5BMl5BanBnXkFtZTgwMjEzNzQxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0690803","name":"Aaron Poole","idIMDB":"nm0690803"},"actorId":"nm0690803","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brendan Gall","urlProfile":"http://www.imdb.com/name/nm2219687","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGQ0ZTc0MjMtOGI1OC00MDdjLTg4MmEtM2E1ZGIxMzc1NzBiXkEyXkFqcGdeQXVyMjM5MDk1ODA@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Brendan Gall is an actor and producer, known for Blindspot (2015), The L.A. Complex (2012) and Dakota (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGQ0ZTc0MjMtOGI1OC00MDdjLTg4MmEtM2E1ZGIxMzc1NzBiXkEyXkFqcGdeQXVyMjM5MDk1ODA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2219687","name":"Brendan Gall","idIMDB":"nm2219687"},"actorId":"nm2219687","character":"Teddy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peyton Kennedy","urlProfile":"http://www.imdb.com/name/nm4922528","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZkY2Q5OGUtMzgzMi00ZGRiLWJmYzgtNTM0YjI1ZDdhYzA5L2ltYWdlXkEyXkFqcGdeQXVyMjY2OTM0MDQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 2004","placeOfBirth":" Toronto, Ontario, Canada","bio":"Peyton Kennedy was born on January 4, 2004 in Toronto, Ontario, Canada. She is an actress, known for American Fable (2016), Odd Squad (2014) and Captives (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZkY2Q5OGUtMzgzMi00ZGRiLWJmYzgtNTM0YjI1ZDdhYzA5L2ltYWdlXkEyXkFqcGdeQXVyMjY2OTM0MDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4922528","name":"Peyton Kennedy","idIMDB":"nm4922528"},"actorId":"nm4922528","character":"Young Cass","urlCharacter":"http://www.imdb.com/character/ch0489839","main":true},{"actorName":"Mark Gorodnitsky","urlProfile":"http://www.imdb.com/name/nm7021364","urlPhoto":"","biography":{"bio":"Mark Gorodnitsky is an actor, known for Captives (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7021364","name":"Mark Gorodnitsky","idIMDB":"nm7021364"},"actorId":"nm7021364","character":"Young Albert","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2326612","urlIMDB":"http://www.imdb.com/title/tt2326612","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 52 min (112 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Digital Intermediate"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"5.9","metascore":"36","filmingLocations":[{"location":"Ontario, Canada"}],"rated":"R","awards":[{"award":"Canadian Screen Awards, CA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Canadian Screen Award","categories":[{"category":"Achievement in Art Direction/Production Design","names":[{"name":"Phillip Barker","id":"nm0054974","role":null}]},{"category":"Achievement in Direction","names":[{"name":"Atom Egoyan","id":"nm0000382","role":null}]},{"category":"Performance by an Actor in a Leading Role","names":[{"name":"Ryan Reynolds","id":"nm0005351","role":null}]},{"category":"Original Screenplay","names":[{"name":"Atom Egoyan","id":"nm0000382","role":null},{"name":"David Fraser","id":"nm1449098","role":null}]}]}]},{"award":"Cannes Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Atom Egoyan","id":"nm0000382","role":null}]}]}]},{"award":"Directors Guild of Canada 2015","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Craft Award","categories":[{"category":"Picture Editing - Feature Film","names":[{"name":"Susan Shipton","id":"nm0794156","role":null}]},{"category":"Sound Editing - Feature Film","names":[{"name":"Steve Munro","id":"nm0613171","role":"Supervising Sound Editor / Sound Designer"},{"name":"David Drainie Taylor","id":"nm0852223","role":"Dialogue Editor"},{"name":"John Loranger","id":"nm1619200","role":"ADR Editor"},{"name":"Mitch Bederman","id":"nm4182346","role":"Music Editor"}]}]}]},{"award":"The Joey Awards, Vancouver 2014","titlesAwards":[{"titleAwardOutcome":"Won Joey Award","categories":[{"category":"Young Actress in a Feature Film Principal or Supporting Role","names":[{"name":"Peyton Kennedy","id":"nm4922528","role":null}]}]}]}],"votes":"20,790","type":"Movie","companyCreditsSimple":[{"idCompany":"co0093742","name":"Ego Film Arts"},{"idCompany":"co0000804","name":"Film Farm, The"}],"keywords":{"keywords":["disappearance","flashback","locked up","9 year old","female detective","police detective","tween girl","camera shot of feet","female stockinged soles","female stockinged feet","female stockinged legs","pantyhose","van","drugged","dinner","tooth","police arrest","arrest","internet chat","laptop","suspicion","investigation","snow","ice skating","husband wife relationship","video camera","pedophile","basement","locked in","teenage girl","missing girl","child kidnapping","kidnapped child","kidnapping","disappearance of a child","9 year old girl","little girl"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:50:08"}}