{"data":{"movies":[{"title":"Sanitarium","originalTitle":"","year":"2013","releaseDate":"20140201","directors":[{"name":"Bryan Ortiz","id":"nm2624159"},{"name":"Bryan Ramirez","id":"nm2005379"}],"writers":[{"name":"Kerry Valderrama","id":"nm2415923"},{"name":"Crystal Bratton","id":"nm3757854"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjI3MDM2Nl5BMl5BanBnXkFtZTgwNDM4OTk2MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"Three stories of the mentally ill: 1. Artist begins taking orders from the dolls he exhibits. 2. Eight year old boy, cruel father, concerned teacher and hallucinatory monster come into conflict. 3. Professor convinced of the Mayan apocalypse prophesies, builds bomb shelter to save his family.","simplePlot":"A ghastly figure stalks a young boy as he struggles with an abusive home life. But when a concerned teacher reaches out to help him, will the monster prove to be a figment of his imagination, or something else entirely?","actors":[{"actorName":"Malcolm McDowell","urlProfile":"http://www.imdb.com/name/nm0000532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1943","placeOfBirth":" Horsforth, Yorkshire, England, UK","birthName":"Malcolm John Taylor","height":"5' 8½\" (1.74 m)","bio":"Malcolm John Taylor was born on June 13, 1943 in Leeds, England, to working-class parents Edna (McDowell), a hotelier, and Charles Taylor, a publican. His father was an alcoholic. Malcolm hated his parents' ways. His father was keen to send his son to private school to give him a good start in life, so Malcolm was packed off to boarding school at age 11. He attended the Tunbridge Boarding School and the Cannock House School in Eltham, Kent. At school, he was beaten with the slipper or cane every Monday for his wayward behavior. Whilst at school, he decided that he wanted to become an actor; it was also around this time that his love for race cars began. He attended the London Academy of Music and Dramatic Arts (LAMDA) to study acting. Meanwhile, he worked at his parents' pub but lost his job when the pub went bankrupt, his father drinking all the profits. He then had a variety of jobs, from coffee salesman to messenger. His first big-screen role was in Poor Cow (1967), although his two-minute scene was ultimately cut from the completed film. Soon after, he caught the attention of director Lindsay Anderson who cast him in the role of a rebellious student in his film If.... (1968). The film catapulted Malcolm to stardom in Britain but failed everywhere else. He was so enthusiastic about the film's success that he wanted to do another right away. He began writing what would become the semi-autobiographical O Lucky Man! (1973). Meanwhile, he starred as the infamous Alex DeLarge in Stanley Kubrick's controversial A Clockwork Orange (1971), a role that caused him to be typecast as a manic psychopathic villain. In early 1976, he spent nearly a year working on what would later be one of the most infamous films of all time, the semi-pornographic Caligula (1979), financed by Penthouse magazine founder Bob Guccione. Around that time, the British film industry collapsed, forcing him to flee to America to continue working. His first American film was Time After Time (1979). He then did Britannia Hospital (1982), the last part of Lindsay Anderson's working-class trilogy that started with If.... (1968). In the mid-1980s, the years of alcohol and drug abuse, including $1000 a week on cocaine, caught up with him. Years of abuse took its toll on him; his black hairs were now grey. Looking older than he really was, nobody wanted to cast him for playing younger roles. The big roles having dried up, he did many B-rated movies. The 1990s were kinder to him, though. In 1994, he was cast as Dr. Tolian Soran, the man who killed Captain James T. Kirk in Star Trek: Generations (1994). He was back on the track, playing villains again. He played another in the classic BBC miniseries Our Friends in the North (1996). Today, with more than 100 films under his belt, he is one of the greatest actors in America. He still does not have American citizenship, but he likes the no-nonsense American ways. He resides in the northern suburbs of Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000532","name":"Malcolm McDowell","nicknames":["Mick"],"idIMDB":"nm0000532"},"actorId":"nm0000532","character":"Dr. Stenson","urlCharacter":"http://www.imdb.com/character/ch0393645","main":true},{"actorName":"Lou Diamond Phillips","urlProfile":"http://www.imdb.com/name/nm0001617","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NTgwMTQzMl5BMl5BanBnXkFtZTcwMjAzNTM4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1962","placeOfBirth":" Subic Bay Naval Base, Olongapo City, Zambales, Philippines","birthName":"Lou Diamond Upchurch","height":"6' 1\" (1.85 m)","bio":"Lou Diamond Phillips was born on February 17, 1962 in Subic Bay Naval Base, Olongapo City, Zambales, Philippines as Lou Diamond Upchurch. He is an actor, known for Courage Under Fire (1996), La Bamba (1987) and Longmire (2012). He has been married to Yvonne Boismier Phillips since August 16, 2007. They have one child. He was previously married to Kelly Phillips and Julie Cypher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NTgwMTQzMl5BMl5BanBnXkFtZTcwMjAzNTM4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001617","name":"Lou Diamond Phillips","idIMDB":"nm0001617"},"actorId":"nm0001617","character":"James Silo","urlCharacter":"http://www.imdb.com/character/ch0393646","main":true},{"actorName":"John Glover","urlProfile":"http://www.imdb.com/name/nm0001278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ5NTUzOTQ4MF5BMl5BanBnXkFtZTYwNjUxNjIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1944","placeOfBirth":" Salisbury, Maryland, USA","birthName":"John Soursby Glover Junior","height":"6' (1.83 m)","bio":"John Soursby Glover, Jr., is an American actor, known for a range of villainous roles in films and television, including Lionel Luthor on the Superman-inspired television series Smallville. In 1993 he co-starred in the dark comedy Ed and His Dead Mother with Steve Buscemi and Ned Beatty.Glover was born in Salisbury, Maryland, the son of Cade (née Mullins) and John Soursby Glover, Sr., a television salesman. Glover attended Wicomico High School and acted at Towson University. Glover began his career at the Barter Theatre in Abingdon, Virginia, and later studied acting at the Beverly Hills Playhouse under Milton Katselas. Aside from his theatrical endeavors, Glover is also actively involved with the Alzheimer's Association. His inspiration for joining this cause was his own father's experience with Alzheimer's disease.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ5NTUzOTQ4MF5BMl5BanBnXkFtZTYwNjUxNjIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001278","name":"John Glover","idIMDB":"nm0001278"},"actorId":"nm0001278","character":"Gustav","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Englund","urlProfile":"http://www.imdb.com/name/nm0000387","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzOTMwMzgzMV5BMl5BanBnXkFtZTYwODg2MDM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1947","placeOfBirth":" Glendale, California, USA","birthName":"Robert Barton Englund","height":"5' 9¾\" (1.77 m)","bio":"Veteran character actor Robert Englund was born in Glendale, California, to Janis (MacDonald) and John Kent Englund, an aeronautics engineer. He has Swedish, Danish, Scottish, and English ancestry. Since 1973, Englund has appeared in over 75 feature films and starred in four TV series. He has starred alongside Oscar-winners Henry Fonda, Susan Sarandon and Jeff Bridges. Since 1984 he's achieved international fame as the iconic boogeyman Freddy Krueger in the hit franchise A Nightmare on Elm Street and its seven sequels. Englund has guest starred in hundreds of hours of TV most recently Bones, Criminal Minds and Hawaii 5-0. He will soon be seen starring in the horror film Fear Clinic, and the English thriller The Last Showing, he can be heard as the voice of the Evil Beaver in Teenage Mutant Ninja Turtles cartoon show.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzOTMwMzgzMV5BMl5BanBnXkFtZTYwODg2MDM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000387","name":"Robert Englund","idIMDB":"nm0000387"},"actorId":"nm0000387","character":"Sam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ngozi K. Udenkwo","urlProfile":"http://www.imdb.com/name/nm5797170","urlPhoto":"","biography":{"bio":"Ngozi K. Udenkwo is an actress, known for Sanitarium (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5797170","name":"Ngozi K. Udenkwo","idIMDB":"nm5797170"},"actorId":"nm5797170","character":"Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Albert Flores","urlProfile":"http://www.imdb.com/name/nm6259759","urlPhoto":"","biography":{"bio":"Albert Flores grew up in San Antonio, Texas. Albert has worked as a Chief Meteorologist in Austin at KTBC, in the valley at KRGV, in Corpus Christi at KIII, at KENS 5 in San Antonio and as the Chief Meteorologist for News 4 San Antonio Albert is married and has two children and four grandchildren.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6259759","name":"Albert Flores","idIMDB":"nm6259759"},"actorId":"nm6259759","character":"Reporter #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Mulkey","urlProfile":"http://www.imdb.com/name/nm0611889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzIyNjg1Ml5BMl5BanBnXkFtZTgwNzE2MzAyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1948","placeOfBirth":" Viroqua, Wisconsin, USA","birthName":"Christian Homer Mulkey Jr.","height":"6' 1\" (1.85 m)","bio":"Chris Mulkey was born on May 3, 1948 in Viroqua, Wisconsin, USA as Christian Homer Mulkey Jr. He is an actor and producer, known for Whiplash (2014), Captain Phillips (2013) and First Blood (1982). He was previously married to Karen Landry and Lorraine M Smith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzIyNjg1Ml5BMl5BanBnXkFtZTgwNzE2MzAyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611889","name":"Chris Mulkey","idIMDB":"nm0611889"},"actorId":"nm0611889","character":"Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandy Lopez","urlProfile":"http://www.imdb.com/name/nm2379397","urlPhoto":"","biography":{"bio":"Brandy Lopez is an actress, known for Sanitarium (2013), Gino's Wife (2016) and The Last Supper (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2379397","name":"Brandy Lopez","idIMDB":"nm2379397"},"actorId":"nm2379397","character":"Reporter #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Mazouz","urlProfile":"http://www.imdb.com/name/nm3458761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBjNTZlZDQtMGQzOC00ZDQ0LThhNjUtZDlmZWVlY2FiMTI1XkEyXkFqcGdeQXVyMjE4NDc4MDU@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 2001","placeOfBirth":" Los Angeles, California, USA","height":"5' 8\" (1.73 m)","bio":"David (pronounced \"Dah-veed\") Mazouz, aged 16 as of February 2017, began his acting career in commercials. At eight years old, he landed his first film, Coming & Going (2011), directed by Edoardo Ponti. Shortly thereafter, he was cast in the cable movie Amish Grace (2010). He then landed a role as the co-star of the Fox television series, Touch (2012), as Jake, alongside Kiefer Sutherland who plays his father, Martin. Jake never speaks. He is obsessed with numbers - writing long strings of them in his ever-present notebooks Jake has the ability to perceive the seemingly hidden patterns that connect every life on the planet. It is up to his father, Martin, to help connect with Jake and shape humanity's destiny. David is also the narrator on the show. Along with his thriving television career, David shows his versatility in the horror thriller Sanitarium (2013). He stars alongside Malcolm McDowell, Lou Diamond Phillips, Lacey Chabert, Chris Mulkey and Robert Englund. In the summer of 2013, David shot Disney's The Games Maker (2014) in Argentina with Joseph Fiennes and Edward Asner. David also stars in Incarnate (2016) alongside Aaron Eckhart as a boy possessed by a demon. In 2014, David was cast in the role of the young Bruce Wayne in the Warner Bros. production for Fox Gotham (2014). David's other television credits include a kid in detention in Mike & Molly (2010), James Spader's son on The Office (2005), a troubled youth on Private Practice (2007), a dying boy on Criminal Minds (2005), Steve on Major Crimes (2012) and Ryan Hatcher on Drop Dead Diva (2009). His latest film is The Darkness (2016) with Kevin Bacon, Radha Mitchell and Lucy Fry about a family battling their own personal demons as well as a supernatural one he brings back from a holiday. David was born in Los Angeles, California, to Rachel, a psychotherapist, and Michel Mazouz, a physician. He has an older sister who is in College now but has been acting in theatrical productions and improv for several years. He is from a Sephardi Jewish family; his father is from Tunisia, and his mother was born in the U.S., to parents from Greece. David has studied musical and sketch improvisation at Second City, as well as The Improv, where he wrote his own material. While David has already accomplished so much and reached important milestones in his career, his dream is to work with his idols, including Steven Spielberg, Tina Fey, Kristen Wiig, J.J. Abrams, Tim Burton, Leonardo DiCaprio, Robert Downey Jr. and David O. Russell. He enjoys spending time with his friends from school, his dogs, and his sister. He is fascinated by maps and geography, and loves movies, learning guitar, writing lyrics, singing, dancing and acting. David regularly takes guitar lessons. In fact, he got a guitar from Touch costar Kiefer Sutherland as an 11th-birthday present.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBjNTZlZDQtMGQzOC00ZDQ0LThhNjUtZDlmZWVlY2FiMTI1XkEyXkFqcGdeQXVyMjE4NDc4MDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3458761","name":"David Mazouz","idIMDB":"nm3458761"},"actorId":"nm3458761","character":"Steven","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tyler Driskill","urlProfile":"http://www.imdb.com/name/nm6259760","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgzODE1Njk3Ml5BMl5BanBnXkFtZTgwNzM1OTIyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tyler Driskill is a director and actor, known for Good Luck Bub (2016) and Sanitarium (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgzODE1Njk3Ml5BMl5BanBnXkFtZTgwNzM1OTIyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6259760","name":"Tyler Driskill","idIMDB":"nm6259760"},"actorId":"nm6259760","character":"Cameraman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Perez","urlProfile":"http://www.imdb.com/name/nm1391090","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMyODE1MzE4OV5BMl5BanBnXkFtZTgwOTY0OTE2MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1982","placeOfBirth":" South Gate, California, USA","bio":"Raised in South Gate, California, just 20 miles southeast of Hollywood, Walter Perez was always eager to express himself artistically. In his earlier years, he often directed and played the lead character in several homemade movies where he mimicked his movie idols such as Charlie Chaplin. His working-class parents were unable to afford him the resources he needed to gain access to the industry. It wasn't until he heard about Colors United, a performing arts group aimed at inner-city high school students that he really got the chance to show others his talents. For three years he honed his acting, singing and dancing skills with the group. Since high school, Walter has juggled auditions and a full-time schedule at Cal State Fullerton. During college, he has booked several commercials and various guest star spots on prime time television shows. Most recently, Walter's guest appearances include \"CSI: Miami\", \"The Closer\" and \"Free Radio\" as well as a five episode arc on \"Friday Night Lights\". His feature film credits include HBO's \"Walkout\" and winner of the John Cassavetes award \"August Evening\". He just completed the title role in \"Emilio\" and worked on \"Run For Your Life\" alongside Dermot Mulroney and Diane Kruger.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMyODE1MzE4OV5BMl5BanBnXkFtZTgwOTY0OTE2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1391090","name":"Walter Perez","idIMDB":"nm1391090"},"actorId":"nm1391090","character":"Mateo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Botsford","urlProfile":"http://www.imdb.com/name/nm6259761","urlPhoto":"","biography":{"bio":"Michael Botsford is an actor, known for Sanitarium (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6259761","name":"Michael Botsford","idIMDB":"nm6259761"},"actorId":"nm6259761","character":"Cameraman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mayra Leal","urlProfile":"http://www.imdb.com/name/nm3077040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzFiMmUxZmQtYjQ1ZS00MWFkLThmMDUtZWY4NDFhMzkzN2Y3L2ltYWdlXkEyXkFqcGdeQXVyMTk3ODA4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1986","placeOfBirth":" Houston, Texas, USA","birthName":"Mayra Jeanette Leal","height":"5' 1¾\" (1.57 m)","bio":"Mayra Leal is a Latina cinema artist of Mexican and El Salvadorian descent, born in Houston, Texas. The University of Houston Communications and Mathematics graduate has discovered a passion for film, TV and digital media and is garnering the attention of veteran producers, directors, business leaders, marketing agencies, fashion designers, and a growing loyal fan-base. She enjoys the business of entertainment, but loves to spend time with her family and friends when not on the set. She currently resides in Malibu. Mayra has over 32 movie and TV credits to her name and has appeared in several music videos, featured in \"Locked Up Abroad in Bangladesh\" - National Geographic, \"Revolution\", \"Southland\", and \"Memphis Beat\". She has also been introduced in \"Machete\" by Director Robert Rodriguez, starred in \"Playing House\" by Director Tom Vaughn and supported in \"Sanitarium\" with Robert Englund (\"Freddy Kruger\") and Lou Diamond Phillips, to name a few. She most recently completed \"The Wisdom to Know the Difference\" by Director Daniel Baldwin with William Baldwin, Lou Diamond Phillips, Andy Bowles Elle LaMont and Faith Stanek, which resulted in four best pictures with prominent film festivals and two best actor nominations for Mayra.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzFiMmUxZmQtYjQ1ZS00MWFkLThmMDUtZWY4NDFhMzkzN2Y3L2ltYWdlXkEyXkFqcGdeQXVyMTk3ODA4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3077040","name":"Mayra Leal","idIMDB":"nm3077040"},"actorId":"nm3077040","character":"Isabelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Venda D'Abato","urlProfile":"http://www.imdb.com/name/nm2440334","urlPhoto":"","biography":{"height":"5' 7½\" (1.71 m)","bio":"Venda D'Abato is known for her work on Hardball: All Balls Don't Bounce (2008), Sanitarium (2013) and The Killing Strain (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2440334","name":"Venda D'Abato","nicknames":["V"],"idIMDB":"nm2440334"},"actorId":"nm2440334","character":"Mirror Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Fonseca","urlProfile":"http://www.imdb.com/name/nm5797171","urlPhoto":"","biography":{"bio":"Eric Fonseca is known for his work on Sanitarium (2013) and Squeezebox (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5797171","name":"Eric Fonseca","idIMDB":"nm5797171"},"actorId":"nm5797171","character":"Gustav's Friend","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2449810","urlIMDB":"http://www.imdb.com/title/tt2449810","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.6","filmingLocations":[{"location":"San Antonio, Texas, USA"}],"awards":[],"votes":"1,408","type":"Movie","companyCreditsSimple":[]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:37:47"}}