{"data":{"movies":[{"title":"Walk of Shame","originalTitle":"","year":"2014","releaseDate":"20140521","directors":[{"name":"Steven Brill","id":"nm0109359"}],"writers":[{"name":"Steven Brill","id":"nm0109359"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg2Mzk0NzU2M15BMl5BanBnXkFtZTgwMjAyNjYxMTE@._V1.jpg","countries":["USA"],"languages":["English","Hebrew"],"genres":["Comedy"],"plot":"Meghan Miles is a TV correspondent who works at a local Tv station. She gets an opportunity to work at a network. She goes home to celebrate with her boyfriend. Her friends show up to celebrate with her. But they find her despondent. It seems like her boyfriend left without saying good bye and the network is leaning towards someone else. Her friends convince her to go out and get drunk. They get her to put on a hot dress. She eventually gets so drunk that a guy offers to take her home but she prefers to go to his place. And she spends the night. When she wakes up she gets s call telling her that the network is reconsidering her so she has to go to work but her car was towed away and her wallet which in her purse is also in it. And she left her phone at the guy's place. She then finds herself wandering around downtown LA and runs into drug dealers and people think she's a hooker. So she has to find a way get to work. And even the police are after her.","simplePlot":"A reporter's dream of becoming a news anchor is compromised after a one-night stand leaves her stranded in downtown L.A. without a phone, car, ID or money - and only 8 hours to make it to the most important job interview of her life.","actors":[{"actorName":"Elizabeth Banks","urlProfile":"http://www.imdb.com/name/nm0006969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTcxNDU3NV5BMl5BanBnXkFtZTcwOTE0MzEzNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1974","placeOfBirth":" Pittsfield, Massachusetts, USA","birthName":"Elizabeth Maresal Mitchell","height":"5' 4½\" (1.64 m)","bio":"Elizabeth Banks was born Elizabeth Mitchell in Pittsfield, a small city in the Berkshires in western Massachusetts near the New York border, on February 10, 1974. She is the daughter of Ann (Wallace), who worked in a bank, and Mark P. Mitchell, a factory worker. Elizabeth describes herself as having been seen as a \"goody two-shoes\" in her youth who was nominated for the local Harvest Queen. Banks left home to attend college at the University of Pennsylvania--from which she graduated Magna cum Laude--and went on to attend the Advanced Training Program at the prestigious American Conservatory Theater in San Francisco, graduating in 1996. She then moved to New York and worked in the theater, and began getting small roles in films and on television. Seeking more screen work, she moved to Los Angeles and was soon cast in supporting roles. She also had to change her last name, to Banks, in order to avoid confusion with actress Elizabeth Mitchell. Her breakthrough role was as Betty Brant, the secretary of the cantankerous newspaper tycoon in Sam Raimi's Spider-Man (2002). She followed up this performance with small roles in other movies: Swept Away (2002), Steven Spielberg's Catch Me If You Can (2002), Seabiscuit (2003) and The 40-Year-Old Virgin (2005). In 2003 she won the Exciting New Face Award at the Young Hollywood Awards. The winsome, beautiful Banks projected an exceptionally charming screen presence that drew comparisons to Audrey Hepburn, and Hollywood eventually began to take notice, Banks being cast in the lead in such films as Kevin Smith's Zack and Miri Make a Porno (2008) and in Oliver Stone's biopic of George W. Bush, W. (2008), as Laura Bush. In television Banks was a recurring guest star on Scrubs (2001) as Dr. Kim Briggs, the love interest of Zach Braff's J.D. In 2010 she was cast as Alec Baldwin's love interest in season four of 30 Rock (2006). Originally scheduled to appear in only four episodes, she was brought back as a recurring character for two more seasons, and earned Emmy nominations for Outstanding Guest Actress in a Comedy Series for two consecutive years. Banks has more recently appeared in such films as Our Idiot Brother (2011), Man on a Ledge (2012), What to Expect When You're Expecting (2012), People Like Us (2012), and Pitch Perfect (2012). She also won the coveted role as Effie Trinket in The Hunger Games (2012) and The Hunger Games: Catching Fire (2013). Banks married Max Handelman, a sports writer and producer, in 2003. They have two sons, Felix, who was born in March 2011, and Magnus, born in Nov. 2012, both by gestational surrogacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTcxNDU3NV5BMl5BanBnXkFtZTcwOTE0MzEzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006969","name":"Elizabeth Banks","idIMDB":"nm0006969"},"actorId":"nm0006969","character":"Meghan","urlCharacter":"http://www.imdb.com/character/ch0385692","main":true},{"actorName":"James Marsden","urlProfile":"http://www.imdb.com/name/nm0005188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1973","placeOfBirth":" Stillwater, Oklahoma, USA","birthName":"James Paul Marsden","height":"5' 10\" (1.78 m)","bio":"James Paul Marsden, or better known as just James Marsden, was born on September 18, 1973, in Stillwater, Oklahoma, to Kathleen (Scholz) and James Luther Marsden. His father, a distinguished Professor of Animal Sciences & Industry at Kansas State University, and his mother, a nutritionist, divorced when he was nine years old. James grew up with his four other siblings, sisters, Jennifer and Elizabeth, and brothers, Jeff and Robert. He has English, German, and Scottish ancestry. During his teen years, he attended Putnam City North High School which was located in Oklahoma City. After graduating in 1991, he attended Oklahoma State University and studied Broadcast Journalism. While in university, he became a member of the Delta Tau Delta fraternity. While vacationing with his family in Hawaii, he met actor Kirk Cameron, and his actress sister, Candace Cameron Bure. They eventually invited James to visit them in Los Angeles. After studying in Oklahoma State for over a year and appearing in his college production, \"Bye Bye Birdie\", he left school and moved to Los Angeles to pursue his interest in acting. James got his first job on the pilot episode of The Nanny (1993) as Eddie, who was Margaret Sheffield's boyfriend. He then became part of the Canadian television series, Boogies Diner (1994), which aired for one season. After that series ended, he got a brief role as the original Griffin on Fox's Party of Five (1994). His first big break came when he became the lead on the short-lived ABC series, Second Noah (1996). Although the show didn't last long, the young actor received enough exposure from the public and even managed to win the hearts of fellow teenage girls. In 1996, he attended an audition for a movie titled Primal Fear (1996) but unfortunately lost that role to Edward Norton. Two years later, he was offered a lead role in 54 (1998), which he turned down. The role later went to another actor, Ryan Phillippe. James' star power increased when he starred in David Nutter's Comportements troublants (1998), alongside Katie Holmes and Nick Stahl, which had mixed reviews, but mostly positive ones. His role in the television series as Glenn Foy in Ally McBeal (1997), is probably one of his biggest achievement to date. He became one of the main cast members during the first half of season 5, where he showcased his singing abilities. It was in that show where he was able to grab the attention of audiences from different backgrounds. The 5' 10\" star later played Lon Hammon Jr. in the romantic movie, The Notebook (2004), which was based on a novel by Nicholas Sparks of the same name. His movies, Lies & Alibis (2006) and 10th & Wolf (2006) was also released around the world to audiences in the year 2006. One of his most memorable roles to fans is his role as Cyclops in the X-Men (2000) movie franchise. The movie was well accepted by audiences and critics, which eventually made James one of the hottest stars since it was released. He was among the actors who starred in all three of the X-Men movies. James had the honor of working alongside Patrick Stewart, Famke Janssen and Hugh Jackman in the film. However, not many people know that he actually had to wear lifts for most of his scenes in the X-men movies, because his character Cyclops is supposed to be 6\" 3\" compared to a 5' 3\" Wolverine. In reality, he is actually under 6' 0\", shorter than Famke Janssen who plays his love interest, Jean Grey, and even shorter than Hugh Jackman who played Wolverine. In the year 2006, he played Richard White in the highly anticipated movie, Superman Returns (2006), which coincidentally was directed by Bryan Singer, who also directed previous X-Men installments. Although he appeared in X-Men: L'affrontement final (2006), the third installment of the X-Men franchise, many would notice that he in fact had more screen time in 'Superman Returns', as Lois Lane's long awaiting fiancé who had to accept the fact that his fiancée is in love with the man of steel. James earned great reviews from that movie, which led to him getting more movie roles. In 2007, James played Corny Collins in the film Hairspray (2007), an adaption of the Broadway musical based on John Waters movie, Hairspray (1988). He joined a star-studded cast, starring alongside top names such as John Travolta, Queen Latifah and Michelle Pfeiffer. James not only acted in that movie, but also sang two of the film's songs, \"The Nicest Kids In Town\", and \"Hairspray\". Being part of Hairspray catapulted James to a different level of stardom as audiences got to see another side of him. His next role was in the Disney movie, Enchanted (2007), playing Prince Edward, where he acted alongside Amy Adams, Susan Sarandon and Patrick Dempsey. Once again, James had the opportunity to sing in two songs from the movie, \"True Love's Kiss\" and \"That's Amore\". Enchanted (2007) appealed to not only older audiences but also to those who were fans of Disney's network productions. Following his huge success in the years 2006 and 2007, James played the male lead role in the romantic comedy, 27 Dresses (2008), opposite actress Katherine Heigl in 2008. The movie did well at the box office, earning a gross revenue of over $159 million, which exceeded the expectations of crew members especially since it was under a $30 million budget. Marsden played the male lead in the horror film, The Box (2009), based on the 1970 short story \"Button, Button\" by author Richard Matheson. He starred opposite Cameron Diaz in the movie. He co-starred in Accidental Love (2015) (previously Accidental Love (2015), a politically-themed romantic comedy, directed by David O. Russell and filmed in Columbia, South Carolina. Marsden's recent film roles include the sequel comedy Anchorman 2: The Legend Continues (2013), the romantic drama The Best of Me (2014), and the comedy Unfinished Business (2015). James was married to Lisa Linde, an actress known from her role in Days of Our Lives (1965). Lisa is the daughter of legendary country music songwriter Dennis Linde. The couple wed on July 22, 2000 and have a son, Jack Holden Marsden who was born on February 1, 2001, and a daughter, Mary James, who was born on August 10, 2005. They divorced in 2011. James has another son, born in 2012, with model Rose Costa. Many would assume that with all this success achieved by James at this age, he would be somewhat high-headed but James mentioned that despite all the attention he's getting from the public eye, he tries to keep himself as grounded as possible. He even admits that he flies coach instead of first class while traveling with his family. In an interview he mentioned that he believes he has a certain responsibility to let his children know that he isn't special because of what he does, but who he is as a person. With a great humble attitude and a bright future ahead of him, there's definitely more to expect from this Oklahoma native.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005188","name":"James Marsden","nicknames":["Bello Jimmy","J. P."],"idIMDB":"nm0005188"},"actorId":"nm0005188","character":"Gordon","urlCharacter":"http://www.imdb.com/character/ch0434618","main":true},{"actorName":"Gillian Jacobs","urlProfile":"http://www.imdb.com/name/nm1843026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTc5MTM1OV5BMl5BanBnXkFtZTcwMTU4NDI1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1982","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Gillian McLaren Jacobs","height":"5' 4\" (1.63 m)","bio":"Gillian Jacobs was born on October 19, 1982 in Pittsburgh, Pennsylvania, USA as Gillian McLaren Jacobs. She is an actress, known for Community (2009), The Box (2009) and Don't Think Twice (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTc5MTM1OV5BMl5BanBnXkFtZTcwMTU4NDI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1843026","name":"Gillian Jacobs","nicknames":["Gill"],"idIMDB":"nm1843026"},"actorId":"nm1843026","character":"Rose","urlCharacter":"http://www.imdb.com/character/ch0434619","main":true},{"actorName":"Sarah Wright","urlProfile":"http://www.imdb.com/name/nm0942792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgzODAyODA1Ml5BMl5BanBnXkFtZTcwNTIxMDk5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1983","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Sarah Fay Wright","height":"5' 9\" (1.75 m)","bio":"This Kentucky native began her career, in her home state and abroad in Europe, singing with The Kentucky Ambassadors of Music. Sarah attended Seneca High School in Kentucky. Discovered by a modeling agent, Sarah moved to Chicago where her career took off. Currently, Sarah is shooting the MTV film All You've Got (2006) (aka Rumble), a story about high school volleyball, and was recently seen on the Fox comedy Quintuplets (2004) as the beautiful sister \"Paige\". She resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgzODAyODA1Ml5BMl5BanBnXkFtZTcwNTIxMDk5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942792","name":"Sarah Wright","idIMDB":"nm0942792"},"actorId":"nm0942792","character":"Denise","urlCharacter":"http://www.imdb.com/character/ch0487027","main":true},{"actorName":"Ethan Suplee","urlProfile":"http://www.imdb.com/name/nm0839486","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjkyMzU1MF5BMl5BanBnXkFtZTcwNDAzNDI2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1976","placeOfBirth":" Manhattan, New York, USA","height":"6' 1\" (1.85 m)","bio":"Ethan Suplee has established himself over the past decade as an actor of considerable talent and accomplishment. His diverse and eclectic resume ranges from hilarious roles in such comedies as Mallrats (1995) and Without a Paddle (2004) to hauntingly dramatic performances in intense features such as American History X (1998), Blow (2001) and Cold Mountain (2003). His breakthrough performance as a young football player in Disney's Remember the Titans (2000) with Denzel Washington garnered him critical acclaim and led to another role opposite Washington in director Nick Cassavetes' thriller, John Q (2002). Born in New York and raised in Los Angeles, Suplee is the son of actors Debbie and Bill Suplee. He landed his first role at the age of 16 on the popular television series Boy Meets World (1993). He had a recurring role as the reluctant bully \"Frankie\" for three seasons. Most recently for television, he made a powerful guest-starring appearance on NBC's Third Watch (1999) as a disturbed young man who filmed a video journal about his obsession with a girl. He made his feature film debut in 1995 (alongside My Name Is Earl (2005) co-star Jason Lee) in writer/director Kevin Smith's Mallrats (1995). where he played the memorable 'Willam Black,' a young man determined to crack the mystery behind the mall's magic eye poster. Smith went on to cast Suplee in Chasing Amy (1997) and as the voice of 'Norman the Golgothan' in _Dogma (1998)_. More recent comedy credits include \"Without A Paddle\" with Seth Green and Matthew Lillard, director Todd Phillips Road Trip (2000) and Evolution (2001) for director Ivan Reitman. Suplee showcased his impressive acting chops with a powerful and compelling performance in 1998 in director Tony Kaye's \"American History X.\" He played a carelessly violent racist skinhead who tries to convince his friend (Edward Norton) to \"come back to his roots\" in their gang of white supremacists. His role of high school football lineman \"Louie\" in Disney's \"Remember the Titans\" exposed Suplee to a larger audience, and he was singled out by many critics as a fresh and welcome screen presence, with the Hollywood Reporter calling his performance \"scene-stealing.\" With Ted Demme's 1970s drug-cartel drama \"Blow,\" Suplee continued to raise his profile, playing \"Tuna\", the best friend of Johnny Depp's newly turned drug dealer \"George Jung\". More recently, Suplee played a pivotal role of a young soldier in Miramax and Anthony Minghella's period piece \"Cold Mountain,\" with Jude Law and Nicole Kidman. He also co-starred with Ashton Kutcher in New Line's The Butterfly Effect (2004). Suplee co-stars opposite Jason Lee in NBC and Twentieth Century-Fox TV's half-hour comedy, \"My Name is Earl.\" He plays \"Randy\", the brother of Lee's \"Earl\" who, following an epiphany, embarks on a mission to right all the wrongs he has inflicted on people. For the big screen, Suplee will next be seen starring in Art School Confidential (2006) for director Terry Zwigoff (Ghost World (2001)), and he recently completed work for director Darren Aronofsky on Warner Bros.' The Fountain (2006) with Hugh Jackman and Rachel Weisz. In his spare time, Suplee enjoys reading, cooking and playing chess. He has also recently starting taking Muay Thai kick-boxing classes three times a week. Muay Thai is a form of martial arts boxing using full contact sparring, kicks, punches, kick blocks and shadow boxing learned under professional instruction.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjkyMzU1MF5BMl5BanBnXkFtZTcwNDAzNDI2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0839486","name":"Ethan Suplee","nicknames":["Sups"],"idIMDB":"nm0839486"},"actorId":"nm0839486","character":"Officer Dave","urlCharacter":"http://www.imdb.com/character/ch0487029","main":true},{"actorName":"Bill Burr","urlProfile":"http://www.imdb.com/name/nm0122987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDgwODg3NV5BMl5BanBnXkFtZTcwMTY5OTM3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1968","placeOfBirth":" Canton, Massachusetts, USA","height":"5' 10\" (1.78 m)","bio":"Bill Burr was born on June 10, 1968 in Canton, Massachusetts, USA. He is an actor and writer, known for Date Night (2010), Daddy's Home (2015) and Walk of Shame (2014). He has been married to Nia Renee Hill since October 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDgwODg3NV5BMl5BanBnXkFtZTcwMTY5OTM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122987","name":"Bill Burr","idIMDB":"nm0122987"},"actorId":"nm0122987","character":"Officer Walter","urlCharacter":"http://www.imdb.com/character/ch0487032","main":true},{"actorName":"Ken Davitian","urlProfile":"http://www.imdb.com/name/nm0205772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIyNzkxMDU4NF5BMl5BanBnXkFtZTcwNjQ3MzAzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1953","placeOfBirth":" Los Angeles, California, USA","birthName":"Kenneth Davitian","height":"5' 5\" (1.65 m)","bio":"Ken Davitian was born on June 19, 1953 in Los Angeles, California, USA as Kenneth Davitian. He is an actor and producer, known for Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan (2006), The Artist (2011) and Meet the Spartans (2008). He has been married to Ellen Baca since July 22, 1977. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIyNzkxMDU4NF5BMl5BanBnXkFtZTcwNjQ3MzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205772","name":"Ken Davitian","idIMDB":"nm0205772"},"actorId":"nm0205772","character":"Cab Driver","urlCharacter":"http://www.imdb.com/character/ch0487033","main":true},{"actorName":"Lawrence Gilliard Jr.","urlProfile":"http://www.imdb.com/name/nm0319142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODAyMzc5MV5BMl5BanBnXkFtZTcwMzI3ODUyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1971","placeOfBirth":" New York City, New York, USA","birthName":"Lawrence Gilliard Jr.","height":"5' 9¼\" (1.76 m)","bio":"Lawrence Gilliard Jr. was born on September 22, 1971 in New York City, New York, USA. He is an actor and writer, known for The Machinist (2004), Gangs of New York (2002) and The Waterboy (1998). He is married to Michelle Paress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODAyMzc5MV5BMl5BanBnXkFtZTcwMzI3ODUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0319142","name":"Lawrence Gilliard Jr.","nicknames":["Larry"],"idIMDB":"nm0319142"},"actorId":"nm0319142","character":"Scrilla","urlCharacter":"http://www.imdb.com/character/ch0487035","main":true},{"actorName":"Alphonso McAuley","urlProfile":"http://www.imdb.com/name/nm1593505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0Nzk3MDc2MV5BMl5BanBnXkFtZTcwNDEzNjEwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Alphonso McAuley is an actor and director, known for Glory Road (2006), Walk of Shame (2014) and Pride (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0Nzk3MDc2MV5BMl5BanBnXkFtZTcwNDEzNjEwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1593505","name":"Alphonso McAuley","idIMDB":"nm1593505"},"actorId":"nm1593505","character":"Pookie","urlCharacter":"http://www.imdb.com/character/ch0487037","main":true},{"actorName":"Da'Vone McDonald","urlProfile":"http://www.imdb.com/name/nm1229681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MzY0Mjc0NV5BMl5BanBnXkFtZTcwNzU4Mjg2MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Da'Vone McDonald is an actor, known for Forgetting Sarah Marshall (2008), Get Him to the Greek (2010) and The Gambler (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MzY0Mjc0NV5BMl5BanBnXkFtZTcwNzU4Mjg2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1229681","name":"Da'Vone McDonald","idIMDB":"nm1229681"},"actorId":"nm1229681","character":"Hulk","urlCharacter":"http://www.imdb.com/character/ch0487038","main":true},{"actorName":"Eric Etebari","urlProfile":"http://www.imdb.com/name/nm0262026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWZlYWJjYzAtZTQ3Yy00YjgzLTgxMDctYTE4ZjZmYzJhMWI4XkEyXkFqcGdeQXVyMTkyNTE0OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1969","placeOfBirth":" Los Angeles, California, USA","height":"6' 2\" (1.88 m)","bio":"Eric Etebari was born on December 5, 1969 in Los Angeles, California, USA. He is an actor and producer, known for 2 Fast 2 Furious (2003), Cellular (2004) and The Lincoln Lawyer (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWZlYWJjYzAtZTQ3Yy00YjgzLTgxMDctYTE4ZjZmYzJhMWI4XkEyXkFqcGdeQXVyMTkyNTE0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0262026","name":"Eric Etebari","idIMDB":"nm0262026"},"actorId":"nm0262026","character":"Biker Boy","urlCharacter":"http://www.imdb.com/character/ch0487040","main":true},{"actorName":"Oliver Hudson","urlProfile":"http://www.imdb.com/name/nm0005029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTY0ODc5NF5BMl5BanBnXkFtZTcwNzAyMTA3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1976","placeOfBirth":" Los Angeles, California, USA","birthName":"Oliver Rutledge Hudson","height":"6' 1\" (1.85 m)","bio":"Oliver Hudson was born on September 7, 1976 in Los Angeles, California, USA as Oliver Rutledge Hudson. He is an actor and producer, known for Rules of Engagement (2007), Grown Ups 2 (2013) and The Breed (2006). He has been married to Erinn Bartlett since June 9, 2006. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTY0ODc5NF5BMl5BanBnXkFtZTcwNzAyMTA3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005029","name":"Oliver Hudson","nicknames":["Ollie"],"idIMDB":"nm0005029"},"actorId":"nm0005029","character":"Kyle","urlCharacter":"http://www.imdb.com/character/ch0487042","main":true},{"actorName":"Jacob Timothy Manown","urlProfile":"http://www.imdb.com/name/nm5368312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NDI3NTQzMF5BMl5BanBnXkFtZTgwMjU5ODIzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jacob Timothy Manown is an actor, known for Walk of Shame (2014), Those Who Can't (2016) and Criminal Minds (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NDI3NTQzMF5BMl5BanBnXkFtZTgwMjU5ODIzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5368312","name":"Jacob Timothy Manown","idIMDB":"nm5368312"},"actorId":"nm5368312","character":"Kid with Bike","urlCharacter":"http://www.imdb.com/character/ch0487043","main":true},{"actorName":"Carol Mansell","urlProfile":"http://www.imdb.com/name/nm0543738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk5OTE3NDUxN15BMl5BanBnXkFtZTgwMDg0MDgzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Carol Mansell is an actress, known for Getting On (2013), Justified (2010) and One Mississippi (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NTU2NjA4MF5BMl5BanBnXkFtZTgwODk0MDgzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0543738","name":"Carol Mansell","idIMDB":"nm0543738"},"actorId":"nm0543738","character":"Charon","urlCharacter":"http://www.imdb.com/character/ch0487045","main":true},{"actorName":"Bryan Callen","urlProfile":"http://www.imdb.com/name/nm0130437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU2ODM4MV5BMl5BanBnXkFtZTcwOTc2ODE3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1967","placeOfBirth":" Manila, Philippines","birthName":"Bryan Christopher Callen","height":"5' 11\" (1.8 m)","bio":"Born in Manila, Philippines, Bryan Callen made his television debut as a series regular on MADtv (1995) and the HBO prison series Oz (1997). He was recently seen as Kirstie Alley's wisecracking assistant on Showtime's comedy series Fat Actress (2005). Callen has appeared on several television series including Sex and the City (1998), 7th Heaven (1996), Stacked (2005), The King of Queens (1998), Las Vegas (2003), Significant Others (1998), The West Wing (1999), CSI: Crime Scene Investigation (2000), Law & Order: Special Victims Unit (1999), NYPD Blue (1993), Suddenly Susan (1996), Frasier (1993) and NewsRadio (1995), among others. In addition, Callen has appeared in such feature films as Bad Santa (2003) and Old School (2003) and has performed stand up comedy on several TV shows including Late Night with David Letterman (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU2ODM4MV5BMl5BanBnXkFtZTcwOTc2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0130437","name":"Bryan Callen","idIMDB":"nm0130437"},"actorId":"nm0130437","character":"Dealer","urlCharacter":"http://www.imdb.com/character/ch0487046","main":true}],"seasons":[],"idIMDB":"tt2463288","urlIMDB":"http://www.imdb.com/title/tt2463288","business":{"budget":null,"openingWeekend":[{"money":"$39,751","country":"USA","day":"04","month":"05","year":"2014","remarks":"51 Screens"},{"money":"HUF 8,210,939","country":"Hungary","day":"01","month":"06","year":"2014","remarks":"31 Screens"}],"gross":[{"money":"$39,751","country":"USA","day":"04","month":"05","year":"2014","remarks":""}],"weekendGross":[{"money":"$39,751","country":"USA","day":"04","month":"05","year":"2014","remarks":"51 Screens"}],"admissions":[{"money":"38,172","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"07","month":"01","year":"2013","remarks":null},null],"copyrightHolder":"2013 Lakeshore Entertainment Group LLC and Filmdistrict Pictures, LLC"},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby Digital","Datasat","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic"],"laboratory":["Company 3 (digital intermediate)","DeLuxe (color)"],"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (master format)","Redcode RAW (5K) (source format)"],"printedFilmFormat":["D-Cinema"]},"rating":"6.0","metascore":"25","filmingLocations":[{"location":"Downtown, Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"42,847","type":"Movie","companyCreditsSimple":[{"idCompany":"co0015447","name":"Sidney Kimmel Entertainment"},{"idCompany":"co0314851","name":"FilmDistrict"},{"idCompany":"co0005323","name":"Lakeshore Entertainment"}],"keywords":{"keywords":["learning the truth","truth telling","objectification of women","mistaken for a prostitute","voyeurism","voyeur","upskirt","mini dress","female removes her clothes","female removes her dress","girl in panties","blonde","scantily clad female","cleavage","legs","misunderstanding","female protagonist","newscast","three word title","red panties","panties","eurocopter as350 squirrel","man wearing a towel","riding a bicycle","woman wearing a skin tight dress","barefoot woman","woman wearing red lingerie","gray tabby cat","woman wearing a yellow dress"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:28:46"}}