{"data":{"movies":[{"title":"Project Almanac","originalTitle":"","year":"2015","releaseDate":"20150130","directors":[{"name":"Dean Israelite","id":"nm2410311"}],"writers":[{"name":"Jason Pagan","id":"nm3091255"},{"name":"Andrew Deutschman","id":"nm2065670"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjQ2NjI4OV5BMl5BanBnXkFtZTgwODc2NjUwNDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Sci-Fi","Thriller"],"plot":"As a group of friends discover plans for a time machine, they build it and use it to fix their problems and for personal gain. But as the future falls apart with disasters, and each of them disappear little by little, they must travel back to the past to make sure they never invent the machine or face the destruction of humanity.","simplePlot":"A group of teens discover secret plans of a time machine, and construct one. However, things start to get out of control.","actors":[{"actorName":"Jonny Weston","urlProfile":"http://www.imdb.com/name/nm4103976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDU5OTYyNF5BMl5BanBnXkFtZTgwMDY5NTU5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Jonny Weston was born in 1988 and was raised in Charleston, South Carolina. After turning 18, he went to the University of South Carolina in Columbia, SC, where he took a theatre class, fell in love with acting and decided to pursue it. He is probably most known for his part as Jay Moriarty in Chasing Mavericks (2012), but he's also been in movies like Someday This Pain Will Be Useful to You (2011), John Dies at the End (2012), Under the Bed (2012), Sugar (2013), Project Almanac (2015), and We Are Your Friends (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDU5OTYyNF5BMl5BanBnXkFtZTgwMDY5NTU5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4103976","name":"Jonny Weston","idIMDB":"nm4103976"},"actorId":"nm4103976","character":"David Raskin","urlCharacter":"http://www.imdb.com/character/ch0498568","main":true},{"actorName":"Sofia Black-D'Elia","urlProfile":"http://www.imdb.com/name/nm3733763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjYwMTI5M15BMl5BanBnXkFtZTgwNzM3MzM2NDE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1991","placeOfBirth":" Clifton, New Jersey, USA","bio":"Sofia Black-D'Elia grew up in northern New Jersey with her parents and older brother, Kyle. Her mother is of Russian Jewish descent and her father is of Italian ancestry. Prior to graduating Clifton High School, Sofia booked her first role in All My Children and discovered an affinity for acting. Soon after, she began her study of the craft at The William Esper Studio under the wonderful instruction of Mr. Bill Esper. Now a dedicated graduate of his two year Meisner program, Sofia happily lives in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjYwMTI5M15BMl5BanBnXkFtZTgwNzM3MzM2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3733763","name":"Sofia Black-D'Elia","idIMDB":"nm3733763"},"actorId":"nm3733763","character":"Jessie Pierce","urlCharacter":"http://www.imdb.com/character/ch0501193","main":true},{"actorName":"Sam Lerner","urlProfile":"http://www.imdb.com/name/nm1348102","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTQ4MjU5Nl5BMl5BanBnXkFtZTgwMDk1MTY2NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1992","placeOfBirth":" Los Angeles, California, USA","bio":"Sam Lerner got his start in show business at the age of 9 after he happened to strike up a conversation with actress/director/writer Ellen Gerstein and actress Dot-Marie Jones at a New Year's Eve party he was attending with his family. Thinking Sam a natural for the business, Gerstein offered to introduce Sam to respected Hollywood talent manager, Susan Curtis. Sam's parents initially balked but Sam begged for the opportunity. When, two weeks later, he took the microphone at his sister's bat mitzvah party and began roasting his sister with the assurance and panache of a Vegas emcee, Sam's parents realized that Sam did indeed have the show biz gene and agreed to let him pursue acting. His sister's bat mitzvah photographer snapped Sam's first headshot, Sam met with Curtis and before long, he was alternating auditions with school, baseball, basketball, Hebrew School and skateboarding. Sam's big break came four months later when Barry Levinson cast him in the movie, \"Envy,\" which starred one of his favorite actors, Ben Stiller, and gave Sam a chance to work with Jack Black, Rachel Weisz, Amy Poehler and Christopher Walken. Soon after, Sam booked his first television pilot, ABC's \"My Life With Men.\" Sam continued to work in television, movies, video games,and plays at his school and synagogue. Sam has been lucky enough to work with such producers as Steven Spielberg, Robert Zemeckis and Michael Bay and for such directors as Levinson, Brett Ratner and Gil Kenan. One of his favorite roles was playing \"Chowder\" in the motion capture movie, \"Monster House:\" Having fun with Mitchel Musso and Spencer Locke, craft services and riding around the Culver Studios lot in a golf cart beats school. By a lot. Sam also had the honor of voicing the character \"Zak Saturday\" in Jay Stephens' cartoon show, \"The Secret Saturdays.' (2013) and had a recurring role on the ABC show \"Suburgatory\" as the nerdy but cute brainiac \"Evan.\" (2014) Sam has had the benefit of a live-in acting coach in the form of his father, Ken Lerner, who owns an acting school, is a top teacher for the New York Film Academy, and has a steady acting career of his own. The two played each other at different ages in a Wells Fargo television commercial. Sam's acting pedigree comes from both sides of the family. His maternal grandmother was an actress off off Broadway and in commercials, his aunt starred in the Steven Sondheim musical, \"Merrily We Roll Along\" on Broadway and his maternal great-grandmother, Mary Seleznick, was first cousin to American film producer, David O. Selznick and babysat him as a child. Sam's first two movies, coincidentally, were filmed at the studio where Selznick made \"Gone With The Wind.\" Sam's most recent projects are the low budget movies \"Walk of Fame,\" \"Stripped of Innocence\" and the Bay-produced Paramount time travel movie, \"Project Almanac.\" Sam has a recurring role on the ABC show, \"The Goldbergs\" as \"Geoff Schwartz.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTQ4MjU5Nl5BMl5BanBnXkFtZTgwMDk1MTY2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1348102","name":"Sam Lerner","idIMDB":"nm1348102"},"actorId":"nm1348102","character":"Quinn Goldberg","urlCharacter":"http://www.imdb.com/character/ch0501194","main":true},{"actorName":"Allen Evangelista","urlProfile":"http://www.imdb.com/name/nm1570766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjE5MTQ0NV5BMl5BanBnXkFtZTgwODI0OTkzNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7¼\" (1.71 m)","bio":"With numerous commercials under his belt, including spots for American Online, MTV, Time Warner Cable and Domino's, Allen Evangelista is a promising up-and-comer. Evangelista was offered a holding agreement to possibly star in a Fox series. Since then he has co-starred on ABC's \"Once and Again\" and \"Alias\", shot a lead role in \"Mozart and the Whale\" with Josh Hartnett \". Evangelista was a regular guest on Nickelodeon's \"Zoey 101\", and spent 5 seasons on ABC Family's \"The Secret Life of the American Teenager\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjE5MTQ0NV5BMl5BanBnXkFtZTgwODI0OTkzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1570766","name":"Allen Evangelista","idIMDB":"nm1570766"},"actorId":"nm1570766","character":"Adam Le","urlCharacter":"http://www.imdb.com/character/ch0501195","main":true},{"actorName":"Virginia Gardner","urlProfile":"http://www.imdb.com/name/nm4722966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0Njk4NTIwNV5BMl5BanBnXkFtZTcwMzY2NDIyOQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1995","placeOfBirth":" Sacramento, California, USA","birthName":"Virginia Elizabeth Gardner","height":"5' 8\" (1.73 m)","bio":"Virginia Gardner was born on April 18, 1995 in Sacramento, California, USA as Virginia Elizabeth Gardner. She is an actress, known for Project Almanac (2015), Goat (2016) and Tell Me How I Die (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0Njk4NTIwNV5BMl5BanBnXkFtZTcwMzY2NDIyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4722966","name":"Virginia Gardner","idIMDB":"nm4722966"},"actorId":"nm4722966","character":"Christina Raskin","urlCharacter":"http://www.imdb.com/character/ch0401809","main":true},{"actorName":"Amy Landecker","urlProfile":"http://www.imdb.com/name/nm0484541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzQ4NDU4MF5BMl5BanBnXkFtZTcwMDkyMTU1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1969","placeOfBirth":" Chicago, Illinois, USA","height":"5' 7\" (1.7 m)","bio":"Amy Landecker started her career as a theatre actor in Chicago IL where she worked with the Steppenwolf and Goodman theaters. A Bob Falls directed production of Rebecca Gilman's brought her to NYC and the Public Theatre. While in NYC she worked at the Barrow St Theater and Second Stage. She won an ensemble Obie award for her performance in Tracy Letts' Bug. The same play that brought her to LA. While performing on stage in LA she was tapped to play Mrs. Samsky in the Coen brothers Oscar nominated 'A Serious Man' which was the beginning of an exciting on camera career in movies and TV shows like Louie, Curb Your Enthusiasm, Enough Said and her current starting role as Sarah Pfefferman in the Emmy and Golden Globe award winning series Transparent. Amy has also written pilots for FX and Amazon and is a top VO talent in animation and commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzQ4NDU4MF5BMl5BanBnXkFtZTcwMDkyMTU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0484541","name":"Amy Landecker","idIMDB":"nm0484541"},"actorId":"nm0484541","character":"Kathy Raskin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Weeks","urlProfile":"http://www.imdb.com/name/nm0917314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmM3YzA3MDgtMzA2OS00ZDcyLWFlMDUtNmEzYTEyZThlMDI5XkEyXkFqcGdeQXVyMTA3OTcwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1972","placeOfBirth":" Wiesbaden, Hesse, Germany","birthName":"Edson Gary Weeks","height":"5' 10½\" (1.79 m)","bio":"American Actor/Writer. Born on an US Air Force base in Weisbaden Germany, but after moved back to the U.S. a year later to Rome, NY, and raised in rural Morris, GA. He was an All-State Football player, a 2-time State Basketball Champion, and a varsity baseball player. He began making short films when he got his first camera in 1985, and found a love both in front and behind the camera. After graduating from a high school class of only 17 people, he studied at the University of Georgia and Georgia State University before moving to Los Angeles where he began to work steadily as an actor. Although he has shot and lived all over the U.S., he will always consider Georgia \"Home,\" where he credits his passion and positive work ethic to his family and the people who surrounded him growing up. He is credited with over almost 100 Film, TV, and Commercial appearances, including recent films: Spider-Man: Homecoming (2017), Jurassic World (2015), The Fate of the Furious (2017) Self/less (2015), Project Almanac (2015), The Spectacular Now (2013), Identity Thief (2013), Best known for his TV work as \"Campbell\" on the USA series Burn Notice (2007), as \"Nick Newport Jr.\" on Parks and Recreation (2009), and Adrian Miller on Greenleaf (2016), On the other side of the camera, he has written countless screenplays, produced and directed many of them, and his films have won over 50 awards, including features Deadland (2009), Meth Head (2013), 29 Reasons to Run (2006) and Clones Gone Wild (2009) His love for film festivals led him to start one of his own in 2010, along with fellow actor/writer Chad Mathews, and \"The Hill Country Film Festival\" is still thriving and boasts some of the best indie film in the country.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3MGYzY2QtNGZhZi00NTJjLWEzZDEtZjFlMWI5YTQ1MGY3XkEyXkFqcGdeQXVyMTA3OTcwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0917314","name":"Gary Weeks","idIMDB":"nm0917314"},"actorId":"nm0917314","character":"Ben Raskin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Macsen Lintz","urlProfile":"http://www.imdb.com/name/nm3978751","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTkxMzY1MF5BMl5BanBnXkFtZTgwNTcxMDQ3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Macsen Lintz is an actor, known for Project Almanac (2015), Hall Pass (2011) and Grudge Match (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTkxMzY1MF5BMl5BanBnXkFtZTgwNTcxMDQ3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3978751","name":"Macsen Lintz","idIMDB":"nm3978751"},"actorId":"nm3978751","character":"David, Age 7","urlCharacter":"http://www.imdb.com/character/ch0498568","main":true},{"actorName":"Gary Grubbs","urlProfile":"http://www.imdb.com/name/nm0344196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM1OTU1NV5BMl5BanBnXkFtZTcwMzkzOTcyMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1949","placeOfBirth":" Amory, Mississippi, USA","birthName":"Jon Gary Grubbs","height":"6' 4\" (1.93 m)","bio":"Gary and his wife Glenda, moved to Los Angeles in 1977 for Gary to pursue a writing career. He went on an open call as an actor, got the part, and now two hundred parts later Gary is still acting. Gary and Glenda now have a home in Mississippi and an apartment in Los Angeles and Gary works both the southern and L.A. markets. In the last few years Gary has devoted much of his time to writing and has successfully sold two pilot scripts to CBS, two screenplays and had his first full length equity play, \"As The Crow Flies,\" receive it's world premier. The production was both a creative and financial success and received many positive reviews. Currently he has a project in development at Warner Horizon. In 2008 Gary can be seen in \"In The Electric Mist\" with Tommie Lee Jones,\" \"Deal\" with Burt Reynolds, \"Good Intentions\" with Elaine Hendrix, \"Major Movie Star\" with Jessica Simpson, and \"My Mom's New Boyfriend\" with Meg Ryan and Antonio Banderas. Gary has worked as an actor for some of the most distinguished film directors of our time in a number of motion pictures, including \"JFK\" (Oliver Stone), \"Silkwood\" (Mike Nichols), \"Nadine\" (Robert Benton), \"Honkytonk Man\" (Clint Eastwood), and \"The Border\" (Tony Richardson). Other feature credits include \"X-Files The Movie,\" \"Doubletake,\" and \"Astronaut's Wife\". On television, Grubbs made a name for himself by portraying attorneys in two of the highest rated programs in television history, \"The Burning Bed\" and \"Fatal Vision\". He has also starred in numerous Movies-of-the-Week and Mini-series, including \"Canal Street Brothel,\" \"For One Night\" \"Foxfire,\" and many others. Gary's recent series and episodic work includes appearances on ER, Angel, NCIS, K-ville, Will & Grace and The O.C. Gary and Glenda have a daughter Molly who is employed at Team One Advertising in Los Angeles, and their son Logan is a grad student at The University of Southern Mississippi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0344196","name":"Gary Grubbs","idIMDB":"nm0344196"},"actorId":"nm0344196","character":"Dr. Lou","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle DeFraites","urlProfile":"http://www.imdb.com/name/nm3350137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MzIxMjcwN15BMl5BanBnXkFtZTgwMTQwMjEzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Michelle Renae DeFraites","height":"5' 1½\" (1.56 m)","bio":"Michelle DeFraites, a Mississippi native, discovered her passion for the arts at an early age. With over ten years of dancing and local theater under her belt, Michelle launched into the chaos of Los Angeles and began tackling her career in entertainment. She has starred in Lifetime's Pregnancy Pact and is featured on multiple Disney programs and TV movies. She has covered Nationalist magazine with a six-page spread and is one of the faces for Neutrogena online. She is known for the Sci-Fi thriller, Project Almanac (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MzIxMjcwN15BMl5BanBnXkFtZTgwMTQwMjEzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3350137","name":"Michelle DeFraites","idIMDB":"nm3350137"},"actorId":"nm3350137","character":"Sarah Nathan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Curry Stone","urlProfile":"http://www.imdb.com/name/nm5214224","urlPhoto":"","biography":{"bio":"Curry Stone is an American actor born in Chattanooga, Tennessee. At lunch one day with his parents and a friend, his father told him about a open casting call on the local news. Two days later, Curry went to audition and landed a small role in a blockbuster film. Since then, he shows a unwavering determination and exemplary work-ethic, and travels wherever needed to pursue his dream.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5214224","name":"Curry Stone","idIMDB":"nm5214224"},"actorId":"nm5214224","character":"Male Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamila Thompson","urlProfile":"http://www.imdb.com/name/nm3573893","urlPhoto":"","biography":{"height":"5' 5\" (1.65 m)","bio":"Jamila Thompson is an actress, known for Project Almanac (2015), Switching Lanes and Wildflowers (TV Pilot) (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3573893","name":"Jamila Thompson","idIMDB":"nm3573893"},"actorId":"nm3573893","character":"Marina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katie Garfield","urlProfile":"http://www.imdb.com/name/nm2095613","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNDM1Mzk3MDZeQTJeQWpwZ15BbWU4MDkyMDQyMTAy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Katie Garfield was born in Orlando, Florida, USA. She is an actress, known for The Birth of a Nation (2016), Nashville (2012) and The Vampire Diaries (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNDM1Mzk3MDZeQTJeQWpwZ15BbWU4MDkyMDQyMTAy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2095613","name":"Katie Garfield","idIMDB":"nm2095613"},"actorId":"nm2095613","character":"Liv","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hillary Harley","urlProfile":"http://www.imdb.com/name/nm5035424","urlPhoto":"","biography":{"bio":"Hillary Harley is an actress, known for Project Almanac (2015), Katie's Story and Becky & Barry #theactorslife (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5035424","name":"Hillary Harley","idIMDB":"nm5035424"},"actorId":"nm5035424","character":"Blonde","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Courtney Bowers","urlProfile":"http://www.imdb.com/name/nm3950972","urlPhoto":"","biography":{"height":"5' 6\" (1.68 m)","bio":"Courtney Bowers is an actress, known for Project Almanac (2015), American Reunion (2012) and This Is a Test (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3950972","name":"Courtney Bowers","idIMDB":"nm3950972"},"actorId":"nm3950972","character":"Jess' Friend","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2436386","urlIMDB":"http://www.imdb.com/title/tt2436386","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,500,000","country":"USA","day":"01","month":"02","year":"2015","remarks":"2,893 Screens"}],"gross":[{"money":"$22,331,028","country":"USA","day":"22","month":"03","year":"2015","remarks":""},{"money":"$22,251,196","country":"USA","day":"15","month":"03","year":"2015","remarks":""},{"money":"$22,102,773","country":"USA","day":"08","month":"03","year":"2015","remarks":""},{"money":"$21,905,244","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$21,473,530","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$20,090,000","country":"USA","day":"15","month":"02","year":"2015","remarks":""},{"money":"$15,661,312","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$8,500,000","country":"USA","day":"01","month":"02","year":"2015","remarks":""}],"weekendGross":[{"money":"$41,076","country":"USA","day":"22","month":"03","year":"2015","remarks":"71 Screens"},{"money":"$82,275","country":"USA","day":"15","month":"03","year":"2015","remarks":"123 Screens"},{"money":"$139,504","country":"USA","day":"08","month":"03","year":"2015","remarks":"186 Screens"},{"money":"$233,395","country":"USA","day":"01","month":"03","year":"2015","remarks":"290 Screens"},{"money":"$835,154","country":"USA","day":"22","month":"02","year":"2015","remarks":"828 Screens"},{"money":"$3,260,000","country":"USA","day":"15","month":"02","year":"2015","remarks":"1,732 Screens"},{"money":"$5,232,672","country":"USA","day":"08","month":"02","year":"2015","remarks":"2,900 Screens"},{"money":"$8,500,000","country":"USA","day":"01","month":"02","year":"2015","remarks":"2,893 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic, Cooke S4 Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (4K) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"6,4","metascore":"47","filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"rated":"PG-13","awards":[],"votes":"62 397","type":"Movie","companyCreditsSimple":[{"idCompany":"co0306248","name":"Insurge Pictures"},{"idCompany":"co0071240","name":"Platinum Dunes"},{"idCompany":"co0034438","name":"MTV Films"}],"keywords":{"keywords":["time travel","video footage","found footage","time machine","teenager","race against time","mother son relationship","brother sister relationship","alternate timeline","year 2014","2010s","deception","camera","attic","laboratory","changing the future","gym","two word title","year 2004","near death experience","running","wristwatch","stopwatch","dog","robbery","letter","key","hospital","birthday party","levitation","top secret","friendship","fear","bare chested male","betrayal","premarital sex","changing history","party","forest","helicopter","time loop","foot chase","police chase","police","camcorder","cheerleader","stadium","breaking and entering","car showroom","lottery","love interest","high school","high school teacher","high school student","atlanta georgia","revenge","bully comeuppance","bully","teen movie","plane crash","news report","power outage","electromagnetic pulse","secret laboratory","single mother","single parent","widow","no title at beginning","no opening credits","teleportation","altering history","time paradox","subjective camera","title spoken by character","reference to twitter","reference to doctor who","reference to star wars","reference to facebook","reference to barack obama","fireworks","kissing","pizza","2000s","rescue","teen angst","fire","montage","concert","water slide","interracial friendship","paranoia","love","boyfriend girlfriend relationship","woods","cell phone","remote controlled car","convenience store","basketball","redemption","product placement","laptop","youtube","google","newspaper clipping","newspaper headline","mother daughter relationship","surrealism","disappearance","hydrogen","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:05:50"}}