{"data":{"movies":[{"title":"Who Killed Johnny","originalTitle":"","year":"2013","releaseDate":"20130213","directors":[{"name":"Yangzom Brauen","id":"nm1062017"}],"writers":[{"name":"Yangzom Brauen","id":"nm1062017"},{"name":"Gerold Wunstel","id":"nm1738408"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTI4MTYzMF5BMl5BanBnXkFtZTcwNzM5MzAxOQ@@._V1.jpg","countries":["USA"],"languages":["English","Swiss German","German","French"],"genres":["Comedy"],"plot":"The life of two desperate Swiss Expats who try to write their first script turns up side down when they discover a dead body on the street. Will they achieve to finish the script on time, or will they be lost forever in the pandemonium of their circumstances?","simplePlot":"The life of two desperate Swiss Expats who try to write their first script turns up side down when they discover a dead body on the street. Will they achieve to finish the script on time, ... ","actors":[{"actorName":"Melanie Winiger","urlProfile":"http://www.imdb.com/name/nm1331514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzE1NTk2M15BMl5BanBnXkFtZTgwNjg4Njc0NjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1979","placeOfBirth":" Zurich, Switzerland","height":"5' 8\" (1.73 m)","bio":"For her first role in the motion picture \"Achtung fertig Charlie!\" (Director: Mike Eschmann) in 2003 Melanie Winiger reaped a great deal of credit. With more than 550'000 tickets sold, this comedy remains one of the most successful motion pictures in Switzerland. After that she settled in Los Angeles for 2 years and attended the Lee Strasberg Theatre Institute. In 2005 Melanie Winiger was nominated for the Undine Award as Best Newcomer for her debut in \"Achtung fertig Charlie!\" After returning to Switzerland in 2005, she played the female leading part in the TV social drama \"Sonjas Rueckkehr\" (Director: Tobias Ineichen). Swiss Television broad casted the movie on April, 23, 2006. It reached an audience of 602'000 people, which is corresponding to a market share of 28.7%. In the same year, Melanie Winiger was awarded \"Best Actress\" with the TV-Star Award. And she was nominated in the category \"Show Business\" at the \"Swiss Awards\". 2006 she went back to Los Angeles to shoot the motion picture \"Love Made Easy\" (Director Peter Luisi). In the English spoken comedy she played the leading part of a stripper opposite the Academy Award Winner Martin Landau. Next, Melanie Winiger did three more movies: 2006 the motion picture \"Breakout\" (Director: Mike Eschmann), a Hip-Hop youth drama. 2007 the TV-movie \"Heldin der Luefte\" (Director: Mike Huber) and 2008 the short film \"Brandstifter\" (Director: Felix von Muralt) together with Carlos Leal. Her first motion picture in her mother tongue Italian, \"Sinestesia\" (Director: Eric Bernasconi), was first released with considerable success during the 45. Solothurn Filmtage 2010. Melanie Winiger was nominated \"Best Actress\" for her part as Michela for the Swiss Film Award Quartz 2010. In the German/Swiss TV-film production \"Sonntagsvierer\" (Director: Sabine Boss) Melanie Winiger is playing an ambitious featured part. The film will still be broad casted in 2010. In 2010 Melanie Winiger played Luna in the German comedy RESTURLAUB (directed by Gregor Schnitzler and shot in Germany and Argentina), and portrayed the murderer Marlene in the Swiss 3D horror film ONE WAY TRIP (directed by Markus Welter). In 2013 she played the female lead in the Hollywood comedy WHO KILLED JOHNNY, directed by Yangzom Brauen. For this part she was nominated Best Actress at the HOBOKEN International Film Festival 2013 in New York. In 2014/2015 and 2016 Melanie Winiger stood in front of the camera in three German TV- and cinema productions. In Marrokko, she performed as co-lead actress Nazima on the side of Rainer Lauterbach in two sequels of the German TV-event-movie SPUREN DER RACHE (Director: Niki Müllerschön). And in the new episodes of the ARD crime series MORDKOMMISSION ISTANBUL, Melanie plays the coroner Derya Güzel on the side of Erol Sander (Director: Marc Brummund). In the spring of 2017 the cult comedy LOMMBOCK comes to the cinemas in Germany, Switzerland and Austria. At the side of Mortitz Bleibtreu and Lucas Gregorowicz Melanie plays the Arab Businesswoman Yasemin (Director: Christian Zübert). Melanie Winiger also appears as a presenter at national and international performances and events. Especially worth mentioning are her appearances in front of an audience of millions for the UEFA - the European Football Association: In 2008 she presented the draw of the European Football Championship in Switzerland and Austria in Lucerne. 2008 and 2009 she inspired the audience on the occasion of the final draw of the UEFA Champions League in Monte Carlo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzE1NTk2M15BMl5BanBnXkFtZTgwNjg4Njc0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1331514","name":"Melanie Winiger","idIMDB":"nm1331514"},"actorId":"nm1331514","character":"Melanie, Anna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Max Loong","urlProfile":"http://www.imdb.com/name/nm1616900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTk4NzkwOF5BMl5BanBnXkFtZTcwNDQ0NTYwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1980","placeOfBirth":" Switzerland","bio":"Max Loong was born on March 8, 1980 in Switzerland. He is an actor, known for Who Killed Johnny (2013), Syndicate: Zeed (2005) and After Hours (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTk4NzkwOF5BMl5BanBnXkFtZTcwNDQ0NTYwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1616900","name":"Max Loong","idIMDB":"nm1616900"},"actorId":"nm1616900","character":"Max","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos Leal","urlProfile":"http://www.imdb.com/name/nm1332454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2OTMzODg4Ml5BMl5BanBnXkFtZTgwMzE5NTY0NzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1969","placeOfBirth":" Fribourg, Switzerland","height":"6' 1½\" (1.87 m)","bio":"Carlos Leal was born on July 9, 1969 in Fribourg, Switzerland. He is an actor and producer, known for Casino Royale (2006), The Boarding School (2007) and The Team (2015). He is married to Jo Kelly. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2OTMzODg4Ml5BMl5BanBnXkFtZTgwMzE5NTY0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1332454","name":"Carlos Leal","idIMDB":"nm1332454"},"actorId":"nm1332454","character":"Marcel, Carlos","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ernest Hausmann","urlProfile":"http://www.imdb.com/name/nm0369603","urlPhoto":"","biography":{"dateOfBirth":"1968","placeOfBirth":"","height":"5' 9\" (1.75 m)","bio":"Ernest Hausmann was born in 1968. He is an actor, known for In July (2000), Berlin Calling (2008) and Kebab Connection (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0369603","name":"Ernest Hausmann","idIMDB":"nm0369603"},"actorId":"nm0369603","character":"Jambo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jordan Carver","urlProfile":"http://www.imdb.com/name/nm5427316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ4NzU1NjEzNl5BMl5BanBnXkFtZTgwODE4NjUxMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Ina-Maria Schnitzer","height":"5' 6\" (1.68 m)","bio":"Jordan is a cover girl and businesswoman who recently became a commercial spokeswoman for online German consumer electronics giant Redcoon. She set a record by appearing on the cover of Britain's Zoo magazine six times. She landed her first role in an independent film. Born and raised in a small town near Luxembourg, Jordan's first professional experience was an apprenticeship as a hotel manager-but feeling uninspired, she switched gears and entered the modeling world behind the scenes as a beautician and make-up artist, first with a large French company and later on her own. The international sensation sparked by Sebastian's photos of her prompted them to create Jordan's multi-faceted website early in 2010-which served to increase her popularity and global intrigue. Once she realized that most of her fans and potential clients were located in the U.S., she decided to move to the States, where she secured her first major modeling job for Haute Shop LA and signed her first significant contract. After booking her first appearance on U.S. television on the WGN Morning News, she began scoring more TV appearances and photo shoots for various magazines and web pages. At the end of 2010, Jordan won the contest for the racing sport seat production company COBRA and became their spokes model-a position she held till recently. She later won second place on the Top 100 Internet Model Newcomer of the Year list after being nominated by Break Media. Expanding her scope in 2011, Jordan's popularity increased and she reached thousands of fans in Facebook. She started traveling and producing multiple photo shoots for her web-page and magazines worldwide, including Blueprint in the U.S. and others in Sweden, Denmark and Germany. She received international recognition when she appeared in ZOO Magazine; her six cover appearances have helped make her one of the worlds most popular glamour models. Building her following further in Europe, she signed an exclusive contract with German TV production company and began working on several television show concepts for the European market. During a TV production for a German magazine she was caught by the paparazzi of TMZ and was featured on the next day's show. While gearing up to launch her JOCA brand in the U.S., she broke through further in Germany early in 2012, airing a reality pilot in June; being featured on the cover and interviewing and filming at the editor's desk at the newspaper BILD; and doing her first cover shoot for German magazine TV Digital; and making many talk show appearances on shows such as NachtCafe. Jordan was also featured for one week on the German morning show Sat 1 as a celebrity trainee; she did street interviewing as well as hosting. Just a few short years after making a global stir with her first published images in BILD-a major newspaper in her home country of Germany, with a daily readership of 12 million-the glamour, lingerie and swimsuit model and savvy entrepreneurial businesswoman has over seven million hits on Google and is wrapped up in a whirlwind of exciting activities, appearances and products as 2013 approaches. 26-year-old Jordan recently signed a contract to be the \"brand ambassador\" and spokeswoman for German-based online electronic wholesaler Redcoon throughout Germany, Austria and Switzerland, and shot her first commercial for the company. In October, she did her first major layout in a North American men's magazine. Her appearance in Maxim Mexico expands a burgeoning career as a cover girl, which includes being the first German model to appear on the cover of Great Britain's popular weekly ZOO Magazine (she's now up to six times!) and earlier this year shooting in Australia for her first cover and centerfold in ZOO Weekly Australia. Excited about offering the very first Jordan Carver Calendar for 2013 in the \"Shop\" section of her website, the buxom, down to earth blonde is now translating her love of yoga practice to Yoga For Beginners, a visually compelling new instructional video featuring her teaching poses, stretches and movements on a beautiful, rocky shore in Mallorca, Spain. In Germany, the distribution of her DVD will be handled by Universal The new age and world music influenced soundtrack to Yoga For Beginners, composed by Sascha Ende, is currently available on iTunes. Jordan will appear on the WGN Morning News in Chicago to demonstrate moves from her yoga DVD with morning news anchor Paul Konrad. Another way Jordan is doing that is by expanding into the world of film. This past July, she landed her first role in the independent feature _Who Killed Johnny? (2013)_ which was shot in Hollywood and directed by Yangzom Brauen, a well-known actress in Switzerland. The film is set for Swiss release in early 2013. Jordan sees this part as an important step in her breakthrough into TV and movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ4NzU1NjEzNl5BMl5BanBnXkFtZTgwODE4NjUxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5427316","name":"Jordan Carver","nicknames":["JC"],"idIMDB":"nm5427316"},"actorId":"nm5427316","character":"Gudrun","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Talbot","urlProfile":"http://www.imdb.com/name/nm2074441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg2MTM4MzEzN15BMl5BanBnXkFtZTcwODMyOTI4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1962","placeOfBirth":" Syosset, New York, USA","height":"6' (1.83 m)","bio":"Tim Talbot was born on October 31, 1962 in Syosset, New York, USA. He is an actor and producer, known for Who Killed Johnny (2013), Tales of Monkey Island: Chapter 1 - Launch of the Screaming Narwhal (2009) and The Godfather II (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg2MTM4MzEzN15BMl5BanBnXkFtZTcwODMyOTI4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2074441","name":"Tim Talbot","idIMDB":"nm2074441"},"actorId":"nm2074441","character":"Simon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Trevor Coppola","urlProfile":"http://www.imdb.com/name/nm3204131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYxNTM5Nzc0OV5BMl5BanBnXkFtZTgwOTYwNTE5NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Trevor Coppola was born in Santa Monica,California. He graduated Summa Cum Laude from UCLA with a degree in English Literature. He is a professional singer and classically trained cellist who has studied under Yo Yo Ma. He began acting in 1995 with a small role in Clueless. He has studied commercial and TV and film acting at UCLA,Tepper Gallegos and Beverly Hills Studios.He has acted in many television and film roles. He is best known for Vikingdom,Who Killed Johnny and staring in The Hunchback. He has also completed his second script called L.A. Women. He's an impressionist. He speaks some Russian and Thai. He is trader and real estate investor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYxNTM5Nzc0OV5BMl5BanBnXkFtZTgwOTYwNTE5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3204131","name":"Trevor Coppola","idIMDB":"nm3204131"},"actorId":"nm3204131","character":"Wulf","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerold Wunstel","urlProfile":"http://www.imdb.com/name/nm1738408","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM5NzA5MDQwNl5BMl5BanBnXkFtZTcwMDk1NzA2Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"Gerold M. Wunstel","height":"6' 1\" (1.85 m)","bio":"Gerold Wunstel is more than just a pretty face. He is an avid collector of professions and cities, totaling eight different careers in ten cities in Europe and the U.S. Gerold was an almost autistic child, always sitting in the back of the class or lurking in the last row of movie theaters, spending endless hours watching films from around the world. As an adult, he planned to become a bank manager to follow in his father's footsteps, but instead used all his savings to buy a VW Bus to travel and see the world he knew only from films. In former West-Berlin, he worked as a security chauffeur for the German Government. He became involved with \"Die Neuen Wilden\" (a new expressionistic painting movement) in the early 1980s and began to paint and sell his work. He later moved to Munich to work with children afflicted with Downs Syndrome; lived in Hamburg where he volunteered in a hospital, worked in Detroit with abused teenagers, trained as a commercial pilot in Dallas, Denver and San Francisco; was certified as a British hot-air-balloon pilot; coached professional tennis, trained as an EMT in preparation for a firefighting career, which was interrupted by his success as a hand model. Gerold Wunstel worked as a Butler, Chauffeur, worked as a Realtor for several years; ran Marathons; opened a nightclub in Bavaria where he learned to chain smoke, and now resides in Los Angeles, where he works as an actor, hand model, screenwriter and producer. In addition to his native German, he speaks French and masters the Finnish sign language.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM5NzA5MDQwNl5BMl5BanBnXkFtZTcwMDk1NzA2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1738408","name":"Gerold Wunstel","idIMDB":"nm1738408"},"actorId":"nm1738408","character":"Hasso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nadine Bosurgi","urlProfile":"http://www.imdb.com/name/nm2781738","urlPhoto":"","biography":{"dateOfBirth":"7 February 1984","placeOfBirth":" Nelson, New Zealand","height":"5' 6\" (1.68 m)","bio":"Nadine Bosurgi was born in Nelson New Zealand to Swiss parents and spent her early childhood in the rural village of Motueka. Later her family moved back to Switzerland. Nadine first came to the US during an exchange program in Oregon for dramatic arts. She has had seven years of intensive theatrical training at some of the most reputable drama schools in Switzerland and Germany, as well as Los Angeles where she is a member of the Ivana Chubbuck studio. Nadine has worked on numerous theater and film productions in Europe and in the US. She lives in Los Angeles with her husband their son.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2781738","name":"Nadine Bosurgi","idIMDB":"nm2781738"},"actorId":"nm2781738","character":"Miriam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yangzom Brauen","urlProfile":"http://www.imdb.com/name/nm1062017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTEyMzcwOF5BMl5BanBnXkFtZTcwOTc2Njg5Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1981","placeOfBirth":" Switzerland","height":"5' 8\" (1.73 m)","bio":"Yangzom was born and raised in Bern, the capital of Switzerland. Completing her studies in Europe's prestigious University of Theater and Music in Bern, she started working in independent theater projects in Switzerland and Germany. Shortly thereafter, she was cast and guest-starred in a well-known Swiss sitcom 'Manne Zimmer' for National Swiss Television Network. Yangzom's career would take off establishing her as a well-known actress starring in many Swiss and German TV Shows as well as in movies such as 'Cargo', the first Swiss sci-fi movie and 'Laenger Leben', a Swiss Comedy. She received her Hollywood breakthrough when she won the role of \"Inari\" in the Sci Fi film, Aeon Flux, starring Charlize Theron. She then decided to move to Los Angeles to pursue her acting career in the States. In 2008 she wrote her first book, which became an instant bestseller in Germany and Switzerland 2009-10. 'Across Many Mountains' is a memoir about three generations of Tibetan women: Yangzom's grandmother, her mother and her own story. The book has sold over 500,000 copies in Germany and Switzerland, and was on Europe's Spiegel Bestseller list for over 40 weeks. 'Across Many Mountains' got published in March 2011 in England and Australia with Random House UK. The North American publishers of the book are St.Martin's Press in New York and in France, Press de la cite. The book has been published in 11 languages so far. With her latest short film \"Born in Battle\" about child soldiers she received the well known CICT-UNESCO Enrico Fulchignoni Award as well as the UNESCO Gandhi Medal at the Fribourg Film Festival. \"Born in Battle\" was shown during the UN committee meeting in Geneva with UN Special representative on children and armed conflict. The Short won the audience award at the prestigious Max Ophüls Preis 2016, a leading festival in the European film festival world for new emerging talents.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTEyMzcwOF5BMl5BanBnXkFtZTcwOTc2Njg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1062017","name":"Yangzom Brauen","idIMDB":"nm1062017"},"actorId":"nm1062017","character":"Bartender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Florine Elena Deplazes","urlProfile":"http://www.imdb.com/name/nm4235230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDA5Mzg5OV5BMl5BanBnXkFtZTgwNTMwNTEzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Florine Elena Deplazes is an actress and producer, known for Savages (2012), The Sandman (2011) and Hard Stop (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NDA5Mzg5OV5BMl5BanBnXkFtZTgwNTMwNTEzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4235230","name":"Florine Elena Deplazes","idIMDB":"nm4235230"},"actorId":"nm4235230","character":"Penelope","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martina Harrer","urlProfile":"http://www.imdb.com/name/nm5427733","urlPhoto":"","biography":{"bio":"Martina Harrer is an actress, known for Who Killed Johnny (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5427733","name":"Martina Harrer","idIMDB":"nm5427733"},"actorId":"nm5427733","character":"Hairdresser client","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melina Hess","urlProfile":"http://www.imdb.com/name/nm5427001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTk1MjU5OF5BMl5BanBnXkFtZTcwODMwNTIwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Melina Hess is an actress, known for Who Killed Johnny (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTk1MjU5OF5BMl5BanBnXkFtZTcwODMwNTIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5427001","name":"Melina Hess","idIMDB":"nm5427001"},"actorId":"nm5427001","character":"Make-up girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Karl Johnson","urlProfile":"http://www.imdb.com/name/nm2562008","urlPhoto":"","biography":{"height":"6' (1.83 m)","bio":"Christopher Karl Johnson is known for his work on Nazis at the Center of the Earth (2012), Lars (2010) and Ruprecht (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2562008","name":"Christopher Karl Johnson","nicknames":["Chris"],"idIMDB":"nm2562008"},"actorId":"nm2562008","character":"Police officer, Cleaner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcus Maria Jung","urlProfile":"http://www.imdb.com/name/nm1118522","urlPhoto":"","biography":{"bio":"Marcus Maria Jung is known for his work on Who Killed Johnny (2013), Shadows (2000) and U-571 (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1118522","name":"Marcus Maria Jung","idIMDB":"nm1118522"},"actorId":"nm1118522","character":"Cameraman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2580888","urlIMDB":"http://www.imdb.com/title/tt2580888","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":"YangZoom Films"},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["16:9 HD"],"camera":["Canon C300"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.0","filmingLocations":[{"location":"Los Angeles, California, USA"}],"awards":[{"award":"Chicago Comedy Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Festival Award","categories":[{"category":"Best Screenplay","names":[{"name":"Yangzom Brauen","id":"nm1062017","role":null},{"name":"Gerold Wunstel","id":"nm1738408","role":null},{"name":"YangZoom Films","id":null,"role":null}]}]}]},{"award":"Costa Rica International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Festival Award","categories":[{"category":"Best International Film","names":[{"name":"Yangzom Brauen","id":"nm1062017","role":null},{"name":"YangZoom Films","id":null,"role":null}]}]}]},{"award":"Hoboken International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Festival Award","categories":[{"category":"Best Actress","names":[{"name":"Melanie Winiger","id":"nm1331514","role":null}]}]}]},{"award":"TrindieFest 2013","titlesAwards":[{"titleAwardOutcome":"2nd place Jury Award","categories":[{"category":"Best Feature Comedy","names":[{"name":"Yangzom Brauen","id":"nm1062017","role":"director"},{"name":"Gerold Wunstel","id":"nm1738408","role":null},{"name":"YangZoom Films","id":null,"role":null}]}]}]}],"votes":"98","type":"Movie","companyCreditsSimple":[{"idCompany":"co0400788","name":"YangZoom Films"}],"keywords":{"keywords":["f rated"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:41:12"}}