{"data":{"movies":[{"title":"Lost Time","originalTitle":"","year":"2014","releaseDate":"20140919","directors":[{"name":"Christian Sesma","id":"nm2341319"}],"writers":[{"name":"Kenneth Owens","id":"nm5453925"},{"name":"Christian Sesma","id":"nm2341319"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODE1Nzc3MV5BMl5BanBnXkFtZTgwNTMwOTk1MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Sci-Fi","Thriller"],"plot":"After leaving a doctor visit with the worst news, Valerie Dreyfuss and her sister Melissa come to a stop on a lonely stretch of road. Their car is engulfed by a blinding light....12 hours later Valerie wakes to the horror that her sister is gone, nowhere to be found.","simplePlot":"After leaving a doctor visit with the worst news, Valerie Dreyfuss and her sister Melissa come to a stop on a lonely stretch of road. Their car is engulfed by a blinding light....12 hours ... ","actors":[{"actorName":"Rochelle Vallese","urlProfile":"http://www.imdb.com/name/nm0885062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGY3MmRlNDUtYzE1ZC00NDEzLTlkMDgtZWRlN2NiZmZhMDBjL2ltYWdlXkEyXkFqcGdeQXVyMTE1NjEwODY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Rochelle Vallese is an actress and producer, known for Lost Time (2014), Humanity's End (2008) and Alien Armageddon (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTA2YjY5ZmItYWJlYi00ZDI3LTgzOTMtNDA1MTYzYjYzNjBhXkEyXkFqcGdeQXVyMTE1NjEwODY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0885062","name":"Rochelle Vallese","idIMDB":"nm0885062"},"actorId":"nm0885062","character":"Valerie Dreyfuss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luke Goss","urlProfile":"http://www.imdb.com/name/nm0331577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwODMyMjIxMl5BMl5BanBnXkFtZTgwMDEzODQ2MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1968","placeOfBirth":" London, England, UK","birthName":"Luke Damon Goss","height":"6' 1\" (1.85 m)","bio":"Luke Goss started his acting career playing 'Danny Zuko' in the smash hit musical Grease, on London's West End, and later toured with the production throughout the United Kingdom. He established himself as a screen actor in 2002 with performances in two very different features: David Goyer's independent drama ZigZag, with John Leguizamo, Oliver Platt, Natasha Lyonne and Wesley Snipes; and Guillermo Del Toro's supernatural action feature Blade II, with Snipes and Ron Perlman. The following year, he starred in the title role of the critically acclaimed British gangster film Charlie, and in the title role in the Emmy Award-winning Hallmark miniseries Frankenstein, with Donald Sutherland and William Hurt. In 2005, Goss traveled to India to play the role of King Xerxes in the Biblical epic One Night With The King, opposite Omar Sharif and Peter O'Toole, firmly establishing him as a versatile actor. He then went on to star in The Man, with Samuel L. Jackson and Eugene Levy; Mercenary, with Steven Seagal; Bone Dry, with Lance Henriksen; Unearthed, with Emmanuelle Vaugier; Deep Winter, with Michael Madsen; and Shanghai Baby, with Bai Ling. 2008 reunited Goss with Guillermo Del Toro in Universals Hellboy II: The Golden Army, the sequel that opened in the number one spot at the U.S. box office. The role earned Goss 2 MTV Movie Award nominations. He recently completed the starring role in Tekken, a sci-fi feature thriller based on the popular video and arcade game. He is attached to play 'Kristoff,' in a big screen adaptation of the Top Cow comic book, Magdalena, being developed and produced by Gale Anne Hurd's Valhalla Pictures, Platinum Studios and Top Cow. He has recently completed filming his first role for Network Television in JJ Abrams \"Fringe\". Luke Goss has recently completed leading roles in Across The Line, Blood Out, and has taken over Universals Death Race franchise, firmly establishing him as a leading man.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwODMyMjIxMl5BMl5BanBnXkFtZTgwMDEzODQ2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0331577","name":"Luke Goss","idIMDB":"nm0331577"},"actorId":"nm0331577","character":"Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Davi","urlProfile":"http://www.imdb.com/name/nm0001108","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDE5ODM5N15BMl5BanBnXkFtZTgwMzA1Nzc1ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1951","placeOfBirth":" Astoria, Queens, New York City, New York, USA","birthName":"Robert John Davi","height":"6' 2\" (1.88 m)","bio":"Robert Davi is an award-winning actor, screenwriter, director, producer and jazz vocalist. From his portrayal of the opera singing baddie in \"The Goonies\" and one of the most popular James Bond villains Franz Sanchez in \"Licence to Kill\" to FBI Special Agent Big Johnson in\" Die Hard\" or Al Torres in \"Showgirls\" to most recently Leo Marks in \"The Iceman \" Robert Davi is one of the film industry's most recognized tough guys . He has also starred in the small screen in hit shows like Profiler, Stargate Atlantis, Criminal Minds and CSI . With over 140 film and TV credits he has frightened us , romanced us ,made us cry or split our seams laughing . He is also one of the top vocalists of our day in interpreting the Great American Songbook, thrilling audiences by playing top venues like the Venetian in Las Vegas where he headlines or for 10,000 people at the Harry Chapin Theater in East Meadow ,Long Island or the Orleans in Vegas where he gave 3 sellout shows with Don Rickles. His debut album Davi Sings Sinatra- On the Road to Romance produced by Phil Ramone shot to number 6 for more than several weeks on Billboard's Jazz Charts. In his early acting years, Davi attended Hofstra University on a drama scholarship. He then moved to Manhattan, New York where he studied with the legendary acting coach Stella Adler, who became his mentor. Davi became a lifetime member of the Actors Studio, where he studied with acting teacher Lee Strasberg. Always perfecting his craft, Davi studied under Sandra Seacat, Larry Moss, Milton Katselas, Martin Landau, Mala Powers and George Shdanoff, the creative partner and collaborator with Michael Chekhov. Robert Davi was born in Astoria, Queens, to Maria (Rulli) and Sal Davi. His father was an Italian immigrant and his mother was of Italian descent. Davi was introduced to film when he was cast opposite Frank Sinatra in the telefilm, \"Contract on Cherry Street.\" Later, his work as a Palestinian terrorist in the award-winning television movie, \"Terrorist on Trial: The United States vs. Salim Ajami\" brought him critical acclaim and caught the eye of legendary James Bond producer Albert R. Broccoli and writer Richard Maibaum, who cast Davi as Colombian drug lord and lead villain Franz Sanchez in the Bond film \"Licence to Kill.\" Today, Davi is one of the top Bond villains of all time ranking at the top on many lists. Davi also received critical acclaim within the industry for his provocative portrayal of Bailey Malone in \"Profiler.\" The show struck a chord with audiences, paving the way for such shows as \"CSI: Crime Scene Investigation,\" \"Without a Trace,\" \"Law & Order: Criminal Intent,\" \"Criminal Minds\" and many others. In 2004, Davi joined the cast of television's \"Stargate: Atlantis,\" which earned Davi many science fiction fans. He has also shown his comedic strength in films such as \"The 4th Tenor\" with Rodney Dangerfield and \"The Hot Chick,\" produced by Rob Schneider and Adam Sandler. Having appeared in more than 100 motion pictures, some of Davi's most notable film credits span 30 years and include cult-classics and blockbuster hits with roles as Jake Fratelli in \"The Goonies,\" Max Keller in \"Raw Deal,\" Special Agent Big Johnson in \"Die Hard,\" Al Torres in \"Showgirls,\" Leo Marks in \"The Iceman\" with Michael Shannon, Winona Ryder, Ray Liotta, Chris Evans and James Franco, and most recently, with Sylvester Stallone and Arnold Schwarzenegger among a large A-list cast in \"Expendables 3.\" He has worked with such directors as Steven Spielberg, Richard Donner, Blake Edwards, John McTiernan, Paul Verhoeven and Patrick Hughes. In addition, he has worked on film projects with acting talent such as Marlon Brando, Roberto Benigni, Bruce Willis, Clint Eastwood, Christopher Walken, Benicio Del Toro, Danny Glover and Catherine Zeta Jones, to name a few. In 2007, Davi produced, directed, co-wrote, and starred in \"The Dukes,\" which tells the story of a once-successful Doo Wop group who fall on hard times. The film won nine awards including the coveted Coup de Coeur award. Davi was also awarded Best First-time Director and Best Screenplay in the Monte Carlo Festival of Comedy by the legendary director Ettore Scola where Prince Albert presented him with the awards. Davi was the only first-time director in the Premiere Section of the International Rome Film Festival along with Sean Penn, Robert Redford, Sidney Lumet, Julie Taymor and others. In October of 2011, Davi released his debut album, Davi Sings Sinatra: On the Road to Romance (produced by Grammy award-winning producer Phil Ramone) to rave reviews. Within weeks of its highly anticipated release, the album soared onto Billboard Magazine's Top 10 Jazz Chart taking the number 6 spot for several weeks. In response to the release, the legendary Quincy Jones stated, \"As FS would say, 'Koo, Koo.' Wow! I have never heard anyone come this close to Sinatra's sound - and still be himself. Many try, but Robert Davi has the voice, tone, the flavor and the swagger. What a surprise. He absolutely touched me down to my soul and brought back the essence and soul of Ol' Blue Eyes himself.\" In support of the album release, Davi is touring the U.S. with his live stage show, receiving standing ovations. He has performed at The Venetian Resort Hotel Casino in Las Vegas for a three-night engagement, the Thousand Oaks Civic Arts Plaza with a 55-piece orchestra, the National Italian-American Foundation's (NIAF) special tribute to the 25th anniversary of its Lifetime Achievement Award to Frank Sinatra at the Washington Hilton in D.C., the Soboba Casino in San Jacinto, Calif., with David Foster at the Beverly Hilton, and in August of 2013, at Long Island's Eisenhower Park for more than 10,000 people. In November of 2013, Davi released the Christmas single, \"New York City Christmas.\" Besides working in film, television, and music and raising his five children, four dogs and two cats, Davi keeps busy volunteering his time with such charities as The Dream Foundation, Exceptional Children's Foundation, Heart of a Child Foundation, the Los Angeles County Sheriff's Youth Foundation, The Humane Society of the United States, Heart of a Horse, NIAF, The Order 'Sons of Italy' in America (OSIA), and UNICO . Since its inception in 1998, Davi has been the National Spokesperson for i-Safe America, which is regarded by many internet experts as the most complete internet safety program in the country and is available in grades K-12 in all 50 U.S. states. Among his numerous awards for career achievement and community involvement, Davi has received the George M. Estabrook Distinguished Service Award from the Hofstra University Alumni Association (past recipients include Francis Ford Coppola and William Safire). In 2000, Davi was awarded the FBI's Man of the Year Award in Los Angeles. In 2004, Davi was named KNX radios' \"Citizen of the Week\" for saving a young girl from a fire in her home. The same year, he also received the Sons of Italy's Royal Court of the Golden Lion Award, including a $20,000 donation to a foundation in which he is involved. In addition, he received the 2004 STEP Award (Science, Technology and Education Partnership). In 2007, Davi was awarded a Lifetime Achievement Award from the Italian Board of Governors in New York, where New York State recognized his value as an artist and community leader. In 2008, he received the Italo-Americano Award from the Capri-Hollywood Festival. In 2011, Davi was awarded the \"Military Order of the Purple Heart\" (MOPH) Special Recognition Award for dedication and service honoring America's service members, veterans, and their families. In June of 2013, Davi was honored with a star on the Italian Walk of Fame in Toronto, Canada. Davi is on The Steering Committee for George Washington University's Homeland Security Policy Institute and is the only entertainer among 28 members, which consists of mainly Senators and former heads of the FBI and CIA. Davi has developed Civilian Patrol 93, which is at Homeland Security, where a lesson plan is being written.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDE5ODM5N15BMl5BanBnXkFtZTgwMzA1Nzc1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001108","name":"Robert Davi","idIMDB":"nm0001108"},"actorId":"nm0001108","character":"Dr. Xavier Reed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Derek Mears","urlProfile":"http://www.imdb.com/name/nm0575216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE3MTY5ODIxN15BMl5BanBnXkFtZTcwODEwNTQxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1972","placeOfBirth":" Bakersfield, California, USA","height":"6' 5\" (1.96 m)","bio":"Derek Mears was born on April 29, 1972 in Bakersfield, California, USA. He is known for his work on Hansel & Gretel: Witch Hunters (2013), Predators (2010) and Friday the 13th (2009). He was previously married to Jennifer Flack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE3MTY5ODIxN15BMl5BanBnXkFtZTcwODEwNTQxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0575216","name":"Derek Mears","idIMDB":"nm0575216"},"actorId":"nm0575216","character":"Mr. Elliot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lin Shaye","urlProfile":"http://www.imdb.com/name/nm0005417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmNjOWY2NjItY2MxMy00M2QxLWIzNWYtMWM5YzNiZTM5MDZiL2ltYWdlXkEyXkFqcGdeQXVyMjE5NTgzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1943","placeOfBirth":" Detroit, Michigan, USA","birthName":"Linda Shaye","height":"5' 2\" (1.57 m)","bio":"Lin attended the University of Michigan, where she was an Art History major, although acting in as many University productions as possible, including \"Bye Bye Birdie\" and \"On The Town\". After U of M, she attended Columbia University School of the Arts, and acquired a Master of Fine Arts degree in Acting. She stayed in New York upon graduation and worked in numerous off- and off-off- Broadway productions, as well as Lincoln Center and Broadway. She has studied with some of the finest: Uta Hagen, Stella Adler and Lee Strasberg. Lin is a lifetime member of the Actor's Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmNjOWY2NjItY2MxMy00M2QxLWIzNWYtMWM5YzNiZTM5MDZiL2ltYWdlXkEyXkFqcGdeQXVyMjE5NTgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005417","name":"Lin Shaye","idIMDB":"nm0005417"},"actorId":"nm0005417","character":"Mysterious Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jenni Blong","urlProfile":"http://www.imdb.com/name/nm0089093","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjQ1NzMzMl5BMl5BanBnXkFtZTcwNzU4OTg2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Jenni Blong is an actress, known for True Blood (2008), Big Love (2006) and The Booth at the End (2011). She has been married to John Livingston since 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjQ1NzMzMl5BMl5BanBnXkFtZTcwNzU4OTg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089093","name":"Jenni Blong","idIMDB":"nm0089093"},"actorId":"nm0089093","character":"Melissa Dreyfuss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vyto Ruginis","urlProfile":"http://www.imdb.com/name/nm0749490","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjU5ODY5N15BMl5BanBnXkFtZTYwODk3NzAz._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1956","placeOfBirth":" Wolverhampton, England, UK","birthName":"Vytautas Ruginis","bio":"Vyto Ruginis was born on April 17, 1956 in Wolverhampton, England as Vytautas Ruginis. He is an actor and producer, known for The Fast and the Furious (2001), Moneyball (2011) and The Devil's Advocate (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NjU5ODY5N15BMl5BanBnXkFtZTYwODk3NzAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749490","name":"Vyto Ruginis","idIMDB":"nm0749490"},"actorId":"nm0749490","character":"Mr. Coffey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chelsea Ricketts","urlProfile":"http://www.imdb.com/name/nm1137837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZhMWVkNzItZGYwNS00ZTQzLTg0YjItODYzOGZlYzlmYmY4L2ltYWdlXkEyXkFqcGdeQXVyMTYyNjk3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1989","placeOfBirth":" Houston, Texas, USA","birthName":"Chelsea Marie Ricketts","height":"5' 7\" (1.7 m)","bio":"Chelsea Ricketts is an actress best known for her role Marta Talford on the TV series Lincoln Heights and for her role Britney on the TV series 10 Things I Hate About You. Chelsea Ricketts was born on October 29, 1989. She made her debut in 2001 on the TV series Flip Flop Shop followed by her movie debut a year later in Beyond the Prairie, Part 2: The True Story of Laura Ingalls Wilder. Chelsea Ricketts has appeared on a number of prominent TV series Melrose Place, Grey's Anatomy and CSI Miami. She had brief recurring role on the TV series Lincoln Heights, 10 Things I Hate About You and Zeke and Luther.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZhMWVkNzItZGYwNS00ZTQzLTg0YjItODYzOGZlYzlmYmY4L2ltYWdlXkEyXkFqcGdeQXVyMTYyNjk3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1137837","name":"Chelsea Ricketts","idIMDB":"nm1137837"},"actorId":"nm1137837","character":"Eva Sterling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Olsen","urlProfile":"http://www.imdb.com/name/nm1864017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY1Mzg1MjA2MV5BMl5BanBnXkFtZTcwMDUxMzY0NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Best known for her appearances as Mrs. Dodds/The Fury in Percy Jackson & the Olympians: The Lightning Thief, Paranormal Activity 3, American Horror Story and Rob Zombie's Lords of Salem, Maria Olsen has worked on more than 65 feature films and over 150 shorts, television shows, music videos and commercials since 2005. She has also won four awards (including awards for both acting and directing), had two short films appear at the 2009 Cannes Short Film Program, one at the 2010 Sundance Film Festival, plus others at Fangoria's Weekend of Horrors and HorrorFest. Olsen also owns MOnsterworks66, producer of features such as Brandon Scullion's Live in Fear, Randal Kamradt Jr's Faraway, Eric Michael Kochmer's Way Down In Chinatown, Bert Havird's Reunion and Michael LaPointe's LoveTouchHate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY1Mzg1MjA2MV5BMl5BanBnXkFtZTcwMDUxMzY0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1864017","name":"Maria Olsen","idIMDB":"nm1864017"},"actorId":"nm1864017","character":"Nurse Mary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tonya Cornelisse","urlProfile":"http://www.imdb.com/name/nm1397601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5Njk5ODMzN15BMl5BanBnXkFtZTcwNzI1MTc0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Tonya Cornelisse is an actress and writer, known for NCIS (2003), Parks and Recreation (2009) and Liminal (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5Njk5ODMzN15BMl5BanBnXkFtZTcwNzI1MTc0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1397601","name":"Tonya Cornelisse","idIMDB":"nm1397601"},"actorId":"nm1397601","character":"Gillian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Cortese","urlProfile":"http://www.imdb.com/name/nm2226390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzQ1NjkxOV5BMl5BanBnXkFtZTcwOTE1OTc2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jennifer Cortese is an actress, known for Hand of God (2014), White Collar (2009) and Atlas Shrugged II: The Strike (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzQ1NjkxOV5BMl5BanBnXkFtZTcwOTE1OTc2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2226390","name":"Jennifer Cortese","idIMDB":"nm2226390"},"actorId":"nm2226390","character":"Gale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Cattell","urlProfile":"http://www.imdb.com/name/nm0146360","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzAwNDExMV5BMl5BanBnXkFtZTgwMjQ0MzQ3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Todd Cattell is an actor and producer, known for Justified (2010), Isle of the Dead (2016) and The Terrain (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzAwNDExMV5BMl5BanBnXkFtZTgwMjQ0MzQ3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146360","name":"Todd Cattell","idIMDB":"nm0146360"},"actorId":"nm0146360","character":"Rico","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephanie Lesh-Farrell","urlProfile":"http://www.imdb.com/name/nm2288874","urlPhoto":"","biography":{"bio":"Stephanie Lesh-Farrell is an actress, known for Lost Time (2014), Beyond (2006) and Waking Up 80.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2288874","name":"Stephanie Lesh-Farrell","idIMDB":"nm2288874"},"actorId":"nm2288874","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Noory","urlProfile":"http://www.imdb.com/name/nm2406382","urlPhoto":"","biography":{"dateOfBirth":"4 June 1950","placeOfBirth":" Detroit, Michigan, USA","birthName":"George Ralph Noory","bio":"George Noory was born on June 4, 1950 in Detroit, Michigan, USA as George Ralph Noory. He is an actor and producer, known for Predictions with George Noory (2006), Ancient Aliens (2009) and Lost Time (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2406382","name":"George Noory","nicknames":["The Nighthawk"],"idIMDB":"nm2406382"},"actorId":"nm2406382","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Carlisle","urlProfile":"http://www.imdb.com/name/nm1085072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDYzOTAyN15BMl5BanBnXkFtZTgwOTU3OTIyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jack Carlisle is known for his work on The Frightening (2002), House of Usher (2008) and Macabre Theatre Halloween Special (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDYzOTAyN15BMl5BanBnXkFtZTgwOTU3OTIyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1085072","name":"Jack Carlisle","idIMDB":"nm1085072"},"actorId":"nm1085072","character":"Thug 1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2564978","urlIMDB":"http://www.imdb.com/title/tt2564978","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"LOST TIME Pictures LLC"},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"2.8","filmingLocations":[],"awards":[{"award":"West Coast Film Festival 2017","titlesAwards":[{"titleAwardOutcome":"Won Grace Kelly Actor Award","categories":[{"category":"Best Actress","names":[{"name":"Rochelle Vallese","id":"nm0885062","role":"actor"}]}]}]}],"votes":"879","type":"Movie","companyCreditsSimple":[{"idCompany":"co0375336","name":"King Kai Production"},{"idCompany":"co0186015","name":"Seskri Produktionz"}],"keywords":{"keywords":["female nudity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:24:03"}}