{"data":{"movies":[{"title":"By the Gun","originalTitle":"","year":"2014","releaseDate":"20141205","directors":[{"name":"James Mottern","id":"nm0609522"}],"writers":[{"name":"Emilio Mauro","id":"nm2654436"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgxMDIzOTEzMV5BMl5BanBnXkFtZTgwMzUzMDEwMzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"plot":"Nick Tortano is a smooth-talking, ambitious criminal from the streets of Boston. After years spent working for and idolizing the Italian gangsters he finally proves himself to the boss and becomes a made man. However, once inside, Nick conflicts with a moneymaker for the Mafia and begins to drive a wedge between him and Boss.","simplePlot":"Nick, a young Boston Italian, trying to find purpose in the ideology of the mafia and finding his world turned upside down.","actors":[{"actorName":"Ben Barnes","urlProfile":"http://www.imdb.com/name/nm1602660","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTg4OTI3NF5BMl5BanBnXkFtZTcwNjI0OTc4NA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1981","placeOfBirth":" London, England, UK","birthName":"Benjamin Thomas Barnes","height":"6' 1\" (1.85 m)","bio":"British actor Benjamin Thomas Barnes was born in London, England, to Patricia (Becker), a relationship therapist, and Thomas Barnes, a professor of psychiatry. He has a brother, Jack. His mother is from South Africa, and is of Jewish heritage, while his father is English. Barnes studied at Homefield Preparatory and King's College, both independent all boys' schools. He began acting in musical theatre, including at the National Youth Music Theatre, and was a member of Hyrise, a boy band. In 2004, he graduated with BA Honours from Kingston University, where he studied drama and English literature. In 2006, Barnes played Dakin in The History Boys on stage, and made his television debut on the series Doctors (2000). His first film was Matthew Vaughn's Stardust (2007), and his second major film role was the epic The Chronicles of Narnia: Prince Caspian (2008), in which he played Prince Caspian. He next co-starred with Jessica Biel in Easy Virtue (2008), played the title role in Ol Parker's Dorian Gray (2009), and reprised his role, now as King Caspian, in The Chronicles of Narnia: The Voyage of the Dawn Treader (2010). In 2011, he co-starred with Robert Sheehan, playing brothers, in Killing Bono (2011). He also had major roles in the films The Words (2012) and The Big Wedding (2013). In 2015, Barnes played the title role in the fantasy adventure Seventh Son (2014), opposite Jeff Bridges and Julianne Moore. The same year, he portrayed American founding father Sam Adams in the History Channel mini-series Sons of Liberty (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTg4OTI3NF5BMl5BanBnXkFtZTcwNjI0OTc4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1602660","name":"Ben Barnes","nicknames":["B-Squared"],"idIMDB":"nm1602660"},"actorId":"nm1602660","character":"Nick Tortano","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leighton Meester","urlProfile":"http://www.imdb.com/name/nm1015262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3ODQzMzQ3OV5BMl5BanBnXkFtZTgwNTg3MjI5NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1986","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Leighton Marissa Meester","height":"5' 4½\" (1.64 m)","bio":"Leighton Marissa Meester was born in Fort Worth, Texas, to Constance (Haas) and Douglas Meester. Although born in Texas when her mother was serving a jail sentence for her part in a marijuana-smuggling ring, Meester spent her early years in Marco Island, Florida with her grandparents. There, she became involved with the local playhouse and made her stage debut in a production of \"The Wizard of Oz\". She moved to New York with her mother at the age of 11 and was soon working as a model and appearing in TV commercials. A few years later, at age 14, she and her mother moved again, this time to Los Angeles where she soon began to pick up TV work, making her debut in Law & Order: Disciple (1999). A steady stream of TV work followed until in 2007 she landed the role in Gossip Girl (2007) which made her famous. This led to more TV and movie work, and in 2009 she launched a recording career with a single entitled, \"Somebody to Love\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3ODQzMzQ3OV5BMl5BanBnXkFtZTgwNTg3MjI5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1015262","name":"Leighton Meester","idIMDB":"nm1015262"},"actorId":"nm1015262","character":"Ali Matazano","urlCharacter":"http://www.imdb.com/character/ch0385310","main":true},{"actorName":"Slaine","urlProfile":"http://www.imdb.com/name/nm2282835","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDM3OTJhZjctYjI4NC00OTk1LWFkNDktZDIzODk5ZmM0YjdmXkEyXkFqcGdeQXVyMTcyNTUxNzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"George Carroll","height":"6' (1.83 m)","bio":"Slaine was born as George Carroll. He is an actor, known for The Town (2010), Gone Baby Gone (2007) and Killing Them Softly (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDM3OTJhZjctYjI4NC00OTk1LWFkNDktZDIzODk5ZmM0YjdmXkEyXkFqcGdeQXVyMTcyNTUxNzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2282835","name":"Slaine","idIMDB":"nm2282835"},"actorId":"nm2282835","character":"George Mullins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ritchie Coster","urlProfile":"http://www.imdb.com/name/nm0182662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMjE2MTU5M15BMl5BanBnXkFtZTYwNTM2ODM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1967","placeOfBirth":" London, England, UK","height":"6' 1\" (1.85 m)","bio":"Ritchie Coster was born on July 1, 1967 in London, England. He is an actor, known for The Dark Knight (2008), Creed (2015) and American Gangster (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMjE2MTU5M15BMl5BanBnXkFtZTYwNTM2ODM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0182662","name":"Ritchie Coster","idIMDB":"nm0182662"},"actorId":"nm0182662","character":"Tony Matazano","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Toby Jones","urlProfile":"http://www.imdb.com/name/nm0429363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzc5NzM1MV5BMl5BanBnXkFtZTYwMzA0ODk0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1966","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Toby Edward Heslewood Jones","height":"5' 5\" (1.65 m)","bio":"Widely regarded as the one of greatest stage and screen actors both in his native Great Britain and internationally, Toby Edward Heslewood Jones was born on September 7, 1966 in Hammersmith, London. His parents, Freddie Jones and Jennie Heslewood, are actors as well. Toby has two brothers: Rupert, a director, and Casper, a fellow actor. He studied Drama at the University of Manchester from 1986 to 1989, and at L'École Internationale de Théâtre in Paris under Jacques Lecoq in Paris from 1989 to 1991. Naturally, his career began on the stage (and continues there), but film and television roles came soon after his studies. Toby made his film debut with a small role in Sally Potter's experimental take on Virginia Woolf's novel, Orlando (1992), starring Tilda Swinton. Other small film roles included the doorkeeper in Les Misérables (1998) and a memorable turn as the Royal Page in Ever After: A Cinderella Story (1998) with Drew Barrymore. Roles in the acclaimed Victoria & Albert (2001) and the Helen Mirren-starring Elizabeth I (2005) were balanced with film work, from his voice role as Dobby the House Elf in Harry Potter and the Chamber of Secrets (2002) to supporting appearances in Ladies in Lavender (2004) (co-starring his father, Freddie), Finding Neverland (2004), and Mrs Henderson Presents (2005). He continued stage work during this period, appearing on Broadway in The Play What I Wrote in 2003, a year after winning the Laurence Olivier Theatre Award for Best Actor in a Supporting Role for his performance in the London production. Infamous (2006), directed by Douglas McGrath and released in 2006, was Toby's first starring role. His acclaimed portrayal of Truman Capote remained mostly in the shadow of Philip Seymour Hoffman's Oscar-winning performance of the author in 2005's Capote (2005). A steady stream of film roles followed with appearances in Amazing Grace (2006), Le voile des illusions (2006), Nightwatching (2007), The Mist (2007), and St. Trinian's (2007). Toby then appeared in three successive films that could have been commercial breakthroughs: kid-lit flop City of Ember (2008), the Oscar-nominated Frost/Nixon (2008), and Oliver Stone's W. (2008). He reprised the voice-role of Dobby in Harry Potter and the Deathly Hallows: Part 1 (2010), appeared in the St. Trinian's sequel, as well as the Charles Darwin biopic Creation (2009) and Dustin Lance Black's post-Milk (2008) directorial outing, Virginia (2010). More Hollywood roles followed with appearances in The Rite (2011), Your Highness (2011), and his first big live-action breakthrough as Red Skull's biochemist Dr. Arnim Zola in Captain America: The First Avenger (2011). Even before Toby was announced as Cladius Templesmith in the adaptation of the novel The Hunger Games (2012), his star was on the rise after Captain America, with roles in three Oscar-nominated films: La taupe (2011), My Week with Marilyn (2011), and The Adventures of Tintin (2011). Though chances are he will forever be known by many as Cladius, the announcer for The Hunger Games with the booming voice and penchant for ending his statements with the phrase, \"And may the odds be ever in your favor!\" Toby followed up this massive success with roles in Red Lights (2012) for Buried director Rodrigo Cortés and a memorable turn as one of the dwarves in worldwide hit Snow White and the Huntsman (2012). He will next be seen in The Girl (2012), a BBC/HBO co-production in which he stars as Alfred Hitchcock, in the miniseries Titanic (2012), Peter Strickland's Berberian Sound Studio (2012), Susanne Bier's Serena (2014), and he will reprise his role as Cladius Templesmith in The Hunger Games: Catching Fire (2013). Toby lives in London with his family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzc5NzM1MV5BMl5BanBnXkFtZTYwMzA0ODk0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0429363","name":"Toby Jones","idIMDB":"nm0429363"},"actorId":"nm0429363","character":"Jerry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harvey Keitel","urlProfile":"http://www.imdb.com/name/nm0000172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDcxMjgxOV5BMl5BanBnXkFtZTcwODc2NTk2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1939","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7½\" (1.71 m)","bio":"American actor and producer Harvey Keitel was born on May 13, 1939 in Brooklyn, New York City. An Oscar and Golden Globe Award nominee, he has appeared in films such as Martin Scorsese's Mean Streets (1973) and Taxi Driver (1976), Ridley Scott's The Duellists (1977) and Thelma & Louise (1991), Peter Yates' Mother, Jugs & Speed (1976), Quentin Tarantino's Reservoir Dogs (1992) and Pulp Fiction (1994), Jane Campion's La leçon de piano (1993), Abel Ferrara's Bad Lieutenant (1992), Robert Rodriguez's From Dusk Till Dawn (1996), James Mangold's Cop Land (1997), Paolo Sorrentino's Youth (2015). He is regarded as one of the greatest method actors ever. Along with actors Al Pacino and Ellen Burstyn, he is the current co-president of the Actors Studio. Keitel studied under both Stella Adler and Lee Strasberg and at the HB Studio, eventually landing roles in some Off-Broadway productions. During this time, Keitel auditioned for filmmaker Martin Scorsese and gained a starring role as \"J.R.\", in Scorsese's first feature film, Who's That Knocking at My Door (1967). Since then, Scorsese and Keitel have worked together on several projects. Keitel had the starring role in Scorsese's Mean Streets (1973), which also proved to be Robert De Niro's breakthrough film. Keitel re-teamed with Scorsese for Alice Doesn't Live Here Anymore (1974), in which he had a villainous supporting role, and appeared with Robert De Niro again in Scorsese's Taxi Driver (1976), playing the role of Jodie Foster's pimp.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDcxMjgxOV5BMl5BanBnXkFtZTcwODc2NTk2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000172","name":"Harvey Keitel","idIMDB":"nm0000172"},"actorId":"nm0000172","character":"Salvatore Vitaglia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Ben-Victor","urlProfile":"http://www.imdb.com/name/nm0070115","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTI3MTk2OF5BMl5BanBnXkFtZTgwMzc3MTIxMjE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1965","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7½\" (1.71 m)","bio":"Actor Paul Ben-Victor has built a career on the small and big screen, with roles in over 50 films like Daredevil (2003), A Civil Action (1998), True Romance (1993), Tombstone (1993), Houseguest (1995), La tête dans le carton à chapeaux (1999) and The Corruptor (1999). On television, Paul stars as \"Chief Inspector Stan McQueen\" on USA's hit series, In Plain Sight (2008). Paul starred as \"Special Agent Bobby Hobbes\" in the international hit series The Invisible Man (2000), a role that earned him a Best Supporting Actor Audience Award for Sci-Fi. He received critical acclaim for his portrayal of \"Moe Howard\" in the ABC biopic The Three Stooges (2000), shined as the endearing hustler \"Steve Richards\" on NYPD Blue (1993), and made a lasting impression with his quiet ruthlessness as the Greek henchman, \"Spiros Vondas\", on the widely acclaimed HBO series, The Wire (2002). Paul has been a favorite on HBO with other standout roles including Warner Bros Studio Chief \"Alan Grey\" on the hit series Entourage (2004), the zany \"Palaka\" on John from Cincinnati (2007) and scalping tickets on Curb Your Enthusiasm (2000). He recently produced, wrote and starred in the soon to be released feature comedy, Should've Been Romeo (2012) alongside Edward Asner, Carol Kane and Michael Rapaport and, directed by his lifelong friend, Mark Bennett. After attending Carnegie Mellon University, he made his theater debut at the Nuyorican Poets Cafe on New York's lower east side with Miguel Pinero and Reinaldo Povod. He then became a member of the renowned Actor's Studio and appeared in several productions there including Lyle Kessler's \"Robbers\", which was then produced at the Seattle Repertory Theater directed by Daniel Sullivan, The Longwharf Theater starring Judd Hirsch and, the American Place Theater in NYC, directed by Marshall W. Mason.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTI3MTk2OF5BMl5BanBnXkFtZTgwMzc3MTIxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070115","name":"Paul Ben-Victor","idIMDB":"nm0070115"},"actorId":"nm0070115","character":"Vincent Tortano","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenny Wormald","urlProfile":"http://www.imdb.com/name/nm1552693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU1MTI4MV5BMl5BanBnXkFtZTcwNjYxOTU5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1984","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 10½\" (1.79 m)","bio":"Kenny Wormald grew up in Stoughton, Massachusetts, and began taking dancing lessons at the age of six. He won a string of dance contests throughout the Northeast in his teens and took to dancing professionally. He worked as a dancer and choreographer, appearing in a number of music videos and touring with Justin Timberlake. He made his television debut in an episode of The Drew Carey Show (1995) in 2002, but he rose to worldwide fame in 2010 when Paramount announced that he was to star in the remake of Footloose (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU1MTI4MV5BMl5BanBnXkFtZTcwNjYxOTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1552693","name":"Kenny Wormald","idIMDB":"nm1552693"},"actorId":"nm1552693","character":"Vito Tortano","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Giannone","urlProfile":"http://www.imdb.com/name/nm0316310","urlPhoto":"","biography":{"height":"5' 10\" (1.78 m)","bio":"Jay Giannone grew up in the Old Harbor Projects of South Boston (Southie). Jay comes from a long line of artists. His Mom (Janet) is a theatrical actress, and was the lead singer in her rock & roll band. Jay's grandmother was a song writer and his great grandmother was a painter. He is the prodigy and pride of these fine artistic women. At age 14 Jay's career began as a break dancer and street performer. He was invited to dance with the Floor Lords, collectively known as the best crew in New England and rivaled the N.Y city breakers. At age 17 Jay was a model for Converse and portrayed the \"Chuck Taylor\" character in a national campaign. Jay also appeared in Gatorade National Print Campaigns with Michael Jordan. Jay is also a former J-Crew catalog model. In 1995 Jay played a drug dealer on the Venice beach board walk in \"Pacific Blue\" which was his television debut. In 1996, Jay played Teddy Mac in the feature film \"Southie\" and was his feature film debut. Jay continued to participate in numerous commercials, television shows and feature films. In 2006 Jay played a Detective and served as consultant/technical advisor to Leonardo DiCaprio and Martin Scorsese for the Academy award winning film \"TheDeparted\" Jay offered his insights on South Boston's Irish mob politics. Giannone's perspective contributed significantly to DiCaprio's grasp on the role of Billy, an undercover State Police officer deep in the Southie mob. In 2009 Jay wrote, produced, directed and played the lead in the short film, \"Diamond In The Rough\", which won the Boston Film Night Audience Award. That same year he wrote, produced, directed and starred in the feature film \"Scalpers\". As an actor, he has appeared in several television shows including the HBO hit series \"Entourage\" in which is loosely based on Jay's life as an official member of Mark Wahlberg's crew and most recently \"Scorpion\" as a S.W.A.T Captain. Jay's noted feature film roles include box office hits \"Gone Baby Gone\" \"The Departed\" and \"American Hustle\". Jay wrote, produced, directed \"It snows all the time\" due out in 2016. Jay plays a lead in \"Justice Served\" also scheduled for release on 2016 and most recently Jay plays the role of Jimmy in \"Patriots Day\" opposite Mark Wahlberg and Michelle Monaghan scheduled to hit theaters in 2017.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0316310","name":"Jay Giannone","idIMDB":"nm0316310"},"actorId":"nm0316310","character":"Joe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tully Banta-Cain","urlProfile":"http://www.imdb.com/name/nm2017852","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzk3Nzg4Ml5BMl5BanBnXkFtZTgwMzcyNjI2NDE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1980","placeOfBirth":" Mountain View, California, USA","height":"6' 2\" (1.88 m)","bio":"Tully Banta-Cain was born on August 28, 1980 in Mountain View, California, USA. He is an actor, known for Super Bowl XXXIX (2005), By the Gun (2014) and Officer Downe (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzk3Nzg4Ml5BMl5BanBnXkFtZTgwMzcyNjI2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2017852","name":"Tully Banta-Cain","idIMDB":"nm2017852"},"actorId":"nm2017852","character":"Tommy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Bloomfield","urlProfile":"http://www.imdb.com/name/nm2361790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDY1NDMyN15BMl5BanBnXkFtZTgwOTM0Mjg5NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10½\" (1.79 m)","bio":"William Bloomfield is an actor and producer, known for Midnighters (2016), A Life Not to Follow (2015) and Ghost Tour (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDY1NDMyN15BMl5BanBnXkFtZTgwOTM0Mjg5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2361790","name":"William Bloomfield","nicknames":["Bill"],"idIMDB":"nm2361790"},"actorId":"nm2361790","character":"Mob Boss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Damien Di Paola","urlProfile":"http://www.imdb.com/name/nm2269029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MzE3NTE3N15BMl5BanBnXkFtZTcwMTA2MjYzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Damien Di Paola is an actor and producer, known for American Hustle (2013), Joy (2015) and Oxy-Morons (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MzE3NTE3N15BMl5BanBnXkFtZTcwMTA2MjYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2269029","name":"Damien Di Paola","idIMDB":"nm2269029"},"actorId":"nm2269029","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Armen Garo","urlProfile":"http://www.imdb.com/name/nm0307898","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNTI3NDYxMF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Armen Garo is an actor and writer, known for The Departed (2006), American Hustle (2013) and The Wolf of Wall Street (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNTI3NDYxMF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0307898","name":"Armen Garo","idIMDB":"nm0307898"},"actorId":"nm0307898","character":"Angelo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Masiello","urlProfile":"http://www.imdb.com/name/nm2488465","urlPhoto":"","biography":{"bio":"Robert Masiello is an actor, known for Shutter Island (2010), American Hustle (2013) and The Town (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2488465","name":"Robert Masiello","idIMDB":"nm2488465"},"actorId":"nm2488465","character":"Lounge Patron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sasha Olson","urlProfile":"http://www.imdb.com/name/nm3100450","urlPhoto":"","biography":{"bio":"Sasha Olson is an actress, known for By the Gun (2014), Bikini Model Academy (2015) and Dead End Falls (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3100450","name":"Sasha Olson","idIMDB":"nm3100450"},"actorId":"nm3100450","character":"Lena","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2543702","urlIMDB":"http://www.imdb.com/title/tt2543702","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[{"location":"Boston, Massachusetts, USA"}],"rated":"R","awards":[],"votes":"2,260","type":"Movie","companyCreditsSimple":[{"idCompany":"co0193161","name":"Artina Films"},{"idCompany":"co0440477","name":"Bridge Finance Company, The"},{"idCompany":"co0440477","name":"Bridge Finance Company, The"}],"keywords":{"keywords":["mafia","criminal","gangster","stolen money","dead woman","wool hat","man in underwear","woman in underwear","leather jacket","semiautomatic pistol","pistol","stealing money from a purse","waking up","man kills a woman","bouquet of flowers","walking home","racial slur","revenge killing","dead woman on bed","family home","flowers","tattoo on neck","hit with a plank","female bartender","death of girlfriend","tied to a chair","blood stain","warehouse","beating","bag of money","death of protagonist","accidental shooting","brother brother relationship","bar","suv","fat man","shot in the forehead","sex scene","italian american","silencer","crime boss","stripper","strip club","apology","henchman","woman shot","father son estrangement","three word title","tough guy","shot in the head","telling someone to shut up","held at gunpoint","money","shot in the stomach","death of brother","death threat","punched in the face","fight","argument","forced suicide","shot to death","double life","violence","betrayal","murder","torture","kidnapping","female nudity","boyfriend girlfriend relationship","father son relationship","revenge","death of father"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:44:00"}}