{"data":{"movies":[{"title":"Stanley Kubrick in Focus","originalTitle":"","year":"2012","releaseDate":"20121130","directors":[{"name":"Gary Khammar","id":"nm1789812"}],"writers":[],"runtime":"29 min","countries":["USA"],"languages":["English"],"genres":["Short"],"simplePlot":"","actors":[{"actorName":"Steven Soderbergh","urlProfile":"http://www.imdb.com/name/nm0001752","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjE3ODU1NV5BMl5BanBnXkFtZTYwMzc3MDIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1963","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Steven Andrew Soderbergh","height":"6' (1.83 m)","bio":"Steven Andrew Soderbergh was born on January 14, 1963 in Atlanta, Georgia, USA, the second of six children of Mary Ann (Bernard) and Peter Soderbergh. His father was of Swedish and Irish descent, and his mother was of Italian ancestry. While he was still at a very young age, his family moved to Baton Rouge, Louisiana, where his father was a professor and the dean of the College of Education at Louisiana State University. While still in high school, around the age of 15, Soderbergh enrolled in the university's film animation class and began making short 16-millimeter films with second-hand equipment, one of which was the short film \"Janitor\". After graduating high school, he went to Hollywood, where he worked as a freelance editor. His time there was brief and, shortly after, he returned home and continued making short films and writing scripts. His first major break was in 1986 when the rock group Yes assigned him to shoot a full-length concert film for the band, which eventually earned him a Grammy nomination for the video, Yes: 9012 Live (1985). Following this achievement, Soderbergh filmed Winston (1987), the short-subject film that he would later expand into Sex, Lies, and Videotape (1989), a film that earned him the Cannes Film Festival's Palme d'Or Award, the Independent Spirit Award for Best Director, and an Oscar nomination for Best Original Screenplay. Over the next six years, he was married to actress Betsy Brantley and had a daughter named Sarah Soderbergh, who was born in 1990. Also during this time, he made such films as Kafka (1991), King of the Hill (1993), The Underneath (1995) and Gray's Anatomy (1996), which many believed to be disappointments. In 1998, Soderbergh made Out of Sight (1998), his most critically and commercially successful film since Sex, Lies, and Videotape (1989). Then, in 2000, Soderbergh directed two major motion pictures that are now his most successful films to date: Erin Brockovich (2000) and Traffic (2000). These films were both nominated for Best Picture Oscars at the 2001 Academy Awards and gave him the first twin director Oscar nomination in almost 60 years and the first ever win. He won the Oscar for Best Director for Traffic (2000) at the 2001 Oscars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjE3ODU1NV5BMl5BanBnXkFtZTYwMzc3MDIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001752","name":"Steven Soderbergh","idIMDB":"nm0001752"},"actorId":"nm0001752","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Friedkin","urlProfile":"http://www.imdb.com/name/nm0001243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjUzNzA0M15BMl5BanBnXkFtZTcwNzU5MDkwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1935","placeOfBirth":" Chicago, Illinois, USA","height":"6' (1.83 m)","bio":"Friedkin's mother was an operating room nurse. His father was a merchant seaman, semi-pro softball player and ultimately sold clothes in a men's discount chain. Ultimately, his father never earned more than $50/week in his whole life and died indigent. Eventually young Will became infatuated with Orson Welles after seeing Citizen Kane (1941). He went to work for WGN TV immediately after graduating from high school where he started making documentaries, one of which won the Golden Gate Award at the 1962 San Francisco film festival. In 1965, he moved to Hollywood and immediately started directing TV shows, including an episode of the The Alfred Hitchcock Hour (1962); Hitchcock infamously chastised him for not wearing a tie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjUzNzA0M15BMl5BanBnXkFtZTcwNzU5MDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001243","name":"William Friedkin","nicknames":["Hurricane Billy"],"idIMDB":"nm0001243"},"actorId":"nm0001243","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Spielberg","urlProfile":"http://www.imdb.com/name/nm0000229","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAzNzE1MV5BMl5BanBnXkFtZTYwNTk0ODc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1946","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Steven Allan Spielberg","height":"5' 7½\" (1.71 m)","bio":"Undoubtedly one of the most influential film personalities in the history of film, Steven Spielberg is perhaps Hollywood's best known director and one of the wealthiest filmmakers in the world. Spielberg has countless big-grossing, critically acclaimed credits to his name, as producer, director and writer. Steven Allan Spielberg was born in 1946 in Cincinnati, Ohio, to Leah Frances (Posner), a concert pianist and restaurateur, and Arnold Spielberg, an electrical engineer who worked in computer development. His parents were both born to Russian Jewish immigrant families. Steven spent his younger years in Haddon Township, New Jersey, Phoenix, Arizona, and later Saratoga, California. He went to California State University Long Beach, but dropped out to pursue his entertainment career. He gained notoriety as an uncredited assistant editor on the classic western Wagon Train (1957). Among his early directing efforts were Battle Squad (1961), which combined World War II footage with footage of an airplane on the ground that he makes you believe is moving. He also directed Escape to Nowhere (1961), which featured children as World War Two soldiers, including his sister Anne Spielberg, and The Last Gun (1959), a western. All of these were short films. The next couple of years, Spielberg directed a couple of movies that would portend his future career in movies. In 1964, he directed Firelight (1964), a movie about aliens invading a small town. In 1967, he directed Slipstream (1967), which was unfinished. However, in 1968, he directed Amblin' (1968), which featured the desert prominently, and not the first of his movies in which the desert would feature so prominently. Amblin' also became the name of his production company, which turned out such classics as E.T. the Extra-Terrestrial (1982). Spielberg had a unique and classic early directing project, Duel (1971), with Dennis Weaver. In the early 1970s, Spielberg was working on TV, directing among others such series as Rod Serling's Night Gallery (1969), Marcus Welby, M.D. (1969) and Columbo: Murder by the Book (1971). All of his work in television and short films, as well as his directing projects, were just a hint of the wellspring of talent that would dazzle audiences all over the world. Spielberg's first major directorial effort was The Sugarland Express (1974), with Goldie Hawn, a film that marked him as a rising star. It was his next effort, however, that made him an international superstar among directors: Jaws (1975). This classic shark attack tale started the tradition of the summer blockbuster or, at least, he was credited with starting the tradition. His next film was the classic Close Encounters of the Third Kind (1977), a unique and original UFO story that remains a classic. In 1978, Spielberg produced his first film, the forgettable I Wanna Hold Your Hand (1978), and followed that effort with Used Cars (1980), a critically acclaimed, but mostly forgotten, Kurt Russell\\\\Jack Warden comedy about devious used-car dealers. Spielberg hit gold yet one more time with Raiders of the Lost Ark (1981), with Harrison Ford taking the part of Indiana Jones. Spielberg produced and directed two films in 1982. The first was Poltergeist (1982), but the highest-grossing movie of all time up to that point was the alien story E.T. the Extra-Terrestrial (1982). Spielberg also helped pioneer the practice of product placement. The concept, while not uncommon, was still relatively low-key when Spielberg raised the practice to almost an art form with his famous (or infamous) placement of Reece's Pieces in \"E.T.\" Spielberg was also one of the pioneers of the big-grossing special-effects movies, like \"E.T.\" and \"Close Encounters\", where a very strong emphasis on special effects was placed for the first time on such a huge scale. In 1984, Spielberg followed up \"Raiders\" with Indiana Jones and the Temple of Doom (1984), which was a commercial success but did not receive the critical acclaim of its predecessor. As a producer, Spielberg took on many projects in the 1980s, such as The Goonies (1985), and was the brains behind the little monsters in Gremlins (1984). He also produced the cartoon An American Tail (1986), a quaint little animated classic. His biggest effort as producer in 1985, however, was the blockbuster Back to the Future (1985), which made Michael J. Fox an instant superstar. As director, Spielberg took on the book The Color Purple (1985), with Whoopi Goldberg and Oprah Winfrey, with great success. In the latter half of the 1980s, he also directed Empire of the Sun (1987), a mixed success for the occasionally erratic Spielberg. Success would not escape him for long, though. The late 1980s found Spielberg's projects at the center of pop-culture yet again. In 1988, he produced the landmark animation/live-action film Who Framed Roger Rabbit (1988). The next year proved to be another big one for Spielberg, as he produced and directed Always (1989) as well as Indiana Jones and the Last Crusade (1989), and Back to the Future Part II (1989). All three of the films were box-office and critical successes. Also, in 1989, he produced the little known comedy-drama Dad (1989), with Jack Lemmon and Ted Danson, which got mostly mixed results. Spielberg has also had an affinity for animation and has been a strong voice in animation in the 1990s. Aside from producing the landmark \"Who Framed Roger Rabbit\", he produced the animated series Tiny Toon Adventures (1990), Animaniacs (1993), Pinky and the Brain (1995), Freakazoid! (1995), Pinky, Elmyra & the Brain (1998), Family Dog (1993) and Toonsylvania (1998). Spielberg also produced other cartoons such as The Land Before Time (1988), We're Back! A Dinosaur's Story (1993), Casper (1995) (the live action version) as well as the live-action version of The Flintstones (1994), where he was credited as \"Steven Spielrock\". Spielberg also produced many Roger Rabbit short cartoons, and many Pinky and the Brain, Animaniacs and Tiny Toons specials. Spielberg was very active in the early 1990s, as he directed Hook (1991) and produced such films as the cute fantasy Joe Versus the Volcano (1990) and An American Tail: Fievel Goes West (1991). He also produced the unusual comedy thriller Arachnophobia (1990), Back to the Future Part III (1990) and Gremlins 2: The New Batch (1990). While these movies were big successes in their own right, they did not quite bring in the kind of box office or critical acclaim as previous efforts. In 1993, Spielberg directed Jurassic Park (1993), which for a short time held the record as the highest grossing movie of all time, but did not have the universal appeal of his previous efforts. Big box-office spectacles were not his only concern, though. He produced and directed Schindler's List (1993), a stirring film about the Holocaust. He won best director at the Oscars, and also got Best Picture. In the mid-90s, he helped found the production company DreamWorks, which was responsible for many box-office successes. As a producer, he was very active in the late 90s, responsible for such films as The Mask of Zorro (1998), Men in Black (1997) and Deep Impact (1998). However, it was on the directing front that Spielberg was in top form. He directed and produced the epic Amistad (1997), a spectacular film that was shorted at the Oscars and in release due to the fact that its release date was moved around so much in late 1997. The next year, however, produced what many believe was one of the best films of his career: Saving Private Ryan (1998), a film about World War Two that is spectacular in almost every respect. It was stiffed at the Oscars, losing best picture to Shakespeare in Love (1998). Spielberg produced a series of films, including Evolution (2001), Hantise (1999) and Shrek (2001). he also produced two sequels to Jurassic Park (1993), which were financially but not particularly critical successes. In 2001, he produced a mini-series about World War Two that definitely *was* a financial and critical success: Band of Brothers (2001), a tale of an infantry company from its parachuting into France during the invasion to the Battle of the Bulge. Also in that year, Spielberg was back in the director's chair for A.I. Artificial Intelligence (2001), a movie with a message and a huge budget. It did reasonably at the box office and garnered varied reviews from critics. Spielberg has been extremely active in films there are many other things he has done as well. He produced the short-lived TV series SeaQuest 2032 (1993), an anthology series entitled Amazing Stories (1985), created the video-game series \"Medal of Honor\" set during World War Two, and was a starting producer of ER (1994). Spielberg, if you haven't noticed, has a great interest in World War Two. He and Tom Hanks collaborated on Shooting War (2000), a documentary about World War II combat photographers, and he produced a documentary about the Holocaust called Eyes of the Holocaust (2000). With all of this to Spielberg's credit, it's no wonder that he's looked at as one of the greatest ever figures in entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAzNzE1MV5BMl5BanBnXkFtZTYwNTk0ODc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000229","name":"Steven Spielberg","idIMDB":"nm0000229"},"actorId":"nm0000229","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Scorsese","urlProfile":"http://www.imdb.com/name/nm0000217","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDA4Nzk3N15BMl5BanBnXkFtZTcwNDYzMjMxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1942","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Martin Charles Scorsese","height":"5' 4\" (1.63 m)","bio":"Martin Charles Scorsese was born on November 17, 1942 in Queens, New York City, to Catherine Scorsese (née Cappa) and Charles Scorsese, who both worked in Manhattan's garment district, and whose families both came from Palermo, Sicily. He was raised in the neighborhood of Little Italy, which later provided the inspiration for several of his films. Scorsese earned a B.S. degree in film communications in 1964, followed by an M.A. in the same field in 1966 at New York University's School of Film. During this time, he made numerous prize-winning short films including The Big Shave (1968), and directed his first feature film, Who's That Knocking at My Door (1967). He served as assistant director and an editor of the documentary Woodstock (1970) and won critical and popular acclaim for Mean Streets (1973), which first paired him with actor and frequent collaborator Robert De Niro. In 1976, Scorsese's Taxi Driver (1976), also starring De Niro, was awarded the Palme d'Or at the Cannes Film Festival, and he followed that film with New York, New York (1977) and The Last Waltz (1978). Scorsese directed De Niro to an Oscar-winning performance as boxer Jake LaMotta in Raging Bull (1980), which received eight Academy Award nominations, including Best Picture and Best Director, and is hailed as one of the masterpieces of modern cinema. Scorsese went on to direct The Color of Money (1986), The Last Temptation of Christ (1988), Goodfellas (1990), Cape Fear (1991), The Age of Innocence (1993), Casino (1995) and Kundun (1997), among other films. Commissioned by the British Film Institute to celebrate the 100th anniversary of the birth of cinema, Scorsese completed the four-hour documentary, A Personal Journey with Martin Scorsese Through American Movies (1995), co-directed by Michael Henry Wilson. His long-cherished project, Gangs of New York (2002), earned numerous critical honors, including a Golden Globe Award for Best Director; the Howard Hughes biopic Aviator (2004) won five Academy Awards, in addition to the Golden Globe and BAFTA awards for Best Picture. Scorsese won his first Academy Award for Best Director for The Departed (2006), which was also honored with the Director's Guild of America, Golden Globe, New York Film Critics, National Board of Review and Critic's Choice awards for Best Director, in addition to four Academy Awards, including Best Picture. Scorsese's documentary of the Rolling Stones in concert, Shine a Light (2008), followed, with the successful thriller Shutter Island (2010) two years later. Scorsese received his seventh Academy Award nomination for Best Director, as well as a Golden Globe Award, for Hugo (2011), which went on to win five Academy Awards. Scorsese also serves as executive producer on the HBO series Boardwalk Empire (2010) for which he directed the pilot episode. Scorsese's additional awards and honors include the Golden Lion from the Venice Film Festival (1995), the AFI Life Achievement Award (1997), the Honoree at the Film Society of Lincoln Center's 25th Gala Tribute (1998), the DGA Lifetime Achievement Award (2003), The Kennedy Center Honors (2007) and the HFPA Cecil B. DeMille Award (2010). Scorsese and actor Leonardo DiCaprio have worked together on five separate occasions: Gangs of New York (2002), Aviator (2004), The Departed (2006), Shutter Island (2010) and The Wolf of Wall Street (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDA4Nzk3N15BMl5BanBnXkFtZTcwNDYzMjMxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000217","name":"Martin Scorsese","nicknames":["Marty"],"idIMDB":"nm0000217"},"actorId":"nm0000217","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oliver Stone","urlProfile":"http://www.imdb.com/name/nm0000231","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMjExMTY3OV5BMl5BanBnXkFtZTcwNjY3MDA2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1946","placeOfBirth":" New York City, New York, USA","birthName":"William Oliver Stone","height":"6' (1.83 m)","bio":"Oliver Stone has become known as a master of controversial subjects and a legendary film maker. His films are filled with a variety of film angles and styles, he pushes his actors to give Oscar-worthy performances, and despite his failures, has always returned to success. William Oliver Stone was born in New York City, to Jacqueline (Goddet) and Louis Stone, a stockbroker. His American father was from a Jewish family (from Germany and Eastern Europe), and his mother, a war bride, was French (and Catholic). After dropping out of Yale University, he became a soldier in the Vietnam War. Serving in two different regiments (including 1rst Cavalry), he was introduced to The Doors, drugs, Jefferson Airplane, and other things that defined the sixties. For his actions in the war, he was awarded a Bronze Star for Gallantry and a Purple Heart. Returning from the war, Stone did not return to graduate from Yale. His first film was a student film entitled Last Year in Viet Nam (1971), followed by the gritty horror film La reine du mal (1974) for which he also wrote the screenplay. The next seven years saw him direct two films: Mad Man of Martinique (1979) and The Hand (1981), starring Michael Caine. He also wrote many screenplays for films such as Midnight Express (1978), Conan the Barbarian (1982), and Scarface (1983). Stone won his first Oscar for Midnight Express (1978), but his fame was just beginning to show. 1986 was the year that brought him much fame to the U.S.A. and the world. He directed the political film Salvador (1986) starring Oscar-nominated James Woods. However, his big hit was the Vietnam war film Platoon (1986) starring Charlie Sheen,Willem Dafoe, Tom Berenger, and Francesco Quinn. Berenger and Dafoe received Oscar nominations for their roles as the polar opposite sergeants who each influence the tour of duty of Chris Taylor (Sheen). Stone won his first Oscar for directing this film, which won Best Picture and was a hit at the box office. After Platoon (1986), Stone followed up with the critically acclaimed Wall Street (1987). The movie, starring Charlie Sheen and Michael Douglas, focuses on the business world of tycoons and stock brokers. The film was well received and won an Oscar for Douglas' portrayal of the villainous Gordon Gekko. Stone returned immediately the following year with Talk Radio (1988), which talked of a foul-mouthed radio host (played by Eric Bogosian) who never fails to talk about the serious issues. Although it was not as successful as his last three films, Stone did not slow down at all. He directed Tom Cruise into an Oscar-nominated role in Born on the Fourth of July (1989). The movie talked about the return of an embittered, crippled Vietnam soldier from the war. Although it failed to win Best Picture or Best Actor, Oliver Stone won an Academy Award for Directing, his third win to date. After Born on the Fourth of July (1989), Stone took a hand in producing several movies, including the Academy Award-winning film Reversal of Fortune (1990). He returned to the director's chair in 1991, once again with two films. Val Kilmer starred as the legendary and controversial Jim Morrison in Stone's psychedelic film The Doors (1991). Despised by former Doors member Ray Manzarek, the film is nevertheless a wonderful achievement, with Kilmer pulling off an almost flawless impersonation of Morrison. Regardless of opinion, The Doors (1991) was overshadowed by Stone's colossal film JFK (1991), which Stone himself considers the best of his films. In Stone's movie, Jim Garrison tackles the conspiracy behind the murder of America's president John F. Kennedy. The large cast featured such well-known names as Kevin Costner, Tommy Lee Jones, John Candy, Joe Pesci, Donald Sutherland, and Walter Matthau. This film represented a change in Stone's works, because it was with this film that he really began to explore the different camera styles and combining them together to create a multi-dimensional way of showing a movie. JFK (1991), as with Platoon (1986) and Born on the Fourth of July (1989), earned eight Oscar nominations and was one of Stone's most successful films. However, he failed to win a third Oscar for Best Director. After this film, Stone directed his third Vietnam film to date. Entre ciel et terre (1993) was a film about the war from the viewpoint of a Vietnamese girl, and also co-starred Tommy Lee Jones (who had received an Oscar nomination for JFK (1991)). Despite its new woman's perspective and several positive reviews, it was a box office failure. Stone was unfazed; his next film is perhaps his most notorious film to date. Adapting a screenplay by Quentin Tarantino, Stone made Natural Born Killers (1994) starring Woody Harrelson, Juliette Lewis, Tom Sizemore and Rodney Dangerfield in his only dramatic performance. The film was received well at the box office, while review were very mixed. Because of the violence that people claimed was inspired by the film, it was compared to Stanley Kubrick's A Clockwork Orange (1971). As usual, Stone was at the center of controversial subjects; his next film Nixon (1995) was no exception. The film focused on the life of President Richard Nixon, played by Anthony Hopkins, while featuring another well-known cast, including Joan Allen in the role of Nixon's wife. Both went on to receive Oscar nominations, while Stone received his sixth Oscar nomination for Screenwriting. The film got mixed reviews, and failed to recoup its budget. Aside from directing, Stone has worked as a producer on several different films. There was, of course, the successful film Reversal of Fortune (1990), which won Jeremy Irons an Oscar and also nominated the director for an Oscar. There was also the highly praised and successful emotional drama The Joy Luck Club (1993) which centered around four Chinese immigrant women whose relationships with their daughters is affected by their own lives. Another highly praised Oscar nominated film was Milos Forman's classic film The People vs. Larry Flynt (1996) starring Woody Harrelson, Edward Norton, and Courtney Love. Whether the crime/action film The Corruptor (1999) or the brilliant war epic Savior (1998), Stone has worked in a variety of film genres. Stone had directed ten films in nine years; now however, he began to slow down. He directed the film U Turn - Ici commence l'enfer (1997) starring Sean Penn and Jennifer Lopez. As with Natural Born Killers (1994), it was a dark and twisted satire on violence, but did not have the same success as the former. Stone was set to direct several projects in the late 90's but they fell through and were not made. However, success came back to Stone in the Al Pacino film Any Given Sunday (1999). This sports movie centered on the life behind the game of football, and it starred an impressive cast that included frequent Stone collaborators James Woods and John C. McGinley. This film was one of his most successful box office films, and put him back on track. The following years brought Stone no new theatrical films, though he did make three fascinating TV documentaries. Two of them, 'Looking for Fidel' and Comandante (2003) were interviews of Cuban dictator Fidel Castro, while 'Persona Non Grata' was an interview of several Palestinian leaders. Stone was also set to direct American Psycho (2000) with Leonardo DiCaprio and Beyond Borders (2003), starring Angelina Jolie and at the time, Ralph Fiennes. However, Stone dropped out of both projects, as did a number of the actors mentioned. Finally, five years after Any Given Sunday (1999), Stone directed a film he'd long wanted to make; the colossal epic Alexander (2004). Starring Colin Farrell as the Macedonian leader, Stone attempted to capture the essence of Alexander the Great through his conquests of the known world. The film focused on Alexander's relationships with his parents (a brilliant performance by Val Kilmer and a less impressive one by Angelina Jolie) and his relationships with his wife and childhood friend/ gay lover (played by Rosario Dawson and Jared Leto respectively). Alexander (2004) was a critical failure, and failed to win back its budget domestically. Despite being one of 2004's highest grossing films internationally, and recouping its budget through DVD sales, Stone's pet project was heavily criticized. Despite a far superior version (Alexander Revisited) being released on DVD, the film's reputation remains low by the majority. Stone was personally stung at these attacks, but managed to rebound, if mildly, with his hopeful film World Trade Center (2006). The film centers on two firefighters trapped in the rubble of the twin towers. It received good reviews, and allowed Oliver to step forward from his failure towards the possibility of more films. In late 2007, besides a number of projects Stone was set to direct \"Pinkville\", which would have been his fourth Vietnam film to date. It was set to star a large number of well known actors such as Bruce Willis, Toby Jones, Channing Tatum, Michael Pitt, Woody Harrelson, and Michael Peña. However, a week before shooting was to begin, the Writer's Strike was started, and the finance for the film was cut, using the strike as an excuse. After Willis backed out of the project, it was eventually scuttled, much like Stone's early productions of Platoon (1986) and Born on the Fourth of July (1989). Stone turned to another project he had worked on with former Wall Street (1987) collaborator Stanley Weiser. The project was W. (2008), a biography on president George W. Bush. Stone initially cast Christian Bale in the role of Bush but the actor dropped out at the last minute. Josh Brolin was cast, and this followed with a large cast of well known Oscar nominated character actors such as Richard Dreyfuss, James Cromwell, and Ellen Burstyn. The film was made in a record four months, starting in June and released in October. The film opened to mixed reviews, and though film's budget was recouped, it was not a financial hit. Stone then made the documentary South of the Border (2009), a documentary which focused on bringing to light the positive aspects of the left-wing governments in South America, particularly Hugo Chavez in Venezuela. Stone was much less critical than usual, instead making the documentary as a response to the harsh reputation that Chavez has in the States. The documentary was poorly received in the States. Stone also began work on Wall Street: Money Never Sleeps (2010). Starring Michael Douglas, Shia LaBeouf, Josh Brolin, Carey Mulligan, and Eli Wallach, the film focuses on the 2008 economic crisis, and the return of Gordon Gekko from prison. The film was screened at Cannes to positive reception, and hailed as Stone's triumphant return. After this, Stone made a film adaptation of \"Savages\", a novel by Don Winslow. The movie follows two highly successful marijuana growers (Taylor Kitsch and Aaron Taylor-Johnson ), whose shared girlfriend (Blake Lively) is kidnapped by a Mexican cartel and held for ransom. The movie also starred Salma Hayek, Benicio Del Toro, John Travolta, and Emile Hirsch. The film was a return to the tense action and violence of Stone's earlier films, though it polarized many audience members due to the colorful narrations of Lively's vapid and naive character, as well as the film's ending. Oliver Stone is a three-time Oscar winner, and although he has mostly been stung by critics of his films, he remains a well-known name today in the film industry. The films he directed have been nominated for 31 Academy Awards, including eight for acting, six for screen writing, and three for directing. There is no denying that Stone has cemented himself a position among the legends of Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMjExMTY3OV5BMl5BanBnXkFtZTcwNjY3MDA2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000231","name":"Oliver Stone","idIMDB":"nm0000231"},"actorId":"nm0000231","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Nolan","urlProfile":"http://www.imdb.com/name/nm0634240","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3NDQyOTYyMV5BMl5BanBnXkFtZTcwODcyODU2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1970","placeOfBirth":" London, England, UK","birthName":"Christopher Johnathan James Nolan","height":"5' 11¼\" (1.81 m)","bio":"Best known for his cerebral, often nonlinear storytelling, acclaimed writer-director Christopher Nolan was born on July 30, 1970 in London, England. Over the course of 15 years of filmmaking, Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made. At 7 years old, Nolan began making short movies with his father's Super-8 camera. While studying English Literature at University College London, he shot 16-millimetre films at U.C.L.'s film society, where he learned the guerrilla techniques he would later use to make his first feature, Following (1998), on a budget of around $6,000. The noir thriller was recognized at a number of international film festivals prior to its theatrical release, and gained Nolan enough credibility that he was able to gather substantial financing for his next film. Nolan's second film was Memento (2000), which he directed from his own screenplay based on a short story by his brother Jonathan. Starring Guy Pearce, the film brought Nolan numerous honors, including Academy Award and Golden Globe Award nominations for Best Original Screenplay. Nolan went on to direct the critically acclaimed psychological thriller, Insomnia (2002), starring Al Pacino, Robin Williams and Hilary Swank. The turning point in Nolan's career occurred when he was awarded the chance to revive the Batman franchise in 2005. In Batman Begins (2005), Nolan brought a level of gravitas back to the iconic hero, and his gritty, modern interpretation was greeted with praise from fans and critics alike. Before moving on to a Batman sequel, Nolan directed, cowrote and produced the mystery thriller The Prestige (2006), starring Christian Bale and Hugh Jackman as magicians whose obsessive rivalry leads to tragedy and murder. In 2008, Nolan directed, cowrote and produced The Dark Knight (2008) which went on to gross more than a billion dollars at the worldwide box office. Nolan was nominated for a Directors Guild of America (D.G.A.) Award, Writers Guild of America (W.G.A.) Award and Producers Guild of America (P.G.A.) Award, and the film also received eight Academy Award nominations. In 2010, Nolan captivated audiences with the sci-fi thriller Inception (2010), which he directed and produced from his own original screenplay. The thought-provoking drama was a worldwide blockbuster, earning more than $800,000,000 dollars and becoming one of the most discussed and debated films of the year. Among its many honors, Inception received four Academy Awards and eight nominations, including Best Picture and Best Screenplay. Nolan was recognized by his peers with D.G.A. and P.G.A. Award nominations, as well as a W.G.A. Award for his work on the film. One of the best-reviewed and highest-grossing movies of 2012, The Dark Knight Rises (2012) concluded Nolan's Batman trilogy. Due to his success rebooting the Batman character, Warner Bros. enlisted Nolan to produce their revamped Superman movie Man of Steel (2013), which opened in the summer of 2013. In 2014, Nolan directed, wrote and produced the science fiction epic Interstellar (2014), starring Matthew McConaughey, Anne Hathaway and Jessica Chastain. Paramount Pictures and Warner Bros. released the film on November 5, 2014 to positive reviews and strong box-office results, grossing over $670 million dollars worldwide. Nolan currently resides in Los Angeles, California with his wife, producer Emma Thomas, and their children. Nolan and Thomas also have their own production company, Syncopy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3NDQyOTYyMV5BMl5BanBnXkFtZTcwODcyODU2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634240","name":"Christopher Nolan","nicknames":["Chris"],"idIMDB":"nm0634240"},"actorId":"nm0634240","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kirk Douglas","urlProfile":"http://www.imdb.com/name/nm0000018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDc0MjI5NV5BMl5BanBnXkFtZTYwMDE1MjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1916","placeOfBirth":" Amsterdam, New York, USA","birthName":"Issur Danielovitch Demsky","height":"5' 9\" (1.75 m)","bio":"Cleft-chinned, steely-eyed and virile star of international cinema who rose from being \"the ragman's son\" (the name of his best-selling 1988 autobiography) to become a bona fide superstar, Kirk Douglas, also known as Issur Danielovitch Demsky, was born in Amsterdam, New York, in 1916. His parents, Bryna (Sanglel) and Herschel Danielovitch, were Jewish immigrants from Chavusy, Mahilyow Voblast (now in Belarus). Although growing up in a poor ghetto, Douglas was a fine student and a keen athlete and wrestled competitively during his time at St. Lawrence University. However, he soon identified an acting scholarship as a way out of his meager existence, and was sufficiently talented to gain entry into the American Academy of Dramatic Arts. He only appeared in a handful of minor Broadway productions before joining the US Navy in 1941, and then after the end of hostilities in 1945, returned to the theater and some radio work. On the insistence of ex-classmate Lauren Bacall movie producer Hal B. Wallis screen-tested Douglas and cast him in the lead role in The Strange Love of Martha Ivers (1946). His performance received rave reviews and further work quickly followed, including an appearance in the low-key drama I Walk Alone (1948), the first time he worked alongside fellow future screen legend Burt Lancaster. Such was the strong chemistry between the two that they appeared in seven films together, including the dynamic western Gunfight at the O.K. Corral (1957), the John Frankenheimer political thriller Seven Days in May (1964) and their final pairing in the gangster comedy Tough Guys (1986). Douglas once said about his good friend: \"I've finally gotten away from Burt Lancaster. My luck has changed for the better. I've got nice-looking girls in my films now\". After appearing in \"I Walk Alone\", Douglas scored his first Oscar nomination playing the untrustworthy and opportunistic boxer Midge Kelly in the gripping Champion (1949). The quality of his work continued to garner the attention of critics and he was again nominated for Oscars for his role as a film producer in The Bad and the Beautiful (1952) and as tortured painter Vincent van Gogh in Lust for Life (1956), both directed by Vincente Minnelli. In 1955 Douglas launched his own production company, Bryna Productions, the company behind two pivotal film roles in his career. The first was as French army officer Col. Dax in director Stanley Kubrick's brilliant anti-war epic Paths of Glory (1957). Douglas reunited with Kubrick for yet another epic, the magnificent Spartacus (1960). The film also marked a key turning point in the life of screenwriter Dalton Trumbo, who had been blacklisted during the McCarthy \"Red Scare\" hysteria in the 1950s. At Douglas' insistence Trumbo was given on-screen credit for his contributions, which began the dissolution of the infamous blacklisting policies begun almost a decade previously that had destroyed so many careers and lives. Douglas remained busy throughout the 1960s, starring in many films,. He played a rebellious modern-day cowboy in Lonely Are the Brave (1962), acted alongside John Wayne in the World War II story In Harm's Way (1965), again with The Duke in a drama about the Israeli fight for independence, Cast a Giant Shadow (1966), and once more with Wayne in the tongue-in-cheek western The War Wagon (1967). Additionally, in 1963 he starred in an onstage production of Ken Kesey's \"One Flew Over The Cuckoo's Nest\", but despite his keen interest, no Hollywood studio could be convinced to bring the story to the screen. However, the rights remained with the Douglas clan, and Kirk's talented son Michael Douglas finally filmed the tale in 1975, starring Jack Nicholson. Into the 1970s Douglas wasn't as busy as previous years; however, he starred in some unusual vehicles, including alongside a young Arnold Schwarzenegger in the loopy western comedy The Villain (1979), then with Farrah Fawcett in the sci-fi thriller Saturn 3 (1980) and then he traveled to Australia for the horse opera/drama L'homme de la rivière d'argent (1982). Unknown to many, Kirk has long been involved in humanitarian causes and has been a Goodwill Ambassador for the US State Department since 1963. His efforts were rewarded in 1981 with the Presidential Medal of Freedom, and in 1983 with the Jefferson Award. Furthermore, the French honored him with the Chevalier of the Legion of Honor. More recognition followed for his work with the American Cinema Award (1987), the German Golden Kamera Award (1987), The National Board of Reviews Career Achievement Award (1989), an honorary Academy Award (1995), Recipient of the American Film Institute's Lifetime Achievement Award (1999) and the UCLA Medal of Honor (2002). Despite a helicopter crash and a stroke suffered in the 1990s, he remains active and continues to appear in front of the camera.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDc0MjI5NV5BMl5BanBnXkFtZTYwMDE1MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000018","name":"Kirk Douglas","idIMDB":"nm0000018"},"actorId":"nm0000018","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malcolm McDowell","urlProfile":"http://www.imdb.com/name/nm0000532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1943","placeOfBirth":" Horsforth, Yorkshire, England, UK","birthName":"Malcolm John Taylor","height":"5' 8½\" (1.74 m)","bio":"Malcolm John Taylor was born on June 13, 1943 in Leeds, England, to working-class parents Edna (McDowell), a hotelier, and Charles Taylor, a publican. His father was an alcoholic. Malcolm hated his parents' ways. His father was keen to send his son to private school to give him a good start in life, so Malcolm was packed off to boarding school at age 11. He attended the Tunbridge Boarding School and the Cannock House School in Eltham, Kent. At school, he was beaten with the slipper or cane every Monday for his wayward behavior. Whilst at school, he decided that he wanted to become an actor; it was also around this time that his love for race cars began. He attended the London Academy of Music and Dramatic Arts (LAMDA) to study acting. Meanwhile, he worked at his parents' pub but lost his job when the pub went bankrupt, his father drinking all the profits. He then had a variety of jobs, from coffee salesman to messenger. His first big-screen role was in Poor Cow (1967), although his two-minute scene was ultimately cut from the completed film. Soon after, he caught the attention of director Lindsay Anderson who cast him in the role of a rebellious student in his film If.... (1968). The film catapulted Malcolm to stardom in Britain but failed everywhere else. He was so enthusiastic about the film's success that he wanted to do another right away. He began writing what would become the semi-autobiographical O Lucky Man! (1973). Meanwhile, he starred as the infamous Alex DeLarge in Stanley Kubrick's controversial A Clockwork Orange (1971), a role that caused him to be typecast as a manic psychopathic villain. In early 1976, he spent nearly a year working on what would later be one of the most infamous films of all time, the semi-pornographic Caligula (1979), financed by Penthouse magazine founder Bob Guccione. Around that time, the British film industry collapsed, forcing him to flee to America to continue working. His first American film was Time After Time (1979). He then did Britannia Hospital (1982), the last part of Lindsay Anderson's working-class trilogy that started with If.... (1968). In the mid-1980s, the years of alcohol and drug abuse, including $1000 a week on cocaine, caught up with him. Years of abuse took its toll on him; his black hairs were now grey. Looking older than he really was, nobody wanted to cast him for playing younger roles. The big roles having dried up, he did many B-rated movies. The 1990s were kinder to him, though. In 1994, he was cast as Dr. Tolian Soran, the man who killed Captain James T. Kirk in Star Trek: Generations (1994). He was back on the track, playing villains again. He played another in the classic BBC miniseries Our Friends in the North (1996). Today, with more than 100 films under his belt, he is one of the greatest actors in America. He still does not have American citizenship, but he likes the no-nonsense American ways. He resides in the northern suburbs of Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000532","name":"Malcolm McDowell","nicknames":["Mick"],"idIMDB":"nm0000532"},"actorId":"nm0000532","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diane Johnson","urlProfile":"http://www.imdb.com/name/nm0424956","urlPhoto":"","biography":{"dateOfBirth":"28 April 1934","placeOfBirth":" Moline, Illinois, USA","bio":"Diane Johnson was born on April 28, 1934 in Moline, Illinois, USA. She is a writer, known for The Shining (1980), The Divorce (2003) and View from the Overlook: Crafting 'The Shining' (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0424956","name":"Diane Johnson","idIMDB":"nm0424956"},"actorId":"nm0424956","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Field","urlProfile":"http://www.imdb.com/name/nm0276062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODI1MzI3Ml5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1964","placeOfBirth":" Pomona, California, USA","birthName":"William Todd Field","bio":"William Todd Field was born in Pomona, California, and began acting after graduating from high school in Portland, Oregon, where he was raised. A budding jazz musician as well, he skipped college in favor of a move east to New York to study acting. Once there, he began performing with the Ark Theatre Company as both an actor and musician. Field subsequently won a role in Woody Allen's nostalgic Radio Days (1987). Then had an independent Spirit Award-nominated turn in'Victor Nunez (I)''s Sundance Film Festival Grand jury Prize-winner Ruby in Paradise (1993). He also starred in Nicole Holofcener's_Walking and Talking (1996)_ which won the Grand Special Prize at the Deauville Film Festival. Other credits include Scott Ziehl's_Broken Vessels (1998)_ in which Field starred and produced, and'Stanley Kubrick''s final masterpiece, Eyes Wide Shut (1999) in which he played the mysterious \"Nick Nightingale\". In 1999, Kevin Thomas of the Los Angeles Times wrote, \"Field has a deceptive facade of all-American clean-cut looks that allows him to suggest a wide range of emotions and thoughts behind such a regular-guy appearance; in \"Ruby in Paradise\" he expressed such uncommon decency and intelligence you had to wonder how Ashley Judd's hardscrabble Ruby could ever have considered letting him get away. In \"Eyes Wide Shut\" he's the likable med school dropout turned saloon piano player, and in Broken Vessels he's an increasingly raging sociopath. In all these roles Field has the precious gift of being able to surprise you and to command your attention on screen.\" However, it was precisely at this point in his career that Field decided to leave acting behind and try instead to make a name for himself as a writer/director. His first film When I Was a Boy (1993) was selected by the Film Society of Lincoln Center as part of their New Directors/New Films series and was shown at the Museum of Modern Art. His next film, Nonnie & Alex (1995) received both the Special Jury Award at the Sundance Film Festival and the Best Film prize at the Aspen Film Festival. The film was honored with a special citation from the Academy of Television Arts & Sciences and Field was honored with the Franklin J. Schaffner Award for Excellence from the AFI, one of the highest honors the institute ever bestows upon a filmmaker. In 2001, Field made his feature writing/directing debut with In the Bedroom (2001), an intensely emotional portrayal of the repercussions of family tragedy on a New England couple. The film received five Academy Award nominations, three Golden Globe nominations, and Field was named both Screenwriter and Director of the year by the National Board of Review. Internationally acclaimed by critics, the film was named Best Picture of the Year by The New York Times, The New Yorker, The Wall Street Journal, New York Magazine, The New York Observer, and the Los Angeles Film Critics Association. In 2006, Field co-wrote and directed Little Children (2006). The film, starring Kate Winslet and Patrick Wilson, won numerous awards from the nation's top critics associations including writing awards for Field and Perrotta. The movie received three Golden Globe nominations including Best Picture of the Year, and was nominated for three Academy Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODI1MzI3Ml5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0276062","name":"Todd Field","idIMDB":"nm0276062"},"actorId":"nm0276062","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2552826","urlIMDB":"http://www.imdb.com/title/tt2552826","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["29 min"],"soundMix":null,"color":["Color (Black & White and Color)"],"aspectRatio":["1.78 : 1 / (high definition)"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.6","filmingLocations":[],"awards":[],"votes":"16","type":"Movie","companyCreditsSimple":[{"idCompany":"co0160228","name":"Light Source & Imagery"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:42:38"}}