{"data":{"movies":[{"title":"The Tale of the Princess Kaguya","originalTitle":"Kaguyahime no monogatari","year":"2013","releaseDate":"20140625","directors":[{"name":"Isao Takahata","id":"nm0847223"}],"writers":[{"name":"Isao Takahata","id":"nm0847223"},{"name":"Isao Takahata","id":"nm0847223"}],"runtime":"137 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODYyODUzOF5BMl5BanBnXkFtZTgwMzYzODY3MjE@._V1.jpg","countries":["Japan"],"languages":["Japanese","English"],"genres":["Animation","Drama","Fantasy"],"plot":"An old man makes a living by selling bamboo. One day, he finds a princess in a bamboo. The princess is only the size of a finger. Her name is Kaguya. When Kaguya grows up, 5 men from prestigious families propose to her. Kaguya asks the men to find memorable marriage gifts for her, but the 5 men are unable to find what Kaguya wants. Then, the Emperor of Japan proposes to her.","simplePlot":"Found inside a shining stalk of bamboo by an old bamboo cutter and his wife, a tiny girl grows rapidly into an exquisite young lady. The mysterious young princess enthralls all who encounter her - but ultimately she must confront her fate, the punishment for her crime.","actors":[{"actorName":"Chloë Grace Moretz","urlProfile":"http://www.imdb.com/name/nm1631269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODk0Mzc0Ml5BMl5BanBnXkFtZTgwNDYzMzgzMzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1997","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 4\" (1.63 m)","bio":"Chloë Grace Moretz was born in Atlanta, Georgia, to Teri (Duke), a nurse, and McCoy Lee Moretz, a plastic surgeon. She has four brothers, all older, including actor Trevor Duke-Moretz. Her ancestry is mostly German and English. Chloë's first two appearances were as Violet in two episodes of the series The Guardian (2001). Her first movie role was as Molly in Heart of the Beholder (2005), a story about a family that opened the first video rental store in 1980. This was followed by a small role in Family Plan (2005) as Young Charlie. After that, however, came Chloe's biggest role, and the one that made her famous: The Amityville Horror (2005), the remake of the famous The Amityville Horror (1979). Next she landed a small role in Today You Die (2005) as the Little Girl, and has since appeared in Room 6 (2006) and Big Momma's House 2 (2006). She filmed Wicked Little Things (2006) in Bulgaria, in which she plays Emma Tunney. In 2007 she completed The Third Nail (2007), in which she appeared as Hailey Deonte. In 2010 she appeared as Hit-Girl in director Matthew Vaughn's action film Kick-Ass (2010), based on the comic book series of the same name by Mark Millar and John Romita Jr. Although her role in the violent action film engendered some controversy, she received widespread critical acclaim for her portrayal. Moretz trained with Jackie Chan's stunt crew for three months prior to filming \"Kick-Ass\" and did most of her own stunts in the film. Also that year she played Abby, a 12-year-old vampire, in Let Me In (2010), the UK/US remake of the Swedish film Let the Right One In (2008), which was released on October 1, 2010. She played Ann Sliger in the crime thriller Texas Killing Fields (2011), released on October 14, 2011. Chloe next played Isabelle in Martin Scorsese's Hugo (2011), a film adaptation of \"The Invention of Hugo Cabret\". \"Hugo\", which was nominated for 11 Oscars, co-starred Asa Butterfield, Ben Kingsley, Sacha Baron Cohen and Helen McCrory. Moretz then starred in Hick (2011), an adaptation of the novel by Andrea Portes. She was in Tim Burton's Dark Shadows (2012), based on the iconic TV series Dark Shadows (1966), playing the role of Carolyn Stoddard, a rebellious teenage daughter. In 2013 she reprised her role as Hit-Girl in the sequel Kick-Ass 2 (2013), which received mixed reviews, but once again her performance was highly praised. The same year she also appeared in a short segment in Movie 43 (2013) and played the title character in Carrie (2013), a remake of Carrie (1976), based on a Stephen King story and directed by Kimberly Peirce. In January 2013 Moretz was chosen to play Mia in the film adaptation of Gayle Forman's If I Stay (2014), which was released in August 2014. On January 16, 2014, it was announced Moretz would appear in an off-Broadway show directed by Steven Soderbergh entitled \"The Library\". In 2014 Chloë was in six films: a cameo as a newspaper girl in Muppets Most Wanted (2014), the female lead of prostitute Teri alongside Denzel Washington in The Equalizer (2014) and teenage party girl Annika with Keira Knightley and Sam Rockwell in Laggies (2014). In December she played the role of very young Hollywood actress with a scandalous reputation Jo-Ann Ellis alongside Kristen Stewart and Juliette Binoche in Sils Maria (2014). In April it was announced that Chloë would be playing the lead role of Cassie Sullivan in The 5th Wave (2016), another adaptation similar to The Hunger Games (2012), alongside Nick Robinson and Alex Roe. It was later announced that Chloë would play the lead female role of Digger in the movie adaptation of Sam Munson's novel \"November Criminals\". Moretz's character is the best friend of Addison Schacht, played by Ansel Elgort,","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODk0Mzc0Ml5BMl5BanBnXkFtZTgwNDYzMzgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1631269","name":"Chloë Grace Moretz","nicknames":["Chloë Grace","Chloe the braniac"],"idIMDB":"nm1631269"},"actorId":"nm1631269","character":"The Princess Kaguya","urlCharacter":"http://www.imdb.com/character/ch0466304","main":true},{"actorName":"James Caan","urlProfile":"http://www.imdb.com/name/nm0001001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjkyNDQ3NV5BMl5BanBnXkFtZTcwNjY5NTQ0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1940","placeOfBirth":" The Bronx, New York, USA","birthName":"James Edmund Caan","height":"5' 9¼\" (1.76 m)","bio":"A masculine and enigmatic actor whose life and movie career have had more ups and downs than the average rollercoaster and whose selection of roles has arguably derailed him from achieving true superstar status, James Caan is New York-born and bred. He was born in the Bronx, to Sophie (Falkenstein) and Arthur Caan, Jewish immigrants from Germany. His father was a meat dealer and butcher. The athletically gifted Caan played football at Michigan State University while studying economics, holds a black belt in karate and for several years was even a regular on the rodeo circuit, where he was nicknamed \"The Jewish Cowboy\". However, while studying at Hofstra University, he became intrigued by acting and was interviewed and accepted at Sanford Meisner's Neighborhood Playhouse. He then won a scholarship to study under acting coach Wynn Handman and began to appear in several off-Broadway productions, including \"I Roam\" and \"Mandingo\". He made his screen debut as a sailor in Irma la Douce (1963) and began to impress audiences with his work in Red Line 7000 (1965) and the western El Dorado (1967) alongside John Wayne and Robert Mitchum. Further work followed in Journey to Shiloh (1968) and in the sensitive The Rain People (1969). However, audiences were moved to tears as he put in a heart-rending performance as cancer-stricken Chicago Bears running back Brian Piccolo in the highly rated made-for-TV film Brian's Song (1971). With these strong performances under his belt, Francis Ford Coppola then cast him as hot-tempered gangster Santino \"Sonny\" Corleone in the Mafia epic The Godfather (1972). The film was an enormous success, Caan scored a Best Supporting Actor nomination and, in the years since, the role has proven to be the one most fondly remembered by his legion of fans. He reprised the role for several flashback scenes in the sequel The Godfather: Part II (1974) and then moved on to several very diverse projects. These included a cop-buddy crime partnership with Alan Arkin in the uneven Freebie and the Bean (1974), a superb performance as a man playing for his life in The Gambler (1974) alongside Lauren Hutton, and pairing with Barbra Streisand in Funny Lady (1975). Two further strong lead roles came up for him in 1975, first as futuristic sports star \"Jonathon E\" questioning the moral fiber of a sterile society in Rollerball (1975) and teaming up with Robert Duvall in the Sam Peckinpah spy thriller The Killer Elite (1975). Unfortunately, Caan's rising star sputtered badly at this stage of his career, and several film projects failed to find fire with either critics or audiences. These included such failures as the hokey Harry and Walter Go to New York (1976), the quasi-western Comes a Horseman (1978) and the saccharine Chapter Two (1979). However, he did score again with the stylish Michael Mann-directed heist movie Thief (1981). He followed this with a supernatural romantic comedy titled Kiss Me Goodbye (1982) and then, due to personal conflicts, dropped out of the spotlight for several years before returning with a stellar performance under old friend Francis Ford Coppola in the moving Gardens of Stone (1987). Caan appeared back in favor with fans and critics alike and raised his visibility with the sci-fi hit Alien Nation (1988) and Dick Tracy (1990), then surprised everyone by playing a meek romance novelist held captive after a car accident by a deranged fan in the dynamic Misery (1990). The 1990s were kind to him and he notched up roles as a band leader in For the Boys (1991), another gangster in Honeymoon in Vegas (1992), appeared in the indie hit Bottle Rocket (1996) and pursued Arnold Schwarzenegger in Eraser (1996). The demand on Caan's talents seems to have increased steadily over the past few years as he is making himself known to a new generation of fans. Recent hot onscreen roles have included The Yards (2000), City of Ghosts (2002) and Dogville (2003). In addition, he finds himself at the helm of the hit TV series Las Vegas (2003) as casino security chief \"Big Ed\" Deline. An actor of undeniably manly appeal, James Caan continues to surprise and delight audiences with his invigorating performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjkyNDQ3NV5BMl5BanBnXkFtZTcwNjY5NTQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001001","name":"James Caan","nicknames":["Jimmy"],"idIMDB":"nm0001001"},"actorId":"nm0001001","character":"The Bamboo Cutter","urlCharacter":"http://www.imdb.com/character/ch0502917","main":true},{"actorName":"Mary Steenburgen","urlProfile":"http://www.imdb.com/name/nm0005460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI5OTc0Nl5BMl5BanBnXkFtZTcwNjc5NDMwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1953","placeOfBirth":" Newport, Arkansas, USA","birthName":"Mary Nell Steenburgen","height":"5' 8\" (1.73 m)","bio":"Mary Steenburgen is an Academy Award-winning American actress. She was born February 8, 1953, in Newport, Arkansas, USA. Her mother, Nellie May (Wall) Steenburgen, was a school-board secretary, and her father, Maurice H. Steenburgen, was a freight-train conductor. Her surname comes from distant Dutch ancestry, and her roots also include English, Scottish, and Welsh. Young Steenburgen was fond of arts and literature. Mary grew up tap-dancing her way through talent shows and school functions. She was active in her school drama class. After appearing in a number of high school plays, she enrolled at Hendrix College, a highly progressive Southern School located in Conway, Arkansas. Upon the recommendation of her drama professor, she left college in 1972 and moved to New York to study acting professionally. In the past several years, Mary Steenburgen has emerged as one of the most accomplished and sought-after screen actresses. Ever since Jack Nicholson 'discovered' her and cast her as a sassy adventuress in his rollicking western, Goin' South (1978), her career has skyrocketed and she has won acclaim for exceptional performances in each of her diverse film roles. In Nicholas Meyer's Time After Time (1979), Steenburgen was afforded critical praise for her portrayal of a somewhat dippy but liberated young bank clerk in San Francisco who crosses paths, via time machine, with English author H.G. Wells (played by Malcolm McDowell, who later became her husband. In 1980 she shot to fame with her role as Lynda Dummar in Melvin and Howard (1980) for which she won Oscar for Best Actress in a Supporting Role. More recently, Steenburgen again impressed audiences and critics alike with her stunning performance as the strong-willed turn-of-the-century Mother in Ragtime (1981). Steenburgen is a notable patron of arts. She is also an active supporter of humanitarian causes. She has two children from her previous marriage to actor Malcolm McDowell. Since 1995 she has been married to actor Ted Danson, and the couple is living in Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI5OTc0Nl5BMl5BanBnXkFtZTcwNjc5NDMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005460","name":"Mary Steenburgen","idIMDB":"nm0005460"},"actorId":"nm0005460","character":"The Bamboo Cutter's Wife / Narrator","urlCharacter":"http://www.imdb.com/character/ch0502917","main":true},{"actorName":"Darren Criss","urlProfile":"http://www.imdb.com/name/nm2023050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2Mjg1NTQwMV5BMl5BanBnXkFtZTcwMzYzNDUwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1987","placeOfBirth":" San Francisco, California, USA","birthName":"Darren Everett Criss","height":"5' 8\" (1.73 m)","bio":"Darren Criss was born on February 5, 1987 in San Francisco, California, USA as Darren Everett Criss. He is an actor, known for Glee (2009), The Tale of the Princess Kaguya (2013) and A Very Potter Musical (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2Mjg1NTQwMV5BMl5BanBnXkFtZTcwMzYzNDUwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2023050","name":"Darren Criss","nicknames":["Dcriss","Dare"],"idIMDB":"nm2023050"},"actorId":"nm2023050","character":"Sutemaru","urlCharacter":"http://www.imdb.com/character/ch0479861","main":true},{"actorName":"Lucy Liu","urlProfile":"http://www.imdb.com/name/nm0005154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxODE0MjI5Ml5BMl5BanBnXkFtZTcwMjkxMzMzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1968","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Lucy Alexis Liu","height":"5' 3\" (1.6 m)","bio":"Born to immigrants in Queens, New York, Lucy Liu has always tried to balance an interest in her cultural heritage with a desire to move beyond a strictly Asian-American experience. Lucy's mother, Cecilia, a biochemist, is from Beijing, and her father, Tom Liu, a civil engineer, is from Shanghai. Once relegated to \"ethnic\" parts, the energetic actress is finally earning her stripes as an across-the-board leading lady. Liu graduated from Stuyvesant High School in 1986 and enrolled in New York University; discouraged by the \"dark and sarcastic\" atmosphere of NYU, however, she transferred to the University of Michigan after her freshman year. She graduated from UM with a degree in Chinese Language and Culture, managing to squeeze in some additional training in dance, voice, fine arts, and acting. During her senior year, Liu auditioned for a small part in a production of Alice in Wonderland and walked away with the lead; encouraged by the experience, she decided to take the plunge into professional acting. She moved to Los Angeles and split her time between auditions and food service day jobs, eventually scoring a guest appearance as a waitress on Beverly Hills, 90210 (1990). That performance led to more walk-on parts in shows like NYPD Blue (1993), ER (1994), and The X-Files (1993). In 1996, she was cast as an ambitious college student on Rhea Perlman's ephemeral sitcom Pearl (1996). Liu first appeared on the big screen as an ex-girlfriend in Jerry Maguire (1996) (she had previously filmed a scene in the indie Bang (1995), but it was shelved for two years). She then waded through a series of supporting parts in small films before landing her big break on Ally McBeal (1997). Liu initially auditioned for the role of Nelle Porter, which went to Portia de Rossi, but writer-producer David E. Kelley was so impressed with her that he promised to write a part for her in an upcoming episode. The part turned out to be that of growling, ill-tempered lawyer Ling Woo, which Liu filled with such aplomb that she was signed on as a regular cast member. The \"Ally\" win gave Liu's film career a much-needed boost--in 1999, she was cast as a dominatrix in the Mel Gibson action flick Payback (1999), and as a hitchhiker in the ill-received boxing saga Play It to the Bone (1999). The next year brought even larger roles: first as the kidnapped Princess Pei Pei in Jackie Chan's western Shanghai Noon (2000), then as one-third of the comely crime-fighting trio in Charlie's Angels (2000). When she's not hissing at clients or throwing well-coiffed punches, Liu keeps busy with an eclectic mix of off-screen hobbies. She practices the martial art of Kali-Eskrima-Silat (knife-and-stick fighting), skis, rock climbs, rides horses, and plays the accordion. In 1993 she exhibited a collection of multimedia art pieces at the Cast Iron Gallery in SoHo (New York), after which she won a grant to study and create art in China. Her hectic schedule doesn't leave much time for romantic intrigue, but Liu says she prefers to keep that side of her life uncluttered.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxODE0MjI5Ml5BMl5BanBnXkFtZTcwMjkxMzMzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005154","name":"Lucy Liu","idIMDB":"nm0005154"},"actorId":"nm0005154","character":"Lady Sagami","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beau Bridges","urlProfile":"http://www.imdb.com/name/nm0000977","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTY4NzEzOF5BMl5BanBnXkFtZTYwNjgyNTIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1941","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Lloyd Vernet Bridges III","height":"5' 10\" (1.78 m)","bio":"Beau Bridges is the son of actor Lloyd Bridges and his wife, who was his college sweetheart, Dorothy Dean Bridges. Born just two days after the attack on Pearl Harbour, he was delivered by candlelight because of a power blackout. Named Lloyd Vernet Bridges III, his parents immediately started calling him Beau after Ashley Wilkes' son in Gone with the Wind (1939), a book they were reading at the time. His younger brother, actor Jeff Bridges, was born in 1949 and a sister, Cindy Bridges, the following year. Although only 5'10\", Beau played basketball for UCLA his freshman year. The following year he transferred to the University of Hawaii, but dropped out to pursue acting and got his first major role in 1967. During his first marriage to Julie Landifield, they adopted Casey Bridges and then had Jordan Bridges. He and his second wife, Wendy Treece Bridges, have three children from this marriage: Dylan Bridges (born 1985); Emily Bridges, (born 1987) and Ezekiel Jeffry Bridges. Beau likes to play guitar and collects Native American percussion instruments. He also loves the ocean, including swimming and surfing. He is also active in environmental causes and handgun control.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MTY4NzEzOF5BMl5BanBnXkFtZTYwNjgyNTIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000977","name":"Beau Bridges","idIMDB":"nm0000977"},"actorId":"nm0000977","character":"Prince Kuramochi","urlCharacter":"http://www.imdb.com/character/ch0479859","main":true},{"actorName":"James Marsden","urlProfile":"http://www.imdb.com/name/nm0005188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1973","placeOfBirth":" Stillwater, Oklahoma, USA","birthName":"James Paul Marsden","height":"5' 10\" (1.78 m)","bio":"James Paul Marsden, or better known as just James Marsden, was born on September 18, 1973, in Stillwater, Oklahoma, to Kathleen (Scholz) and James Luther Marsden. His father, a distinguished Professor of Animal Sciences & Industry at Kansas State University, and his mother, a nutritionist, divorced when he was nine years old. James grew up with his four other siblings, sisters, Jennifer and Elizabeth, and brothers, Jeff and Robert. He has English, German, and Scottish ancestry. During his teen years, he attended Putnam City North High School which was located in Oklahoma City. After graduating in 1991, he attended Oklahoma State University and studied Broadcast Journalism. While in university, he became a member of the Delta Tau Delta fraternity. While vacationing with his family in Hawaii, he met actor Kirk Cameron, and his actress sister, Candace Cameron Bure. They eventually invited James to visit them in Los Angeles. After studying in Oklahoma State for over a year and appearing in his college production, \"Bye Bye Birdie\", he left school and moved to Los Angeles to pursue his interest in acting. James got his first job on the pilot episode of The Nanny (1993) as Eddie, who was Margaret Sheffield's boyfriend. He then became part of the Canadian television series, Boogies Diner (1994), which aired for one season. After that series ended, he got a brief role as the original Griffin on Fox's Party of Five (1994). His first big break came when he became the lead on the short-lived ABC series, Second Noah (1996). Although the show didn't last long, the young actor received enough exposure from the public and even managed to win the hearts of fellow teenage girls. In 1996, he attended an audition for a movie titled Primal Fear (1996) but unfortunately lost that role to Edward Norton. Two years later, he was offered a lead role in 54 (1998), which he turned down. The role later went to another actor, Ryan Phillippe. James' star power increased when he starred in David Nutter's Comportements troublants (1998), alongside Katie Holmes and Nick Stahl, which had mixed reviews, but mostly positive ones. His role in the television series as Glenn Foy in Ally McBeal (1997), is probably one of his biggest achievement to date. He became one of the main cast members during the first half of season 5, where he showcased his singing abilities. It was in that show where he was able to grab the attention of audiences from different backgrounds. The 5' 10\" star later played Lon Hammon Jr. in the romantic movie, The Notebook (2004), which was based on a novel by Nicholas Sparks of the same name. His movies, Lies & Alibis (2006) and 10th & Wolf (2006) was also released around the world to audiences in the year 2006. One of his most memorable roles to fans is his role as Cyclops in the X-Men (2000) movie franchise. The movie was well accepted by audiences and critics, which eventually made James one of the hottest stars since it was released. He was among the actors who starred in all three of the X-Men movies. James had the honor of working alongside Patrick Stewart, Famke Janssen and Hugh Jackman in the film. However, not many people know that he actually had to wear lifts for most of his scenes in the X-men movies, because his character Cyclops is supposed to be 6\" 3\" compared to a 5' 3\" Wolverine. In reality, he is actually under 6' 0\", shorter than Famke Janssen who plays his love interest, Jean Grey, and even shorter than Hugh Jackman who played Wolverine. In the year 2006, he played Richard White in the highly anticipated movie, Superman Returns (2006), which coincidentally was directed by Bryan Singer, who also directed previous X-Men installments. Although he appeared in X-Men: L'affrontement final (2006), the third installment of the X-Men franchise, many would notice that he in fact had more screen time in 'Superman Returns', as Lois Lane's long awaiting fiancé who had to accept the fact that his fiancée is in love with the man of steel. James earned great reviews from that movie, which led to him getting more movie roles. In 2007, James played Corny Collins in the film Hairspray (2007), an adaption of the Broadway musical based on John Waters movie, Hairspray (1988). He joined a star-studded cast, starring alongside top names such as John Travolta, Queen Latifah and Michelle Pfeiffer. James not only acted in that movie, but also sang two of the film's songs, \"The Nicest Kids In Town\", and \"Hairspray\". Being part of Hairspray catapulted James to a different level of stardom as audiences got to see another side of him. His next role was in the Disney movie, Enchanted (2007), playing Prince Edward, where he acted alongside Amy Adams, Susan Sarandon and Patrick Dempsey. Once again, James had the opportunity to sing in two songs from the movie, \"True Love's Kiss\" and \"That's Amore\". Enchanted (2007) appealed to not only older audiences but also to those who were fans of Disney's network productions. Following his huge success in the years 2006 and 2007, James played the male lead role in the romantic comedy, 27 Dresses (2008), opposite actress Katherine Heigl in 2008. The movie did well at the box office, earning a gross revenue of over $159 million, which exceeded the expectations of crew members especially since it was under a $30 million budget. Marsden played the male lead in the horror film, The Box (2009), based on the 1970 short story \"Button, Button\" by author Richard Matheson. He starred opposite Cameron Diaz in the movie. He co-starred in Accidental Love (2015) (previously Accidental Love (2015), a politically-themed romantic comedy, directed by David O. Russell and filmed in Columbia, South Carolina. Marsden's recent film roles include the sequel comedy Anchorman 2: The Legend Continues (2013), the romantic drama The Best of Me (2014), and the comedy Unfinished Business (2015). James was married to Lisa Linde, an actress known from her role in Days of Our Lives (1965). Lisa is the daughter of legendary country music songwriter Dennis Linde. The couple wed on July 22, 2000 and have a son, Jack Holden Marsden who was born on February 1, 2001, and a daughter, Mary James, who was born on August 10, 2005. They divorced in 2011. James has another son, born in 2012, with model Rose Costa. Many would assume that with all this success achieved by James at this age, he would be somewhat high-headed but James mentioned that despite all the attention he's getting from the public eye, he tries to keep himself as grounded as possible. He even admits that he flies coach instead of first class while traveling with his family. In an interview he mentioned that he believes he has a certain responsibility to let his children know that he isn't special because of what he does, but who he is as a person. With a great humble attitude and a bright future ahead of him, there's definitely more to expect from this Oklahoma native.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005188","name":"James Marsden","nicknames":["Bello Jimmy","J. P."],"idIMDB":"nm0005188"},"actorId":"nm0005188","character":"Prince Ishitsukuri","urlCharacter":"http://www.imdb.com/character/ch0479862","main":true},{"actorName":"Oliver Platt","urlProfile":"http://www.imdb.com/name/nm0001624","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkzNDgzNjEyM15BMl5BanBnXkFtZTYwNzQzODA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1960","placeOfBirth":" Windsor, Ontario, Canada","birthName":"Oliver James Platt","height":"6' 3½\" (1.92 m)","bio":"Oliver Platt was born in Windsor, Ontario, to American parents, Sheila Maynard, a social worker, and Nicholas Platt, a career diplomat. His parents were both from upper-class families, and his maternal great-grandmother, Cynthia Roche, was the sister of Princess Diana's maternal grandfather, Maurice Roche. Platt spent his childhood in Washington DC, Asia, and the middle east. Oliver graduated with a Bachelor of Arts degree with a major in Drama in 1983 from Tufts University. He then trained at Shakespeare & Co. with Kristine Linklater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkzNDgzNjEyM15BMl5BanBnXkFtZTYwNzQzODA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001624","name":"Oliver Platt","idIMDB":"nm0001624"},"actorId":"nm0001624","character":"Lord Minster of the Right Abe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hynden Walch","urlProfile":"http://www.imdb.com/name/nm0906945","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzQ2MzM2Ml5BMl5BanBnXkFtZTgwNTM2MjQyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1971","placeOfBirth":" Davenport, Iowa, USA","birthName":"Heidi Hynden Walch","height":"5' 2½\" (1.59 m)","bio":"Hynden Walch was born on February 1, 1971 in Davenport, Iowa. She is an actress and writer known primarily for her work in Adventure Time, Teen Titans, Groundhog Day, and Batman Assault on Arkham. She started her professional acting career on stage at age 11. At 16 she attended the North Carolina School of the Arts, majoring in voice. As a high school senior, she was awarded as a Presidential Scholar in the Arts in drama. Hynden won the Outer Critics Circle Award for her performance as Little Voice in The Rise and Fall of Little Voice on Broadway. In 2005 she graduated summa cum laude from UCLA with a B.A. in American Literature and founded the Hillside Produce Cooperative, a free exchange of local, organically grown food, for which she was named runner up Citizen Entrepreneur of the Year by Global Green USA. Hynden has been married to Sean McDermott since 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzQ2MzM2Ml5BMl5BanBnXkFtZTgwNTM2MjQyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0906945","name":"Hynden Walch","idIMDB":"nm0906945"},"actorId":"nm0906945","character":"Me no Warawa","urlCharacter":"http://www.imdb.com/character/ch0479863","main":true},{"actorName":"Dean Cain","urlProfile":"http://www.imdb.com/name/nm0001002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzIwNTY3NF5BMl5BanBnXkFtZTgwMTc3MTEwMzE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1966","placeOfBirth":" Mt. Clemens, Michigan, USA","birthName":"Dean George Tanaka","height":"5' 11½\" (1.82 m)","bio":"Dean Cain was born Dean George Tanaka in Mount Clemens, Michigan, to actress Sharon Thomas Cain and Roger Tanaka. His mother married his adoptive father, director Christopher Cain, when Dean was three. Though he grew up in Malibu and attended Santa Monica High School, his career plans favored professional football over acting. While at Princeton, he completed a history major, dated Brooke Shields for two years, and set an NCAA record for interceptions in a season. After signing with the Buffalo Bills, a knee injury ended his pro career before it began. Though he had already played a part in his father's The Stone Boy (1984), he went through the usual route of commercials and tv-parts (notably, Beverly Hills, 90210 (1990) in 1990) before landing his break-through role as Superman/Clark Kent in the series Lois & Clark: The New Adventures of Superman (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzIwNTY3NF5BMl5BanBnXkFtZTgwMTc3MTEwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001002","name":"Dean Cain","idIMDB":"nm0001002"},"actorId":"nm0001002","character":"The Mikado","urlCharacter":"http://www.imdb.com/character/ch0479860","main":true},{"actorName":"Daniel Dae Kim","urlProfile":"http://www.imdb.com/name/nm0196654","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyNjcwODU4NV5BMl5BanBnXkFtZTgwNTI0MjYzMDI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1968","placeOfBirth":" Pusan, South Korea","birthName":"Dae-Hyun Kim","height":"5' 9\" (1.75 m)","bio":"Through the diversity of his roles on stage and screen, Daniel Dae Kim continues to expand our perceptions of the Asian-American man. In characters ranging from the King of Siam, a Shakespearean hero, a social worker for the Chicago needy, to a counter-terrorist agent, his work has consistently proven to transcend the historical barriers of race and stereotype. Daniel's most recent work on ABC's Lost (2004), is no exception. As \"Jin Soo Kwon\", a Korean businessman and reluctant enforcer for his father-in-law, his character transformed from an overprotective \"traditional\" husband to a man who re-learns how to live and love. His portrayal of this multi-faceted character signaled a breakthrough for primetime network television, and has helped make Lost (2004) a worldwide hit since its debut in 2004. Since then, both Daniel and the show have been widely recognized for their excellence. Sharing a 2006 Screen Actors Guild Award for Best Ensemble, the Korean-American actor's universal appeal was also recognized by \"People\" Magazine, which named him one of the \"Sexiest Men Alive\" in 2005, as well as \"TV Guide\", which recognized him as one of \"TV's Sexiest Men\" in 2006. In that same year, Daniel was individually honored with an AZN Asian Excellence Award, a Multicultural Prism Award and a Vanguard Award from the Korean American Coalition, all for Outstanding Performance by an Actor. In 2009, his recognition continues with the prestigious KoreAm Journal Achievement Award in the field of Arts and Entertainment. Born in Busan, South Korea and raised in New York and Pennsylvania, Daniel discovered acting while a student at Haverford College. Though briefly considering a career as an attorney, he decided to follow his true passion and moved to New York City, where he began his work on stage. There, he performed in classics such as \"Romeo and Juliet\", Anton Chekhov's \"Ivanov\" and Henrik Ibsen's \"A Doll's House\", as well as working with an improv comedy troupe. Despite his early success, however, he decided to deepen his dedication to the craft by studying at the Graduate Acting program at New York University's Tisch School of the Arts, where he earned a Master's Degree in Fine Arts in 1996. Upon graduation, Daniel's film career began in earnest with roles in The Jackal (1997), For Love of the Game (1999), The Hulk (2003), Spider-Man 2 (2004) and The Cave (2005), as well as the Academy Award-winner for Best Picture, Collision (2004). Most recently, he completed production on The Adjustment Bureau (2011), starring Matt Damon and directed by George Nolfi. On television, he's guest-starred on numerous shows, including CSI: Crime Scene Investigation (2000), ER (1994) and, for two seasons, 24 (2001) as CTU Agent \"Tom Baker\". In 2008, he also starred in the Emmy-nominated mini-series adaptation of Michael Crichton's The Andromeda Strain (2008). Kim has also complemented his television work by lending his voice talents to video games, creating characters in \"Saints Row\" 1 and 2, \"Scarface: The World Is Yours\", \"Tenchu\" and \"24\", as well as the animated TV series' Justice League (2001) Unlimited and Avatar: The Last Airbender (2005). Daniel rekindled his love for the stage by performing the role of the \"King of Siam\" in the iconic production, \"The King and I\", directed by Jeremy Sams, at London's world-renowned Royal Albert Hall. In 2010, Kim was cast as Chin Ho Kelly, a disgraced police officer who is recruited by Commander Steve McGarrett and Danny \"Danno\" Williams to work for the governor's task force \"Five-0\", in Hawaii Five-0 (2010). His cousin Kono Kalakaua joins them in the first season as an officer just finishing her training as a new addition to the Five-0 team. The show is launching the sixth season in September 2015. Though he spends time in Los Angeles and New York, Daniel spends most of the year in Honolulu, where he devotes his free time to a number of different charities, his restaurant and his family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyNjcwODU4NV5BMl5BanBnXkFtZTgwNTI0MjYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0196654","name":"Daniel Dae Kim","nicknames":["DDK"],"idIMDB":"nm0196654"},"actorId":"nm0196654","character":"Great Counselor Otomo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Segal","urlProfile":"http://www.imdb.com/name/nm0001719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzc4NTQwM15BMl5BanBnXkFtZTcwMTc0MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1934","placeOfBirth":" Great Neck, Long Island, New York, USA","birthName":"George Segal Jr.","height":"5' 10½\" (1.79 m)","bio":"George Segal was born on February 13, 1934 in Great Neck, Long Island, New York, to Fannie Blanche (Bodkin) and George Segal, Sr., a malt and hop agent. All of his grandparents were Russian Jewish immigrants. After a stint in the military, he made his bones as a stage actor before being cast in his first meaty film role in The Young Doctors (1961). His turns in Ship of Fools (1965) and the eponymous King Rat (1965) in 1965 heralded the arrival of a major talent. He followed it up with his Oscar-nominated performance in Who's Afraid of Virginia Woolf? (1966), in which he more than held his own against Richard Burton and Elizabeth Taylor. Who's Afraid of Virginia Woolf? (1966) was a cultural phenomenon, the film that wrecked the MPDDA censorship code that had been in place since 1934, and a huge box office success to boot. By the early 1970s, appearances in such films as The Owl and the Pussycat (1970), Blume in Love (1973), Born to Win (1971) and The Hot Rock (1972) had made him a major star with an enviable reputation, just under the heights of the superstar status enjoyed by the likes of Paul Newman. He followed up A Touch of Class (1973) (a hit film for which his co-star Glenda Jackson won an Oscar) with his brilliant performance as the out-of-control gambler in Robert Altman's California Split (1974). At one time in the early 1970s, it seemed like George Segal would have a career like that enjoyed by his contemporary Jack Nicholson, that of an actor's actor equally adept at comedy and drama. Segal never made the leap to superstar status, and surprisingly, has never won a major acting award, the latter phenomenon being particularly surprising when viewed from the period 1973-4, when he reached the height of his career. It was at this point that Segal's career went awry, when he priced himself as a superstar with a seven-figure salary, but failed to come through at the box office. For example, The Black Bird (1975) was a failure, although his subsequent starring turn opposite of Jane Fonda, in Fun with Dick and Jane (1977), was a big hit that revitalized Jane Fonda's career. At the end of the decade, he dropped out of a movie that would have burnished his tarnished lustre as a star: Blake Edwards' 10 (1979). 10 (1979) made Dudley Moore a star, while Arthur (1981) made him a superstar in the 1980s, a lost decade for Segal. It was an example of a career burnout usually associated with the \"Oscar curse\" (his No Way to Treat a Lady (1968) co-star Rod Steiger, for example, was a great character actor whose career was run off the rails by the expectations raised by the Academy Award). George Segal has never won an Oscar, but more surprisingly, has only been nominated once, for Best Supporting Actor of 1966 for his role as \"Nick\" in Who's Afraid of Virginia Woolf? (1966). He gave a deft comic performance in Who Is Killing the Great Chefs of Europe? (1978) with Jacqueline Bisset and Robert Morley, which proved a modest box office success. For all practical purposes, even after the failures of The Black Bird (1975), and The Duchess and the Dirtwater Fox (1976), it seemed like Segal, with a few deft career choices, could reorient his career and deliver on the promise of his early period. That he didn't may be the unintended consequence of his focusing on comedy to the detriment of drama. The comedy A Touch of Class (1973) made him a million dollar-per-film movie star, and that's what he concentrated on. Segal began relying on his considerable charm to pull off movies that had little going for them other than their star, and it backfired on him. These films weren't infused with the outrageously funny, subversive comedy of Where's Poppa? (1970), a success from his first period that he enjoyed along with co-star Ruth Gordon and director Carl Reiner. When Segal first made it in the mid-1960s, he established his serious actor bona fides with a deal he cut with ABC-TV that featured him in TV adaptations of Broadway plays. He also played a very memorable \"Biff Loman\" in Death of a Salesman (1966), shining in performance in counterpoint to the vital presence that was Lee J. Cobb's \"Willy Loman\". It was a good life for an actor, and he took time to show off his banjo-playing skills by fronting the \"Beverly Hills Unlisted Jazz Band\", with which he cut several records. While the 1980s were mostly a career wasteland for Segal, he came back in the 1990s, using his flair for comedy as part of the ensemble cast of Just Shoot Me! (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzc4NTQwM15BMl5BanBnXkFtZTcwMTc0MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001719","name":"George Segal","idIMDB":"nm0001719"},"actorId":"nm0001719","character":"Inbe no Akita","urlCharacter":"http://www.imdb.com/character/ch0499000","main":true},{"actorName":"John Cho","urlProfile":"http://www.imdb.com/name/nm0158626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGEyMjFmMDUtNGNiNC00MzMxLTg1YjktNzlkMzk0NDI2NDA1XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1972","placeOfBirth":" Seoul, South Korea","birthName":"John Yohan Cho","height":"5' 10\" (1.78 m)","bio":"John Yohan Cho was born in Seoul, South Korea, but moved to Los Angeles, California as a child, where his father was a Christian minister. Cho was educated at Herbert Hoover High School at Glendale before moving on to the University of California at Berkeley where he studied English Literature. Upon graduation, Cho moved back to Los Angeles, working for a while as a teacher at Pacific Hills School. He also began acting with the famed Asian American theater company East West Players. A screen acting career began with small roles in projects such as Wag the Dog (1997) and Bowfinger (1999). His breakthrough came when he appeared in the teen romance comedy American Pie (1999) and helped coin the phrase \"MILF\". Other roles followed, and he scored another hit in the slacker comedy Harold & Kumar Go to White Castle (2004). Cho also starred in the hugely successful franchise reboot Star Trek (2009), in the sought after role of Hikaru Sulu. As well as acting, Cho is also a singer and performs in the band Viva La Union. He is married to actress Kerri Higuchi and they have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4Nzk2NjUxNF5BMl5BanBnXkFtZTgwMzY3NDI2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0158626","name":"John Cho","idIMDB":"nm0158626"},"actorId":"nm0158626","character":"Middle Counselor Isonokami","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emily Bridges","urlProfile":"http://www.imdb.com/name/nm0108733","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkzNjM1NzA1N15BMl5BanBnXkFtZTgwMTc1MTExMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1986","placeOfBirth":" Los Angeles County, California, USA","birthName":"Emily Beau Bridges","bio":"Emily Bridges was born on July 2, 1986 in Los Angeles County, California, USA as Emily Beau Bridges. She is an actress, known for The Tale of the Princess Kaguya (2013), Grooming (2014) and Purple Mind (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkzNjM1NzA1N15BMl5BanBnXkFtZTgwMTc1MTExMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0108733","name":"Emily Bridges","idIMDB":"nm0108733"},"actorId":"nm0108733","character":"Kita no Kata","urlCharacter":"http://www.imdb.com/character/ch0479858","main":true},{"actorName":"Brian Leone","urlProfile":"http://www.imdb.com/name/nm4470531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDg2NjM3N15BMl5BanBnXkFtZTgwOTY2MTQ5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Brian Leone is known for his work on The Tale of the Princess Kaguya (2013), Godzilla (2014) and Sex Tape (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDg2NjM3N15BMl5BanBnXkFtZTgwOTY2MTQ5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4470531","name":"Brian Leone","idIMDB":"nm4470531"},"actorId":"nm4470531","character":"Villager","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2576852","urlIMDB":"http://www.imdb.com/title/tt2576852","business":{"budget":{"money":"¥5,000,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"¥284,252,550","country":"Japan","day":"25","month":"11","year":"2013","remarks":"456 Screens"}],"gross":[{"money":"$695,929","country":"USA","day":"08","month":"03","year":"2015","remarks":""},{"money":"$681,072","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$676,468","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$656,476","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$627,558","country":"USA","day":"25","month":"01","year":"2015","remarks":""},{"money":"¥284,252,550","country":"Japan","day":"25","month":"11","year":"2013","remarks":""}],"weekendGross":[{"money":"$3,071","country":"USA","day":"08","month":"03","year":"2015","remarks":"4 Screens"},{"money":"$2,936","country":"USA","day":"01","month":"03","year":"2015","remarks":"7 Screens"},{"money":"$5,956","country":"USA","day":"22","month":"02","year":"2015","remarks":"10 Screens"},{"money":"$2,508","country":"USA","day":"08","month":"02","year":"2015","remarks":"4 Screens"},{"money":"$6,109","country":"USA","day":"25","month":"01","year":"2015","remarks":"8 Screens"},{"money":"¥284,252,550","country":"Japan","day":"25","month":"11","year":"2013","remarks":"456 Screens"}],"admissions":[{"money":"5,064","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 17 min (137 min)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Imagica Corporation, Shinagawa-ku, Tokyo, Japan (prints)"],"filmLength":null,"negativeFormat":["Digital"],"cinematographicProcess":["Digital (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision Premier 2393)","D-Cinema"]},"rating":"8.1","metascore":"89","filmingLocations":[],"rated":"PG","awards":[{"award":"Academy Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Animated Feature Film of the Year","names":[{"name":"Isao Takahata","id":"nm0847223","role":null},{"name":"Yoshiaki Nishimura","id":"nm2052679","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD/Blu-Ray Release","names":[]}]}]},{"award":"Alliance of Women Film Journalists 2015","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Award","categories":[{"category":"Best Animated Feature Film","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]}]},{"award":"Annie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Animated Feature","names":[]},{"category":"Outstanding Achievement in Directing in an Animated Feature Production","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]},{"category":"Outstanding Achievement in Music in an Animated Feature Production","names":[{"name":"Joe Hisaishi","id":"nm0386749","role":null}]}]}]},{"award":"Asia Pacific Screen Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Asia Pacific Screen Award","categories":[{"category":"Best Animated Feature Film","names":[{"name":"Yoshiaki Nishimura","id":"nm2052679","role":null}]}]}]},{"award":"Awards Circuit Community Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated ACCA","categories":[{"category":"Best Animated Feature","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]}]},{"award":"Awards of the Japanese Academy 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Award of the Japanese Academy","categories":[{"category":"Best Animation Film","names":[{"name":"Isao Takahata","id":"nm0847223","role":"director"}]},{"category":"Best Music Score","names":[{"name":"Joe Hisaishi","id":"nm0386749","role":null}]}]}]},{"award":"Behind the Voice Actors Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BTVA Anime Dub Movies/Special Voice Acting Award","categories":[{"category":"Best Female Lead Vocal Performance in an Anime Feature Film/Special","names":[{"name":"Chloë Grace Moretz","id":"nm1631269","role":null}]},{"category":"Best Male Vocal Performance in an Anime Feature Film/Special in a Supporting Role","names":[{"name":"James Caan","id":"nm0001001","role":null}]},{"category":"Best Female Vocal Performance in an Anime Feature Film/Special in a Supporting Role","names":[{"name":"Lucy Liu","id":"nm0005154","role":null}]},{"category":"Best Female Vocal Performance in an Anime Feature Film/Special in a Supporting Role","names":[{"name":"Mary Steenburgen","id":"nm0005460","role":null}]},{"category":"Best Vocal Ensemble in an Anime Feature Film/Special","names":[{"name":"Chloë Grace Moretz","id":"nm1631269","role":null},{"name":"James Caan","id":"nm0001001","role":null},{"name":"Mary Steenburgen","id":"nm0005460","role":null},{"name":"Darren Criss","id":"nm2023050","role":null},{"name":"Lucy Liu","id":"nm0005154","role":null},{"name":"Hynden Walch","id":"nm0906945","role":null},{"name":"George Segal","id":"nm0001719","role":null},{"name":"Dean Cain","id":"nm0001002","role":null},{"name":"James Marsden","id":"nm0005188","role":null},{"name":"Daniel Dae Kim","id":"nm0196654","role":null}]}]}]},{"award":"Blue Ribbon Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Blue Ribbon Award","categories":[{"category":"Best Director","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]},{"category":"Best Film","names":[]}]}]},{"award":"Boston Society of Film Critics Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won BSFC Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Chicago Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Cinema Bloggers Awards, Portugal 2016","titlesAwards":[{"titleAwardOutcome":"Won Cinema Bloggers Award","categories":[{"category":"Best Asian Film","names":[]},{"category":"Best Animated Film","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]}]},{"award":"Denver Film Critics Society 2015","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Animated Film","names":[]},{"category":"Best Foreign Language Film","names":[]}]}]},{"award":"Empire Awards, UK 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Gold Derby Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Gold Derby Award","categories":[{"category":"Animated Feature","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]}]},{"award":"International Cinephile Society Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won ICS Award","categories":[{"category":"Best Animated Film","names":[]}]},{"titleAwardOutcome":"Nominated ICS Award","categories":[{"category":"Best Original Score","names":[{"name":"Joe Hisaishi","id":"nm0386749","role":null}]},{"category":"Best Film Not in the English Language","names":[]}]}]},{"award":"International Online Cinema Awards (INOCA) 2015","titlesAwards":[{"titleAwardOutcome":"Won INOCA","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Italian Online Movie Awards (IOMA) 2015","titlesAwards":[{"titleAwardOutcome":"Won IOMA","categories":[{"category":"Best Animated Feature Film (Miglior film d'animazione)","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]},{"titleAwardOutcome":"Nominated IOMA","categories":[{"category":"Best Adapted Screenplay (Miglior sceneggiatura non originale)","names":[{"name":"Isao Takahata","id":"nm0847223","role":null},{"name":"Riko Sakaguchi","id":"nm4940865","role":null}]},{"category":"Best Original Score (Miglior colonna sonora)","names":[{"name":"Joe Hisaishi","id":"nm0386749","role":null}]}]}]},{"award":"Kinema Junpo Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Kinema Junpo Award","categories":[{"category":"Best Film","names":[{"name":"Isao Takahata","id":"nm0847223","role":"director"}]}]}]},{"award":"London Critics Circle Film Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated ALFS Award","categories":[{"category":"Foreign Language Film of the Year","names":[]}]}]},{"award":"Los Angeles Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Animation","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]}]},{"award":"Melbourne International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Best Narrative Feature","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]}]},{"award":"Mill Valley Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Best Animation Film","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]}]},{"award":"North Carolina Film Critics Association 2015","titlesAwards":[{"titleAwardOutcome":"Nominated NCFCA Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"Online Film & Television Association 2015","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Animated Picture","names":[]}]}]},{"award":"Online Film Critics Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated OFCS Award","categories":[{"category":"Best Animated Feature","names":[]},{"category":"Best Film Not in the English Language","names":[]}]}]},{"award":"Oslo Films from the South Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Films from the South Award","categories":[{"category":"Best Feature","names":[{"name":"Isao Takahata","id":"nm0847223","role":"director"}]}]}]},{"award":"San Francisco Film Critics Circle 2014","titlesAwards":[{"titleAwardOutcome":"Nominated SFFCC Award","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Tokyo Anime Award 2015","titlesAwards":[{"titleAwardOutcome":"Won Best Art Direction","categories":[{"category":"Film Category","names":[{"name":"Kazuo Oga","id":"nm0644470","role":null}]}]},{"titleAwardOutcome":"Won Best Director","categories":[{"category":"Film Category","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]},{"titleAwardOutcome":"Nominated Animation of the Year","categories":[{"category":"Film Category","names":[{"name":"Isao Takahata","id":"nm0847223","role":null}]}]}]},{"award":"Toronto Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won TFCA Award","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Village Voice Film Poll 2014","titlesAwards":[{"titleAwardOutcome":"2nd place VVFP Award","categories":[{"category":"Best Animated Feature Film","names":[]}]}]}],"votes":"21,780","type":"Movie","companyCreditsSimple":[{"idCompany":"co0048420","name":"Studio Ghibli"},{"idCompany":"co0169264","name":"Dentsu"},{"idCompany":"co0164383","name":"Hakuhodo DY Media Partners"}],"keywords":{"keywords":["bamboo","princess","japan","emperor of japan","emperor","bamboo cutter","f rated","anime","nursery rhyme","children singing","hand drawn animation","2d animation","moon people","adopted daughter","moon","prince","marriage proposal","whirlpool","thief","cherry blossom","dream","cat","koto","pheasant","catching a bird","falling from height","bird","gold","baby's first steps","frog","folk tale","based on folk tale","little girl","growing up","children","coming of age","nature","baby","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:56:09"}}