{"data":{"movies":[{"title":"Poker Night","originalTitle":"","year":"2014","releaseDate":"20141120","directors":[{"name":"Greg Francis","id":"nm1378747"}],"writers":[{"name":"Doug Buchanan","id":"nm4038714"},{"name":"Greg Francis","id":"nm1378747"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5Mjg1NTE3MF5BMl5BanBnXkFtZTgwMjg4Nzc1MzE@._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Action","Crime","Horror","Thriller"],"plot":"When you become a detective in Warsaw Indiana - you go to Poker Night, where you play against some of the best cops in the business. They tell you stories about their time on the job - their successes and failures. When new Detective Stan Jeter leaves the game, he is caught by a vicious psychopath and locked in a basement. Using the stories he heard at Poker Night, he must match wits against his captor - and save not only himself, but the young girl trapped in the basement with him. Like Seven and Usual Suspect, Poker Night combines thrills and twists and turns that will leave you guessing till the very end.","simplePlot":"When you become a detective in Warsaw Indiana - you go to Poker Night, where you play against some of the best cops in the business. They tell you stories about their time on the job - ... ","actors":[{"actorName":"Beau Mirchoff","urlProfile":"http://www.imdb.com/name/nm2155525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWRlMjIxNjEtMzg0OS00NzllLWIzMjItY2RhYzY3NjFhY2FmXkEyXkFqcGdeQXVyNzQ5NzYyNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1989","placeOfBirth":" Seattle, Washington, USA","birthName":"William Beau Mirchoff","height":"6' 1\" (1.85 m)","bio":"Beau Mirchoff was born on Friday the 13th of January, 1989, in Seattle, Washington. Two days later, he moved to his family's home in Victoria, British Columbia, Canada, on Vancouver Island. His father Bill, is a podiatrist from California and his mother Kelley, is a full-time homemaker from Washington State. Beau started training as an actor at the age of 13 in Vancouver, British Columbia. This required him to take a two hour ferry-boat venture from Vancouver Island to the mainland of British Columbia, and ride the bus an hour into the city. He did this every week until moving to Los Angeles in February of 2009 where Beau began training at the Michael Woolson Studio - the same studio he trains at today. In 2009 Beau landed the role of Danny Bolen on ABC's Desperate Housewives. In 2010 he snagged the role of Matty Mckibben on MTV's Awkward; he won a Teen Choice Award in 2012 for this portrayal. During the hiatuses from television Mirchoff focuses on the theatre: in 2012 he portrayed Treat in a production of Lyle Kessler's Orphans at the Hudson Theatre; in 2013 he played Kent in Neil Labute's Reason's to be Pretty at the MW Theatre. Other notable films include: Scary Movie 4, The Grudge 3, I am Number 4, and Poker Night alongside Ron Perlman, Giancarlo Esposito, Titus Welliver, and Ron Eldard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWRlMjIxNjEtMzg0OS00NzllLWIzMjItY2RhYzY3NjFhY2FmXkEyXkFqcGdeQXVyNzQ5NzYyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2155525","name":"Beau Mirchoff","nicknames":["Beau"],"idIMDB":"nm2155525"},"actorId":"nm2155525","character":"Stan Jeter","urlCharacter":"http://www.imdb.com/character/ch0422355","main":true},{"actorName":"Ron Perlman","urlProfile":"http://www.imdb.com/name/nm0000579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1950","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Francis Perlman","height":"6' 1\" (1.85 m)","bio":"Ron Perlman is a classically-trained actor who has appeared in countless stage plays, feature films and television productions. Ronald N. Perlman was born April 13, 1950 in Washington Heights, Manhattan, New York. His mother, Dorothy (Rosen), is retired from the City Clerk's Office. His father, Bertram \"Bert\" Perlman, now deceased, was a repairman and a drummer. His parents were both from Jewish families (from Hungary, Germany and Poland). With a career spanning over three decades, Perlman has worked alongside such diverse actors as Marlon Brando, Sean Connery, Dominique Pinon, Brad Dourif, Ed Harris, John Hurt, Jude Law, Christina Ricci, Federico Luppi, Sigourney Weaver, Michael Wincott and Elijah Wood to name a few. While he has never been a bankable star, Perlman has always had a large fanbase. He started out strong as Amoukar, one of the tribesmen in Jean-Jacques Annaud's Academy Award-winning film Quest for Fire (1981), for which he earned a Genie Award nomination. Perlman teamed up with Annaud again, this time as a hunchback named Salvatore in The Name of the Rose (1986). His first real breakthrough came later when he landed the role of the noble lion-man Vincent, opposite Linda Hamilton on the fantasy series Beauty and the Beast (1987). His work in this role earned him not only a Golden Globe Award but an underground fan following. Sadly the series was cancelled in its third season shortly after Hamilton's character's death. After that, he spent time doing supporting work on television and independent films such as Guillermo del Toro's debut Cronos (1993) (where a lifelong friendship and collaboration between the director and Perlman would blossom) as Angel and his first lead role as One in Jean-Pierre Jeunet's surreal The City of Lost Children (1995). His first real big role in a mainstream film came when Jeunet wanted him for the brutish Johner in his first Hollywood outing Alien: Resurrection (1997). Perlman has also used his distinctive voice to his advantage, appearing in many animated films/series, commercials and he is a video game fan favorite because of his work on such games as the Fallout series. It was not until much later he received worldwide fame when his good friend Guillermo del Toro helped him land the title role in the big-budget comic book movie Hellboy (2004). Del Toro fought the studio for four years because they wanted a more secure name, but he stood his ground and in 2004, after almost 25 years in and out of obscurity, Perlman became and household name and a sought out actor. Perlman has had one of the most offbeat careers in film, playing everything from a prehistoric ape-man to an aging transsexual and will always be a rarity in Hollywood. Other notable roles include the cunning Norman Arbuthnot in The Last Supper (1995), sniper expert Koulikov in Enemy at the Gates (2001), vampire leader Reinhardt in Blade II (2002), his reprisal of Hellboy in Hellboy II: The Golden Army (2008) and biker chief Clarence Morrow on the popular series Sons of Anarchy (2008). He currently resides in Los Angeles, California with his wife, Opal, and their two children, Blake and Brandon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000579","name":"Ron Perlman","idIMDB":"nm0000579"},"actorId":"nm0000579","character":"Calabrese","urlCharacter":"http://www.imdb.com/character/ch0362892","main":true},{"actorName":"Giancarlo Esposito","urlProfile":"http://www.imdb.com/name/nm0002064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyODM1NjI0OF5BMl5BanBnXkFtZTcwMTE0OTA1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1958","placeOfBirth":" Copenhagen, Denmark","birthName":"Giancarlo Giuseppe Alessandro Esposito","height":"5' 7½\" (1.71 m)","bio":"Giancarlo Giuseppe Alessandro Esposito was born in Copenhagen, Denmark, to an Italian carpenter/stagehand father from Naples and an opera-singing African-American mother from Alabama. His parents, working in Europe at the time of his birth, settled in Manhattan by the time he was six, and that's where he grew up. Coming from a theatrical background, it was, perhaps, inevitable that young Giancarlo would appear on stage sooner or later, and he did, at age 8, appearing on Broadway as a slave child in \"Maggie Flynn\" in 1966. More Broadway work followed through the '60s and early-'70s, followed by some small roles in movies. TV work followed in the 1980s with increasingly significant parts in a string of high profile series until he became well established as a character player both on TV and in a number of movies. He came very much to the public's attention playing Agent Mike Giardello in the TV series Homicide: Life on the Street (1993) in 1998 and since then has rarely been off our screens.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyODM1NjI0OF5BMl5BanBnXkFtZTcwMTE0OTA1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002064","name":"Giancarlo Esposito","idIMDB":"nm0002064"},"actorId":"nm0002064","character":"Bernard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Titus Welliver","urlProfile":"http://www.imdb.com/name/nm0920038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTA0Mzg3N15BMl5BanBnXkFtZTcwNDExMzc0Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1961","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Titus B. Welliver","height":"5' 11¾\" (1.82 m)","bio":"Titus Welliver was born on March 12, 1961 in New Haven, Connecticut. His father was a famous landscape painter, Neil Welliver. His mother was a fashion illustrator, Norma Cripps. He has three brothers, one was killed overseas. He was raised in Philadelphia and New York City, surrounded by poets and painters. He credits them for his creativity. Originally wanting to be a painter like his father, he later decided to pursue acting. Titus moved to New York in 1980 to learn his craft. He enrolled in classes at New York's HB Acting Studios while attending New York University. To support himself, Titus did a variety of jobs including bartender and construction worker. His first paid acting job was in Navy Seals (1990) with Charlie Sheen, playing a redneck in the bar.\" He soon began to appear in movies, including JFK (1991) and The Doors (1991). While appearing in movies, he continued to work in live theatre. He appeared in stage productions of Riff Raff, American Buffalo, Naked at the Coast, and Shakespeare's Henry IV Parts I and II. During the 1990s, he guest starred on many TV shows like Matlock (1986), L.A. Law (1986), The X-Files (1993), and L'as de la crime (1991), and appeared in many TV Movies including An American Story (1992) and Mind Prey (1999). He had recurring roles on Murder One (1995) and High Incident (1996). Then he got a regular part on Steven Bochco's Brooklyn South (1997) as Officer Jack Lowery and played a recurring character on Bochco's and David Milch's NYPD Blue (1993). He also had starring roles on Big Apple (2001) and the second season of That's Life (2000) playing Dr. Eric Hackett opposite Paul Sorvino and Ellen Burstyn. In 2004, he got a semi-regular role on David Milch's critically acclaimed HBO drama Deadwood (2004) as Silas Adams. After \"Deadwood\" ended, he mostly guest starred on TV shows including Law & Order (1990), Jericho (2006) and NCIS (2003), but also appeared in movies including in Ben Affleck's feature film directorial debut Gone Baby Gone (2007). He has appeared in Affleck's The Town (2010) and Argo (2012). He also had recurring roles on Lost (2004) as Man in Black, Sons of Anarchy (2008) as Irish gun kingpin Jimmy O'Phelan, and The Good Wife (2009) as Glenn Childs. After \"The Good Wife\", he had recurring roles on CSI: Crime Scene Investigation (2000), Touch (2012), The Last Ship (2014), Suits (2011) and Agents of S.H.I.E.L.D. (2013), but also appeared in The Mentalist (2008) and White Collar (2009). His notable movie roles include in Man on a Ledge (2012), Promised Land (2012) and Transformers: Age of Extinction (2014). In 2014, he was cast as LAPD Homicide Detective Harry Bosch in Bosch (2014), which has its third season in 2017. Like his father, Neil, Titus is an acclaimed landscape painter, and has had shows in Maine, California and Connecticut.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTA0Mzg3N15BMl5BanBnXkFtZTcwNDExMzc0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0920038","name":"Titus Welliver","idIMDB":"nm0920038"},"actorId":"nm0920038","character":"Maxwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Eklund","urlProfile":"http://www.imdb.com/name/nm1002664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEwODcwMDAyM15BMl5BanBnXkFtZTcwNTUxNjc1Ng@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Michael Eklund was born in Saskatoon, Saskatchewan, Canada. He is an actor and producer, known for The Call (2013), Watchmen (2009) and Eadweard (2015). He was previously married to Megan Bennett and Erin MacGilvray.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEwODcwMDAyM15BMl5BanBnXkFtZTcwNTUxNjc1Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1002664","name":"Michael Eklund","idIMDB":"nm1002664"},"actorId":"nm1002664","character":"The Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Eldard","urlProfile":"http://www.imdb.com/name/nm0253035","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjQ3MjQyOF5BMl5BanBnXkFtZTcwMTYxODgwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1965","placeOfBirth":" Long Island, New York, USA","birthName":"Ronald Jason Eldard","height":"5' 10\" (1.78 m)","bio":"Former golden gloves boxer Ron Eldard has found success on stage, television and in feature films. Fans of the NBC medical drama ER (1994) will remember Eldard for playing a paramedic and love interest for nurse Julianna Margulies on the show's second season. The New York native graduated from the city's prestigious High School of the Performing Arts after studying drama and made his feature film debut in Nancy Savoca's True Love (1989). Eldard's subsequent major film roles include that of an inner city youth coping with the consequences of a practical joke gone horribly awry in Barry Levinson's Sleepers (1996). On stage, Eldard made a name for himself appearing in the off-Broadway productions of \"AveNu Boys\" and \"Servy 'n' Bernice 4Ever\" and, in his one man show, \"Standing Eight Count\". His Broadway credits include Neil Simon's \"Biloxi Blues\" and \"On the Waterfront\". On television, Eldard starred in the short-lived NBC sitcom Men Behaving Badly (1996) and in Bakersfield P.D. (1993). Eldard has also appeared in several made-for-television movies, including Showtime's Bastard Out of Carolina (1996) and HBO's When Trumpets Fade (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjQ3MjQyOF5BMl5BanBnXkFtZTcwMTYxODgwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0253035","name":"Ron Eldard","idIMDB":"nm0253035"},"actorId":"nm0253035","character":"Cunningham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corey Large","urlProfile":"http://www.imdb.com/name/nm1143429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1Nzc2NTk0MV5BMl5BanBnXkFtZTcwNDUyNjY3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1975","placeOfBirth":" Victoria, British Columbia, Canada","birthName":"Corey William Large","height":"6' 2\" (1.88 m)","bio":"Corey is from Victoria, British Columbia, Canada. He is a huge sports fan and his goal was to be a pro baseball player. An injury cut that short and led to his other love, acting. He moved to Vancouver at 21 and started getting roles right away. He currently resides in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1Nzc2NTk0MV5BMl5BanBnXkFtZTcwNDUyNjY3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1143429","name":"Corey Large","idIMDB":"nm1143429"},"actorId":"nm1143429","character":"Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Halston Sage","urlProfile":"http://www.imdb.com/name/nm4296013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDY5MDQyNV5BMl5BanBnXkFtZTcwMTIyMzcxNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1993","placeOfBirth":" Los Angeles, California, USA","birthName":"Halston Jean Schrage","height":"5' 5½\" (1.66 m)","bio":"A charming and striking actress, Halston Sage continues to gain fame, working alongside notable actors and filmmakers. She was most recently seen in the film Before I Fall (2017), based on the 2010 novel of the same name by Lauren Oliver. Later in 2017, Sage will appear on television in Seth MacFarlane's dramedy for Fox, Orville (2017). She was born Halston Jean Schrage in Los Angeles, California, to Lenny and Tema Schrage, and has two younger siblings, Max and Kate. In addition to her acting credits, Sage rode horses for eight years and is an award-winning equestrian. She possesses a great love for writing and was the editor of her school newspaper. Sage broke into modeling at the age of fourteen, when she realized she had a passion for acting. She guest-starred on Nickelodeon's Victorious (2010) and Bucket & Skinner's Epic Adventures, and starred as Brianna in the Jon Kasdan-directed teen drama film, The First Time (2012), opposite Britt Robertson, which premiered at the 2012 Sundance Film Festival. Sage also starred as Grace King, as one of the \"Perfs\", alongside Samantha Boscarino, on the Nickelodeon show, How to Rock (2012). In 2013, the actress joined Adam Sandler and an all-star cast in the ensemble hit, Grown Ups 2 (2013) for Sony Pictures. She also starred in Greg Francis' indie, Poker Night (2013), alongside Ron Perlman and Titus Welliver, and was seen alongside Emma Watson in Oscar®-winning director Sofia Coppola's biography drama, The Bling Ring (2013), and as Amber in Rand Ravich's NBC series, Crisis (2014), opposite Gillian Anderson and Dermot Mulroney. In 2014, she had a role in the film Neighbours (2014), with Zac Efron. Sage was a nominee for the MTV Movie Award \"Best Kiss\", for her onscreen kiss with Rose Byrne in the film. In 2015, Sage played Lacey Pemberton in the film Paper Towns (2015), alongside Nat Wolff and Cara Delevingne, based on the 2008 novel of the same name by John Green. Later that year, she co-starred in Sony Pictures' Goosebumps (2015), opposite Jack Black, Dylan Minnette, and Odeya Rush. Based on the popular children's book series of the same name by writer R.L. Stine, the film tells the story of a teenage boy who moves from New York City to the small town of Greendale, Maryland, only to discover his next door neighbor is the famed, but strange, bestselling author. Directed by Rob Letterman with a screenplay from Darren Lemke and Mike White, Also in 2015, she had a role in Paramount's Scouts Guide to the Zombie Apocalypse (2015), which centers on a group of boy scouts who rise to the occasion as their small town is faced with a zombie outbreak. Sage's co-stars include Tye Sheridan and Patrick Schwarzenegger. She is repped by CAA and Untitled.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMDY5MDQyNV5BMl5BanBnXkFtZTcwMTIyMzcxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4296013","name":"Halston Sage","idIMDB":"nm4296013"},"actorId":"nm4296013","character":"Amy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lochlyn Munro","urlProfile":"http://www.imdb.com/name/nm0613147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTY0NjAxMV5BMl5BanBnXkFtZTcwNTI2MzM1OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1966","placeOfBirth":" Lac La Hache, British Columbia, Canada","birthName":"Richard Laughlain Munro","height":"5' 11\" (1.8 m)","bio":"Lochlyn Munro started his acting career after a serious sports injury ended his dream of playing professional hockey. A talented musician, Lochlyn turned his attention to the performing arts. While playing music in various clubs around Vancouver, British Columbia, Lochlyn studied drama and improvisational comedy with many of the industry's top professionals, including the late Susan Strasberg. Having done a lot of stage work, Lochlyn then jumped into the television and film world with instant success. Lochlyn landed roles on various American projects such as, 21 Jump Street (1987), Wiseguy (1987), and others. After numerous guest roles and leads on TV shows and Films, Lochlyn landed a role in Clint Eastwood's Unforgiven (1992). He has gone on to show tremendous range throughout his acting career by creating memorable characters in such films as Dead Man on Campus (1998), A Night at the Roxbury (1998), and Scary Movie (2000). Lochlyn will always remain one to watch in Hollywood as his career continues to follow a bright path.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTY0NjAxMV5BMl5BanBnXkFtZTcwNTI2MzM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0613147","name":"Lochlyn Munro","idIMDB":"nm0613147"},"actorId":"nm0613147","character":"Nate Munson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kieran Large","urlProfile":"http://www.imdb.com/name/nm5214957","urlPhoto":"","biography":{"height":"5' 11\" (1.8 m)","bio":"Kieran's passion for the performing arts stems further than just his draw to the silver screen. Growing up under the wing of his cousin, writer/producer/actor Corey Large, has helped in his ambitions. After finding his natural talent on stage at his local Victoria school, his older cousin took note. Kieran garnered roles in each of Corey's two consecutive films, Kid Cannabis and Poker Night (2012), both shot in Victoria BC.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5214957","name":"Kieran Large","idIMDB":"nm5214957"},"actorId":"nm5214957","character":"Shawn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Wray","urlProfile":"http://www.imdb.com/name/nm0942036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzYzMjUwM15BMl5BanBnXkFtZTgwNDA1MjQzMDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Dean Wray is an actor and writer, known for Down Here (2014), Horns (2013) and The Confirmation (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzYzMjUwM15BMl5BanBnXkFtZTgwNDA1MjQzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942036","name":"Dean Wray","idIMDB":"nm0942036"},"actorId":"nm0942036","character":"The Mentor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mitchell Baker","urlProfile":"http://www.imdb.com/name/nm1438289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY5Mjg1Nzg4NV5BMl5BanBnXkFtZTYwMTI4ODky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mitchell Baker is known for his work on In the Land of Women (2007), Poker Night (2014) and Kid Cannabis (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY5Mjg1Nzg4NV5BMl5BanBnXkFtZTYwMTI4ODky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1438289","name":"Mitchell Baker","idIMDB":"nm1438289"},"actorId":"nm1438289","character":"Bob Fisher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aaron Rattner","urlProfile":"http://www.imdb.com/name/nm0711909","urlPhoto":"","biography":{"bio":"Aaron Rattner is a producer and production manager, known for Femme Fatales (2011), Poker Night (2014) and Loaded (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0711909","name":"Aaron Rattner","idIMDB":"nm0711909"},"actorId":"nm0711909","character":"Mr. Rabbitt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chad Krowchuk","urlProfile":"http://www.imdb.com/name/nm0472377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk1ODk3MF5BMl5BanBnXkFtZTgwNzg0NjEwNDE@._V1_UY44_CR28,0,32,44_AL_.jpg","biography":{"birthName":"Chad Alan Krowchuk","bio":"Chad Krowchuk was born as Chad Alan Krowchuk. He is an actor and production designer, known for Man of Steel (2013), Batman v Superman: Dawn of Justice (2016) and She's the Man (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk1ODk3MF5BMl5BanBnXkFtZTgwNzg0NjEwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0472377","name":"Chad Krowchuk","idIMDB":"nm0472377"},"actorId":"nm0472377","character":"Mr. Bootles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grizz Salzl","urlProfile":"http://www.imdb.com/name/nm0759562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTQzNjg1OF5BMl5BanBnXkFtZTcwMjUyMTk5NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Grizz is a man of many talents. Born Alan Salzl in Edmonton, Alberta, Canada, the youngest of six children, Grizz spent his formative years on a farm near Athabasca, Alberta, Canada. His career in film began with acting on feature films, television, in commercials, industrials, and in theatre. Coming from a small market it is common place to diversify and soon Grizz found himself working as a Grip, Electric, Stage Hand, Camera Assistant, Focus Puller, Camera Operator and most recently Steadicam Operator, all the while continuing to hone his craft as an actor. Grizz has performed extensively on stage in character roles and as an improviser and has played in a number of bands primarily as a bass player and singer. Grizz has also been blessed by working with some of the most talented Actors, Directors, and Cinematographers in the business. Grizz lives in Port Coquitlam, British Columbia, Canada with his wife Brooke Jewell, and has three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTQzNjg1OF5BMl5BanBnXkFtZTcwMjUyMTk5NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0759562","name":"Grizz Salzl","idIMDB":"nm0759562"},"actorId":"nm0759562","character":"Shawn's Father","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2548208","urlIMDB":"http://www.imdb.com/title/tt2548208","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 44 min (104 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.3","metascore":"35","filmingLocations":[{"location":"Victoria, British Columbia, Canada"}],"awards":[],"votes":"6,448","type":"Movie","companyCreditsSimple":[{"idCompany":"co0109209","name":"Wingman Productions"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:24:06"}}