{"data":{"movies":[{"title":"Thomas & Friends: The Best of Thomas","originalTitle":"","year":"2010","releaseDate":"20100925","directors":[{"name":"Steve Asquith","id":"nm0039722"},{"name":"David Mitton","id":"nm0594186"}],"writers":[{"name":"Wilbert Awdry","id":"nm0043423"},{"name":"Britt Allcroft","id":"nm0020150"}],"runtime":"150 min","countries":["UK"],"languages":["English"],"genres":["Family"],"plot":"It was 65 years ago when the Reverend W. Awdry told his young son, Christopher, a story about a cheeky, fussy, little, blue engine called Thomas the Tank Engine. Since then Thomas and Friends has captured the hearts and imaginations of children and parents around the world. Part of that phenomenon has been the episodes that children have adored since the launch of the TV series in 1984. To celebrate 65 years of Thomas and Friends we have put together the very best 20 episodes, from the classic live action to the all new animation. Watch Thomas and his friends in their most thrilling adventures featuring legendary storytellers Ringo Starr and Michael Angelis. It's full steam ahead to the Best of Thomas! Featuring the episodes: Thomas and Gordon, Edward and Gordon, Ghost Train, Thomas, Percy and the Dragon, Trust Thomas, Henry and the Elephant, Cranky Bugs, James and the Red Balloon, Percy's Chocolate Crunch, Gordon and Spencer, Thomas to the Rescue, Thomas and the Birthday Picnic, ...","simplePlot":"It was 65 years ago when the Reverend W. Awdry told his young son, Christopher, a story about a cheeky, fussy, little, blue engine called Thomas the Tank Engine. Since then Thomas and ... ","actors":[{"actorName":"Ringo Starr","urlProfile":"http://www.imdb.com/name/nm0823592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Mjc1NzkwM15BMl5BanBnXkFtZTYwMTU4MzI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1940","placeOfBirth":" Liverpool, Merseyside, England, UK","birthName":"Richard Starkey","height":"5' 6\" (1.68 m)","bio":"Ringo Starr is a British musician, actor, director, writer, and artist best known as the drummer of The Beatles who also coined the title 'A Hard day's Night' for The Beatles' first movie. He was born Richard Starkey on July 7, 1940, in a small two-storey house in the working class area of Liverpool, Merseyside, England. His father, Richard Starkey, was a former dockworker turned baker; his mother, Elsie (Gleave) Starkey, was a bakery worker. His parents divorced when he was three and he and his mother, Elsie, moved to another home in Liverpool. While attending Silas Infants' Schools he suffered from many afflictions that basically ruined his education: he had constant abdominal pains, was once diagnosed with a ruptured appendix that led to an inflamed peritoneum, which also led to one of his first surgeries. Ringo was in a coma, and his recovery took a couple of months, during which more operations were performed, and he was known to be accident-prone. Shortly after he came out of the coma, he was trying to offer a toy bus to another boy in an adjoining bed, but fell and suffered from a concussion. When he finally was able to go back to school, he learned that he was far behind in his studies. At age 13 he caught a cold that turned into chronic pleurisy, causing him another stay at a hospital in Liverpool. A few lung complications followed, which resulted in a treatment in yet another children's hospital, this time until 1955. Meanwhile, Richard's mother Elsie had married Harry Graves, the man who her son referred to as a \"step-ladder\". At the age of 15 he could barely read or write, although he had aptitude for practical subjects such as woodwork and mechanics. At that time he dropped out of school and got his first job was as a delivery boy for British Rail. His second job was a barman on a ferry to New Brighton, and his next was as a trainee joiner at Henry Hunt & Sons. Ringo injured his finger on the first day of his new job, and then he decided to become a drummer. His dream came true, when his stepfather bought him a new drum kit, and Richard promised to be the best drummer ever. In 1957, together with Eddie Miles, he started his own band called 'Eddie Clayton Skiffle Group'. At that time he became known as Ritchie, and eventually became caught in the Liverpool's Skiffle craze. Although he was self-taught, he was a good time-keeper, and developed an original beat with his signature accentuations, due to his left-handed manner of playing on the right-handed drum set. He traveled from band to band, but he eventually landed a spot with \"Raving Texans\", which was a backing band for Rory Storm, later known as \"Rory Storm & The Hurricanes\", a popular band at that time Liverpool. Rory Storm encouraged Richard to enhance his career by legally changing his name to Ringo Starr. The Hurricanes topped the bill at one of Liverpool's clubs, where The Beatles also had a gig. Ringo's group was at times sharing popularity with The Beatles and Gerry and the Pacemakers. He wanted to leave The Hurricanes to join another group called \"The Seniors.\" Before Ringo, The Beatles tried several other drummers. At one point they were so desperate, that they even invited strangers from the audience to fill the position. Then came Pete Best who was not considered by the other band members to be the greatest drummer, and they were keen to recruit Ringo as his replacement. On June 6, 1962, at the Abbey Road studios, The Beatles passed Martin's audition with the exception of Pete Best. George Martin liked them, but recommended the change of a drummer. Being asked by John Lennon, Paul McCartney, and George Harrison; Epstein fired Pete Best. After a mutual decision the band was completed with Ringo Starr. Ringo contributed to their first hit in September of 1962, when The Beatles recorded Love Me Do, which charted in UK, and reached the top of the US singles chart. Ringo's steady and reliable drumming became essential in their studio sessions, as well as in their numerous and exhausting live performances across the world. Ringo's positive disposition as well as his drumming style played the pivotal role in shaping the famous image and music style of The Beatles as they are now known to the world, under the management of Brian Epstein and music producer George Martin. Ringo filled the position of a drummer for The Beatles in the most critical time of the band's formation. He quickly connected with the other three members of The Beatles, and contributed to their music and creativity with his easy-going personality, light humour, reliable drumming and inventive musicianship. All four members were charismatic and individually talented artists, they sparked each other from the beginning. Eventually they made a much better group effort under the thorough management by Brian Epstein whose coaching helped consolidate their talents and mutual stimulation into beautiful teamwork. Starr had dreamed of becoming a professional actor since his younger years. He wanted to be in movies probably more so than the other members of The Beatles. In 1964, during the first months of Beatlemania, Ringo coined the phrase 'A Hard Day's Night' which soon became the official title of the Beatles' first movie, in replacement for the working title 'Beatlemania'. Ringo received great reviews for his performance in A Hard Day's Night (1964) and Help! (1965). At first, Ringo did not have a songwriting career, although he had no problem with his name recognition, however, he had a problem with getting his songs noticed. At that time he got help from his friends; John and Paul wrote a song or two for him to sing on their albums, such as \"Boys\", \"I Wanna Be Your Man\", \"Honey Don't\", and \"Yellow Submarine\". During his eight-year career with The Beatles, Ringo wrote two original songs: \"Don't Pass Me By\" and \"Octopus' Garden\" for which he also sang the lead vocals. Besides his drumming, Ringo's voice was recorded on many of the most popular Beatle's songs, contributing to their unique sound and tight harmonies. He had a hectic solo career during the 1970s, after the breakup of The Beatles. However, Ringo eventually emerged as a steady performer, and sustained a very popular solo career, turning out a dozen chart-topping hit songs and eight best-selling albums. He made a famous appearance together with George Harrison, Ravi Shankar, and other popular musicians in the landmark 'Concert for Bangladesh' in 1971. His 1973 solo release \"Ringo\" was the last album to feature all four living Beatles, although not on the same song. He also appeared in various TV shows, including his own special, Ringo (1978), and a TV mini-series, Princess Daisy (1983), with his wife Barbara. In 1984 he did narration for the children's series Thomas & Friends (1984). During the 1980s, after having a long period of troubles with alcohol, Ringo and his wife attended a rehabilitation clinic, and came back to the scene sober. He made the All-Starr Band tour of America and Japan. The tour was so popular that he formed another All-Starr Band lineup in 1992, and began an American and European tour in June of that year. Since then Ringo Starr has been enjoying a continuous career as the leader of the All-Starr Band. In 1994, along with George Harrison and Paul McCartney, the three surviving members of The Beatles, reunited and produced Lennon's previously unknown song 'Free as a Bird'. It was preserved by 'Yoko Ono' on a tape recording made by John Lennon in 1977. The song was re-arranged and re-mixed with the voices of three surviving members, and became an international hit. 'Free as a Bird' was also included in The Beatles Anthology TV documentary which was watched by 420 million people in 1995. Ringo, Paul and George sang their new songs, in addition to mixing their voices and music arrangements to John Lennon demos. Ringo's old friend and band-mate George Harrison passed away on November 29, 2001, after a long battle against lung cancer. The following year, on the anniversary of Harrison's death, Ringo Starr, Paul McCartney and Eric Clapton appeared in a Concert For George, to raise money for the support of Harrison's legacy in exploration of alternative lifestyles, views and philosophies. Starr also supported charitable organizations with consideration to those who have special needs. Ringo Starr updated the role of a drummer in popular music, he made drummer an equal partner to the lead musicians, thus changing the whole paradigm in how the public saw drummers. His original performing style evolved from adjusting his natural left-handed manner of playing to the right-handed drum set, and allowing his left hand lead in weaving a pattern tightly intertwined with the music of other players, and adding such enhancements as unusual accents and stops. Ringo's musical originality as well as his inventive drumming patterns, time signatures and accentuations became essential to the sound of The Beatles. His on-stage presence and acting talent as well as his humor and musicianship was the essential part in formation and remarkable career of The Beatles. He was married to his long-time girlfriend, Maureen Cox, from 1965 - 1975, and they had three children: Zak Starkey, Jason, and Lee. The couple broke up in July of 1975, and he married actress Barbara Bach. Ringo Starr divides his time between his residences in England, in Switzerland and his home in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Mjc1NzkwM15BMl5BanBnXkFtZTYwMTU4MzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823592","name":"Ringo Starr","nicknames":["Ritchie"],"idIMDB":"nm0823592"},"actorId":"nm0823592","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Angelis","urlProfile":"http://www.imdb.com/name/nm0029617","urlPhoto":"","biography":{"dateOfBirth":"18 January 1952","placeOfBirth":" Liverpool, Merseyside, England, UK","height":"5' 8\" (1.73 m)","bio":"Michael Angelis was born on January 18, 1952 in Liverpool, Merseyside, England. He is an actor, known for Thomas & Friends (1984), No Surrender (1985) and The Liver Birds (1969). He is married to Jennifer Khalastchi. He was previously married to Helen Worth.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0029617","name":"Michael Angelis","idIMDB":"nm0029617"},"actorId":"nm0029617","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Small","urlProfile":"http://www.imdb.com/name/nm1107107","urlPhoto":"","biography":{"bio":"Ben Small is known for his work on Corneil and Bernie (2003), Thomas & Friends (1984) and Zorro and Scarlet Whip Revealed! (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1107107","name":"Ben Small","idIMDB":"nm1107107"},"actorId":"nm1107107","character":"Thomas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith Wickham","urlProfile":"http://www.imdb.com/name/nm1080077","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTk0NzYzMF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Keith Wickham is known for his work on Corneil and Bernie (2003), The Secret Show (2006) and Thomas & Friends (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTk0NzYzMF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1080077","name":"Keith Wickham","idIMDB":"nm1080077"},"actorId":"nm1080077","character":"Henry / James / Percy / The Fat Controller","urlCharacter":"http://www.imdb.com/character/ch0438116","main":true},{"actorName":"Matt Wilkinson","urlProfile":"http://www.imdb.com/name/nm0929451","urlPhoto":"","biography":{"bio":"Matt Wilkinson is known for his work on V for Vendetta (2005), About a Boy (2002) and Thomas & Friends (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0929451","name":"Matt Wilkinson","idIMDB":"nm0929451"},"actorId":"nm0929451","character":"Spencer / Victor / Kevin","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2630638","urlIMDB":"http://www.imdb.com/title/tt2630638","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 30 min (150 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[],"awards":[],"type":"Video","companyCreditsSimple":[{"idCompany":"co0103566","name":"Britt Allcroft (Thomas) Ltd."},{"idCompany":"co0215861","name":"Gullane"},{"idCompany":"co0029268","name":"HIT Entertainment"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:15:51"}}