{"data":{"movies":[{"title":"Above and Beyond","originalTitle":"","year":"2014","releaseDate":"20150130","directors":[{"name":"Roberta Grossman","id":"nm0343706"}],"writers":[{"name":"Sophie Sartain","id":"nm2510874"},{"name":"Sophie Sartain","id":"nm6343054"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMDcxNDg3Ml5BMl5BanBnXkFtZTgwNDA0NTM1MTE@._V1.jpg","countries":["UK","Israel","USA"],"languages":["English"],"genres":["Documentary","Adventure","History","War"],"plot":"In 1948, a group of World War II pilots volunteered to fight for Israel in the War of Independence. As members of 'Machal' -- volunteers from abroad -- this ragtag band of brothers not only turned the tide of the war, preventing the possible annihilation of Israel at the very moment of its birth; they also laid the groundwork for the Israeli Air Force. ABOVE AND BEYOND is their story. The first major feature-length documentary about the foreign airmen in the War of Independence, ABOVE AND BEYOND brings together new interviews with pilots from the '48 War, as well as leading scholars and statesmen, including Shimon Peres, to present an extraordinary, little-known tale with reverberations up to the present day.","simplePlot":"In 1948, a group of World War II pilots volunteered to fight for Israel in the War of Independence. As members of 'Machal' -- volunteers from abroad -- this ragtag band of brothers not only... ","actors":[{"actorName":"Mina Alon","urlProfile":"http://www.imdb.com/name/nm7984282","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Mina Alon yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7984282","name":"Mina Alon","idIMDB":"nm7984282"},"actorId":"nm7984282","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard J. Carson","urlProfile":"http://www.imdb.com/name/nm4292050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MzAzMDQ1NF5BMl5BanBnXkFtZTcwNDUyMzA0NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Richard J. Carson is an actor, known for Above and Beyond (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MzAzMDQ1NF5BMl5BanBnXkFtZTcwNDUyMzA0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4292050","name":"Richard J. Carson","idIMDB":"nm4292050"},"actorId":"nm4292050","character":"Extra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Cohen","urlProfile":"http://www.imdb.com/name/nm7984241","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Eddie Cohen yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7984241","name":"Eddie Cohen","idIMDB":"nm7984241"},"actorId":"nm7984241","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leon Frankel","urlProfile":"http://www.imdb.com/name/nm7984242","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Leon Frankel yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7984242","name":"Leon Frankel","idIMDB":"nm7984242"},"actorId":"nm7984242","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Coleman Goldstein","urlProfile":"http://www.imdb.com/name/nm7984243","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Coleman Goldstein yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7984243","name":"Coleman Goldstein","idIMDB":"nm7984243"},"actorId":"nm7984243","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lou Lenart","urlProfile":"http://www.imdb.com/name/nm0501706","urlPhoto":"","biography":{"dateOfBirth":"24 April 1921","placeOfBirth":" Hungary","birthName":"Layos Lenovitz","bio":"Louis \"Lou\" Lenart has been the IDF coordinator for several motion pictures, including the first two Iron Eagle films; the first of which he was also the associate producer. But Lou Lenart is perhaps best known as the Check Yeager of the Israeli Air Force. After serving as a Corsair pilot in the Pacific during WWII, Major Lenart left the Marine Corps. and, in 1948, became one of the founders of the IAF, one of the world's most respected and successful air forces. Lenart, and other pilots, went to Czechoslovakia to learn to fly the Avia S-199 Mezec (Mule), a Czech-built version of the WWII Messerschmitt ME-109. On 14 May 1948, Israel declared independence and was immediately besieged by neighboring nations. The Mules were quickly taken apart, airlifted to Israel, and then reassembled. On 29 May, Lenart, and three other pilots, each with less than two hours in the fighter, launched at dusk to attack an Egyptian force of 10,000 troops supported by tanks and artillery at Ashdod, only 16 miles south of Tel Aviv. The Israeli's untested aircraft, armed only with 20-millimeter cannons and 70 kilogram bombs, made history when the Egyptians, confused by the \"secret air force,\" halted their offensive, dug in, and later retreated. One Mezec was lost in the attack and another was damaged beyond repair. Although Lenart flew other missions, he used his WWII experience and served on the southern front as an \"air controller.\" After the war, he participated in an operation to rescue Iraqi Jews and bring them to Israel. A man of many talents, he flew for EL AL, Israel's national airline, conducted aerial mapping missions over the jungles of Central America, and was a producer the major motion picture, Iron Eagle. Lenart was General Manager of the San Diego Clippers of the National Basketball Association in the early 1980s. He later returned to live in Israel. At the time this mini-biography was written he is active as a lecturer.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0501706","name":"Lou Lenart","idIMDB":"nm0501706"},"actorId":"nm0501706","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Lichter","urlProfile":"http://www.imdb.com/name/nm3799763","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for George Lichter yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3799763","name":"George Lichter","idIMDB":"nm3799763"},"actorId":"nm3799763","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gideon Lichtman","urlProfile":"http://www.imdb.com/name/nm7984244","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Gideon Lichtman yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7984244","name":"Gideon Lichtman","idIMDB":"nm7984244"},"actorId":"nm7984244","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Livingston","urlProfile":"http://www.imdb.com/name/nm0515245","urlPhoto":"","biography":{"dateOfBirth":"4 September 1924","placeOfBirth":" Haverhill, Massachusetts, USA","birthName":"Harold Antill Livingston","bio":"Harold Livingston was born on September 4, 1924 in Haverhill, Massachusetts, USA as Harold Antill Livingston. He is known for his work on Star Trek: The Motion Picture (1979), The Hell with Heroes (1968) and Mission: Impossible (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0515245","name":"Harold Livingston","idIMDB":"nm0515245"},"actorId":"nm0515245","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shimon Peres","urlProfile":"http://www.imdb.com/name/nm0673364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTIzNjU5NF5BMl5BanBnXkFtZTgwODA3ODU1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1923","placeOfBirth":" Wiszniewo, Poland [now Vishnyeva, Belarus]","birthName":"Szymon Persky","bio":"Shimon Peres was born on August 2, 1923 in Wiszniewo, Poland as Szymon Persky. He was an actor, known for Blessed Is the Match: The Life and Death of Hannah Senesh (2008), In Search of Peace (2001) and Yitzhak Rabin: Warrior - Peacemaker (1998). He was married to Sonya Gelman. He died on September 28, 2016 in Ramat Gan, Israel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTIzNjU5NF5BMl5BanBnXkFtZTgwODA3ODU1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0673364","name":"Shimon Peres","idIMDB":"nm0673364"},"actorId":"nm0673364","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Reubens","urlProfile":"http://www.imdb.com/name/nm0000607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjYyNjk4Nl5BMl5BanBnXkFtZTcwNzA4NDYwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1952","placeOfBirth":" Peekskill, New York, USA","birthName":"Paul Rubenfeld","height":"5' 10\" (1.78 m)","bio":"Paul Reubens was born Paul Rubenfeld on August 27, 1952 in Peekskill, New York, to Judy (Rosen), a teacher, and Milton Rubenfeld, a car salesman who had flown for the air forces of the U.S., U.K., and Israel, becoming one of the latter country's pioneering pilots. Paul grew up in Sarasota, Florida, where his parents owned a lamp store. During winters, The Ringling Brothers and Barnum and Bailey Circus called Sarasota home, and young Paul counted such big-top families as the Wallendas and the Zacchinis among his neighbors. When he was 11-years-old, he joined the local Asolo Theater, and during the next six years, he appeared in a variety of plays. After graduating from Sarasota High School in 1970, he attended Boston University for one year before deciding to seek his fortune as Paul Reubens in Hollywood, where he enrolled as an acting major at the California Institute of the Arts and accepted a string of pay-the-rent jobs ranging from pizza chef to Fuller Brush salesman. In the mid 1970s, his acting career grew slowly and steadily with small roles in theater productions, gigs at local comedy clubs and four guest appearances on The Gong Show (1976). During this time of education/employment, he joined an improvisational comedy troupe called The Groundlings. The popular gang of yuksters, whose roster has included Conan O'Brien, Lisa Kudrow, the late Phil Hartman, Jon Lovitz, and Julia Sweeney, wrung laughs from audiences with skits starring scads of imaginative, self-created characters. Among Reubens's contributions to this comedic community were a philandering husband named Moses Feldman, an Indian chief named Jay Longtoe, and the now fallen Pee-Wee Herman, who debuted in 1978. Pee-Wee was a funny man-child of indeterminate age and sexuality who created a sarcastic enthusiasm for the popular culture of the '50s and '60s. The geeky character's wardrobe consisted of a gray suit, a white short-sleeved shirt accessorized with a red clip-on bow tie, and white patent-leather loafers. He wore his jet-black hair military short with a defiant tuft in front, and he accentuated his lily-white complexion with pink cheeks and red lipstick. Reubens drew inspiration for Pee-Wee's geeky behavior from a youth he had attended summer camp with, and derived his creation's boyish voice from a character he played as a child actor. Pee-Wee appeared for only 10 minutes of The Groundlings show, but he nonetheless built up a considerable following and turned out to be a star of the '80s and early '90s. The Pee Wee Herman Show (1981), ran for five sellout months at the Los Angeles's Roxy nightclub, and HBO taped the performance and aired it as a special. Now a genuine comedy-circuit star, he became a frequent guest of David Letterman and a favorite at Caroline's in New York. In 1984, he sold out Carnegie Hall. He later auditioned for the cast of Saturday Night Live (1975), but when that didn't turn out as planned, he started writing a feature-length screenplay for Pee-Wee to star in, and asked friend Tim Burton to direct. Released to wildly divergent reviews, Pee-wee's Big Adventure (1985), followed its star cross-country in a madcap search for his beloved, stolen bike. The $7 million picture ended up grossing $45 million. That following year, CBS which had been losing children's audiences to cable programming, was interested in finding something to shore up its Saturday Morning lineup. The network company signed him to act/produce and to direct its live-action children's program called Pee-wee's Playhouse (1986). They doled out an eye-popping budget of $325,000 per episode - the same price as a prime- time sitcom. Reubens received complete creative control, albeit with three minor exceptions. During its five-year-run on CBS, he never appeared in general as himself. He even granted printed interviews in full Pee-Wee regalia. The image of Pee-Wee was broken on July 26, 1991. On his summer vacation, Reubens was visiting his parents in Sarasota and sought escape from boredom by catching a showing of the X-rated film, Nurse Nancy. He fell victim to a police sting operation and was arrested for sex charges when detectives allegedly saw him playing with his private parts. He was released on $219 bail and nobody realized what had happened until somebody recognized him beneath his long hair and goatee. The media went berserk: 'Kids show star arrested for indecent exposure'. Because of his behavior, CBS dropped the Playhouse and related merchandise was released from its shelves. He agreed to pay a $50 fine plus $85 in court costs to Sarasota County, and he produced a 30 second public service message for the Partnership For Drug-Free America commercial. As part of the deal, the county sealed all legal papers relating to the actor's arrest and didn't leave Reubens with a criminal record. The scandal marked the virtual death of Pee-Wee Herman. Reubens appeared as his favorite character for the last time at that Autumn's MTV Music Video Awards. The enthusiastic reception was not surprising, as he had received 15 thousand supportive letters during his arrest. Regardless, he had recently made a promise not to play Pee-Wee anymore and used his arrest as an chance to portray other roles. A new feature length film by Netflix available beginning March 18, 2016 will allow Reubens to show Pee-Wee fans his character again in Pee-wee's Big Holiday (2016). Reubens has landed a series of offbeat character roles. One year after he was taken into custody, he appeared in Burton's Batman Returns (1992) as the Penguin's unloving father, and as a vampire henchman in Buffy the Vampire Slayer (1992). Subsequent jobs have included a voice over for Tim Burton's The Nightmare Before Christmas (1993), a healthy stint as Andrew J. Lansing III on Murphy Brown (1988), and roles in the feature films, Dunston Checks In (1996), Matilda (1996), Buddy (1997) and Mystery Men (1999). He also signed to emcee a new game show based on the popular 'You Don't Know Jack' CD-ROM version.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjYyNjk4Nl5BMl5BanBnXkFtZTcwNzA4NDYwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000607","name":"Paul Reubens","nicknames":["Pee-Wee Herman"],"idIMDB":"nm0000607"},"actorId":"nm0000607","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jd Roth-round","urlProfile":"http://www.imdb.com/name/nm6160211","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODQzODY2N15BMl5BanBnXkFtZTgwODY0MzU5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 0½\" (1.84 m)","bio":"Born in north wales 1978, JD grew up in Manchester, his father a builder and his mother an artist. His grandfather Felix Roth, a member of the Magic Circle, an officer in the British army and a dentist, became a great inspiration to him along with his great aunt, Dorothy Round Little, the 1930's tennis ace and Wimbledon Champion. He worked as a builder and a stage hand in the theatres for more than 10 years where his taste for acting grew as he attended private acting tuition. Unhappy with his career choices, JD decided to follow his passion, pursuing an acting career in London and soon becoming a special action sword fighter on such films as 'Snow White and The Huntsman'. A serious actor, JD follows the creative path of an artist, writing scripts and practicing his techniques, such as Strasberg and Chubbuck, with a career goal to one day play a main 'BOND' bad guy. Recently he starred as the lead in a TV pilot '2024' and directed a few interesting short films. His unusual first name is a 'nod' to the 1950's screen legend James Dean.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODQzODY2N15BMl5BanBnXkFtZTgwODY0MzU5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6160211","name":"Jd Roth-round","nicknames":["Stage Rage"],"idIMDB":"nm6160211"},"actorId":"nm6160211","character":"Machal fighter pilot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Schwimmer","urlProfile":"http://www.imdb.com/name/nm3473970","urlPhoto":"","biography":{"dateOfBirth":"10 June 1917","placeOfBirth":" New York City, New York, USA","bio":"Al Schwimmer was born on June 10, 1917 in New York City, New York, USA. He died on June 10, 2011 in Tel Aviv, Israel.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3473970","name":"Al Schwimmer","idIMDB":"nm3473970"},"actorId":"nm3473970","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dani Shapira","urlProfile":"http://www.imdb.com/name/nm7468423","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Dani Shapira yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7468423","name":"Dani Shapira","idIMDB":"nm7468423"},"actorId":"nm7468423","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Smoky Simon","urlProfile":"http://www.imdb.com/name/nm6011388","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Smoky Simon yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6011388","name":"Smoky Simon","idIMDB":"nm6011388"},"actorId":"nm6011388","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2704752","urlIMDB":"http://www.imdb.com/title/tt2704752","business":{"budget":{"money":"$1,300,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$287,697","country":"USA","day":"03","month":"05","year":"2015","remarks":""},{"money":"$283,928","country":"USA","day":"26","month":"04","year":"2015","remarks":""},{"money":"$269,045","country":"USA","day":"12","month":"04","year":"2015","remarks":""},{"money":"$256,878","country":"USA","day":"05","month":"04","year":"2015","remarks":""},{"money":"$242,730","country":"USA","day":"29","month":"03","year":"2015","remarks":""},{"money":"$218,378","country":"USA","day":"22","month":"03","year":"2015","remarks":""},{"money":"$196,195","country":"USA","day":"15","month":"03","year":"2015","remarks":""},{"money":"$174,077","country":"USA","day":"08","month":"03","year":"2015","remarks":""},{"money":"$146,695","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$96,220","country":"USA","day":"22","month":"02","year":"2015","remarks":""}],"weekendGross":[{"money":"$1,104","country":"USA","day":"03","month":"05","year":"2015","remarks":"2 Screens"},{"money":"$3,830","country":"USA","day":"26","month":"04","year":"2015","remarks":"5 Screens"},{"money":"$6,963","country":"USA","day":"12","month":"04","year":"2015","remarks":"4 Screens"},{"money":"$7,460","country":"USA","day":"05","month":"04","year":"2015","remarks":"4 Screens"},{"money":"$15,357","country":"USA","day":"29","month":"03","year":"2015","remarks":"8 Screens"},{"money":"$12,331","country":"USA","day":"22","month":"03","year":"2015","remarks":"9 Screens"},{"money":"$14,282","country":"USA","day":"15","month":"03","year":"2015","remarks":"7 Screens"},{"money":"$15,095","country":"USA","day":"08","month":"03","year":"2015","remarks":"8 Screens"},{"money":"$19,762","country":"USA","day":"01","month":"03","year":"2015","remarks":"12 Screens"},{"money":"$26,111","country":"USA","day":"22","month":"02","year":"2015","remarks":"12 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":"08","month":"09","year":"2014","remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color","Black and White"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.8","metascore":"69","filmingLocations":[],"awards":[{"award":"Atlanta Jewish Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Best Documentary","names":[{"name":"Roberta Grossman","id":"nm0343706","role":"director"}]}]}]}],"votes":"363","type":"Movie","companyCreditsSimple":[{"idCompany":"co0082139","name":"Playmount Productions"}],"keywords":{"keywords":["reenactment"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:31:33"}}