{"data":{"movies":[{"title":"The Day of the Doctor","originalTitle":"","year":"2013","releaseDate":"20131123","directors":[{"name":"Nick Hurran","id":"nm0403541"}],"writers":[{"name":"Steven Moffat","id":"nm0595590"},{"name":"Terry Nation","id":"nm0622334"}],"runtime":"77 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMTkzMDA5OV5BMl5BanBnXkFtZTgwMjUzNDMyMDE@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Adventure","Drama","Family","Mystery","Sci-Fi"],"plot":"In 2013, something terrible is awakening in London's National Gallery; in 1562, a murderous plot is afoot in Elizabethan England; and somewhere in space an ancient battle reaches its devastating conclusion.","simplePlot":"In 2013, something terrible is awakening in London's National Gallery; in 1562, a murderous plot is afoot in Elizabethan England; and somewhere in space an ancient battle reaches its devastating conclusion.","actors":[{"actorName":"Matt Smith","urlProfile":"http://www.imdb.com/name/nm1741002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMDYxODE3MF5BMl5BanBnXkFtZTcwMjQxNjI5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1982","placeOfBirth":" Northampton, Northamptonshire, England, UK","birthName":"Matthew Robert Smith","height":"5' 11½\" (1.82 m)","bio":"Matt Smith is an English actor who shot to fame in the UK aged 26 when he was cast by producer Steven Moffat as the Eleventh Doctor in the BBC's iconic science-fiction adventure series Doctor Who (2005). Matthew Robert Smith was born and raised in Northampton, the son of Lynne (Fidler) and David Smith. He was educated at Northampton School For Boys. He studied Drama and Creative Writing at the University of East Anglia. He got into acting through the National Youth Theatre and performed with the Royal Court and the National Theatre. Smith made his television debut in The Ruby in the Smoke (2006) and won several further roles on television but was largely unknown when he was announced as the surprise choice for the role of the Eleventh Doctor in Doctor Who. He was younger than any other actor to have taken the role (Peter Davison was previously the youngest, aged 29 when he was cast in 1981). Smith starred in 49 episodes of Doctor Who (three short of his predecessor, David Tennant). He left in the momentous 50th anniversary year of the Doctor Who legend in 2013, which included starring in the 50th anniversary special, Doctor Who: The Day of the Doctor (2013) and acting with Tennant, guest star John Hurt and the oldest living and longest-serving actor to play the Doctor, Tom Baker. Since leaving Doctor Who, Smith has launched himself into a film career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMDYxODE3MF5BMl5BanBnXkFtZTcwMjQxNjI5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1741002","name":"Matt Smith","nicknames":["Smithers"],"idIMDB":"nm1741002"},"actorId":"nm1741002","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"David Tennant","urlProfile":"http://www.imdb.com/name/nm0855039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzOTA4NTAzOTReQTJeQWpwZ15BbWU4MDg1ODc4NzEx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1971","placeOfBirth":" Bathgate, West Lothian, Scotland, UK","birthName":"David John McDonald","height":"6' 1\" (1.85 m)","bio":"David Tennant was born David John McDonald in West Lothian, Scotland, to Essdale Helen (McLeod) and Sandy McDonald, who was a Presbyterian minister. He is of Scottish and Ulster-Scots descent. When he was about 3 or 4 years old, he decided to become an actor, inspired by his love of Doctor Who (1963). He was brought up in Bathgate, West Lothian and Paisley, Renfrewshire, Scotland and was a huge fan of the band The Proclaimers. He attended Paisley Grammar school and while there he wrote about how he wanted to become a professional actor and play the role of the Doctor in Doctor Who (1963). He made his first television appearance (which was also his first professional acting job) when he was 16, after his father sent some photos of him to a casting director at Scottish television. He also attended a youth theatre group at weekends run by the Royal Scottish Academy of Music and Drama (RSAMD - now renamed the Royal Conservatoire of Scotland [RCS]). When he was 16 he auditioned for and won a place at the RSAMD; the youngest student to ever do so, and started as a full time drama student when he was 17. He worked regularly in theatre and TV after leaving drama school, and his first big break came in 1994 when he was cast in a lead role in the Scottish drama Takin' Over the Asylum (1994). He then moved to London where his career thrived. Amongst other things, he spent several years as a member of the Royal Shakespeare Company, and became famous from his lead roles in TV dramas Blackpool (2004) and Casanova (2005). In 2005, his childhood wish came true. David was cast to play the role of the Doctor in Doctor Who (2005) alongside Billie Piper, after Christopher Eccleston decided to leave. Playing the Doctor made him a household name. Since leaving the series in 2010 his career has continued to rise, with lead roles in films, TV series and theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzOTA4NTAzOTReQTJeQWpwZ15BbWU4MDg1ODc4NzEx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0855039","name":"David Tennant","idIMDB":"nm0855039"},"actorId":"nm0855039","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Christopher Eccleston","urlProfile":"http://www.imdb.com/name/nm0001172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTI1NjUxMl5BMl5BanBnXkFtZTYwMTAzNjI3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1964","placeOfBirth":" Salford, Lancashire, England, UK","height":"6' (1.83 m)","bio":"Christopher Eccleston trained at the Central School of Speech and Drama and first came to public attention as Derek Bentley in L'âge de vivre (1991). However, it was a regular role in the television series Cracker (1993) that made him a recognizable figure in the United Kingdom. He appeared in the low-budget thriller Shallow Grave (1994), and in the same year, won the part of Nicky Hutchinson in the epic BBC drama serial Our Friends in the North (1996). It was the transmission of the latter series on BBC Two that really made him into a household name in the United Kingdom. In his film career, he has starred as a leading man alongside a number of major actresses, such as Renée Zellweger in A Price Above Rubies (1998), Cate Blanchett in Elizabeth (1998), and Cameron Diaz and Jordana Brewster in The Invisible Circus (2001), and Nicole Kidman in Les autres (2001). In addition to his successful film career, he has continued to work in his favourite medium, appearing in some of the most challenging and thought-provoking British television dramas of recent years. These have included Clocking Off (2000) and Flesh and Blood (2002) for the BBC and Hillsborough (1996), the Iago character in a modern adaptation of Shakespeare's \"Othello\", and the religious epic The Second Coming (2003), playing Steve Baxter, the son of God. His stage career, while not as extensive as his screen credits, has nevertheless shown him to be a formidable actor. He has given intense, focused performances in such plays as \"Hamlet\", \"Electricity\" and \"Miss Julie\", for which he received excellent reviews. A very highly regarded actor, Eccleston has twice been nominated in the Best Actor category at the BAFTA Television Awards, the British premiere television awards ceremony. His first nomination came in 1997 for \"Our Friends in the North\". Although he didn't win those awards, however, he did triumph in the Best Actor categories at the 1997 Broadcasting Press Guild Awards and the Royal Television Society Awards, winning for \"Our Friends in the North\". He won the RTS Best Actor award for a second time in 2003, this time for his performance in \"Flesh and Blood\". In 2005, he received the Most Popular Actor award in the National Television Awards for Doctor Who.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTI1NjUxMl5BMl5BanBnXkFtZTYwMTAzNjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001172","name":"Christopher Eccleston","nicknames":["Chris"],"idIMDB":"nm0001172"},"actorId":"nm0001172","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"John Hurt","urlProfile":"http://www.imdb.com/name/nm0000457","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTgyMTAyOV5BMl5BanBnXkFtZTcwMTE4MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1940","placeOfBirth":" Chesterfield, Derbyshire, England, UK","birthName":"John Vincent Hurt","height":"5' 9\" (1.75 m)","bio":"This transatlantic talent was born John Vincent Hurt on January 22, 1940 in Shirebrook, a coal mining village near the busy market town of Chesterfield, in Derbyshire, England. He is the son of Phyllis (Massey), an engineer and one-time actress, and Arnould Herbert Hurt, an Anglican clergyman and mathematician. The youngest of three children, he spent much of his childhood in solitude. Demonstrating little initiative, he was guided into art as a possible direction. The family moved to Grimsby when he turned twelve and, despite an active early passion in acting, his parents thought less of it and enrolled him at the Grimsby Art School and St. Martin's School of Art where he showed some flourish. When he couldn't manage to get another scholarship to art school, his focus invariably turned to acting. Accepted into the Royal Academy of Dramatic Art, John made his stage debut in 1962 and remained there in typically offbeat form such plays as \"Infanticide in the House of Fred Ginger\". An odd, somber, pasty-looking fellow with an aquiline nose (injured while playing sports) and a mass of Irish freckles, he was hardly leading man material. His earlier focus as a painter, however, triggered a keen skill in the art of observation and it certainly advanced his talent for getting into the skin of his characters. His movie debut occurred that same year with a supporting role in the ill-received British \"angry young man\" drama Young and Willing (1962). Appearing in various mediums, John increased his profile (and respect) appearing in such theatre plays as \"Inadmissible Evidence\" (1965), \"Little Malcolm and His Struggle Against the Eunuchs\" (1966), a role he later took to film as Little Malcolm and His Struggle Against the Eunuchs (1974), \"Macbeth\" (as Malcolm) (1967) and \"Man and Superman\" (1969), while finding prime parts in such films as A Man for All Seasons (1966), a role he was given after director Fred Zinnemann saw his stellar work in \"Little Malcolm.\" He continued on the stage as an unlikely Romeo in 1973, and went on to garner great applause in Pinter's \"The Caretaker\" and \"The Dumb Waiter\", as well as \"Travesties\" (1974). It was TV, however, that displayed the full magnitude and fearless range of his acting instrument. In the mid-70s he gained widespread acclaim for his embodiment of the tormented gay writer and raconteur Quentin Crisp in the landmark TV play The Naked Civil Servant (1975), adapted from Crisp's autobiography. Way, way ahead of its time, Hurt's bold and unabashed take on the flamboyant and controversial gent who dared to be different was rewarded with the Emmy and the British TV Awards. Far and away one of the most marvelous creations ever captured on the small screen, he was altogether unsettling, unappetizing and unforgettable. Audiences cringed but were mesmerized at the same time -- like a car wreck. He WAS Quentin Crisp. Doors immediately opened for John. He was handed the best parts film and TV had to offer. Once again he was strikingly disturbing as the cruel and crazed Roman emperor Caligula in the epic TV masterpiece I, Claudius (1976). The chameleon in him then displayed a polar side as the gentle, pathetically disfigured title role in The Elephant Man (1980), and when he morphed into the role of a tortured Turkish prison inmate who befriends Brad Davis in the intense drama Midnight Express (1978), he was barely recognizable. The last two films earned Hurt Oscar nominations. Mainstream box-office films were offered as well as art films. He made the most of his role as a crew member whose body becomes host to an unearthly predator in Alien (1979). Who can forget the film's most notorious scene as the creature explodes from Hurt's stomach and scurries away into the bowels of the spaceship? Along with fame, of course, came a few misguided ventures generally unworthy of his talent. Such brilliant work as his steeple chase jockey in Champions (1984) or kidnapper in The Hit (1984) was occasionally offset by such drivel as the comedy misfire Partners (1982) with 'Ryan O'Neal (I)' in which Hurt looked enervated and embarrassed. But those were very few and far between. As for the past couple of decades, the craggy-faced actor continues to draw extraordinary notices. Tops on the list includes his prurient governmental gadfly who triggers the Christine Keeler political sex scandal in the aptly-titled Scandal (1989); the cultivated gay writer aroused and obsessed with struggling \"pretty-boy\" actor Jason Priestley in Love and Death on Long Island (1997); and the Catholic priest embroiled in the Rwanda atrocities in Beyond the Gates (2005). His rich tones have also been tapped into frequently with a number of animated features and documentaries, often serving as narrator. Presently married to his fourth wife, genius is often accompanied by a darker, more self-destructive side and Hurt was no exception with alcohol being his choice of poison. He has since recovered. He has two children from his third wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTgyMTAyOV5BMl5BanBnXkFtZTcwMTE4MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000457","name":"John Hurt","idIMDB":"nm0000457"},"actorId":"nm0000457","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Paul McGann","urlProfile":"http://www.imdb.com/name/nm0001524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NzA2MjAxMF5BMl5BanBnXkFtZTcwNTYzNDg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1959","placeOfBirth":" Kensington, Liverpool, England, UK","height":"5' 8½\" (1.74 m)","bio":"Paul McGann was born on November 14, 1959 in Kensington, Liverpool, England. He is an actor and director, known for Alien 3 (1992), Withnail & I (1987) and Queen of the Damned (2002). He has been married to Annie Milner since 1992. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NzA2MjAxMF5BMl5BanBnXkFtZTcwNTYzNDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001524","name":"Paul McGann","idIMDB":"nm0001524"},"actorId":"nm0001524","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Sylvester McCoy","urlProfile":"http://www.imdb.com/name/nm0566809","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4NDg2NDgxMl5BMl5BanBnXkFtZTcwODAxNzg3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1943","placeOfBirth":" Dunoon, Strathclyde, Scotland, UK","birthName":"Percy James Patrick Kent-Smith","height":"5' 6\" (1.68 m)","bio":"Sylvester McCoy was born in Dunoon, Scotland. He spent much of his childhood in Dublin, Ireland. Before becoming an actor, as Percy Smith he trained as a priest, sold insurance and acted as a bodyguard for the Rolling Stones. He started his acting career as a part of the Ken Campbell Roadshow, at first using the name Kent Smith before changing it first to Sylveste McCoy and then to the more familiar Sylvester. Sylvester McCoy is married with two sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4NDg2NDgxMl5BMl5BanBnXkFtZTcwODAxNzg3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566809","name":"Sylvester McCoy","nicknames":["Sylv"],"idIMDB":"nm0566809"},"actorId":"nm0566809","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Colin Baker","urlProfile":"http://www.imdb.com/name/nm0048346","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgzMjM3MTU2NF5BMl5BanBnXkFtZTcwMTE4MzM2OQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1943","placeOfBirth":" Waterloo, London, England, UK","height":"6' (1.83 m)","bio":"Colin Baker was born in 1943 in the Royal Waterloo Lying-In Hospital in London during an air raid. He spent his earliest years in London with his mother, while his father served in the armed forces. He narrowly avoided an early death during the wartime blitz when a piece of flying shrapnel just missed him, embedding itself in the side of his cot. After the war, Baker's father took a job as managing director of an abestos company in Manchester. The family moved north to live in Rochdale, although Baker attended school in Manchester. It was during his early schooling that - through the mother of one of his fellow pupils, who was a casting director at Granada TV - he had his first experience of acting. It was 1954 and the series was called My Wife's Sister (1956), starring Eleanor Summerfield, Martin Wyldeck and Helen Christie. Colin Baker went on to attend St. Bede's College in Manchester, where he was invited to take part in their annual productions of Gilbert and Sullivan operettas. The twelve-years-old Baker appeared in the chorus for a production of \"Yeoman of the Guard\" and, a year later, landed a more major part - playing the female lead, \"Phyllis\" - in \"Iolanthe\". After completing his schooling, Baker went on to study law. One day during this period, he and his mother went to see an amateur production of \"The King and I\" at the Palace Theatre, Manchester. Inspired by the performance and encouraged by the president of the company that had staged the Amateur Dramatic Society and quickly became hooked on acting. Baker took a job as a solicitor but, as time went on, became less and less interested in this career. Finally, at the age of twenty-three, he decided to become a full-time actor. Baker joined the London Academy of Music and Dramatic Art (LAMDA), where he trained for three years. At the end of this, he was summoned with two of his fellow students to see the head of the drama school, who gave them rather gloomy predictions for their future prospects as actors and suggested that they seek alternative careers. These predictions proved somewhat wide of the mark as not only did Baker go on to great success but so too did his fellow students - David Suchet (who amongst many other achievements starred in LWT's award-winning productions of Agatha Christie's \"Poirot\") and Mel Martin (whose numerous credits include the series Love for Lydia (1977), also for LWT). After leaving LAMDA, Baker took a temporary job driving a taxi in Minehead in order to be near his then-girlfriend. He then received a call to come to London to audition for a part in a BBC2 drama series called Roads to Freedom (1970), which he won. This led to further TV roles, including two more for BBC2: \"Count Wenceslas Steinbock\" in \"Balzac's Cousin Bette\" (1971) and \"Prince Anatol Kuragin\" in an ambitious twenty-part serialisation of Leo Tolstoy's \"War and Peace\" (1972-72). He also took on a wide range to theatre work, including several William Shakespeare festivals, appearing in productions of \"Macbeth\" and \"Hamlet\". In the mid-seventies, Baker landed the role that would make him \"the man viewers love to hate\". This was \"Paul Merroney\" in the BBC1 series The Brothers (1972). After \"The Brothers\", Baker married actress Liza Goddard, who had played his on-screen wife in the series, but the marriage eventually ended in divorce. Baker later married actress Marion Wyatt. Theatre work kept Baker almost constantly busy for the next five years including appearances in everything from comedies to thrillers, as well as more Shakespeare. He also had a few further TV roles, including one as \"Bayban\" in \"Blake's 7: City at the Edge of the World\" (BBC, 1980) and one opposite Nyree Dawn Porter and Ian Hendry in the drama series, For Maddie with Love (1980) (ATV, 1980). Baker's next TV role after \"For Maddie with Love\" was as \"Maxil\" in the Doctor Who (1963) story, \"Arc of Infinity\". Shortly before Baker took the role of the Doctor on \"Doctor Who\", he and his wife suffered the loss of their baby son, Jack, to cot death syndrome. Baker subsequently became a passionate fund raiser for the Foundation for the Study of Infant Deaths, with many of is personal appearance fees being donated to the charity. Baker's time as the sixth Doctor was cut unexpectly short, initially by the hiatus between the twenty-second and twenty-third seasons and then by the decision of the BBC executives to oust him from the role. After his departure from \"Doctor Who\", the actor returned to the theatre, appearing in highly successful runs of \"Corpse\" and \"Deathtrap\" and having a four-month stint in the West End farce, \"Run for Your Wife\", with Terry Scott. TV work included a guest appearance in the BBC's Casualty (1986) and presenting assignments on programmes for the Children's Channel. After directing a play called \"Bazaar and Rummage\", Baker was asked to play the Doctor once again - this time on stage, taking over from Jon Pertwee in the Mark Furness Ltd production, \"The Ultimate Adventure\". This tour proved to him that, despite the brevity of his time as the Doctor on TV, he had amassed a loyal following amongst younger viewers. In the 1990s, Baker had continued to pursue a successful career, mainly in the theatre. He has made regular appearances in pantomime, and his stage work has included roles in the musical adaptation of Charles Dickens' \"Great Expectations\" and in a comedy entitled \"Fear of Flying\". He has also starred in the \"Stranger\" series of videos made by Bill Baggs Video, alongside a number of other actors known for their work on \"Doctor Who\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgzMjM3MTU2NF5BMl5BanBnXkFtZTcwMTE4MzM2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048346","name":"Colin Baker","nicknames":["Archie"],"idIMDB":"nm0048346"},"actorId":"nm0048346","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Peter Davison","urlProfile":"http://www.imdb.com/name/nm0205749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTExMjM3ODQ3Nl5BMl5BanBnXkFtZTcwMzExMjgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1951","placeOfBirth":" Streatham, London, England, UK","birthName":"Peter Malcolm Gordon Moffett","height":"6' 1\" (1.86 m)","bio":"Peter Moffett, now better known by his stage name Peter Davison, was born on 13 April 1951 in the Streatham area of London. In 1961, he and his family - parents Sheila and Claude (an electrical engineer who hailed from British Guiana) and his sisters Barbara, Pamela and Shirley moved to Knaphill, Woking in Surrey, where Davison was educated at the Winston Chirchill School. It was here that he first became interested in acting, taking parts in a number of school plays, and this eventually led to him joining an amateur dramatic society, the Byfleet Players. On leaving school at the age of sixteen, having achieved only modest academic success with three O Levels of undistinguished grades, he took a variety of short-lived jobs ranging from hospital porter to Hoffman press operator. He was still keen to pursue an acting career, however, and so applied for a place at drama school. He was accepted into the Central School of Speech and Drama and stayed there for three years. Davison's first professional acting work came in 1972 when, after leaving drama school in the July of that year, he secured a small role in a run of \"Love's Labour's Lost\" at the Nottingham Playhouse. This marked the start of a three-year period in which he worked in a variety of different repertory companies around the UK, often in Shakespearean roles. He then made his television debut, playing a blond-wigged space cowboy character called Elmer in \"A Man for Emily\", a three-part story in the Thames TV children's series The Tomorrow People (1973), transmitted in April 1975. Appearing alongside him in this production was his future wife, American-born actress Sandra Dickinson, whom he had first met during a run of \"A Midsummer Night's Dream\" in Edinburgh. They married on 26 December 1978 in Dickinson's home town of Rockville in Maryland, USA. Davison spent the following eighteen months working as a file clerk at Twickenham tax office. He also took the opportunity to pursue an interest in singing and song-writing, which led him to record several singles with his wife. He later provided the theme tunes for a number of TV series, including Mixed Blessings (1978) and Button Moon (1980). Davison played the romantic lead, Tom Holland in Love for Lydia (1977), a London Weekend Television (LWT) period drama serial transmitted in 1977. His greatest acting success came when he played Tristan in the BBC's All Creatures Great and Small (1978), based on the books of country vet James Herriot, a highly successful series, which ran initially for three seasons between 1978-1980. His success in All Creatures Great and Small (1978) brought him many other offers of TV work. Amongst those that he took up were lead roles in two sitcoms: LWT's Holding the Fort (1980), in which he played Russell Milburn, and the BBC's Sink or Swim (1980), in which he played Brian Webber. Three seasons of each were transmitted between 1980 and 1982, consolidating Davison's position as a well-known and popular television actor. He announced he was taking the lead role in Doctor Who (1963) on the BBC's lunchtime magazine program \"Pebble Mill at One\", on 3 December 1980, when he discussed with the presenter a number of costume ideas sent in by viewers and was particularly impressed by a suggestion from one of a panel of young fans assembled in the studio that the new Doctor should be 'like Tristan Farnon, but with bravery and intellect'. His appearance in The Hitch Hikers Guide to the Galaxy (1981), was recorded on 19 December 1980 and transmitted on 2 February 1981, by which time the viewing public were well aware that he would soon be taking over the lead role in Doctor Who. There was in fact only a month to go before he would make his on-screen debut in the series - albeit a brief one, in the regeneration sequence at the end of Doctor Who: Logopolis: Part Four (1981). His first full story was in \"Castrovalva\", the first story of season nineteen transmitted on 4 January 1982. His final story was season twenty-one's story \"The Caves of Androzani\". The final episode of this story was transmitted on 16 March 1984. He became a father when on Christmas day 1984 his wife gave birth to a daughter, Georgia Elizabeth, at Queen Charlotte's Hospital in London. Ten years later, however, his marriage to Dickinson broke down and they separated. Although he has taken occasional roles in theatre, radio and film, most of the actor's work has been in the medium for which he is best known: television. His credits have included regular stints as Henry Myers in Anna of the Five Towns (1985), as Dr. Stephen Daker in A Very Peculiar Practice (1986), as Albert Campion in Mystery!: Campion (1989) and as Clive Quigley in Ain't Misbehavin (1994) all for the BBC, and as Ralph in Yorkshire TV's Fiddlers Three (1991). In addition, he has reprized his popular role of Tristan Farnon on a number of occasions for one-off specials and revival seasons of All Creatures Great and Small (1978). He has also returned several times to the world of Doctor Who (1963). In 1993 he appeared as the Fifth Doctor in Doctor Who: Dimensions in Time (1993), a brief two-part skit transmitted as part of the BBC's annual Children in Need Charity appeal, and in 1985 he narrated an abridged novelization of the season twenty-one story \"Warriors of the Deep\" for BBC Worldwide's Doctor Who audio book series. In addition, he has appeared in a number of video dramas produced by Bill Baggs Video. In 2003 and 2004 he appeared as quiet and unassuming detective 'Dangerous' Davies in The Last Detective (2003), the Meridian TV adaptations of Leslie Thomas's novels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTExMjM3ODQ3Nl5BMl5BanBnXkFtZTcwMzExMjgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205749","name":"Peter Davison","idIMDB":"nm0205749"},"actorId":"nm0205749","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Tom Baker","urlProfile":"http://www.imdb.com/name/nm0048982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDE5NzYyNF5BMl5BanBnXkFtZTgwODkyMzc2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1934","placeOfBirth":" Liverpool, England, UK","birthName":"Thomas Stewart Baker","height":"6' 3\" (1.91 m)","bio":"The British character actor Tom Baker, best known as the fourth incarnation of The Doctor, was born in 1934 in Liverpool, England, to Mary Jane (Fleming) and John Stewart Baker. His father was of English and Scottish descent, while his mother's family was originally from Ireland. Tom, along with his younger sister, Lulu, and younger brother, John, was raised in a poor Catholic community by his mother, a house-cleaner and barmaid, who was a devout Catholic, and his father, a sailor, who was rarely at home. At age fifteen, Baker left school to become a monk with the Brothers of Ploermel on the island of Jersey. Six years later, he abandoned the monastic life and performed his National Service in the Royal Army Medical Corps., where he became interested in acting. Baker then served on the Queen Mary for seven months as a sailor in the Merchant Navy before attending Rose Bruford College of Speech and Drama in Kent, England, on scholarship. Baker acted in repertory theaters around Britain until the late 1960s when he joined up with the National Theatre, where he performed with such respected actors as Maggie Smith, Anthony Hopkins and Laurence Olivier, who helped him get his first prominent film role as Rasputin in Nicholas and Alexandra (1971). His performance in this film earned him two Golden Globe Award nominations, one for best actor in a supporting role and another for best new star of the year. A couple of years earlier, Baker had made his theatrical film debut in The Winter's Tale (1967). Despite appearances in a spate of films, including Pier Paolo Pasolini's The Canterbury Tales (1972), The Mutations (1974), The Vault of Horror (1973) and The Golden Voyage of Sinbad (1973), Baker was working as a labourer at a building site when he landed the role of the main character in the popular, long-running British television series Doctor Who (1963), a role that brought him international fame and popularity. After his seven-year stint as Dr. Who from 1974 to 1981, Baker returned to theatre and made occasional television and film appearances, playing Sherlock Holmes in The Hound of the Baskervilles (1982), Puddleglum in The Chronicles of Narnia story The Silver Chair (1990) and Hallvarth, Clan Leader of the Hunter Elves, in Dungeons & Dragons (2000). Throughout his career, Baker's acting style has been to portray his characters with a \"larger-than-life\" air.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDE5NzYyNF5BMl5BanBnXkFtZTgwODkyMzc2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048982","name":"Tom Baker","idIMDB":"nm0048982"},"actorId":"nm0048982","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Jon Pertwee","urlProfile":"http://www.imdb.com/name/nm0675727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTcxNDYxOV5BMl5BanBnXkFtZTcwOTcxMDIyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1919","placeOfBirth":" Chelsea, London, England, UK","birthName":"John Devon Roland Pertwee","height":"6' 2½\" (1.9 m)","bio":"Jon Pertwee is best known for his portrayal of the Doctor, on the BBC science fiction television series Doctor Who (1963). He portrayed the Doctor from 1970 to 1974. His 60-year entertainment career included work in radio, films, and cabaret. This was despite the inauspicious beginning of having been thrown out of drama school as a young man and told he had no future as an actor. The BBC announced his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTcxNDYxOV5BMl5BanBnXkFtZTcwOTcxMDIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0675727","name":"Jon Pertwee","nicknames":["The Tall Light Bulb"],"idIMDB":"nm0675727"},"actorId":"nm0675727","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Patrick Troughton","urlProfile":"http://www.imdb.com/name/nm0873743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTU0MzYxM15BMl5BanBnXkFtZTcwMjc2MjUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1920","placeOfBirth":" Mill Hill, London, England, UK","birthName":"Patrick George Troughton","height":"5' 8\" (1.73 m)","bio":"Patrick Troughton was born in Mill Hill, London and was educated at Mill Hill School. He trained as an actor at the Embassy School of Acting in the UK and at Leighton Rollin's Studio for for Actors at Long Island, New York in the USA. During World War II he served in the Royal Navy and after the war ended he joined the Old Vic and became a Shakespearean actor. He won his most famous role as the second Doctor in Doctor Who (1963), in 1966 and played the role for three years. His hobbies included golf, sailing and fishing. He was a father of six (David, Jane, Joanna, Mark, Michael and Peter), a stepfather to Gill and Graham and a grandfather to Harry Melling, Jamie and Sam Troughton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTU0MzYxM15BMl5BanBnXkFtZTcwMjc2MjUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0873743","name":"Patrick Troughton","nicknames":["Pat"],"idIMDB":"nm0873743"},"actorId":"nm0873743","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"William Hartnell","urlProfile":"http://www.imdb.com/name/nm0367156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMDAyNzI4OV5BMl5BanBnXkFtZTcwMzI0NTg2OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1908","placeOfBirth":" St. Pancras, London, England, UK","birthName":"William Henry Hartnell","height":"5' 8\" (1.73 m)","bio":"William Hartnell was born on 8 January 1908, just south of St. Pancras station in London. In press materials in the 1940s he claimed that his father was a farmer and later a stockbroker; it turns out that he had actually been born out of wedlock, as his biography \"Who's There?\" states. At age 16 he was adopted by Hugh Blaker, a well-known art connoisseur, who helped him to get a job with Sir Frank Benson's Shakespearean Company. He started as a general dogsbody--call-boy, assistant stage manager, property master and assistant lighting director--but was occasionally allowed to play small walk-on parts. Two years later he left Benson's group and went off on tour, working for a number of different companies about Britain. He became known as an actor of farce and understudied renowned performers such as Lawrence Grossmith, Ernest Truex, Bud Flanagan and Charles Heslop. He played repertory in Richmond, Harrogate, Leeds and Sheffield and had a successful run as the lead in a touring production of \"Charley's Aunt.\" He also toured Canada in 1928-29, acquiring much valuable experience. On his return to England, Hartnell married actress Heather McIntyre. He starred in such films as I'm an Explosive (1933), The Way Ahead (1944), Strawberry Roan (1944), The Agitator (1945), Query (1945) and Appointment with Crime (1946). His memorable performance on the television series The Army Game (1957) and the movie This Sporting Life (1963) led to him being cast as the Doctor on Doctor Who (1963), for which he is best remembered. His son-in-law is agent Terry Carney. His granddaughter is Jessica Carney (real name Judith Carney), who authored a biography of her grandfather, \"Who's There?\", in 1996.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMDAyNzI4OV5BMl5BanBnXkFtZTcwMzI0NTg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367156","name":"William Hartnell","nicknames":["Billy","Bill"],"idIMDB":"nm0367156"},"actorId":"nm0367156","character":"The Doctor","urlCharacter":"http://www.imdb.com/character/ch0558962","main":true},{"actorName":"Jenna Coleman","urlProfile":"http://www.imdb.com/name/nm1982510","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODM0NDg1MF5BMl5BanBnXkFtZTcwNTcwMTk2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1986","placeOfBirth":" Blackpool, England, UK","birthName":"Jenna-Louise Coleman","height":"5' 2\" (1.57 m)","bio":"Jenna Coleman was born on April 27, 1986 in Blackpool, England as Jenna-Louise Coleman. She is an actress, known for Doctor Who (2005), Emmerdale (1972) and Captain America: The First Avenger (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODM0NDg1MF5BMl5BanBnXkFtZTcwNTcwMTk2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1982510","name":"Jenna Coleman","nicknames":["Jen"],"idIMDB":"nm1982510"},"actorId":"nm1982510","character":"Clara","urlCharacter":"http://www.imdb.com/character/ch0382970","main":true},{"actorName":"Billie Piper","urlProfile":"http://www.imdb.com/name/nm0684877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDY5MzcwNF5BMl5BanBnXkFtZTgwNzc1NjE2MTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1982","placeOfBirth":" Swindon, Wiltshire, England, UK","birthName":"Lianne Paul Piper","height":"5' 5¼\" (1.66 m)","bio":"Billie Piper studied at the prestigious Sylvia Young Theatre School. She caught the eyes of record producers who were interested in signing a young vocalist when she was the poster girl for the ad campaign of a British pop music magazine, \"Smash Hits\". She released her first single, \"Because We Want To\", which debuted at #1 at age 15. Her second single, \"Girlfriend\", was also a #1 hit. By the time she turned 16, Billie had released 4 singles that all made the top three on the charts. She has been labeled the \"Pop Princess\" of England, UK.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDY5MzcwNF5BMl5BanBnXkFtZTgwNzc1NjE2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0684877","name":"Billie Piper","idIMDB":"nm0684877"},"actorId":"nm0684877","character":"Rose / The Moment / Bad Wolf","urlCharacter":"http://www.imdb.com/character/ch0009590","main":true},{"actorName":"Tristan Beint","urlProfile":"http://www.imdb.com/name/nm2061101","urlPhoto":"","biography":{"dateOfBirth":"1980","placeOfBirth":" Swindon, Wiltshire, England, UK","birthName":"Tristan Daniel Ogbourne","height":"5' 11\" (1.8 m)","bio":"Tristan Beint was born in 1980 in Swindon, Wiltshire, England as Tristan Daniel Ogbourne. He is an actor and assistant director, known for Where the Skin Lies (2017), A Woman in Love and War: Vera Brittain (2008) and Shadows in the Sun (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2061101","name":"Tristan Beint","idIMDB":"nm2061101"},"actorId":"nm2061101","character":"Tom","urlCharacter":"http://www.imdb.com/character/ch0409758","main":true}],"seasons":[],"idIMDB":"tt2779318","urlIMDB":"http://www.imdb.com/title/tt2779318","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"04","year":"2013","remarks":null},{"money":null,"country":null,"day":"05","month":"05","year":"2013","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 17 min (77 min)","1 hr 25 min (85 min) (theatrical) (USA)"],"soundMix":["Dolby Digital","DTS (DTS HD MASTER AUDIO 5.1 Mix)"],"color":["Color","Black and White"],"aspectRatio":["1.78 : 1"],"camera":["Arri Alexa XT"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Digital Intermediate (2K) (master format)","Prores 4444 (2.8K) (source format)"],"printedFilmFormat":["D-Cinema (also 3-D version)"]},"rating":"9.4","filmingLocations":[{"location":"Chepstow Castle, Chepstow, Monmouthshire, Wales, UK"}],"rated":"TV-PG","awards":[{"award":"BAFTA Awards, Wales 2014","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Cymru Award","categories":[{"category":"Special, Visual Effects &amp; Graphics","names":[{"name":"Danny Hargreaves","id":"nm1061601","role":null},{"name":"Real SFX","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Cymru Award","categories":[{"category":"Special, Visual Effects &amp; Graphics","names":[{"name":"Danny Hargreaves","id":"nm1061601","role":null},{"name":"Real SFX","id":null,"role":null}]}]}]},{"award":"Bafta TV Craft 2014","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Television Craft Award","categories":[{"category":"Special, Visual &amp; Graphic Effects","names":[{"name":"Danny Hargreaves","id":"nm1061601","role":null},{"name":"Real SFX","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Television Craft Award","categories":[{"category":"Special, Visual &amp; Graphic Effects","names":[{"name":"Danny Hargreaves","id":"nm1061601","role":null},{"name":"Real SFX","id":null,"role":null}]}]}]}],"votes":"14,338","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"Doctor Who","id":"tt0436992"}},"companyCreditsSimple":[],"keywords":{"keywords":["gallifrey","eleventh doctor","tenth doctor","doctor who","killer cyborg","laser gun","fictional war","memory erasure","black archive","polarity of neutron flow","time lord","ninth doctor","eighth doctor","seventh doctor","sixth doctor","fifth doctor","fourth doctor","third doctor","second doctor","first doctor","twelfth doctor","21st century","barn","1560s","u.n.i.t.","sonic screwdriver","coal hill school","vortex manipulator","zygon","regeneration","reference to captain jack harkness","cyborg","bronze dalek","dalek starship","fez hat","walking with a cane","soldier","alien planet","narrated by character","walking cane","man with a cane","motorcycle","helicopter","handshake","shape shifting alien","shape shifter","old man","scarf","museum","cup of tea","doppelganger","man wearing a bow tie","wedding","queen of england","scientist","archive","painting","dalek","queen","tower of london","tardis","alien disguised as human","16th century","museum curator","curator","multiple actors playing same role","genocide","cleavage","year 1562","meeting future self","queen elizabeth i","asthma inhaler","lookalike"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:14:31"}}