{"data":{"movies":[{"title":"Tell","originalTitle":"","year":"2014","releaseDate":"20141204","directors":[{"name":"J.M.R. Luna","id":"nm3583770"}],"writers":[{"name":"Timothy Williams","id":"nm0931811"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjIwNTEwNV5BMl5BanBnXkFtZTgwNDI3ODU2MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Drama"],"plot":"Ethan Tell is a small time crook who makes a big-time score when he steals 1 million dollars. Ironically, his life radically changes for the worse when he discovers that stealing the money was the easy part and he now must keep his partner, his wife, his parole officer, and two corrupt detectives from stealing it from him.","simplePlot":"Ethan Tell is a small time crook who makes a big-time score when he steals 1 million dollars. Ironically, his life radically changes for the worse when he discovers that stealing the money ... ","actors":[{"actorName":"Milo Ventimiglia","urlProfile":"http://www.imdb.com/name/nm0893257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxODcyNzU2MV5BMl5BanBnXkFtZTcwNzA0ODMxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1977","placeOfBirth":" Anaheim, California, USA","birthName":"Milo Anthony Ventimiglia","height":"5' 9\" (1.75 m)","bio":"Milo Ventimiglia is an American actor. He was born in Anaheim, California, to Carol (Wilson) and Peter Ventimiglia. His father is of Italian/Sicilian descent, and his mother has English and Scottish ancestry. First coming of notice playing the reckless and too smart for his own good 'Jess' on WB's \"Gilmore Girls\", Ventimiglia moved on to NBC's \"American Dreams\", WB's \"Bedford Diaries\" (working with Tom Fontana) and finally landing back on NBC with their international phenomenon, \"Heroes\". Ventimiglia then appeared in TNT's \"Mob City\". Helmed by Frank Darabont and taking place in 1947 Los Angeles, Ventimiglia plays Ned Stax a fixer for Bugsy Seigels crime syndicate. Ventimiglia's film work includes both studio and independent movies, comedy and drama. Known for darker films \"Pathology\" (helmed by Neveldine/Taylor) and \"The Divide\" (directed by Xavier Gen), Ventimiglia also spent time on two comedies with Adam Sandler. Last years \"That's My Boy\" and \"Grown Ups 2\". Other releases include: \"Killing Season\" along side Robert Deniro and John Travolta, and the Weinstein companies \"Grace of Monaco\" starring Nicole Kidman, who plays princess Grace Kelly. Ventimiglia plays Kelly's press agent Rupert Allan. Behind the camera Ventimiglia and his partner at Divide Pictures Russ Cundiff are involved in traditional content having sold TV shows to NBC, SyFy and FX, and producing the independent feature TELL which Ventimiglia co-starred along side of Jason Lee and Katee Sackoff as well as STATIC, which Ventimiglia co-starred with Sarah Shahi and Sara Paxton. Ventimiglia also produced the web-series Chosen, now in it's second season for Sony's Crackle as well as directed other digital projects for American Eagle Outfitters, Cadillac, GQ and Liberty Mutual. Divide Pictures' latest web-series \"The P.E.T. Squad\" Files for CW's Seed, is about a group of amateur ghost hunters who chase fame without having seen an actual apparition. The show launches summer 2013 from San Diego Comicon. Ventimiglia's passion for comic books led him to produce two titles for Top Cow / Image Comics \"Rest\" and \"Berserker\" Ventimiglia spends his free time working with vets through the Iraq and Afghanistan Veterans of America as well as taking USO tours to troops abroad.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxODcyNzU2MV5BMl5BanBnXkFtZTcwNzA0ODMxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0893257","name":"Milo Ventimiglia","nicknames":["Mi"],"idIMDB":"nm0893257"},"actorId":"nm0893257","character":"Tell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katee Sackhoff","urlProfile":"http://www.imdb.com/name/nm0755267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAyMDgxNzheQTJeQWpwZ15BbWU3MDc2OTY1NTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1980","placeOfBirth":" Portland, Oregon, USA","birthName":"Kathryn Ann Sackhoff","height":"5' 6\" (1.68 m)","bio":"Katee Sackhoff was born on April 8, 1980 in Portland, Oregon, USA as Kathryn Ann Sackhoff. She is an actress and producer, known for Battlestar Galactica (2004), Longmire (2012) and Oculus (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAyMDgxNzheQTJeQWpwZ15BbWU3MDc2OTY1NTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0755267","name":"Katee Sackhoff","idIMDB":"nm0755267"},"actorId":"nm0755267","character":"Beverly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Lee","urlProfile":"http://www.imdb.com/name/nm0005134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTk2MTMwN15BMl5BanBnXkFtZTcwOTE3MDUyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1970","placeOfBirth":" Orange, California, USA","birthName":"Jason Michael Lee","height":"6' 1½\" (1.87 m)","bio":"Born in Orange, California in 1970, Jason Lee is an American actor and film photographer. Well known for his professional skateboarding career in the very pivotal late 80s and early 90s, Lee would go on to pursue acting in 1993. He has worked in film, television, and voiceover, and with such directors as Kevin Smith, Cameron Crowe, Lawrence Kasdan and Brad Bird. Retiring from skateboarding in 1995, Lee has maintained solid ties to the industry, most notably through his partnership with longtime friend and fellow ex-professional skateboarder, Chris Pastras, and their now 25-year-old skate brand, Stereo Skateboards, which Lee co-manages with Pastras. In 2001, Lee dove headfirst into film photography and has been an active photographer and film advocate ever since, having had his work both published and exhibited throughout the years. In October 2016, Lee published a selection of small and large format Polaroid and Fuji instant film photographs spanning a decade as a special limited hardbound issue of Fort Worth-based Refueled Magazine. Only 500 signed and numbered copies were produced, and the issue quickly sold-out. Volume 2 of the 2-volume set, to be released in 2017, will be comprised of 4x5 color photographs made throughout Texas, where Lee currently resides with his wife, Ceren, a textiles and fashion designer, musician and mother. Lee is also the subject of a forthcoming documentary from director Greg Hunt that will take the viewer on the road with him as he exposes his remaining sheets of now-expired 8x10 Polaroid films, a favorite medium of Lee's, and one that is no longer being produced. An accompanying book of the large format Polaroids will be published, with the originals being exhibited. In 2017/2018, Lee will also be publishing and exhibiting selections of B&W slide film photographs that were made over the past 10 years. The print collections, one with its focus primarily on the West and Southwest, and the other being strictly California photographs, will consist of close to 200 combined images. He is also the founder of @filmphotographic, an Instagram film community gallery and resource page. \"It's been an incredible tool for showcasing the work of film photographers from around the world, as well as helping photographers connect,\" says Lee. While acting may come and go, the one constant has been and will continue to be his passion for photography and the ever present drive to grow his body of work. \"It's quite common that a creative person will often have a few outlets or interests or passions, but will gravitate toward one in particular in a unique way. For me, that has been photography, and for almost 16 years now. Not since the skateboarding days have I found something so invigorating, so fulfilling,\" Lee says. \"While I still enjoy acting and being a part of the bigger process, nothing quite compares to individual creative endeavors. And once I got locked into photography, it's really all I think about and desire to do. But I've had some pretty great opportunities as an actor, was able to make some movies for my kids, and have the experience of being on a really unique and enjoyable comedy series. But just as with skateboarding, photography is something much more personal, and more fitting to my creativity. It will always be the driving force.\" Follow Lee on Instagram at @jasonlee, @stereoskateboards, and @filmphotographic","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTk2MTMwN15BMl5BanBnXkFtZTcwOTE3MDUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005134","name":"Jason Lee","idIMDB":"nm0005134"},"actorId":"nm0005134","character":"Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Patrick","urlProfile":"http://www.imdb.com/name/nm0001598","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjYyNTQ0MV5BMl5BanBnXkFtZTcwMzA1MjYyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1958","placeOfBirth":" Marietta, Georgia, USA","birthName":"Robert Hammond Patrick Jr.","height":"5' 11\" (1.8 m)","bio":"Robert Hammond Patrick Jr. was born on November 5, 1958 in Marietta, Georgia, and raised in Columbus, Ohio, the eldest of 5 children. He attended the Bowling Green State University in Ohio, but dropped out after he took a drama course and became interested in acting. After leaving college, he took a job as a house painter and continued as such until a boating accident in Lake Erie in 1984. He swam for three hours in order to save the others still stranded on the accident site, while he nearly drowned in his attempt. After the accident, he moved from Ohio to Los Angeles, California. He worked in a bar to supplement his income and even lived in his own car. Patrick starred in various direct-to-video television movies, and had a short appearance in Die Hard 2 (1990). His breakthrough role came as T-1000 in James Cameron's blockbuster Terminator 2: Judgment Day (1991). After that, he landed roles in various feature films such as Last Action Hero (1993), Fire in the Sky (1993), and Striptease (1996). His performance in \"Fire in the Sky\" caught the attention of Chris Carter, creator of the television series The X-Files (1993). After David Duchovny distanced himself from the series during its seventh season, Patrick was cast as FBI Agent John Doggett. Patrick lives with his wife, Barbara, whom he married during the filming of \"Terminator 2: Judgement Day\", and their two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjYyNTQ0MV5BMl5BanBnXkFtZTcwMzA1MjYyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001598","name":"Robert Patrick","idIMDB":"nm0001598"},"actorId":"nm0001598","character":"Ashton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Tudyk","urlProfile":"http://www.imdb.com/name/nm0876138","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzEwNDUxNV5BMl5BanBnXkFtZTcwNTE1MDAzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1971","placeOfBirth":" El Paso, Texas, USA","birthName":"Alan Wray Tudyk","height":"5' 11½\" (1.82 m)","bio":"Alan Tudyk was born in El Paso, Texas, and grew up in Plano, where he attended Plano Sr. High. In 1990, he went on to study drama at Lon Morris Jr. College. While there, he was awarded the Academic Excellence Award for Drama. He was also named Most Likely to Succeed and Sophomore Beau. During this time, Alan was also an active member of the Delta Psi Omega fraternity. After leaving LMJC, Alan went on to study at the prestigious Juilliard conservatory but left in 1996 before earning a degree. After a number of smaller stage productions and a small role in the movie Patch Adams (1998), Alan landed his first Broadway role in 1999 with \"Epic Proportions.\" He quickly became a sought-after comedic actor, with roles in such films as 28 Days (2000) and A Knight's Tale (2001). In 2002, Alan got the role of Wash, the wise-cracking pilot of Serenity on the short-lived series Firefly (2002). Although it lasted only eleven episodes, this may be Alan's most well-known and best-loved role. No other networks would buy the failed series, but Universal Pictures began courting creator Joss Whedon to produce a big-screen version of the series. While awaiting the final news of Firefly's fate, Alan played the beloved Steve the Pirate in the movie Dodgeball: A True Underdog Story (2004) and the voice of the robot Sonny in I, Robot (2004). In 2005, Alan finally reprised the role of Wash in Serenity (2005), the feature-film version of the series Firefly. The same year, he went back to Broadway from June to November, taking over the role of Lancelot for Hank Azaria in the successful musical \"Spamalot.\" He lives in New York City but also has a place in Los Angeles, California","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzEwNDUxNV5BMl5BanBnXkFtZTcwNTE1MDAzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0876138","name":"Alan Tudyk","idIMDB":"nm0876138"},"actorId":"nm0876138","character":"Morton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Michael Higgins","urlProfile":"http://www.imdb.com/name/nm0383422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTg4MDUyNl5BMl5BanBnXkFtZTcwMjMxMDI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1963","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 11\" (1.8 m)","bio":"John Michael Higgins was born on February 12, 1963 in Boston, Massachusetts, USA. He is an actor, known for Yes Man (2008), Bad Teacher (2011) and The Ugly Truth (2009). He has been married to Margaret Welsh since February 1, 2003. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTg4MDUyNl5BMl5BanBnXkFtZTcwMjMxMDI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0383422","name":"John Michael Higgins","idIMDB":"nm0383422"},"actorId":"nm0383422","character":"Huffman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Faizon Love","urlProfile":"http://www.imdb.com/name/nm0522324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwNzE2NjM5MF5BMl5BanBnXkFtZTYwNDE5MDcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1968","placeOfBirth":" Santiago de Cuba, Cuba","birthName":"Langston Faizon Santisima","height":"5' 10\" (1.78 m)","bio":"Faizon Love was born on June 14, 1968 in Santiago de Cuba, Cuba as Langston Faizon Santisima. He is an actor and writer, known for Couples Retreat (2009), Elf (2003) and Grand Theft Auto: San Andreas (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwNzE2NjM5MF5BMl5BanBnXkFtZTYwNDE5MDcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0522324","name":"Faizon Love","idIMDB":"nm0522324"},"actorId":"nm0522324","character":"Dwight Johnson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oscar Nuñez","urlProfile":"http://www.imdb.com/name/nm1386645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA1MjEwMzE2OV5BMl5BanBnXkFtZTgwODQ0NTcxMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1958","placeOfBirth":" Cuba","height":"5' 9\" (1.75 m)","bio":"Oscar Nuñez was born on November 18, 1958 in Cuba. He is an actor and writer, known for The Office (2005), The Proposal (2009) and The Italian Job (2003). He has been married to Ursula Whittaker since May 21, 2011. They have one child. He was previously married to Carla.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA1MjEwMzE2OV5BMl5BanBnXkFtZTgwODQ0NTcxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1386645","name":"Oscar Nuñez","idIMDB":"nm1386645"},"actorId":"nm1386645","character":"Father Jack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Reinert","urlProfile":"http://www.imdb.com/name/nm1399983","urlPhoto":"","biography":{"bio":"Peter Reinert is an actor, known for American Wedding (2003), Fanboys (2009) and La carnada (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1399983","name":"Peter Reinert","idIMDB":"nm1399983"},"actorId":"nm1399983","character":"Malcolm","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monica Young","urlProfile":"http://www.imdb.com/name/nm1911063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTczMzk2NF5BMl5BanBnXkFtZTgwODQxNTU5NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Monica Young is an actress, known for A Happening of Monumental Proportions (2017), Modern Family (2009) and Mom (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTczMzk2NF5BMl5BanBnXkFtZTgwODQxNTU5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1911063","name":"Monica Young","idIMDB":"nm1911063"},"actorId":"nm1911063","character":"Stephanie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph O'Neill","urlProfile":"http://www.imdb.com/name/nm6112886","urlPhoto":"","biography":{"bio":"Joseph O'Neill is an actor, known for Tell (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6112886","name":"Joseph O'Neill","idIMDB":"nm6112886"},"actorId":"nm6112886","character":"Joe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gage Christopher","urlProfile":"http://www.imdb.com/name/nm6606418","urlPhoto":"","biography":{"bio":"Gage Christopher is an actor, known for Tell (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6606418","name":"Gage Christopher","idIMDB":"nm6606418"},"actorId":"nm6606418","character":"William Tell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Drank","urlProfile":"http://www.imdb.com/name/nm2632918","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMTI4NzQ5MV5BMl5BanBnXkFtZTgwMzkwMTIyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Born in Riverside, California Frank Drank has recorded 3 albums as the singer of a funk band and published an wide array of songs from his own band as well as other artists. He's become the \"go to\" guy to sing Louis Armstrong covers at events. As an actor, Frank can transform from a scary bad-ass to a lovable, funny teddy bear. His television credits include House, MD, Eagleheart , Greek, Bigtime Rush, Kirby Buckets, Jennifer Falls and Conan O'Brien. Film credits include The Campaign, Goodbye World, Holiday Road Trip, and lead roles in the kids' caper franchise Mickey Matson. Frank actively raises money for the City Of Hope in honor of his friend and fellow musician Dennis \"D'Roc\" Miles who fought a long battle with lymphoma. Frank also works for \"Gumbo,\" a Riverside area charity that goes out on the streets to feed and clothe the homeless.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMTI4NzQ5MV5BMl5BanBnXkFtZTgwMzkwMTIyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2632918","name":"Frank Drank","idIMDB":"nm2632918"},"actorId":"nm2632918","character":"Frank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Flores","urlProfile":"http://www.imdb.com/name/nm5871519","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MTg4MjI0MzdeQTJeQWpwZ15BbWU4MDIyOTQxNjgx._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"6' 2½\" (1.89 m)","bio":"Michael Flores is an actor and producer, known for Let's Be Cops (2014), Blackhat (2015) and South32 (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MTg4MjI0MzdeQTJeQWpwZ15BbWU4MDIyOTQxNjgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5871519","name":"Michael Flores","idIMDB":"nm5871519"},"actorId":"nm5871519","character":"Inmate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Peyton","urlProfile":"http://www.imdb.com/name/nm3776763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTUyNDM5NF5BMl5BanBnXkFtZTcwOTc3ODEwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"James Peyton is known for his work on The Dark Knight Rises (2012), Savages (2012) and Ride Along (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTUyNDM5NF5BMl5BanBnXkFtZTcwOTc3ODEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3776763","name":"James Peyton","nicknames":["American Action Actor"],"idIMDB":"nm3776763"},"actorId":"nm3776763","character":"Hotel Man 2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2724236","urlIMDB":"http://www.imdb.com/title/tt2724236","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"1,341","type":"Movie","companyCreditsSimple":[{"idCompany":"co0386393","name":"Haven Entertainment"},{"idCompany":"co0409284","name":"American Film Productions"},{"idCompany":"co0178545","name":"Divide Pictures"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:32:47"}}