{"data":{"movies":[{"title":"The Salvation","originalTitle":"","year":"2014","releaseDate":"20150227","directors":[{"name":"Kristian Levring","id":"nm0506290"}],"writers":[{"name":"Anders Thomas Jensen","id":"nm0421314"},{"name":"Kristian Levring","id":"nm0506290"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MTU2NjIxOTNeQTJeQWpwZ15BbWU4MDA5Njc0MDIx._V1.jpg","countries":["Denmark","UK","South Africa","Sweden","Belgium"],"languages":["English","Danish","Spanish"],"genres":["Drama","Western"],"plot":"The American West in the 1870s. A European settler, Jon Jensen (Mads Mikkelsen), has just welcomed his wife and son to the country when they are kidnapped and murdered. He takes revenge on the murderers, only to discover that one was the brother of a local land baron, Henry Delarue. Delarue runs the local town with a brutal hand. Now he wants vengeance on the man who killed his brother and the local townspeople are too scared of him to stand up to him. Jon is fighting more than just the local thugs, he is facing the entire town.","simplePlot":"In 1870s America, a peaceful American settler kills his family's murderer which unleashes the fury of a notorious gang leader. His cowardly fellow townspeople then betray him, forcing him to hunt down the outlaws alone.","actors":[{"actorName":"Mads Mikkelsen","urlProfile":"http://www.imdb.com/name/nm0586568","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTU5MzgxMF5BMl5BanBnXkFtZTYwMDI0NjI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1965","placeOfBirth":" Østerbro, Copenhagen, Denmark","birthName":"Mads Dittman Mikkelsen","height":"6' (1.83 m)","bio":"Mads Mikkelsen is a synonym to the great success the Danish film industry has had since the mid-1990s. He was born in Østerbro, Copenhagen, to Bente Christiansen, a nurse, and Henning Mikkelsen, a banker. Starting out as a low-life pusher/junkie in the 1996 success Pusher (1996), he slowly grew to become one of Denmark's biggest movie actors. The success in his home country includes Flickering Lights (2000), Shake It (2001) and the Emmy-winning police series Unit 1 (2000). His success has taken him abroad where he has played alongside Gérard Depardieu in Dina (2002) as well as in the Spanish comedy Torremolinos, le strip-tease de ma copine (2003) and the American blockbuster King Arthur (2004). He played the role of Dr. Hannibal Lecter in the series Hannibal (2013) series, from 2013 to 2015, with great success.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTU5MzgxMF5BMl5BanBnXkFtZTYwMDI0NjI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0586568","name":"Mads Mikkelsen","idIMDB":"nm0586568"},"actorId":"nm0586568","character":"Jon Jensen","urlCharacter":"http://www.imdb.com/character/ch0511560","main":true},{"actorName":"Eva Green","urlProfile":"http://www.imdb.com/name/nm1200692","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDA2ODE2Ml5BMl5BanBnXkFtZTcwMjI0Nzc3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1980","placeOfBirth":" Paris, France","birthName":"Eva Gaëlle Green","height":"5' 6\" (1.68 m)","bio":"French actress and model Eva Gaëlle Green was born on July 6, 1980, in Paris, France. Her father, Walter Green, is a dentist who appeared in the 1966 film Au Hasard Balthazar (1966). Her mother, Marlène Jobert, is an actress turned children's book writer. Eva's mother was born in Algeria, of Sephardi Jewish heritage (during that time, Algeria was part of France), and Eva's father is of Swedish, French, and Breton descent. She has a fraternal twin sister, Joy. Eva left French school at 17. She switched to English in Ramsgate, Kent, and went to the American School in France for one year. She studied acting at Saint Paul Drama School in Paris for three years, then had a 10-week polishing course at the Weber Douglas Academy of dramatic Art in London. She also studied directing at the Tisch School of Arts at New York University. She returned to Paris as an accomplished young actress, and played on stage in several theater productions: \"La Jalousie en Trois Fax\" and \"Turcaret\". There, she caught the eye of director Bernardo Bertolucci. Green followed a recommendation to work on her English. She studied for two months with an English coach before doing The Dreamers (2003) with Bernardo Bertolucci. During their work, Bertolucci described Green as being \"so beautiful it's indecent\". Green won critical acclaim for her role in The Dreamers (2003). She also attracted a great deal of attention from male audiences for her full frontal nudity in several scenes of the film. Besides her work as an actress, Green also composed original music and recorded several sound tracks for the film score. After \"The Dreamers\", Green's career ascended to the level where she revealed more of her multifaceted acting talent. She played the love interest of cult French gentleman stealer, Adventures of Arsene Lupin (2004), opposite Romain Duris. In 2005, she co-starred, opposite Orlando Bloom and Liam Neeson, in Kingdom of Heaven (2005), produced and directed by Ridley Scott. The film brought her a wider international exposure. She turned down the femme fatale role in Le dahlia noir (2006), that went to Hilary Swank, because she didn't want to end up typecast as a femme fatale after her role in \"The Dreamers\". Instead, Eva accepted the prestigious role of \"Vesper Lynd\", one of three Bond girls, opposite Daniel Craig, in Casino Royale (2006) and became the 5th French actress to play a James Bond girl, after Claudine Auger in Thunderball (1965), Corinne Cléry in Moonraker (1979), Carole Bouquet in For Your Eyes Only (1981) and Sophie Marceau in The World Is Not Enough (1999). She achieved international recognition for the film, one of the highest-grossing Bond movies ever. Since then, Green has starred in the films Dark Shadows (2012), 300: Rise of an Empire (2014), Sin City: A Dame to Kill For (2014), and Miss Peregrine's Home for Peculiar Children (2016). She also starred as Vanessa Ives in Showtime's horror drama \"Penny Dreadful\" (2014)_. Her performance in the series earned her a nomination for Best Actress in a Television Series - Drama at the 73rd Golden Globe Awards. Since her school years, Green has been a cosmopolitan multilingual and multicultural person. Yet, since her father always lived in France with them and her mother, she and her twin sister can't speak Swedish. She developed a wide scope of interests beyond her acting profession and became an aspiring art connoisseur and an avid museum visitor. Her other activities, outside of acting, include playing and composing music, cooking at home, walking her terrier, and collecting art. She shares time between her two residencies, one is in Paris, France, and one in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDA2ODE2Ml5BMl5BanBnXkFtZTcwMjI0Nzc3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1200692","name":"Eva Green","idIMDB":"nm1200692"},"actorId":"nm1200692","character":"Madelaine","urlCharacter":"http://www.imdb.com/character/ch0419540","main":true},{"actorName":"Jeffrey Dean Morgan","urlProfile":"http://www.imdb.com/name/nm0604742","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcxOTQ0MTgxNl5BMl5BanBnXkFtZTgwMzIxNDY3NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1966","placeOfBirth":" Seattle, Washington, USA","height":"6' 2\" (1.88 m)","bio":"Jeffrey Dean Morgan endeared himself to audiences with his recurring role on ABC's smash hit series, Grey's Anatomy (2005). His dramatic arc as heart patient \"Denny Duquette\", who wins the heart of intern \"Izzie Stevens\" (Katherine Heigl) in a star-crossed romance, made him a universal fan favorite. He also had recurring roles on The CW and Warner Bros. Television's drama series, Supernatural (2005), and on Showtime and Lions Gate Television's award-winning comedy series, Weeds (2005). Morgan starred in Warner Bros.' Watchmen (2009), director Zack Snyder's (300 (2006)) adaptation of the iconic graphic novel. He played the pivotal role of \"The Comedian\", a Vietnam vet who is a member of a group of heroes called \"the Minutemen\". He next appeared in producer Joel Silver's The Losers (2010), for Warner Bros. It is an adaptation of DC-Vertigo's acclaimed comic book series about a band of black ops commandos who are set up to be killed by their own government. The team barely survives and sets out to get even. James Vanderbilt adapted the screenplay, and Sylvain White directed. He appeared in Focus Features' Taking Woodstock (2009), directed by Oscar-winning director Ang Lee. He also starred opposite Uma Thurman in Yari Film Group's romantic comedy, The Accidental Husband (2008). Additional feature credits include a cameo role opposite Rachel Weisz in Warner Bros.' comedy, Fred Claus (2007), and the independent office comedy, Kabluey (2007), in which he played a charismatic yet smarmy co-worker to Lisa Kudrow's character. In 2011, the in-demand actor starred in the independent murder mystery, Texas Killing Fields (2011). In the film, based on a true story, Morgan plays a detective transplanted from New York who teams with a local investigator (Sam Worthington) to work on a series of unsolved murders in industrial wastelands surrounding Gulf Coast refineries, where as many as 70 bodies turned up over the past two decades. Together, they wage a war against the unknown assailants. Michael Mann produced the film, while his daughter, Ami Canaan Mann, directed. The actor traveled to Thailand, where he filmed the Weinstein Company's period drama, Shanghai (2010), under the direction of Mikael Håfström (1408 (2007)). John Cusack stars as an American who returns to a corrupt, Japanese-occupied Shanghai four months prior to Pearl Harbor and learns that his friend \"Connor\" (Morgan) has been killed. While trying to solve the murder, he discovers a much larger secret that his own government is hiding. In addition, Morgan has a role in Michael London's Groundswell Productions' All Good Things (2010), starring Kirsten Dunst and Ryan Gosling, also for The Weinstein Co. He also stars opposite two-time Academy Award winner Hilary Swank in the suspense thriller, The Resident (2011), for Hammer Films. It is the story of a young doctor (Swank) who moves into a Brooklyn loft and becomes suspicious that she is not alone. Morgan plays \"Max\", her charming new landlord who she discovers has developed a dangerous obsession with her. Morgan previously co-starred with Swank in Warner Bros.' P.S. I Love You (2007). Morgan also appeared in the MGM/UA reboot of the 1984 action movie, Red Dawn (2012). The plot focuses on a group of teenagers who form an insurgency, called \"the Wolverines\", when their town is invaded by Cuban and Russian soldiers. Morgan plays the role of \"Lieutenant Andrew Tanner\", leader of the U.S. Special Forces who finds the Wolverines. Morgan was born in Seattle, Washington, to Sandy Thomas and Richard Dean Morgan. In his spare time, Morgan enjoys barbecuing on the grill, reading, watching movies and listening to his favorite band, The Eagles. He also loves to root for his home team, the Seattle Seahawks. He resides in Los Angeles with his dogs, Bisou and Bandit Mogan, a puppy he rescued in Puerto Rico while filming The Losers (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcxOTQ0MTgxNl5BMl5BanBnXkFtZTgwMzIxNDY3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604742","name":"Jeffrey Dean Morgan","nicknames":["Jeff","McNaughty"],"idIMDB":"nm0604742"},"actorId":"nm0604742","character":"Henry Delarue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Cantona","urlProfile":"http://www.imdb.com/name/nm0134642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Mzc5NDIzM15BMl5BanBnXkFtZTcwMzEwNDQxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1966","placeOfBirth":" Marseille, Bouches-du-Rhône, France","height":"6' 2\" (1.88 m)","bio":"Eric Cantona is most known for his skill on the soccer field. Starring at Old Trafford, Manchester United's homeground, Cantona got the nickname \"The King\". The controversial striker has been praised as the one who brought back the trophies to one of the world's most famous soccer clubs. Cantona is well-known for being banned from playing soccer for 8 months after kicking a fan during a match. His career at Old Trafford was like a marriage: filled with passion, and turbulent. And just as shocking as his arrival, was his departure. Out of the blue, Man Utd called for a press conferance during the summer of 1997 announcing Cantona's retirement. He felt it was time to concentrate on acting and painting. The controversial Frenchman is a gifted individual, who always will go his own ways.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Mzc5NDIzM15BMl5BanBnXkFtZTcwMzEwNDQxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0134642","name":"Eric Cantona","nicknames":["King Cantona","Eric the Red"],"idIMDB":"nm0134642"},"actorId":"nm0134642","character":"Corsican","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mikael Persbrandt","urlProfile":"http://www.imdb.com/name/nm0675409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTI1MjIwMF5BMl5BanBnXkFtZTgwNjY4MTkzMjE@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1963","placeOfBirth":" Jakobsberg, Stockholms län, Sweden","birthName":"Mikael Åke Persbrandt","height":"6' 2½\" (1.89 m)","bio":"Mikael Persbrandt is internationally known for his starring role in the Academy Award winning foreign feature, \"In A Better World,\" directed by Susanne Bier. His performance earned him a 2011 European Film Award nomination for Best Actor. His interest in acting started when working as an extra in Ingmar Bergman's staging of William Shakespeare's \"King Lear.\" In the early 1990s, Mikael starred in a popular TV series, \"Rederiet\" (\"The Shipping Company.\") He has also starred in other series such as \"Storstad,\" \"Den vite riddare,\" \"Anna Holt- Polis\" and in \"Medicinmannen.\" Mikael also has an extended theatre background and collaborated successfully with director Thorsten Flinck on several Swedish productions such as \"Three Sisters\" and \"Death of a Salesman\" at the Plaza Theatre, \"Mr. Puntila and His Man Matti,\" \"The Good Person of Szechwan\" and \"Long Day's Journey Into Night\" at the Royal Dramatic Theatre. Among his other appearances at the Royal Dramatic Theatre mention can be made of \"Maria Stuart\" (directed by Ingmar Bergman,) \"Don Juan,\" \"The Wild Duck,\" \"Miss Julie\" and recently \"The Sea Gull.\" In 1997, Persbrandt starred for the first time as the tough detective, Gunvald Larsson, the role that ultimately became his major break-through. \"Beck\" was not only a major hit in Sweden but in Germany as well - and now consists of 24 theatrical and television movies based on the characters created by authors Maj Sjöwall and Per Wahlöo. Mikael's other work includes starring roles in the Swedish films \"The Hypnotist\", the \"Hamilton\" series, \"Nagon annanstans i Sverige\" (for which he received a 2011 Guldbagge nomination), \"Stockholm East,\" and \"Day and Night.\" He has starred in IFC Films' \"Everlasting Moments,\" for which he earned the 2009 Guldbagge Award for Best Actor. In 2006, he earned Best Actor nominations for both the Bodil (Denmark) and Guldbagge Awards for his performance opposite Lena Olin in Simon Staho's \"Bang Bang Orangutang.\" He also starred in Staho's \"Day and Night,\" which won the Chicago International Film Festival's Silver Hugo Award for Best Ensemble Acting. In 2005, Mikael received the highly coveted Ingmar Bergman award from the Guldbagge Awards. Mikael previously received Guldbagge nominations for his performances in director Peter Possne's 2002 film, \"Everybody Loves Alice,\" and director Bo Norgren's 1999 film, \"Deathly Compulsion.\" He can be seen as the character Beorn in the highly anticipated, final installment of Peter Jackson's \"The Hobbit: The Battle of Five Armies,\" set to release December 2014. Mikael also stars in the drama \"Someone You Love,\" which tells the story of a world-famous, hard-living Danish singer-songwriter who returns to his homeland to record a new album. After opening the 2014 Berlin Film Festival, \"Someone You Love\" took home the Audience Award for Best International Film at the Los Angeles Film Festival. Mikael stars opposite Mads Mikkelson in the critically acclaimed feature \"The Salvation,\" which premiered at 2014 Cannes Film Festival with a standing ovation, and will be distributed by IFC Films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTI1MjIwMF5BMl5BanBnXkFtZTgwNjY4MTkzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0675409","name":"Mikael Persbrandt","nicknames":["Micke"],"idIMDB":"nm0675409"},"actorId":"nm0675409","character":"Peter Jensen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Douglas Henshall","urlProfile":"http://www.imdb.com/name/nm0378112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTcyMzYyMl5BMl5BanBnXkFtZTcwMTE4ODIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1965","placeOfBirth":" Glasgow, Scotland, UK","birthName":"Douglas James Henshall","height":"5' 9½\" (1.77 m)","bio":"Douglas Henshall was born in Glasgow, Scotland in November 1965. His mother was a nurse and his father a salesman. He is the youngest of three children and has two older sisters. He grew up in Barrhead and attended Barrhead High School. Whilst at school a friend asked him to join The Scottish Youth Theatre based in Glasgow. After leaving school, he moved to London to train at Mountview Theatre School. He returned to Glasgow after training where he joined the 7:84 theater company. Eventually, he went back to live in London where he received critical acclaim for his theater work, notably \"Life of Stuff\" at the Donmar Warehouse (1993) and \"American Buffalo\" at the Young Vic (1997). One of his first successful film roles was as Edgar in Angels and Insects (1995) before going on to star in Orphans (1998), Twice Upon a Yesterday (1998), Lawless Heart (2001) and It's all about love (2003) . He has also starred in many television series and is known for his roles in Psychos (1999), Kid in the Corner (1999), Loving You (2003) and Frances Tuesday (2004). Douglas has also performed in plays for BBC radio, including the role of Romeo in \"Romeo and Juliet (1999), David in \"The Long Farewell\" (2002), Jack Parlabane in \"Bampot Central\" (2004) and Richard in \"Richard III\" (2004). In the summer of 2002, Douglas returned to the London stage where he performed the role of Michael Bakunin in Tom Stoppard's new trilogy of plays, 'The Coast of Utopia', at The National Theatre. During 2004 he continued stage work starring as John Proctor in 'Arthur Miller' 's 'The Crucible' at The Crucible in Sheffield and Thomas Huxley in 'Darwin in Malibu' by Crispin Whittell, at the Hampstead Theatre. In 2005 Douglas made his West End debut at The Lyric, Shaftesbury Avenue playing Biff Loman in the critically acclaimed production of Arthur Miller' 's play 'Death of a Salesman', alongside Brian Dennehy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTcyMzYyMl5BMl5BanBnXkFtZTcwMTE4ODIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0378112","name":"Douglas Henshall","idIMDB":"nm0378112"},"actorId":"nm0378112","character":"Sheriff Mallick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Raymond-James","urlProfile":"http://www.imdb.com/name/nm1535423","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzE2MDYzOV5BMl5BanBnXkFtZTgwODEzNDI3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1977","placeOfBirth":" Michigan, USA","birthName":"Michael Weverstad","height":"5' 8\" (1.73 m)","bio":"Michael Raymond-James was born on December 24, 1977 in Michigan, USA as Michael Weverstad. He is an actor and director, known for Jack Reacher (2012), Black Snake Moan (2006) and The Finest Hours (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzE2MDYzOV5BMl5BanBnXkFtZTgwODEzNDI3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1535423","name":"Michael Raymond-James","nicknames":["Mikey Ray"],"idIMDB":"nm1535423"},"actorId":"nm1535423","character":"Paul Delarue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Pryce","urlProfile":"http://www.imdb.com/name/nm0000596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQ3OTcwNl5BMl5BanBnXkFtZTgwNTE2MDU2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1947","placeOfBirth":" Holywell, Flintshire, Wales, UK","birthName":"John Price","height":"6' (1.83 m)","bio":"From Holywell to Hollywood, Jonathan Pryce, CBE is a critically acclaimed and award winning actor from North Wales, internationally regarded as the one of greatest ones both on stage and screen. Renowned for his immense versatility and powerful presence he has transcended the industry, effortlessly moving between Hollywood studio films and the classical West End in a range of work that also includes bold independent cinema and the Broadway musical. He has created some of the most memorable characters in cinema and for over forty years been on the wish list of many of the worlds most notorious and accomplished directors as 'Someone they must work with'. Jonathan, after graduating from the world famous RADA in London, began his career in the 1970's at the hugely influential Liverpool Everyman Theatre which grounded his politics and talent and helped attract a legacy of brave individual artists that have since been through their doors. From his definitive performance as Hamlet, he made his breakthrough screen performance in Terry Gilliam's masterpiece Brazil (1985). The phrase an 'Actors Actor' is often overused but with Jonathan Pryce I can think of no better fitting tribute because what that means to the industry is - here is a talent people want to watch and people want to work with. His choices can be considered as bold as they should be as well as always truthful that give life to characters multi-layered and always exciting, where it can be even hard to believe that he is just one man. As in his stage course that includes notable performances such as in \"Hamlet\", \"The Merchant of Venice\", \"The Goat or Who is Sylvia?\", \"The Taming of the Shrew\", \"Miss Saigon\", \"Oliver\", \"Comedians\" and \"King Lear\", Jonathan Pryce's range of staggering portrayals full of generously euphoric delight has also been expressed in films such as Brazil (1985), Glengarry Glen Ross (1992), The Age of Innocence (1993), Carrington (1995), Evita (1996), Behind the Lines (1997), Tomorrow Never Dies (1997), Very Annie Mary (2001), Unconditional Love (2002) and Pirates of the Caribbean: Dead Man's Chest (2006) as well as in mesmerizing TV roles such as in Roger Doesn't Live Here Anymore (1981), Game of Thrones (2011), My Zinc Bed (2008), Wolf Hall (2015) and Taboo (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQ3OTcwNl5BMl5BanBnXkFtZTgwNTE2MDU2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000596","name":"Jonathan Pryce","idIMDB":"nm0000596"},"actorId":"nm0000596","character":"Mayor Nathan Keane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Arnold","urlProfile":"http://www.imdb.com/name/nm1924735","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNjZjQwZmMtZmE5Ni00ZGM1LWE1MTgtMTkxMzU4NjljMTJlXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UY44_CR20,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1992","placeOfBirth":" Ashford, Kent, England, UK","height":"6' (1.83 m)","bio":"Alexander Arnold is a British actor born in Ashford, Kent on December 21st 1992. He has been a member of the National Youth Theatre since 2008, attending Norton Knatchbull school and later Highworth Grammar School, performing in numerous drama productions as well as with Ashford Youth Theatre. At 17 he attended an open audition for the E4 teen drama 'Skins', and was cast as regular Rich Hardbeck. The following year he played a key character suspected of murder in ITV drama 'A Mother's Son' and in September 2013 could be seen simultaneously in the Northern crime series 'Vera' and the BBC whodunnit 'What Remains'. He is soon to make his feature debut in Kristen Levring's 'The Salvation', alongside Mads Mikkelsen and Eva Green.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNjZjQwZmMtZmE5Ni00ZGM1LWE1MTgtMTkxMzU4NjljMTJlXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1924735","name":"Alexander Arnold","idIMDB":"nm1924735"},"actorId":"nm1924735","character":"Voichek Borowski","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nanna Øland Fabricius","urlProfile":"http://www.imdb.com/name/nm3383904","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTE3ODk0MV5BMl5BanBnXkFtZTgwMjUxMzI4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1985","placeOfBirth":" Copenhagen, Denmark","birthName":"Nanna Øland Fabricius","bio":"Nanna Øland Fabricius is a Danish singer-songwriter and dancer better known as Oh Land. She is the daughter of an opera singer and a composer. She went to the royal Danish ballet and the royal Swedish ballet, but she was forced to stop due to a back injury. She has released three albums so far and is planning on a fourth album in the following years. She know lives in Brooklyn, New York City and is married to a ten years older Danish artist, Eske Kath.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTE3ODk0MV5BMl5BanBnXkFtZTgwMjUxMzI4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3383904","name":"Nanna Øland Fabricius","nicknames":["Oh Land"],"idIMDB":"nm3383904"},"actorId":"nm3383904","character":"Marie Jensen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Toke Lars Bjarke","urlProfile":"http://www.imdb.com/name/nm2376318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzZmNDM5NjctOTFlOS00NTg5LTgzNDMtMGVjMDFiYzZiMzU0XkEyXkFqcGdeQXVyMjIyNzEzNTQ@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1999","placeOfBirth":" Denmark","height":"5' 10½\" (1.79 m)","bio":"Toke Lars Bjarke is son of actor Lars Bjarke and environmentalist Tanja Aertebjerg. He grew up in central Copenhagen, Denmark, but the family spent two years in London in his early upbringing, and he is fluently in English as well as Danish. His 8 year younger sister Holly Lars Bjarke also has a great career in acting with lead roles, and 11 year older big brother Mark Stefan Zytphen-Adeler is also acting in a smaller scale, and writes poetry. Toke has been in front of the camera since the age of 3 in Danish TV series. At age 7 he was spottet as a kid with a special gift for performing by the radio station The Voice, and from that he was asked to participate in various TV shows and had his first single released. After that he has been acting in also award winning both Danish and international movies and TV series, released several singles and toured as a musician with more than 100 concerts a year. He has also been doing a lot of charity and is ambassador for organisations like Familier med \"Kræftramte Børn\" and Invicto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzZmNDM5NjctOTFlOS00NTg5LTgzNDMtMGVjMDFiYzZiMzU0XkEyXkFqcGdeQXVyMjIyNzEzNTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2376318","name":"Toke Lars Bjarke","idIMDB":"nm2376318"},"actorId":"nm2376318","character":"Kresten Jensen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Cameron Michael","urlProfile":"http://www.imdb.com/name/nm0584206","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmMwZmY2ZmQtMjg5MS00YTcyLWE2OTYtZjA2OTdjYWUxYzVhXkEyXkFqcGdeQXVyMTQyOTQ4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1969","placeOfBirth":" Cape Town, South Africa","height":"5' 10\" (1.78 m)","bio":"South African-born veteran actor Sean Cameron Michael started acting professionally at the age of twelve in musical theater. With a career spanning over thirty years, he is today regarded as one of Africa's most successful exports, having performed numerous leading and supporting roles in over eighty television and film productions and has worked with some of the top actors, directors and producers in the world today, including Clint Eastwood, Morgan Freeman, Ryan Reynolds, Matt Damon, Denzel Washington, Meg Ryan, William Hurt and Michael Bay. Theater highlights include the Vita Award-winning On the Open Road and as Father Huddleston in the Naledi award-winning musical-opera, The Mandela Trilogy. He first gained international exposure in Bryan Singer and Dean Devlin's Emmy-winning mini-series The Triangle, as well as Fox's multi-Emmy and Golden Globe nominated feature 24: Redemption (opposite Jon Voight and Kiefer Sutherland). Over 12 million viewers tuned in for the premiere. More recently he worked opposite Games of Thrones' Charles Dance in the Emmy-nominated Strike Back series, as well as Oscar winner William Hurt in BBC Films' Royal Television Society's award-winning The Challenger Disaster. In 2013 he secured the series regular role of Richard Guthrie in Michael Bay's hit pirate adventure series Black Sails for Starz Entertainment. Season 1 garnered 4 Emmy nominations and 2 wins, with Michael being considered for a 2014 Emmy nomination for Outstanding Supporting Actor in a Drama Series. He returned in season 2 which premiered in over 200 countries and was once again considered for an Emmy, as well as a SAG Award. A highlight of 2015 was Michael playing the supporting role of Lester in Zentropa/Universal's western feature The Salvation for director Kristian Levring, alongside Mads Mikkelsen, Jonathan Pryce and Eva Green. He also became a permanent US resident based in Los Angeles and a member of SAG-Aftra. In 2016 he had supporting roles in feature films Dis Koue Kos Skat, Double Echo and American Girl: Lea to the Rescue, while on television he guest starred opposite Gary Sinise in CBS's Criminal Minds: Beyond Borders, Of Kings & Prophets (ABC), as well as the lead baddie role of Shane Copley in Scorpion opposite Robert Patrick on CBS. In February 2017 Michael played the lead role in the sci-fi short film Tears in the Rain which won him the Jury and Audience Best Actor Award at the SciFi Underground Film Festival in Munich, Germany. The actor went on to win Best Performance by an Actor at the Boston SciFi Film Festival for his lead protagonist role of Sam in the indie feature film Last Broken Darkness. Michael recurs on the hit Mark Wahlberg-produced conspiracy drama Shooter (USA) as Russian diplomat Grigory Krukov, opposite Ryan Phillippe and Omar Epps. He will next be seen recurring as Old Man Heart in the grindhouse series Blood Drive on Syfy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmMwZmY2ZmQtMjg5MS00YTcyLWE2OTYtZjA2OTdjYWUxYzVhXkEyXkFqcGdeQXVyMTQyOTQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0584206","name":"Sean Cameron Michael","idIMDB":"nm0584206"},"actorId":"nm0584206","character":"Lester","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carel Nel","urlProfile":"http://www.imdb.com/name/nm3317649","urlPhoto":"","biography":{"height":"6' 1\" (1.85 m)","bio":"Carel Nel is an actor, known for The Salvation (2014), Young Ones (2014) and Shepherds and Butchers (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3317649","name":"Carel Nel","idIMDB":"nm3317649"},"actorId":"nm3317649","character":"Stagecoach Whip","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kobus Swanepool","urlProfile":"http://www.imdb.com/name/nm6480443","urlPhoto":"","biography":{"bio":"Kobus Swanepool is an actor, known for The Salvation (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6480443","name":"Kobus Swanepool","idIMDB":"nm6480443"},"actorId":"nm6480443","character":"Stagecoach Gunman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Domingos","urlProfile":"http://www.imdb.com/name/nm1683753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NDM3MDYwMV5BMl5BanBnXkFtZTgwNjc0Mjk3ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"José Domingos is an actor, known for The Salvation (2014), Skin (2008) and The Deal (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NDM3MDYwMV5BMl5BanBnXkFtZTgwNjc0Mjk3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1683753","name":"José Domingos","idIMDB":"nm1683753"},"actorId":"nm1683753","character":"Mr. Raul Delgado","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2720680","urlIMDB":"http://www.imdb.com/title/tt2720680","business":{"budget":{"money":"€10,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,000","country":"USA","day":"01","month":"03","year":"2015","remarks":"2 Screens"}],"gross":[{"money":"$5,000","country":"USA","day":"01","month":"03","year":"2015","remarks":""}],"weekendGross":[{"money":"$5,000","country":"USA","day":"01","month":"03","year":"2015","remarks":"2 Screens"}],"admissions":[{"money":"50,662","country":"Denmark","day":"25","month":"06","year":"2014","remarks":""},{"money":"6,933","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus, Zeiss Ultra Prime and Angenieux Optimo Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["ARRIRAW"],"printedFilmFormat":null},"rating":"6.8","metascore":"64","filmingLocations":[{"location":"Johannesburg, South Africa"}],"rated":"R","awards":[{"award":"Almeria Western Film Festival 2016","titlesAwards":[{"titleAwardOutcome":"Won Grand Jury Award","categories":[{"category":"Best Feature","names":[{"name":"Kristian Levring","id":"nm0506290","role":"director"},{"name":"Zentropa Productions","id":null,"role":"production company"}]}]}]},{"award":"Chicago International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Audience Choice Award","categories":[{"category":"Audience Choice Award","names":[{"name":"Kristian Levring","id":"nm0506290","role":null}]}]}]},{"award":"Robert Festival 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Audience Award","categories":[{"category":"","names":[{"name":"Sisse Graum Jørgensen","id":"nm1011849","role":"producer"},{"name":"Kristian Levring","id":"nm0506290","role":"director"}]}]},{"titleAwardOutcome":"Nominated Robert","categories":[{"category":"Best Production Design (Årets scenograf)","names":[{"name":"Jørgen Munk","id":"nm6466482","role":null}]},{"category":"Best Cinematography (Årets fotograf)","names":[{"name":"Jens Schlosser","id":"nm0002854","role":null}]},{"category":"Best Costume Design (Årets kostumier)","names":[{"name":"Diana Cilliers","id":"nm0162305","role":null}]},{"category":"Best Make-Up (Årets sminkør)","names":[{"name":"Ann Elizabeth Bartels","id":"nm6480467","role":null}]},{"category":"Best Original Score (Årets score)","names":[{"name":"Kasper Winding","id":"nm0934719","role":null}]},{"category":"Best Visual Effects (Årets visuelle effekter)","names":[{"name":"Thomas Busk","id":"nm3733524","role":null},{"name":"Kim Fersling","id":"nm2548543","role":null},{"name":"Alexander Schepelern","id":"nm3645284","role":null}]}]}]}],"votes":"26,982","type":"Movie","companyCreditsSimple":[{"idCompany":"co0136662","name":"Zentropa Entertainments"},{"idCompany":"co0054508","name":"Forward Films"},{"idCompany":"co0164899","name":"Spier Films"}],"keywords":{"keywords":["vengeance","revenge","murderer","violence","rape","gang leader","1870s","dead boy","taunting","thirst","off screen sex","frontier","extortion","war veteran","ex military","mute woman","mass murder","sadist","payback","cruelty","rescue","shot to death","coffin maker","brother murdered","dead son","off screen rape","cowboy","gang","insult","rapist comeuppance","implied rape","implied sex","hunter","frontiersman","scarred","veteran","former soldier","brother brother relationship","wild west","wife","son","bloodshed","blood","multiple murder","evil man","evil","perversion","bandit","criminal","rapist","killer","killing","homicide","water","horse","mercilessness","ruthlessness","brutality","sadism","sheriff","priest","undertaker","corrupt mayor","corruption","knife","salvation","torture","scar","money","revolver","gun","shotgun","rifle","shot in the head","shot in the back","shot in the chest","shooting","rape and murder","oil derrick","fire","coffin","well","one eyed man","jail","stopping a train","safe","selling land","grandmother","murder of brother","death","dead wife","loss of wife","loss of son","drinking","stagecoach","mute","brother","shootout","oil","train","murder","small town","help","rooftop","two word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:26:44"}}