{"data":{"movies":[{"title":"Day of the Gun","originalTitle":"","year":"2013","releaseDate":"20131114","directors":[{"name":"Wayne Shipley","id":"nm1948370"}],"writers":[{"name":"Wayne Shipley","id":"nm1948370"}],"runtime":"128 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NTY3MTE1MV5BMl5BanBnXkFtZTgwMzQwMjM5OTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"An ambitious widow vows \"There will be hell to pay\" when a prominent Montana rancher puts up a barbed wire fence between their properties.","simplePlot":"An ambitious widow vows \"There will be hell to pay\" when a prominent Montana rancher puts up a barbed wire fence between their properties.","actors":[{"actorName":"Eric Roberts","urlProfile":"http://www.imdb.com/name/nm0000616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1956","placeOfBirth":" Biloxi, Mississippi, USA","birthName":"Eric Anthony Roberts","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's edgier, more intriguing characters running around and about for decades, Eric Anthony Roberts started life in Biloxi, Mississippi. He is the son of Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights. His siblings are actors Lisa Roberts Gillan and Julia Roberts, and he grew up in Atlanta, Georgia. He began his acting career at age 5 in a local theater company called the \"Actors and Writers Workshop\", founded by his late father. After his schooling at Grady High, he studied drama at age 17 in London for two years at the Royal Academy of Dramatic Arts, then returned to the States and continued his studies at the American Academy in New York. He made his NY stage debut in \"Rebel Women\" in 1976 at age 20 and appeared in regional productions, once playing the newspaper boy in a production of \"A Streetcar Named Desire\" starring Shirley Knight and Glenn Close. After appearing in such daytime soaps as Another World (1964) and How to Survive a Marriage (1974), his career began to shift fast forward when he copped a leading role in a major film. In King of the Gypsies (1978), based on Peter Maas' best-seller about a fracturing dynasty of New York City gypsies, he made his debut alongside an intimidating roster of stars including Judd Hirsch, Susan Sarandon, Shelley Winters and Sterling Hayden. Young Eric held his own expertly (winning a Golden Globe nomination) while his burning intensity and brooding charm marked sure signs of star potential. After this, he won the lead opposite Milo O'Shea in the 1980 stage production of \"Mass Appeal\". He suffered serious injuries in a car accident during his nascent film career but lost no fans by the time he returned to co-star with Sissy Spacek as a small-town stranger in Raggedy Man (1981). It was, however, his stark and frightening portrayal of two-bit hustler Paul Snider, the cast-off boyfriend who slays Playmate-turned-movie starlet Dorothy Stratten (played by Mariel Hemingway) in Star 80 (1983) that really put him on the movie map and earned him a second Golden Globe nomination. A wide range of fascinating, whacked-out roles were immediately offered to him on a silver plate. He played another dangerous streetwise hustler type in The Pope of Greenwich Village (1984) opposite fellow rebel Mickey Rourke; a cocky soda pop sales exec in the Australian comedy Coca-Cola kid (1985); appeared with more charm and restraint opposite Rosanna Arquette in the offbeat romantic comedy Nobody's Fool (1986) and topped his prolific period off with an Academy Award nomination as a young prison escapee hiding out with Jon Voight aboard an out-of-control train in the ultra-violent, character-driven action adventure Runaway Train (1985). Good things continued to happen when he was a replacement lead in the original run of \"Burn This\" and won a Theatre World Award for his 1988 Broadway debut. A risky, no-holds-barred actor, he was often guilty of overacting if given half the chance. His film career began to slide in the late 1980s, appearing in more quantity than quality pictures. A series of missteps led to unheralded appearances in such bombs as the karate-themed Best of the Best (1989); the NY urban thriller The Ambulance (1990); the action western Blood Red (1989), which took three years to release and is the only film Eric and his sister Julia Roberts appeared in together; and Rude Awakening (1989) when he filled in as a burned-out hippie opposite a Chong-less Cheech Marin. More under appreciated \"B\" filming came with the 1990s (Freefall (1994), Sensation (1994), The Nature of the Beast (1995), etc.), while also chewing the scenery with a number of mobster types in TV-movies, including one as \"Al Capone\". He soon began appearing as flashy secondary villains and creepies that showcased other stars instead, such as Final Analysis (1992) starring Richard Gere, Heaven's Prisoners (1996) top lining Alec Baldwin, and The Dark Knight (2008), part of the \"Batman\" series with Christian Bale and the late Heath Ledger. Eric's undeniable, unconventional talent would occasionally mesh with the perfect role. At the Sundance Film Festival in 1996, he received critical applause for his starring role as a man dying of AIDS in the uplifting and emotional film It's My Party (1996) and earned more honors as a writer marked for murder in the mob-themed story La Cucaracha (1998). He was also perfectly cast as one of the cold-blooded killers in the Emmy-nominated TV adaptation of Truman Capote's chiller In Cold Blood (1996). Eric continued to appear sporadically on TV in such dramatic series as Law & Order: Criminal Intent (2001), while sometimes showing a fun side as well in comedy (The King of Queens (1998)). His own series work included Less Than Perfect (2002) and, more recently, and in the cult program Heroes (2006) where promise for a longer participation ended with his character's death. Recovered from a long-standing cocaine problem, Eric wed, for the first time, actress/writer Eliza Roberts (nee Garrett). They have appeared in such films as Killer Weekend (2004) and Final Approach (2005). His daughter from a former relationship, Emma Roberts, is a newly popular and fast-rising \"tween\" actress from the series Unfabulous (2004) and has played youthful super-sleuth Nancy Drew (2007) on film. Eric's unpredictable, volatile nature which works so mesmerizing on screen has also led to troubling times off camera; his relationship with younger sis Julia Roberts has been seriously strained for quite some time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000616","name":"Eric Roberts","idIMDB":"nm0000616"},"actorId":"nm0000616","character":"Abraham Tanner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raw Leiba","urlProfile":"http://www.imdb.com/name/nm2836170","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWQ5OTg5YzctOGVlOS00MTMwLWJjMDUtNDgwOGE1ODVkZTcxL2ltYWdlXkEyXkFqcGdeQXVyNjYwMzY5Mw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Raw Leiba was born in Newark, New Jersey to a Brazilian mother and an African American/Native American father. His father Robert was a US Army Veteran and served with the famed Tuskegee Airmen in WWII and his uncle is former NY Giant hall of famer Roosevelt Brown. Leiba attended high school in Woodbridge, NJ and later moved to Tempe, Arizona where he attended Tempe High School. Possessing a 4.3 second 40 yard dash speed and a 44 inch vertical jump he soon got the attention of Arizona State University basketball assistant coach Doug Collins and Head Football coach John Cooper. He signed with Arizona State under the condition that he be allowed to play both football and basketball for the school. After graduating he went to Spain to play professional basketball for Barcelona EL of the European League where he played a full season. After being waived in his second season Leiba took an invitation to the NFL San Diego Chargers mini-camp where he impressed coaches with his tremendous speed and leaping ability. He made the \"Practice Squad\" but was soon released when he told head coach Bobby Ross that he wanted to be an actor and could no longer commit to sports. Leiba gained national attention when he won the the TLC'S reality action show Help Wanted, a spin-off of ABC TV'S The Next Action Hero, where competitors compete in acting and stunt roles. Leiba again showed his great athleticism and the guile that he is known for but coupled that with great acting ability. Raw Leiba has gone on to do major movies and motion pictures and is also one of the top Sportsmodels in the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWQ5OTg5YzctOGVlOS00MTMwLWJjMDUtNDgwOGE1ODVkZTcxL2ltYWdlXkEyXkFqcGdeQXVyNjYwMzY5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2836170","name":"Raw Leiba","idIMDB":"nm2836170"},"actorId":"nm2836170","character":"Charlie Broken Hand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"LaDon Hart Hall","urlProfile":"http://www.imdb.com/name/nm2769572","urlPhoto":"","biography":{"bio":"LaDon Hart Hall is an actress, known for Day of the Gun (2013) and One-Eyed Horse (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2769572","name":"LaDon Hart Hall","idIMDB":"nm2769572"},"actorId":"nm2769572","character":"Maggie Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Osborn","urlProfile":"http://www.imdb.com/name/nm5664704","urlPhoto":"","biography":{"bio":"Jim Osborn is an actor and producer, known for Day of the Gun (2013), Outlawed Faith (2016) and Tales of the Wild West: The Singletree Montana Bank Raid (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5664704","name":"Jim Osborn","idIMDB":"nm5664704"},"actorId":"nm5664704","character":"Cyrus McCall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Brown","urlProfile":"http://www.imdb.com/name/nm2770310","urlPhoto":"","biography":{"bio":"Jason Brown is known for his work on Juggling in Mosul (2009), Day of the Gun (2013) and One-Eyed Horse (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2770310","name":"Jason Brown","idIMDB":"nm2770310"},"actorId":"nm2770310","character":"Cy McCall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Lukowski","urlProfile":"http://www.imdb.com/name/nm4033051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTM0MDk4NF5BMl5BanBnXkFtZTgwNjI2MTQ0ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Sam Lukowski has been acting since his earliest days; beginning with musicals and school plays, Sam has performed in a wide spectrum of theatrical endeavors - cast in everything from Shakespeare to drag shows on the local MD-DC-VA-PA stage and screen. He has competed in the nation-wide acting portion of the KCACTF three years consecutively and was the head of the student theatre program, 'Masque', during his time at CCBC Essex. He later enrolled in the Acting Track at Towson University where he graduated in 2012 with a BFA degree in Acting. Sam has been a proud member of SAG-AFTRA since 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTM0MDk4NF5BMl5BanBnXkFtZTgwNjI2MTQ0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4033051","name":"Sam Lukowski","nicknames":["Spooky"],"idIMDB":"nm4033051"},"actorId":"nm4033051","character":"Ned Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erin Heilman","urlProfile":"http://www.imdb.com/name/nm5664641","urlPhoto":"","biography":{"bio":"Erin Heilman is an actress, known for Day of the Gun (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5664641","name":"Erin Heilman","idIMDB":"nm5664641"},"actorId":"nm5664641","character":"Kate Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Osborn","urlProfile":"http://www.imdb.com/name/nm5664642","urlPhoto":"","biography":{"bio":"Susan Osborn is known for her work on Day of the Gun (2013), Outlawed Faith (2016) and Tales of the Wild West: The Singletree Montana Bank Raid (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5664642","name":"Susan Osborn","idIMDB":"nm5664642"},"actorId":"nm5664642","character":"Rachel McCall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian St. August","urlProfile":"http://www.imdb.com/name/nm2475601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDdkMDFjMDUtOGNlNS00NmQwLThkOWEtZWFjZWIwY2FiNDEzL2ltYWdlXkEyXkFqcGdeQXVyMjQ0NjQyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Brian St. August is an actor, known for WNUF Halloween Special (2013), The Fixer: The Power of Balance (2011) and Reunion (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDdkMDFjMDUtOGNlNS00NmQwLThkOWEtZWFjZWIwY2FiNDEzL2ltYWdlXkEyXkFqcGdeQXVyMjQ0NjQyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2475601","name":"Brian St. August","idIMDB":"nm2475601"},"actorId":"nm2475601","character":"Simon Doubleday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John C. Bailey","urlProfile":"http://www.imdb.com/name/nm0047329","urlPhoto":"","biography":{"bio":"John C. Bailey is an actor, known for Garden of Hedon (2011), Uncertainty Principle (2010) and Exit (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0047329","name":"John C. Bailey","idIMDB":"nm0047329"},"actorId":"nm0047329","character":"Caleb Earl Bateman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Cutting","urlProfile":"http://www.imdb.com/name/nm2418520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxMTAzMzUxMF5BMl5BanBnXkFtZTgwNjM3MzQwMDE@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"bio":"Richard Cutting is continually active in leading man parts in film, television and stage projects. From the dress heavy in the recent Western, Day Of The Gun, to the lead role of urbane psychiatrist Dr. Milgram in the UFO soap opera Milgram And The Fastwalkers, Richard's performances are noted as remarkable for their hypnotic nuance, intelligence and focus. He often credits his background as a writer for his understanding of scene structure and character development. He began acting in the 1970s on stage in classics such as The Alchemist by Ben Jonson and Tom Jones at the Eugene O'Neill Theater Center. He is a screenwriter and produced playwright, as well as the executive producer of the new original TV series Milgram And The Fastwalkers, a noir soap opera about UFOs. The series has gained over 2 million episode views on the Koldcast TV Network. Richard recently finished the lead role of Owen Grey in the feature Garden Of Hedon, the latest film from horror king Kevin Kangas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxMTAzMzUxMF5BMl5BanBnXkFtZTgwNjM3MzQwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2418520","name":"Richard Cutting","idIMDB":"nm2418520"},"actorId":"nm2418520","character":"Joshua Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Alonso","urlProfile":"http://www.imdb.com/name/nm0022198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzNlODA4ZWMtZGMyMS00NDU5LTgyMmQtZWNmZDlhOGE0OGUzXkEyXkFqcGdeQXVyMjAxNzc1Njg@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1970","placeOfBirth":" Queens, New York City, New York, USA","birthName":"John-Michael deCastro Alonso","height":"5' 8\" (1.73 m)","bio":"After graduating from N.Y.U. and the Actor's Studio, Johnny Alonso has worked on countless projects that all started with a one year recurring on the soap opera All My Children as Seth. From there many gigs followed: a guest starring role on Homicide as David Scholtz, a contract speaking role on Rules of Engagement as Kurt who gets into it with Samuel L. Jackson. Johnny also booked a core guest starring lead on ABC's Growing Pains Reunion II as Mickey, and played Axe the bass playing/careless boyfriend next to Rachel Leigh Cooke in the movie Stateside. Johnny also played the core lead character Johnny Kowolski on the award winning 12 part educational PBS series Number's Alive! Alonso's was a WB/CW Network actor for 3 seasons with his 8 episode recurring role on Dawson's Creek as the snide junior stock broker Jimmy Franco, and his 6 episode guest core recurring on One Tree Hill as the fast talking band manager Joey D. Johnny was featured as a guest starring role on A Haunting as the estranged Mike Esperanza and starred in the Los Angeles film Coffin, which spotlights his skills as the dark character Trick next to actors Kevin Sorbo and Bruce Davison. In the western picture Day of the Gun Johnny plays the horse riding/off centered Charlie Chaplin type Town Mortician. Johnny just guest starred on the ID television series House of Horrors as William, one of the main kidnappers in this dark story. Currently Johnny is working on the hit FOX show Gotham as the recurring role Kazz, bass player in Penguin's house band at Oswald's Nightclub. A featured role which has planted him in seasons I and II. He has worked with director Martin Scorcese on the new HBO series The Untitled Rock and Roll Project as Gibby, bass player in a New York City rock band that transitions into punk rock 1976. Johnny's love for languages booked him as Corporal Fiato the Italian speaking soldier that translates for the American Army in the upcoming WWII History Channel documentary Disaster on Hill 772 March 28, 1943. Johnny plays Jack Pappas the pool shark hustler in the new feature Masse. You can also hear Johnny's voice over work as he guides you thru the exhibit Remember The Children as the voice of Daniel at the Smithsonian Holocaust Museum in Washington D.C. His voice has guided millions of visitors thru this Smithsonian exhibit since the museum's opening day. Alonso was also involved with the Emmy award winning show NASA 360 as one of the main hosts shooting over 30 episodes in the span of 3 seasons. This series shot all over the world. One of the coolest gigs to date. Hitting his stride this actor has worked non-stop on many other series and projects including Forbidden, the F.B.I. Files, The Passing, True Crime with Aphrodite Jones, Nightmare Next Door, Sky Mall (Fall 2014), Good People, Click on This, City of Lost Souls, Walk of Shame and the new horror picture Terrortory. Alonso is also one of the main hosts of the Emmy award winning series NASA 360.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzNlODA4ZWMtZGMyMS00NDU5LTgyMmQtZWNmZDlhOGE0OGUzXkEyXkFqcGdeQXVyMjAxNzc1Njg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0022198","name":"Johnny Alonso","idIMDB":"nm0022198"},"actorId":"nm0022198","character":"The Mortician","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathon Ruckman","urlProfile":"http://www.imdb.com/name/nm1962531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzY2Mjc3OV5BMl5BanBnXkFtZTgwNzY4MjI3NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1969","placeOfBirth":" Baltimore, Maryland, USA","birthName":"John Edward Miller Jr.","height":"6' 2\" (1.88 m)","bio":"Jonathon Ruckman was born John Edward Miller Jr. At the age of thirteen he was adopted by his mothers late husband Dean Ruckman taking his fathers last name. Jonathon spent almost twenty years doing the theater before he decide to throw his hat into the film and TV world. .Jonathon has studied under legendary acting teachers,Paul Bergman director of the famed Center Stage and the Hippodrome located Baltimore Md and Terry Schreiber famed Broadway director and owner of the Terry Schreiber School of acting in NYC..Funny he was pursuing a degree in criminal justice, for an elective he took a drama credit and he booked Big River boy was he was hooked. The first phone call landed him his first agent and a national spot for the NFL. Not bad for his first booking. Immediately after which he booked a guest starring role on Stories of the Highway patrol. Other noted performances include Corporate Affairs with Breckin Meyer, Officer McFarland on David Simons critically acclaimed The Wire, David in Safe house, Dutch Logan in One Eyed Horse, David in Sins of the Fathers and over the past ten years he has booked several hundred commercials and Indy films including Soul mate. Most recently he performed on the Discovery Channel and the Lifetime Channel. His work can be seen around the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzY2Mjc3OV5BMl5BanBnXkFtZTgwNzY4MjI3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1962531","name":"Jonathon Ruckman","idIMDB":"nm1962531"},"actorId":"nm1962531","character":"Indian Agent Frederick Lydecker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Holland","urlProfile":"http://www.imdb.com/name/nm3954873","urlPhoto":"","biography":{"bio":"Jim Holland is an actor and producer, known for B Copy (2015), Treasure in Heaven (2012) and Vindicated (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3954873","name":"Jim Holland","idIMDB":"nm3954873"},"actorId":"nm3954873","character":"Sheriff Matthew McKenna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Connie Lamothe","urlProfile":"http://www.imdb.com/name/nm2056851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTUyMTE2Ml5BMl5BanBnXkFtZTcwODkzNDczMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Constance Jean Carey","height":"5' 7½\" (1.71 m)","bio":"Connie Lamothe is an award winning filmmaker, director, producer, screenwriter, and actress. Her career began over 25 years ago in modeling and acting. She was a semi-finalist in the Mrs. Virginia Pageant and has judged many modeling and talent events. As a professional stage actress, she played the lead in the well loved comedy, \"Joey and Maria's Italian Wedding\" from 1999 to 2006. She was honored when she was asked to Direct the show after 3 years of the Washington Metropolitan area tour. During that time, Connie was also gaining film experience in films such as \"Contact\", \"Something the Lord Made\" and \"The Invasion\". She picked up leading roles in independent films such as \"The Last Mango\" and in 2007 wrote her first screenplay, \"The Driver\". Going full steam ahead, she produced and directed \"Rosie's Miracle\", which won \"Best Family Short\" in 2009 at the New York Independent International Film Festival and \"Best Director\" in 2010 at the World Music and International Film Festival in Washington, DC. Additionally, she completed her second film, \"Reunion\" which premiered in Northern Virginia in November 2010. The film followed in the footsteps of Rosie's Miracle and won \"Best Family Short\" after showing at the New York Independent International Film Festival in April of 2011. The film won Best in Sound at the World Music Independent Film Festival in August 2011 and Connie won \"Best Actress\" for her role in the film. The film was nominated for eight different awards overall. Reunion also won again in Spring 2012 at the Hot Media Film Festival with Connie as Best Director, Reunion as best Screenplay and Paul Wiedecker who played Pastor Kevin as Best Actor. In late 2011, Connie completed production on her first full feature, \"Charity\" written by Michael Brennan. The film premiered this summer at the World Music Independent Film Festival and won for Best in Sound by Italian composer Mauro Crivelli. Additionally, Ms. Lamothe won \"Best Actress\" for her role in \"Your Last Six Inches\" produced in 2011 by Daisy Lane Productions at the WMIFF as well. Ms. Lamothe appeared in a documentary produced by Corey Williams, titled The DMV Truth which premiered in October, 2012. Connie finished out the year with another two films, a western (Day of the Gun) as Georgia Lamb, and the second as \"Beth\" in Reminisce. Connie begins Winter 2013 with nominations for Best Actress in Daisy Longs Production of \"Your Last Six Inches\" and CCLProductions \"Charity\" at the Hot Media International Film Festival (Spring 2013), casting for several area films such as \"My Second First Step\" and \"Inadequate\". Additionally, Connie is under contract writing the screenplay for the novel \"La Casa Nostra\", will be producing the new dinner theatre style show, the \"Wiseguy Kitchen: Dinner With The Mob\" with Chef Big Vinny. The show will be touring the East Coast beginning this Spring 2013. Connie also continues to work behind the scenes in pre-production on her film \"The Driver\". Ms. Lamothe has her own company, CCL Productions and Talent and is working continually as a Casting Director and coach to new and young talent. Connie was the Artistic Director of Growing Stage Theatre for five years and produced over 16 musical productions with casts of children ages 4 to 18. She also is a member of the National Association of Professional Women! Connie particularly enjoys working with children and mentoring to new young talent in the industry. She also is an avid animal lover and works to protect animals from abuse","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTUyMTE2Ml5BMl5BanBnXkFtZTcwODkzNDczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2056851","name":"Connie Lamothe","idIMDB":"nm2056851"},"actorId":"nm2056851","character":"Georgia Lamb","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2900182","urlIMDB":"http://www.imdb.com/title/tt2900182","business":{"budget":{"money":"$150,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 8 min (128 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.0","filmingLocations":[{"location":"Jessup, Maryland, USA"}],"awards":[],"votes":"19","type":"Movie","companyCreditsSimple":[{"idCompany":"co0210596","name":"One-Eyed Horse Productions"}],"keywords":{"keywords":["montana","maryland","western filmmaking","western u.s.","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:29:46"}}