{"data":{"movies":[{"title":"Metal's Darkside Vol 2: The Deeply Disturbed","originalTitle":"","year":"2005","releaseDate":"20050619","directors":[{"name":"Jen Barlow","id":"nm5708472"}],"writers":[{"name":"Jasmin St. Claire","id":"nm0820580"}],"countries":["USA"],"languages":["English"],"genres":["Music"],"simplePlot":"","actors":[{"actorName":"Jasmin St. Claire","urlProfile":"http://www.imdb.com/name/nm0820580","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU0MDgxMl5BMl5BanBnXkFtZTgwMTk2MTAzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1970","placeOfBirth":" St. Croix, U.S. Virgin Islands","birthName":"Rhea Alexandra DeVlugt","height":"5' 7\" (1.7 m)","bio":"Jasmin St. Claire shot to fame as \"America's Most Controversial Sex Symbol\" after appearing in the top-selling adult films of the late 1990s. She created an outlaw rock star image that at times scandalized the adult industry. Her acerbic humor and willingness to mock her own porn stardom made her one of the highest rated guests on Howard Stern's radio show and related broadcasts for E! Entertainment. St. Claire's first mainstream appearances were in significant comic roles in Communication Breakdown and in National Lampoon Dorm Daze 2. More recently, while studying in Bill O'Leary's Acting Workshop, St. Claire has turned to dramatic roles in thrillers like Angel of Reckoning and the talked about sci-fi drama Trial Run. St. Claire is often cast in ethnically ambiguous roles, or as Italian or Middle Eastern, but she identifies as a Latina due to her mixed Northern European and Brazilian ancestry. St. Claire's background is almost entirely at odds with her early adult-film career. She was born Rhea De Vlugt in the U.S. Virgin Islands. Her father, from Holland, operated a food distribution company. Her mother was a U.S.-educated lawyer, originally from Brazil. St. Claire grew up on Manhattan's Upper westside and attended the Lycee Francais and McBurney School, whose alumni include Henry Winkler and J.D. Salinger. St. Claire graduated from Brooklyn Friends School at age 16, with honors for her work in the pioneering \"Art without Walls\" tutoring program for inner city youth. Upon graduation from Columbia University, St, Claire became a financial consultant at S. G. Warburg (then, a division of Swiss Bank.). But while in a physically abusive relationship with a prominent Manhattan lawyer (whom St. Claire later outed in an interview with Howard Stern), she began a secret life as a topless dancer at Manhattan's infamous KitKat Club, then at Flashdancers. St. Claire entered the adult industry on a dare. Invited on the Jerry Springer Show for a scripted role as antagonistic stripper, St. Claire invented her larger-than-life \"Jasmin St. Claire\" persona. St. Claire's flare for theater and controversy marked her ascent in the adult film world. She polarized the industry by calling porn films \"by and large, disgusting and brainless.\" But she quickly dethroned Jenna Jameson as America's top-selling porn star, and became the first Latina to surpass traditional blond porn star archetypes when her films achieved number one sales position in 1998. She was inducted in AVN's \"Hall of Fame\" as one of the greatest porn stars of all time. St. Claire was among the first adult performers to be merchandized as an action figure and to star in an adult comic book series. At the height of her porn stardom, St. Claire was the subject of critical essays by David Foster Wallace and Evan Wright. She also served as inspiration for Chuck Palahniuk's novel Snuff, in which she appears as a character. For all the controversy she engendered, St. Claire only spent three years in the adult business and made just over two dozen films. In 1999, she retired. She never made an adult film again, though compilations of old footage re-released under new titles continued to be sold through the 2000s. St. Claire pushed herself to new extremes by becoming a pro-wrestler. In 1998 the Dudley Boyz invited her to appear in the ECW's Living Dangerously pay-per-view event. St. Claire subsequently trained under Sue Sexton and Mando Guerrero, then worked with wrestling legend Jimmy Lawler in the Memphis Championship and in the XWF and NWA-TNA. St. Claire often played the role of \"manager,\" who would enter the ring and fight alongside wrestlers. In real life, St. Claire created the upstart federation 3PW becoming the first female owner ever to operate and promote a wrestling league, five years before Stephanie McMahon took the reigns of the WWE. St. Claire closed the doors to 3PW in 2005. St. Claire became a heavy-metal journalist and on-air personality with the launch of the Metals Darkside series in 2004, which she also produced. Her interest in heavy metal stretches back to the first Black Sabbath show she attended at Madison Square Garden when she was nine. In 1998 she became the first female to emcee March Metal Meltdown in New Jersey, helping to introduce Sepultura to a North American audience. Through the mid-2000s St. Claire served as a veejay for The Metal Scene TV Show, AOL Noisecreep, Inferno TV and Stay Heavy TV, while writing articles as a contributor to Yahoo News and Guitar Player. She also served as a spokesmodel for B.C. Rich Guitars, Coffin Case, Krank Amplifiers and licensed her likeness to Guitar Hero for a controller made by Peavey. St. Claire returned to acting 2013 in a series of dramatic roles, portraying an FBI agent in Army of the Damned and hardened street criminal in Grand Auto Theft. Continuing intensive studies under Bill O' Leary, she has recently been cast in significant roles in Celebrapy, Angel of Reckoning and Blue Suede.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU0MDgxMl5BMl5BanBnXkFtZTgwMTk2MTAzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0820580","name":"Jasmin St. Claire","idIMDB":"nm0820580"},"actorId":"nm0820580","character":"Herself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2955742","urlIMDB":"http://www.imdb.com/title/tt2955742","business":{"budget":{"money":"$25,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":null,"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[],"awards":[],"type":"Video","companyCreditsSimple":[{"idCompany":"co0298229","name":"Cleopatra Records"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:08:41"}}