{"data":{"movies":[{"title":"The Scorpion King 4: Quest for Power","originalTitle":"The Scorpion King: The Lost Throne","year":"2015","releaseDate":"20150106","directors":[{"name":"Mike Elliott","id":"nm0254291"}],"writers":[{"name":"Michael D. Weiss","id":"nm0919115"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNjg5NDM4NF5BMl5BanBnXkFtZTgwNzk5NTc5MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Fantasy"],"plot":"When he is betrayed by a trusted friend, Mathayus must marshal all his strength and cunning to outwit a formidable opponent who will stop at nothing to unlock a supreme ancient power.","simplePlot":"When he is betrayed by a trusted friend, Mathayus must marshal all his strength and cunning to outwit a formidable opponent who will stop at nothing to unlock a supreme ancient power.","actors":[{"actorName":"Victor Webster","urlProfile":"http://www.imdb.com/name/nm0005543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTA3NjQ4N15BMl5BanBnXkFtZTgwNDExMjAwMjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1973","placeOfBirth":" Calgary, Alberta, Canada","birthName":"Victor H. Webster","height":"6' 5\" (1.96 m)","bio":"Victor Webster was born in Calgary, Alberta, Canada. In the summer of 1973 Victor and his family moved to San Clemente, Ca. where he attended high school. After graduation he attended Saddleback Junior College, and then went on to become a stockbroker. He later owned and operated an import/export company, and then slowly transitioned into acting after moving to Los Angeles in 1998. Victor holds a black belt in Tae Kwon Do and has taught and competed in many forms of martial arts. He holds an undefeated record as a heavyweight in both Tae Kwon Do competition and amateur kickboxing. He has appeared in People Magazine and was named one of the \"50 Most Eligible Bachelors\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTA3NjQ4N15BMl5BanBnXkFtZTgwNDExMjAwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005543","name":"Victor Webster","idIMDB":"nm0005543"},"actorId":"nm0005543","character":"Mathayus","urlCharacter":"http://www.imdb.com/character/ch0002680","main":true},{"actorName":"Ellen Hollman","urlProfile":"http://www.imdb.com/name/nm1712005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTI0MDk3OF5BMl5BanBnXkFtZTgwOTIyNjIwOTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Ellen Hollman is an actress, known for Spartacus: War of the Damned (2010), Into the Badlands (2015) and NCIS (2003). She has been married to Stephen Dunlevy since August 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMTI0MDk3OF5BMl5BanBnXkFtZTgwOTIyNjIwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1712005","name":"Ellen Hollman","nicknames":["El"],"idIMDB":"nm1712005"},"actorId":"nm1712005","character":"Valina Reskov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Kemp","urlProfile":"http://www.imdb.com/name/nm0962261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgxMzU1NjA0MF5BMl5BanBnXkFtZTgwNDQ2NzE0NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1977","placeOfBirth":" Hertfordshire, England, UK","birthName":"William Kemp","height":"5' 11\" (1.8 m)","bio":"Will Kemp comes from an English family, including one brother and one sister. His father is a graphic designer and his mother is a former model. At age 9, Will's mother suggested that he take up a new hobby and attend dance classes. Dancing turned out to be his God-given talent! Eventually, hard work with Elizabeth Harrison FISTD earned Will a place into the Royal Ballet Seniors and later the Royal Ballet Upper Class. Finally, at age 17, Will auditioned for Matthew Bourne's impressive dance company, Adventures in Motion Pictures (AMP), and was accepted. Will then was cast for the original showing of Swan Lake, working his way up to the lead role of the Swan. During a performance as the Swan, Will was spotted by Paramount Studio head, Sherry Lansing - immediately, she \"was so smitten by his performance\" that she dubbed him the \"James Dean of Ballet\". Matthew Bourne continued to involve Will in his works, including Cinderella, Spitfire, The Car Man, and Play Without Words. In fact, as the lead role of the Pilot in Cinderella, he was nominated for a Los Angeles Critics Drama Award for Outstanding Featured Performer. In 2002, Will became a sensational hit when shakin' his booty in a GAP campaign for loose-fitted jeans \"For Every Generation\". In 2004, Will made his big screen debut in 'Stephen Sommer''s monster thriller, Van Helsing (2004), as the Werewolf. Up next is Renny Harlin's Profession profiler (2004), where Will plays an FBI trainee trying to solve a mock crime. As we look forward to seeing Will on the silver screen, he still pursues his dancing career onstage in England, managing both dancing and acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgxMzU1NjA0MF5BMl5BanBnXkFtZTgwNDQ2NzE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0962261","name":"Will Kemp","nicknames":["James Dean of Ballet"],"idIMDB":"nm0962261"},"actorId":"nm0962261","character":"Drazen","urlCharacter":"http://www.imdb.com/character/ch0466968","main":true},{"actorName":"Barry Bostwick","urlProfile":"http://www.imdb.com/name/nm0000960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1945","placeOfBirth":" San Mateo, California, USA","birthName":"Barry Knapp Bostwick","height":"6' 4\" (1.93 m)","bio":"Tall (6' 4\"), agile, energetic, and ever-so-confident as both actor and singer, especially on the award-winning Broadway stage, Barry Bostwick possesses that certain narcissistic poise, charm and élan that reminds one instantly (and humorously) of a Kevin Kline -- both were quite brilliant in their respective interpretations of The Pirate King in \"The Pirates of Penzance\". Yet, for all his diverse talents (he is a Golden Globe winner and was nominated for the Tony Award three times, winning once), Barry is indelibly caught in a time warp. Even today, 35 years after the fact, he is indelibly associated with the role of nerdy hero Brad Majors in the midnight movie phenomena The Rocky Horror Picture Show (1975). While it is extremely flattering to be a part of such a cult institution, Barry's acting legacy deserves much more than this. He was born Barry Knapp Bostwick on February 24, 1945, in San Mateo, California, one of two sons of Elizabeth \"Betty\" (Defendorf) and Bud Bostwick (Henry Bostwick), a city planner and actor. A student at San Mateo High School, he and his elder brother Peter use to put on musicals and puppet shows for the neighborhood kids. Barry attended San Diego's United States International University's School for the Performing Arts in 1967, and switched from music to drama during the course of his studies. He also worked occasionally as a circus performer, which would come in handy on the musical stage down the line. He subsequently moved to New York and attended the Graduate School of Arts and Sciences at New York University. Making his stage debut at age 22 in a production of \"Take Her, She's Mine,\" Barry performed in a number of non-musical roles in such productions of \"War and Peace\" (1968) and \"The Misanthrope (1968). Making his 1969 Broadway debut in \"Cock-a-Doodle Dandy\", which ran in tandem with \"Hamlet\" in which he was featured as Osric, it was his portrayal of the swaggering, leather jacket-wearing 50s \"bad boy\" Danny Zuko in the 1972 Broadway high-school musical smash \"Grease\" that put Barry's name prominently and permanently on the marquee signs. Originating the role, he was nominated for a Tony but lost out that year to the older generation (Phil Silvers for \"A Funny Thing Happened...\"). In the midst of all this star-making hoopla, Barry was also breaking into films with a minor role in Jennifer on My Mind (1971) and leading parts in the comedy spoofs Road Movie (1974) and The Wrong Damn Film (1975). It all paled after winning the role as Susan Sarandon's simp of a boyfriend in the The Rocky Horror Picture Show (1975), which featured a delicious Tim Curry camping it up as a transvestite monster-maker. The movie, based on the macabre 1973 British stage musical \"The Rocky Horror Show,\" packed the midnight movie houses with costumed fans replicating every move and, word and offering puns and props aplenty in recapturing the insanity of the show. While the \"Rocky\" association hit like a tornado, Barry ventured on and tried to distance himself. He created sparks again on Broadway, garnering a second Tony nomination for the comedy revival \"They Knew What They Wanted\" in 1976. He finally took home the trophy the following year for the musical \"The Robber Bridegroom\" (1977), which relied again on his patented bluff and bravado as a Robin Hood-like hero. Following top roles in the musicals \"She Loves Me\" and \"The Pirates of Penzance\", Barry turned rewardingly to film and TV. The two-part feature Movie Movie (1978), which played like an old-style double feature, was a great success, performing alongside esteemed actor George C. Scott. Barry excelled in both features, but especially the musical parody. He fared just as well on the smaller screen in TV movies, playing everything from historical icons (George Washington) to preening matinée idols (John Gilbert), and winning a Golden Globe for his role as a military officer in the epic miniseries War and Remembrance (1988). A variety of interesting roles followed in glossy, soap-styled fare, farcical comedies and period drama. A welcomed return to Broadway musicals in the form of \"Nick & Nora\" (he as sleuth Nick \"The Thin Man\" Charles) was marred when the glitzy production folded after only nine perfs. Instead, the prematurely grey-haired actor found steadier success in sitcoms as a smug comedy foil to Michael J. Fox playing Mayor Randall Winston for six seasons in Spin City (1996). He later enjoyed a recurring role as a dauntless attorney on Law & Order: Special Victims Unit (1999). Then again, Barry could be spotted pitching items in commercials or hamming it up in family-oriented Disneyesque entertainment in the \"Parent Trap\" and \"101 Dalmatian\" mold. In 1997, Bostwick was diagnosed with prostate cancer, and 10 days later had his prostate removed. The operation was successful and in 2004, he won the Gilda Radner Courage Award from the Roswell Park Cancer Institute. Just a year earlier he appeared on an episode of \"Scrubs\" as a patient also having prostate cancer. Barry married somewhat late in life. For a brief time he was wed to actress Stacey Nelkin (1987-1991), but has since become a father of two, Brian and Chelsea, with second wife Sherri Jensen Bostwick, an actress who appeared with Barry in the TV movie Praying Mantis (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000960","name":"Barry Bostwick","idIMDB":"nm0000960"},"actorId":"nm0000960","character":"Sorrell Reskov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rutger Hauer","urlProfile":"http://www.imdb.com/name/nm0000442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1944","placeOfBirth":" Breukelen, Utrecht, Netherlands","birthName":"Rutger Oelsen Hauer","height":"6' 1½\" (1.87 m)","bio":"Blonde, blue-eyed, tall and handsome Dutch actor Rutger Hauer has an international reputation for playing everything from romantic leads to action heroes to sinister villains. Hauer was born in Breukelen, a town in the province of Utrecht, the Netherlands. He is the son of Teunke (Mellema) and Arend Hauer, both actors. Because his parents were often touring, he and his three sisters were raised by a nanny. A bit of a rebel during his childhood, he chafed at the rules and rigors of school and was often getting into mischief. His grandfather had been the captain of a schooner and at age 15, Hauer ran away to work on a freighter for a year. Like his great-grandfather, Hauer is color-blind, which prevented him from furthering his career as a sailor. Upon his return he attended night school and started working in the construction industry. When he again bombed at school, his parents enrolled him in drama classes. Fancying himself a poet, he spent most of his time writing poetry and hanging out in Amsterdam coffee houses instead of studying. He was expelled for poor attendance and afterward spent a brief period in the Dutch navy. Deciding he didn't like military life, he convinced his superiors that he was mentally unfit and was sent to a special home for psych patients. It was an unpleasant place, but Hauer remained there until he convinced his ranking officers that the military really did not need him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000442","name":"Rutger Hauer","nicknames":["The Dutch Paul Newman"],"idIMDB":"nm0000442"},"actorId":"nm0000442","character":"King Zakkour","urlCharacter":"http://www.imdb.com/character/ch0466964","main":true},{"actorName":"Michael Biehn","urlProfile":"http://www.imdb.com/name/nm0000299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTI1MTEyOV5BMl5BanBnXkFtZTcwMzM5NTQ4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1956","placeOfBirth":" Anniston, Alabama, USA","birthName":"Michael Connell Biehn","height":"6' (1.83 m)","bio":"Michael Connell Biehn was born on July 31, 1956 in Anniston, Alabama, to Marcia (Connell) and Don Biehn, a lawyer. He grew up in Lincoln, Nebraska, and at age 14 moved with his family to Lake Havasu, Arizona, where he won a drama scholarship to the University of Arizona. He left prematurely two years later to pursue an acting career in Hollywood. His first big role was as a psychotic fan stalking Lauren Bacall in The Fan (1981) and later appeared in The Lords of Discipline (1983). He hit the big-time when he was cast as Kyle Reese, the man sent back through time to stop Arnold Schwarzenegger in James Cameron's The Terminator (1984). This established a good working relationship with Cameron, a relationship that should have catapulted Biehn to international stardom. He starred in Cameron's subsequent films, Aliens (1986) and The Abyss (1989), the latter a standout performance as unstable Navy SEAL officer Lt. Hiram Coffey. In the 1990s he starred in films like Navy Seals (1990), K2 (1991) and was particularly memorable as Johnny Ringo in Tombstone (1993). Biehn is married and the father of four sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTI1MTEyOV5BMl5BanBnXkFtZTcwMzM5NTQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000299","name":"Michael Biehn","nicknames":["Mike","Mick"],"idIMDB":"nm0000299"},"actorId":"nm0000299","character":"King Yannick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"M. Emmet Walsh","urlProfile":"http://www.imdb.com/name/nm0001826","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjgyNzgwMl5BMl5BanBnXkFtZTcwODA2MTM0OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1935","placeOfBirth":" Ogdensburg, New York, USA","birthName":"Michael Emmet Walsh","height":"5' 10\" (1.78 m)","bio":"Wonderfully talented, heavyset character actor (from New York, but regularly playing Southerners) M. Emmet Walsh has made a solid career of playing corrupt cops, deadly crooks, and zany comedic roles since the early 1970s. Michael Emmet Walsh was born in Ogdensburg, to Agnes Katharine (Sullivan) and Harry Maurice Walsh, a customs agent. He is of Irish descent. Walsh first appeared in a few fairly forgettable roles both on TV and onscreen before cropping up in several well remembered films, including a courtroom police officer in What's Up, Doc? (1972), as the weird Dickie Dunn in Slap Shot (1977), and as a loony sniper hunting Steve Martin in The Jerk (1979). On-screen demand heated up for him in the early 1980s with attention-grabbing work in key hits, including Brubaker (1980), Reds (1981), and as Harrison Ford's police chief in the futuristic thriller Blade Runner (1982). Walsh then turned in a stellar performance as the sleazy, double-crossing private detective in the Joel Cohen and Ethan Coen film noir Blood Simple. (1984), and showed up again for the Coens as a loud-mouthed sheet-metal worker bugging Nicolas Cage in the hilarious Raising Arizona (1987). As Walsh moved into his fifties and beyond, Hollywood continued to offer him plenty of work, and he has appeared in over 50 movies since passing the half-century mark. His consistent ability to turn out highly entertaining portrayals led film critic Roger Ebert to coin the \"Stanton-Walsh Rule,\" which states that any film starring Walsh or Harry Dean Stanton has to have some merit. And the \"M\" stands for Michael!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjgyNzgwMl5BMl5BanBnXkFtZTcwODA2MTM0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001826","name":"M. Emmet Walsh","idIMDB":"nm0001826"},"actorId":"nm0001826","character":"Gorak","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Royce Gracie","urlProfile":"http://www.imdb.com/name/nm1105254","urlPhoto":"","biography":{"dateOfBirth":"12 December 1966","placeOfBirth":" Rio de Janeiro, Brazil","height":"6' 1\" (1.85 m)","bio":"Royce Gracie, of the legendary Gracie family, is one of the most prolific and influential MMA fighters in history. He became an 'underdog' hero while changing the landscape of combat sports and revolutionizing martial arts forever. After winning the first UFC Tournament(s) (UFC1, UFC2, UFC4), he proved that with the knowledge of his father's fighting style (Brazilian Jiu Jitsu) a \"David\" could beat a \"Goliath\". Royce is the only fighter in history to defeat four opponents in the same night; unlike today, these tournaments had no weight divisions, no time limits and no real rules. In Brazil they were called \"Vale Todo\" in America it became 'no-holds-barred' and was quickly ruled illegal throughout most of the U.S. In 2003, Royce was the first fighter inducted into the UFC Hall of Fame. His record of 'victories via submissions' remain untouched. Today he's considered an icon, a pioneer, and \"The Godfather\" of a sport that will be celebrating it's 20th anniversary, November 12th 2013.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1105254","name":"Royce Gracie","idIMDB":"nm1105254"},"actorId":"nm1105254","character":"Anngar","urlCharacter":"http://www.imdb.com/character/ch0466963","main":true},{"actorName":"Leigh Gill","urlProfile":"http://www.imdb.com/name/nm5279916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzE3NjM0M15BMl5BanBnXkFtZTgwMzM1MTg4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"4' (1.22 m)","bio":"Leigh Gill is an actor, known for The Scorpion King 4: Quest for Power (2015), Butterfly Kisses (2017) and Get Santa (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzE3NjM0M15BMl5BanBnXkFtZTgwMzM1MTg4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5279916","name":"Leigh Gill","idIMDB":"nm5279916"},"actorId":"nm5279916","character":"Chief Onus","urlCharacter":"http://www.imdb.com/character/ch0466975","main":true},{"actorName":"Esmé Bianco","urlProfile":"http://www.imdb.com/name/nm2657974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNDQxNDU4N15BMl5BanBnXkFtZTgwNDA5MDUxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1982","placeOfBirth":" St. Albans, Hertfordshire, England, UK","height":"5' 8\" (1.73 m)","bio":"British-born Esmé Bianco is an internationally-acclaimed actress and performer, best-known for her role as \"Ros\" in the Emmy Award-winning show, Game of Thrones (2011). Degree-educated in Drama and Theatre Arts at London's Goldsmiths University; Bianco's acting career started with performances in music videos for the likes of Robbie Williams and Slayer, and UK television appearances on BBC and Channel 4; before she was cast as \"Ros\" in the pilot episode of HBO's \"Game of Thrones\". Although originally cast in the pilot for only one scene opposite Peter Dinklage, Bianco's talent spoke volumes and changed the course of the series. Astounded by her single performance, executives boldly swayed from the books on which \"Game of Thrones\" is based, turning \"Ros\", a one-time guest star fabricated for the pilot into a series regular. Interestingly, after getting the series green light, the original pilot episode was totally re-shot with the exception of Bianco's first scene with Dinklage; a scene which garnered her a three-season run. \"Game of Thrones\" secured her a loyal fan base across the globe and her popularity continues to grow along with her rising film career. Bianco has enjoyed a successful modeling career, fronting campaigns for luxury lingerie brands, such as Agent Provocateur, Modern Courtesan and Atsuko Kudo, and has traveled the world with her burlesque and cabaret shows, creating high octane performances for the likes of Sting, the Monte Carlo Grand Prix, W hotel, Ministry of Sound and Vanity Fair. She recently relocated to Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNDQxNDU4N15BMl5BanBnXkFtZTgwNDA5MDUxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2657974","name":"Esmé Bianco","idIMDB":"nm2657974"},"actorId":"nm2657974","character":"Feminina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eve Torres","urlProfile":"http://www.imdb.com/name/nm2991156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTA0ZWVkZGYtYzk2NC00YjI1LTkxNWMtMzdmMTdlNjY5MTU4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1984","placeOfBirth":" Denver, Colorado, USA","birthName":"Eve Marie Torres","height":"5' 7\" (1.7 m)","bio":"Eve Torres was born on August 21, 1984 in Denver, Colorado, USA as Eve Marie Torres. She is an actress, known for WWE Raw (1993), WWE Smackdown! (1999) and Night of Champions (2012). She has been married to Rener Gracie since April 13, 2014. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTA0ZWVkZGYtYzk2NC00YjI1LTkxNWMtMzdmMTdlNjY5MTU4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2991156","name":"Eve Torres","nicknames":["Evie","Evelicious"],"idIMDB":"nm2991156"},"actorId":"nm2991156","character":"Chancara","urlCharacter":"http://www.imdb.com/character/ch0466972","main":true},{"actorName":"Brandon Hardesty","urlProfile":"http://www.imdb.com/name/nm2799927","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxOTY1ODExN15BMl5BanBnXkFtZTgwMzU1ODYzMDI@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1987","placeOfBirth":" Baltimore, Maryland, USA","height":"6' (1.83 m)","bio":"Brandon Hardesty was born in Baltimore, MD on April 13th, 1987. He attended Baltimore Lutheran School and in his 6th year he was asked by his English teacher to be in the school play. He performed in two plays: The Crucible and George Washington Slept Here. After graduating, he attended Stevenson University and Towson University, majoring in film. In 2006, when YouTube first gained popularity, Hardesty made videos in his parents' basement. The videos depicted Hardesty reenacting his favorite scenes from movies. They quickly grew in popularity, and in 2007, Hardesty had one of his videos featured in a Geico commercial. In late 2007, Hardesty was contacted by a film producer who had seen one of his videos. He asked him to audition for an independent film: Bart Got A Room, starring William H. Macy and Cheryl Hines. Hardesty got the part, and subsequently got representation. In early 2008, Hardesty made five consecutive appearances on Jimmy Kimmel Live featuring his own reenactments of the five Best Picture nominees that year. After that, stayed on the east coast and worked in a grocery store until he got a lead role in American Pie Presents: The Book Of Love, as well as a supporting role in Bucky Larson: Born To Be A Star. Hardesty has lived bicoastally in Los Angeles, CA and Baltimore, MD ever since. He continues to make YouTube videos, but his focus has mostly been on auditioning for roles in feature films and television shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxOTY1ODExN15BMl5BanBnXkFtZTgwMzU1ODYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2799927","name":"Brandon Hardesty","idIMDB":"nm2799927"},"actorId":"nm2799927","character":"Boris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rodger Halston","urlProfile":"http://www.imdb.com/name/nm0356056","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjQ4Njc4Nl5BMl5BanBnXkFtZTgwOTUwMDg1MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Rodger Halston was raised on a ranch in Oregon. He comes from a family of artist and performers. Starting at age four Rodger was singing with his dad at conventions. He has been an artist his entire life. In the 1990's Rodger dropped out of college and moved to Los Angeles to pursue acting full time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjQ4Njc4Nl5BMl5BanBnXkFtZTgwOTUwMDg1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356056","name":"Rodger Halston","idIMDB":"nm0356056"},"actorId":"nm0356056","character":"Roland","urlCharacter":"http://www.imdb.com/character/ch0466973","main":true},{"actorName":"Grant Elliott","urlProfile":"http://www.imdb.com/name/nm2452366","urlPhoto":"","biography":{"bio":"Grant Elliott is an actor, known for Smokin' Aces 2: Assassins' Ball (2010), Beethoven's Big Break (2008) and The Scorpion King 4: Quest for Power (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2452366","name":"Grant Elliott","idIMDB":"nm2452366"},"actorId":"nm2452366","character":"Lavarta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lou Ferrigno","urlProfile":"http://www.imdb.com/name/nm0002073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTcwNjQzNV5BMl5BanBnXkFtZTYwNDI0MzM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1951","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Louis Jude Ferrigno","height":"6' 4\" (1.93 m)","bio":"An internationally famous and well respected bodybuilder / actor, Lou Ferrigno first appeared on TV screens in 1977 as the musclebound The Incredible Hulk (1978), the alter ego of meek scientist Bruce Banner. Ferrigno was born in Brooklyn, New York, in 1951 and as a child suffered from an ear infection that resulted in permanent partial hearing loss. Undeterred by what some may have perceived as a disadvantage, Lou threw himself into athletics (predominantly weightlifting and body building) and at the age of 21 won his first Mr. Universe title. For good measure, he came back and won it again the following year! He also played professional football in the Canadian Football League, before coming to the attention of producer Kenneth Johnson, who was seeking just the right person to portray on screen the comic book superhero, The Incredible Hulk. With his 6' 5\", 285 lb. frame, Lou was the biggest professional bodybuilder of the time, and had recently starred in the documentary Pumping Iron (1977), about the 1975 Mr. Olympia contest in South Africa. He successfully auditioned for the part of the green-skinned Goliath, and that is the role with which he is most closely identified. \"The Hulk\" was a huge ratings success and spawned several telemovies after the initial TV series completed its run. Lou continued to remain busy in films and TV with appearances often centered around his remarkable physique. His films included Hercule (1983), Sinbad of the Seven Seas (1989) and Frogtown II (1992). Lou has additionally guest-starred on several TV shows including The Fall Guy (1981) and The New Mike Hammer (1984) and had a recurring role on The King of Queens (1998). In 1997 he was featured in the dynamic documentary about his sensational return to professional bodybuilding at age 43, Stand Tall (1997). The film detailed how he returned to compete in the Masters category of the Mr. Olympia contest against several familiar bodybuilding foes. In more recent years, he has appeared in several films, including The Misery Brothers (1995), Ping! (2000), From Heaven to Hell (2002) and a cameo as a security guard in the big-budget remake of Hulk (2003). Big Lou is also a successful author with two books detailing his bodybuilding knowledge, and his life behind the scenes playing the Incredible Hulk on TV in the 1970s, plus he has a popular website frequented by his many fans worldwide.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTcwNjQzNV5BMl5BanBnXkFtZTYwNDI0MzM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002073","name":"Lou Ferrigno","nicknames":["Big Louie","Hulk"],"idIMDB":"nm0002073"},"actorId":"nm0002073","character":"Skizurra","urlCharacter":"http://www.imdb.com/character/ch0466966","main":true}],"seasons":[],"idIMDB":"tt3086386","urlIMDB":"http://www.imdb.com/title/tt3086386","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"26","month":"08","year":"2013","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.2","filmingLocations":[{"location":"Rasnov, Romania"}],"rated":"PG-13","awards":[],"votes":"1,738","type":"Video","companyCreditsSimple":[{"idCompany":"co0009722","name":"Capital Arts Entertainment"},{"idCompany":"co0359888","name":"Universal 1440 Entertainment"}],"keywords":{"keywords":["martial arts","tough girl","tough guy","female warrior","female fighter","scantily clad female","blonde woman","ends with a kiss","sword and sandal","sword and sorcery","sword and fantasy","disarming someone","mixed martial arts","action hero","warrior","bow and arrow","quest","cave","forest","sword fighting","female martial artist","bar","violence","female in bra and panties","long blonde hair","blonde","catfight","bar fight","fistfight","dragon","flying","skeptic","scientist","science","magic","kingdom","king","queen","feast","kiss","love interest","stick fight","humor","axe fight","battle axe","spear","sword fight","escape","hand to hand combat","opening action scene","scene during end credits","sword","no opening credits","fourth part","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:15:37"}}