{"data":{"movies":[{"title":"La chambre interdite","originalTitle":"The Forbidden Room","year":"2015","releaseDate":"20151216","directors":[{"name":"Guy Maddin","id":"nm0534665"},{"name":"Evan Johnson","id":"nm2829262"}],"writers":[{"name":"Guy Maddin","id":"nm0534665"},{"name":"Evan Johnson","id":"nm2829262"}],"runtime":"130 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTkyNjE4OF5BMl5BanBnXkFtZTgwMzU3MTQwNzE@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Comedy","Mystery"],"plot":"A never-before-seen woodsman mysteriously appears aboard a submarine that's been trapped deep under water for months with an unstable cargo. As the terrified crew make their way through the corridors of the doomed vessel, they find themselves on a voyage into the origins of their darkest fears.","simplePlot":"A never-before-seen woodsman mysteriously appears aboard a submarine that's been trapped deep under water for months with an unstable cargo. As the terrified crew make their way through the... ","actors":[{"actorName":"Roy Dupuis","urlProfile":"http://www.imdb.com/name/nm0001163","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUwMjg0ODk0Ml5BMl5BanBnXkFtZTcwMjk4MTY2Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1963","placeOfBirth":" New Liskeard, Ontario, Canada","birthName":"Roy Michael Joseph Dupuis","height":"5' 11\" (1.8 m)","bio":"Roy Dupuis was born on April 21, 1963, in New Liskeard, Ontario. He spent a significant portion of his childhood (from early infancy until he was eleven years old) in Amos, which is in a region of Québec called Abitibi. For the next three years, he lived in Kapuskasing, Ontario, where he learned to speak English. His father (now deceased) was a traveling salesman for Canada Packers, a meat company (now part of Maple Leaf Foods). His mother is a piano teacher. He has a younger brother and an older sister. When he was fourteen, after his parents divorced, his mother moved the family to Sainte-Rose, Laval, Québec (in the greater Montréal area), where he finished high school. After high school, he studied acting in Montréal, at the National Theatre School of Canada (L'École nationale de théâtre du Canada), graduating in 1986. Acting was not Roy Dupuis' first career choice. He was studying physics in high school, but seeing Ariane Mnouchkine's film Molière (1978) interested him in acting. His entry into drama school was accidental. A friend had been invited to audition for admission to the National Theatre School of Canada, but her counterpart, who had also been invited to audition, changed his mind and backed out. She asked Roy Dupuis to take his place, and he agreed to help out and went along, posing as the original candidate. Although he himself was not really the one invited to audition, he impressed the school's director so much that she invited him to apply formally for admission to the school, and he was accepted. After his graduation in 1986, and a few years of successful experience acting in the theater, in 1988, he began to be offered substantial roles in films and TV. The relative anonymity that he enjoyed during those early years ended when 80% of the population of Québec watched the enormously-popular classic period serial drama Les filles de Caleb (1990) (Emilie), turning him into a celebrity overnight and gaining him several awards for his performance as Emilie's husband, Ovila Pronovost. His next major role was as a journalist in the Canadian TV series Scoop (1992), which ran for four seasons (1991 until 1995). In 1991 Dupuis also starred in his first major film role, as the gay hustler, Yves, in Jean Beaudin's internationally acclaimed Being at Home with Claude (1992), which was Canada's official selection at the 1992 Cannes Film Festival. Other leading roles in French followed, and increasingly English language roles too, including Becker in Planète hurlante (1995), his entry into mainstream US cinema. For the next five years, from 1996 to 2000, he spent most of his time in Toronto, making the TV series Nikita (1997-2001), which was shown in more than 50 countries around the world. When the final season finished production at the end of 2000, Roy returned to Montréal, for a few months' rest, before starting work again on French-Canadian projects made closer to home. The TV mini-series Le dernier chapitre (2002), about biker gang warfare, was filmed in French and English versions simultaneously. Then he teamed up again with \"Chili's Blues\" director Charles Binamé to star as in the romantic role of Alexis Labranche, the heroine's love interest, in a remake of another period Québec classic, Séraphin: un homme et son péché (2002), which became the province's highest-grossing film. In 2003, he participated in multiple projects, combining leading roles with occasional supporting roles. In Denys Arcand's The Barbarian Invasions (2003) (The Barbarian Invasions), which has enjoyed even greater international success than Jesus of Montreal (1989), Dupuis again played a minor part as a police drug-unit detective. Released in 2004 to 2005 were six more films in which he performed. His role as Alexandre in Mémoires affectives (2004) brought him his first major film-acting awards. He recently reprised the part of French-Canadian hockey hero Maurice \"Rocket\" Richard (for the third time) in the film The Rocket (2005) directed by Charles Binamé to large acclaim. He has also completed an independent film, That Beautiful Somewhere (2006), which is based on the 1992 novel \"Loon,\" by Bill Plumstead; screened in major film festivals beginning in August 2006, it was broadcast on Canadian pay television later in 2006 and opened in April 2006. Beginning in June 2006, he began filming the film _Shake Hands with the Devil (2006)_ on location in Kigali, Rwanda, a film about the Rwandan Genocide, in which Dupuis portrays Roméo Dallaire, being based on Dallaire's autobiographical memoir, in close consultation with Dallaire. The main filming finished in Halifax, Nova Scotia, in August 2006. After being screened at the Toronto International Film Festival on September 9, 2007, and the Atlantic Film Festival on September 13, it opens on September 28, 2007. In October 2006, in Québec, he began filming Emotional Arithmetic (2007), starring alongside Gabriel Byrne, Christopher Plummer, Susan Sarandon, and Max von Sydow. The film is the closing feature for the Toronto International Film Festival on September 15, 2007. Roy Dupuis lives in the countryside outside of Montréal. While, in the past, he enjoyed sky-diving and still enjoys golf, he has become more occupied with learning to sail and renovations on his home and sailboats. For over a decade, until June 2006, he actively supported the Mira Foundation, which provides guide dogs for visually-impaired children and adults and service dogs for those with other disabilities. A few years ago, he co-founded the Rivers Foundation to protect the rivers of Canada from exploitation by hydro-electric developments, serves as its co-president, and concentrates considerable time on developing it when he is not working professionally.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUwMjg0ODk0Ml5BMl5BanBnXkFtZTcwMjk4MTY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001163","name":"Roy Dupuis","idIMDB":"nm0001163"},"actorId":"nm0001163","character":"Cesare","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clara Furey","urlProfile":"http://www.imdb.com/name/nm1641212","urlPhoto":"","biography":{"dateOfBirth":"1983","placeOfBirth":"","bio":"Clara Furey was born in 1983. She is an actress and composer, known for La chambre interdite (2015), Good Neighbors (2010) and Tout près du sol (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1641212","name":"Clara Furey","idIMDB":"nm1641212"},"actorId":"nm1641212","character":"Margot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Negin","urlProfile":"http://www.imdb.com/name/nm0624369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MzA4MDA1M15BMl5BanBnXkFtZTgwMTg2NzE4ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Louis Negin is an actor and writer, known for Winnipeg mon amour (2007), Talking Dead (2008) and The Saddest Music in the World (2003). He is married to Charles Dunlop.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MzA4MDA1M15BMl5BanBnXkFtZTgwMTg2NzE4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0624369","name":"Louis Negin","idIMDB":"nm0624369"},"actorId":"nm0624369","character":"Marv / Smithy / Mars / Organizer / Mr. Lanyon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Udo Kier","urlProfile":"http://www.imdb.com/name/nm0001424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1944","placeOfBirth":" Cologne, North Rhine-Westphalia, Germany","birthName":"Udo Kierspe","height":"5' 11\" (1.8 m)","bio":"Udo Kier was born October 14, 1944 in Cologne, Germany, during World War II. His entrance was just as dramatic as some of his roles. On the evening of his birth Udo's mother requested extra time with her new baby. The nurses had gathered all of the other babies and returned them to the nursery when the hospital was bombed. He and his mother were rescued from underneath the rubble. Udo didn't know much about his father. When Udo was 18 he moved to Britain in order to learn the English language. While there he took a few acting courses. He was eventually offered a role by director Michael Sarne as a gigolo in the film Road to Saint Tropez (1966). While the role was small, it was the beginning of his career in films. His first \"hit\" film was Mark of the Devil (1970) (Mark of the Devil). The film was rated \"V\" for violence and ticket buyers were offered vomit bags before the film started. It was banned in 31 countries but spawned two sequels (both without Kier). The film is notorious for its exploitation of sex and violence (the uncut version was remastered and re-released on video in 1997). Kier met director Paul Morrissey on an airplane trip. Morrissey offered him the lead role in the 3-D Flesh for Frankenstein (1973). It was this film, along with its sister film Blood for Dracula (1974), that made Udo a cult figure. Both Morrissey films are also known as Andy Warhol's Frankenstein and Dracula; however, Andy Warhol was not involved in the production or creation of the films. Both were rated X when released. One of Kier's most vivid memories from \"Flesh for Frankenstein\" was the infamous \"internal organ\" scene. Real animal organs were used that were left unrefrigerated on the set for several hours. Udo had to pull the organs out of a prop dummy with his bare hands and hold them up to his face. He has said he will never forget that smell. When this film was finished the cast and crew began immediately filming \"Blood for Dracula\". Udo remembers both of these films fondly and regards \"Dracula\" over \"Frankenstein\" as his favorite of the two (in 1996 both films were released by Criterion on DVD totally uncut). In the 1970s some of Kier's work included The Salzburg Connection (1972), The Story of O (1975) (The Story of O), Spermula (1976) and Trauma (1976) (House on Straw Hill). Much of his work has been dubbed with someone else's voice. In Suspiria (1977) there were some technical difficulties with the sound while his scene was shot. In the 1980s some of his work included Lulu (1980), The Strange Case of Dr. Jekyll and Miss Osbourne (1981) (The Blood of Dr Jekyll), The Island of the Bloody Plantation (1983) (Escape from Blood Plantation) and Seduction: The Cruel Woman (1985) (Seduction: The Cruel Woman). In the 1980s Kier did very little work outside of Europe. In the 1990s he had a lot more visibility in America and his breakthrough role was as Hans in My Own Private Idaho (1991) (the soundtrack includes the song that Udo performs in the film). Even Cowgirls Get the Blues (1993) reunited Kier with his friend Keanu Reeves yet again. Udo was cast as Pamela Anderson's sidekick in Barb Wire (1996) and played Ron Camp in Ace Ventura: Pet Detective (1994) opposite Jim Carrey. In the 1990s some of the films he was in included L'hôpital et ses fantômes (1994), For Love or Money (1993), Breaking the Waves (1996), The Adventures of Pinocchio (1996), Blade (1998) and Armageddon (1998). Over his 30-year career Udo has worked with several brilliant directors: Paul Morrissey, Charles Matton, Dario Argento, Gus Van Sant and Walerian Borowczyk. he continues to work often with Lars von Trier and is the godfather of Van Trier's child as well as a good friend. Von Trier is currently working on a film entitled Dimension which is a project that spans 30 years. Every year the cast and crew (including Udo) meet to shoot footage. The film will show the actors age 30 years without make-up or special effects. Approximately seen years of footage has already been shot. The premiere will take place in 2024! Kier's acting career ranges from art house films (Europa (1991)) to gore fests (Blackest Heart (1990) (German Chainsaw Massacre)) to television commercials. He says he loves horror films and wants to do more of them. He enjoys playing villains, as he feels it is more interesting because evil has no limits. Currently Udo lives in California and spends much of his time working in Europe, where he receives larger roles and more recognition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001424","name":"Udo Kier","idIMDB":"nm0001424"},"actorId":"nm0001424","character":"Count Yugh / The Butler / The Dead Father / Guard / Pharmacist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Hlady","urlProfile":"http://www.imdb.com/name/nm0321587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMDkwMTY4M15BMl5BanBnXkFtZTYwNDcxMzcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1954","placeOfBirth":" Khorostkov, Ternopol Oblast, Ukrainian SSR, USSR [now Khorostkiv, Ternopil Oblast, Ukraine]","birthName":"Hladij Hryhorij","bio":"Born in the picturesque Ternopil region of Ukraine, Gregory Hlady (Hryhorii Hladiy), moved from Lviv to Kyiv upon completing high school and graduated from the Karpenko-Karyi Theater Institute with a degree in acting and cinema. Impelled by an interest in directing, he enrolled in the directors' program at the State Institute of Theatre Arts in Moscow, where he studied under the tutelage of the gifted Russian director, Anatoly Vassiliev. As one of Vassiliev's outstanding graduates he quickly became one of the most sought-after stage and cinema actors and directors in Eastern Europe. However, Hlady's approach to theater was not well received by the Soviet authorities. So, in 1989 he left Kyiv for Tallinn, Estonia. In 1990, however, a contract to perform in \"Six Characters in Search of an Author\" took him to Montreal. His French-language production of Franz Kafka's \"Amerika\" brought him critical acclaim in both Montreal and Brussels. But it was his production of Harold Pinter's \"The Homecoming\" that won him Quebec Theater Critics' Award for best directing in the 1991-1992 season. While directing plays as diverse as Dostoyevsky's \"The Idiot\" (Lausanne, Switzerland), Ionesco's \"Exit the King\" and Sophocles' \"Electra\" (Montreal), Hlady has also conducted master classes in Austria, Belgium, Italy, Germany, Switzerland and Ukraine. In 2000 he rejoined Vassiliev's company to play Salieri in \"Salieri and Mozart\" in Rome. Last year, he appeared in a Paramount film, The Sum of All Fears (2002) and this year, he plays the lead in Kim Nguyern's new feature film, The Marsh (2002). Currently, the Ukrainian actor is appearing in Paula de Vasconcelos' Montreal theatre production of \"The Other\". Mr. Hlady speaks English, French, Lithuanian, Polish, Russian and Ukrainian, and makes his home in Montreal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMDkwMTY4M15BMl5BanBnXkFtZTYwNDcxMzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0321587","name":"Gregory Hlady","idIMDB":"nm0321587"},"actorId":"nm0321587","character":"Jarvis / Dr. Deane / A Husband","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mathieu Amalric","urlProfile":"http://www.imdb.com/name/nm0023832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjIzMTMyM15BMl5BanBnXkFtZTcwMjI2NzM1OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1965","placeOfBirth":" Neuilly-sur-Seine, Hauts-de-Seine, France","height":"5' 6\" (1.68 m)","bio":"Mathieu Amalric was born on October 25, 1965 in Neuilly-sur-Seine, Hauts-de-Seine, France. He is an actor and director, known for The Grand Budapest Hotel (2014), The Diving Bell and the Butterfly (2007) and Quantum of Solace (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjIzMTMyM15BMl5BanBnXkFtZTcwMjI2NzM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0023832","name":"Mathieu Amalric","idIMDB":"nm0023832"},"actorId":"nm0023832","character":"Thadeusz M___ / Ostler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noel Burton","urlProfile":"http://www.imdb.com/name/nm0123681","urlPhoto":"","biography":{"height":"6' 1\" (1.85 m)","bio":"Noel Burton is an actor, known for Gothika (2003), A Silent Love (2004) and The Art of War (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0123681","name":"Noel Burton","idIMDB":"nm0123681"},"actorId":"nm0123681","character":"Wolf / Pilot / The Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geraldine Chaplin","urlProfile":"http://www.imdb.com/name/nm0001036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTAzMTkxOF5BMl5BanBnXkFtZTYwMDA5OTc3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1944","placeOfBirth":" Santa Monica, California, USA","birthName":"Geraldine Leigh Chaplin","height":"5' 5\" (1.65 m)","bio":"Geraldine Leigh Chaplin was born in Santa Monica, California, to Oona Chaplin (née O'Neill) and legendary entertainer Charles Chaplin (A.K.A. Charlie Chaplin). She is a granddaughter of playwright Eugene O'Neill and a great-granddaughter of stage actor James O'Neill. She attended the Royal Ballet Academy in London. She was discovered by David Lean when she was dancing in Paris, which led to her role in Doctor Zhivago (1965). She has two children, Shane and Oona Chaplin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTAzMTkxOF5BMl5BanBnXkFtZTYwMDA5OTc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001036","name":"Geraldine Chaplin","idIMDB":"nm0001036"},"actorId":"nm0001036","character":"The Master Passion / Nursemaid / Aunt Chance","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Ahmarani","urlProfile":"http://www.imdb.com/name/nm0014133","urlPhoto":"","biography":{"dateOfBirth":"1972","placeOfBirth":" Québec, Canada","bio":"Paul Ahmarani was born in 1972 in Québec, Canada. He is an actor, known for Upside Down (2012), The Left-Hand Side of the Fridge (2000) and Congorama (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0014133","name":"Paul Ahmarani","idIMDB":"nm0014133"},"actorId":"nm0014133","character":"Dr. Deng / Speedy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caroline Dhavernas","urlProfile":"http://www.imdb.com/name/nm0223518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ3ODExMTU1OV5BMl5BanBnXkFtZTcwMTE4NjAyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1978","placeOfBirth":" Montréal, Québec, Canada","height":"5' 4\" (1.63 m)","bio":"Caroline Dhavernas commands the attention of filmgoers and television viewers with her beauty, talent and poise. Beginning her career at age 11, the Montreal native is already an acclaimed young actress who has also made her mark in Hollywood. She is the recipient of two Gemeaux Awards, one for \"Best Interpretation in a Youth Series\" for Zap (1993) and the second for \"Best Supporting Role\" in Tag (2000). She was also nominated for a Genie Award for \"Best Supporting Actress\" in Niagara Motel (2005). Dhavernas made her American television debut in 2004 in the critically acclaimed FOX series Wonderfalls (2004) and starred in the ABC television series Off the Map (2011). She appeared in the supernatural thriller Devil (2010) produced by M. Night Shyamalan, The Switch (2010) with Jennifer Aniston and Jason Bateman and can be seen in the film Wrecked (2009) starring Adrien Brody. She also starred as \"Vera Keller\" in The Pacific (2010), a mini-series about World War II that debuted on HBO in March 2010. Dhavernas appeared in the widely acclaimed Canadian feature Passchendaele (2008), which won the 2009 Genie Award for Best Motion Picture. Dhavernas also starred in the film Breach (2007), with Chris Cooper and Ryan Phillippe . In 2006 she starred in the Focus Features film Hollywoodland (2006) opposite Adrien Brody. Her first feature film, Thick as Thieves (1999), was followed by L'île de sable (1999). She also co-starred in English director Peter Greenaway's The Tulse Luper Suitcases, Part 1: The Moab Story (2003), which was presented at the Cannes Film Festival in 2003. Dhavernas divides her time between Montreal and New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ3ODExMTU1OV5BMl5BanBnXkFtZTcwMTE4NjAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0223518","name":"Caroline Dhavernas","idIMDB":"nm0223518"},"actorId":"nm0223518","character":"Gong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacques Nolot","urlProfile":"http://www.imdb.com/name/nm0634500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTkzMTcwM15BMl5BanBnXkFtZTcwNDkyMzIzMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1943","placeOfBirth":" Marciac, Gers, France","bio":"Jacques Nolot was born on 31 August 1943 in Marcillac, France and is a well known stage and character actor whose first feature film L'arrière pays (1998) won the First Film Special Distinction Award at the Montreal World Film Festival and a FIPRESCI Special Mention Award at the Venice Film Festival both in 1998. It earned a nomination for Best New Director of a Feature Film at the César Awards in 1999. His next movie L'aigle à deux têtes (1948) also was critically acclaimed. He previously shot the short film Manège (1986) and also wrote several screenplays including J'embrasse pas (1991) and La matiouette ou l'arrière-pays (1983), both directed by André Téchiné and Le café des Jules (1989), directed by Paul Vecchiali. Nolot first appeared in Hôtel des Amériques (1981) and performed in many other films including Viva la vie (1984), Scene of the Crime (1986), Les innocents (1987) or Nenette and Boni (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTkzMTcwM15BMl5BanBnXkFtZTcwNDkyMzIzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634500","name":"Jacques Nolot","idIMDB":"nm0634500"},"actorId":"nm0634500","character":"Bent / Minister of the Interior","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Slimane Dazi","urlProfile":"http://www.imdb.com/name/nm3370158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTQzMGMyOTgtZTg1MS00M2UzLTgyYmQtMTk3ZDNlY2JlMmVjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1960","placeOfBirth":" Nanterre, Hauts-de-Seine, France","bio":"Slimane Dazi was born on May 26, 1960 in Nanterre, Hauts-de-Seine, France. He is an actor, known for Only Lovers Left Alive (2013), A Prophet (2009) and Rengaine (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTQzMGMyOTgtZTg1MS00M2UzLTgyYmQtMTk3ZDNlY2JlMmVjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3370158","name":"Slimane Dazi","idIMDB":"nm3370158"},"actorId":"nm3370158","character":"Baron Pappenheim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria de Medeiros","urlProfile":"http://www.imdb.com/name/nm0210218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MDk5MDkzMF5BMl5BanBnXkFtZTYwODIyODk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1965","placeOfBirth":" Lisbon, Portugal","birthName":"Maria de Medeiros Esteves Victorino D'Almeida","bio":"Maria de Medeiros is the oldest of three daughters by the pianist, maestro and composer António Vitorino D'Almeida and Maria Armanda Esteves. Her sisters are Inês de Medeiros, stage actress and film and stage director and Ana Medeiros, violinist, composer, and music teacher. Studied at Lycée Français Charles Le Pierre, Lisbon, and when she was 15 years old, she acted in her father's movie, Silvestre. Went to Paris in 1984, aiming to take a college degree in the Beaux Arts, and ended by taking Philosophy, and Drama instead, at the National Schools of Arts and Theatre Techniques. Lived and filmed in Portugal, and abroad, then she returned to Paris, where she is established since 1987. She married a Catalonian (Spain), and has two daughters. She acquired the French nationality because of her children, and because she has a French culture as well as a Portuguese one. She is fluent in Portuguese, French, English, German and Spanish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MDk5MDkzMF5BMl5BanBnXkFtZTYwODIyODk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0210218","name":"Maria de Medeiros","idIMDB":"nm0210218"},"actorId":"nm0210218","character":"The Blind Mother / Clotilde","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlotte Rampling","urlProfile":"http://www.imdb.com/name/nm0001648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTgyMjIzMF5BMl5BanBnXkFtZTcwOTc3NTA0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1946","placeOfBirth":" Sturmer, Essex, England, UK","birthName":"Charlotte Tessa Rampling","height":"5' 6½\" (1.69 m)","bio":"Tessa Charlotte Rampling was born 5 February 1946 in Sturmer, England, to Isabel Anne (Gurteen), a painter, and Godfrey Lionel Rampling, an Olympic gold medalist, army officer, and colonel, who became a NATO commander. She was educated at Jeanne d'Arc Académie pour Jeunes Filles in Versailles, France and at the exclusive St. Hilda's school in Bushey, England. She was a model before entering films in Richard Lester's The Knack... and How to Get It (1965), followed by roles in Georgy Girl (1966) and Luchino Visconti's The Damned (1969). Rampling is best known for her role in Liliana Cavani's The Night Porter (1974), where she played a concentration camp survivor who is reunited with the Nazi guard (Dirk Bogarde) who tortured her throughout her captivity. In 1974, she co-starred with Sean Connery in John Boorman's science fiction adventure Zardoz (1974), with Robert Mitchum in Farewell, My Lovely (1975), with Woody Allen in his Stardust Memories (1980), and with Paul Newman in Sidney Lumet's The Verdict (1982). An actress always willing to take on bold and meaningful roles, Rampling had perhaps the most off-beat one in Nagisa Ôshima's 1986 comedy Max mon amour (1986) as Margaret, a woman in love with a chimpanzee. She has also voiced video games, such as The Ring.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTgyMjIzMF5BMl5BanBnXkFtZTcwOTc3NTA0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001648","name":"Charlotte Rampling","nicknames":["The Legend"],"idIMDB":"nm0001648"},"actorId":"nm0001648","character":"The Ostler's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Andres Turgeon-Trelles","urlProfile":"http://www.imdb.com/name/nm3588633","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTkwNDE4NF5BMl5BanBnXkFtZTgwNDAyODczMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Victor Andres Turgeon-Trelles is an actor, known for Arrival (2016), Henri Henri (2014) and Le torrent (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTkwNDE4NF5BMl5BanBnXkFtZTgwNDAyODczMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3588633","name":"Victor Andres Turgeon-Trelles","idIMDB":"nm3588633"},"actorId":"nm3588633","character":"Saplingjack 1 / Listening Man / Pancho","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3066630","urlIMDB":"http://www.imdb.com/title/tt3066630","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$34,043","country":"USA","day":"06","month":"03","year":"2016","remarks":""},{"money":"$32,856","country":"USA","day":"21","month":"02","year":"2016","remarks":""}],"weekendGross":[{"money":"$473","country":"USA","day":"06","month":"03","year":"2016","remarks":"1 Screen"},{"money":"$696","country":"USA","day":"21","month":"02","year":"2016","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 10 min (130 min)"],"soundMix":null,"color":["Color","Black and White"],"aspectRatio":["1.85 : 1"],"camera":["Canon EOS 5D Mark III","Sony PMW-F3","Superheadz Digital Harinezumi 2++ (some shots)"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Digital (HD)"],"printedFilmFormat":["DCP"]},"rating":"6.2","metascore":"83","filmingLocations":[{"location":"Paris, France"}],"rated":"TOUS PUBLICS","awards":[{"award":"Bildrausch Filmfest Basel 2015","titlesAwards":[{"titleAwardOutcome":"Won Bildrausch Ring of Film Art","categories":[{"category":"Best Director","names":[{"name":"Guy Maddin","id":"nm0534665","role":"director"},{"name":"Shin'ya Tsukamoto","id":"nm0875354","role":"director"},{"name":"Nobi","id":"tt3893038","role":null}]}]}]},{"award":"Canadian Screen Awards, CA 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Canadian Screen Award","categories":[{"category":"Achievement in Sound Editing","names":[{"name":"John Gurdebeke","id":"nm1299707","role":null},{"name":"David Rose","id":"nm0741327","role":null}]},{"category":"Best Motion Picture","names":[{"name":"Phoebe Greenberg","id":"nm3061598","role":null},{"name":"Penny Mancuso","id":"nm3062487","role":null},{"name":"Phyllis Laing","id":"nm0481923","role":null},{"name":"David Christensen","id":"nm0159760","role":null},{"name":"Guy Maddin","id":"nm0534665","role":null}]},{"category":"Achievement in Art Direction/Production Design","names":[{"name":"Galen Johnson","id":"nm5244989","role":null},{"name":"Brigitte Henry","id":"nm2196345","role":null},{"name":"Chris Lavis","id":"nm2650321","role":null},{"name":"Maciek Szczerbowski","id":"nm2649299","role":null}]}]}]},{"award":"Golden Trailer Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Most Original","names":[{"name":"Kino Lorber","id":null,"role":null},{"name":"Jump Cut","id":null,"role":null}]}]}]},{"award":"Indiewire Critics' Poll 2015","titlesAwards":[{"titleAwardOutcome":"Nominated ICP Award","categories":[{"category":"Best Director","names":[{"name":"Guy Maddin","id":"nm0534665","role":null},{"name":"Evan Johnson","id":"nm2829262","role":null}]},{"category":"Best Editing","names":[{"name":"John Gurdebeke","id":"nm1299707","role":null}]}]}]},{"award":"Las Palmas Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Special Jury Award","categories":[{"category":"Special Jury Award","names":[{"name":"Guy Maddin","id":"nm0534665","role":null},{"name":"Evan Johnson","id":"nm2829262","role":null}]}]}]},{"award":"London Critics Circle Film Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated ALFS Award","categories":[{"category":"British/Irish Actress of the Year","names":[{"name":"Charlotte Rampling","id":"nm0001648","role":null},{"name":"45 Years","id":"tt3544082","role":null}]}]}]},{"award":"San Francisco Film Critics Circle 2015","titlesAwards":[{"titleAwardOutcome":"Won Special Citation","categories":[{"category":"","names":[{"name":"Guy Maddin","id":"nm0534665","role":null}]}]}]},{"award":"Vancouver Film Critics Circle 2016","titlesAwards":[{"titleAwardOutcome":"Nominated VFCC Award","categories":[{"category":"Best Canadian Film","names":[]}]}]}],"votes":"2,106","type":"Movie","companyCreditsSimple":[{"idCompany":"co0241288","name":"Phi"},{"idCompany":"co0009056","name":"Buffalo Gal Pictures"},{"idCompany":"co0213260","name":"Kidam"}],"keywords":{"keywords":["submarine","woodsman","lynchian","lack of oxygen","captain","room","pancake","amnesia","repeated scene","brain surgery","brain","bone","psychiatrist","jumping off a train","train","shot to death","trip","snow","dream","volcano","female nudity","talking to the camera","story telling","storytelling","story within a story","story within the story","story in story","parallel narrative","male in bathtub","bathtub","bath","surrealism","produced by director","written by director"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:35:21"}}