{"data":{"movies":[{"title":"Necessary Evil: Super-Villains of DC Comics","originalTitle":"","year":"2013","releaseDate":"20131025","directors":[{"name":"Scott Devine","id":"nm0222664"},{"name":"J.M. Kenny","id":"nm0448588"}],"writers":[{"name":"Bill Finger","id":"nm0277730"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMyNzI1NzI0OV5BMl5BanBnXkFtZTcwNDYwNDg4OQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary"],"plot":"In this new documentary film, the malevolent, sometimes charismatic figures from DC Comics' hallowed rogues' gallery will be explored in depth, featuring interviews with the famed creators, storytellers and those who have crafted the personalities and profiles of many of the most notorious villains in comic book history.","simplePlot":"A documentary detailing the epic Rogues' Gallery of DC Comics from The Joker and Lex Luthor, Sinestro, Darkseid and more, this documentary will explore the Super Villains of DC Comics.","actors":[{"actorName":"Christopher Lee","urlProfile":"http://www.imdb.com/name/nm0000489","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMjU5NDA0NV5BMl5BanBnXkFtZTYwMTUwMzI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1922","placeOfBirth":" Belgravia, London, England, UK","birthName":"Christopher Frank Carandini Lee","height":"6' 5\" (1.96 m)","bio":"Sir Christopher Frank Carandini Lee was perhaps the only actor of his generation to have starred in so many films and cult saga. Although most notable for personifying bloodsucking vampire, Dracula, on screen, he portrayed other varied characters on screen, most of which were villains, whether it be Francisco Scaramanga in the James Bond film, The Man with the Golden Gun (1974), or Count Dooku in Star Wars: Episode II - Attack of the Clones (2002), or as the title monster in the Hammer Horror film, The Mummy (1959). Lee was born in 1922 in London, England, where he and his older sister Xandra were raised by their parents, Contessa Estelle Marie (Carandini di Sarzano) and Geoffrey Trollope Lee, a professional soldier, until their divorce in 1926. Later, while Lee was still a child, his mother married (and later divorced) Harcourt George St.-Croix (nicknamed Ingle), who was a banker. Lee's maternal great-grandfather was an Italian political refugee, while Lee's great-grandmother was English opera singer Marie (Burgess) Carandini. After attending Wellington College from age 14 to 17, Lee worked as an office clerk in a couple of London shipping companies until 1941 when he enlisted in the Royal Air Force during World War II. Following his release from military service, Lee joined the Rank Organisation in 1947, training as an actor in their \"Charm School\" and playing a number of bit parts in such films as Corridor of Mirrors (1948). He made a brief appearance in Laurence Olivier's Hamlet (1948), in which his future partner-in-horror Peter Cushing also appeared. Both actors also appeared later in Moulin Rouge (1952) but did not meet until their horror films together. Lee had numerous parts in film and television throughout the 1950s. He struggled initially in his new career because he was discriminated as being taller than the leading male actors of his time and being too foreign-looking. However, playing the monster in the Hammer film The Curse of Frankenstein (1957) proved to be a blessing in disguise, since the was successful, leading to him being signed on for future roles in Hammer Film Productions. Lee's association with Hammer Film Productions brought him into contact with Peter Cushing, and they became good friends. Lee and Cushing often than not played contrasting roles in Hammer films, where Cushing was the protagonist and Lee the villain, whether it be Van Helsing and Dracula respectively in Horror of Dracula (1958), or John Banning and Kharis the Mummy respectively in The Mummy (1959). Lee continued his role as \"Dracula\" in a number of Hammer sequels throughout the 1960s and into the early 1970s. During this time, he co-starred in The Hound of the Baskervilles (1959), and made numerous appearances as Fu Manchu, most notably in the first of the series The Face of Fu Manchu (1965), and also appeared in a number of films in Europe. With his own production company, Charlemagne Productions, Ltd., Lee made Nothing But the Night (1973) and To the Devil a Daughter (1976). By the mid-1970s, Lee was tiring of his horror image and tried to widen his appeal by participating in several mainstream films, such as The Private Life of Sherlock Holmes (1970), The Three Musketeers (1973), The Four Musketeers: Milady's Revenge (1974), and the James Bond film The Man with the Golden Gun (1974). The success of these films prompted him in the late 1970s to move to Hollywood, where he remained a busy actor but made mostly unremarkable film and television appearances, and eventually moved back to England. The beginning of the new millennium relaunched his career to some degree, during which he has played Count Dooku in Star Wars: Episode II - Attack of the Clones (2002) and as Saruman the White in the Lord of the Rings trilogy. Lee played Count Dooku again in Star Wars: Episode III - Revenge of the Sith (2005) and as Johnny Depp's character's father in the Tim Burton film, Charlie and the Chocolate Factory (2005). On 16 June 2001, he was created a Commander of the Order of the British Empire in recognition of his services to drama. He was created a Knight Bachelor on 13 June 2009 in the Queen's Birthday Honours List for his services to drama and charity. In addition he was made a Commander of the Order of St John on 16 January 1997. Lee died at the Chelsea and Westminster Hospital on 7 June 2015 at 8:30 am after being admitted for respiratory problems and heart failure, shortly after celebrating his 93rd birthday there. His wife delayed the public announcement until 11 June, in order to break the news to their family","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMjU5NDA0NV5BMl5BanBnXkFtZTYwMTUwMzI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000489","name":"Christopher Lee","nicknames":["Chris"],"idIMDB":"nm0000489"},"actorId":"nm0000489","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neal Adams","urlProfile":"http://www.imdb.com/name/nm0011240","urlPhoto":"","biography":{"dateOfBirth":"6 January 1941","placeOfBirth":" Governors Island, New York City, New York, USA","bio":"Neal Adams was born on January 6, 1941 in Governors Island, New York City, New York, USA. He is known for his work on Justice League vs. Teen Titans (2016), Justice League: Gods and Monsters (2015) and LEGO DC Super Heroes: Justice League - Attack of the Legion of Doom! (2015). He is married to Marilyn. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0011240","name":"Neal Adams","idIMDB":"nm0011240"},"actorId":"nm0011240","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Azzarello","urlProfile":"http://www.imdb.com/name/nm1568755","urlPhoto":"","biography":{"dateOfBirth":"11 August 1962","placeOfBirth":" Cleveland, Ohio, USA","bio":"Brian Azzarello was born on August 11, 1962 in Cleveland, Ohio, USA. He is a writer, known for Batman: Gotham Knight (2008), Batman: The Killing Joke (2016) and 100 Bullets. He is married to Jill Thompson.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1568755","name":"Brian Azzarello","idIMDB":"nm1568755"},"actorId":"nm1568755","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claudia Black","urlProfile":"http://www.imdb.com/name/nm0085227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDg2MzY2Ml5BMl5BanBnXkFtZTgwNTQ1NjU4NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1972","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Claudia Lee Black","height":"5' 8\" (1.73 m)","bio":"Claudia Lee Black was born and raised in Sydney, Australia. Her parents Jules and Judy Black are both Australian Medical Academics Doctors. She has lived in Australia, New Zealand, England and the US. Throughout her career Black has played in many Australian and New Zealand films and guested on such Australian series as Sidney police (1989) and Brigade des mers (1996), the American and New Zealand series Hercules: The Legendary Journeys (1995) and Xena: Warrior Princess (1995), and a leading role in the New Zealand soap opera City Life (1996). Since then she has mostly played in science-fiction and fantastic series. She is probably best known for her roles as Ayren Sun in the Australian series Farscape (1999) and Vala Mal Doran in the American series Stargate SG-1 (1997), in which she co-starred with Ben Browder.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDg2MzY2Ml5BMl5BanBnXkFtZTgwNTQ1NjU4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085227","name":"Claudia Black","idIMDB":"nm0085227"},"actorId":"nm0085227","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed Boon","urlProfile":"http://www.imdb.com/name/nm0095460","urlPhoto":"","biography":{"dateOfBirth":"30 March 1964","placeOfBirth":" Chicago, Illinois, USA","height":"6' (1.83 m)","bio":"Ed Boon was born on March 30, 1964 in Chicago, Illinois, USA. He is known for his work on Mortal Kombat (1995), Mortal Kombat: Annihilation (1997) and Mortal Kombat (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0095460","name":"Ed Boon","idIMDB":"nm0095460"},"actorId":"nm0095460","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geoff Boucher","urlProfile":"http://www.imdb.com/name/nm5321751","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Geoff Boucher yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5321751","name":"Geoff Boucher","idIMDB":"nm5321751"},"actorId":"nm5321751","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clancy Brown","urlProfile":"http://www.imdb.com/name/nm0000317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1959","placeOfBirth":" Urbana, Ohio, USA","birthName":"Clarence J. Brown III","height":"6' 2½\" (1.89 m)","bio":"A tall, wavy-haired US actor with a deep, resonant voice, Clancy Brown has proved himself a versatile performer with first-class contributions to theater, feature films, television series and even animation. Clarence J. Brown III was born in 1959 in Urbana, Ohio, to Joyce Helen (Eldridge), a concert pianist, conductor, and composer, and Republican congressman Clarence J. \"Bud\" Brown, Jr., who helped manage the Brown Publishing Company, the family-owned newspaper started by Clancy's grandfather, Congressman Clarence J. Brown. Clancy spent much of his youth in close proximity to Washington, D.C. He plied his dramatic talents in the Chicago theater scene before moving onto feature film with a sinister debut performance bullying Sean Penn inside a youth reformatory in Bad Boys (1983). He portrayed Viktor the Monster in the unusual spin on the classic Frankenstein story in The Bride (1985), before scoring one of his best roles to date as the evil Kurgan hunting fellow immortals Christopher Lambert and Sean Connery across four centuries of time in Highlander (1986). Brown played a corrupt American soldier in the Walter Hill-directed hyper-violent action film Extreme Prejudice (1987), another deranged killer in Shoot to Kill (1988) and a brutal prison guard, who eventually somewhat \"befriends\" wrongfully convicted banker Tim Robbins, in the moving The Shawshank Redemption (1994). His superb vocal talents were in demand, and he contributed voices to animated series, including Mortal Kombat: Defenders of the Realm (1995), Street Sharks (1994), Gargoyles (1994) and Superman (1996). Brown then landed two more plum roles, one as a \"tough-as-nails\" drill sergeant in the science fiction thriller Starship Troopers (1997), and the other alongside Robin Williams in the Disney comedy Flubber (1997). The video gaming industry took notice of Clancy's vocal abilities, too, and he has contributed voices to several top selling video games, including Crash Bandicoot: The Wrath of Cortex (2001), Lands of Lore III (1999), Star Wars: Bounty Hunter (2002) and Crash Nitro Kart (2003). His voice is also the character of cranky crustacean Mr. Eugene H. Krabs in the highly successful SpongeBob SquarePants (1999) animated series and films, and he contributed voices to The Batman (2004), Jackie Chan Adventures (2000) and Justice League (2001) animated series. A popular and friendly personality, Clancy Brown continues to remain busy both through his vocal and acting talents in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000317","name":"Clancy Brown","idIMDB":"nm0000317"},"actorId":"nm0000317","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Buccellato","urlProfile":"http://www.imdb.com/name/nm0117865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NTU1OTU5N15BMl5BanBnXkFtZTgwODMzNDYyMTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1970","placeOfBirth":" Queens, New York, USA","height":"5' 10\" (1.78 m)","bio":"Brian Buccellato was born on September 2, 1970 in Queens, New York, USA. He is an actor and writer, known for Kevin Hart: What Now? (2016), The Firing Squad (1999) and Blame (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NTU1OTU5N15BMl5BanBnXkFtZTgwODMzNDYyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0117865","name":"Brian Buccellato","nicknames":["Booch"],"idIMDB":"nm0117865"},"actorId":"nm0117865","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Burnett","urlProfile":"http://www.imdb.com/name/nm0122334","urlPhoto":"","biography":{"dateOfBirth":"1949","placeOfBirth":" USA","bio":"Alan Burnett was born in 1949 in the USA. He is a producer and writer, known for Batman: Mask of the Phantasm (1993), Superman (1996) and Batman Beyond (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0122334","name":"Alan Burnett","idIMDB":"nm0122334"},"actorId":"nm0122334","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Carlin","urlProfile":"http://www.imdb.com/name/nm1740477","urlPhoto":"","biography":{"bio":"Mike Carlin is a writer, known for Superman/Doomsday (2007), Justice League: The Flashpoint Paradox (2013) and Look, Up in the Sky! The Amazing Story of Superman (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1740477","name":"Mike Carlin","idIMDB":"nm1740477"},"actorId":"nm1740477","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobbie Chase","urlProfile":"http://www.imdb.com/name/nm6137688","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Bobbie Chase yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6137688","name":"Bobbie Chase","idIMDB":"nm6137688"},"actorId":"nm6137688","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Conroy","urlProfile":"http://www.imdb.com/name/nm0175834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDcwMTU2NF5BMl5BanBnXkFtZTcwMzMyMjg0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1955","placeOfBirth":" Westbury, New York, USA","height":"6' 2\" (1.88 m)","bio":"Kevin Conroy was born on November 30, 1955 in Westbury, New York. At age 17, Kevin earned a full scholarship to attend Juilliard's drama division, where he studied under actor John Houseman. In 1978, after graduating from Juilliard, he toured with \"The Acting Company\", Houseman's acting group, and in 1979, he went on the national tour of \"Deathtrap\". In 1980, he was cast in the daytime soap opera Another World (1964). However, he soon missed the theatre, and so he became associated with the Old Globe Theatre in San Diego, California, where he performed in \"Hamlet\" and \"A Midsummer Night's Dream\". From 1980 to 1985, he acted in a variety of contemporary and classic theatre pieces, including the Broadway production of \"Eastern Standard\" and \"Lolita\". He is very respected in theatre circles for his interpretation of Shakespearean characters, and in 1984, he played the title role in \"Hamlet\" in the New York Shakespeare Festival. Kevin returned to television in the television movie Covenant (1985). He was a series regular on Ohara (1987) in 1987, and on Tour of Duty (1987) from 1987 to 1988, before starring in a series of television movies. He is best known for providing the title role in the animated Batman: The Animated Series (1992) series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDcwMTU2NF5BMl5BanBnXkFtZTcwMzMyMjg0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175834","name":"Kevin Conroy","idIMDB":"nm0175834"},"actorId":"nm0175834","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Daniel","urlProfile":"http://www.imdb.com/name/nm3946868","urlPhoto":"","biography":{"bio":"Tony Daniel is known for his work on Young Justice (2010), Gotham (2014) and Necessary Evil: Super-Villains of DC Comics (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3946868","name":"Tony Daniel","idIMDB":"nm3946868"},"actorId":"nm3946868","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guillermo del Toro","urlProfile":"http://www.imdb.com/name/nm0868219","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzNTYwNjE0N15BMl5BanBnXkFtZTcwMjc0ODM1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1964","placeOfBirth":" Guadalajara, Jalisco, Mexico","height":"6' 0¾\" (1.85 m)","bio":"Guillermo del Toro was born October 9, 1964 in Guadalajara Jalisco, Mexico. Raised by his Catholic grandmother, del Toro developed an interest in filmmaking in his early teens. Later, he learned about makeup and effects from the legendary Dick Smith (The Exorcist (1973)) and worked on making his own short films. At the age of 21, del Toro executive produced his first feature, Dona Herlinda and Her Son (1986). Del Toro spent almost 10 years as a makeup supervisor, and formed his own company, Necropia in the early 1980s. He also produced and directed Mexican television programs at this time, and taught film. del Toro got his first big break when Cronos (1993) won nine academy awards in Mexico, then went on to win the International Critics Week prize at Cannes. Following this success, del Toro made his first Hollywood film, Mimic (1997), starring Mira Sorvino. del Toro had some unfortunate experiences working with a demanding Hollywood studio on Mimic (1997), and returned to Mexico to form his own production company, The Tequila Gang. Next for del Toro, was The Devil's Backbone (2001), a Spanish Civil War ghost story. The film was hailed by critics and audiences alike, and del Toro decided to give Hollywood another try. In 2002, he directed the Wesley Snipes vampire sequel, Blade II (2002). On a roll, Del Toro followed up Blade II (2002) with another successful comic-book inspired film, Hellboy (2004), starring one of Del Toro's favorite actors, Ron Perlman. Married with children, del Toro lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzNTYwNjE0N15BMl5BanBnXkFtZTcwMjc0ODM1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0868219","name":"Guillermo del Toro","idIMDB":"nm0868219"},"actorId":"nm0868219","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Didio","urlProfile":"http://www.imdb.com/name/nm0225814","urlPhoto":"","biography":{"dateOfBirth":"24 October 1959","placeOfBirth":" New York City, New York, USA","bio":"Dan Didio was born on October 24, 1959 in New York City, New York, USA. He is known for his work on Batman Returns Heroes: Alfred (2005), Batman Heroes: Harvey Dent (2005) and Batman Heroes: Batman (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0225814","name":"Dan Didio","idIMDB":"nm0225814"},"actorId":"nm0225814","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3033478","urlIMDB":"http://www.imdb.com/title/tt3033478","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.9","filmingLocations":[{"location":"Anaheim Convention Center - 800 W. Katella Avenue, Anaheim, California, USA"}],"awards":[],"votes":"913","type":"Movie","companyCreditsSimple":[{"idCompany":"co0038332","name":"DC Comics"},{"idCompany":"co0150180","name":"mOcean"}],"keywords":{"keywords":["dc comics","super villain","based on comic book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:29:30"}}