{"data":{"movies":[{"title":"Christmas in Conway","originalTitle":"","year":"2013","releaseDate":"20131201","directors":[{"name":"John Kent Harrison","id":"nm0006867"}],"writers":[{"name":"Stephen P. Lindsey","id":"nm2124742"},{"name":"Luis Ugaz","id":"nm1372305"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA3NTMxNjIyMl5BMl5BanBnXkFtZTgwMTI5NDc2MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"To the folks in Conway, South Carolina, Duncan Mayor is a very cranky guy. To \"my sweet girl\" - his wife, Suzy - he's a doting pussycat. But Suzy is just home from the hospital and cared for 24/7 by nurse Natalie, whom Duncan tries his best to ignore. Duncan decides the best medicine Suzy could possibly have - and a Christmas present she'll never forget -- is a ride on a real Ferris wheel, set up in their own back yard. Why a Ferris wheel? Because it was while riding one many moons ago that Duncan asked Suzy to marry him. Where to find a 45-foot-high used Ferris wheel? Duncan strikes gold in an abandoned amusement park, presided over by a lonely ex-carnival worker -- Henry. Assembling the mechanical monstrosity is not exactly a one-man job. Duncan gets a crucial assist from Tommy, a former student of Suzy's, who is deeply in her debt. He's become a successful landscape designer after a troubled youth; it was Suzy who set him straight. Meanwhile, the neighbors are not amused; ...","simplePlot":"To the folks in Conway, South Carolina, Duncan Mayor is a very cranky guy. To \"my sweet girl\" - his wife, Suzy - he's a doting pussycat. But Suzy is just home from the hospital and cared ... ","actors":[{"actorName":"Andy Garcia","urlProfile":"http://www.imdb.com/name/nm0000412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3NDA5NTgxNl5BMl5BanBnXkFtZTgwMzU3NDc4NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1956","placeOfBirth":" Havana, Cuba","birthName":"Andrés Arturo García Menéndez","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's most private and guarded leading men, Andy Garcia has created a few iconic characters while at the same time staying true to his acting roots and personal projects. Garcia was born Andrés Arturo García Menéndez on April 12, 1956, in Havana, Cuba, to Amelie Menéndez, a teacher of English, and René García Núñez, an attorney and avocado farmer. Garcia's family was relatively affluent. However, when he was two years old, Fidel Castro came to power, and the family fled to Miami Beach. Forced to work menial jobs for a while, the family started a fragrance company that was eventually worth more than a million dollars. He attended Natilus Junior High School and later at Miami Beach Senior High School. Andy was a popular student in school, a good basketball player and good-looking. He dreamed of playing professional baseball. In his senior year, though, he contracted mononucleosis and hepatitis, and unable to play sports, he turned his attention to acting. He studied acting with Jay W. Jensen. Jensen was a South Florida legend, counting among his numerous students, Brett Ratner, Roy Firestone, Mickey Rourke, and Luther Campbell. Following his positive high school experiences in acting, he continued his drama studies at Florida International University. Soon, he was headed out to Hollywood. His first break came as a gang member on the very first episode of the popular TV series Hill Street Blues (1981). His role as a cocaine kingpin in 8 Million Ways to Die (1986) put him on the radar of Brian De Palma, who was casting for his gangster classic The Untouchables (1987). At first, he envisioned Garcia as Al Capone's sadistic henchman Frank Nitti, but fearing typecasting as a gangster, Garcia campaigned for the role of \"George Stone\", the Italian cop who gets accepted into Eliot Ness' famous band of lawmen. Garcia's next notable role came in Black Rain (1989) by acclaimed director Ridley Scott, as the partner of police detective Michael Douglas. He then co-starred with Richard Gere in Internal Affairs (1990), directed by Mike Figgis. In 1989, Francis Ford Coppola was casting for the highly anticipated third installment of his \"Godfather\" films. The Godfather: Part III (1990) included one of the most sought-after roles in decades, the hot-headed son of \"Sonny Corleone\" and mob protégé of \"Michael Corloene\", \"Vincent Mancini\". A plum role for any young rising star, the role was campaigned for by a host of actors. Val Kilmer, Alec Baldwin, Vincent Spano, Charlie Sheen, and even Robert De Niro (who wanted the role changed to accommodate his age) were all beaten out by the up-and-coming Garcia. His performance was Oscar-nominated as Best Supporting Actor, and secured him international stardom and a place in cinematic history. Now a leading man, he starred in such films as Jennifer 8 (1992) and Hero (1992). He won raves for his role as the husband of Meg Ryan in When a Man Loves a Woman (1994) and gave another charismatic gangster turn in Things to Do in Denver When You're Dead (1995). He then returned in Night Falls on Manhattan (1996), directed by Sidney Lumet, as well as portraying legendary mobster Lucky Luciano in Hoodlum (1997). In perhaps his most mainstream role, he portrayed a cop in the action film Desperate Measures (1998). Garcia then starred in a few lower-profile projects that didn't do much for his career, but things turned around in 2001, with the first of many projects being his role as a cold casino owner in Ocean's Eleven (2001), directed by Steven Soderbergh. Seeing his removal from Cuba as involuntary, Garcia is proud of his heritage which influences his life and work. One such case is his portrayal of renowned Cuban trumpet player Arturo Sandoval in For Love or Country: The Arturo Sandoval Story (2000). He is an extremely private man, and strong believer in old-fashioned chivalry. Married to his wife, Maria Victoria, since 1982, the couple has three daughters. One of the most talented leading men around, Garcia has had a unique career of staying true to his own ideals and thoughts on acting. While some would have used some of the momentum he has acquired at different points in his career to get rich off lightweight projects, Garcia has stayed true to stories and films that aspire to something more. But with a presence and style that never seem old, a respect from directors and film buffs, alike, Andy Garcia will be remembered for a long time in film history.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3NDA5NTgxNl5BMl5BanBnXkFtZTgwMzU3NDc4NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000412","name":"Andy Garcia","idIMDB":"nm0000412"},"actorId":"nm0000412","character":"Duncan Mayor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mandy Moore","urlProfile":"http://www.imdb.com/name/nm0601553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTEzNDgzOF5BMl5BanBnXkFtZTcwNTMwNjk4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1984","placeOfBirth":" Nashua, New Hampshire, USA","birthName":"Amanda Leigh Moore","height":"5' 10\" (1.78 m)","bio":"Amanda Leigh Moore was born in Nashua, New Hampshire, on April 10, 1984, to Stacy (Friedman), a former news reporter, and Don Moore, an airline pilot. During her childhood, her family moved to Orlando, Florida, where she was raised. She has Russian Jewish (from her maternal grandfather), English, and some Scottish and Irish, ancestry. After seeing the musical \"Oklahoma!\", she decided that she wanted to pursue a career in singing. As a child, she performed the National Anthem at several athletic events around her hometown of Orlando, Florida, and became known as the \"National Anthem girl\". At the ripe age of 14, while she was recording in a studio in Orlando, a Fed-Ex worker who happened to be passing through heard her and was interested in her talent. He happened to know someone at Sony as well. Moore worked on cutting a demo and shortly thereafter signed a record deal with Sony 550 Music. At 15, her first record \"So Real\" was released. Her first tour was with the Backstreet Boys. As her touring and recording schedule demanded more of her time, Moore withdrew from Bishop Moore Catholic High School in Orlando and opted for a tutor/correspondence. She has stated that her education is important to her and says that the fact that she wants to go to college motivates her to continue with her schooling. Though Moore's record sales were not up in the ranks of Britney Spears or Christina Aguilera, she has proved to be a formidable talent both in singing and in acting, and snagged an MTV Movie Award in June 2002 for her first feature film role in A Walk to Remember (2002). Her biggest dream, though, is to perform on Broadway someday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTEzNDgzOF5BMl5BanBnXkFtZTcwNTMwNjk4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601553","name":"Mandy Moore","idIMDB":"nm0601553"},"actorId":"nm0601553","character":"Natalie Springer","urlCharacter":"http://www.imdb.com/character/ch0405967","main":true},{"actorName":"Cheri Oteri","urlProfile":"http://www.imdb.com/name/nm0652783","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4Njg1NDg0MTVeQTJeQWpwZ15BbWU3MDg2MzU0MjY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1962","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Cheryl Ann O'Teari","height":"5' 2\" (1.57 m)","bio":"Cheri Oteri was born on 19th September 1962, in Philadelphia, Pennsylvania. She grew up in Upper Darby, Pennsylvania, graduating from Archbishop Prendergast High School, then moved to Los Angeles when she was 25, where she worked in Promotions for A&M records for 4 years, and joined up with the Groundlings, an improv-sketch based comedy group. One night, a Saturday Night Live (1975) rep was in the audience and liked her, so she flew down to New York to audition, made it, and debuted on Sept. 9, 1995. Since then, she has appeared in four films, has been in numerous magazines.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4Njg1NDg0MTVeQTJeQWpwZ15BbWU3MDg2MzU0MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0652783","name":"Cheri Oteri","idIMDB":"nm0652783"},"actorId":"nm0652783","character":"Gayle Matthews","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Riley Smith","urlProfile":"http://www.imdb.com/name/nm0809720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc3Mjc3Njk0MF5BMl5BanBnXkFtZTcwOTA1NTMyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1978","placeOfBirth":" Cedar Rapids, Iowa, USA","birthName":"Riley Bryant Smith","height":"5' 11\" (1.8 m)","bio":"Riley Smith is an immensely talented actor whose body of work comes to life in diverse roles across television and film. With a promising new series, Riley's star is quickly on the rise. Smith is currently in production on CW's new fall drama Frequency, which will premiere on October 5, 2016. In this reimagining of the 2000 New Line film, Peyton List plays a female police detective in 2016 who discovers that she is able to speak via a ham radio with her estranged father (Smith), also a detective, but who died in 1996. They forge a new relationship while working together on an unresolved murder case. However, unintended consequences of the butterfly effect wreak havoc in the present day. In 2015, Smith was seen in a strong arc in Season 4 of the popular ABC musical series Nashville. Playing Markus Keen, an artist signed to Rayna's Highway 65 label, Smith merged his love for music and acting, recording singles, such as \"In the Name of Your Love\" and \"I Want To (Do Everything For You,\" for the Nashville soundtrack. Also in 2015, Smith scored a recurring role as Rachel McAdam's boyfriend, Sheriff's deputy Steve Mercier, on HBO's True Detective, the second installment in the crime franchise. This role followed his previous stint on the pay cable network as a vampire on the seventh and final season of HBO's True Blood. Smith played Keith, a rugged, rock 'n' roll vampire with a romantic side and story line opposite Arlene, played by Carrie Preston. Previously, Smith had recurring roles in the Emmy-nominated CBS series Joan of Arcadia, the highly acclaimed Fox show 24, the WB series Summerland, and Judd Apatow's master creation for NBC Freaks and Geeks. He was a main character in the Fox show Drive and appeared in seven episodes of the fifth season of CW's 90210 as Riley Wallace, a paraplegic opposite Shenae Grimes and Tristan Wilds. He can also be seen in television movies including Disney Channel's Motocrossed and Nicholas Sparks' Deliverance Creek. Smith's other credits were in films as diverse as Radio (Ed Harris, Cuba Gooding Jr.), Eight-Legged Freaks, Not Another Teen Movie, New York Minute, as well as Gallowwalkers (Wesley Snipes), Weapons, the Sundance Grand Jury Nominee, and Christmas in Conway (Andy Garcia, Mary-Louis Parker). Over the past twenty years since Smith has called Los Angeles home, he has managed to complete more than seventy projects: fourteen pilots, nine series, and dozens of guest star roles. In his free time, Smith fronts the band \"The Life of Riley\" as the guitarist and lead singer. The Los Angeles-based group has released three albums to date. Born and raised on his families' Quarter Horse Ranch outside of Cedar Rapids, Iowa, Smith remains involved with his hometown supporting the Eastern Iowa Arts Academy. This non-profit after school arts organization, created for K-12th grade students, offers classes in art, music, drama, dance, cultural arts, and creative writing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc3Mjc3Njk0MF5BMl5BanBnXkFtZTcwOTA1NTMyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0809720","name":"Riley Smith","idIMDB":"nm0809720"},"actorId":"nm0809720","character":"Tommy Harris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary-Louise Parker","urlProfile":"http://www.imdb.com/name/nm0000571","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE1MTc4ODQ5N15BMl5BanBnXkFtZTcwOTM4NTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1964","placeOfBirth":" Fort Jackson, South Carolina, USA","height":"5' 7½\" (1.71 m)","bio":"Southern-bred Mary-Louise Parker, from Fort Jackson, South Carolina, was born on August 2, 1964, the youngest of four born to Judge John Morgan Parker and the former Caroline Louise Morell. She comes from Swedish, English, Scottish, Scotch-Irish, German, and Dutch ancestry. Her father's occupation took the family both around the country and abroad while growing up. Parker showed potential in her teens and majored in acting in her college years, graduating from the North Carolina School of the Arts. Beginning her acting career with a part on the daytime soap Ryan's Hope (1975), Mary decided to test the waters in New York, and after work on the off-Broadway stage in the late 1980s, made her Broadway debut with \"Prelude to a Kiss\" in 1990, where she won the Theatre World Award, the Clarence Derwent Award and a Tony nomination. Films and TV quickly followed and she quickly gained attention. She provided both poignant and amusing as the token femme friend to a group of gay men in the AIDS drama Longtime Companion (1989), but really caught fire with her feisty, standout performance in Fried Green Tomatoes (1991), holding her own against such female powerhouses as Jessica Tandy, Kathy Bates and Mary Stuart Masterson. Dubbed by some as the \"long-suffering girl next door\", she played such noble offbeat miserables and cast-asides in Grand Canyon (1991), Naked in New York (1993), Bullets Over Broadway (1994), The Client (1994) Boys on the Side (1995), in which she was the AIDS victim this time, The Portrait of a Lady (1996), The Maker (1997), Let the Devil Wear Black (1999), Dragon rouge (2002) and Pipe Dream (2002). Preferring quality over quantity, she perfected her craft with offbeat roles in independent features and did not abandon her theater roots. She copped a slew of acting prizes for her stage work in \"How I Learned to Drive\" (1996) and, most notably, \"Proof\" in 2000, wherein she won nearly every award there is to attain, including the prestigious Tony. Her marquee name still does not command what it should, but a picture or production with Mary-Louise Parker in it usually guarantees a strong critical reception. Unmarried, she did enter into a longtime companionship with actor Billy Crudup after the twosome appeared opposite each other in the 1996 play, \"Bus Stop\". They went their separate ways in 2003, amid major controversy (she was pregnant at the time). Mary Louise continues to divide her time equally and skillfully on TV, film and the stage. The powerful TV miniseries adaptation of Tony Kushner heralded award-winning Broadway play Angels in America (2003), directed by Mike Nichols, earned the actress supporting performance Golden Globe and Emmy awards. She also earned a Tony nomination for the Broadway show, \"Reckless\", a year later but truly turned heads and wowed audiences the year after that in the highly acclaimed 7-season HBO series Weeds (2005), earning another Golden Globe and several Emmy nominations for her amazing performance as Nancy Botwin, a relatively naïve suburban housewife and mother who courts serious trouble with the law and drug cartels when she turns into a neighborhood drug dealer for sustenance after her husband dies suddenly. Since then she has appeared in RED 2 (2013), R.I.P.D. (2013), Jamesy Boy (2014), Behaving Badly (2014), Chronically Metropolitan (2016) Adopting a second child from Ethiopia, Mary Louise was acknowledged in 2013 for her significant contributions to Hope North, an organization that works in the educating and healing of young victims caught in Uganda's civil war. Her memoir-in-letters, Dear Mr. You, came out in 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE1MTc4ODQ5N15BMl5BanBnXkFtZTcwOTM4NTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000571","name":"Mary-Louise Parker","idIMDB":"nm0000571"},"actorId":"nm0000571","character":"Suzy Mayor","urlCharacter":"http://www.imdb.com/character/ch0411151","main":true},{"actorName":"Ric Reitz","urlProfile":"http://www.imdb.com/name/nm0718680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGMwZjhkMGMtYzFjYS00NDc3LWIyOTMtMzQxNzcxM2JjYTIwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1955","placeOfBirth":" Rochester, New York, USA","birthName":"Kenric Lowell Reitz","height":"6' (1.83 m)","bio":"Ric is an actor, writer, composer, director and producer who has been active in show business for more than 40 years. Born in Rochester, New York, he attended Bowling Green State Univeristiy in Ohio and graduated with honors in Radio-TV-Film, Theater and Marketing. He began his professional acting career with the N.Y. repertory company, Arts Centre Theater, before touring and branching out into film and television in New York, Los Angeles and Atlanta. He is a member of Actor's Equity Associciation (AEA), Broadcast Music, Inc. (BMI), the Director's Guild of America (DGA), the Recording Academy (NARAS), the National Association of Television Arts & Sciences (NATAS), the Screen Actor's Guild - American Federation of Television and Radio Artists (SAG-AFTRA) and the Writer's Guild of America (WGA). He is also president of Ric Reitz Writes, Inc. and Sir Fir Books & Music. With wife Noel, he has two children and still splits his time between America's \"three coasts\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGMwZjhkMGMtYzFjYS00NDc3LWIyOTMtMzQxNzcxM2JjYTIwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0718680","name":"Ric Reitz","nicknames":["Ric"],"idIMDB":"nm0718680"},"actorId":"nm0718680","character":"Sheriff Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Jeffrey Miller","urlProfile":"http://www.imdb.com/name/nm0007002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTM4MjM0Nl5BMl5BanBnXkFtZTcwODg4NzA3Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1953","placeOfBirth":" Terre Haute, Indiana, USA","bio":"Mark Jeffrey Miller was born on June 9, 1953 in Terre Haute, Indiana, USA. He is an actor and writer, known for Outsiders (2016), The Hunger Games: Mockingjay - Part 2 (2015) and Cold Mountain (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTM4MjM0Nl5BMl5BanBnXkFtZTcwODg4NzA3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007002","name":"Mark Jeffrey Miller","idIMDB":"nm0007002"},"actorId":"nm0007002","character":"Henry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Perrow","urlProfile":"http://www.imdb.com/name/nm3802732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzc4ZDU0YmItNzI3My00MmNiLWEwMGEtZDIyNjRkMDc5MmFhL2ltYWdlXkEyXkFqcGdeQXVyMjQyMzIyNjM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Greg Perrow is an actor, known for Mean Girls 2 (2011), Christmas in Conway (2013) and Tomboy (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzc4ZDU0YmItNzI3My00MmNiLWEwMGEtZDIyNjRkMDc5MmFhL2ltYWdlXkEyXkFqcGdeQXVyMjQyMzIyNjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3802732","name":"Greg Perrow","idIMDB":"nm3802732"},"actorId":"nm3802732","character":"Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Davis","urlProfile":"http://www.imdb.com/name/nm1151921","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIzNzQ3MzY5M15BMl5BanBnXkFtZTgwNjYwMzI0NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Jason Davis was born in Pine Bluff, Arkansas, USA. He is an actor and producer, known for The Accountant (2016), Talladega Nights: The Ballad of Ricky Bobby (2006) and Step Brothers (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIzNzQ3MzY5M15BMl5BanBnXkFtZTgwNjYwMzI0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1151921","name":"Jason Davis","idIMDB":"nm1151921"},"actorId":"nm1151921","character":"Doctor Emmons","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrea Powell","urlProfile":"http://www.imdb.com/name/nm0004632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA0MTU1NjM2M15BMl5BanBnXkFtZTcwMzA3NjQ3Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1965","placeOfBirth":" Valdosta, Georgia, USA","height":"5' 7\" (1.7 m)","bio":"Andrea Powell was born on October 17, 1965 in Valdosta, Georgia, USA. She is an actress, known for Ender's Game (2013), The Twilight Saga: Breaking Dawn - Part 2 (2012) and Get Low (2009). She has been married to Paul Ferguson since October 15, 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA0MTU1NjM2M15BMl5BanBnXkFtZTcwMzA3NjQ3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004632","name":"Andrea Powell","idIMDB":"nm0004632"},"actorId":"nm0004632","character":"Jean","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Weetman","urlProfile":"http://www.imdb.com/name/nm0917430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjcxOTY0OF5BMl5BanBnXkFtZTgwOTY5MDI1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Barbara Weetman is an actress, known for The Notebook (2004), Stuck in Love (2012) and Jessabelle (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjcxOTY0OF5BMl5BanBnXkFtZTgwOTY5MDI1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0917430","name":"Barbara Weetman","idIMDB":"nm0917430"},"actorId":"nm0917430","character":"Patty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Theodus Crane","urlProfile":"http://www.imdb.com/name/nm4297645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyMjMxMjg2OF5BMl5BanBnXkFtZTgwNTAyODcyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1979","placeOfBirth":" USA","height":"6' 8\" (2.03 m)","bio":"Known for playing bold characters in dramas like the affable 'Big Tiny' in AMC's \"The Walking Dead\" and the brooding and powerful 'Zeke' in WGN's \"Underground\", and in comedies like 'Ron' in \"Here Comes Rusty\" and 'Cleaver Williams' in \"The Starving Games\", Theodus Crane has broad range and a genuine quality that resonates with audiences. Theodus has worked with some of the best in the business. He's been opposite Oscar winners Robert DeNiro and Renee Zellweger and taken direction from the likes of Emmy winner Anthony Hemmingway and Demian Bichir. And let's not forget his growing stunt resume! Theodus does his own stunts as well as doubling series regular Nonso Anozie on \"Zoo\", so he's worked with some of the best second units in the world! 2017 will be an exciting year for Theodus with the release of \"Same Kind of Different as Me\" Starring Renee Zellweger, Jon Voight, Greg Kinnear, and Djimon Hounsou in Feb 2017, \"Heart Baby\" starring Gbenga Akkinagbe set to release early 2017, along with \"Sex Guaranteed\", \"Camera Store\", and \"Un Cuento de Circo: A Love Story\". When he isn't working, Theodus is training, whether it's comedy at legendary improv schools the Groundlings, UCB or The PIT, some of NY's best acting coaches, or martial arts. Theodus believes in utilizing every tool in the bag. \"Even the finest sword plunged into salt water will eventually rust. -Sun Tzu","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyMjMxMjg2OF5BMl5BanBnXkFtZTgwNTAyODcyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4297645","name":"Theodus Crane","idIMDB":"nm4297645"},"actorId":"nm4297645","character":"Lonnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Drago","urlProfile":"http://www.imdb.com/name/nm0236719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzkyMjQ5M15BMl5BanBnXkFtZTgwMzY3ODA1MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Joe Drago is known for his work on The Godfather: Part III (1990), Smokin' Aces (2006) and City Island (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzkyMjQ5M15BMl5BanBnXkFtZTgwMzY3ODA1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236719","name":"Joe Drago","idIMDB":"nm0236719"},"actorId":"nm0236719","character":"Cousin Pete","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jus Riddick","urlProfile":"http://www.imdb.com/name/nm3283332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjExOTcwOF5BMl5BanBnXkFtZTgwMzc5MjE1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Justin Stuart Riddick","height":"6' 3½\" (1.92 m)","bio":"Jus Riddick was born on June 1 in Atlanta, Georgia to parents Dr. Thomas Riddick, an internist specializing in gastroenterology, and Debora, a cytogeneticist at Emory University. Jus also has a younger sister, Kady. From a very early age, he showed an interest in acting as well as film. He attended Woodward Academy in College Park, Georgia from kindergarten until high school graduation -- 13 years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjExOTcwOF5BMl5BanBnXkFtZTgwMzc5MjE1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3283332","name":"Jus Riddick","nicknames":["J.R."],"idIMDB":"nm3283332"},"actorId":"nm3283332","character":"Deputy Boltbee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karanai Ravenscroft","urlProfile":"http://www.imdb.com/name/nm2243621","urlPhoto":"","biography":{"height":"5' 6\" (1.68 m)","bio":"Karanai Ravenscroft is an actress and producer, known for Christmas in Conway (2013), World Apart (2009) and A Reading of Tristan & Isolde (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2243621","name":"Karanai Ravenscroft","idIMDB":"nm2243621"},"actorId":"nm2243621","character":"Judge #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3072182","urlIMDB":"http://www.imdb.com/title/tt3072182","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© 2013 Hallmark Hall of Fame Productions, Inc."},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.9","filmingLocations":[{"location":"Wilmington, North Carolina, USA"}],"rated":"TV-PG","awards":[{"award":"MovieGuide Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Faith and Freedom Award","categories":[{"category":"","names":[]}]},{"titleAwardOutcome":"Nominated Free Enterprise Award","categories":[{"category":"","names":[]}]}]}],"votes":"1,186","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0086397","name":"Sony Pictures Television"},{"idCompany":"co0078555","name":"Hallmark Hall of Fame Productions"}],"keywords":{"keywords":["ferris wheel","neighbor","nurse","dying wife","husband wife relationship","terminal illness","christmas","sheriff","christmas present","fall from height","feud","small town","nosy neighbor","second chance","christmas decorations"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:10:08"}}