{"data":{"movies":[{"title":"Kelly & Cal","originalTitle":"","year":"2014","releaseDate":"20140307","directors":[{"name":"Jen McGowan","id":"nm0569653"}],"writers":[{"name":"Amy Lowe Starbin","id":"nm5832218"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTI1NjczNV5BMl5BanBnXkFtZTgwMzY4NDc0MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Kelly, a punk-rocker turned suburban mom, is nostalgic for a life she can no longer have and uncertain of a future she doesn't yet fit in. Seventeen-year-old Cal is frustrated at his lack of control over the hand he's been dealt. When the two strike up an unlikely friendship, it's the perfect spark needed to thrust them both back to life.","simplePlot":"Kelly, a punk-rocker turned suburban mom, is nostalgic for a life she can no longer have and uncertain of a future she doesn't yet fit in. Seventeen-year-old Cal is frustrated at his lack ... ","actors":[{"actorName":"Juliette Lewis","urlProfile":"http://www.imdb.com/name/nm0000496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1973","placeOfBirth":" Los Angeles, California, USA","height":"5' 6\" (1.68 m)","bio":"Juliette Lewis has been recognized as one of Hollywood's most talented and versatile actors of her generation since she first stunned audiences and critics alike with her Oscar-nominated performance as \"Danielle Bowden\" in Cape Fear (1991). To date, she has worked with some of the most revered directors in the industry, including Martin Scorsese, Woody Allen, Lasse Hallström, Oliver Stone and Garry Marshall. Whether lending dramatic authenticity or a natural comedic flair to her roles, Lewis graces the screen with remarkable range and an original and captivating style. Lewis was born in Los Angeles, Californa, to Glenis (Duggan) Batley, a graphic designer, and Geoffrey Lewis, an actor. By the age of six, she knew she wanted to be a performer. At twelve, Lewis landed her first leading role in the Showtime miniseries Home Fires (1987). After appearing in several TV sitcoms including The Wonder Years (1988), she made her move to film, starring with Chevy Chase in National Lampoon's National Lampoon's Christmas Vacation (1989) and with Jennifer Jason Leigh in the drama Crooked Hearts (1991). At 16, Lewis starred opposite Brad Pitt in the critically acclaimed television movie Too Young to Die? (1990), catching the attention of Martin Scorsese, who cast her in his thriller Cape Fear (1991). Her powerful scenes with Robert De Niro captured the quiet complexities of adolescence and earned her an Oscar nomination and Golden Globe nomination for \"Best Supporting Actress\". Her auditorium scene with De Niro went down in movie history as one of cinema's classic scenes. Lewis next worked with Woody Allen in Husbands and Wives (1992), playing a self-assured college coed with a penchant for older men and, particularly, her married professor. She quickly followed suit with a succession of starring roles in a variety of blockbusters and critically acclaimed projects including Kalifornia (1993), Romeo Is Bleeding (1993), What's Eating Gilbert Grape (1993) and Natural Born Killers (1994), Oliver Stone's controversial media satire about two mass murderers who become legendary folk heroes. Lewis's other credits include the Nora Ephron comedy Mixed Nuts (1994), with Steve Martin and Adam Sandler; the sci-fi action film Strange Days (1995) with Ralph Fiennes and Angela Bassett; Quentin Tarantino's vampire tale From Dusk Till Dawn (1996) with George Clooney; The Evening Star (1996) with Shirley MacLaine; the Garry Marshall-directed The Other Sister (1999), and Todd Phillips' Old School (2003), co-starring opposite Luke Wilson, Vince Vaughn, and Will Ferrell as well as Starsky & Hutch (2004). In addition to her film career, Lewis has continued to add roles to her growing list of television credits with a performance in Showtime's My Louisiana Sky (2001), for which she secured an EMMY nomination, and a starring role in the Mira Nair-directed HBO's film Hysterical Blindness (2002), alongside Uma Thurman and Gena Rowlands. After a six-year hiatus from film to pursue her burgeoning music career exclusively, Lewis announced her return to acting with a handful of upcoming movies. Juliette starred alongside Ellen Page, Marcia Gay Harden, Kristen Wiig and Jimmy Fallon in the comedy Whip It (2009). The film was released by Fox Searchlight on October 2nd, 2009. Directed by Drew Barrymore, the film tells the story of an ex-beauty pageant contestant that leaves her crowns behind after joining a roller derby team. Lewis plays \"Iron Maven\", the star of a top derby team. Next, she joined the cast of the acclaimed European animated thriller Metropia (2009), as the voice of \"Nina\". She also appeared in the romantic comedy The Switch (2010), opposite Jennifer Aniston, Jason Bateman and Patrick Wilson. The film tells the story of a single mother (Aniston) who decides to have a child using a sperm donor. Juliette plays \"Debbie Epstein\", the best friend of Aniston's character. Lewis also appears in Sympathy for Delicious (2010), Mark Ruffalo's directorial debut. The film follows a paralyzed DJ, struggling to survive on the streets of LA who turns to faith healing and mysteriously develops the ability to cure the sick. Juliette plays \"Ariel\", costarring alongside Orlando Bloom, Mark Ruffalo and Laura Linney. The film took home the US Dramatic Special Jury Prize at the 2010 Sundance Film Festival. Most recently, Juliette Lewis appears in the indie-drama Conviction (2010), which stars Hilary Swank, Melissa Leo, Minnie Driver and Sam Rockwell. She plays \"Roseanna Perry\" in the true story of an unemployed single mother (Swank) who saw her brother begin serving a life sentence in 1983 for murder and robbery. The role has won Lewis praise from audiences and critics, alike, for her performance, with USA Today saying, \"Juliette Lewis has an indelible role\" and the San Francisco Chronicle saying \"Her character work should be studied in schools. Just remarkable\". In addition to Conviction (2010), Lewis also makes a cameo in Todd Phillips' comedy, Due Date (2010), starring Robert Downey Jr., Michelle Monaghan and Zach Galifianakis. Beginning in 2004, Juliette took a hiatus from acting to embark on a musical journey. After six years, two full length albums and countless high profile tours and festival gigs with her band, 'Juliette & the Licks', Juliette set out on a solo career. Releasing \"Terra Incognita\" last fall, the album has taken her all across the world from Europe to Japan to Turkey, Australia, North America and Canada. For more information on Juliette Lewis' music, please visit her MySpace page. Juliette Lewis resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000496","name":"Juliette Lewis","idIMDB":"nm0000496"},"actorId":"nm0000496","character":"Kelly","urlCharacter":"http://www.imdb.com/character/ch0475829","main":true},{"actorName":"Jonny Weston","urlProfile":"http://www.imdb.com/name/nm4103976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDU5OTYyNF5BMl5BanBnXkFtZTgwMDY5NTU5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Jonny Weston was born in 1988 and was raised in Charleston, South Carolina. After turning 18, he went to the University of South Carolina in Columbia, SC, where he took a theatre class, fell in love with acting and decided to pursue it. He is probably most known for his part as Jay Moriarty in Chasing Mavericks (2012), but he's also been in movies like Someday This Pain Will Be Useful to You (2011), John Dies at the End (2012), Under the Bed (2012), Sugar (2013), Project Almanac (2015), and We Are Your Friends (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNDU5OTYyNF5BMl5BanBnXkFtZTgwMDY5NTU5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4103976","name":"Jonny Weston","idIMDB":"nm4103976"},"actorId":"nm4103976","character":"Cal","urlCharacter":"http://www.imdb.com/character/ch0475830","main":true},{"actorName":"Josh Hopkins","urlProfile":"http://www.imdb.com/name/nm0005020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNDMyNDM3MTVeQTJeQWpwZ15BcmVzdW1l._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1970","placeOfBirth":" Lexington, Kentucky, USA","birthName":"William Joshua Hopkins","height":"6' 2\" (1.88 m)","bio":"Josh Hopkins was born on September 12, 1970 in Lexington, Kentucky, USA as William Joshua Hopkins. He is an actor, known for Cougar Town (2009), The Perfect Storm (2000) and G.I. Jane (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNDMyNDM3MTVeQTJeQWpwZ15BcmVzdW1l._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005020","name":"Josh Hopkins","idIMDB":"nm0005020"},"actorId":"nm0005020","character":"Josh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cybill Shepherd","urlProfile":"http://www.imdb.com/name/nm0001732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTA1Mzg5M15BMl5BanBnXkFtZTYwNjkzNDk3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1950","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Cybill Lynne Shepherd","height":"5' 8\" (1.73 m)","bio":"Cybill Lynne Shepherd was born in Memphis, Tennessee, to Patty, a homemaker, and William Shepherd, a small business owner. Named after her grandfather, Cy, and her father, Bill, Shepherd's career began at a young age in modeling, when she won the \"Miss Teenage Memphis\" contest in 1966 and the \"Model of the Year\" contest in 1968. She became a fashion icon and went on to grace the cover of every major magazine, as well as famously act as spokesperson for L'Oreal. This lead to her acting and on her screen debut in Peter Bogdanovich's The Last Picture Show (1971). Nominated for Most Promising Newcomer, Shepherd continued to build her film career with influential roles in The Heartbreak Kid (1972) and Taxi Driver (1976). After taking a break in her career to have her first child, Clementine Ford, she returned to Hollywood in 1983, to make her television series debut in an episode of Fantasy Island (1977). She went on to star with Bruce Willis in the highly recognized show, Moonlighting (1985), and won Shepherd two Golden Globe Awards. Her third Golden Globe followed for her series, Cybill (1995), with which she also took on a producer role. Aside from the film industry, Shepherd has been an outspoken activist for issues such as gay rights and abortion rights. In 2009, she was honored by the Human Rights Campaign in Atlanta to accept one of two National Ally for Equality awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTA1Mzg5M15BMl5BanBnXkFtZTYwNjkzNDk3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001732","name":"Cybill Shepherd","idIMDB":"nm0001732"},"actorId":"nm0001732","character":"Bev","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lucy Owen","urlProfile":"http://www.imdb.com/name/nm2543501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1NDY1NjQyMV5BMl5BanBnXkFtZTgwNzA1NDk1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Lucy Owen is an actress, known for The Mend (2014), Kelly & Cal (2014) and Ricki and the Flash (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1NDY1NjQyMV5BMl5BanBnXkFtZTgwNzA1NDk1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2543501","name":"Lucy Owen","idIMDB":"nm2543501"},"actorId":"nm2543501","character":"Julie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Marks","urlProfile":"http://www.imdb.com/name/nm0548880","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODk5NzM2MF5BMl5BanBnXkFtZTgwMTI5NDQ0MDI@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Ken Marks is an actor, known for Side Effects (2013), The Wackness (2008) and Kelly & Cal (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODk5NzM2MF5BMl5BanBnXkFtZTgwMTI5NDQ0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0548880","name":"Ken Marks","idIMDB":"nm0548880"},"actorId":"nm0548880","character":"Bill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Colin","urlProfile":"http://www.imdb.com/name/nm0171513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg4NTMyNTcxMl5BMl5BanBnXkFtZTcwNDc2MTU5Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1958","placeOfBirth":" Brooklyn, New York, USA","height":"5' 9¾\" (1.77 m)","bio":"Margaret Colin was born in Brooklyn, New York and raised on Long Island. She graduated from Baldwin Senior High School in 1976. Margaret began acting in The Edge of Night (1956) (her character was a heiress and former terrorist, with seven murder attempts), and was employed next on As the World Turns (1956), portraying character Margo Montgomery. Margaret's first film appearance were as a teacher in John Hughes's Pretty in Pink (1986), followed by a role in Jonathan Demme's Something Wild (1986), where she played Irene, girlfriend to Ray Liotta's character. The following year, she had supporting roles in Like Father Like Son (1987), and 3 Men and a Baby (1987). In film, Margaret either had minor, or supporting, roles; it's her work in television that perhaps makes her most memorable. Ms Colin continued acting with parts in Chicago Hope (1994), and The Wright Verdicts (1995). In 2000, Margaret earned a Saturn Award for Best Genre TV Actress for her role as Lisa Wiseman in the series Now and Again (1999). From 2007 to 2013, she played Eleanor Waldorf in the series Gossip Girl (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg4NTMyNTcxMl5BMl5BanBnXkFtZTcwNDc2MTU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171513","name":"Margaret Colin","idIMDB":"nm0171513"},"actorId":"nm0171513","character":"Janice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scarlett Giuliano","urlProfile":"http://www.imdb.com/name/nm6732083","urlPhoto":"","biography":{"bio":"Scarlett Giuliano is an actress, known for Kelly & Cal (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6732083","name":"Scarlett Giuliano","idIMDB":"nm6732083"},"actorId":"nm6732083","character":"Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Serafina Giuliano","urlProfile":"http://www.imdb.com/name/nm6732084","urlPhoto":"","biography":{"bio":"Serafina Giuliano is an actress, known for Kelly & Cal (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6732084","name":"Serafina Giuliano","idIMDB":"nm6732084"},"actorId":"nm6732084","character":"Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Barabas","urlProfile":"http://www.imdb.com/name/nm3455188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmQ3YWM2NDYtYTc0Ni00MmU3LTk4ODYtNTZkNjUyYjRmY2E4XkEyXkFqcGdeQXVyMjEzMzAxNjQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Victoria Barabas is an actress and writer, known for WingWoman (2016), NCIS (2003) and White Collar (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmQ3YWM2NDYtYTc0Ni00MmU3LTk4ODYtNTZkNjUyYjRmY2E4XkEyXkFqcGdeQXVyMjEzMzAxNjQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3455188","name":"Victoria Barabas","idIMDB":"nm3455188"},"actorId":"nm3455188","character":"Mommy #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Grace","urlProfile":"http://www.imdb.com/name/nm4025652","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTM0NzY4N15BMl5BanBnXkFtZTgwODY3NjY3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jennifer Grace is an actress, known for Kelly & Cal (2014), The Casserole Club (2011) and Hell Town (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTM0NzY4N15BMl5BanBnXkFtZTgwODY3NjY3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4025652","name":"Jennifer Grace","idIMDB":"nm4025652"},"actorId":"nm4025652","character":"Mommy #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chivonne Michelle","urlProfile":"http://www.imdb.com/name/nm4617515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTc3NjMyN15BMl5BanBnXkFtZTgwMDI5Njc3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Chivonne Michelle was born in Victoria, B.C. Canada but was raised all over the world courtesy of her father's U.S. Military career. She is a graduate of the acting program at the Atlantic Theater Company and received her B.F.A. from New York University. After graduation, Chivonne was cast as \"Iras\" in William Shakespeare's Antony and Cleopatra, starring Kate Mulgrew and John Douglas Thompson, directed by Tina Landau at Hartford Stage. She produced and starred in \"The Downtown Girls\" web series which was an LA Web Series Festival Official Selection and won Best Ensemble Cast in a Comedy Series .","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTc3NjMyN15BMl5BanBnXkFtZTgwMDI5Njc3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4617515","name":"Chivonne Michelle","idIMDB":"nm4617515"},"actorId":"nm4617515","character":"Nikki","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alysia Reiner","urlProfile":"http://www.imdb.com/name/nm1130496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODEwODA1NF5BMl5BanBnXkFtZTcwNDYyOTQ3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1970","placeOfBirth":" Gainesville, Florida, USA","birthName":"Alysia Michelle Davis Reiner","height":"5' 11\" (1.8 m)","bio":"Alysia is best know for her role as Natalie \"Fig\" Figueroa, the tough as nails assistant warden everyone loves to hate on the Netflix hit series \"Orange Is The New Black.\" Alysia won a Screen Actors Guild award as part of the amazing ensemble cast, you can see her in all 4 binge-worthy seasons. You can also catch her as Sunny in the new F/X show \"Better Things,\" brought to you by the inimitable Louie CK and Pamela Adlon, and in Season 4 of Showtime's \"Masters Of Sex.\" Additionally she plays District Attorney Wendy Parks on ABC's \"How To Get Away With Murder,\" Lilian Izikoff on \"Rosewood,\" and Fiona in Michael Showalter's new TNT series \"Search Party.\" On the film front, Alysia stars with Anna Gunn in \"Equity,\" the first ever female driven Wall Street film, which she also produced. The film premiered at Sundance in January 2016, was immediately acquired by Sony Pictures Classics, and was released in theaters nationwide. It's now being developed into a TV series by Tri-Star and ABC. \"Equity\" was Alysia's first feature as actress AND producer, but in 2016 she was busy as an actor starring in \"School Spirits,\" \"Shine,\" and Whitney Cummings' \"The Female Brain.\" She feels so blessed to have worked with so many film masters from Alexander Payne in the Oscar winning \"Sideways,\" to Jodie Foster, to the amazing Meera Menon - the director of \"Equity.\" Alysia loves working as a change maker for women, and has been invited to THE WHITE HOUSE, THE UNITED NATIONS, S.H.E. SUMMIT, GOOGLE, and CANNES LION to speak about breaking barriers for women in all fields. Additionally, she was awarded the SARAH POWELL HUNTINGTON LEADERSHIP AWARD by the Women's Prison Association, and this year was honored with the VOICE OF A WOMAN AWARD, the PIONEER IN FILMMAKING AWARD, and the FOUNDERS AWARD FOR SUPPORT. She was recognized as an INTELLIGENT OPTIMIST in Ode Magazine and profiled by New York Women in Film and Television as a woman to watch.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODEwODA1NF5BMl5BanBnXkFtZTcwNDYyOTQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1130496","name":"Alysia Reiner","idIMDB":"nm1130496"},"actorId":"nm1130496","character":"Trish","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Meghan Rafferty","urlProfile":"http://www.imdb.com/name/nm1532763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MzY4ODM4NV5BMl5BanBnXkFtZTgwODQwNDk3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Meghan Rafferty is known for her work on The Wolf of Wall Street (2013), Shutter Island (2010) and Aviator (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MzY4ODM4NV5BMl5BanBnXkFtZTgwODQwNDk3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1532763","name":"Meghan Rafferty","idIMDB":"nm1532763"},"actorId":"nm1532763","character":"Jess","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lusia Strus","urlProfile":"http://www.imdb.com/name/nm0835363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzY2ODkyOV5BMl5BanBnXkFtZTgwNTY5MjM4MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Lusia Strus was born in Chicago, Illinois, USA. She is an actress, known for Good Behavior (2016), Wayward Pines (2015) and 50 First Dates (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MzY2ODkyOV5BMl5BanBnXkFtZTgwNTY5MjM4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835363","name":"Lusia Strus","idIMDB":"nm0835363"},"actorId":"nm0835363","character":"Mitzi","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3082826","urlIMDB":"http://www.imdb.com/title/tt3082826","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus 4:3, Hawk V-Series Lenses"],"laboratory":["LightIRON Digital, Los Angeles (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Hawk Scope (anamorphic) (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"6.2","metascore":"64","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[{"award":"SXSW Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won SXSW Gamechanger Award","categories":[{"category":"","names":[{"name":"Jen McGowan","id":"nm0569653","role":null}]}]},{"titleAwardOutcome":"Nominated Audience Award","categories":[{"category":"Narrative Spotlight","names":[{"name":"Jen McGowan","id":"nm0569653","role":null}]}]}]}],"votes":"1,542","type":"Movie","companyCreditsSimple":[{"idCompany":"co0295516","name":"Spring Pictures"},{"idCompany":"co0036014","name":"Mad Dog Pictures"},{"idCompany":"co0582944","name":"Mountaintop Productions"}],"keywords":{"keywords":["title directed by female","adolescent boy","adolescent","art exhibition","artist","statue","mother in law","teenage boy","teenager","reference to auguste rodin","husband wife relationship","female rear nudity","female frontal nudity","female nudity","taking off clothes","pottery","voyeurism","voyeur","reference to tony randall","makeover","bare chested male","drumming","playing guitar","guitar","audio cassette","female protagonist","wheelchair bound","neighbor neighbor relationship","neighbor","female in shower","taking a shower","shower","vibrator","crying child","reference to george clooney","female masturbation","masturbation","masturbation reference","watching tv","child","gynecologist","motherhood","pregnant woman","pregnancy","mother","female punk rocker","grrrl","older woman younger man relationship","wheelchair"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:56:08"}}