{"data":{"movies":[{"title":"Tinker Bell and the Legend of the NeverBeast","originalTitle":"","year":"2014","releaseDate":"20150303","directors":[{"name":"Steve Loter","id":"nm0521425"}],"writers":[{"name":"Steve Loter","id":"nm0521425"},{"name":"Tom Rogers","id":"nm0737241"}],"runtime":"76 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDQ0ODcwNV5BMl5BanBnXkFtZTgwNDU5NTgxMzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Adventure","Family","Fantasy"],"plot":"Fun and talented animal fairy Fawn believes you can't judge a book by its cover, or an animal by its fangs, so she befriends a huge and mysterious creature known as the NeverBeast. While Tinkerbell and her friends aren't so sure about this scary addition to Pixie Hollow, the elite Scout Fairies set out to capture the monster before he destroys their home. Fawn must trust her heart and take a leap of faith if she hopes to rally the girls to save the NeverBeast.","simplePlot":"Fun and talented animal fairy Fawn believes you can't judge a book by its cover, or an animal by its fangs, so she befriends a huge and mysterious creature known as the NeverBeast. While ... ","actors":[{"actorName":"Ginnifer Goodwin","urlProfile":"http://www.imdb.com/name/nm0329481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MTA2MDg4MF5BMl5BanBnXkFtZTgwMTgwMTU5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1978","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Jennifer Michelle Goodwin","height":"5' 6\" (1.68 m)","bio":"Ginnifer Goodwin was born Jennifer Michelle Goodwin on May 22, 1978, in Memphis, Tennessee, to Linda (Kantor), who worked at FedEx, and Tim Goodwin, who had a recording studio. Bright and talented, Ginnifer carried her love for theater and acting through her high school years. She graduated from Lausanne Collegiate School in 1996 and spent a year at Hanover before going to Boston University where she received her BFA in Acting. She went on to receive accolades in London, including receiving a Certificate from the Royal Academy of Dramatic Art and trained with the Royal Shakespeare Company. She lived briefly in New York before moving to California, where she lives. She made her television debut on the series Law & Order (1990) but had her first recurring television role on Ed (2000) in 2001. Her first movie role was Maya in the first Comedy Central original movie Porn 'n Chicken (2002). She then went on to shine as Connie Baker in the major motion picture hit Mona Lisa Smile (2003). Ginnifer appeared in the movie Walk the Line (2005), where she played Johnny Cash's first wife. She also worked on the television drama Big Love (2006) with Bill Paxton and Jeanne Tripplehorn. In 2016 Ginnifer voiced bunny officer Judy Hopps in the hit Disney movie 'Zootopia'. Ginnifer married actor Josh Dallas in 2014. Their first child, a son, was born that year. She is English (father) and Ashkenazi Jewish (mother) ancestry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MTA2MDg4MF5BMl5BanBnXkFtZTgwMTgwMTU5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0329481","name":"Ginnifer Goodwin","nicknames":["Ginny","Gigi"],"idIMDB":"nm0329481"},"actorId":"nm0329481","character":"Fawn","urlCharacter":"http://www.imdb.com/character/ch0145537","main":true},{"actorName":"Mae Whitman","urlProfile":"http://www.imdb.com/name/nm0926165","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjQxMTU0N15BMl5BanBnXkFyZXN1bWU@._V1._SX600_CR213,1,358,396_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1988","placeOfBirth":" Los Angeles, California, USA","birthName":"Mae Margaret Whitman","height":"5' 1\" (1.55 m)","bio":"Mae was born in Los Angeles, California to Pat Musick, a voice artist, and Jeffrey Whitman, a personal manager and set construction coordinator. She began her career with a voice-over for a Tyson Chicken commercial. Whitman attended Ribét Academy, a private preparatory school in Los Angeles. She was later transferred to Whitefish Bay High School, where she graduated. Whitman made her first silver screen debut playing Meg Ryan's youngest daughter, \"Casey Green\", in When a Man Loves a Woman (1994). Among her notable childhood roles were that of \"Patricia Whitmore\", daughter of the President in Independence Day (1996); George Clooney's daughter, \"Maggie Taylor\", in One Fine Day (1996); and the charming daughter, \"Bernice Pruitt\", of Sandra Bullock, in Hope Floats (1998). As she has grown older, Mae has made several guest appearances in television shows such as JAG (1995), State of Grace (2001), Desperate Housewives (2004), Grey's Anatomy (2005) and Law & Order: Special Victims Unit (1999), just to name a few, as well as some voice-over work. In 2015, she starred in the movie The Duff (2015) portraying a high school student who realized she is the approachable one, the designated ugly fat friend, the DUFF. We should expect to see great things from Mae Whitman as her career progresses, for she has shown what a strong, dynamic, and talented actress she has become.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjQxMTU0N15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926165","name":"Mae Whitman","idIMDB":"nm0926165"},"actorId":"nm0926165","character":"Tinker Bell","urlCharacter":"http://www.imdb.com/character/ch0030675","main":true},{"actorName":"Rosario Dawson","urlProfile":"http://www.imdb.com/name/nm0206257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1979","placeOfBirth":" New York City, New York, USA","birthName":"Rosario Isabel Dawson","height":"5' 7\" (1.7 m)","bio":"This stunning and resourceful actress has been primarily a film player thus far. Only recently has she been opening herself up more to doing television (the series Gemini Division (2008), which she executive-produced), and animated voice-overs. Dawson's powerhouse talent stands out the most in edgy, urban filming that dates back to 1995 when she was only sixteen. A rags-to-riches article entitled \"Rosario Dawson: From Tenement to Tinseltown\" probably says it all. Rosario was born in New York City on May 9, 1979. Her mother, Isabel Celeste, of Puerto Rican and Afro-Cuban descent, is a singer, and her stepfather, who raised her, Greg Dawson, of Irish descent, is a construction laborer. Her parents, who married when both were teenagers, eventually divorced. Rosario and her younger brother, Clay Dawson, had it hard while growing up and was cared for by family members, most of whom were poverty-stricken and some of whom were HIV-positive. Her career actually started as a child when she made a minor showing on the children's show, Sesame Street (1969). As the story goes, she was \"discovered\" as an adolescent on her front porch step by two photographers. One of them, Harmony Korine, was an aspiring screenwriter who thought the inexperienced sixteen-year-old was ideal for the controversial cult film Kids (1995), in which she would portray a sexually active adolescent. It took time for Rosario's film career to kick in after that, but by the late 1990s, she had nabbed several independent films. Since then, she has moved into main-stream hits (and misses) and has surprised viewers with her earthy, provocative, uninhibited approach to her roles. Reflecting New York's tougher, tawdrier side as assorted streetwalkers, homeless mothers, drug addicts, etc., her film highlights have included Light It Up (1999), Edward Burns' Sidewalks of New York (2001), Spike Lee's 25th Hour (2002) and Shattered Glass (2003). For Oliver Stone, she portrayed the duped bride of Colin Farrell's famed B.C. Macedonian warrior, Alexander (2004) (as in \"...the Great\"), which featured a notoriously violent-tinged nude/sex scene. Expanding her horizons beyond film, she has always expressed interest in singing. She hooked up with Prince for the re-release of his 1980s hit \"1999\" and appeared in The Chemical Brothers' video for the song \"Out of Control\" from the album \"Surrender\". She is also featured on the Outkast track, \"She Lives in My Lap\". On stage, she co-starred as Julia in a revival of \"Two Gentlemen of Verona\" at the Public Theater's \"Shakespeare in the Park\" and appeared in \"The Vagina Monologues\". She lucked into and got to show off her singing chops in the film adaptation of the hit New York musical Rent (2005), when Daphne Rubin-Vega, the original Mimi, became pregnant and was unable to reprise her exotic dancer role. Rosario also appeared as a prostitute in the adaptation of the graphic novel Sin City (2005). Of late, she has turned to producing. One of those, Descent (2007), had her playing a college coed who is brutally attacked and raped by a fellow student. Her more popular ventures have thus far included the role of Valerie Brown in the live-action version of the comic strip Josie et les Pussycats (2001), the Will Smith starrer Men in Black II (2002), Eagle Eye (2008) with Shia LaBeouf and Seven Pounds (2008), again with Smith, in which she offered one of her more tender-hearted performances as a woman with a potentially fatal heart condition. Off-camera, the still-single Dawson is highly active in political, social and environmental causes and has been involved with such organizations/charities/campaigns as the Lower East Side Girls Club, Global Cool, the O.N.E. Campaign, Oxfam, Amnesty International, Parents, Families and Friends of Lesbians and Gays, Control Arms, International Rescue Committee, Voto Latino (which she founded), Conservation International, Doctors Without Borders, National Geographic Society, The Nature Conservancy and Save the Children. In October 2008, she lent her voice to the RESPECT! Campaign, a movement aimed at preventing domestic violence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206257","name":"Rosario Dawson","idIMDB":"nm0206257"},"actorId":"nm0206257","character":"Nyx","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lucy Liu","urlProfile":"http://www.imdb.com/name/nm0005154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxODE0MjI5Ml5BMl5BanBnXkFtZTcwMjkxMzMzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1968","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Lucy Alexis Liu","height":"5' 3\" (1.6 m)","bio":"Born to immigrants in Queens, New York, Lucy Liu has always tried to balance an interest in her cultural heritage with a desire to move beyond a strictly Asian-American experience. Lucy's mother, Cecilia, a biochemist, is from Beijing, and her father, Tom Liu, a civil engineer, is from Shanghai. Once relegated to \"ethnic\" parts, the energetic actress is finally earning her stripes as an across-the-board leading lady. Liu graduated from Stuyvesant High School in 1986 and enrolled in New York University; discouraged by the \"dark and sarcastic\" atmosphere of NYU, however, she transferred to the University of Michigan after her freshman year. She graduated from UM with a degree in Chinese Language and Culture, managing to squeeze in some additional training in dance, voice, fine arts, and acting. During her senior year, Liu auditioned for a small part in a production of Alice in Wonderland and walked away with the lead; encouraged by the experience, she decided to take the plunge into professional acting. She moved to Los Angeles and split her time between auditions and food service day jobs, eventually scoring a guest appearance as a waitress on Beverly Hills, 90210 (1990). That performance led to more walk-on parts in shows like NYPD Blue (1993), ER (1994), and The X-Files (1993). In 1996, she was cast as an ambitious college student on Rhea Perlman's ephemeral sitcom Pearl (1996). Liu first appeared on the big screen as an ex-girlfriend in Jerry Maguire (1996) (she had previously filmed a scene in the indie Bang (1995), but it was shelved for two years). She then waded through a series of supporting parts in small films before landing her big break on Ally McBeal (1997). Liu initially auditioned for the role of Nelle Porter, which went to Portia de Rossi, but writer-producer David E. Kelley was so impressed with her that he promised to write a part for her in an upcoming episode. The part turned out to be that of growling, ill-tempered lawyer Ling Woo, which Liu filled with such aplomb that she was signed on as a regular cast member. The \"Ally\" win gave Liu's film career a much-needed boost--in 1999, she was cast as a dominatrix in the Mel Gibson action flick Payback (1999), and as a hitchhiker in the ill-received boxing saga Play It to the Bone (1999). The next year brought even larger roles: first as the kidnapped Princess Pei Pei in Jackie Chan's western Shanghai Noon (2000), then as one-third of the comely crime-fighting trio in Charlie's Angels (2000). When she's not hissing at clients or throwing well-coiffed punches, Liu keeps busy with an eclectic mix of off-screen hobbies. She practices the martial art of Kali-Eskrima-Silat (knife-and-stick fighting), skis, rock climbs, rides horses, and plays the accordion. In 1993 she exhibited a collection of multimedia art pieces at the Cast Iron Gallery in SoHo (New York), after which she won a grant to study and create art in China. Her hectic schedule doesn't leave much time for romantic intrigue, but Liu says she prefers to keep that side of her life uncluttered.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxODE0MjI5Ml5BMl5BanBnXkFtZTcwMjkxMzMzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005154","name":"Lucy Liu","idIMDB":"nm0005154"},"actorId":"nm0005154","character":"Silvermist","urlCharacter":"http://www.imdb.com/character/ch0117892","main":true},{"actorName":"Pamela Adlon","urlProfile":"http://www.imdb.com/name/nm0781899","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTgwOTI4N15BMl5BanBnXkFtZTgwMTEyMTExNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1966","placeOfBirth":" New York City, New York, USA","birthName":"Pamela Fionna Segall","height":"5' (1.52 m)","bio":"Pamela Adlon comes from an acting family and began her career in television in 1983. She has appeared in many popular TV shows, including as a voice actress in a number of animated TV series including, most famously, King of the Hill (1997) for which she won an Emmy for her role as Bobby Hill.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTgwOTI4N15BMl5BanBnXkFtZTgwMTEyMTExNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781899","name":"Pamela Adlon","idIMDB":"nm0781899"},"actorId":"nm0781899","character":"Vidia","urlCharacter":"http://www.imdb.com/character/ch0143731","main":true},{"actorName":"Raven-Symoné","urlProfile":"http://www.imdb.com/name/nm0712368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzM4NTA0Nl5BMl5BanBnXkFtZTcwNzMyOTgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1985","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Raven-Symoné Christina Pearman","height":"5' 2\" (1.57 m)","bio":"Raven-Symoné Pearman was born in Atlanta, Georgia, to Lydia (Gaulden) and Christopher Pearman. At a young age, she moved to New York. While there Raven signed with the Ford Modeling Agency. They sent her out on a audition for a movie called Ghost Dad (1990), which also starred the legendary Bill Cosby. She was deemed too young for the role since was only 3 years old, but Cosby could see she had talent. They asked Raven to come back to read lines, and she did so well that she got a starring role as Olivia on the last three seasons of The Cosby Show (1984). After the show finished its run, she decided to try something new like singing. In 1993, she became the youngest person ever to sign with MCA Records. She also went back to acting with a starring role in Hangin' with Mr. Cooper (1992), alongside Mark Curry and a small role in the TV mini-series Queen (1993). After another small role in the feature film The Little Rascals (1994) and the role of Goldilocks in the TV series Happily Ever After: Fairy Tales for Every Child (1995), \"Hangin' with Mr. Cooper\" ended. Raven's singing career was doing well and she landed a role in Doctor Dolittle (1998) alongside Eddie Murphy and a made-for-TV movie called Zenon: Girl of the 21st Century (1999). She also starred in Dr. Dolittle 2 (2001), but she was not available to do Zenon: The Zequel (2001). However, the Walt Disney Company, which made the Zenon movies, wanted her back to do a pilot for a new Disney TV show called \"Absolutely Psychic,\" in which she would be a supporting character. She impressed them so much that they changed the show's premise to be about her and the show's name was changed to That's So Raven (2003). After the show was a hit she did the made-for-TV movie Les Cheetah Girls (2003) and recorded a new album. A movie based on \"That's So Raven\" may be in the works.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzM4NTA0Nl5BMl5BanBnXkFtZTcwNzMyOTgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712368","name":"Raven-Symoné","nicknames":["Rae","Rave"],"idIMDB":"nm0712368"},"actorId":"nm0712368","character":"Iridessa","urlCharacter":"http://www.imdb.com/character/ch0137045","main":true},{"actorName":"Megan Hilty","urlProfile":"http://www.imdb.com/name/nm2047859","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTgyOTkwMF5BMl5BanBnXkFtZTgwNTE5NjQ2ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1981","placeOfBirth":" Bellevue, Washington, USA","birthName":"Megan Kathleen Hilty","height":"5' 3\" (1.6 m)","bio":"Megan Hilty was born on March 29, 1981 in Bellevue, Washington, USA as Megan Kathleen Hilty. She is an actress, known for The Pirate Fairy (2014), Pixie Hollow Games (2011) and Secret of the Wings (2012). She has been married to Brian Gallagher since November 2, 2013. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTgyOTkwMF5BMl5BanBnXkFtZTgwNTE5NjQ2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2047859","name":"Megan Hilty","idIMDB":"nm2047859"},"actorId":"nm2047859","character":"Rosetta","urlCharacter":"http://www.imdb.com/character/ch0134639","main":true},{"actorName":"Danai Gurira","urlProfile":"http://www.imdb.com/name/nm1775091","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjIyNTc4N15BMl5BanBnXkFtZTgwNzI5NzIyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1978","placeOfBirth":" Grinnell, Iowa, USA","height":"5' 7\" (1.7 m)","bio":"Danai Gurira was born in Grinnell, Iowa to parents from Zimbabwe, when her father was teaching Chemistry at Grinnell College. When she was 5, the family moved back to Zimbabwe. Gurira studied social psychology at Macalaster College, and received an MFA from New York University's Tisch School of the Arts. She is the co-author of the play, \"In the Continuum\", with Nikkole Salter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjIyNTc4N15BMl5BanBnXkFtZTgwNzI5NzIyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1775091","name":"Danai Gurira","idIMDB":"nm1775091"},"actorId":"nm1775091","character":"Fury","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chloe Bennet","urlProfile":"http://www.imdb.com/name/nm4032297","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmYwNDJmMDctZTAyZC00ODgyLTlkODctOTZkODg0ZjBjMDU5XkEyXkFqcGdeQXVyNzM4MDIwOTQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1992","placeOfBirth":" Chicago, Illinois, USA","birthName":"Chloe Wang","height":"5' 5¾\" (1.67 m)","bio":"Chloe Bennet was born Chloe Wang in Chicago, Illinois, to Stephanie, an internist, and Bennet Wang. Her father is of Chinese descent. As a teenager, she moved to Beijing to pursue a singing career. While she was there, she studied Mandarin, learned the demands of international pop stardom and released her debut single, \"Uh Oh\", in both English and Mandarin. She then moved to Los Angeles where, amongst other projects, she worked with Nick Cannon and Aaron Fresh on a Teen Nick series called The Nightlife (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmYwNDJmMDctZTAyZC00ODgyLTlkODctOTZkODg0ZjBjMDU5XkEyXkFqcGdeQXVyNzM4MDIwOTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4032297","name":"Chloe Bennet","idIMDB":"nm4032297"},"actorId":"nm4032297","character":"Chase","urlCharacter":"http://www.imdb.com/character/ch0504605","main":true},{"actorName":"Thomas Lennon","urlProfile":"http://www.imdb.com/name/nm0502073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTMyNjYwMV5BMl5BanBnXkFtZTcwNDI2MjkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1970","placeOfBirth":" Chicago, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Thomas Lennon was born on August 9, 1970 in Chicago, Illinois, USA. He is an actor and producer, known for Night at the Museum (2006), Night at the Museum: Battle of the Smithsonian (2009) and Memento (2000). He has been married to Jenny Robertson since April 27, 2002. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDNmZTc5NDAtZTZiNi00MWE1LWExYWItNjIxZGU0MzBkOGY4XkEyXkFqcGdeQXVyNDQwOTUzMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502073","name":"Thomas Lennon","idIMDB":"nm0502073"},"actorId":"nm0502073","character":"Scribble","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Corwin","urlProfile":"http://www.imdb.com/name/nm0970802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzQwMDk4MF5BMl5BanBnXkFtZTgwMDU0MTY1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1967","placeOfBirth":" Norwell, Massachusetts, USA","birthName":"Jeffrey Samuel Corwin","height":"5' 10\" (1.78 m)","bio":"Jeff Corwin was born on July 11, 1967 in Norwell, Massachusetts, USA as Jeffrey Samuel Corwin. He is a producer and actor, known for Ocean Mysteries with Jeff Corwin (2011), Galapagos: Nature's Wonderland (2014) and Ocean Treks with Jeff Corwin (2016). He is married to Natasha Soultanova-Corwin. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzQwMDk4MF5BMl5BanBnXkFtZTgwMDU0MTY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0970802","name":"Jeff Corwin","nicknames":["Snake Boy"],"idIMDB":"nm0970802"},"actorId":"nm0970802","character":"Buck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivia Holt","urlProfile":"http://www.imdb.com/name/nm3127051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODBiZDY2N2YtZDAzNC00ODRlLThhMjItOGZmYjI1MjY2YzcyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1997","placeOfBirth":" Germantown, Tennessee, USA","birthName":"Olivia Hastings Holt","height":"5' 2\" (1.57 m)","bio":"Olivia Holt was born in Germantown, Tennessee to parents, Mark and Kim Holt. When she was only 3 years old, she started singing and acting on the stage. Besides acting and singing, she has been a competitive gymnastic for the past 5 years, and a competitive cheerleader for the past few years. At Christmas time, Holt moved with her family from DeSoto County to Los Angeles. She starred in numerous community productions, including \"Annie\" and \"Through the Looking Glass\", before landing a role in the indie film, Black and Blue (2009). She also appeared in multiple national TV commercials, including Hasbro, Mattel and Bratz dolls. In 2011, Olivia got her break out role as \"Kim Crawford\", a confident martial artist and the only girl in the dojo who can go toe-to-toe with the boys, in the Disney XD comedy series, Kickin' It (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODBiZDY2N2YtZDAzNC00ODRlLThhMjItOGZmYjI1MjY2YzcyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3127051","name":"Olivia Holt","nicknames":["Liv"],"idIMDB":"nm3127051"},"actorId":"nm3127051","character":"Morgan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grey DeLisle","urlProfile":"http://www.imdb.com/name/nm0217221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MTQxOTUyMl5BMl5BanBnXkFtZTcwMTgxNTExOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1973","placeOfBirth":" Fort Ord, California, USA","birthName":"Erin Grey Van Oosbree","height":"5' 3\" (1.6 m)","bio":"Grey DeLisle was born in Fort Ord, California. She is a singer and well-known voice actress. She was raised by her grandmother through her difficult childhood because her mother was a drug addict. Her grandmother was a singer and performed often with Tito Puente. Grey was highly interested in goth bands, mostly The Cure. Her mother, however, born-again Pentecostal, strictly forbade Grey to listen to goth music. In her late teens, she sang gospel songs. Thanks to that, she became interested in stand-up comedy and started to perform it. She also had a talent for voice impressions, which led to voice acting. DeLisle started in a few animation series and, since then, has been featured in numerous video games. She is best-known for her sinister voice of the evil sister \"Vicky\" in the Nickelodeon TV series, \"Fairly OddParents\" (2001-2013), as well as the equally evil \"Mandy\" in the Cartoon Network TV show, \"The Grim Adventures of Billy and Mandy\" (2001 - 2007). She voiced evil, cold \"Mandy\" again in two more films about Billy and Mandy, \"Billy and Mandy Big Boogie Adventure\" (2007) and \"The Grim Adventures of KND\" (2007), opposite'Richard Steven Horvitz' (Billy) and Greg Eagles (Grim). In 2002, Grey DeLisle married musician Murry Hammond, the bassist for the band, Old 97's. Their first child, Jefferson Texas Hammond, was born in 2007, in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MTQxOTUyMl5BMl5BanBnXkFtZTcwMTgxNTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217221","name":"Grey DeLisle","idIMDB":"nm0217221"},"actorId":"nm0217221","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kari Wahlgren","urlProfile":"http://www.imdb.com/name/nm1312566","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjExMjg2NF5BMl5BanBnXkFtZTgwNjkyMDYyNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1977","placeOfBirth":" Hoisington, Kansas, USA","birthName":"Kari K. Wahlgren","height":"5' 1\" (1.55 m)","bio":"Kari Wahlgren was born on July 13, 1977 in Hoisington, Kansas, USA as Kari K. Wahlgren. She is an actress, known for Kung Fu Panda: Legends of Awesomeness (2011), Rick and Morty (2013) and The Fairly OddParents (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjExMjg2NF5BMl5BanBnXkFtZTgwNjkyMDYyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1312566","name":"Kari Wahlgren","idIMDB":"nm1312566"},"actorId":"nm1312566","character":"Robin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anjelica Huston","urlProfile":"http://www.imdb.com/name/nm0001378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE1MTAyNDReQTJeQWpwZ15BbWU3MDk5NDI0Mjc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1951","placeOfBirth":" Santa Monica, California, USA","height":"5' 10\" (1.78 m)","bio":"Anjelica Huston was born on July 8, 1951 in Santa Monica, California, to prima ballerina Enrica \"Ricki\" (Soma) and director and actor John Huston. Her mother, who was from New York, was of Italian descent, and her father had English, Scottish, and Scots-Irish ancestry. Huston spent most of her childhood overseas, in Ireland and England, and in 1969 first dipped her toe into the acting profession, taking a few small roles in her father's movies. However, in that year her mother died in a car accident, at 39, and Huston relocated to the United States, where the tall, exotically beautiful young woman modeled for several years. While modeling, Huston had a few more small film roles, but decided to focus more on movies in the early 1980s. She prepared herself by reaching out to acting coach Peggy Feury and began to get roles. The first notable part was in Bob Rafelson's remake of the classic noir movie The Postman Always Rings Twice (1981) (in which Jack Nicholson, with whom Huston was living at the time, was the star). After a few more years of on-again, off-again supporting work, her father perfectly cast her as calculating, imperious Maerose, the daughter of a Mafia don whose love is scorned by a hit man (Nicholson again) in his film adaptation of Richard Condon's Mafia-satire novel Prizzi's Honor (1985). Huston won the Best Supporting Actress Oscar for her performance, making her the first person in Academy Award history to win an Oscar when a parent and a grandparent (her father and grandfather Walter Huston) had also won one. Huston thereafter worked prolifically, including notable roles in Francis Ford Coppola's -Gardens of Stone (1987), Barry Sonnenfeld's film versions of the Charles Addams cartoons The Addams Family (1991) and Addams Family Values (1993), in which she portrayed Addams matriarch Morticia, Wes Anderson's The Royal Tenenbaums (2001) and The Life Aquatic with Steve Zissou (2004). Probably her finest performance on-screen, however, was as Lilly, the veteran, iron-willed con artist in Stephen Frears' The Grifters (1990), for which she received another Oscar nomination, this time for Best Actress. A sentimental favorite is her performance as the lead in her father's final film, an adaptation of James Joyce's The Dead (1987) -- with her many years of residence in Ireland, Huston's Irish accent in the film is authentic. Endowed with her father's great height and personal boldness, and her mother's beauty and aristocratic nose, Huston certainly cuts an imposing figure, and brings great confidence and authority to her performances. She clearly takes her craft seriously and has come into her own as a strong actress, emerging from under the shadow of her father, who passed away in 1987. Huston married the sculptor Robert Graham in 1992, The couple lived in the Los Angeles area before Graham's death in 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE1MTAyNDReQTJeQWpwZ15BbWU3MDk5NDI0Mjc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001378","name":"Anjelica Huston","nicknames":["Angel","Anjel"],"idIMDB":"nm0001378"},"actorId":"nm0001378","character":"Queen Clarion","urlCharacter":"http://www.imdb.com/character/ch0416658","main":true}],"seasons":[],"idIMDB":"tt3120408","urlIMDB":"http://www.imdb.com/title/tt3120408","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2014/\">2014</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 16 min (76 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"7.3","metascore":"52","filmingLocations":[],"rated":"G","awards":[{"award":"Casting Society of America, USA 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Animation Feature","names":[{"name":"Jason Henkel","id":"nm2554892","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2016","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Direct to Video - Animation","names":[{"name":"Todd Toon","id":"nm0002477","role":"supervising sound editor, sound designer"},{"name":"Thomas Whiting","id":"nm0926034","role":"supervising dialogue editor"},{"name":"Charles Martin Inouye","id":"nm0409335","role":"supervising music editor"},{"name":"Martyn Zub","id":"nm2138271","role":"sound designer, sound effects editor"},{"name":"John Roesch","id":"nm0736430","role":"foley artist"},{"name":"Shelley Roden","id":"nm1400864","role":"foley artist"},{"name":"Adam Kopald","id":"nm0465676","role":"sound effects editor"},{"name":"Charles W. Ritter","id":"nm0728726","role":"sound effects editor"},{"name":"Charlie Campagna","id":"nm2153148","role":"sound effects editor"},{"name":"Pernell L. Salinas","id":"nm0758386","role":"sound effects editor"},{"name":"Jim Harrison","id":"nm0365660","role":"music editor"},{"name":"Dominick Certo","id":"nm0148833","role":"music editor"},{"name":"Tommy Holmes","id":"nm1353712","role":"music editor"}]}]}]}],"votes":"5,398","type":"Video","companyCreditsSimple":[{"idCompany":"co0092035","name":"DisneyToon Studios"},{"idCompany":"co0378421","name":"Prana Animation Studios"},{"idCompany":"co0206196","name":"Prana Studios"}],"keywords":{"keywords":["beast","hawk","tinker bell","reanimation","lightning storm","hibernation","heroine","strong female lead","strong female character","female protagonist"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:14:14"}}