{"data":{"movies":[{"title":"The Boy Next Door","originalTitle":"","year":"2015","releaseDate":"20150123","directors":[{"name":"Rob Cohen","id":"nm0003418"}],"writers":[{"name":"Barbara Curry","id":"nm3204152"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTEyMTYzOV5BMl5BanBnXkFtZTgwNzQ4OTg5MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Mystery","Thriller"],"plot":"When a handsome, charming teenager named Noah (Ryan Guzman) moves in next door, newly separated high-school teacher Claire Peterson (Jennifer Lopez) encourages his friendship and engages in a little bit of harmless (or so she thinks) flirtation. Although Noah spends much of the time hanging out with Claire's son, the teen's attraction to her is palpable. One night, Claire gives in to temptation and lets Noah seduce her, but when she tries to end the relationship, he turns violent.","simplePlot":"A woman, separated from her unfaithful husband, falls for a younger man who has moved in next door, but their torrid affair soon takes a dangerous turn.","actors":[{"actorName":"Jennifer Lopez","urlProfile":"http://www.imdb.com/name/nm0000182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTY3ODA3OV5BMl5BanBnXkFtZTcwMzMyMzQ1NQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1969","placeOfBirth":" The Bronx, New York, USA","birthName":"Jennifer Lynn Lopez","height":"5' 6\" (1.68 m)","bio":"Jennifer Lynn Lopez was born in the Castle Hill section of the South Bronx on July 24, 1969. She is the middle of three musically-inclined sisters, Leslie Lopez, a homemaker, and Lynda Lopez, a DJ on New York's WKTU, a VH1 VJ, and a morning news show correspondent on New York's Channel 11. Jennifer always dreamed of being a multi-tasking superstar. Jennifer's parents, Guadalupe Rodriguez and David Lopez, were both born in Ponce, Puerto Rico, the second largest Puerto Rican city. The two were then brought to the continental United States during their childhoods and, eventually, met while living in New York City. As a child, Jennifer enjoyed a variety of musical genres, mainly Afro-Caribbean rhythms like salsa, merengue and bachata, and mainstream music like pop, hip-hop and R&B. Although she loved music, the film industry also intrigued her. Her biggest influence was the Rita Moreno musical, West Side Story (1961). At age five, Jennifer began taking singing and dancing lessons. Aside from being a budding entertainer, Jennifer was also a Catholic schoolgirl, attending eight years at an all-girls catholic high school named \"Holy Family\", located in the Bronx, before graduating from Preston High School after a four-year stay. At school, Jennifer was an amazing athlete and participated in track and field and tennis. At age eighteen, Lopez moved out of her parent's home. During this time, Lopez worked at a law firm while she took dancing jobs at night. After high school, she briefly worked in a law office. During this time, she continued dance classes at night. At 18, she left home because her mother was scared by her decision to pursue show business. Her big break came when she was offered a job as a fly girl on Fox's hit comedy, In Living Color (1990). After a two-year stay at In Living Color (1990) where actress Rosie Perez served as choreographer, Lopez then went on to dance for famed singer-actress Janet Jackson. Her first major film was Gregory Nava's My Family (1995), and her career went into over-drive when she portrayed slain Tejana singer Selena Quintanilla Perez in Selena (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTY3ODA3OV5BMl5BanBnXkFtZTcwMzMyMzQ1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000182","name":"Jennifer Lopez","nicknames":["J. Lo","La Lopez","Lola","Jenny from the Block"],"idIMDB":"nm0000182"},"actorId":"nm0000182","character":"Claire Peterson","urlCharacter":"http://www.imdb.com/character/ch0500727","main":true},{"actorName":"Ryan Guzman","urlProfile":"http://www.imdb.com/name/nm4554428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjI1NjE2NF5BMl5BanBnXkFtZTcwMTczNDQxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1987","placeOfBirth":" Abilene, Texas, USA","height":"6' (1.83 m)","bio":"Ryan Anthony Guzman is an American actor, model, and mixed martial arts fighter. He was born September 21, 1987 in Abilene, Texas, to Lisa (Hudson) and Ray Guzman. After his fathers' service in the Air Force ended, the family moved to Sacramento, CA to raise Ryan and later on his younger brother Steven. In 2006 Guzman was a Left Handed pitcher for his collegiate team in Rocklin, CA, while simultaneously becoming a successful model in San Francisco, and training in Mixed Martial Arts (M.M.A.). The end of his baseball career in 2009 offered him ample time devote to his love for Martial Arts and he soon found himself fighting in the octagon as a welterweight (170lbs). In Sept of 2010 he decided to move to Los Angeles and within 6 month he found himself having success doing commercials. Through commercial work, an interest in acting started to arise for Guzman. Shortly after Ryan started taking acting classes, he signed with Luber Roklin Management, and two months later, he landed his big break and was cast as the lead in the highest grossing film dance franchise to date. Since moving to LA, Ryan has been keeping busy working on many popular films & TVs shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjI1NjE2NF5BMl5BanBnXkFtZTcwMTczNDQxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4554428","name":"Ryan Guzman","idIMDB":"nm4554428"},"actorId":"nm4554428","character":"Noah Sandborn","urlCharacter":"http://www.imdb.com/character/ch0504947","main":true},{"actorName":"Ian Nelson","urlProfile":"http://www.imdb.com/name/nm4122775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjgzMDY0M15BMl5BanBnXkFtZTgwNDAzMzMwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Ian Nelson is an actor, known for The Hunger Games (2012), The Boy Next Door (2015) and The Judge (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjgzMDY0M15BMl5BanBnXkFtZTgwNDAzMzMwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4122775","name":"Ian Nelson","idIMDB":"nm4122775"},"actorId":"nm4122775","character":"Kevin Peterson","urlCharacter":"http://www.imdb.com/character/ch0501011","main":true},{"actorName":"John Corbett","urlProfile":"http://www.imdb.com/name/nm0179173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Nzg1MjY2M15BMl5BanBnXkFtZTcwMTU5MTQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1961","placeOfBirth":" Wheeling, West Virginia, USA","birthName":"John Joseph Corbett Junior","height":"6' 5\" (1.96 m)","bio":"John Corbett was born on May 9, 1961 in Wheeling, West Virginia, USA as John Joseph Corbett Junior. He is an actor, known for Northern Exposure (1990), Raising Helen (2004) and Volcano (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Nzg1MjY2M15BMl5BanBnXkFtZTcwMTU5MTQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0179173","name":"John Corbett","idIMDB":"nm0179173"},"actorId":"nm0179173","character":"Garrett Peterson","urlCharacter":"http://www.imdb.com/character/ch0501012","main":true},{"actorName":"Kristin Chenoweth","urlProfile":"http://www.imdb.com/name/nm0155693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NzEyMTQ5MV5BMl5BanBnXkFtZTcwMzg3NTUyMg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1968","placeOfBirth":" Broken Arrow, Oklahoma, USA","birthName":"Kristi Dawn Chenoweth","height":"4' 11\" (1.5 m)","bio":"Kristin Chenoweth is an American stage, screen and television actress, though, depending on who you ask, Cheno fans may disagree on what her most famous roles are. Since Chenoweth began her career, she has been credited with roles in musicals and plays on and off-Broadway, on various television shows and can be seen in movies on television and the big screen. She has also lent her recognizable voice numerous times to animated features. Chenoweth was born in the small town of Broken Arrow, OK. Soon after her birth, Chenoweth was adopted by Jerry and Junie Chenoweth. She is very open about her adoption and has been known to support various adoption causes and organizations around the U.S. Although Chenoweth knows the backgrounds of her birth parents, she has commented that she has little interest in meeting them. The Chenoweth family includes older brother Mark. Chenoweth graduated from Broken Arrow High School and went on to study Musical Theater at Oklahoma City University. Under the guidance of Florence Birdwell, Chenoweth flourished in stage and vocal performance. She later received her Master's Degree in Opera Performance at OCU. An avid fan of all things Oklahoman, Chenoweth was inducted into the 2010 State Hall of Fame. Fans of Kristin Chenoweth, the stage actress, have seen her stealing performances in Steel Pier, Epic Proportions, and The Apple Tree. In 1999, Chenoweth received the Tony Award for her performance as \"Sally\" in \"You're a Good Man, Charlie Brown\". Chenoweth is well-known as the originator of \"Glinda\" in the 2003 mega-hit musical \"Wicked\". The role, written with Chenoweth in mind, earned her a Tony Award Nomination amongst many other accolades. Chenoweth returned to Broadway in 2010, alongside Sean Hayes in the Broadway revival of \"Promises, Promises\". In January of 2007, Chenoweth became the third musical theater performer in history to have a solo performance at NYC's Metropolitan Opera. She has also performed with various Symphonies around the world. Chenoweth has recorded 3 studio albums. Those who know Kristin best from her various television performances remember her as the quirky, down on love, \"Olive Snook\" on Pushing Daisies (2007). The role won Ms. Chenoweth an Emmy Award in 2009 for Outstanding Supporting Actress in a Comedy Series. The show, ultimately canceled shortly after its 2nd season, is still considered by Kristin to be one of her favorite characters to play. In 2001, Chenoweth starred in the short-lived NBC comedy Kristin (2001). She has also been seen on The West Wing (1999), Ugly Betty (2006) and has a recurring role on Fox's Glee (2009) as the recovering alcoholic has-been, but lovable \"April Rhodes\" . Her appearances on \"Glee\" earned her a 3rd Emmy nomination. Most recently, Ms. Chenoweth had a small part in the 2010 comedy, You Again (2010). She has also had roles in Tout... sauf en famille (2008), Deck the Halls (2006), Running with Scissors (2006) and Stranger Than Fiction (2006). In 2009, Chenoweth took on the challenging role as \"Linda\" in the film, Into Temptation (2009). Ms. Chenoweth is bi-coastal spending a good amount of time in both New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NzEyMTQ5MV5BMl5BanBnXkFtZTcwMzg3NTUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0155693","name":"Kristin Chenoweth","nicknames":["Cheno","The K-Cho","K-Cho"],"idIMDB":"nm0155693"},"actorId":"nm0155693","character":"Vicky Lansing","urlCharacter":"http://www.imdb.com/character/ch0501013","main":true},{"actorName":"Lexi Atkins","urlProfile":"http://www.imdb.com/name/nm4885949","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTJlZjUzNDQtNTMyNi00OGUzLWEyYjgtMTc2NjYxNGIxNDljXkEyXkFqcGdeQXVyMzA2OTA1Mzg@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1992","placeOfBirth":" Champaign, Illinois, USA","birthName":"Alexis Atkins","height":"5' 8\" (1.73 m)","bio":"Lexi Atkins was born on February 10, 1992 in Champaign, Illinois, USA as Alexis Atkins. She is an actress, known for The Boy Next Door (2015), Ted 2 (2015) and Zombeavers (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTJlZjUzNDQtNTMyNi00OGUzLWEyYjgtMTc2NjYxNGIxNDljXkEyXkFqcGdeQXVyMzA2OTA1Mzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4885949","name":"Lexi Atkins","idIMDB":"nm4885949"},"actorId":"nm4885949","character":"Allie Callahan","urlCharacter":"http://www.imdb.com/character/ch0501014","main":true},{"actorName":"Hill Harper","urlProfile":"http://www.imdb.com/name/nm0004991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTk4NjMzN15BMl5BanBnXkFtZTgwMTAxNDA3NzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1966","placeOfBirth":" Iowa City, Iowa, USA","birthName":"Frank Harper","height":"5' 9\" (1.75 m)","bio":"Hill Harper, an accomplished film, television and stage actor, stars in the hit CBS drama series, CSI: NY (2004). He portrays \"Dr. Sheldon Hawkes\", a reclusive coroner who walked away from a promising surgical career after the traumatic loss of two patients. This February, he will star in the HBO movie, Lackawanna Blues (2005), which is based on the critically-acclaimed stage play by Ruben Santiago-Hudson. Recently, \"People\" magazine selected Harper as one of their \"Sexiest Men Alive\" (2004). Prior to CSI: NY (2004), Harper co-starred as an ambitious undercover FBI operative on the CBS series, The Handler (2003), alongside Emmy Award nominee Joe Pantoliano. The role earned him a 2004 Golden Satellite Award nomination for Outstanding Supporting Actor in a Drama Series. He has also been recognized by the NAACP Image Awards with a nomination as Best Supporting Actor for his performance in the CBS series, City of Angels (2000). Harper received critical acclaim for his performance in the independent film, The Visit (2000), directed by Jordan Walker-Pearlman, which tells the story of two brothers who are forced to come together when the younger sibling (played by Harper), who is HIV-positive, is sentenced to death row for a crime he seemingly did not commit. His performance, which Daily Variety called \"riveting\", earned him a Best Actor nomination by the Independent Spirit Awards. He re-teams with Walker-Pearlman in the upcoming independent feature, Constellation (2005), which chronicles the lives and loves of a family in the Deep South. His recent film roles include the lead in the independent film, Love, Sex and Eating the Bones (2003), which was accepted into the Toronto International, Palm Springs, and Pan African film festivals. This intriguing film won \"Best Canadian First Feature Film\" in the 2003 Toronto International Film Festival and both \"Best Feature\" and \"Audience Favorite\" in the 2004 Pan African Film Festival. He has also completed work on the independent film, America Brown (2004), which was accepted into the 2004 Tribeca Film Festival. Harper's other screen credits include: Loving Jezebel (1999)_, Le neveu (1998) (with Pierce Brosnan), The Skulls (2000) (with Joshua Jackson), In Too Deep (1999) (with Omar Epps, LL Cool J and Nia Long), Beloved (1998), Hav Plenty (1997), He Got Game (1998) (with Denzel Washington), and Get on the Bus (1996). Other films include Zooman (1995) (with Louis Gossett Jr., Charles S. Dutton and CCH Pounder), \"Full Court Press\" (with Ellen Burstyn and Taye Diggs) and One Red Rose (1995), which he also co-wrote, for Showtime. As a television actor, Harper has had numerous guest-starring roles. He recently appeared on recurring episodes of Showtime's Soul Food (2000) and guest-starred on HBO's The Sopranos (1999). He also starred in the CBS mini-series, Mama Flora's Family (1998) and the UPN Network comedy/drama, Live Shot (1995). Other guest appearances include: ER (1994), NYPD Blue (1993), Murder One (1995), The Fresh Prince of Bel-Air (1990) and Married with Children (1987). Harper's stage credits include appearances in off-Broadway productions of \"Your Handsome Captain\", \"Freeman\", and David Mamet's \"American Buffalo\". He completed a starring run of Jessica Hagedorn's \"Dogeaters\" at New York's Joseph Papp Public Theatre. Harper graduated magna cum laude from Brown University with a Bachelor of Arts degree and graduated with a J.D. (cum laude) from Harvard Law School, as well as with a Masters in Public Administration from the Kennedy School of Government. He is a full-time member of Boston's Black Folk's Theater Company, one of the nation's oldest and most respected African-American traveling theater troupes. Harper's Bazaar wrote, \"You might expect Hill Harper to be the next actor vying for the presidency... but he has other things on his agenda\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTk4NjMzN15BMl5BanBnXkFtZTgwMTAxNDA3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004991","name":"Hill Harper","idIMDB":"nm0004991"},"actorId":"nm0004991","character":"Principal Edward Warren","urlCharacter":"http://www.imdb.com/character/ch0501015","main":true},{"actorName":"Jack Wallace","urlProfile":"http://www.imdb.com/name/nm0908685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzQyNDI3Ml5BMl5BanBnXkFtZTgwNTM3OTY2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jack Wallace is an actor, known for Boogie Nights (1997), The Bear (1988) and American Pie 2 (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzQyNDI3Ml5BMl5BanBnXkFtZTgwNTM3OTY2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908685","name":"Jack Wallace","idIMDB":"nm0908685"},"actorId":"nm0908685","character":"Mr. Sandborn","urlCharacter":"http://www.imdb.com/character/ch0501016","main":true},{"actorName":"Adam Hicks","urlProfile":"http://www.imdb.com/name/nm0382791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODg5ODc3Nl5BMl5BanBnXkFtZTgwODYyNDQ2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1992","placeOfBirth":" Las Vegas, Nevada, USA","birthName":"Adam Paul Nielson Hicks","height":"6' 2\" (1.88 m)","bio":"Adam Hicks was born on November 28, 1992 in Las Vegas, Nevada, USA as Adam Paul Nielson Hicks. He is known for his work on Zeke and Luther (2009), Lemonade Mouth (2011) and The Boy Next Door (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODg5ODc3Nl5BMl5BanBnXkFtZTgwODYyNDQ2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382791","name":"Adam Hicks","idIMDB":"nm0382791"},"actorId":"nm0382791","character":"Jason Zimmer","urlCharacter":"http://www.imdb.com/character/ch0501054","main":true},{"actorName":"François Chau","urlProfile":"http://www.imdb.com/name/nm0154236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjM5MjIzMV5BMl5BanBnXkFtZTcwMjgxOTU1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1959","placeOfBirth":" Phnom Penh, Cambodia","height":"5' 8\" (1.73 m)","bio":"François Chau was born on October 26, 1959 in Phnom Penh, Cambodia. He is known for his work on Rescue Dawn (2006), 21 & Over (2013) and Teenage Mutant Ninja Turtles II: The Secret of the Ooze (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjM5MjIzMV5BMl5BanBnXkFtZTcwMjgxOTU1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0154236","name":"François Chau","idIMDB":"nm0154236"},"actorId":"nm0154236","character":"Detective Johnny Chou","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bailey Chase","urlProfile":"http://www.imdb.com/name/nm0003082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk1MzU3NDQtZTVmOS00MGFkLTg5OTgtZGE3Y2E4MzIwMDdhXkEyXkFqcGdeQXVyOTA0NzYzMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1972","placeOfBirth":" Chicago, Illinois, USA","birthName":"Bailey Chase Luetgert","height":"6' 0½\" (1.84 m)","bio":"Bailey attended Duke University in Durham, North Carolina, on a full athletic scholarship. He graduated in 1995 with a degree in Psychology. After graduation, Bailey moved to Los Angeles to pursue his acting career, which has encompassed a training stint in London and performing in such plays as \"A Comedy of Errors,\" \"Picnic\" and \"Death of a Salesman.\" Bailey's first film break came in Adam Shankman's Cosmo's Tale (1998), which screened at both Sundance and Cannes in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk1MzU3NDQtZTVmOS00MGFkLTg5OTgtZGE3Y2E4MzIwMDdhXkEyXkFqcGdeQXVyOTA0NzYzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003082","name":"Bailey Chase","idIMDB":"nm0003082"},"actorId":"nm0003082","character":"Benny","urlCharacter":"http://www.imdb.com/character/ch0501018","main":true},{"actorName":"Kent Avenido","urlProfile":"http://www.imdb.com/name/nm1366393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0NTE0ODg3M15BMl5BanBnXkFtZTcwNzcwODA1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kent Avenido is an actor, known for 50 First Dates (2004), Just Go with It (2011) and The Boy Next Door (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0NTE0ODg3M15BMl5BanBnXkFtZTcwNzcwODA1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1366393","name":"Kent Avenido","idIMDB":"nm1366393"},"actorId":"nm1366393","character":"Mr. Avenido","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Travis Schuldt","urlProfile":"http://www.imdb.com/name/nm0005402","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTUxMTA1MF5BMl5BanBnXkFtZTgwMjUzNjkwNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1974","placeOfBirth":" Topeka, Kansas, USA","birthName":"Travis Scott Schuldt","height":"6' 0¾\" (1.85 m)","bio":"With a wide range of comedic and dramatic roles on television, film and the stage, Travis Schuldt is poised to become tomorrow's most exciting breakthrough story. Currently seen as Sarah Chalke's forgiving boyfriend, Keith, on NBC's hit comedy, Scrubs (2001), Schuldt has quickly expanded the fan base of those who first discovered him through his starring role on the subversive daytime soap opera, Passions (1999), where he played the noble \"Ethan Winthrop\" for four years. The Topeka, Kansas, native's career began after he graduated from Texas Christian University with a Bachelor of Fine Arts in Theater. He quickly found success as a model and moved to Los Angeles in 1999, when he just as quickly scored the lead on the NBC hit, Passions (1999). After leaving Passions (1999), Schuldt immediately booked a starring role opposite Ernie Hudson and Danny Nucci on the short-lived drama, 10-8: Officers on Duty (2003). Other credits include JAG (1995), Veronica Mars (2004), and the upcoming horror spoof Hack! (2007), which is overstuffed with cult icons like Kane Hodder (the Friday the 13th (1980) series), Juliet Landau (Buffy the Vampire Slayer (1997)) and Danica McKellar (The Wonder Years (1988)). Acting is just one of Schuldt's many talents. In 2004, Schuldt worked with director Jonathan Walls and writer/actor/producer Jay Thames to create, write, finance, produce and star in the critically acclaimed independent film, Automatic (2005), which found enthusiastic audiences as an official selection at SXSW, Woodstock, Starz Denver and the Deep Ellum Film Festival in Dallas. Schuldt is also very active in the Lone Star Ensemble, the nonprofit theater group he founded in 2000, and 35 Terrace, the production company through which he is currently developing several exciting projects. Schuldt is a force to be reckoned with. His incomparable talent, boy-next-door good looks and unstoppable dedication to his craft, will undoubtedly catapult Schuldt to Hollywood royalty.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTUxMTA1MF5BMl5BanBnXkFtZTgwMjUzNjkwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005402","name":"Travis Schuldt","idIMDB":"nm0005402"},"actorId":"nm0005402","character":"Ethan","urlCharacter":"http://www.imdb.com/character/ch0501019","main":true},{"actorName":"Brian Mahoney","urlProfile":"http://www.imdb.com/name/nm0537126","urlPhoto":"","biography":{"bio":"Brian made the decision to become an actor before his 10th birthday but took another 20 years to make the journey to Hollywood to begin his formal acting training. Born in Framingham MA, Brian moved with his family to Illinois and Ohio before settling in a beautiful small town in Western Michigan. Unable to afford theater training after high school and in the middle of the Iranian hostage crisis he joined the US Army in hopes of later attending American Academy of Dramatic Arts in NYC. The Army had different plans for Brian and after 2 yrs of infantry training, accepted him into US Army flight school at Ft Rucker, Alabama. Brian loved the intense academic environment and found he had a natural ability flying helicopters. Upon flight school graduation, Brian was accepted into the attack school where he was trained as a Cobra pilot then sent to a discreet Army base in the rural fields west of Nurnberg, Germany. The only American living in the small town of Oberntief at the time, Brian treasures those years and is always trying to live up to them. While in Germany, he studied full time at the satellite campus of Embry Riddle Aeronautical University near Nurnberg, and as an avid skier, racked up over fifty lift tickets in three years from the Austrian Alps to the Italian Dolomites. If he wasn't flying, studying, or comparing stories over drinks at their remote officers club, he was traveling Europe with his fellow gun pilots. Despite an exciting and very rewarding career thus far, Brian knew it was time to become an actor soon and after seeing the movie Top Gun in Garmisch, requested his final assignment be as close to Hollywood as possible. Within a year, he was based at Ft Ord, CA and immersed himself in Monterey's busy theater community whenever he could. In Monterey, he got the part of Vince in Buried Child by falling down 'drunk' on stage during his audition and completing the scene from the stage floor. In late 1989, after 10 years of military service, Brian resigned from the Army, sold his new Saab for acting lessons in Hollywood, and made his move there. October 30th 2009 marks both the theatrical release of the new film Boondock Saints 2, All Saints Day and the 20th anniversary of Brian's arrival in Los Angeles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0537126","name":"Brian Mahoney","idIMDB":"nm0537126"},"actorId":"nm0537126","character":"Couper","urlCharacter":"http://www.imdb.com/character/ch0501059","main":true},{"actorName":"Raquel Gardner","urlProfile":"http://www.imdb.com/name/nm0307074","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDMwNzMwMV5BMl5BanBnXkFtZTgwNDc1NTI2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1970","placeOfBirth":" North Hollywood, California, USA","birthName":"Raquel Fernanda Gardner","height":"5' 3\" (1.6 m)","bio":"Raquel Gardner was born on March 18, 1970 in North Hollywood, California, USA as Raquel Fernanda Gardner. She is an actress, known for A Night at the Roxbury (1998), Species II (1998) and The Boy Next Door (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDMwNzMwMV5BMl5BanBnXkFtZTgwNDc1NTI2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0307074","name":"Raquel Gardner","nicknames":["Rocky"],"idIMDB":"nm0307074"},"actorId":"nm0307074","character":"Barbara","urlCharacter":"http://www.imdb.com/character/ch0501017","main":true}],"seasons":[],"idIMDB":"tt3181822","urlIMDB":"http://www.imdb.com/title/tt3181822","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$14,910,105","country":"USA","day":"25","month":"01","year":"2015","remarks":"2,602 Screens"},{"money":"€244,000","country":"Italy","day":"27","month":"07","year":"2015","remarks":""}],"gross":[{"money":"$35,385,560","country":"USA","day":"08","month":"03","year":"2015","remarks":""},{"money":"$35,246,140","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$34,922,710","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$30,861,390","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$24,684,000","country":"USA","day":"01","month":"02","year":"2015","remarks":""},{"money":"$14,910,105","country":"USA","day":"25","month":"01","year":"2015","remarks":""},{"money":"$428,117","country":"Austria","day":"26","month":"06","year":"2015","remarks":""},{"money":"$2,411,675","country":"Germany","day":"30","month":"09","year":"2015","remarks":""},{"money":"€664,000","country":"Italy","day":"16","month":"08","year":"2015","remarks":""},{"money":"$269,619","country":"Italy","day":"29","month":"07","year":"2015","remarks":""},{"money":"$570,752","country":"Netherlands","day":"26","month":"06","year":"2015","remarks":""},{"money":"$842,577","country":"Russia","day":"25","month":"06","year":"2015","remarks":""}],"weekendGross":[{"money":"$78,645","country":"USA","day":"08","month":"03","year":"2015","remarks":"122 Screens"},{"money":"$155,110","country":"USA","day":"01","month":"03","year":"2015","remarks":"217 Screens"},{"money":"$497,935","country":"USA","day":"22","month":"02","year":"2015","remarks":"503 Screens"},{"money":"$4,111,835","country":"USA","day":"08","month":"02","year":"2015","remarks":"2,193 Screens"},{"money":"$6,093,000","country":"USA","day":"01","month":"02","year":"2015","remarks":"2,615 Screens"},{"money":"$14,910,105","country":"USA","day":"25","month":"01","year":"2015","remarks":"2,602 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["SDDS","Dolby Digital","Datasat"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Cooke S4, Angenieux Optimo and Nikkor Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,485.25 m (5 reels)"],"negativeFormat":["SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","ProRes 4:4:4 (2K) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"4.6","metascore":"30","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Gay and Lesbian Entertainment Critics Association (GALECA) 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Dorian Award","categories":[{"category":"Campy Flick of the Year","names":[]}]}]},{"award":"Houston Film Critics Society Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Worst Picture","names":[]}]}]},{"award":"MTV Movie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Best Scared-As-S**t Performance","names":[{"name":"Jennifer Lopez","id":"nm0000182","role":null}]}]}]},{"award":"People's Choice Awards, USA 2016","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Thriller Movie","names":[]}]}]},{"award":"Razzie Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actress","names":[{"name":"Jennifer Lopez","id":"nm0000182","role":null}]}]}]}],"votes":"29,658","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0098315","name":"Blumhouse Productions"},{"idCompany":"co0021149","name":"Nuyorican Productions"}],"keywords":{"keywords":["older woman younger man relationship","oral sex","argument","sex scene","infidelity","adultery","mother son relationship","male nudity","reference to j.k. rowling","female nudity","being followed","unfaithfulness","car explosion","erotica","craziness","cookie","boxing lesson","man undressing","extramarital affair","obsession","shouting","blind date","loss of friend","stabbed in the eye","eye gouged out","sociopath","violence","fatal attraction","stalker","teacher","car accident","neighbor","high school teacher","high school","woman in jeopardy","hidden camera","principal","los angeles california","crying woman","insanity","lights out","dead body","cat","tied up","boxing","unrequited love","following someone","blackmail","garage","high school student","vice principal","fire","barn","threatened with a knife","death of friend","bare chested male","muscular","boxer briefs","male underwear","male rear nudity","villain played by lead actor","damsel in distress","literature teacher","teenager","kiss","shot in the chest","crushed to death","stepping on hand","eye gouge","barn fire","zippo lighter","can of gasoline","friend murdered","matricide","power outage","patricide","sabotaged brakes","hacking","break in","attempted rape","fellatio","overflowing sink","school fight","school dance","yellow rose","asthma attack","kneed in the crotch","punching a heavy bag","reference to achilles","transfer student","plate of cookies","first day of school","gift","first edition","reference to hector","reference to lord byron","reference to william shakespeare","reference to homer","allergic to bee sting","bully","skateboard","automatic garage door opener malfunction","man in a motorized wheelchair","cheating husband","birthday cake","birthday present","jogging","suspended by arms","tied to a chair","grafitti","squeezing breast","pumpkin","target shooting","cunnilingus","woman wearing black lingerie","bound and gagged","death","man in underwear","slapped in the face","man in wheelchair","man undressing a woman","man wearing boxer briefs","man wearing underwear","spying on neighbor","spying on couple having sex","female rear nudity","bare breasts","epi pen","undressing","kicked in the balls","bare butt","student","murder","female slaps male","psychopath","male removes female's clothes","confrontation","panties","underwear","best friend","allergy","seduction","family conflict","family dinner","gun","friend","sex in bed","woman in bra and panties","woman has sex with a teenager","woman has an affair with a teenage boy","husband wife relationship","father son relationship","male bare butt","stiletto heels","woman crying","exploding car","undershirt"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:17:21"}}