{"data":{"movies":[{"title":"Rock the Kasbah","originalTitle":"","year":"2015","releaseDate":"20151023","directors":[{"name":"Barry Levinson","id":"nm0001469"}],"writers":[{"name":"Mitch Glazer","id":"nm0322248"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIyMTE1Nl5BMl5BanBnXkFtZTgwNzk2OTU5NTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Music","War"],"plot":"A down-on-his-luck music manager discovers a teenage girl with an extraordinary voice while on a music tour in Afghanistan and takes her to Kabul to compete on the popular television show, Afghan Star.","simplePlot":"A down-on-his-luck music manager discovers a teenage girl with an extraordinary voice while on a music tour in Afghanistan and takes her to Kabul to compete on the popular television show, Afghan Star.","actors":[{"actorName":"Bill Murray","urlProfile":"http://www.imdb.com/name/nm0000195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTM0MjEwOF5BMl5BanBnXkFtZTYwNTQwNzI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1950","placeOfBirth":" Wilmette, Illinois, USA","birthName":"William James Murray","height":"6' 2\" (1.88 m)","bio":"Bill Murray is an American actor, comedian, and writer. The fifth of nine children, he was born William James Murray in Wilmette, Illinois, to Lucille (Collins), a mailroom clerk, and Edward Joseph Murray II, who sold lumber. He is of Irish descent. Among his siblings are actors Brian Doyle-Murray, Joel Murray, and John Murray. He and most of his siblings worked as caddies, which paid his tuition to Loyola Academy, a Jesuit school. He played sports and did some acting while in that school, but in his words, mostly \"screwed off.\" He enrolled at Regis College in Denver to study pre-med but dropped out after being arrested for marijuana possession. He then joined the National Lampoon Radio Hour with fellow members Dan Aykroyd, Gilda Radner, and John Belushi. However, while those three became the original members of Saturday Night Live (1975), he joined Saturday Night Live with Howard Cosell (1975), which premiered that same year. After that show failed, he later got the opportunity to join Saturday Night Live (1975), for which he earned his first Emmy Award for Outstanding Writing in a Comedy-Variety or Music Series. He later went on to star in comedy films, including Arrête de ramer, t'es sur le sable (1979), Caddyshack (1980), Stripes (1981), Tootsie (1982), Ghostbusters (1984), Ghostbusters II (1989), Scrooged (1988), What About Bob? (1991), and Groundhog Day (1993). He also co-directed Quick Change (1990). Murray garnered additional critical acclaim later in his career, starring in Lost in Translation (2003), which earned him a Golden Globe and a BAFTA Award for Best Actor, as well as an Academy Award nomination for Best Actor. He also received Golden Globe nominations for his roles in Ghostbusters, Rushmore (1998), Hyde Park on Hudson (2012), St. Vincent (2014), and the HBO miniseries Olive Kitteridge (2014), for which he later won his second Primetime Emmy Award for Outstanding Supporting Actor in a Limited Series or a Movie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTM0MjEwOF5BMl5BanBnXkFtZTYwNTQwNzI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000195","name":"Bill Murray","nicknames":["Billy","The Murricane"],"idIMDB":"nm0000195"},"actorId":"nm0000195","character":"Richie Lanz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Willis","urlProfile":"http://www.imdb.com/name/nm0000246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Idar-Oberstein, West Germany","birthName":"Walter Bruce Willis","height":"6' (1.83 m)","bio":"Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts. Walter Bruce Willis was born on March 19, 1955, in Idar-Oberstein, West Germany, to a German mother, Marlene K. (from Kassel), and an American father, David Andrew Willis (from Carneys Point, New Jersey), who were then living on a United States military base. His family moved to the U.S. shortly after he was born, and he was raised in Penns Grove, New Jersey, where his mother worked at a bank and his father was a welder and factory worker. Willis picked up an interest for the dramatic arts in high school, and was allegedly \"discovered\" whilst working in a café in New York City and then appeared in a couple of off-Broadway productions. While bartending one night, he was seen by a casting director who liked his personality and needed a bartender for a small movie role. After countless auditions, Willis contributed minor film appearances, usually uncredited, before landing the role of private eye \"David Addison\" alongside sultry Cybill Shepherd in the hit romantic comedy television series Moonlighting (1985). The series firmly established Bruce Willis as a hot new talent, and his sarcastic and wisecracking P.I. was in effect a dry run for the role of hard-boiled NYC detective \"John McClane\" in the monster hit Die Hard (1988). This superbly paced action film balanced laconic humor and wholesale destruction as Willis' character single handedly battles a gang of ruthless international thieves in a Los Angeles skyscraper. Willis reprized the role of tough guy cop \"John McClane\" in the eagerly anticipated sequel Die Hard 2 (1990) set at snowbound Washington's Dulles International Airport as a group of renegade Special Forces soldiers seek to repatriate a corrupt South American general. Excellent box office returns demanded a further sequel Die Hard with a Vengeance (1995) this time also starring Samuel L. Jackson as a cynical Harlem shopowner unwittingly thrust into assisting McClane during a terrorist bombing campaign on a sweltering day in NYC. Willis found time out from all the action mayhem to provide the voice of \"Mikey\" the baby in the very popular family comedies Look Who's Talking (1989), and its sequel Look Who's Talking Too (1990) also starring John Travolta and Kirstie Alley. Over the next decade, Willis starred in some very successful films, some very offbeat films and some unfortunate box office flops. The Bonfire of the Vanities (1990) and Hudson Hawk (1991) were both large scale financial disasters that were savaged by the critics, and both are arguably best left off the CVs of all the actors involved, however Willis was still popular with movie audiences and selling plenty of theatre tickets with the hyperviolent The Last Boy Scout (1991), the darkly humored Death Becomes Her (1992) and the mediocre police thriller Striking Distance (1993). During the 1990s, Willis also appeared in several independent and low budget productions that won him new fans and praise from the critics for his intriguing performances working with some very diverse film directors. He appeared in the oddly appealing North (1994), as a cagey prizefighter in the Quentin Tarantino directed mega-hit Pulp Fiction (1994), the Terry Gilliam directed apocalyptic thriller Twelve Monkeys (1995), the Luc Besson directed sci-fi opus The Fifth Element (1997) and the M. Night Shyamalan directed spine-tingling epic The Sixth Sense (1999). Willis next starred in the gangster comedy The Whole Nine Yards (2000), worked again with \"hot\" director M. Night Shyamalan in the less gripping Unbreakable (2000), and in two military dramas, Hart's War (2002) and Tears of the Sun (2003) that both failed to really fire with movie audiences or critics alike. However, Willis bounced back into the spotlight in the critically applauded Frank Miller graphic novel turned movie Sin City (2005), the voice of \"RJ\" the scheming raccoon in the animated hit Over the Hedge (2006) and \"Die Hard\" fans rejoiced to see \"John McClane\" return to the big screen in the high tech Live Free or Die Hard (2007) aka \"Die Hard 4.0\". Willis was married to actress Demi Moore for approximately thirteen years and they share custody to their three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000246","name":"Bruce Willis","nicknames":["Bruno"],"idIMDB":"nm0000246"},"actorId":"nm0000246","character":"Bombay Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kate Hudson","urlProfile":"http://www.imdb.com/name/nm0005028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NTk0MjMyOTFeQTJeQWpwZ15BbWU3MDA4NzEzMTM@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1979","placeOfBirth":" Los Angeles, California, USA","birthName":"Kate Garry Hudson","height":"5' 6\" (1.68 m)","bio":"Almost everyone who has spent time with Kate Hudson -including directors, family members, co-stars and interviewers - is quick to comment on her ability to light up a room. Through some combination of a winning smile, solid work ethic, and good old-fashioned talent, the young actress has gone from indie beginner to Vanity Fair cover girl in just three years. What's more, she's done it all without capitalizing on the success of legendary actress mom, Goldie Hawn. Kate Hudson was born in Los Angeles, California, to Goldie Hawn and Bill Hudson, a comedian, actor and musician. She was raised by her mother and her mother's partner, actor Kurt Russell, whom she considers to be her father. Kate is the sister of actor Oliver Hudson, the half-sister of actor and hockey player Wyatt Russell, and the granddaughter of band musician Rut Hawn. Kate is of Hungarian Jewish (from her maternal grandmother), Italian (from her paternal grandmother), English, and German ancestry. By all accounts, Hudson was a born performer - as a child she danced and sang at every opportunity. Her family hoped that she would attend New York University after graduating from high school, but she opted to get her feet wet in the professional acting world first. She made her big-screen debut as an ambitious young starlet stranded in a tiny California town in Desert Blue (1998). Her next two films, while critically panned, made it into wider release: 200 Cigarettes (1999) (in which she played an earnest but accident-prone ditz) and Gossip (2000) (which cast her as a rich, virginal college student). Perhaps Hudson's biggest break was landing the role of rock groupie (or \"Band Aide\") Penny Lane in Almost Famous (2000). The part was originally intended for Sarah Polley; when Polley backed out to pursue another project, director Cameron Crowe considered scrapping the film altogether. Hudson, who had been cast in a smaller role (as William's stewardess sister), begged for a chance to read for Penny. Crowe was impressed, Hudson got the part, and the show went on. As much as Tinseltown gossipmongers would like to put them at odds, mother and daughter agree that Hawn is one of Hudson's biggest supporters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NTk0MjMyOTFeQTJeQWpwZ15BbWU3MDA4NzEzMTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005028","name":"Kate Hudson","nicknames":["Katie"],"idIMDB":"nm0005028"},"actorId":"nm0005028","character":"Merci","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zooey Deschanel","urlProfile":"http://www.imdb.com/name/nm0221046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjM2NDE1OF5BMl5BanBnXkFtZTcwMjA2NDU5OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Zooey Claire Deschanel","height":"5' 5\" (1.65 m)","bio":"Zooey Deschanel was born in 1980 into a showbiz family. Her father, Caleb Deschanel, is an Academy Award-nominated cinematographer (perhaps most notably for The Passion of the Christ (2004)) and her mother, Mary Jo Deschanel (née Weir), is an actress who appeared in Twin Peaks (1990). Her paternal grandfather was French, and her other roots include English, German, Scottish, Irish, and Dutch. Driven from an early age to become a successful actress, Zooey got her big break, at age 17, playing a model in the TV sitcom, Veronica's Closet (1997). She got her first film role, the following year, in Mumford (1999), which prompted her to quit university to pursue acting full-time. Mostly thanks to a role in Cameron Crowe's popular biopic, Almost Famous (2000), Zooey's rise to fame has been steadily increasing as the 21st century wears on. Her distinctive acting style found her critical acclaim in 2003, when she was voted Best Actress at the Mar Del Plata Film Festival for her role in David Gordon Green's All the Real Girls (2003). She also gained a Best Female Lead nomination (for All the Real Girls (2003)) at the following year's Independent Spirit Awards, but lost out to Charlize Theron. Zooey has appeared in such films as 500 Days of Summer (2009), Our Idiot Brother (2011), Yes Man (2008) (opposite Jim Carrey), Elf (2003) (opposite Will Farrell), Your Highness (2011), The Happening (2008) (opposite Mark Wahlberg), The Hitchhiker's Guide to the Galaxy (2005) and is the star of the FOX sitcom, New Girl (2011). Zooey is often compared to golden era Hollywood starlets and is also a talented singer. She has said in interviews that she believes her singing ability was pivotal in gaining the role of \"Jovie\" in Elf (2003). She also sang (and acted) in the Disney-produced musical, The Wonderful World of Disney: Once Upon a Mattress (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjM2NDE1OF5BMl5BanBnXkFtZTcwMjA2NDU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0221046","name":"Zooey Deschanel","nicknames":["Zo","Zuzu"],"idIMDB":"nm0221046"},"actorId":"nm0221046","character":"Ronnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leem Lubany","urlProfile":"http://www.imdb.com/name/nm5647588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkzMjYxOWEtNjE3MC00NTA3LWI1OWUtZTQzZDRlMTdjNjdlXkEyXkFqcGdeQXVyNjIzMDg3Mzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Leem Lubany is an actress, known for Omar (2013), Rock the Kasbah (2015) and From A to B (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkzMjYxOWEtNjE3MC00NTA3LWI1OWUtZTQzZDRlMTdjNjdlXkEyXkFqcGdeQXVyNjIzMDg3Mzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5647588","name":"Leem Lubany","idIMDB":"nm5647588"},"actorId":"nm5647588","character":"Salima","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arian Moayed","urlProfile":"http://www.imdb.com/name/nm1573892","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5OTAxOTkxNV5BMl5BanBnXkFtZTgwOTgwMTIzNDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Arian Moayed is an actor and writer, known for Rock the Kasbah (2015), Rosewater (2014) and The Accidental Wolf (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5OTAxOTkxNV5BMl5BanBnXkFtZTgwOTgwMTIzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1573892","name":"Arian Moayed","idIMDB":"nm1573892"},"actorId":"nm1573892","character":"Riza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Caan","urlProfile":"http://www.imdb.com/name/nm0004790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjgwNTY2OV5BMl5BanBnXkFtZTcwMjk0Njg0Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1976","placeOfBirth":" Los Angeles, California, USA","birthName":"Scott Andrew Caan","height":"5' 5\" (1.65 m)","bio":"Scott Caan is the son of tough guy actor James Caan. While it is obvious that he admires tough method actors like Marlon Brando and Sean Penn, Scott also has a strong egalitarian streak, evidenced by his reasoning for baring his body in films. He is quoted as saying that originally only the women in the scene were to be nude, but that he felt it really sexist, so he stripped too. Scott was born on August 23, 1976 in Los Angeles, California. He spent his childhood being shuttled between his parent's homes. His mom is actress and model Sheila Ryan; the Caans divorced when Scott was a year old. He has an older half-sister, Tara, and three younger half-brothers: Alexander, Jacob, and James. His paternal grandparents were German Jewish immigrants. Self-desribed as a bad kid who was always getting into trouble, Scott initially steered clear of acting, opting to play sports instead. Scott benefited from his father's hands-on approach to child rearing; the elder Caan reportedly took a five-year hiatus to coach all of his son's little league teams. He also pursued his love of hip-hop by forming a group with his friend The Alchemist; as The Whooliganz, the duo made inroads on the music scene and signed an ill-fated contract with Tommy Boy Records. It did not take long for Scott to appear in front of the camera; in 1995, he took roles in a couple independent films, Star Struck (1996) and A Boy Called Hate (1995). Critical of his performances, Scott enrolled at Playhouse West in Los Angeles to study acting. Roles in more indies followed, including Bongwater (1998) and Gregg Araki's Nowhere (1997). His first major film was also a hit; he had a supporting role in Enemy of the State (1998) for director Tony Scott. He then appeared (in the buff) in Varsity Blues (1999) as a wisecracking receiver. By now, Scott had built a reliable reputation for playing strong-minded characters with a sense of humor, exemplified by his work in movies such a Boiler Room (2000), Ready to Rumble (2000), and his second hit picture, Gone in Sixty Seconds (2000). Scott's star rose with a fun supporting turn in Steven Soderbergh's Ocean's Eleven (2001) remake. At this time he had more indie turns in the films American Outlaws (2001), Novocaine (2001), and Sonny (2002) - Nicolas Cage's directorial debut starring James Franco. Scott followed up with his own directorial outing, Dallas 362 (2003). Scott reprised his role as Turk Malloy in Ocean's Twelve (2004), then took a supporting roles in two very different pictures: the sexy, ocean-bound thriller Into the Blue (2005) and in Nicole Holofcener's indie comedy, Friends with Money (2006). 2006 marked Caan's return to the director¹s chair, with The Dog Problem (2006), and soon was back for Ocean's Thirteen (2007). Over the past few years, Scott made memorable appearances as a recurring character on Entourage (2004). He has a starring role in the remake of the TV series Hawaii Five-0 (2010). Scott has also established himself as a photographer, having been mentored in the medium by cinematographer Phil Parmet. In 2009, he published his book, Scott Caan Photographs, Vol. 1.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjgwNTY2OV5BMl5BanBnXkFtZTcwMjk0Njg0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004790","name":"Scott Caan","nicknames":["Scotty"],"idIMDB":"nm0004790"},"actorId":"nm0004790","character":"Jake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny McBride","urlProfile":"http://www.imdb.com/name/nm1144419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTM0ODI4NF5BMl5BanBnXkFtZTcwNzg3MjY0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1976","placeOfBirth":" Statesboro, Georgia, USA","birthName":"Daniel Richard McBride","height":"5' 10\" (1.78 m)","bio":"Danny McBride was born on December 29, 1976 in Statesboro, Georgia, USA as Daniel Richard McBride. He is an actor and writer, known for Your Highness (2011), Pineapple Express (2008) and This Is the End (2013). He has been married to Gia Ruiz since October 9, 2010. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTM0ODI4NF5BMl5BanBnXkFtZTcwNzg3MjY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1144419","name":"Danny McBride","idIMDB":"nm1144419"},"actorId":"nm1144419","character":"Nick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fahim Fazli","urlProfile":"http://www.imdb.com/name/nm2390252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjg4ZGI5NjgtMDE5OS00OGRmLWE4N2EtNWViNDAyZjM5OTA4XkEyXkFqcGdeQXVyOTU2NzMxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1966","placeOfBirth":" Kabul, Afghanistan","height":"5' 11\" (1.8 m)","bio":"Fahim Fazli is a man of two worlds: Afghanistan, the country of his birth, and America, the nation he adopted and learned to love. Fahim is also a man who escaped oppression, found his dream profession, and then paid it all forward by returning to Afghanistan as an interpreter with the U.S. Marines from 2009-2010. He came to the United States as a refugee in his teens. He enjoyed a privileged childhood until the Russians invaded Afghanistan. As a young adult he supported the resistance and when he and his remaining family saw the opportunity they fled to Pakistan and then eventually to the United States. He moved to California with dreams of an acting career. Fahim wrote a memoir, Fahim Speaks, that was released in early 2012. \"Fahim Speaks\" received the 1st place for a biography from the Military Writers Society of America.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjg4ZGI5NjgtMDE5OS00OGRmLWE4N2EtNWViNDAyZjM5OTA4XkEyXkFqcGdeQXVyOTU2NzMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2390252","name":"Fahim Fazli","idIMDB":"nm2390252"},"actorId":"nm2390252","character":"Tariq","urlCharacter":"http://www.imdb.com/character/ch0467308","main":true},{"actorName":"Beejan Land","urlProfile":"http://www.imdb.com/name/nm1371622","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWZjOTM3ZDYtMzEzNC00YWEzLWFhNzEtMTVhOTA3OWE2MTE1XkEyXkFqcGdeQXVyNDAzMDk5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1985","placeOfBirth":" Paddington, Sydney, New South Wales, Australia","height":"5' 11¾\" (1.82 m)","bio":"Beejan is an Australian actor. He attended Jacques Lecoq School of Mime, Movement and Theater, Paris. Alumni includes: Geoffrey Rush, Steven Berkoff, Julie Taymor and Yasmina Reza Graduated from Newtown High School of Performing Arts. Trained at Australian Theatre for Young People (ATYP). Alumni: Nicole Kidman (atyp patron), Baz Luhrmann (atyp Ambassador), Toni Collette, Abbie Cornish, Alyssa McClelland and Aden Young He has performed in countless theatre productions with them. Including a tour to Northern Ireland. Completed National Institute of Dramatic Arts - Young Actors Studio. Alumni includes: Rose Byrne and Rupert Reid. Completed Actor's College of Theatre and Television Activate. Alumni includes: Leeanna Walsman He won a scholarship from Village Roadshow to undertake acting studies. He is also an award-winning playwright.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWZjOTM3ZDYtMzEzNC00YWEzLWFhNzEtMTVhOTA3OWE2MTE1XkEyXkFqcGdeQXVyNDAzMDk5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1371622","name":"Beejan Land","idIMDB":"nm1371622"},"actorId":"nm1371622","character":"Daoud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sameer Ali Khan","urlProfile":"http://www.imdb.com/name/nm6040403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4Njc0NzQxNF5BMl5BanBnXkFtZTgwODU5ODg3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Sameer Ali Khan is an afghan actor who is working in Bollywood. He has been working in a few movies, as the villain role. The most successful movies are Happy New Year (2014) and Krrish 3 (2013). Sameer Ali Khan traveled to India in 2007 with an aim to find an opportunity to participate in Bollywood films. He graduated from Pune University as a political science student in 2010 and is an active athlete of Martial arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4Njc0NzQxNF5BMl5BanBnXkFtZTgwODU5ODg3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6040403","name":"Sameer Ali Khan","idIMDB":"nm6040403"},"actorId":"nm6040403","character":"Azam Ghol","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonas Khan","urlProfile":"http://www.imdb.com/name/nm3188340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTQ3NTA5NF5BMl5BanBnXkFtZTgwNzQzNzAxNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Jonas Khan is an actor, known for Rock the Kasbah (2015), Guns (2008) and Les sables de l'enfer (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTQ3NTA5NF5BMl5BanBnXkFtZTgwNzQzNzAxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3188340","name":"Jonas Khan","idIMDB":"nm3188340"},"actorId":"nm3188340","character":"Nizar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Husam Chadat","urlProfile":"http://www.imdb.com/name/nm0149434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjU1MDY5OF5BMl5BanBnXkFtZTYwOTgwMTc2._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"bio":"Husam Chadat is an actor and director, known for 13 Hours (2016), Just Get Married! (2003) and Layla M. (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjU1MDY5OF5BMl5BanBnXkFtZTYwOTgwMTc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0149434","name":"Husam Chadat","idIMDB":"nm0149434"},"actorId":"nm0149434","character":"Nasim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taylor Kinney","urlProfile":"http://www.imdb.com/name/nm1978325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDY4MDgyMV5BMl5BanBnXkFtZTcwNzg3OTQ5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1981","placeOfBirth":" Lancaster, Pennsylvania, USA","height":"5' 11\" (1.8 m)","bio":"Taylor Kinney is an American actor and model. He is known for his role as \"Kelly Severide\" on the hit TV series, Chicago Fire (2012), on NBC; as werewolf \"Mason Lockwood\" on The Vampire Diaries (2009), on The CW; and as \"Glenn Morrison\" on Trauma (2009), which aired on NBC. Kinney was born in Lancaster, Pennsylvania, to Pamela (Heisler), a dental hygienist, and Daniel Kinney, a banker. He is of German, Swiss-German, and English ancestry. Taylor and his three brothers were raised in Neffsville, Pennsylvania by their single mother, who worked as a dental hygienist. Kinney studied business management at West Virginia University, before developing an interest in acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDY4MDgyMV5BMl5BanBnXkFtZTcwNzg3OTQ5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1978325","name":"Taylor Kinney","idIMDB":"nm1978325"},"actorId":"nm1978325","character":"Private Barnes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Megan Raich","urlProfile":"http://www.imdb.com/name/nm2684603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0OTkyNjY5M15BMl5BanBnXkFtZTcwMDk5NDQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1997","placeOfBirth":" Santa Monica, California, USA","height":"5' 5\" (1.65 m)","bio":"Megan Raich was born on July 11, 1997 in Santa Monica, California, USA. She is an actress, known for I Spit on Your Grave: Vengeance is Mine (2015), Rock the Kasbah (2015) and Haunted Echoes (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0OTkyNjY5M15BMl5BanBnXkFtZTcwMDk5NDQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2684603","name":"Megan Raich","nicknames":["Meggie"],"idIMDB":"nm2684603"},"actorId":"nm2684603","character":"Brittany","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3164256","urlIMDB":"http://www.imdb.com/title/tt3164256","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$2,982,281","country":"USA","day":"22","month":"11","year":"2015","remarks":""},{"money":"$2,858,691","country":"USA","day":"15","month":"11","year":"2015","remarks":""},{"money":"$2,745,733","country":"USA","day":"08","month":"11","year":"2015","remarks":""}],"weekendGross":[{"money":"$81,084","country":"USA","day":"22","month":"11","year":"2015","remarks":"189 Screens"},{"money":"$52,789","country":"USA","day":"15","month":"11","year":"2015","remarks":"156 Screens"},{"money":"$59,021","country":"USA","day":"08","month":"11","year":"2015","remarks":"201 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"06","year":"2014","remarks":null},{"money":null,"country":null,"day":"30","month":"07","year":"2014","remarks":null}],"copyrightHolder":"Copyright © 2015 Kasbah, LLC"},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT Plus, Cooke S4 Lenses"],"laboratory":["The Digital Orchard"],"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (3.4K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["D-Cinema"]},"rating":"5.5","metascore":"29","filmingLocations":[{"location":"Morocco"}],"rated":"R","awards":[],"votes":"7,334","type":"Movie","companyCreditsSimple":[{"idCompany":"co0551691","name":"Covert Media"},{"idCompany":"co0088656","name":"Dune Films"},{"idCompany":"co0178111","name":"QED International"}],"keywords":{"keywords":["afghanistan","television show","music tour","teenage girl","music manager","ugly american","based on documentary","nightclub","shooting at a car","toy elephant","scene during end credits","watching tv","calling someone a whore","reference to the taliban","calling someone a fool","reference to eddie money","humvee","calling someone honey","pool party","reference to marilyn monroe","woman in bathing suit","calling someone babe","smashing a tv set","helicopter","cave","singing in a cave","reference to the bay city rollers","calling someone an asshole","woman wearing a top hat","reference to james brown","hijab","reference to jimmy cliff","reference to cat stevens","reference to whitney houston","reference to diana ross","reference to fleetwood mac","reference to the bee gees","reference to the eagles","reference to michael jackson","reference to pink floyd","van nuys california","reference to jon bon jovi","woman wearing hot pants","uso","uso tour","music business","handshake deal","burka","hiding in a car trunk","reference to the clash","girl singer","subtitled scene","singing around campfire","desert","reference to danielle steel","reference to jimi hendrix","singing in the shower","calling someone a piece of shit","camouflage uniform","tied to a bed","calling someone a pussy","reference to john mellencamp","f word","profanity","indoor swimming pool","reference to madonna","reference to kenny loggins","reference to cher","reference to susanna hoffs","reference to the bangles","reference to linda ronstadt","reference to stevie nicks","reference to zz top","singing in a car","hooker with heart of gold","cover song","hotel","mercenary","shootout","afghan war","cab driver","repression","singing","village","negotiation","shot in the shoulder","car explosion","arms dealer","prostitute","television host","death threat","father daughter relationship","zealot","conservative parent","scandal","conservative morals","womens rights","singing competition","singing voice","hidden talent","pursue a dream","down on one's luck","kabul afghanistan","american abroad","title based on song"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 01:00:13"}}