{"data":{"movies":[{"title":"Muted","originalTitle":"","year":"2014","releaseDate":"20140620","directors":[{"name":"Rachel Goldberg","id":"nm0325290"}],"writers":[{"name":"Brandi Nicole Payne","id":"nm3759443"},{"name":"Brandi Nicole Payne","id":"nm3759443"}],"runtime":"18 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjQxMTA2NTdeQTJeQWpwZ15BbWU4MDIzNjMzNjEx._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Short","Drama","Family"],"plot":"The Gladwells struggle to get the support of media and law enforcement when their teenage daughter disappears.","simplePlot":"The Gladwells struggle to get the support of media and law enforcement when their teenage daughter disappears.","actors":[{"actorName":"Chandra Wilson","urlProfile":"http://www.imdb.com/name/nm0933156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODA0MDIxOF5BMl5BanBnXkFtZTYwMTA4MDk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1969","placeOfBirth":" Houston, Texas, USA","birthName":"Chandra Danette Wilson","height":"5' (1.52 m)","bio":"Houston, Texas native Chandra Wilson began performing in musicals at the age of five with Theatre Under the Stars. She attended Houston's High School for the Performing and Visual Arts, and later went on to acquire her BFA in Drama from NYU's Tisch School of the Arts through which she spent four years at the Lee Strasberg Theatre Institute. Chandra's first series regular job was on ABC's Bob Patterson (2001) in the role of Claudia Hopper. She has made numerous other television appearances including guest-starring and recurring roles. She has also appeared in national television commercials for Blockbuster Video, Burger King, Scope, and the United Negro College Fund as well as numerous radio commercials. Aside from film and television, she has several New York stage credits. Her portrayal of Bonna Willis in the production of \"The Good Times are Killing Me\" by Lynda Barry (both at the Second Stage and Minetta Lane Theatres) won her a Theatre World Award for Outstanding Debut Performance. Some of her other stage credits include \"Paper Moon: The Musical\" at the Papermill Playhouse, \"The Family of Mann\" by Theresa Rebeck, \"Believing\" for the Young Playwright's Festival and the Broadway production of \"On the Town\" directed by George C. Wolfe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODA0MDIxOF5BMl5BanBnXkFtZTYwMTA4MDk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933156","name":"Chandra Wilson","idIMDB":"nm0933156"},"actorId":"nm0933156","character":"Lena Gladwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malcolm-Jamal Warner","urlProfile":"http://www.imdb.com/name/nm0912528","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjEyOTI4OF5BMl5BanBnXkFtZTcwMTM3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1970","placeOfBirth":" Jersey City, New Jersey, USA","height":"5' 11\" (1.8 m)","bio":"Emmy-nominated actor and director Malcolm-Jamal Warner was born in Jersey City, New Jersey. He was named after Malcolm X and legendary jazz pianist Ahmad Jamal. Warner first rose to national prominence by starring on the celebrated and long-running classic television series \"The Cosby Show.\" His work on the show garnered him a Primetime Emmy Nomination for Outstanding Supporting Actor in a Comedy Series. As a seasoned director, Warner has worked on a host of television series, including being a regular director [and producer] on the comedy series \"Malcolm & Eddie,\" and also having directed several episodes of \"The Cosby Show,\" \"All That,\" \"Keenan & Kel,\" \"The Fresh Prince of Bel-Air,\" \"Sesame Street,\" and the AIDS awareness video \"Timeout: The Truth about HIV, AIDS, and You' [which starred Magic Johnson and Arsenio Hall, and earned Warner the NAACP Key of Life Image Award. His short film, \"This Old Man,\" received critical acclaim on the theater festival circuit. In addition to his television credits, Warner made his feature film debut in Paramount Pictures' \"Drop Zone,\" and was also seen in Warner Bros' Pictures \"Fools Gold\" opposite Matthew McConaughey, Kate Hudson, and Donald Sutherland. He also co-starred in the independent films \"Restaurant\" with Adrien Brody, \"A Fare to Remember,\" and \"The List\" with Wayne Brady. On stage, Warner has starred in the off-Broadway plays \"Three Ways Home,\" \"Cryin' Shame,\" for which he received the NAACP Theater Award for Best Supporting Actor, \"Freefall\" at the Victory Garden Theatre in Chicago, and in \"A Midsummer Nights' Dream,\" at the La Jolla Playhouse in California. Warner received critical acclaim for his West Coast debut of his one-man theatrical production of \"Love and Other Social Issues.\" He will return to the stage in September 2014, reprising Sidney Poitier's role as Dr. John Prentice in \"Guess Who's Coming to Dinner,\" opening in Boston at The Huntington Theatre. Warner has held this role before, previously performing in the play at Washington D.C.'s esteemed Arena Theater. In 2014, Warner can be seen recurring on two hit series: TNT's \"Major Crimes,\" and FX's \"Sons of Anarchy.\" He was most recently seen on NBC's critically acclaimed series \"Community,\" and recently guest starred on \"The Michael J. Fox Show,\" TNT's \"Hawthorne\", AMC's \"The Cleaner,\" and Showtime's \"Dexter.\" In 2011, Warner produced, directed, and starred in the BET original series \"Reed Between the Lines\" opposite Tracee Ellis Ross. Warner's voice may be as well known as his likeness, for four seasons he was heard as the voice of the \"Producer\" on PBS' \"The Magic School Bus.\" Currently, he can be heard on the audio book version of \"The Marvelous Effect\" published by Berkley Trade, as well as in Simon & Schuster's \"Fatherhood\" by Bill Cosby. When not acting and directing, Warner is a poet and a bass player. His jazz-funk band Miles Long has performed in several major jazz festivals, including the Playboy Jazz Festival, and has opened for high profile artists including Earl Klugh and the late Luther Vandross, and he recently performed at the historic Apollo Theater. Both of Warner's independently distributed CD's, \"The Miles Long Mix Tape\" and \"Love and Other Social Issues\". Warner is set to release brand new music, fall 2014. Warner currently lives in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjEyOTI4OF5BMl5BanBnXkFtZTcwMTM3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912528","name":"Malcolm-Jamal Warner","idIMDB":"nm0912528"},"actorId":"nm0912528","character":"Curtis Gladwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandi Nicole Payne","urlProfile":"http://www.imdb.com/name/nm3759443","urlPhoto":"","biography":{"bio":"Brandi Nicole Payne is an actress and writer, known for Muted (2014), Quick Fix (2011) and Diary of a Wedding Planner (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3759443","name":"Brandi Nicole Payne","idIMDB":"nm3759443"},"actorId":"nm3759443","character":"Cara Gladwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danièle Watts","urlProfile":"http://www.imdb.com/name/nm0915125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM3NzI0Nzg2NV5BMl5BanBnXkFtZTgwODgzNTM4NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1985","placeOfBirth":" Riverside County, California, USA","birthName":"Danièle Lorise Watts","bio":"Daniele Watts made her film debut in the critically acclaimed Academy Award winning blockbuster hit Django Unchained--acting alongside Oscar nominated Christoph Waltz, Jamie Foxx, and Leonardo DiCaprio as \"Coco.\" On TV, she is known as Angela Mullen--love interest to \"Shane Botwin\" on the 8th season of Showtime's hit show Weeds, and as Martin Lawrence's daughter on the FX show, Partners, also starring Kelsey Grammar (Frazier). Watts studied performance at the North Springs Magnet Arts Program in Atlanta, GA, in Los Angeles at the University of Southern California, and in London at the British American Drama Academy. An award-winning theater artist and advocate for arts education, Daniele has taught performance through the Young Storytellers Foundation, Ices Afterschool Program, and the Spark Apprenticeship program-in collaboration with Imaginese Productions. Online she can be seen in a leading role in the romantic comedy Wingman Inc., distributed through Lionsgate, and on Amazon Instant video. Her starring role opposite Max Burkholder (Parenthood) in the independent film, Babysitter, can be viewed as of May 3, 2016 on Digital HD, On Demand and Amazon Instant Video. On YouTube, she plays opposite Brian Jordan Alvarez (Jane the Virgin, Logo's Gay Skit Happens) in The Gay and Wondrous Life of Caleb Gallo--an undeniable online hit that was hand selected to premiere at the 2016 Tribeca Film Festival's NOW program. Watts' character \"Tatiana\" joins the series cast starting in episode 4.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM3NzI0Nzg2NV5BMl5BanBnXkFtZTgwODgzNTM4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915125","name":"Danièle Watts","idIMDB":"nm0915125"},"actorId":"nm0915125","character":"Crystal Gladwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tara Tomicevic","urlProfile":"http://www.imdb.com/name/nm3971686","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTMwMDExM15BMl5BanBnXkFtZTgwNTg2MzQ3MDE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Tara was born in Croatia, grew up in Italy, and received her BA from the University of California, Berkeley on full scholarship. She began working professionally as an actor while in college at the prestigious Aurora Theatre Company, voted \"Best Theater Company in the Bay Area\". Her film MUTED, starring Chandra Wilson and Malcolm-Jamal Warner, is on HBO.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxOTMwMDExM15BMl5BanBnXkFtZTgwNTg2MzQ3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3971686","name":"Tara Tomicevic","idIMDB":"nm3971686"},"actorId":"nm3971686","character":"Sascha Kirsch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ross McCall","urlProfile":"http://www.imdb.com/name/nm0564680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODYxMTgwOF5BMl5BanBnXkFtZTcwNDQ4NzU2Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1976","placeOfBirth":" Port Glasgow, Scotland, UK","height":"5' 9\" (1.75 m)","bio":"Born in Port Glasgow, Scotland, McCall started his career in West End productions of Oliver, Les Miserables, The King and I, and Neil Simon's Lost in Yonkers. He then ventured into film and television, working opposite, among others, Bob Hoskins, Michael Caine, Jeremy Irons, and the rock group, Queen, playing Freddie Mercury in their MTV video, The Miracle. After many years with the BBC on various productions, he landed the role of Liebgott in Band of Brothers for HBO. This led to him coming to the US to work once more with Tom Hanks in the Robert Zemeckis film, The Polar Express. He began to star in various U.S. television shows, allowing him to move to the US full time. After starring alongside Dennis Hopper in Paul Haggis and Glen Mazzara's Crash, he went on to play the lead in many award winning films and television series including White Collar, In Embryo, AutoMotive and Castle. He resides in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODYxMTgwOF5BMl5BanBnXkFtZTcwNDQ4NzU2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564680","name":"Ross McCall","idIMDB":"nm0564680"},"actorId":"nm0564680","character":"Detective Fitzhugh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jorge-Luis Pallo","urlProfile":"http://www.imdb.com/name/nm0657903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDQ5NDgwNV5BMl5BanBnXkFtZTgwMDk1MDU2NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Jorge-Luis Christian Pallo","height":"5' 8\" (1.73 m)","bio":"Born in New York and raised in Queens, Ecuadorian and Puerto Rican Pallo was known as the \"parochial-school punk.\" He was raised by his single mom, Pat, a once-aspiring singer who never quite figured out how to pursue a career in show business. Having missed out on her opportunity, Pat encouraged her children to follow their dreams and gave them the best tools that she could by enrolling them in theatre, dance and guitar lessons. Fully prepared and supported Jorge made his grammar-school stage debut in \"The Nutcracker.\" He later starred in high school productions of \"Into the Woods\" and \"A Funny Thing Happened on the Way to the Forum\" Jorge was accepted to NYU's theatre program, but it wasn't until his junior year in The Hangar Theatre's Summer Stock production of \"A Few Good Men,\" directed by his mentor Bob Moss, that Jorge really connected with what would be his future career. After graduation, he toiled in Off-Broadway productions and joined the Latino sketch comedy group \"Vaso de Leche.\" A friend introduced him to his first manager who urged him to move to Los Angeles to further his career. LA was not very welcoming at first, but he felt he found a home while teaching acting classes at Scott Sedita Acting Studios. A chance meeting with a fraternity brother and casting director at a Texas Hold 'Em poker game won him six days of work on the Cd's film, which got him a SAG card. Jorge accumulated 60 plus feature film and network television credits. The highlight of his career was working with Spielberg on two features, Minority Report and War of the Worlds. He can most recently be seen as reoccurring character, Special Agent Bomb Tech Salazar, on NCIS LA. He also recently starred as Brian in the much anticipated sequel Insidious: Chapter 2. Jorge's television episodic work includes: Criminal Minds, Scorpion, Fear The Walking Dead, 24, Sons of Anarchy and of course his most notable appearance would be as school counselor, Marc Molina, in several episodes of The Secret Life of The American Teenager. He most recently appeared as the antagonist, Gio, in The List staring Michael Pena. Upcoming, he can be seen as recurring character, Alejandro Marquez, in Goliath with Billy Bob Thornton for Amazon. Jorge, also works as an acting coach in Los Angeles. His compassionate and imaginative teaching methods have helped guide some of the young Hollywood talent working today. Hollywood Heart and Toys for Tots are two charities that are near to his \"heart\" because \"being of service matters.\" This year he will be co-hosting his 13th annual cocktail party to gather toys for kids for Christmas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDQ5NDgwNV5BMl5BanBnXkFtZTgwMDk1MDU2NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0657903","name":"Jorge-Luis Pallo","idIMDB":"nm0657903"},"actorId":"nm0657903","character":"Detective Moreno","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rasha Goel","urlProfile":"http://www.imdb.com/name/nm2396108","urlPhoto":"","biography":{"bio":"Rasha Goel is an actress and producer, known for Muted (2014), Cha Do (2012) and Million Dollar Arm (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2396108","name":"Rasha Goel","idIMDB":"nm2396108"},"actorId":"nm2396108","character":"News Anchor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angela Kerwin","urlProfile":"http://www.imdb.com/name/nm3647918","urlPhoto":"","biography":{"bio":"Angela Kerwin is an actress, known for Muted (2014), Miss America Pageant (2000) and Buskers (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3647918","name":"Angela Kerwin","idIMDB":"nm3647918"},"actorId":"nm3647918","character":"Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Villar","urlProfile":"http://www.imdb.com/name/nm2279068","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDQwMTk4NF5BMl5BanBnXkFtZTcwNDg4NTg0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1979","placeOfBirth":" North Oaks, Minnesota, USA","birthName":"David W. Villar","height":"6' (1.83 m)","bio":"David Villar was born on May 1, 1979 in North Oaks, Minnesota, USA as David W. Villar. He is an actor, known for Grace and Frankie (2015), Days of Our Lives (1965) and Muted (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDQwMTk4NF5BMl5BanBnXkFtZTcwNDg4NTg0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2279068","name":"David Villar","idIMDB":"nm2279068"},"actorId":"nm2279068","character":"Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Courtney Jones","urlProfile":"http://www.imdb.com/name/nm6033598","urlPhoto":"","biography":{"bio":"Courtney Jones is an actress, known for Muted (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6033598","name":"Courtney Jones","idIMDB":"nm6033598"},"actorId":"nm6033598","character":"Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Mumme","urlProfile":"http://www.imdb.com/name/nm4601118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzA1NjgyMF5BMl5BanBnXkFtZTgwMDkxOTY5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Kelly Mumme is an actress, known for Veep (2012), Hawaii Five-0 (2010) and The Comeback (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzA1NjgyMF5BMl5BanBnXkFtZTgwMDkxOTY5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4601118","name":"Kelly Mumme","idIMDB":"nm4601118"},"actorId":"nm4601118","character":"Michelle Sargeant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maya Jenkins","urlProfile":"http://www.imdb.com/name/nm6030015","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWY1YTk2MjgtYTk2ZC00MGMyLTg5NWEtODg3NjRhNGRjOTRiXkEyXkFqcGdeQXVyNDcyNTQ0ODI@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Maya Jenkins is an actress and writer, known for Live Out Loud (2017), Muted (2014) and The Poser (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWY1YTk2MjgtYTk2ZC00MGMyLTg5NWEtODg3NjRhNGRjOTRiXkEyXkFqcGdeQXVyNDcyNTQ0ODI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6030015","name":"Maya Jenkins","nicknames":["Maya J","Maya-Papaya"],"idIMDB":"nm6030015"},"actorId":"nm6030015","character":"Monique","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Agustin Filippi","urlProfile":"http://www.imdb.com/name/nm6033599","urlPhoto":"","biography":{"bio":"Agustin Filippi is an actor, known for Muted (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6033599","name":"Agustin Filippi","idIMDB":"nm6033599"},"actorId":"nm6033599","character":"Partygoer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cymbaline Inez Olsen","urlProfile":"http://www.imdb.com/name/nm5292966","urlPhoto":"","biography":{"bio":"Cymbaline Inez Olsen is an actress, known for Muted (2014), The Jokesters (2015) and Fragile World (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5292966","name":"Cymbaline Inez Olsen","idIMDB":"nm5292966"},"actorId":"nm5292966","character":"Partygoer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3279922","urlIMDB":"http://www.imdb.com/title/tt3279922","business":{"budget":{"money":"$18,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["18 min"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.9","filmingLocations":[],"awards":[{"award":"American Black Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Short Film Award","categories":[{"category":"","names":[{"name":"Rachel Goldberg","id":"nm0325290","role":"director"},{"name":"Brandi Nicole Payne","id":"nm3759443","role":"writer"}]}]}]},{"award":"Black Reel Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Independent Short","names":[{"name":"Rachel Goldberg","id":"nm0325290","role":null}]}]}]},{"award":"Casting Society of America, USA 2016","titlesAwards":[{"titleAwardOutcome":"Won Artios","categories":[{"category":"Outstanding Achievement in Casting - Short Film","names":[{"name":"Robin Lippin","id":"nm0513639","role":null}]}]}]},{"award":"Downtown Film Festival Los Angeles 2015","titlesAwards":[{"titleAwardOutcome":"Won Festival Award","categories":[{"category":"Best Dramatic Short Film","names":[{"name":"Rachel Goldberg","id":"nm0325290","role":null},{"name":"Brandi Nicole Payne","id":"nm3759443","role":null},{"name":"Tara Tomicevic","id":"nm3971686","role":null}]}]}]},{"award":"Minneapolis St. Paul International Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Special Jury Prize","categories":[{"category":"Best Short Film","names":[{"name":"Rachel Goldberg","id":"nm0325290","role":null}]}]}]},{"award":"Rhode Island International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Director's Choice Award","categories":[{"category":"","names":[{"name":"Rachel Goldberg","id":"nm0325290","role":"director"},{"name":"Brandi Nicole Payne","id":"nm3759443","role":"producer"},{"name":"Tara Tomicevic","id":"nm3971686","role":"producer"},{"name":"Rainy Day Bliss Entertainment","id":null,"role":null}]}]}]},{"award":"SoHo International Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Festival Prize","categories":[{"category":"Best Acting Performance","names":[{"name":"Chandra Wilson","id":"nm0933156","role":null}]}]},{"titleAwardOutcome":"Won Grand Jury Award","categories":[{"category":"Special Jury Award","names":[{"name":"Rachel Goldberg","id":"nm0325290","role":null},{"name":"Brandi Nicole Payne","id":"nm3759443","role":null},{"name":"Tara Tomicevic","id":"nm3971686","role":null}]}]},{"titleAwardOutcome":"Won Special Jury Award","categories":[{"category":"","names":[{"name":"Rachel Goldberg","id":"nm0325290","role":null}]}]}]}],"votes":"61","type":"Movie","companyCreditsSimple":[{"idCompany":"co0452369","name":"Rainy Day Bliss Entertainment"},{"idCompany":"co0302430","name":"Longlost Pictures"},{"idCompany":"co0319081","name":"ReKon Productions"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:35:36"}}