{"data":{"movies":[{"title":"The First Line","originalTitle":"Promakhos","year":"2014","releaseDate":"20160920","directors":[{"name":"Coerte Voorhees","id":"nm6173242"},{"name":"John Voorhees","id":"nm6173243"}],"writers":[{"name":"Coerte Voorhees","id":"nm6173242"},{"name":"John Voorhees","id":"nm6173243"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDQzNjEzNl5BMl5BanBnXkFtZTgwMDU0MDU1NjE@._V1.jpg","countries":["USA","Greece","UK"],"languages":["English"],"genres":["Drama"],"plot":"Two Athenian attorneys pursue litigation against the British Museum for the return of the Parthenon Marbles. Andreas (Pantelis Kodogiannis) returns from New York to his homeland of Greece by invitation of the Director of the Acropolis Museum (Giancarlo Giannini). Andreas partners with his childhood friend and love interest Eleni (Kassandra Voyagis) and takes the case to London. Their efforts are fraught with difficulties including the social destabilization of the economic crisis that plagues Athens. In their pursuit of the return of the stolen artifacts, the spirit of Athina is reinvigorated. As the bronze statue of Athena Promakhos (Athina of the Frontline) used to stand guard in front of the Parthenon, both must find the courage to stand in defense of what they love.","simplePlot":"Two Athenian attorneys pursue litigation for the return of the Parthenon Marbles. As the bronze statue of Athena Promakhos used to stand guard in front of the Parthenon, both must find the courage to stand in defense of what they love.","actors":[{"actorName":"Pantelis Kodogiannis","urlProfile":"http://www.imdb.com/name/nm4362572","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTY0NDY5Nl5BMl5BanBnXkFtZTgwMDM1MDEyMTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Pantelis Kodogiannis is an actor, known for The First Line (2014), Sensation (2011) and Cab 57 (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTY0NDY5Nl5BMl5BanBnXkFtZTgwMDM1MDEyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4362572","name":"Pantelis Kodogiannis","idIMDB":"nm4362572"},"actorId":"nm4362572","character":"Andreas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kassandra Voyagis","urlProfile":"http://www.imdb.com/name/nm0903900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQwN2QyZGUtMmM4OC00Y2M5LWI2OWMtMmFlYzUyZDBmOGFlXkEyXkFqcGdeQXVyNDkzNTM5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8½\" (1.74 m)","bio":"London's The Evening Standard recently likened Kassandra's beauty and talent to that of Amal Clooney for her portrayal of a human rights attorney in her NetFlix film The First Line. Third generation entertainer Kassandra Voyagis follows in her family's entertainment history. She is the daughter of the well known Greek actor Yorgo Voyagis and actress Italian American Nadia Cassini. Her grandparents Patricia and Harrison Muller Sr. were dancers on Broadway doing musical theater on shows such as Allegro, Seventeen, Best Foot Forward & Oklahoma. With this much creativity in her blood, working in the entertainment industry was a natural. Born in Italy Kassandra spent her childhood in Rome, Italy, until her parents divorced. Her time in Europe resulted in an intimate knowledge of local culture and a fluency in Italian, French, Spanish, Greek and English. Kassandra has a degree from Oxford University. Kassandra's many film and TV credits are a testament to her versatility. The drama, _The First Line (2014)_qv is currently playing on NetFlix. The western, Boonville Redemption (2016), releases November, 2016. And her comedy Attack of the Killer Donuts (2016) is continuing to win award after award. She recently completed the role of Young Sister Constantine on the acclaimed TV show, Jane the Virgin (2014) . Kassandra recently worked with the acclaimed director Roman Coppola. Kassandra also has a prominent career in Italy and Greece. In Italy she has worked with great Italian Directors such as Italian comedy master, Mario Monicelli three times Oscar nominated for \"Best language foreign film\" and Alessandro D'Alatri, with whom she filmed the The Garden of Eden (1998). Kassandra first Feature Film was 'Red Ants' It won the critics award at Thessaloniki International Film Festival. Kassandra debuted in the United States with the epic miniseries Cléopatre (1999) for ABC television, co-staring with Timothy Dalton and Billy Zane. Her career has expanded from various TV series for both Italy (RAI TV) and Greece (Alpha TV) to the United States. She currently lives in the US and travels between Los Angeles, Athens, and Rome working on various projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQwN2QyZGUtMmM4OC00Y2M5LWI2OWMtMmFlYzUyZDBmOGFlXkEyXkFqcGdeQXVyNDkzNTM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0903900","name":"Kassandra Voyagis","idIMDB":"nm0903900"},"actorId":"nm0903900","character":"Eleni","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Giancarlo Giannini","urlProfile":"http://www.imdb.com/name/nm0316284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTMxNTMxNV5BMl5BanBnXkFtZTcwOTY5Mzc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1942","placeOfBirth":" La Spezia, Liguria, Italy","height":"5' 7\" (1.7 m)","bio":"Giancarlo Giannini is an Oscar-nominated Italian actor, director and multilingual dubber who made an international reputation for his leading roles in Italian films as well as for his mastery of a variety of languages and dialects. He was born August 1, 1942, in La Spezia, Italy. For ten years young Giannini lived and studied in Naples, earning his degree in electronics. At the age of 18 he enrolled in the Academy of Dramatic Art D'Amico in Rome, making his stage acting debut there. His credits included performances in contemporary Italian plays, as well, as in Italian productions of William Shakespeare's plays \"Romeo and Juliet\" and \"A Midsummer's Night Dream\". In 1965 he made his debut on television starring as David Copperfield in the TV mini-series made by RAI, the Italian national TV company. He made his big-screen debut in Libido (1965), a Freudian psychological thriller. Since 1966 he has been in a successful collaboration with the legendary Italian director Lina Wertmüller, who made several award-winning films with Giannini as a male lead. He appears as peasant Tonino who prepares to assassinate dictator Benito Mussolini in Film d'amour et d'anarchie (1973), as a sailor in the irony-laden comedy Vers un destin insolite, sur les flots bleus de l'été (1974) and as a survivor of a concentration camp in the Oscar-nominated Seven Beauties (1975). He also starred as a Jewish musician arrested by the Nazis in Rainer Werner Fassbinder's masterpiece Lili Marleen (1981). Giannini also made a reputation for dubbing international stars in films released on the Italian market, such as Jack Nicholson, Al Pacino, Michael Douglas, Dustin Hoffman, Gérard Depardieu and Ian McKellen, among others. He received a compliment from Stanley Kubrick for his dubbing of Nicholson in The Shining (1980). Giannini's fluency in English and his mastery of dialects has brought him a number of supporting roles in Hollywood productions, such as A Walk in the Clouds (1995), Hannibal (2001), Darkness (2002) and Man on Fire (2004), among many others. He appears as Rene Mathis in the 21st James Bond film Casino Royale (2006), and reprises the role in the sequel, Quantum of Solace (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTMxNTMxNV5BMl5BanBnXkFtZTcwOTY5Mzc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0316284","name":"Giancarlo Giannini","idIMDB":"nm0316284"},"actorId":"nm0316284","character":"Petros","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Freeman","urlProfile":"http://www.imdb.com/name/nm0293550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4Mzc2NjU2N15BMl5BanBnXkFtZTcwNzYzMDAxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1943","placeOfBirth":" Barnet, Hertfordshire, England, UK","height":"5' 9¾\" (1.77 m)","bio":"One of Britain's most versatile character actors, Paul Freeman's dark, hypnotic good looks and talent for accents have often seen him cast as villains. He originally worked first in advertising and then he trained as a teacher, while he participated in amateur dramatics as a pastime. As a professional actor he gained extensive experience performing in repertory in England and Scotland and landed small roles at the Royal Court Theatre. He is also a founding member of the Joint Stock Theatre Company. He acted at the National Theatre and began to get roles on British television. Films included The Long Good Friday (1980) (starring Bob Hoskins) and The Dogs of War (1980) (starring Christopher Walken). His work was noticed by American director Steven Spielberg, who cast Freeman as French archaeologist Rene Belloq, Harrison Ford's charismatic but utterly selfish rival in the blockbuster Raiders of the Lost Ark (1981). He had expected to appear in the next Indiana Jones movie, but Spielberg and George Lucas decided on a different story. Nevertheless, his portrayal of Belloq guaranteed him good work in the following years, during which he continued to showcase his command of dialects and chameleonlike ability to disappear into roles, such as the deliciously evil Professor Moriarty in the Michael Caine comedy, Without a Clue (1988). His notable television appearances have included Will Shakespeare (1978), Winston Churchill: The Wilderness Years (1981), Falcon Crest (1981), Inspector Morse (1987), and ER (1994). He has also continued to work as a stage actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4Mzc2NjU2N15BMl5BanBnXkFtZTcwNzYzMDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0293550","name":"Paul Freeman","idIMDB":"nm0293550"},"actorId":"nm0293550","character":"Callum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georges Corraface","urlProfile":"http://www.imdb.com/name/nm0004248","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxNzk3NTM5N15BMl5BanBnXkFtZTcwNTg0NjEwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1952","placeOfBirth":" Paris, France","height":"6' (1.83 m)","bio":"Georges Corraface has risen to star status in Europe throughout a career in film, theatre and television. This ruggedly charismatic leading man is notably a box-office draw in Greece, Spain and France, where he lives and is a popular celebrity. A classically trained and versatile actor, his gift for languages and his multi-cultural background has enabled him to work in eight languages and an even wider variety of accents. At the height of an auspicious and daring theater career, as a member of the famed Peter Brook Company in Paris, Corraface was discovered by David Lean in 1987. The legendary director cast him in the title role of \"Nostromo\". Although the film was never made, due to Lean's illness, the resultant attention launched Corraface into American productions with films like Not Without My Daughter (1991), Impromptu (1991) Christopher Columbus: The Discovery (1992) and Escape from L.A. (1996). In recent years, however, he has found his most challenging and successful roles in European film and television where his original characterizations have won him a loyal and ever-growing following, critical acclaim and Best Actor awards. The smolderingly lusty Yaman in La pasión turca (1994) wooed audiences in Spain. Meanwhile, in France, Corraface was getting rave reviews for a wide variety of starring movie roles, ranging from the candid and ebullient macho, Cheto, in the romantic comedy Vive la mariée... et la libération du Kurdistan (1998) to the swarthy and noble ex-con, Max, in the dark psychological thriller La préférence (1998). In Greece, he made his mark with his performances first as a tormented and emotionally disconnected everyman in I sfagi tou kokora (1996), then as the comically naive and soulful peasant on a pilgrimage in Evagora's Vow (2001). Both parts earned him the highest film awards in Greece. He went on to portray Fannis, the introspective and traumatized exile in the nostalgic comedy Un ciel épicé (2003), which broke all Greek box-office records before conquering audiences abroad. French television has made Corraface a broadcast star with mini-series roles like the suavely sophisticated François in The Blue Bicycle (2000), the hurt and sensitive rebel Thomas in L'été rouge (2002), or the earnestly bumbling professor in Le château des oliviers (1993)\". Other TV productions focusing on contemporary issues have reinforced his popularity, through characters such as the haunted, hard-drinking journalist Rachid in the made for Arte film, Algiers-Beirut: A Souvenir (1998), or as Alex, a solitary, fast-talking swat team crisis negociator in Alex Santana, négociateur (2002), a series of made-for-TV movies (TF1). Overall, Corraface appears to enthusiastically alternate his more commercial work with dedicated involvement in less mainstream \"films d'auteurs\" with a new generation of independent filmmakers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxNzk3NTM5N15BMl5BanBnXkFtZTcwNTg0NjEwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004248","name":"Georges Corraface","idIMDB":"nm0004248"},"actorId":"nm0004248","character":"Michel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Byrne","urlProfile":"http://www.imdb.com/name/nm0126250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTQzMTA2MF5BMl5BanBnXkFtZTcwNjQ0NjQwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1943","placeOfBirth":" London, England, UK","height":"5' 9½\" (1.77 m)","bio":"Michael Byrne was born on November 7, 1943 in London, England. He is an actor, known for Indiana Jones and the Last Crusade (1989), Braveheart (1995) and Gangs of New York (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTQzMTA2MF5BMl5BanBnXkFtZTcwNjQ0NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126250","name":"Michael Byrne","idIMDB":"nm0126250"},"actorId":"nm0126250","character":"Richard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yorgo Voyagis","urlProfile":"http://www.imdb.com/name/nm0903901","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3ODExMDc5Nl5BMl5BanBnXkFtZTcwNzQ2Nzg2Nw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1945","placeOfBirth":" Athens, Greece","height":"6' 1\" (1.85 m)","bio":"Yorgo Voyagis was born on December 6, 1945 in Athens, Greece. He is known for his work on Zorba the Greek (1964), Swept Away (2002) and The Bourne Identity (1988). He has been married to Diana Scorits since 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3ODExMDc5Nl5BMl5BanBnXkFtZTcwNzQ2Nzg2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0903901","name":"Yorgo Voyagis","idIMDB":"nm0903901"},"actorId":"nm0903901","character":"George Kadmos","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Spiros Focás","urlProfile":"http://www.imdb.com/name/nm0283754","urlPhoto":"","biography":{"dateOfBirth":"17 August 1937","placeOfBirth":" Patras, Achaea, West Greece, Greece","bio":"Spiros Focas is one of Greece's most respected and well-known actors. He was discovered by legendary Italian director Luchino Visconti and cast in a lead role in the classic Rocco and His Brothers (1960). He went on to star in many Greek and Italian films throughout the 1960s and '70s, working with such famous directors as Vincente Minnelli and Ferdinando Baldi. His work in Hollywood includes the hit films The Jewel of the Nile (1985) and Rambo III (1988). His most recent work includes the role of Uncle Telly in 3 Nights in Nisyros (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0283754","name":"Spiros Focás","idIMDB":"nm0283754"},"actorId":"nm0283754","character":"Fotis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karim Kassem","urlProfile":"http://www.imdb.com/name/nm2669159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4ODU1MTQ1MV5BMl5BanBnXkFtZTgwNzA1NDU0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1986","placeOfBirth":" Cairo, Egypt","birthName":"Karim Ahmed Kassem","bio":"Karim Kassem is a professional Egyptian actor. Discovered in 2006, he had his cinematic breakthrough in the teen film Awqat Faragh. Karim Kassem graduated from the The American University in Cairo, where he majored in theater and acted in many of the university's plays. He is trilingual in Arabic, French and English. He also trained in Paris (Cours Florent), New York City (Susan Batson), Los Angeles (USC Film School) and London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4ODU1MTQ1MV5BMl5BanBnXkFtZTgwNzA1NDU0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2669159","name":"Karim Kassem","idIMDB":"nm2669159"},"actorId":"nm2669159","character":"Amit","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vicky Dalli","urlProfile":"http://www.imdb.com/name/nm5633565","urlPhoto":"","biography":{"bio":"Vicky Dalli is an actress and director, known for A Moment on the Lips (2014), The Glory Hole (2014) and The Red Sweater (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5633565","name":"Vicky Dalli","idIMDB":"nm5633565"},"actorId":"nm5633565","character":"Newscaster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kostas Daniilidis","urlProfile":"http://www.imdb.com/name/nm6928333","urlPhoto":"","biography":{"bio":"Kostas Daniilidis is an actor, known for The First Line (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6928333","name":"Kostas Daniilidis","idIMDB":"nm6928333"},"actorId":"nm6928333","character":"Minister of Energy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Eleftheriou","urlProfile":"http://www.imdb.com/name/nm1058270","urlPhoto":"","biography":{"bio":"Kelly Eleftheriou is an actress, known for L'amour est un éléphant (2000), The First Line (2014) and Sofia orthi (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1058270","name":"Kelly Eleftheriou","idIMDB":"nm1058270"},"actorId":"nm1058270","character":"Sophia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Evelyn Zanni","urlProfile":"http://www.imdb.com/name/nm6928334","urlPhoto":"","biography":{"bio":"Evelyn Zanni is an actress, known for The First Line (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6928334","name":"Evelyn Zanni","idIMDB":"nm6928334"},"actorId":"nm6928334","character":"Law Firm Secretary","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3422314","urlIMDB":"http://www.imdb.com/title/tt3422314","business":{"budget":{"money":"$700,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"11","year":"2013","remarks":null},{"money":null,"country":null,"day":"09","month":"01","year":"2014","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Canon EOS C500, Zeiss Compact Prime Lenses","Red Epic-M, Zeiss Master Prime Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Canon Cinema RAW (4K)","Redcode RAW (5K)"],"printedFilmFormat":["Digital"]},"rating":"5.4","filmingLocations":[{"location":"Greece"}],"awards":[],"votes":"138","type":"Movie","companyCreditsSimple":[{"idCompany":"co0466707","name":"A Visionary Film"},{"idCompany":"co0420478","name":"Itasca Films"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:39:41"}}