{"data":{"movies":[{"title":"Toy Story That Time Forgot","originalTitle":"","year":"2014","releaseDate":"20141202","directors":[{"name":"Steve Purcell","id":"nm0700760"}],"writers":[{"name":"Steve Purcell","id":"nm0700760"}],"runtime":"22 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc2OTA1MDM4M15BMl5BanBnXkFtZTgwNjczMDk5MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short","Adventure","Comedy","Family","Fantasy"],"plot":"The story takes place after a Christmas holiday with the regular toys finding themselves trapped in unusual territory with a group of new and delusional action figures. Together they must find their way back to their child's bedroom and to safety.","simplePlot":"It's a post Christmas play date and the toys have to go up against the fearsome and aggressive new dino toys.","actors":[{"actorName":"Tom Hanks","urlProfile":"http://www.imdb.com/name/nm0000158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjMwNDA3Nl5BMl5BanBnXkFtZTcwMTA2NDY3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1956","placeOfBirth":" Concord, California, USA","birthName":"Thomas Jeffrey Hanks","height":"6' (1.83 m)","bio":"Thomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother's family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family. He moved around a lot after his parents' divorce, living with a succession of step-families. No problems, no abuse, no alcoholism - just a confused childhood. He had no acting experience in college and, in fact, credits the fact that he couldn't get cast in a college play with actually starting his career. He went downtown, auditioned for a community theater play, was invited by the director of that play to go to Cleveland, and there his acting career started. He met his second wife, actress Rita Wilson on the set of his television show Bosom Buddies (1980) - she appeared in one episode in the second season (1981), Bosom Buddies: All You Need Is Love (1981). They have two children, and Tom has another son and daughter by his first wife, Samantha Lewes. In 1996, he made his first step behind the camera, directing and writing as well as starring in the film, That Thing You Do! (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjMwNDA3Nl5BMl5BanBnXkFtZTcwMTA2NDY3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000158","name":"Tom Hanks","idIMDB":"nm0000158"},"actorId":"nm0000158","character":"Woody","urlCharacter":"http://www.imdb.com/character/ch0002466","main":true},{"actorName":"Tim Allen","urlProfile":"http://www.imdb.com/name/nm0000741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODY0NTAwOF5BMl5BanBnXkFtZTcwOTI3NjQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1953","placeOfBirth":" Denver, Colorado, USA","birthName":"Timothy Allen Dick","height":"5' 10½\" (1.79 m)","bio":"Timothy Allen Dick was born on June 13, 1953, in Denver, Colorado, USA, to Martha Katherine (Fox) and Gerald M. Dick. His father, a real-estate salesman, was killed in a collision with a drunk driver while driving his family home from a University of Colorado football game, when Tim was eleven years old. His mother, a community-service worker, remarried her high-school sweetheart, an Episcopalian deacon, two years after Tim's father's death. Tim has a total of eight siblings. His ancestry includes English, German, Irish, and Scottish. When Tim was young, his family moved to Birmingham, Michigan. In high school, his favorite subject was shop, of course, and after high school, he attended Western Michigan University and graduated with a degree in Television Production in 1975. In 1978, he was arrested on drug charges and spent two years in jail. Upon his release, he had a new outlook on life and on a dare from a friend, started his comedy career at the Comedy Castle in Detroit. Later, he went on to do several cable specials, including, Comedy's Dirtiest Dozen (1988) and Tim Allen: Men Are Pigs (1990). In 1991, he became the star of his own hit television series on ABC called Home Improvement (1991). While continuing to film his television series throughout most of the 1990s, he starred in a string of blockbuster movies including The Santa Clause (1994), Toy Story (1995), Toy Story 2 (1999) and Galaxy Quest (1999). In August 1996, he developed and unveiled his own signature line of power tools, manufactured by Ryobi. On top of all that, he has his own racing team, Tim Allen/Saleen RRRRacing. In May 1999, he ended his series Home Improvement (1991) after eight seasons and in 2001, he filmed such movies as Big Trouble (2002) and Joe Somebody (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODY0NTAwOF5BMl5BanBnXkFtZTcwOTI3NjQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000741","name":"Tim Allen","nicknames":["The Tool Man"],"idIMDB":"nm0000741"},"actorId":"nm0000741","character":"Buzz Lightyear","urlCharacter":"http://www.imdb.com/character/ch0002468","main":true},{"actorName":"Kristen Schaal","urlProfile":"http://www.imdb.com/name/nm1102891","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNzAzNzUwM15BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1978","placeOfBirth":" Longmont, Colorado, USA","birthName":"Kristen Joy Schaal","height":"5' 6\" (1.68 m)","bio":"Kristen Schaal is an American actress, voice artist, writer, and comedian. She is best known for her roles as Mel on the HBO series Flight of the Conchords, Louise Belcher on FOX animated comedy Bob's Burgers, and Mabel Pines on Gravity Falls. Other notable roles include her appearances as a commentator on The Daily Show, Amanda Simmons on The Hotwives of Orlando, Hazel Wassername on 30 Rock, Victoria Best on WordGirl, Trixie from the Toy Story franchise, and Anne on Wilfred. Since 2015, she has co-starred alongside Will Forte in the Fox comedy The Last Man on Earth, playing the role of Carol.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNzAzNzUwM15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1102891","name":"Kristen Schaal","idIMDB":"nm1102891"},"actorId":"nm1102891","character":"Trixie","urlCharacter":"http://www.imdb.com/character/ch0203089","main":true},{"actorName":"Kevin McKidd","urlProfile":"http://www.imdb.com/name/nm0571727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUxNTQ3OV5BMl5BanBnXkFtZTcwOTg4Mjc5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1973","placeOfBirth":" Elgin, Moray, Scotland, UK","height":"5' 11\" (1.8 m)","bio":"Kevin McKidd was born and raised in Elgin, Scotland, the son of Kathleen, a secretary, and Neil McKidd, a plumber. He was a member of the Moray Youth Theatre, before going on to study Engineering at the University of Edinburgh. While at the university, Kevin became involved with Bedlam Theatre, the university's student theatre company. At this point, Kevin decided to give up on engineering and dropped out of the university to pursue acting full-time. In 1994, he landed the leading role in the stageplay, \"The Silver Darlings\", produced by Robert Carlyle's Rain Dog Theatre Company. It was only a matter of time before Kevin made his screen debut as the vicious gangleader, \"Malky Johnson\", in Gillies MacKinnon's Small Faces (1996). His next role was as the tragic, gentle giant, \"Tommy\", in Trainspotting (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUxNTQ3OV5BMl5BanBnXkFtZTcwOTg4Mjc5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571727","name":"Kevin McKidd","idIMDB":"nm0571727"},"actorId":"nm0571727","character":"Reptillus Maximus","urlCharacter":"http://www.imdb.com/character/ch0418426","main":true},{"actorName":"Emily Hahn","urlProfile":"http://www.imdb.com/name/nm3432684","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2RmZTI5ZmEtOGI5Yy00YTllLWE4ZjctYzZlMjQyNDhhMmUxXkEyXkFqcGdeQXVyMjExMTE5NjM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 2000","placeOfBirth":" Los Angeles, California, USA","bio":"Emily Hahn was born on July 28, 2000 in Los Angeles, California, USA. She is known for her work on Toy Story 3 (2010), Wreck-It Ralph (2012) and ParaNorman (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2RmZTI5ZmEtOGI5Yy00YTllLWE4ZjctYzZlMjQyNDhhMmUxXkEyXkFqcGdeQXVyMjExMTE5NjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3432684","name":"Emily Hahn","idIMDB":"nm3432684"},"actorId":"nm3432684","character":"Bonnie","urlCharacter":"http://www.imdb.com/character/ch0208461","main":true},{"actorName":"Wallace Shawn","urlProfile":"http://www.imdb.com/name/nm0001728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1943","placeOfBirth":" New York City, New York, USA","birthName":"Wallace Michael Shawn","height":"5' 2\" (1.57 m)","bio":"American character actor and writer Wallace Shawn has one of those fun, mischievously homely faces just made to entertain. Though he got out of the starting gate rather slowly, he has since excelled on stage, television and film while managing to turn himself into a winner with his loser-type looks. Woody Allen's character in the movie Manhattan (1979) amusingly describes Wallace's character as \"a homunculus\", which is a pretty fair description of this predominantly bald, wan, pucker-mouthed, butterball-framed, slightly lisping gent. Wallace made his movie debut in Allen's heralded classic playing Diane Keaton's ex-husband. Born to privilege on November 12, 1943 in New York City, Wallace was the son of renowned editor William Shawn of \"The New Yorker\" fame and educated at both Harvard University, where he studied history, and Magdalen College, Oxford. Wallace initially taught English in India on a Fulbright scholarship, and then English, Latin and drama back in New York. However, a keen interest in writing and acting soon compelled him to leave his cushy position and pursue a stage career as both playwright and actor. During his distinguished career, Wallace turned out several plays. \"Our Late Night\", the first of his works to be performed, was awarded an off-Broadway Obie in 1975. \"A Thought in Three Parts\" (1976); \"The Mandrake\" (1977), which he translated from the original Italian and in which he made his acting debut; \"Marie and Bruce\" (1979); \"Aunt Dan and Lemon\" (1985) and \"The Fever\", for which he received his second Obie Award for \"Best New Play\" during the 1990-91 season, then followed. A popular support player in both comedy and occasional drama, his assorted kooks, creeps, eggheads and schmucks possessed both endearing and unappetizing qualities. He earned some of his best early notices partnered with theatre director/actor Andre Gregory in the unique Louis Malle-directed film My Dinner with Andre (1981). Shawn co-wrote the improvisatory, humanistic piece and his brother, Allen Shawn, was the composer. Shawn and Gregory would collaborate again for Malle in another superb, original-concept film Vanya on 42nd Street (1994). Among the quality offbeat filming involving has been Bruce Paltrow's A Little Sex (1982); James Ivory's The Bostonians (1984); Stephen Frears' Prick Up Your Ears (1987); Rob Reiner's The Princess Bride (1987); Alan Rudolph's The Moderns (1988) and Mrs. Parker and the Vicious Circle (1994); Paul Bartel's Scenes from the Class Struggle in Beverly Hills (1989); and several others for Woody Allen: Radio Days (1987), Shadows and Fog (1991), The Curse of the Jade Scorpion (2001) and Melinda and Melinda (2004). Of late, he has lent his vocal talents to a considerable number of animated pictures including A Goofy Movie (1995), Toy Story (1995) (and its sequel), The Jungle Book: Mowgli's Story (1998), The Incredibles (2004), Chicken Little (2005) and Happily N'Ever After (2006). Over the decades, Shawn has scurried about effortlessly in a number of television guest appearances including Taxi (1978), Homicide: Life on the Street (1993), Ally McBeal (1997), Law & Order: Criminal Intent (2001) and Desperate Housewives (2004), and has drummed up a few recurring roles for himself in the process, including The Cosby Show (1984), Murphy Brown (1988), Star Trek: Deep Space Nine (1993) and Crossing Jordan (2001). In the series Clueless (1996), based on the highly successful of the same name Clueless (1995), Shawn revisited his role as the owlish high school teacher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001728","name":"Wallace Shawn","idIMDB":"nm0001728"},"actorId":"nm0001728","character":"Rex","urlCharacter":"http://www.imdb.com/character/ch0002475","main":true},{"actorName":"Steve Purcell","urlProfile":"http://www.imdb.com/name/nm0700760","urlPhoto":"","biography":{"bio":"Steve Purcell is known for his work on Brave (2012), Toy Story That Time Forgot (2014) and Cars (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0700760","name":"Steve Purcell","idIMDB":"nm0700760"},"actorId":"nm0700760","character":"The Cleric","urlCharacter":"http://www.imdb.com/character/ch0475693","main":true},{"actorName":"Jonathan Kydd","urlProfile":"http://www.imdb.com/name/nm0477329","urlPhoto":"","biography":{"dateOfBirth":"1956","placeOfBirth":" London, England, UK","bio":"Jonathan Kydd was born in 1956 in London, England. He is an actor and writer, known for Flushed Away (2006), Toy Story That Time Forgot (2014) and Dot the I (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0477329","name":"Jonathan Kydd","idIMDB":"nm0477329"},"actorId":"nm0477329","character":"Ray-Gon","urlCharacter":"http://www.imdb.com/character/ch0475693","main":true},{"actorName":"R.C. Cope","urlProfile":"http://www.imdb.com/name/nm5679435","urlPhoto":"","biography":{"bio":"R.C. Cope is an actor, known for Toy Story That Time Forgot (2014) and Crimson's Kiss (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5679435","name":"R.C. Cope","idIMDB":"nm5679435"},"actorId":"nm5679435","character":"Mason","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Rickles","urlProfile":"http://www.imdb.com/name/nm0725543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTk1NzY1M15BMl5BanBnXkFtZTcwNjk4NDMwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1926","placeOfBirth":" New York City, New York, USA","birthName":"Donald Jay Rickles","height":"5' 6\" (1.68 m)","bio":"Don Rickles was born May 8, 1926 in New York. After the Golden Era of Hollywood ended, Don Rickles is one man still living to tell his tales. One of the most respected talents in entertainment, Rickles got his start in the night clubs, toiling for over 20 years, until 1958, when Don made his film debut in Run Silent Run Deep (1958). The movie was a big hit. Afterward, Rickles continued acting, starring in films like X: The Man with the X-Ray Eyes (1963), Bikini Beach (1964), Enter Laughing (1967), and Kelly's Heroes (1970). In 1973, Don became a regular on Dean Martin's Celebrity Roasts. From 1973 until 1984, Don appeared frequently on Dean's show, paying tribute to some of his friends, like Bob Hope, Frank Sinatra, Lucille Ball, and was even the roast master on the roast for Dean Martin himself. In 1976, Don his own TV series CPO Sharkey (1976), which enjoyed a two year run. After 1984, Don began taking it easy, appearing in a few minor film roles. But in 1995, Don made a big comeback, appearing with Tom Hanks and Tim Allen in Toy Story (1995) in the role of the grouchy Mr. Potato Head. In 1999, he returned as Mr. Potato Head in Toy Story 2 (1999). He died April 6, 2017, in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTk1NzY1M15BMl5BanBnXkFtZTcwNjk4NDMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725543","name":"Don Rickles","nicknames":["Mr. Warmth","The Merchant of Venom","Glass Head"],"idIMDB":"nm0725543"},"actorId":"nm0725543","character":"Mr. Potato Head","urlCharacter":"http://www.imdb.com/character/ch0002482","main":true},{"actorName":"Timothy Dalton","urlProfile":"http://www.imdb.com/name/nm0001096","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5NDA1OTA4NV5BMl5BanBnXkFtZTcwMDE3NDk0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1946","placeOfBirth":" Colwyn Bay, Wales, UK","birthName":"Timothy Peter Dalton","height":"6' 2\" (1.88 m)","bio":"At a consistently lean 6' 2\", green-eyed Timothy Dalton may very well be one of the last of the dying breed of swashbuckling, classically trained Shakespearean actors who have forged simultaneous successful careers in theater, television and film. He has been comparison-shopped roundly for stepping into roles played by other actors, first following Sir Laurence Olivier in Wuthering Heights (1970), then as \"James Bond\" in The Living Daylights (1987) and Licence to Kill (1989), and even more brutally, recently, as \"Rhett Butler\" in Scarlett (1994). Undaunted and good-natured, he has always stated that he likes the risk of challenges. He was born in Colwyn Bay, North Wales, the oldest of five children of Dorothy (Scholes) and Peter Dalton-Leggett. His father was stationed in Colwyn Bay during WWII, and moved the family to Manchester in the late 1940s, where he worked in advertising and raised the growing Dalton family, in an upper-class neighbourhood outside of Belper, Derbyshire. Timothy was enrolled in a school for bright children, where he excelled in sports and was interested in the sciences. He was fascinated with acting from a young age, perhaps due to the fact that both his grandfathers were vaudevillians, but it was when he saw a performance of \"Macbeth\" at age 16 that his destiny was clinched. After leaving Herbert Strutt Grammar School at the age of sixteen, he toured as a leading member of Michael Croft's National Youth Theater. Between 1964-66, he studied at The Royal Academy of Dramatic Art (RADA). Just before completing his two years, he quit and joined the Birmingham Repertory Theatre, playing the lead in many productions under the direction of Peter Dews while at the same time turning professional. Dalton later said of RADA in an interview with \"Seventeen\" Magazine (December 1970), \"It took a year to undo the psychological damage that was caused by the oppressive teachers\". His talent and classic good looks immediately landed him professional work in television, guest-starring on an episode of the short-lived TV series, Judge Dee (1969), and as a regular on the 14-episode series Sat'day While Sunday (1967) with the young Malcolm McDowell. In late 1967 Peter O'Toole recommended him for the role of the young \"King Philip of France\" in The Lion in Winter (1968) (coincidentally, this was also Anthony Hopkins' big break). The following year, he starred in the Italian film Le voyeur (1970) with Marcello Mastroianni and Virna Lisi, although his voice was dubbed into Italian by another actor. Dalton also mixed in a healthy dose of BBC work during this time, including The Three Princes (1968), _BBC Play of the Month: Five Finger Exercise (1970) (TV)_and Candida (1973). Also during this time, he was approached and tested for the role of James Bond in On Her Majesty's Secret Service (1969) but turned it down, feeling he was too young for the part. His next film was another costume drama, Cromwell (1970), working with director Ken Hughes, with whom he later made his first American film, Sextette (1978). He followed Cromwell (1970) with Wuthering Heights (1970) and Mary, Queen of Scots (1971). He was already developing a pattern in his films that would follow him throughout his career: costume dramas where he played royalty, which he had done in three of his first four films (and ridden horses in three, and raised a sword in two). In 1972, he was contracted to play a part in Lady Caroline Lamb (1972). However, at the last moment he was replaced. Dalton sued the company and won, but the film went on without him. From the early to mid-1970s, he decided to further hone his skills by going back into the theater full time. He signed on with the Royal Shakespeare Company (RSC) and the Prospect Theatre Company (PTC), and toured the world with both, playing the leads in \"Romeo and Juliet\", \"King Lear\", \"Henry V\", \"Love's Labours Lost\", and \"Henry IV\" - parts 1 and 2. In 1975, he returned to movies in the British/Austrian production of The Executioner (1975). It was followed in 1976 by the Spanish religious historical film about the inquisition, The Man Who Knew Love (1978), which was never widely released. After this, he took another break from film, mixing in a healthy dose of theater, returning for his first American film, Sextette (1978), and the lengthy miniseries Centennial (1978), his first American television appearance, in which Lynn Redgrave played his wife. Because of his broad exposure to American audiences in this series, he began to get more frequent film and television work in the US, including the episode \"Fallen Angel\" of Charlie's Angels (1976) -- which, ironically, had several references to his character being like \"James Bond\" -- and the TV movie The Flame Is Love (1979). Although he did a few features, including playing Vanessa Redgrave's husband in Agatha (1979), most of his work until 1985 consisted of TV movies and miniseries. He played royalty again in the very campy Flash Gordon (1980). He followed this with a small film, Chanel Solitaire (1981) and, in 1981, also filmed a staged production of Antony and Cleopatra (1984) opposite Lynn Redgrave, with Anthony Geary, as well as Nichelle Nichols and Walter Koenig of the original TV series, Star Trek (1966). The years 1983-1987 have so far been the most prolific of his career. In 1983, he starred as \"Rochester\" in what he considers one of his best works, the BBC's very popular Jane Eyre (1983). Also, during this time, Roger Moore was considering leaving Bond, and Dalton was again approached, but due to his full schedule, he had to decline. In 1984, he did one of his many narrations in the Faerie Tale Theatre (1982) production of The Emperor's New Clothes (1987). That same year also saw him in the Hallmark Hall of Fame piece The Master of Ballantrae (1984) opposite Michael York and Richard Thomas, and another miniseries, Mistral's Daughter (1984), opposite Stefanie Powers and Stacy Keach. The next year was also a very busy one. He starred in another miniseries, Sins (1986), playing the brother of Joan Collins, and also starred in and narrated the four-hour TV movie Florence Nightingale (1985), opposite Jaclyn Smith. He also starred in The Doctor and the Devils (1985) as \"Dr. Thomas Rock\", with Stephen Rea, Jonathan Pryce, and Patrick Stewart. In the mid-to-late 1980s, Dalton narrated many nature documentaries, most notably several episodes of the UK series Wildlife Chronicles (1987) (called \"Wildlife Chronicles\" in the US). In the spring of 1986, he teamed with Vanessa Redgrave for another revival of a Shakespeare production, The Taming of the Shrew (1988) and his interpretation of \"Petrucchio\" received uniformly high praise. Simultaneously, the world was playing a guessing game as to who would succeed Roger Moore as \"James Bond\". Dalton was approached but was committed to the theater, and so Pierce Brosnan was offered the part. When Brosnan was unable to get out of his Remington Steele (1982) contract at the last minute, Dalton was again approached. Able now to work it into his tight schedule, he agreed. Although his first outing as Bond, The Living Daylights (1987), did reasonably well at the box-office, Licence to Kill (1989) suffered from a lack of marketing that appeared to harm its chances of big box-office success. However, Dalton's interpretation of \"Bond\" in this film received critical acclaim in some quarters as being the closest to author Ian Fleming's literary \"Bond\". Back in the theater, he teamed again with Vanessa Redgrave for a revival of Eugene O'Neill's seldom performed play, \"A Touch of the Poet\", which is considered by some to be his and Redgrave's finest professional collaboration. Although there were talks of bringing the play to Broadway, this never materialized. Following Licence to Kill (1989), he immediately returned to one of his strengths, costume drama, in The King's Whore (1990). It was followed by his excellent performance in Disney's The Rocketeer (1991), where he played a swashbuckling, Errol Flynn type. In August 1991, he teamed with Whoopi Goldberg for the first bi-racial interpretation of \"Love Letters\" for the final sold-out performances of the play in Los Angeles. When he had signed on to do \"Bond\" it was for three pictures, but the rights to the \"Bond\" films became entangled in lengthy litigation, delaying production of the third. During this wait, he was set to star in the title role of another historical epic, Christopher Columbus: The Discovery (1992). From the start, however, the film was doomed due to the competition with the Gérard Depardieu \"Columbus\" picture, which was racked with its own problems. When the director was replaced, Dalton backed out and was followed by his co-star, Isabella Rossellini. In 1992, he starred in the A&E production Framed (1992), which won a bronze medal in the 1993 New York Film Festival. The next year, he journeyed to northern Alaska and Minnesota to make a documentary on one of his favorite subjects, wolves. In the Company of Whales (1991) went on to win a silver medal in the 1994 New York Film Festival. He kept busy in television through 1993 and 1994. He made Red Eagle (1994), Scarlett (1994) and managed to squeeze in a guest appearance on Tales from the Crypt (1989) in the episode \"Werewolf Concerto\". In 1994, he took on the role of \"Rhett Butler\" in the eight-hour mini-series Scarlett (1994), produced by Robert Halmi Sr. for the Hallmark Hall of Fame. In April of that year, believing he needed to move on to fresh challenges, he officially resigned the role of \"James Bond\", a move which was much regretted by the producers, though they understood his reasons. After two months of negotiations, the role went to Pierce Brosnan. In September 1994, Dalton was called upon for two readings of \"Peter and the Wolf\" at the Hollywood Bowl. He played to full-capacity crowds. In November, Scarlett (1994) premiered and, though given only a lukewarm response by critics, it was a ratings success not only in the US but all over the world, breaking records in many European countries. As always after a major work, Dalton again withdrew quietly and without fanfare to search for his next project, a small, personal film. In the summer of 1995, he journeyed to Canada to shoot Salt Water Moose (1996). The film was made by Canada's Norstar Entertainment and was sold to Halmi to be the first video release in his new line of Hallmark family films. It premiered on Showtime in June 1996. During the spring of 1996, he made the IRA drama The Informant (1997) in Ireland and, in May, he traveled to Prague to shoot Passion's Way (1999), opposite Sela Ward. On February 7, 1997, the comedy The Beautician and the Beast (1997) co-starring Fran Drescher opened in the US. He also gleefully parodied his swashbuckling/James Bond image in Les Looney Tunes passent à l'action (2003) as a spy playing an actor playing a spy. In 1995, Dalton began a relationship with Oksana Grigorieva which produced a child in 1997, Dalton's son Alexander. Over the following years, Dalton has been a caring and loving father of his son. Very much a private man, Dalton's pastimes include fishing, reading, jazz, opera, antique fairs and auctions and, of course, movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5NDA1OTA4NV5BMl5BanBnXkFtZTcwMDE3NDk0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001096","name":"Timothy Dalton","nicknames":["Tim","The Daltonator","T-Dalt"],"idIMDB":"nm0001096"},"actorId":"nm0001096","character":"Mr. Pricklepants","urlCharacter":"http://www.imdb.com/character/ch0160340","main":true},{"actorName":"Lori Alan","urlProfile":"http://www.imdb.com/name/nm0015935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NDE4ODU1NF5BMl5BanBnXkFtZTgwMTMyMDQ2ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1966","placeOfBirth":" Potomac, Maryland, USA","birthName":"Lori Alan Denniberg","height":"5' 9\" (1.75 m)","bio":"Lori Alan started talking as soon as she fell out of the womb, and hasn't stopped since. A native of the Washington, DC area, her passion for entertaining led the five-year-old actress to make her television debut as the star of a Shakey's Pizza commercial. She went on to graduate with honors from NYU's Tisch School of the Arts and set off cutting her teeth on the comedy circuit, as a longtime member of New York's Gotham City Improv (Groundlings East). Lori is perhaps best known for her award-winning voice-over work. Recently honored by her peers at the First Annual Voice Arts Awards (the Academy Awards for Voice-Overs) Lori took first-place prizes for Outstanding Body Of Work and Outstanding National Television Commercial. She starred as Diane Simmons on Family Guy, Pearl the Whale on SpongeBob: Squarepants, Sue Richards, The Invisible Woman, on Marvel Comics' The Fantastic Four, and The Boss in the Metal Gear Solid video game trilogy. She's proud to be a part of the Pixar Family. Voicing characters in Wall-e, Cloudy with a Chance of Meatballs, Monster's University, Bonnie's Mom in Pixar's Toy Story 3, and Mother's Sadness in Inside Out. Lori has firm roots in theatre, where she's thrived for over three decades. She mounted a smash solo show, Lori Alan: The Musical, She had the honor of working with Paul Reubens in The Pee-wee Herman Show at Club Nokia. She originated the role of Mae in the award-winning musical Reefer Madness, the cult musical which just celebrated its 17 year reunion concert at 54 Below. Backstage West proclaimed, \"Lori Alan might give Carol Burnett pause!\" Luckily, that talent brought Lori right to the small screen. From roles on the gripping Showtime drama Ray Donovan, to the hilarious Comedy Central gem Workaholics, to the deliciously naughty Desperate Housewives. She delves deeply into her material, emerging with the power to make the audience laugh and cry in the same moment. Her television career has flourished with appearances on Bones, Southland, CSI, 90210, Grey's Anatomy, Law and Order (both LA and the original.) She now has a thriving voice over/on camera coaching practice to give back, as so many mentors did for her. Lori lives in Los Angeles with the love of her life, Sir Philip Bumble, her 4-legged, \"soulmate\" Bichon-Lhasas Apso mix, who was covered in gasoline when she rescued him at a mobile station. In the true spirit of activism, one of Lori's sole purposes is to fight for the end of the dog meat trade in the U.S. and Asia by raising awareness of the brutal and illegal trafficking of dogs. Lori also sits on the board of Pickle Pants Dog Rescue in Los Angeles, which focuses on rescuing, rehabing, and re-homing animals otherwise set for death row from high kill shelters. Lori is a celebrity supporter of the Farm Animal Rights Movement (FARM) a national nonprofit organization working to end the use of animals for food through public education and grassroots activism. Her other hobbies include singing in the shower- or anywhere for that matter-, discovering new gluten-free cookies, and trying to switch to decaf. Despite having no kids, she is a MILF.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NDE4ODU1NF5BMl5BanBnXkFtZTgwMTMyMDQ2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015935","name":"Lori Alan","idIMDB":"nm0015935"},"actorId":"nm0015935","character":"Bonnie's Mom","urlCharacter":"http://www.imdb.com/character/ch0208112","main":true},{"actorName":"Joan Cusack","urlProfile":"http://www.imdb.com/name/nm0000349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTAxMjQzMV5BMl5BanBnXkFtZTYwMzU1OTE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1962","placeOfBirth":" New York City, New York, USA","birthName":"Joan Mary Cusack","height":"5' 9\" (1.75 m)","bio":"Actress Joan Cusack was born in New York City, New York, and is the daughter of Nancy (née Carolan) and Dick Cusack. Her father was an advertising executive, writer and actor, and her mother was a math teacher. Her siblings - Susie Cusack, John Cusack, Ann Cusack and Bill Cusack also act. Her family is of Irish descent. Raised in Illinois, Cusack was actively encouraged to explore her creativity by her parents, and as a child she joined the Piven Theater Workshop. She went on to learn and perform improvisation at the Story Theater and The Ark. Later she attended the University of Wisconsin-Madison, graduating with a bachelor's degree in English. Whilst at university, Cusack took some small film roles, but her big break came after graduation, when she joined the cast of the legendary \"Saturday Night Live\". However, she only stayed for a season before moving on to explore other projects. In 1987, she produced a memorable turn in the acclaimed Broadcast News (1987), and she was Oscar nominated for her performance in Working Girl (1988). Other notable films include Addams Family Values (1993), Grosse Pointe Blank (1997) and In & Out (1997), which earned her a second Oscar nomination. She also provided, superbly, the voice of Jessie the Yodeling Cowgirl in Toy Story 2 (1999) and Toy Story 3 (2010). On television she scored a role on \"Shameless\", with her work garnering her an Emmy nomination. Joan Cusack is married to an attorney, Dick Burke. They have two sons - Dylan and Miles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTAxMjQzMV5BMl5BanBnXkFtZTYwMzU1OTE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000349","name":"Joan Cusack","idIMDB":"nm0000349"},"actorId":"nm0000349","character":"Jessie","urlCharacter":"http://www.imdb.com/character/ch0075388","main":true},{"actorName":"Emma Hudak","urlProfile":"http://www.imdb.com/name/nm6952746","urlPhoto":"","biography":{"bio":"Emma Hudak is an actress, known for Inside Out (2015) and Toy Story That Time Forgot (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6952746","name":"Emma Hudak","idIMDB":"nm6952746"},"actorId":"nm6952746","character":"Angel Kitty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Bottitta","urlProfile":"http://www.imdb.com/name/nm1714720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NTE1NDc0M15BMl5BanBnXkFtZTcwMDYzNzQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1960","placeOfBirth":" London, England, UK","height":"5' 10\" (1.78 m)","bio":"Ron is the second most famous actor to come from Claygate, England. The most famous is still currently Terry Jones, and third place is still held by a beagle named \"Toby\" that had a recurring on a BBC sit-com called To the Manor Born (1979) in the '70s. He moved to the U.S. in 1979 to avoid conviction on a string of unjustified speeding tickets, and to study History at U.C. Berkeley. Reluctant to start repaying student loans, he leaped at the opportunity to go to the M.F.A. Acting program at N.Y.U., spending three precious years of his life with such neurotic geniuses as Rob LaBelle, Augusta Allen-Jones, Marcia Gay Harden, Bill Mondy, Ami Brabson, Teagle F. Bougere, and Eliza Foss. He has appeared in over 100 plays Off-Broadway, regionally, in converted Circle K stores, and in Los Angeles, playing an assortment of characters from Nazis to lyrical guys in doublets, IRA rebels, pompous hotel detectives, cowboy politicians and lots of guys with anger issues or terminal illnesses. In 2006 he portrayed Anton Chekhov in \"Chekhov and Maria\" at the Odyssey Theatre in Los Angeles, in a production that moved to the Barrow Group Theatre in NYC in July of 2006. The New York Times called Ron's performance \"outstanding and complex\" and he agreed. In November Chekhov and Maria (2007), starring Ron and Gillian Brashear made it onto film, directed by the legendary Eric Till, for a spring 2008 release. It finally made it to PBS in March of 2012, after showing on TV in several European countries, and making its way around the festival circuit, winning award after award, though astonishingly and possibly because of widescale corruption in the judging process, none for his acting. In 2008 he joined L.A.'s Rogue Machine Theatre to play the sympathetic and psychopathic killer \"Leftie\" in the world premiere of \"Razorback\", by John Pollono, a performance the L.A Times, for a very nominal fee, called \"vivid and intriguing\", Variety called \"compelling\" after only a few threatening phone calls, and the L.A. Weekly critic hailed as \"terrific\" and \"very rich\", after less than a week as a guest in Ron's windowless basement. He was again spotted at Rogue Machine in 2009 as the \"charismatically creepy\" Hector Zook in the West Coast premiere of Lisa Dillman's \"Half of Plenty\", and in 2010 at The Odyssey Theatre as the \"psychotic\" and \"ghoulish\" waiter Eisenring in the critically acclaimed revival of \"The Arsonists\" by Max Frisch. Ron returned to Rogue Machine at the end of 2010 to appear in 6 months of sold-out performances of Cormac McCarthy's \"The Sunset Limited\", with Tucker Smallwood, in a production nominated for \"Best Two-Person Play\" by The L.A. Weekly. You may have been one of the 25,000 people that saw him last summer as Russian entrepreneur Max Tarasov, at The Geffen Playhouse, in the West Coast premiere of Tracy Letts' \"Superior Donuts\", alongside Gary Cole and Edi Gathegi. One print reviewer said that he was \"so good, and so different from his character in \"The Sunset Limited\", another noted that he \"only recognized him on the way home after reading his bio in the programme - what greater praise for an actor?\", one called him \"brusque\", another \"irrepressible\", and yet another compared him to \"an unwanted disease\". Praise indeed. Since then he's played a penguin in the world premiere of Henry Murray's Ovation Award-nominated \"Monkey Adored\" at Rogue, Carr Gomm in Pomerance's \"The Elephant Man\" at L.A.'s Theater 68, and as various characters in The Odyssey's LA Weekly Award nominated \"Theatre in the Dark\". Ron continued at The Odyssey as \"Jackie Farrell\", the vice-lord with a heart of stone, in the American Premiere of \"Rank\" and continued to shill for corporations by appearing as a London cabbie in an NBA/Cisco spot, as \"Farnsworth\" the highly motivated chauffer in the \"Lost Footage\" Grey Poupon commercial, and as a reluctant golfer through the ages, in a Nike golf ball ad. And yes, he is that guy in the Geico \"medieval torture chamber\" commercial. He was last seen on stage in \"The Unexpected Man\" at the Two Roads Theater with the lovely Sasha Higgins and prior to that, wearing speedos in Enda Walsh's \"Penelope\" at Rogue Machine, directed once again by John Perrin Flynn. Next up is Greg Kalleres \"Honky\", directed by Gregg Daniel at Rogue Machine, also starring Burl Moseley, Inger Tudor, Bruce Nozick, Tasha Ames, James Liebman, Matthew Hancock, and Christian Henley. He's the regular host of Rogue Machine Theatre's monthly spoken-word series: \"Rant and Rave\", now in its eighth year. Ron's been riding motorcycles since 1975 (legally since 1977), has clocked over a million miles, has been a BMWMOA member since 1984, and is a proud member of the Iron Butt Association, having once ridden his R1100RT from L.A. to Seattle in 17 rain-soaked hours. He's also a pilot working extremely methodically on his instrument rating. He owns and operates Canyon Flyer Inc., a motorcycle messenger service in Los Angeles. Somehow he's made the time to spawn two smart-alecky kids, Danny (boy, b. 1995) and Sasha (girl, b. 1997), both of whom mean nearly as much to him as his career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NTE1NDc0M15BMl5BanBnXkFtZTcwMDYzNzQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1714720","name":"Ron Bottitta","idIMDB":"nm1714720"},"actorId":"nm1714720","character":"Mason's Dad","urlCharacter":"http://www.imdb.com/character/ch0475694","main":true}],"seasons":[],"idIMDB":"tt3473654","urlIMDB":"http://www.imdb.com/title/tt3473654","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["22 min"],"soundMix":null,"color":["Color"],"aspectRatio":["1.75 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["HDTV","Video"]},"rating":"7.2","filmingLocations":[],"rated":"TV-G","awards":[{"award":"Annie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Animated Special Production","names":[]},{"category":"Outstanding Achievement in Character Animation in an Animated TV/Broadcast Production","names":[{"name":"Don Crum","id":"nm2041298","role":null}]},{"category":"Outstanding Achievement in Character Animation in an Animated TV/Broadcast Production","names":[{"name":"Carlo Vogele","id":"nm4755605","role":null}]},{"category":"Outstanding Achievement in Character Animation in an Animated TV/Broadcast Production","names":[{"name":"Ken Kim","id":"nm2856647","role":null}]},{"category":"Outstanding Achievement in Storyboarding in an Animated TV/Broadcast Production","names":[{"name":"Louise Smythe","id":"nm6950542","role":null}]},{"category":"Outstanding Achievement in Writing in an Animated TV/Broadcast Production","names":[{"name":"Steve Purcell","id":"nm0700760","role":null}]},{"category":"Outstanding Achievement in Editorial in an Animated TV/Broadcast Production","names":[{"name":"David Suther","id":"nm1103655","role":null},{"name":"Bradley Furnish","id":"nm2689816","role":null},{"name":"David Condolora","id":"nm3516524","role":null}]}]}]},{"award":"PGA Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated PGA Award","categories":[{"category":"Outstanding Children's Program","names":[]}]}]}],"votes":"6,135","type":"Movie","companyCreditsSimple":[{"idCompany":"co0030830","name":"Disney Television Animation"},{"idCompany":"co0017902","name":"Pixar Animation Studios"}],"keywords":{"keywords":["toy","christmas","cgi animation","chase","mortal danger","shaman","triceratops","fighter","army","discovery","secret","trumpet","deception","video game console","remote control","metal claws","swallowed whole","self referential","arena","dinosaur"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 06:31:33"}}