{"data":{"movies":[{"title":"Ice Age: Collision Course","originalTitle":"","year":"2016","releaseDate":"20160722","directors":[{"name":"Mike Thurmeier","id":"nm0862211"},{"name":"Galen T. Chu","id":"nm1154886"}],"writers":[{"name":"Michael J. Wilson","id":"nm5022110"},{"name":"Michael Berg","id":"nm0073850"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTk2ODc1OV5BMl5BanBnXkFtZTgwMzU4MzgzOTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Adventure","Comedy","Family","Sci-Fi"],"plot":"Scrat's epic pursuit of his elusive acorn catapults him outside of Earth, where he accidentally sets off a series of cosmic events that transform and threaten the planet. To save themselves from peril, Manny, Sid, Diego, and the rest of the herd leave their home and embark on a quest full of thrills and spills, highs and lows, laughter and adventure while traveling to exotic new lands and encountering a host of colorful new characters.","simplePlot":"Manny, Diego, and Sid join up with Buck to fend off a meteor strike that would destroy the world.","actors":[{"actorName":"Stephanie Beatriz","urlProfile":"http://www.imdb.com/name/nm3715867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyNTY0OTM1Nl5BMl5BanBnXkFtZTgwNTYzMzQ5NjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Stephanie Beatriz Bischoff Alvizuri","height":"5' 6\" (1.68 m)","bio":"Stephanie Beatriz was born as Stephanie Beatriz Bischoff Alvizuri. She is an actress and producer, known for Brooklyn Nine-Nine (2013), Ice Age: Collision Course (2016) and Short Term 12 (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyNTY0OTM1Nl5BMl5BanBnXkFtZTgwNTYzMzQ5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3715867","name":"Stephanie Beatriz","nicknames":["Steph"],"idIMDB":"nm3715867"},"actorId":"nm3715867","character":"Gertie","urlCharacter":"http://www.imdb.com/character/ch0525449","main":true},{"actorName":"Robert Cardone","urlProfile":"http://www.imdb.com/name/nm1103266","urlPhoto":"","biography":{"bio":"Robert Cardone is known for his work on Ice Age: The Meltdown (2006), Tarzan (1999) and Hercules (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1103266","name":"Robert Cardone","idIMDB":"nm1103266"},"actorId":"nm1103266","character":"Freaky Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil deGrasse Tyson","urlProfile":"http://www.imdb.com/name/nm1183205","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzE4NTM4M15BMl5BanBnXkFtZTcwODgzMjE1OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1958","placeOfBirth":" New York City, New York, USA","birthName":"Neil de Grasse Tyson","height":"6' 2\" (1.88 m)","bio":"Neil deGrasse Tyson is an American astrophysicist, cosmologist, author, and science communicator. Born and raised in New York City, Tyson became interested in astronomy at the age of nine after a visit to the Hayden Planetarium. After graduating from the Bronx High School of Science, where he was editor-in-chief of the Physical Science Journal, he completed a bachelor's degree in physics at Harvard University in 1980. After receiving a master's degree in astronomy at the University of Texas at Austin in 1983, he earned his master's (1989) and doctorate (1991) in astrophysics at Columbia University. For the next three years, he was a postdoctoral research associate at Princeton University. In 1994 he joined the Hayden Planetarium as a staff scientist and the Princeton faculty as a visiting research scientist and lecturer. In 1996, he became director of the planetarium and oversaw its $210-million reconstruction project, which was completed in 2000. From 1995 to 2005, Tyson wrote monthly essays in the \"Universe\" column for Natural History magazine, some of which were published in his book Death by Black Hole (2007). During the same period, he wrote a monthly column in Star Date magazine, answering questions about the universe under the pen name \"Merlin\". Material from the column appeared in his books Merlin's Tour of the Universe (1998) and Just Visiting This Planet (1998). Tyson served on a 2001 government commission on the future of the U.S. aerospace industry, and on the 2004 Moon, Mars and Beyond commission. He was awarded the NASA Distinguished Public Service Medal in the same year. In 2014, he hosted the television series Cosmos: A Spacetime Odyssey, a successor to Carl Sagan's 1980 series Cosmos: A Personal Voyage. As a science communicator, Tyson regularly appears on television, radio, and various other media outlets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzE4NTM4M15BMl5BanBnXkFtZTcwODgzMjE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1183205","name":"Neil deGrasse Tyson","idIMDB":"nm1183205"},"actorId":"nm1183205","character":"Neil deBuck Weasel","urlCharacter":"http://www.imdb.com/character/ch0525450","main":true},{"actorName":"Adam Devine","urlProfile":"http://www.imdb.com/name/nm2796745","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzI2NTc5NF5BMl5BanBnXkFtZTgwMzkzNTY4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1983","placeOfBirth":" Waterloo, Iowa, USA","birthName":"Adam Patrick DeVine","height":"5' 8\" (1.73 m)","bio":"Adam Devine was born on November 7, 1983 in Waterloo, Iowa, USA as Adam Patrick DeVine. He is an actor and writer, known for Mike and Dave Need Wedding Dates (2016), The Intern (2015) and Pitch Perfect 2 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzI2NTc5NF5BMl5BanBnXkFtZTgwMzkzNTY4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2796745","name":"Adam Devine","idIMDB":"nm2796745"},"actorId":"nm2796745","character":"Julian","urlCharacter":"http://www.imdb.com/character/ch0526896","main":true},{"actorName":"Jesse Tyler Ferguson","urlProfile":"http://www.imdb.com/name/nm0272479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODUyNDMwNF5BMl5BanBnXkFtZTgwNjQ1OTE2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1975","placeOfBirth":" Missoula, Montana, USA","height":"5' 10\" (1.78 m)","bio":"Jesse Tyler Ferguson was born on October 22, 1975 in Missoula, Montana, USA. He is an actor, known for Modern Family (2009), Ice Age: Collision Course (2016) and Untraceable (2008). He has been married to Justin Mikita since July 20, 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODUyNDMwNF5BMl5BanBnXkFtZTgwNjQ1OTE2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272479","name":"Jesse Tyler Ferguson","idIMDB":"nm0272479"},"actorId":"nm0272479","character":"Shangri Llama","urlCharacter":"http://www.imdb.com/character/ch0526900","main":true},{"actorName":"Max Greenfield","urlProfile":"http://www.imdb.com/name/nm0339011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjQxMzQyM15BMl5BanBnXkFtZTgwMzUxMjE3MTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1980","placeOfBirth":" Dobbs Ferry, New York, USA","height":"5' 9\" (1.75 m)","bio":"Max Greenfield was born on September 4, 1980 in Dobbs Ferry, New York, USA. He is an actor, known for New Girl (2011), The Big Short (2015) and Ice Age: Collision Course (2016). He has been married to Tess Sanchez since 2008. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjQxMzQyM15BMl5BanBnXkFtZTgwMzUxMjE3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339011","name":"Max Greenfield","idIMDB":"nm0339011"},"actorId":"nm0339011","character":"Roger","urlCharacter":"http://www.imdb.com/character/ch0526898","main":true},{"actorName":"Jessie J","urlProfile":"http://www.imdb.com/name/nm3697476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjI4MjAwMF5BMl5BanBnXkFtZTcwMjU1ODc0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1988","placeOfBirth":" Chadwell Heath, Essex, England, UK","birthName":"Jessica Ellen Cornish","height":"5' 9\" (1.75 m)","bio":"Jessie J was born on March 27, 1988 in Chadwell Heath, Essex, England as Jessica Ellen Cornish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjI4MjAwMF5BMl5BanBnXkFtZTcwMjU1ODc0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3697476","name":"Jessie J","idIMDB":"nm3697476"},"actorId":"nm3697476","character":"Brooke","urlCharacter":"http://www.imdb.com/character/ch0526899","main":true},{"actorName":"Queen Latifah","urlProfile":"http://www.imdb.com/name/nm0001451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjkxNzkyMF5BMl5BanBnXkFtZTcwNTQ1MTMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1970","placeOfBirth":" Newark, New Jersey, USA","birthName":"Dana Elaine Owens","height":"5' 10\" (1.78 m)","bio":"Often considered hip-hop's first lady (though some would attribute that to Roxanne Shanté), the woman behind the moniker Queen Latifah was born Dana Owens on March 18th, 1970, in East Orange, New Jersey. She is the daughter of Rita (Bray), a teacher, and Lancelot Owens, Sr. She came from a police family--both her father and older brother were cops, which would later influence her rhyming style and life philosophy. Owens witnessed both sides of Black urban life in the USA while growing up. After a brief stint as a Burger King employee, she soon found herself making waves in the hip-hop music scene. After working as the human beat box alongside Ladies Fresh, she was just 18 years old when she originally broke through in the late 1980s with a style that picked selectively from jazz, reggae, and soul traditions, from beats produced by 'D.J. Mark the 45 King'. Her debut single, \"Wrath of My Madness,\" was released in 1988. A year later, her debut long-player, \"All Hail the Queen,\" enjoyed favored reviews: an old, wise head was evident on the top of her young shoulders. The former Burger King employee maintained her early commitment to answer the misogynist armory of some of her male counterparts and, at the same time, imparted musical good times to all genders. Her name means \"delicate and sensitive\" in Arabic, but she has often been anything but in her rhymes and the messages she sends out through them. One of the most prominent female hip-hop artists on the scene for over a decade, Queen Latifah has also made tremendous inroads in movies, television, and artist management, with her management company, Flavor Unit, alongside her business partner Shakim Compere. A role model who takes the responsibility to heart, Latifah carefully constructed a fine career for herself--one that is constantly moving upward.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjkxNzkyMF5BMl5BanBnXkFtZTcwNTQ1MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001451","name":"Queen Latifah","nicknames":["Hip-Hop's First Lady"],"idIMDB":"nm0001451"},"actorId":"nm0001451","character":"Ellie","urlCharacter":"http://www.imdb.com/character/ch0004521","main":true},{"actorName":"Denis Leary","urlProfile":"http://www.imdb.com/name/nm0001459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzM4NTA5OV5BMl5BanBnXkFtZTcwMTAxNjA3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1957","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Denis Colin Leary","height":"6' 2\" (1.88 m)","bio":"Denis Leary was born and raised in Worcester, Massachusetts, the son of Nora (Sullivan) and John Leary, Irish immigrants who had grown up together. His mother was a maid and his father was an auto mechanic. After a childhood in the 1960s, Leary went to Emerson College in Boston, where he tried his hand at acting and writing. He was a charter member of Emerson's Comedy Workshop, and taught at the college for five years after graduating. By that point, he had written several pieces for magazines and had worked at stand-up comedy for a time. In 1990, he and his wife, Ann Lembeck, flew to London to perform in the BBC's Paramount City. That weekend, Ann's water broke. Their planned weekend trip became a stay of months, and Denis, with not a whole lot to do in London, wrote a one-man comedy act. He brought friends in from the States, and they wrote songs to perform on stage. Leary, with Chris Phillips and Adam Roth on guitar, performed \"No Cure For Cancer\" at the Edinburgh International Arts Festival in Scotland. Despite some protests about the title, the show won the Critic's Award and the BBC Festival Recommendation. The next year, the show was moved to America, and it was eventually taped and broadcast on Showtime (Denis Leary: No Cure for Cancer (1992)). The show spawned a book, CD, cassette, and a videotape. It also started Leary's movie career. Since then, he has starred in several films and has had two of his own TV series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzM4NTA5OV5BMl5BanBnXkFtZTcwMTAxNjA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001459","name":"Denis Leary","idIMDB":"nm0001459"},"actorId":"nm0001459","character":"Diego","urlCharacter":"http://www.imdb.com/character/ch0004524","main":true},{"actorName":"John Leguizamo","urlProfile":"http://www.imdb.com/name/nm0000491","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1964","placeOfBirth":" Bogotá, Colombia","birthName":"John Alberto Leguizamo","height":"5' 7\" (1.7 m)","bio":"Fast-talking and feisty-looking John Leguizamo has continued to impress movie audiences with his versatility: he can play sensitive and naive young men, such as Johnny in Hangin' with the Homeboys (1991); cold-blooded killers like Benny Blanco in Carlito's Way (1993); a heroic Army Green Beret, stopping aerial terrorists in Executive Decision (1996); and drag queen Chi-Chi Rodriguez in To Wong Foo Thanks for Everything, Julie Newmar (1995). Arguably, not since ill-fated actor and comedian Freddie Prinze starred in the smash TV series Chico and the Man (1974) has a youthful Latino personality had such a powerful impact on critics and fans alike. Leguizamo was born July 22, 1964, in Bogotá, Colombia, to Luz and Alberto Leguizamo. He was four when his family emigrated to the United States. He was raised in Queens, New York, attended New York University and studied under legendary acting coach Lee Strasberg for only one day before Strasberg passed away. The extroverted Leguizamo started working the comedy club circuit in New York and first appeared in front of the cameras in an episode of Miami Vice (1984). His first film appearance was a small part in Cocaïne (1984), and he had minor roles in Casualties of War (1989) and Die Hard 2 (1990) before playing a liquor store thief who shoots Harrison Ford in Regarding Henry (1991). His career really started to soar after his first-rate performance in the independent film Hangin' with the Homeboys (1991) as a nervous young teenager from the Bronx out for a night in brightly lit Manhattan with his buddies, facing the career choice of staying in a supermarket or heading off to college and finding out that the girl he loves from afar isn't quite what he thought she was. The year 1991 was also memorable for other reasons, as he hit the stage with his show Mambo Mouth (1991), in which he portrayed seven different Latino characters. The witty and incisive show was a smash hit and won the Obie and Outer Circle Critics Award, and later was filmed for HBO, where it picked up a CableACE Award. He returned to the stage two years later with another satirical production poking fun at Latino stereotypes titled John Leguizamo: Spic-O-Rama (1993). It played in Chicago and New York, and won the Drama Desk Award and four CableACE Awards. In 1995 he created and starred in the short-lived TV series House of Buggin' (1995), an all-Latino-cast comedy variety show featuring hilarious sketches and comedic routines. The show scored two Emmy nominations and received positive reviews from critics, but it was canceled after only one season. The gifted Leguizamo was still keeping busy in films, with key appearances in Super Mario Bros. (1993), Romeo + Juliet (1996) and Spawn (1997). In 1998 he made his Broadway debut in John Leguizamo: Freak (1998), a \"demi-semi-quasi-pseudo-autobiographical\" one-man show, which was filmed for HBO by Spike Lee. Utilizing his distinctive vocal talents, he next voiced a pesky rat in Doctor Dolittle (1998) before appearing in the dynamic Spike Lee-directed Summer of Sam (1999) as a guilt-ridden womanizer, as the Genie of The Lamp in the exciting Arabian Nights (2000) and as Henri DE Toulouse Lautrec in the visually spectacular Moulin Rouge (2001). He also voiced Sid in the animated Ice Age (2002), co-starred alongside Arnold Schwarzenegger in Collateral Damage (2002) and directed and starred in the boxing film Undefeated (2003). Afterward, Leguizamo starred in the remake of the John Carpenter hit Assaut sur le central 13 (2005) and George A. Romero's long-awaited fourth \"Dead\" film, Land of the Dead - Le territoire des morts (2005). There can be no doubt that the remarkably talented Leguizamo has been a breakthrough performer for the Latino community in mainstream Hollywood, in much the same way that Sidney Poitier crashed through celluloid barriers for African-Americans in the early 1960s. Among his many strengths lies his ability to not take his ethnic background too seriously but also to take pride in his Latino heritage. He has opened many doors for his countrymen. A masterly and accomplished performer, movie audiences await Leguizamo's next exciting performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000491","name":"John Leguizamo","nicknames":["Johnny Legs","John Leguizama"],"idIMDB":"nm0000491"},"actorId":"nm0000491","character":"Sid","urlCharacter":"http://www.imdb.com/character/ch0004523","main":true},{"actorName":"Jennifer Lopez","urlProfile":"http://www.imdb.com/name/nm0000182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTY3ODA3OV5BMl5BanBnXkFtZTcwMzMyMzQ1NQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1969","placeOfBirth":" The Bronx, New York, USA","birthName":"Jennifer Lynn Lopez","height":"5' 6\" (1.68 m)","bio":"Jennifer Lynn Lopez was born in the Castle Hill section of the South Bronx on July 24, 1969. She is the middle of three musically-inclined sisters, Leslie Lopez, a homemaker, and Lynda Lopez, a DJ on New York's WKTU, a VH1 VJ, and a morning news show correspondent on New York's Channel 11. Jennifer always dreamed of being a multi-tasking superstar. Jennifer's parents, Guadalupe Rodriguez and David Lopez, were both born in Ponce, Puerto Rico, the second largest Puerto Rican city. The two were then brought to the continental United States during their childhoods and, eventually, met while living in New York City. As a child, Jennifer enjoyed a variety of musical genres, mainly Afro-Caribbean rhythms like salsa, merengue and bachata, and mainstream music like pop, hip-hop and R&B. Although she loved music, the film industry also intrigued her. Her biggest influence was the Rita Moreno musical, West Side Story (1961). At age five, Jennifer began taking singing and dancing lessons. Aside from being a budding entertainer, Jennifer was also a Catholic schoolgirl, attending eight years at an all-girls catholic high school named \"Holy Family\", located in the Bronx, before graduating from Preston High School after a four-year stay. At school, Jennifer was an amazing athlete and participated in track and field and tennis. At age eighteen, Lopez moved out of her parent's home. During this time, Lopez worked at a law firm while she took dancing jobs at night. After high school, she briefly worked in a law office. During this time, she continued dance classes at night. At 18, she left home because her mother was scared by her decision to pursue show business. Her big break came when she was offered a job as a fly girl on Fox's hit comedy, In Living Color (1990). After a two-year stay at In Living Color (1990) where actress Rosie Perez served as choreographer, Lopez then went on to dance for famed singer-actress Janet Jackson. Her first major film was Gregory Nava's My Family (1995), and her career went into over-drive when she portrayed slain Tejana singer Selena Quintanilla Perez in Selena (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTY3ODA3OV5BMl5BanBnXkFtZTcwMzMyMzQ1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000182","name":"Jennifer Lopez","nicknames":["J. Lo","La Lopez","Lola","Jenny from the Block"],"idIMDB":"nm0000182"},"actorId":"nm0000182","character":"Shira","urlCharacter":"http://www.imdb.com/character/ch0263474","main":true},{"actorName":"Jorge Lucas","urlProfile":"http://www.imdb.com/name/nm8200710","urlPhoto":"","biography":{"bio":"Jorge Lucas is known for his work on Ice Age: Collision Course (2016), Rio 2 (2014) and The Peanuts Movie (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8200710","name":"Jorge Lucas","idIMDB":"nm8200710"},"actorId":"nm8200710","character":"Grandpa Molehog","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Christopher Nichols","urlProfile":"http://www.imdb.com/name/nm8285160","urlPhoto":"","biography":{"bio":"Andrew Christopher Nichols is an actor, known for Ice Age: Collision Course (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8285160","name":"Andrew Christopher Nichols","idIMDB":"nm8285160"},"actorId":"nm8285160","character":"Andrew Aardvark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Offerman","urlProfile":"http://www.imdb.com/name/nm0644406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY2ODkxMV5BMl5BanBnXkFtZTgwMjQxMDA5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1970","placeOfBirth":" Joliet, Illinois, USA","height":"5' 11\" (1.8 m)","bio":"Nick Offerman was born on June 26, 1970 in Joliet, Illinois, USA. He is an actor and producer, known for Parks and Recreation (2009), The Founder (2016) and Fargo (2014). He has been married to Megan Mullally since September 20, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjY2ODkxMV5BMl5BanBnXkFtZTgwMjQxMDA5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0644406","name":"Nick Offerman","idIMDB":"nm0644406"},"actorId":"nm0644406","character":"Gavin","urlCharacter":"http://www.imdb.com/character/ch0538683","main":true},{"actorName":"Keke Palmer","urlProfile":"http://www.imdb.com/name/nm1551130","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWNhZDE1ZjAtMjZiNC00ZDJjLTkzYzktNTdkM2M4Yjk4OTRiL2ltYWdlXkEyXkFqcGdeQXVyMTMxMTU5NTU@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1993","placeOfBirth":" Harvey, Illinois, USA","birthName":"Lauren Keyana Palmer","height":"5' 6\" (1.68 m)","bio":"Keke Palmer was born Lauren Keyana Palmer in Robbins, Illinois--a small town 20 miles south of Chicago-- to Sharon and Larry Palmer, both former actors. Palmer showed vocal promise as a five-year-old, when she belted out \"Jesus Loves Me\" in her church choir. A year later the singer-actress had a solo in her kindergarten play but, to her mom's dismay, the mike had not been adjusted to suit her daughter's height. Without missing a beat, Palmer lowered the mike and moved the crowd with her heavenly voice. At that very moment, her family knew there was something special about Keke (a nickname given to her by her sister). Although music was still her passion, Palmer's first big break came via her acting skills, making her big-screen debut in Barbershop 2: Back in Business (2004) as Queen Latifah's niece. Immediately recognizing her star potential, the film's producers encouraged her parents to take their daughter to California to explore other acting opportunities. Relocating required that Palmer's parents leave behind the security of their jobs, a newly purchased home and uproot their other three children. However, it didn't diminish the family's support of Palmer's aspirations. Once settled on the West Coast, Palmer did not waste any time. Within six weeks she had booked an episode of the critically acclaimed CBS series Cold Case (2003), a national K-Mart commercial and was chosen from a nationwide search to play opposite William H. Macy in a TNT movie, The Wool Cap (2004). Her performance was so amazing that it earned her a Screen Actors Guild nomination--to date, she is the youngest actress (then at age ten) ever to receive a nomination in a Lead Actress Category. In 2006 Palmer appeared as the lead character \"Akeelah Anderson\" in the critically acclaimed, award-winning film Akeelah and the Bee (2006). The film, about a young South Los Angeles girl who attempts to win a national spelling bee, won the hearts of audiences everywhere. Her breakthrough performance has received praise from many film critics and organizations. Among the list of nominations received, \"Akeelah and the Bee\" was listed as one of NBR's 2006 Top Independent Films of the Year, as well as four nominations from the NAACP Image Awards. Palmer, alone, won an NAACP Image Award for Outstanding Lead Actress in a Motion Picture, as well as Outstanding Lead Actress in a Motion Picture by the Black Movie Awards. She has also received nominations for Most Promising Newcomer by the Chicago Film Critics, Best Actress by the Black Reel Awards, and Best Young Actress by the Broadcast Film Critics Association. Keke held her own in scenes with veteran co-stars Angela Bassett and Laurence Fishburne. That very same year, Palmer appeared in Tyler Perry's Madea's Family Reunion (2006), which was #1 at the box office for two consecutive weeks. Palmer went on to win a 2007 NAACP Image Award for Outstanding Actress in a Motion Picture for her breakout role in \"Akeelah and the Bee\". She also received a ShoWest Award for Rising Star of the Year. Shortly after, Palmer lit up the small screen starring in the Disney Channel's hit movie, Jump In! (2007). This one-two punch of big-screen success coupled with small screen ratings power made Keke Palmer a household name in Hollywood. Palmer contributed her first recording, which was featured on the \"Akeelah and the Bee\" soundtrack, titled \"All My Girlz\", and followed it up with the ever popular \"My Turn Now\" on the \"Jump In!\" soundtrack. As if two soundtracks were not enough, she was also asked to sing \"Tonight\", an end title song from the smash-hit Ben Stiller movie, Night at the Museum (2006). Her Atlantic Records debut album, \"So Uncool\", is jammed with up-tempo R&B tracks, inspirational moments, and love songs. In 2008, Palmer starred in the Weinstein Co. feature, The Longshots (2008). The film was based on the true story of a young female quarterback, played by Palmer, that makes Pop Warner history; she starred opposite Ice Cube, for first time director and Limp Bizkit front man, Fred Durst. Palmer also starred as the title character in the hit Nickelodeon series, True Jackson, VP (2008), for 68 episodes, she played a high-school student who becomes the head of a major fashion label. In the fall of 2008, \"True Jackson\" bowed with over 4.8 million viewers, setting a record for Nickelodeon's largest audience for a live-action premiere. She has received four NAACP Awards for Best Actress in Children's Television for her role as \"True Jackson\". Keke starred in the movie, 23 ans d'absence (2012), for the Lifetime Network. She had a voice role in the 20th Century Fox animated film, Ice Age: Continental Drift (2012), as the character \"Peaches\". Her co-stars include Ray Romano, John Leguizamo, Denis Leary, Jennifer Lopez and Queen Latifah. Palmer was seen on the big screen in the Alcon/Warner Bros movie, Joyful Noise (2012), singing alongside legendary Queen Latifah and Dolly Parton, however, it was Palmer who the critics singled out for her \"young and inspiring\" rendition of the Michael Jackson song, \"Man in the Mirror\". Palmer resides in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWNhZDE1ZjAtMjZiNC00ZDJjLTkzYzktNTdkM2M4Yjk4OTRiL2ltYWdlXkEyXkFqcGdeQXVyMTMxMTU5NTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1551130","name":"Keke Palmer","idIMDB":"nm1551130"},"actorId":"nm1551130","character":"Peaches","urlCharacter":"http://www.imdb.com/character/ch0273496","main":true}],"seasons":[],"idIMDB":"tt3416828","urlIMDB":"http://www.imdb.com/title/tt3416828","business":{"budget":{"money":"$105,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$21,373,064","country":"USA","day":"24","month":"07","year":"2016","remarks":"3,992 Screens"},{"money":"€1,846,816","country":"Italy","day":"28","month":"08","year":"2016","remarks":"758 Screens"}],"gross":[{"money":"$64,060,187","country":"USA","day":"30","month":"10","year":"2016","remarks":""},{"money":"$64,045,593","country":"USA","day":"23","month":"10","year":"2016","remarks":""},{"money":"$64,013,090","country":"USA","day":"16","month":"10","year":"2016","remarks":""},{"money":"$63,942,653","country":"USA","day":"09","month":"10","year":"2016","remarks":""},{"money":"$63,839,122","country":"USA","day":"02","month":"10","year":"2016","remarks":""},{"money":"$63,685,040","country":"USA","day":"25","month":"09","year":"2016","remarks":""},{"money":"$63,171,684","country":"USA","day":"11","month":"09","year":"2016","remarks":""},{"money":"$61,717,141","country":"USA","day":"28","month":"08","year":"2016","remarks":""},{"money":"$56,673,271","country":"USA","day":"11","month":"08","year":"2016","remarks":""},{"money":"$55,994,212","country":"USA","day":"10","month":"08","year":"2016","remarks":""},{"money":"$55,211,932","country":"USA","day":"09","month":"08","year":"2016","remarks":""},{"money":"$54,223,256","country":"USA","day":"08","month":"08","year":"2016","remarks":""},{"money":"$53,564,891","country":"USA","day":"07","month":"08","year":"2016","remarks":""},{"money":"$50,439,797","country":"USA","day":"05","month":"08","year":"2016","remarks":""},{"money":"$49,239,797","country":"USA","day":"04","month":"08","year":"2016","remarks":""},{"money":"$47,938,512","country":"USA","day":"03","month":"08","year":"2016","remarks":""},{"money":"$46,442,554","country":"USA","day":"02","month":"08","year":"2016","remarks":""},{"money":"$44,190,749","country":"USA","day":"01","month":"08","year":"2016","remarks":""},{"money":"$42,598,462","country":"USA","day":"31","month":"07","year":"2016","remarks":""},{"money":"$21,373,064","country":"USA","day":"24","month":"07","year":"2016","remarks":""},{"money":"$292,791,062","country":"Worldwide","day":"11","month":"08","year":"2016","remarks":""},{"money":"$290,601,681","country":"Worldwide","day":"10","month":"08","year":"2016","remarks":""},{"money":"$289,819,401","country":"Worldwide","day":"09","month":"08","year":"2016","remarks":""},{"money":"$288,830,725","country":"Worldwide","day":"08","month":"08","year":"2016","remarks":""},{"money":"$288,172,360","country":"Worldwide","day":"07","month":"08","year":"2016","remarks":""},{"money":"$266,861,100","country":"Worldwide","day":"05","month":"08","year":"2016","remarks":""},{"money":"$265,661,100","country":"Worldwide","day":"04","month":"08","year":"2016","remarks":""},{"money":"$319,000,314","country":"Worldwide","day":"03","month":"08","year":"2016","remarks":""},{"money":"$317,504,356","country":"Worldwide","day":"02","month":"08","year":"2016","remarks":""},{"money":"$254,881,828","country":"Worldwide","day":"31","month":"07","year":"2016","remarks":""},{"money":"$199,106,650","country":"Worldwide","day":"24","month":"07","year":"2016","remarks":""},{"money":"$236,117,791","country":"Non-USA","day":"09","month":"08","year":"2016","remarks":""},{"money":"$234,607,469","country":"Non-USA","day":"07","month":"08","year":"2016","remarks":""},{"money":"$216,421,303","country":"Non-USA","day":"02","month":"08","year":"2016","remarks":""},{"money":"$211,642,789","country":"Non-USA","day":"31","month":"07","year":"2016","remarks":""},{"money":"$177,733,586","country":"Non-USA","day":"24","month":"07","year":"2016","remarks":""},{"money":"€8,717,632","country":"Italy","day":"01","month":"01","year":"2017","remarks":""},{"money":"€8,628,288","country":"Italy","day":"02","month":"10","year":"2016","remarks":""},{"money":"€8,495,016","country":"Italy","day":"25","month":"09","year":"2016","remarks":""},{"money":"€8,305,269","country":"Italy","day":"18","month":"09","year":"2016","remarks":""},{"money":"€7,537,217","country":"Italy","day":"11","month":"09","year":"2016","remarks":""},{"money":"€6,018,861","country":"Italy","day":"04","month":"09","year":"2016","remarks":""},{"money":"€3,753,470","country":"Italy","day":"28","month":"08","year":"2016","remarks":""}],"weekendGross":[{"money":"$10,172","country":"USA","day":"30","month":"10","year":"2016","remarks":"29 Screens"},{"money":"$23,202","country":"USA","day":"23","month":"10","year":"2016","remarks":"67 Screens"},{"money":"$39,504","country":"USA","day":"16","month":"10","year":"2016","remarks":"78 Screens"},{"money":"$71,161","country":"USA","day":"09","month":"10","year":"2016","remarks":"125 Screens"},{"money":"$113,818","country":"USA","day":"02","month":"10","year":"2016","remarks":"151 Screens"},{"money":"$175,108","country":"USA","day":"25","month":"09","year":"2016","remarks":"198 Screens"},{"money":"$273,644","country":"USA","day":"11","month":"09","year":"2016","remarks":"309 Screens"},{"money":"$510,412","country":"USA","day":"28","month":"08","year":"2016","remarks":"455 Screens"},{"money":"$4,325,094","country":"USA","day":"07","month":"08","year":"2016","remarks":"2,738 Screens"},{"money":"$4,325,094","country":"USA","day":"07","month":"08","year":"2016","remarks":"2,738 Screens"},{"money":"$10,988,839","country":"USA","day":"31","month":"07","year":"2016","remarks":"3,997 Screens"},{"money":"$21,373,064","country":"USA","day":"24","month":"07","year":"2016","remarks":"3,992 Screens"},{"money":"€96,304","country":"Italy","day":"02","month":"10","year":"2016","remarks":"88 Screens"},{"money":"€123,322","country":"Italy","day":"25","month":"09","year":"2016","remarks":"164 Screens"},{"money":"€485,655","country":"Italy","day":"18","month":"09","year":"2016","remarks":"285 Screens"},{"money":"€906,182","country":"Italy","day":"11","month":"09","year":"2016","remarks":"484 Screens"},{"money":"€1,275,081","country":"Italy","day":"04","month":"09","year":"2016","remarks":"667 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby Digital","Datasat","Dolby Atmos","SDDS","Dolby"],"color":["Color","Color (Technicolor, Hollywood, USA)","Color (Atlab Film Laboratory Service, Sydney, Australia)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Atlab Film Laboratory Service, Sydney, Australia (color)","DeLuxe, Hollywood (CA), USA (prints)","Dolby Laboratories (sound mixing)","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)","Monaco Film Laboratories, San Francisco (CA), USA (processing)","Technicolor (color)"],"filmLength":null,"negativeFormat":["Digital"],"cinematographicProcess":["Digital 3-D (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3514DI)","D-Cinema (also 3-D version)"]},"rating":"5.7","metascore":"34","filmingLocations":[],"rated":"PG","awards":[{"award":"Ischia Global Film & Music Festival 2016","titlesAwards":[{"titleAwardOutcome":"Won Ischia Dubbing Award","categories":[{"category":"","names":[{"name":"Massimo Giuliani","id":"nm0321317","role":null},{"name":"Marco Guadagno","id":"nm1707988","role":null},{"name":"Pino Insegno","id":"nm0409370","role":null},{"name":"Lee Ryan","id":"nm1094044","role":null},{"name":"Filippo Timi","id":"nm0863599","role":null}]}]}]}],"votes":"32,623","type":"Movie","companyCreditsSimple":[{"idCompany":"co0047265","name":"Blue Sky Studios"},{"idCompany":"co0179259","name":"Twentieth Century Fox Animation"}],"keywords":{"keywords":["planet","acorn","animal that acts human","talking animal","fifth part","sequel","mass extinction","mars","wedding","near miss","walking with a cane","hogtied","volcano","unicorn","meteorite","crystal","feather","pumpkin","lightning bolt","electrified","fording a river","tractor beam","trail","robot","magnet","glowing rock","forest","trip and fall","huddle","prophecy","stone column","rock fall","explosion","sauropod","singing in the shower","ceratopsian","weasel","sabre toothed squirrel","meteor impact","meteor shower","dinosaur egg","mariachi band","sabre toothed cat","llama","sloth","hockey","turtle shell","woolly mammoth","asteroid","moon","pinball analogy","billiards analogy","constellation","spacesuit","ice cave","begins with narration","cgi animation","singing","meteor crash","fire","fireworks","mammoth","animal","spaceship","no opening credits"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:41:23"}}