{"data":{"movies":[{"title":"The Sea of Trees","originalTitle":"","year":"2015","releaseDate":"20160826","directors":[{"name":"Gus Van Sant","id":"nm0001814"}],"writers":[{"name":"Chris Sparling","id":"nm2133655"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMyMTY0ODg2MV5BMl5BanBnXkFtZTgwNzI3OTY2OTE@._V1.jpg","countries":["USA"],"languages":["English","Japanese"],"genres":["Drama"],"plot":"Arthur Brennan treks into Aokigahara, known as The Sea of Trees, a mysterious dense forest at the base of Japan's Mount Fuji where people go to commit suicide. On his journey to the suicide forest, he encounters Takumi Nakamura, a Japanese man who has lost his way after attempting suicide. The two men begin a journey of reflection and survival, which affirms Arthur's will to live and reconnects him to his love for his wife.","simplePlot":"A suicidal American befriends a Japanese man lost in a forest near Mt. Fuji and the two search for a way out.","actors":[{"actorName":"Matthew McConaughey","urlProfile":"http://www.imdb.com/name/nm0000190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1969","placeOfBirth":" Uvalde, Texas, USA","birthName":"Matthew David McConaughey","height":"6' (1.83 m)","bio":"American actor and producer Matthew David McConaughey was born in Uvalde, Texas. His mother, Mary Kathleen (McCabe), is a substitute school teacher originally from New Jersey. His father, James Donald McConaughey, was a Mississippi-born gas station owner who ran an oil pipe supply business. He is of Scottish, Irish, English, German, and Swedish descent. Matthew grew up in Longview, Texas, where he graduated from the local High School (1988). Showing little interest in his father's oil business, which his two brothers later joined, Matthew was longing for a change of scenery, and spent a year in Australia, washing dishes and shoveling chicken manure. Back to the States, he attended the University of Texas in Austin, originally wishing to be a lawyer. But, when he discovered an inspirational Og Mandino book \"The Greatest Salesman in the World\" before one of his final exams, he suddenly knew he had to change his major from law to film. He began his acting career in 1991, appearing in student films and commercials in Texas and directed short films as Chicano Chariots (1992). Once, in his hotel bar in Austin, he met the casting director and producer Don Phillips, who introduced him to director Richard Linklater for his next project. At first, Linklater thought Matthew was too handsome to play the role of a guy chasing high school girls in his coming-of-age drama Dazed and Confused (1993), but cast him after Matthew grew out his hair and mustache. His character was initially in three scenes but the role grew to more than 300 lines as Linklater encouraged him to do some improvisations. In 1995, he starred in Texas Chainsaw Massacre: The Next Generation (1994), playing a mad bloodthirsty sadistic killer, opposite Renée Zellweger. Shortly thereafter, moving to L.A., Matthew became a sensation with his performances in two high-profile 1996 films Lone Star (1996), where he portrayed killing suspected sheriff and in the film adaptation of John Grisham's novel A Time to Kill (1996), where he played an idealistic young lawyer opposite Sandra Bullock and Kevin Spacey. The actor was soon being hailed as one of the industry's hottest young leading man inspiring comparisons to actor Paul Newman. His following performances were Robert Zemeckis' Contact (1997) with Jodie Foster (the film was finished just before the death of the great astronomer and popularizer of space science Carl Sagan) and Steven Spielberg's Amistad (1997), a fact-based 1839 story about the rebellious African slaves. In 1998, he teamed again with Richard Linklater as one of the bank-robbing brothers in The Newton Boys (1998), set in Matthew's birthplace, Uvalde, Texas. During this time, he also wrote, directed and starred in the 20-minute short The Rebel (1998). In 1999, he starred in the comedy Edtv (1999), about the rise of reality television, and in 2000, he headlined Jonathan Mostow's U-571 (2000), portraying officer Lt. Tyler, in a WW II story of the daring mission of American submariners trying to capture the Enigma cipher machine. In the 2000s, he became known for starring in romantic comedies, such as Un mariage trop parfait (2001), opposite Jennifer Lopez, and How to Lose a Guy in 10 Days (2003), in which he co-starred with Kate Hudson. He played Denton Van Zan, an American warrior and dragons hunter in the futuristic thriller Reign of Fire (2002), where he co-starred with Christian Bale. In 2006, he starred in the romantic comedy Failure to Launch (2006), and later as head coach Jack Lengyel in We Are Marshall (2006), along with Matthew Fox. In 2008, he played treasure hunter Benjamin \"Finn\" Finnegan in Fool's Gold (2008), again with Kate Hudson. After playing Connor Mead in Ghosts of Girlfriends Past (2009), co-starring with Jennifer Garner, McConaughey took a two year hiatus to open different opportunities in his career. Since 2010, he has moved away from romantic comedies. That change came in 2011, in his first movie after that pause, when he portrayed criminal defense attorney Mickey Haller in The Lincoln Lawyer (2011), that operates mostly from the back seat of his Lincoln car. After this performance that was considered one of his best until then, Matthew played other iconic characters as district attorney Danny Buck Davidson in Bernie (2011), the wild private detective \"Killer\" Joe Cooper in Killer Joe (2011), Mud in Mud (2012), reporter Ward Jensen in The Paperboy (2012), male stripper club owner Dallas in Magic Mike (2012), starring Channing Tatum. McConaughey's career certainly reached it's prime, when he played HIV carrier Ron Woodroof in the biographical drama Dallas Buyers Club (2013), shot in less than a month. For his portrayal of Ron, Matthew won the Best Actor in the 86th Academy Awards, as well as the Golden Globe Award for Best Actor, among other awards and nominations. The same year, he also appeared in Martin Scorsese's The Wolf of Wall Street (2013). In 2014, he starred in HBO's True Detective (2014), as detective Rustin Cohle, whose job is to investigate with his partner Martin Hart, played by Woody Harrelson, a gruesome murder that happened in his little town in Louisiana. The series was highly acclaimed by critics winning 4 of the 7 categories it was nominated at the 66th Primetime Emmy Awards; he also won a Critics' Choice Award for the role. Later in 2014, Matthew starred in Christopher Nolan's sci-fi film Interstellar (2014), playing Cooper, a former NASA pilot.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000190","name":"Matthew McConaughey","idIMDB":"nm0000190"},"actorId":"nm0000190","character":"Arthur Brennan","urlCharacter":"http://www.imdb.com/character/ch0468980","main":true},{"actorName":"Ryoko Seta","urlProfile":"http://www.imdb.com/name/nm7322503","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI2ODQxODQwMl5BMl5BanBnXkFtZTgwMzAyODM0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Ryoko Seta is an actress, known for The Sea of Trees (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI2ODQxODQwMl5BMl5BanBnXkFtZTgwMzAyODM0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm7322503","name":"Ryoko Seta","idIMDB":"nm7322503"},"actorId":"nm7322503","character":"Airport Desk Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sienna Tow","urlProfile":"http://www.imdb.com/name/nm5941445","urlPhoto":"","biography":{"bio":"Sienna Tow is an actress, known for The Sea of Trees (2015), Descendants of the Past, Ancestors of the Future (2014) and East of Hollywood (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5941445","name":"Sienna Tow","idIMDB":"nm5941445"},"actorId":"nm5941445","character":"Girl in Airport","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Naoko Marshall","urlProfile":"http://www.imdb.com/name/nm8385196","urlPhoto":"","biography":{"bio":"Naoko Marshall is an actor, known for The Sea of Trees (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8385196","name":"Naoko Marshall","idIMDB":"nm8385196"},"actorId":"nm8385196","character":"Flight Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michiko Tomura","urlProfile":"http://www.imdb.com/name/nm4028426","urlPhoto":"","biography":{"bio":"Michiko Tomura is an actress, known for The Sea of Trees (2015), The Battery (2007) and Moteki (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4028426","name":"Michiko Tomura","idIMDB":"nm4028426"},"actorId":"nm4028426","character":"Woman on Train","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yusuke Tozawa","urlProfile":"http://www.imdb.com/name/nm2183900","urlPhoto":"","biography":{"bio":"Yusuke Tozawa is an actor, known for The Sea of Trees (2015), Le soleil (2005) and A Taxing Woman (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2183900","name":"Yusuke Tozawa","idIMDB":"nm2183900"},"actorId":"nm2183900","character":"Man on Train","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abe Lee Tsunenori","urlProfile":"http://www.imdb.com/name/nm3276576","urlPhoto":"","biography":{"bio":"Abe Lee Tsunenori is an actor, known for The Pink Panther 2 (2009) and The Sea of Trees (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3276576","name":"Abe Lee Tsunenori","idIMDB":"nm3276576"},"actorId":"nm3276576","character":"Taxi Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Watanabe","urlProfile":"http://www.imdb.com/name/nm0913822","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTUzNjc4Nl5BMl5BanBnXkFtZTcwMTUyODU2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1959","placeOfBirth":" Uonuma, Japan","birthName":"Kensaku Watanabe","height":"6' 0½\" (1.84 m)","bio":"Both of Ken Watanabe's parents were teachers: his mother taught general education and his dad taught calligraphy. He became interested in acting at the age of 24 when a director of England's National Theatre Company, where he was studying, told him that acting was his special gift. Ken is mostly known in Japan for playing samurais. He incorporates the samurai's values in his daily life by not amassing too many material possessions and by living his life with honor, pride and discipline. The Last Samurai (2003), the film that introduced him to Western audiences, was his fourth film released in 2003, and he has also starred in roles as a gangster, a businessmen and a general. Ken is currently separated from his wife and has two children, a daughter who is working as a model and one son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTUzNjc4Nl5BMl5BanBnXkFtZTcwMTUyODU2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0913822","name":"Ken Watanabe","idIMDB":"nm0913822"},"actorId":"nm0913822","character":"Takumi Nakamura","urlCharacter":"http://www.imdb.com/character/ch0499127","main":true},{"actorName":"Joe Girard","urlProfile":"http://www.imdb.com/name/nm4472978","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjk5Mjc4Nl5BMl5BanBnXkFtZTgwNjI5MzEzNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Joe Girard is known for his work on The Sea of Trees (2015), Free State of Jones (2016) and Gold (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjk5Mjc4Nl5BMl5BanBnXkFtZTgwNjI5MzEzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4472978","name":"Joe Girard","idIMDB":"nm4472978"},"actorId":"nm4472978","character":"Man at Convenience Store","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jazmin Domenech","urlProfile":"http://www.imdb.com/name/nm8385197","urlPhoto":"","biography":{"bio":"Jazmin Domenech is an actress, known for The Sea of Trees (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8385197","name":"Jazmin Domenech","idIMDB":"nm8385197"},"actorId":"nm8385197","character":"Young Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luke DeWolfe","urlProfile":"http://www.imdb.com/name/nm8385198","urlPhoto":"","biography":{"bio":"Luke DeWolfe is an actor, known for The Sea of Trees (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8385198","name":"Luke DeWolfe","idIMDB":"nm8385198"},"actorId":"nm8385198","character":"Young Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Naomi Watts","urlProfile":"http://www.imdb.com/name/nm0915208","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjY1NTA4OF5BMl5BanBnXkFtZTcwNjk3MDYwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1968","placeOfBirth":" Shoreham, Kent, England, UK","birthName":"Naomi Ellen Watts","height":"5' 4½\" (1.64 m)","bio":"Naomi Ellen Watts was born on September 28, 1968 in Shoreham, England, to Myfanwy Edwards \"Miv\" (Roberts), an antiques dealer and costume/set designer, and Peter Watts (Peter Anthony Watts), the road manager to Pink Floyd. Her maternal grandfather was Welsh. Her father died when Naomi was seven and she began to follow her mother and her brother around England, until she was fourteen, when they settled in Australia, where her maternal grandmother was from. She coaxed her mother into letting her take acting class when they arrived. After bit parts in commercials, she landed her first role in For Love Alone (1986). Naomi met her best friend, Nicole Kidman, when they both auditioned for a bikini commercial and they shared a taxi ride home. In 1991, Naomi starred along Kidman in the sleeper-hit Flirting (1991) directed by John Duigan. Naomi continued her career by starring in the Australian Brides of Christ (1991) co-starring Oscar-winners Russell Crowe and Brenda Fricker. In 1993, she worked with John Duigan again in Wide Sargasso Sea (1993) and director George Miller in Gross Misconduct (1993). Tank Girl (1995), in 1995, an adaptation of the comic book was a cult hit, starred Naomi as \"Jet Girl\", but it didn't fare well at the box-office and didn't do much for her career as a whole. Watts continued to take insignificant parts in movies including the much forgotten film Children of the Corn: The Gathering (1996). It wasn't until David Lynch cast her in the critically acclaimed film Mulholland Drive (2001) that she began to become noticed. Her part as an aspiring actress showed her strong acting ability and wide range and earned her much respect, as much as to say by some that she was overlooked for a Oscar nomination that year. Stardom finally came to Naomi in the surprise hit The Ring (2002), which grossed over $100,000,000 at the box-office and starred Watts as a investigative reporter hunting down the truth behind several mysterious deaths seemingly caused by a video tape. While the movie did not fare well with the critics, it launched her into the spotlight. In 2003, she starred in Alejandro González Iñárritu's 21 Grams (2003) which earned her - what some say is a much overdue Oscar nomination and brought others to call her one of the best in her generation of actors. The same year, she was nominated for 21 Grams (2003), Naomi was chosen to play \"Ann Darrow\" in director Peter Jackson's King Kong (2005) which took her to New Zealand for a five month shoot. Watts completed her first comedy in I Heart Huckabees (2004) for director David O. Russell, playing a superficial spokes model - a break from her usual intense and dramatic roles she is known for. In 2005, she reprized her role as the protective-mother-reporter \"Rachel Keller\" in The Ring Two (2005). The movie, released in March, opened to $35,000,000 at the box office in the first weekend and established her as a box-office draw. Also in 2005, it was decided that her independent movie Ellie Parker (2001) would be re-released in late 2005 after its success at resurfacing at the Sundance Film Festival. The movie, which Naomi also produced, features her in the title role and is a bit biographical, but yet exaggerated take of the life of a struggling actress as she comes to Hollywood and encounters nightmares of the profession (it also features Watts' own beat-up Honda which she travels around in). In 2006, she starred with Edward Norton in Le voile des illusions (2006). In July of 2007, Naomi gave birth to a boy, Alexander Pete (Sasha Schreiber) in Los Angeles with Liev Schreiber. Since then her career choices have gathered even more critical acclaim with starring roles roles in German director Michael Haneke's American remake of his thriller Funny Games (2007), David Cronenberg's Eastern Promises (2007), and the action-thriller, The International (2009), released in February 2009. In mid-2008, Watts announced she was expecting her second child with Schreiber and gave birth to another boy, Samuel Kai Schreiber, in New York on December 13.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjY1NTA4OF5BMl5BanBnXkFtZTcwNjk3MDYwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915208","name":"Naomi Watts","nicknames":["Queen of Remakes"],"idIMDB":"nm0915208"},"actorId":"nm0915208","character":"Joan Brennan","urlCharacter":"http://www.imdb.com/character/ch0468981","main":true},{"actorName":"Katie Aselton","urlProfile":"http://www.imdb.com/name/nm1051221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDQxNzc2Nl5BMl5BanBnXkFtZTcwNjcyOTQ2NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1978","placeOfBirth":" Milbridge, Maine, USA","birthName":"Kathryn Aselton","height":"5' 7\" (1.7 m)","bio":"Katie Aselton was born on October 1, 1978 in Milbridge, Maine, USA as Kathryn Aselton. She is an actress, known for The League (2009), The Gift (2015) and Cyrus (2010). She has been married to Mark Duplass since August 26, 2006. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDQxNzc2Nl5BMl5BanBnXkFtZTcwNjcyOTQ2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1051221","name":"Katie Aselton","idIMDB":"nm1051221"},"actorId":"nm1051221","character":"Gabriella Laforte","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nada Despotovich","urlProfile":"http://www.imdb.com/name/nm0221631","urlPhoto":"","biography":{"dateOfBirth":"24 April 1967","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Nada Despotovich was born on April 24, 1967 in New York City, New York, USA. She is an actress, known for Jerry Maguire (1996), Moonstruck (1987) and Jingle All the Way (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0221631","name":"Nada Despotovich","idIMDB":"nm0221631"},"actorId":"nm0221631","character":"Maryanne Wescott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Tarjan","urlProfile":"http://www.imdb.com/name/nm2657824","urlPhoto":"","biography":{"bio":"Christopher Tarjan is an actor, known for American Hustle (2013), The Sea of Trees (2015) and The Spirit of Christmas (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2657824","name":"Christopher Tarjan","idIMDB":"nm2657824"},"actorId":"nm2657824","character":"Gil Cramer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3450900","urlIMDB":"http://www.imdb.com/title/tt3450900","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,877","country":"USA","day":"28","month":"08","year":"2016","remarks":"2 Screens"}],"gross":[{"money":"$20,083","country":"USA","day":"11","month":"09","year":"2016","remarks":""},{"money":"$1,877","country":"USA","day":"28","month":"08","year":"2016","remarks":""},{"money":"€500,652","country":"Italy","day":"08","month":"05","year":"2016","remarks":""}],"weekendGross":[{"money":"$909","country":"USA","day":"11","month":"09","year":"2016","remarks":"3 Screens"},{"money":"$1,877","country":"USA","day":"28","month":"08","year":"2016","remarks":"2 Screens"},{"money":"€80,021","country":"Italy","day":"08","month":"05","year":"2016","remarks":"185 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"28","month":"07","year":"2014","remarks":null},null],"copyrightHolder":"Grand Experiment, LLC"},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Hawk V-Lite Vintage '74, V-Plus and Kowa Prominar Lenses","Red Epic Dragon, Hawk V-Lite Vintage '74, V-Plus and Kowa Prominar Lenses"],"laboratory":["EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)","FotoKem Laboratory, Burbank (CA), USA"],"filmLength":null,"negativeFormat":["Codex ARRIRAW (2.8K)","Redcode RAW (4K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Hawk Scope (anamorphic) (source format)","Kowa Scope (anamorphic) (source format)"],"printedFilmFormat":["D-Cinema"]},"rating":"5.9","metascore":"23","filmingLocations":[{"location":"Foxborough, Massachusetts, USA"}],"rated":"PG-13","awards":[{"award":"Cannes Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Gus Van Sant","id":"nm0001814","role":null}]}]}]}],"votes":"6,853","type":"Movie","companyCreditsSimple":[{"idCompany":"co0482449","name":"Bloom"},{"idCompany":"co0313933","name":"Netter Productions"},{"idCompany":"co0353060","name":"Waypoint Entertainment"}],"keywords":{"keywords":["forest","suicide","lost","mount fuji","suicide forest","japan","car crash","funeral","loss of wife","death of wife","ambulance hit by a truck","hit by a truck","ambulance","hospital","googling for information","google search","reference to google","tent","flooding","classroom","professor","cancer","doctor","medical scanner","full moon","dead body","hanging body","hanging","flower","night","nose bleeding","falling from height","gas station","nonlinear timeline","non linear","flashback","lost in the forest","suicide thoughts","taxi","airport","loss"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:24:47"}}