{"data":{"movies":[{"title":"Captain America: Civil War","originalTitle":"","year":"2016","releaseDate":"20160506","directors":[{"name":"Anthony Russo","id":"nm0751577"},{"name":"Joe Russo","id":"nm0751648"}],"writers":[{"name":"Christopher Markus","id":"nm1321655"},{"name":"Stephen McFeely","id":"nm1321656"}],"runtime":"147 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0MTgyNjAxMV5BMl5BanBnXkFtZTgwNjUzMDkyODE@._V1.jpg","countries":["USA"],"languages":["English","German","Xhosa","Russian","Romanian","Hindi"],"genres":["Action","Adventure","Sci-Fi"],"plot":"With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world. This escalates into an all-out war between Team Iron Man (Iron Man, Black Panther, Vision, Black Widow, War Machine, and Spider-Man) and Team Captain America (Captain America, Bucky Barnes, Falcon, Scarlet Witch, Hawkeye, and Ant Man) while a new villain emerges.","simplePlot":"Political interference in the Avengers' activities causes a rift between former allies Captain America and Iron Man.","actors":[{"actorName":"Chris Evans","urlProfile":"http://www.imdb.com/name/nm0262635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1981","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Christopher Robert Evans","height":"6' (1.83 m)","bio":"Christopher Robert Evans began his acting career in typical fashion: performing in school productions and community theater. He was born in Boston, Massachusetts, the son of Lisa (Capuano), who worked at the Concord Youth Theater, and G. Robert Evans III, a dentist. His uncle is congressman Mike Capuano. Chris's father is of half German and half Welsh/English/Scottish ancestry, while Chris's mother is of half Italian and half Irish descent. He has an older sister, Carly Evans, and two younger siblings, a brother named Scott Evans, and a sister named Shana Evans. The family moved to suburban Sudbury when he was 11 years-old. Bitten by the acting bug in the first grade because his older sister, Carly, started performing, Evans followed suit and began appearing in school plays. While at Lincoln-Sudbury Regional High School, his drama teacher cited his performance as \"Leontes\" in \"The Winter's Tale\" as exemplary of his skill. After more plays and regional theater, he moved to New York and attended the Lee Strasberg Theater Institute. On the advice of friends, he landed an internship at a casting office and befriended a couple of the agents he regularly communicated with - one of whom later took him on as a client. The screen - not the stage - then became his focus; Evans soon began auditioning for feature films and television series. Evans made one of his first appearances on The Fugitive (2000) (CBS, 2000-2001), a remake of the 1960s series and feature film starring Harrison Ford. In the episode \"Guilt\", Evans played the son of a small-town sheriff who tries to exact revenge after Dr. Richard Kimble - incognito as a liquor store owner - refuses to sell him and his friends alcohol. After small roles in Cherry Falls (2000) and The Newcomers (2000) - two unknown low-budget features - Evans appeared in Boston Public (2000) (Fox, 2000-2004) as a murder suspect. He then appeared in his first major feature, Not Another Teen Movie (2001), a spoof on teen comedies wherein he played a jock who makes a bet that he can turn an unpopular and unkempt girl (Chyler Leigh) into prom queen. After filming a couple of television pilots he was confident would be successful - Just Married (2003) and Eastwick (2002) - he appeared in another listless teen comedy, The Perfect Score (2004), playing an average, ho-hum student who takes part in a plot to steal the SAT test. Hijinks naturally ensue. Then, Evans broke through to the Big Time, grabbing the lead in the kidnapping thriller, Cellular (2004), a suspenseful B movie with a cheesy gimmick - a random wrong number on his cell phone forces him into a high-stakes race to save an unknown woman's life. Despite an unassuming performance from Evans and Kim Basinger as the damsel in distress, Cellular (2004) failed to break any box office records or please a wide majority of critics. Evans then prepared himself for super stardom when he signed on to play Johnny Storm in Fantastic Four (2005), 20th Century Fox's long-awaited adaptation of the Marvel comic. Although the film was wildly uneven and disappointing, Evans nearly stole the show with his energetic, unfettered performance. In that year itself, Chris was noticed by critics and made it into magazine and Internet countdowns, scoring himself a third position of the hot body countdown from Gay.com and #18 on E! Television's 2006 101 Sexiest Celebrity Bodies. The year 2007 also proved to be one successful year for Chris, as he had two movies released around the world that same year, starting with the second installment of the Marvel franchise Fantastic Four. Chris received positive reviews for his performance. The Nanny Diaries (2007), where Evans played Harvard Hottie, showed his sensitive. The year 2008 saw Chris Evans' part of the movie Street Kings (2008), playing the character Detective Paul Diskant. The movie is about police officers trying to cover up their wrongdoings and audiences got to see a serious side of Chris. In the same year, Chris also worked on the movie The Loss of a Teardrop Diamond (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0262635","name":"Chris Evans","nicknames":["Cevans"],"idIMDB":"nm0262635"},"actorId":"nm0262635","character":"Steve Rogers / Captain America","urlCharacter":"http://www.imdb.com/character/ch0565201","main":true},{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Tony Stark / Iron Man","urlCharacter":"http://www.imdb.com/character/ch0556868","main":true},{"actorName":"Scarlett Johansson","urlProfile":"http://www.imdb.com/name/nm0424060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTUwMDYwNl5BMl5BanBnXkFtZTcwNTUyNzc3Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1984","placeOfBirth":" New York City, New York, USA","birthName":"Scarlett Ingrid Johansson","height":"5' 3\" (1.6 m)","bio":"Scarlett Ingrid Johansson was born in New York City. Her mother, Melanie Sloan, is from a Jewish family from the Bronx, and her father, Karsten Johansson, is a Danish-born architect, from Copenhagen. She has a sister, Vanessa Johansson, who is also an actress, a brother, Adrian, a twin brother, Hunter Johansson, born three minutes after her, and a paternal half-brother, Christian. Her grandfather was writer Ejner Johansson. Johansson began acting during childhood, after her mother started taking her to auditions. She made her professional acting debut at the age of eight in the off-Broadway production of \"Sophistry\" with Ethan Hawke, at New York's Playwrights Horizons. She would audition for commercials but took rejection so hard her mother began limiting her to film tryouts. She made her film debut at the age of nine, as John Ritter's character's daughter in the fantasy comedy North (1994). Following minor roles in Just Cause (1995), as the daughter of Sean Connery and Kate Capshaw's character, and If Lucy Fell (1996), she played the role of Amanda in Manny & Lo (1996). Her performance in Manny & Lo garnered a nomination for the Independent Spirit Award for Best Lead Female, and positive reviews, one noting, \"[the film] grows on you, largely because of the charm of ... Scarlett Johansson\", while San Francisco Chronicle critic Mick LaSalle commentated on her \"peaceful aura\", and wrote, \"If she can get through puberty with that aura undisturbed, she could become an important actress.\". After appearing in minor roles in Fall (1997) and Home Alone 3 (1997), Johansson garnered widely spread attention for her performance in The Horse Whisperer (1998), directed by Robert Redford, where she played Grace MacLean, a teenager traumatized by a riding accident. She received a nomination for the Chicago Film Critics Association Award for Most Promising Actress for the film. In 1999, she appeared in My Brother the Pig (1999) and in the music video for Mandy Moore's single, \"Candy\". Although the film was not a box office success, she received praise for her breakout role in Ghost World (2001), credited with \"sensitivity and talent [that] belie her age\". She was also featured in the Coen Brothers' dark drama The Man Who Wasn't There (2001), opposite Billy Bob Thornton and Frances McDormand. She appeared in the horror comedy Eight Legged Freaks (2002) with David Arquette and Kari Wuhrer. In 2003, she was nominated for two Golden Globe Awards, one for drama (Girl with a Pearl Earring (2003)) and one for comedy (Lost in Translation (2003)), her breakout role, starring opposite Bill Murray, and receiving rave reviews and a Best Actress Award at the Venice Film Festival. Her film roles include the critically acclaimed Weitz brothers' film In Good Company (2004), as well as starring opposite John Travolta in A Love Song for Bobby Long (2004), which garnered her a third Golden Globe Award nomination. She dropped out of Mission: Impossible III (2006) due to scheduling conflicts. Her next film role was in The Island (2005) alongside Ewan McGregor which earned weak reviews from U.S. critics. After this, she appeared in Woody Allen's Match Point (2005) and was nominated again for a Golden Globe Award. In May 2008, she released her album \"Anywhere I Lay My Head\", a collection of Tom Waits covers featuring one original song. Also that year, she starred in Frank Miller's The Spirit (2008), the Woody Allen film Vicky Cristina Barcelona (2008), and played Mary Boleyn opposite Natalie Portman in The Other Boleyn Girl (2008). Since then, she has appeared as part of an ensemble cast in the romantic comedy He's Just Not That Into You (2009), the action superhero film Iron Man 2 (2010), the comedy-drama We Bought a Zoo (2011) and started as the original scream queen, Janet Leigh, in Hitchcock (2012). She then played her character, Black Widow, in the blockbuster action films The Avengers (2012), Captain America: The Winter Soldier (2014), Avengers: Age of Ultron (2015), Captain America: Civil War (2016), and Avengers: Infinity War (2018), and also headlined the science-fiction thriller Lucy (2014), a box office success. With more than a decade of work already under her belt, Scarlett has proven to be one of Hollywood's most talented young actresses. Scarlett and Canadian actor Ryan Reynolds were engaged in May 2008 and married in September of that same year. In 2010, the couple announced their separation, and subsequently divorced in 2011. In 2013, she became engaged to French journalist Romain Dauriac, the couple married in 2014, and have one daughter, Rose Dorothy Dauriac. In January 2017, the couple announced their separation, and subsequently divorced in March of that same year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTUwMDYwNl5BMl5BanBnXkFtZTcwNTUyNzc3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424060","name":"Scarlett Johansson","idIMDB":"nm0424060"},"actorId":"nm0424060","character":"Natasha Romanoff / Black Widow","urlCharacter":"http://www.imdb.com/character/ch0183355","main":true},{"actorName":"Sebastian Stan","urlProfile":"http://www.imdb.com/name/nm1659221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDY0NDg3NV5BMl5BanBnXkFtZTcwODk0MTg0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1982","placeOfBirth":" Constanta, Romania","height":"6' (1.83 m)","bio":"Sebastian Stan was born on August 13, 1982, in Constanta, Romania. He moved with his mother to Vienna, Austria, when he was eight, and then to New York when he was twelve. Stan studied at Rutgers Mason Gross School of the Arts and spent a year at Shakespeare's Globe Theatre in London. When he went back to New York he started working in some projects like Law & Order (1990), Tony 'n' Tina's Wedding (2004) and Red Doors (2005). Upon finishing college, he played Martin Waters in The Architect (2006), Chase Collins in The Covenant (2006) and worked in Eric Bogosian's theater play The Talk (2007). Also in 2007, Stan started playing Carter Baizen in Gossip Girl (2007). His following projects were Spread (2009), Kings (2009), Hot Tub Time Machine (2010), and Black Swan (2010). He landed also the role of Bucky Barnes in Captain America: The First Avenger (2011). In 2012, Stan worked in several projects: Gone (2012), Political Animals (2012), The Apparition (2012), Once Upon a Time (2011) and the mini series Labyrinth (2012). In 2013, he was in Broadway's Picnic and in 2014 he became The Winter Soldier in Captain America: The Winter Soldier (2014). His recent projects include Ricki and the Flash (2015), The Martian (2015), The Bronze (2015) and Captain America: Civil War (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDY0NDg3NV5BMl5BanBnXkFtZTcwODk0MTg0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1659221","name":"Sebastian Stan","idIMDB":"nm1659221"},"actorId":"nm1659221","character":"Bucky Barnes / Winter Soldier","urlCharacter":"http://www.imdb.com/character/ch0062969","main":true},{"actorName":"Anthony Mackie","urlProfile":"http://www.imdb.com/name/nm1107001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NTM1MjE2M15BMl5BanBnXkFtZTcwNzc5OTI2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1978","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 10½\" (1.79 m)","bio":"Anthony Mackie is an American actor. He was born in New Orleans, Louisiana, to Martha (Gordon) and Willie Mackie, Sr., who owned a business, Mackie Roofing. Anthony has been featured in feature films, television series and Broadway and Off-Broadway plays, including Ma Rainey's Black Bottom, Drowning Crow, McReele, A Soldier's Play, and Talk, by Carl Hancock Rux, for which he won an Obie Award in 2002. In 2002, he was featured in Eminem's debut film, 8 Mile, playing Papa Doc, a member of Leaders of the Free World. He was nominated for Best Supporting Actor at the 2009 Independent Spirit Awards for his role in _The Hurt Locker (2009)_(QV). This is Mackie's second ISA nomination, the first coming for his work in _Brother to Brother (2003)_, where he was nominated for Best Actor. Also in 2009, Mackie portrayed rapper Tupac Shakur in the film Notorious (2009). He appears in the Matt Damon film The Adjustment Bureau (2011) where he plays Harry Mitchell, a sympathetic member of a shadowy supernatural group that controls human destiny.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NTM1MjE2M15BMl5BanBnXkFtZTcwNzc5OTI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1107001","name":"Anthony Mackie","idIMDB":"nm1107001"},"actorId":"nm1107001","character":"Sam Wilson / Falcon","urlCharacter":"http://www.imdb.com/character/ch0036471","main":true},{"actorName":"Don Cheadle","urlProfile":"http://www.imdb.com/name/nm0000332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1964","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Donald Frank Cheadle","height":"5' 8½\" (1.74 m)","bio":"Donald Frank Cheadle was born in Kansas City, Missouri on November 29, 1964. His childhood found him moving from city to city with his family: mother Bettye (North), a teacher, father Donald Frank Cheadle, Sr., a clinical psychologist, sister Dawn, and brother Colin. After graduating high school in Denver, Colorado, Cheadle attended and graduated from the California Institute of the Arts with a Bachelor¹s Degree in Fine Arts. Encouraged by his college friends, he attended a variety of auditions and landed a recurring role on the hit series Fame (1982), which led to feature film roles in Dennis Hopper's Colors (1988) and John Irvin's Hamburger Hill (1987). Early in his career, Cheadle was named Best Supporting Actor by the Los Angeles Film Critics for his breakout performance opposite Denzel Washington in Devil in a Blue Dress (1995). His subsequent film credits include: Traitor (2008), an international thriller which he produced, starring opposite Guy Pearce; Kasi Lemmons's Talk to Me (2007), with Chiwetel Ejiofor; the 2006 Oscar-winning Best Picture, Collision (2004), which Cheadle also produced; Hotel Rwanda (2004), for which his performance garnered Oscar, Golden Globe, Broadcast Film Critics and Screen Actors Guild award nominations for Best Actor; Steven Soderbergh's Ocean's Eleven (2001), Ocean's Twelve (2004) and Ocean's Thirteen (2007), starring Brad Pitt and George Clooney; Mike Binder's Reign Over Me (2007) with Adam Sandler; the Academy Award-winning Traffic (2000) and Out of Sight (1998), with George Clooney and Jennifer Lopez, both films also directed by Soderbergh; Paul Thomas Anderson's acclaimed Boogie Nights (1997) with Julianne Moore and Mark Wahlberg; Bulworth (1998), directed by and starring Warren Beatty; Swordfish (2001), with John Travolta and Halle Berry; Mission to Mars (2000) with Tim Robbins and Gary Sinise; John Singleton's Rosewood (1997), for which Cheadle earned an NAACP Image Award nomination; Brett Ratner's The Family Man (2000), starring Nicolas Cage; and the independent features Manic (2001) and Things Behind the Sun (2001). Cheadle was honored by the CineVegas Film Festival and the Los Angeles Film Festival and received ShoWest's Male Star of the Year award. He is also well-recognized for his television work, including his portrayal of Sammy Davis Jr. in HBO's The Rat Pack (1998), for which he received a Golden Globe Award and a Best Supporting Actor Emmy nomination. That same year, he also received an Emmy nomination for his starring role in HBO's adaptation of the best-selling novel A Lesson Before Dying (1999), opposite Cicely Tyson and Mekhi Phifer. He also starred for HBO in Eriq La Salle's Rebound: The Legend of Earl 'The Goat' Manigault (1996). Cheadle's TV series credits include his two-year stint in David E. Kelley's acclaimed series Picket Fences (1992), a guest-starring role on ER (1994) (earning yet another Emmy nomination) and a regular role on The Golden Palace (1992) He also starred in the live television broadcast of Fail Safe (2000) opposite George Clooney, James Cromwell, Brian Dennehy, Richard Dreyfuss and Harvey Keitel. He also co-executive produced the TV version of Crash (2008). His most recent big screen appearances have been in Antoine Fuqua's ensemble crime thriller Brooklyn's Finest (2009) and Jon Favreau's Iron Man 2 (2010), another mainstream breakthrough where he played Lt. Col. James 'Rhodey' Rhodes, replacing Terrence Howard from the first film. L'Irlandais (2011), an art-house hit directed by John Michael McDonagh and co-starring Brendan Gleeson, followed. Cheadle stars in House of Lies (2012) on Showtime. Late in 2012, he was seen in Flight (2012), Robert Zemeckis's return to live-action filmmaking. In 2013, he reprised his role as Rhodey in Iron Man 3 (2013). Among his projects in development is a movie based on the life of jazz legend Miles Davis. A talented musician who plays saxophone, writes music and sings, he is also an accomplished stage actor and director and was nominated for a Grammy Award in 2004 for Best Spoken Word Album for his narration/dramatization of the Walter Mosley novel \"Fear Itself\". Other notable off-stage achievements include the 2007 BET Humanitarian Award for the cause of the people of Darfur and Rwanda, and sharing the Summit Peace Award by the Nobel Peace Prize Laureates in Rome with George Clooney for their work in Darfur.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000332","name":"Don Cheadle","idIMDB":"nm0000332"},"actorId":"nm0000332","character":"Lieutenant James Rhodes / War Machine","urlCharacter":"http://www.imdb.com/character/ch0033332","main":true},{"actorName":"Jeremy Renner","urlProfile":"http://www.imdb.com/name/nm0719637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk2NDc2ODgzMF5BMl5BanBnXkFtZTcwMTMzOTQ4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1971","placeOfBirth":" Modesto, California, USA","birthName":"Jeremy Lee Renner","height":"5' 9\" (1.75 m)","bio":"Jeremy Lee Renner was born in Modesto, California, the son of Valerie (Tague) and Lee Renner, who managed a bowling alley. After a tumultuous yet happy childhood with his four younger siblings, Renner graduated from Beyer High School and attended Modesto Junior College. He explored several areas of study, including computer science, criminology, and psychology, before the theater department, with its freedom of emotional expression, drew him in. However, Renner recognized the potential in acting as much through the local police academy as through drama classes. During his second year at Modesto Junior College, Renner role-played a domestic disturbance perpetrator as part of a police-training exercise for an easy $50. Deciding to shift his focus away from schoolwork, Renner left college and moved to San Francisco to study at the American Conservatory Theater. From there he moved to Hawaii and, in 1993, to Los Angeles. In Los Angeles, Renner devoted himself to theater, most notably starring in and co-directing the critically acclaimed \"Search and Destroy.\" He pursued other projects during this time as well, landing his first film role in 1995's Alarme totale (1995). After several commercials and supporting roles in television movies and series, Renner captured the attention of critics with his gripping, complex portrayal of the infamous serial killer in the 2002 film Dahmer (2002). Renner's performance, which earned him an Independent Spirit Award nomination, is especially remarkable for painting a humane and sympathetic, yet deeply disturbing, portrait of the title character. In 2003, Renner took a break from small indie films to work on his first commercially successful movie, S.W.A.T. (2003), with Colin Farrell. In 2005, he played the leading role in Neo Ned (2005) as an institutionalized white supremacist in love with a black girl, winning the Palm Beach International Film Festival's best actor award. Renner's pivotal supporting roles in 2005's 12 and Holding (2005) and North Country (2005) earned him accolades from critics, and his 2007 turn in Take (2007) garnered him the best actor award at California's Independent Film Festival. Also in 2007, Renner played a leading role in the horror film 28 Weeks Later (2007) as well as a supporting role in the underrated Western epic The Assassination of Jesse James by the Coward Robert Ford (2007), with Casey Affleck, Brad Pitt, and Sam Rockwell. Renner's depiction of Jeffrey Dahmer in 2002 caught the attention of director Kathryn Bigelow, and, in 2008, she cast him in his most famous role as Sergeant First Class William James in The Hurt Locker (2008). Renner's performance as a single-minded bomb specialist scored him an Academy Award nomination for best actor. He also earned best actor nominations from the Independent Spirit Awards, the Screen Actors Guild, and the BAFTA Awards, as well as wins in this category from several film critics groups. In 2009, Renner starred in the short-lived TV series, The Unusuals (2009), and in 2010 he played the chilling but loyal criminal Jem in Ben Affleck bank-heist thriller The Town (2010). In the fall of 2010, Renner began filming Mission: Impossible - Ghost Protocol (2011). He has also since starred in The Avengers (2012), American Hustle (2013), and Kill the Messenger (2014). Renner's strengths as an actor derive not only from his expressive eyes but also from his ability to thoroughly embody the characters he portrays. His visceral depiction of these individuals captivates audiences and empowers him to steal scenes in many of his films, even when playing a minor role. Renner gravitates toward flawed, complicated, three-dimensional characters that allow him to explore new territory within himself. In addition to his work as an actor, Renner continues to cultivate his lifelong love of music. A singer, songwriter, and musician, he performed with the band Sons of Ben early in his career. Scenes in Love Comes to the Executioner (2006), North Country (2005), and The Assassination of Jesse James by the Coward Robert Ford (2007) briefly showcase Renner's singing talents. Despite traveling the world for film roles and, recently, as a United Nations Goodwill Peace Ambassador to raise awareness for mine-clearing efforts in Afghanistan, Renner remains close to his roots. In 2010, Modesto Junior College presented him the Distinguished Alumnus award in recognition of his body of work as an actor. He also headlined at a benefit for Modesto's Gallo Center for the Arts in the fall of 2010. Renner maintains a sense of humility and gratitude, even in the wake of his recent successes and recognition. He keeps himself grounded by renovating and restoring old and rundown iconic Hollywood homes, an enterprise he began back in his early days in Los Angeles. He values loyalty and a sense of both age and history, and enjoys the opportunity to help conserve these qualities in a town that favors the young and the new.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk2NDc2ODgzMF5BMl5BanBnXkFtZTcwMTMzOTQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719637","name":"Jeremy Renner","nicknames":["Renni"],"idIMDB":"nm0719637"},"actorId":"nm0719637","character":"Clint Barton / Hawkeye","urlCharacter":"http://www.imdb.com/character/ch0245422","main":true},{"actorName":"Chadwick Boseman","urlProfile":"http://www.imdb.com/name/nm1569276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzE1MjUyOV5BMl5BanBnXkFtZTcwMzI0MTE1Mw@@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1976","placeOfBirth":" Anderson, South Carolina, USA","height":"6' (1.83 m)","bio":"Chadwick Boseman was born on November 29, 1976 in Anderson, South Carolina, USA. He is an actor and producer, known for Captain America: Civil War (2016), 42 (2013) and Get on Up (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzE1MjUyOV5BMl5BanBnXkFtZTcwMzI0MTE1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1569276","name":"Chadwick Boseman","nicknames":["Chad"],"idIMDB":"nm1569276"},"actorId":"nm1569276","character":"T'Challa / Black Panther","urlCharacter":"http://www.imdb.com/character/ch0236126","main":true},{"actorName":"Paul Bettany","urlProfile":"http://www.imdb.com/name/nm0079273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODg1MTA5Ml5BMl5BanBnXkFtZTcwNDQwMTQxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1971","placeOfBirth":" Harlesden, London, England, UK","height":"6' 3½\" (1.92 m)","bio":"Paul Bettany was born in Harlesden, London, England, into a theatre family. His father, Thane Bettany, is still an actor, but his mother, Anne Kettle, has retired from acting. His maternal grandmother, Olga Gwynne (her maiden and stage name), was a successful actress, while his maternal grandfather, Lesley Kettle, was a musician and promoter. He has an older sister who is a writer. Paul was brought up in North West London and, after the age of nine, in Hertfordshire (Brookmans Park). Immediately after finishing at Drama Centre London, he went into the West End to join the cast of \"An Inspector Calls\", though when asked to go on tour with this play, he chose to stay in England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODg1MTA5Ml5BMl5BanBnXkFtZTcwNDQwMTQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079273","name":"Paul Bettany","idIMDB":"nm0079273"},"actorId":"nm0079273","character":"Vision","urlCharacter":"http://www.imdb.com/character/ch0104488","main":true},{"actorName":"Elizabeth Olsen","urlProfile":"http://www.imdb.com/name/nm0647634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjA0ODk1OF5BMl5BanBnXkFtZTcwMTA4ODM3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1989","placeOfBirth":" Sherman Oaks, California, USA","birthName":"Elizabeth Chase Olsen","height":"5' 6\" (1.68 m)","bio":"Elizabeth Chase \"Lizzie\" Olsen (born February 16, 1989) is an American actress. She is known for her roles in the films, Silent House (2011), Liberal Arts (2012), Godzilla (2014), Avengers: Age of Ultron (2015) and Captain America: Civil War (2016). For her role in the critically-acclaimed Martha Marcy May Marlene (2011), she was nominated for numerous awards, including the Independent Spirit Award for Best Female Lead. She is the younger sister of actresses and fashion designers Mary-Kate Olsen and Ashley Olsen. Olsen was born in Sherman Oaks, California, the daughter of Jarnette \"Jarnie\", a personal manager, and David \"Dave\" Olsen, a real estate developer and mortgage banker. She is the younger sister of twins Mary-Kate Olsen and Ashley Olsen, who became famous as TV and movie stars at an early age. Her oldest brother is named Trent Olsen, and she has two younger half-siblings as well. In 1996, Olsen's parents were divorced. The Olsens have Norwegian ancestry on their father's side and English ancestry on their mother's side. As a child, Olsen received ballet and singing lessons. She began acting at a very young age, with appearances in her sisters' films. Before the age of eleven, Olsen had small roles in How the West Was Fun and the straight-to-video series The Adventures of Mary-Kate & Ashley. Having appeared in her sisters' videos, when she was in the fourth grade, Olsen began to go on auditions for other projects. She attended Campbell Hall School in North Hollywood, California from kindergarten through grade 12. After graduation, she enrolled at New York University's Tisch School of the Arts. In 2009, Olsen spent a semester studying in Moscow, Russia at the Moscow Art Theatre School through the MATS program at the Eugene O'Neill Theater Center. Olsen began acting when she was four years of age and co-starred in six of Mary-Kate and Ashley's productions; she also auditioned for the film Spy Kids. She almost quit acting in 2004 due to the media frenzy surrounding Mary-Kate's eating disorder. Olsen's breakout role came in 2011, when she appeared in the film Martha Marcy May Marlene. The film, along with Olsen's performance, received critical acclaim. Olsen was nominated for and won numerous critics awards for her portrayal of the titular character Martha, a girl suffering from delusions and paranoia after fleeing her life in a cult and returning to her family. She next appeared in the horror film remake Silent House, in which she played the role of Sarah. The film received mixed reviews, although Olsen's performance was once again praised. Olsen also appeared in the music video \"The Queen\" by Carlotta. Olsen filmed the movie Red Lights during mid-2011, and it was released in the U.S. on July 13, 2012. She starred in Josh Radnor's film Liberal Arts, which was released on January 22, 2012. She and Dakota Fanning starred in Very Good Girls, a 2013 release. In January 2013, Olsen was nominated for the BAFTA Rising Star Award. She co-starred in the 2013 American remake of the 2003 South Korean film Oldboy; she played Marie, a young social worker who developed a relationship with the protagonist, played by Josh Brolin. She played Edie Parker, Jack Kerouac's first wife and the author of the Beat Generation memoir You'll Be Okay, in Kill Your Darlings. In 2014, Olsen starred in Legendary's Godzilla a reboot, opposite Bryan Cranston and Aaron Taylor-Johnson. Olsen joined the Marvel Cinematic Universe by playing the character of Scarlet Witch in Avengers: Age of Ultron, the 2015 sequel to The Avengers. She first appeared as the character in a mid-credits scene of the film Captain America: The Winter Soldier, again alongside her Godzilla co-star Taylor-Johnson, who portrayed her brother Quicksilver. She reprized her role as the Scarlet Witch in the 2015 film Avengers: Age of Ultron and the 2016 film Captain America: Civil War. In September 2014, it was announced that Olsen would portray Audrey Williams, Hank Williams' wife, manager, and duet partner in the upcoming 2015 biopic I Saw the Light directed by Marc Abraham and starring Tom Hiddleston as Hank Williams. In January 2016, it was announced that Olsen would team up with her Avengers: Age of Ultron co-star Jeremy Renner in Taylor Sheridan's directorial feature film debut, Wind River. Olsen attended New York University's Tisch School of the Arts and the Atlantic Theater Company and graduated in March 2013 after six years of intermittent study. Her sisters' clothing line \"Elizabeth and James\" was named after her and her older brother. Olsen started dating fellow actor Boyd Holbrook in September 2012 after meeting him on the film Very Good Girls. In March 2014, the couple became engaged but they split and called off their engagement in January 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjA0ODk1OF5BMl5BanBnXkFtZTcwMTA4ODM3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0647634","name":"Elizabeth Olsen","nicknames":["Lizzie","Liz"],"idIMDB":"nm0647634"},"actorId":"nm0647634","character":"Wanda Maximoff / Scarlet Witch","urlCharacter":"http://www.imdb.com/character/ch0236028","main":true},{"actorName":"Paul Rudd","urlProfile":"http://www.imdb.com/name/nm0748620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTEwNDg1MV5BMl5BanBnXkFtZTgwODMwMDA0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1969","placeOfBirth":" Passaic, New Jersey, USA","birthName":"Paul Stephen Rudd","height":"5' 10\" (1.78 m)","bio":"Paul Stephen Rudd was born in Passaic, New Jersey. His parents, Michael and Gloria, both from Jewish families, were born in the U.K. He has one sister, who is three years younger than he is. Paul traveled with his family during his early years, because of his father's airline job at TWA. His family eventually settled in Overland Park, Kansas, where his mother worked as a sales manager for TV station KSMO-TV. Paul attended Broadmoor Junior High and Shawnee Mission West High School, from which he graduated in 1987, and where he was Student Body President. He then enrolled at the University of Kansas in Lawrence, majoring in theater. He graduated from the American Academy of Dramatic Arts-West in Los Angeles and participated in a three-month intensive workshop under the guidance of Michael Kahn at the British Drama Academy at Oxford University in Britain. Rudd helped to produce the Globe Theater's production of Howard Brenton's \"Bloody Poetry,\" which starred Rudd as Percy Bysshe Shelley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTEwNDg1MV5BMl5BanBnXkFtZTgwODMwMDA0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0748620","name":"Paul Rudd","nicknames":["Fred"],"idIMDB":"nm0748620"},"actorId":"nm0748620","character":"Scott Lang / Ant-Man","urlCharacter":"http://www.imdb.com/character/ch0303631","main":true},{"actorName":"Emily VanCamp","urlProfile":"http://www.imdb.com/name/nm0885840","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDc4MDk4NF5BMl5BanBnXkFtZTgwMjkwMTYwOTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1986","placeOfBirth":" Port Perry, Ontario, Canada","birthName":"Emily Irene VanCamp","height":"5' 8\" (1.73 m)","bio":"Emily VanCamp was born on May 12, 1986 in Port Perry, Ontario, Canada as Emily Irene VanCamp. She is an actress, known for Revenge (2011), Captain America: The Winter Soldier (2014) and Captain America: Civil War (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDc4MDk4NF5BMl5BanBnXkFtZTgwMjkwMTYwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0885840","name":"Emily VanCamp","idIMDB":"nm0885840"},"actorId":"nm0885840","character":"Sharon Carter","urlCharacter":"http://www.imdb.com/character/ch0108479","main":true},{"actorName":"Tom Holland","urlProfile":"http://www.imdb.com/name/nm4043618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NzY1NzUzNzJeQTJeQWpwZ15BbWU4MDczMDcyMzgx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1996","placeOfBirth":" Kingston upon Thames, England, UK","birthName":"Thomas Stanley Holland","height":"5' 8\" (1.73 m)","bio":"Thomas Stanley Holland was born in Kingston-upon-Thames, Surrey, to Nicola Elizabeth (Frost), a photographer, and Dominic Holland (Dominic Anthony Holland), who is a comedian and author. His paternal grandparents were from the Isle of Man and Ireland, respectively. He lives with his parents and three younger brothers - Paddy and twins Sam and Harry. Tom attended Donhead Prep School. Then, after a successful eleven plus exam, he became a pupil at Wimbledon College. Having successfully completed his GCSEs, in September 2012 Tom started a two-year course in the BRIT School for Performing Arts & Technology notable for its numerous famous alumni. Holland began dancing at a hip hop class at Nifty Feet Dance School in Wimbledon, London. His potential was spotted by choreographer Lynne Page (who was an Associate to Peter Darling, choreographer of Billy Elliot and Billy Elliot the Musical) when he performed with his dance school as part of the Richmond Dance Festival 2006. After eight auditions and subsequent two years of training, on 28 June 2008 Tom made his West End debut in Billy Elliot the Musical as Michael, Billy's best friend. He gave his first performance in the title role of Billy on 8 September 2008 getting rave reviews praising his versatile acting and dancing skills. In September 2008 Tom (together with co-star Tanner Pflueger) appeared on the news programme on channel FIVE and gave his first TV interview. In 2009 Tom was featured on ITV1 show \"The Feel Good Factor\". At the launch show on 31 January he and two other Billy Elliots, Tanner Pflueger and Layton Williams, performed a specially choreographered version of Angry Dance from Billy Elliot the Musical, after which Tom was interviewed by host Myleene Klass. Then he became involved into training five ordinary British schoolboys learning to get fit and preparing their dance routine (fronted by Tom) for the final \"The Feel Good Factor\" show on 28 March 2009. On 11 March 2010 Tom Holland along with fellow Billy Elliots Dean-Charles Chapman and Fox Jackson-Keen appeared on The Alan Titchmarsh Show on ITV1. On 8 March 2010, to mark the fifth anniversary of Billy Elliot the Musical, four current Billy Elliots, including Tom Holland, were invited to 10 Downing Street to meet the Prime Minister Gordon Brown. It was Tom Holland who was chosen to be a lead at the special fifth anniversary show on 31 March 2010. Elton John, Billy Elliot the Musical composer, who was at the audience, called Tom's performance \"astonishing\" and said that he was \"blown away\" by it. Holland had been appearing on a regular basis as Billy in Billy Elliot the Musical rotating with three other performers till 29 May 2010 when he finished his run in the musical. In two months after leaving Billy Elliot the Musical, Holland successfully auditioned for a starring role in the film The Impossible[18] (directed by Juan Antonio Bayona) alongside Naomi Watts and Ewan McGregor. The Impossible was based on a true story that took place during the 2004 Indian Ocean earthquake. The film premiered at the Toronto International Film Festival on September 9, 2012, and was released in Europe in October 2012, and in North America in December 2012. Tom has received universal praise for his performance, in particular: \"What a debut, too, from Tom Holland as the eldest of their three lads\" (The Telegraph); \"Tom Holland, making one of the finest feature debuts in years\" (HeyUGuys); \"the excellent Tom Holland\" (The Guardian); \"The child performers are uncanny and there is an especially terrific performance from Tom Holland as the resourceful, levelheaded Lucas terrified but tenacious in the face of an unspeakable ordeal\" (Screen Daily); \"Young Holland in particular is astonishingly good as the terrified but courageous Lucas.\" (The Hollywood Reporter); \"However, the real acting standout in The Impossible is the performance of Tom Holland as the eldest son Lucas. His portrayal is genuine, and at no moment does it feel melodramatic and forced. The majority of his scenes are separate from the lead actors and for the most part it feels like The Impossible is Holland's film\" (Entertainment Maven); \"Mr. Holland, meanwhile, matures before our eyes, navigating the passage from adolescent self-absorption to profound and terrible responsibility. He is a terrific young actor\" (New York Times). Tom has given a number of interviews about his role in The Impossible. In particular, he talked on video to Vanity Fair Senior West Coast editor Krista Smith and with IAMROGUE's Managing Editor Jami Philbrick. He has also given interviews to The Hollywood Reporter,[32] to the MovieWeb, to Today Show on NBC and to other outlets. Tom's director and co-stars have also talked about him. Juan Antonio Bayona: \"He had this extraordinary ability to get into the emotion and portray it in a very, very easy way. The best I'd ever seen in a kid.\" Ewan McGregor: \"It was wonderful watching Tom who had never worked in front of a camera before, to see him really get it and grow as a film actor as he went along. He's really talented and polite to everyone. It's very easy for children to lose perspective but he's absolutely on the right road and a brilliant actor.\" Naomi Watts: \"He has an incredible emotional instrument and an unbelievable sense of himself... Tom Holland and I had a couple of moments where we came together and I could just tell how wonderful he was and what a beautiful instrument he had. It was just easy to work with him, that was one of the greatest highlights for me: discovering a friendship with Tom off-screen and this beautiful relationship between mother and son on-screen. The intimacy that develops through the course of the film between Lucas and Maria, I just loved that relationship. I mean, Tom is a beyond gifted actor. He's just a raw, open talent that is just so easy to work with. And Tom, he's inspiring, he kind of lifts everyone's game around him because he can do nothing but tell the truth. He was great.\" In his turn, Tom Holland has returned favours to Naomi Watts when he was asked to present Desert Palm Achievement Award to her at Palm Springs International Film Festival. According to HitFix: \"One recurring theme of the night was how the introductions were often better than actual winner's speeches... The best intro, however, had to go to 16-year-old Tom Holland who intro'd his \"Impossible\" co-star Watts. Holland admitted of all of Watts' great performances his dad had only let him see \"King Kong\" and while they spent six weeks shooting in a water tank he didn't know it was \"difficult\" because he actually \"loved it\"... Most important, this was Holland's first film role and he sweetly noted, \"From the moment I met you, you took my hand and you never let go.\" Cue the \"awwww\" from the audience.\" The presentation is available on video. In 2011, Holland was cast in British version of the animation film Arrietty, produced by Japan's cult Studio Ghibli. He has provided voice over for the principal character Sho. In 2012 Tom Holland played the starring role of Isaac in the film \"How I lived Now\"[44] (directed by Kevin Macdonald) alongside Saoirse Ronan. The film is due to be released in 2013. [edit]Awards, nominations and affiliations On 17 October 2012, Holland became a recipient of Hollywood Spotlight Award for his role in The Impossible. \"We are very excited that we will be able to recognize acting talents that are on the road to discovery and stardom,\" said Carlos de Abreu, founder and executive director of the Hollywood Film Awards in a statement. On 6 December 2012 it was announced that Holland became a winner of the National Board of Review award in the \"Breakthrough Actor\" category. In the end of December 2012, Holland was voted a winner for the year's Best Youth Performance in Nevada Critics Awards. In December 2012, Holland received a number of nominations (pending) for his role in The Impossible: for the 18th annual Critics' Choice Movie Awards, in the \"Best Young Acror/Acress\" category; for Chicago Film Critics Association Awards 2012 in the \"Most Promising Performer\" category; for the 27th Goya Awards in the \"Best New Actor\" category; for the Washington D.C. Area Film Critics Association Awards 2012 in the \"Best Youth Performance\" category; for the London Film Critics Circle Awards 2012 in the \"Young British Performer of the Year\" category. Kristopher Tapley, Editor-at-Large of HitFix, reported on 27 August 2012 that Summit Entertainment, the company responsible for distribution of The Impossible in USA, would be campaigning Holland rather than McGregor as the lead, and strongly argued that Tom Holland deserved to be nominated for an Academy Award in the Best Actor category. The fact of long-listing for an Academy Award was confirmed in the article in the Hollywood Reporter: \"And though McGregor stars as his father in the film, Holland has been submitted as the lead actor for awards consideration. Regardless if he receives any nominations, his performance as the strong-willed and determined eldest son is garnering critical acclaim.\" As one of the most promising young actors, Holland was featured in Screen International's \"UK Stars of Tomorrow - 2012\" and in Variety's \"Youth Impact Report 2012\". Holland has been signed up by William Morris Endeavor (WME) global talent agency and is represented by Curtis Brown literary and talent agency. In 2015, Tom was cast as Peter Parker/Spider-Man in Sony and Marvel's upcoming films. He will play the role starting with Captain America: Civil War (2016) and the Spider-Man: Homecoming (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NzY1NzUzNzJeQTJeQWpwZ15BbWU4MDczMDcyMzgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4043618","name":"Tom Holland","idIMDB":"nm4043618"},"actorId":"nm4043618","character":"Peter Parker / Spider-Man","urlCharacter":"http://www.imdb.com/character/ch0188706","main":true},{"actorName":"Daniel Brühl","urlProfile":"http://www.imdb.com/name/nm0117709","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNzA0NjYxMF5BMl5BanBnXkFtZTgwOTQyNDU5NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1978","placeOfBirth":" Barcelona, Barcelona, Catalonia, Spain","birthName":"Daniel César Martín Brühl González Domingo","height":"5' 9¼\" (1.76 m)","bio":"Daniel Brühl was born in Barcelona, Spain. His father was German TV director Hanno Brühl (1937-2010), who was born in São Paulo, Brazil. His Spanish mother was a teacher. He also has a brother and a sister, Oliver and Miriam. Shortly after his birth, his family moved to Cologne, Germany, where he grew up and attended the Dreikönigsgymnasium. Brought up in a fully multilingual home, he speaks fluent German, English, Portuguese, Spanish, French and Catalan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNzA0NjYxMF5BMl5BanBnXkFtZTgwOTQyNDU5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0117709","name":"Daniel Brühl","idIMDB":"nm0117709"},"actorId":"nm0117709","character":"Zemo","urlCharacter":"http://www.imdb.com/character/ch0050435","main":true},{"actorName":"Frank Grillo","urlProfile":"http://www.imdb.com/name/nm0342029","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTk3Nzc4OF5BMl5BanBnXkFtZTcwNDcwNTA1Mw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1965","placeOfBirth":" New York City, New York, USA","birthName":"Frank Anthony Grillo","height":"5' 10½\" (1.79 m)","bio":"The oldest of three children, Frank Grillo was born in New York City, to an Italian-American family. He grew up in upstate New York, and got his first taste of acting in high school where he was in many plays. Frank was also a gifted athlete and his dream was to play sports professionally. Frank graduated from New York University with a business degree.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTk3Nzc4OF5BMl5BanBnXkFtZTcwNDcwNTA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342029","name":"Frank Grillo","nicknames":["Kiki"],"idIMDB":"nm0342029"},"actorId":"nm0342029","character":"Brock Rumlow / Crossbones","urlCharacter":"http://www.imdb.com/character/ch0351510","main":true}],"seasons":[],"idIMDB":"tt3498820","urlIMDB":"http://www.imdb.com/title/tt3498820","business":{"budget":{"money":"$250,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$179,139,142","country":"USA","day":"08","month":"05","year":"2016","remarks":"4,226 Screens"},{"money":"€4,738,514","country":"Italy","day":"08","month":"05","year":"2016","remarks":"969 Screens"},{"money":"€1,002,642","country":"Italy","day":"04","month":"05","year":"2016","remarks":""},{"money":"$9,573,414","country":"Russia","day":"09","month":"05","year":"2016","remarks":"2,549 Screens"}],"gross":[{"money":"$408,060,083","country":"USA","day":"11","month":"09","year":"2016","remarks":""},{"money":"$407,831,122","country":"USA","day":"28","month":"08","year":"2016","remarks":""},{"money":"$407,197,282","country":"USA","day":"07","month":"08","year":"2016","remarks":""},{"money":"$407,050,096","country":"USA","day":"05","month":"08","year":"2016","remarks":""},{"money":"$406,990,096","country":"USA","day":"04","month":"08","year":"2016","remarks":""},{"money":"$406,979,570","country":"USA","day":"03","month":"08","year":"2016","remarks":""},{"money":"$406,573,683","country":"USA","day":"17","month":"07","year":"2016","remarks":""},{"money":"$406,226,381","country":"USA","day":"10","month":"07","year":"2016","remarks":""},{"money":"$403,857,288","country":"USA","day":"26","month":"06","year":"2016","remarks":""},{"money":"$401,312,591","country":"USA","day":"19","month":"06","year":"2016","remarks":""},{"money":"$396,871,490","country":"USA","day":"12","month":"06","year":"2016","remarks":""},{"money":"$389,178,636","country":"USA","day":"05","month":"06","year":"2016","remarks":""},{"money":"$380,230,868","country":"USA","day":"03","month":"06","year":"2016","remarks":""},{"money":"$372,610,948","country":"USA","day":"29","month":"05","year":"2016","remarks":""},{"money":"$347,215,892","country":"USA","day":"22","month":"05","year":"2016","remarks":""},{"money":"$295,966,220","country":"USA","day":"15","month":"05","year":"2016","remarks":""},{"money":"$179,139,142","country":"USA","day":"08","month":"05","year":"2016","remarks":""},{"money":"$1,153,296,293","country":"Worldwide","day":"22","month":"09","year":"2016","remarks":""},{"money":"$1,151,586,514","country":"Worldwide","day":"05","month":"08","year":"2016","remarks":""},{"money":"$1,151,526,514","country":"Worldwide","day":"04","month":"08","year":"2016","remarks":""},{"money":"$1,151,515,988","country":"Worldwide","day":"03","month":"08","year":"2016","remarks":""},{"money":"$1,113,330,868","country":"Worldwide","day":"03","month":"06","year":"2016","remarks":""},{"money":"$678,391,000","country":"Worldwide","day":"09","month":"05","year":"2016","remarks":""},{"money":"$744,536,418","country":"Non-USA","day":"31","month":"07","year":"2016","remarks":""},{"money":"$84,000,000","country":"Non-USA","day":"30","month":"04","year":"2016","remarks":""},{"money":"€11,184,102","country":"Italy","day":"05","month":"06","year":"2016","remarks":""},{"money":"€10,990,398","country":"Italy","day":"29","month":"05","year":"2016","remarks":""},{"money":"€10,590,182","country":"Italy","day":"22","month":"05","year":"2016","remarks":""},{"money":"€9,455,913","country":"Italy","day":"15","month":"05","year":"2016","remarks":""},{"money":"€5,771,529","country":"Italy","day":"08","month":"05","year":"2016","remarks":""},{"money":"$1,345,508","country":"Portugal","day":"03","month":"06","year":"2016","remarks":""},{"money":"$16,813,618 (Russia)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$24,940","country":"USA","day":"11","month":"09","year":"2016","remarks":"54 Screens"},{"money":"$83,958","country":"USA","day":"28","month":"08","year":"2016","remarks":"93 Screens"},{"money":"$207,186","country":"USA","day":"07","month":"08","year":"2016","remarks":"174 Screens"},{"money":"$179,489","country":"USA","day":"17","month":"07","year":"2016","remarks":"184 Screens"},{"money":"$293,217","country":"USA","day":"10","month":"07","year":"2016","remarks":"238 Screens"},{"money":"$1,368,558","country":"USA","day":"26","month":"06","year":"2016","remarks":"753 Screens"},{"money":"$2,331,622","country":"USA","day":"19","month":"06","year":"2016","remarks":"1,434 Screens"},{"money":"$4,314,343","country":"USA","day":"12","month":"06","year":"2016","remarks":"2,101 Screens"},{"money":"$7,829,479","country":"USA","day":"05","month":"06","year":"2016","remarks":"3,084 Screens"},{"money":"$15,135,000","country":"USA","day":"29","month":"05","year":"2016","remarks":"3,395 Screens"},{"money":"$32,939,739","country":"USA","day":"22","month":"05","year":"2016","remarks":"4,226 Screens"},{"money":"$72,637,142","country":"USA","day":"15","month":"05","year":"2016","remarks":"4,226 Screens"},{"money":"$179,139,142","country":"USA","day":"08","month":"05","year":"2016","remarks":"4,226 Screens"},{"money":"€130,366","country":"Italy","day":"05","month":"06","year":"2016","remarks":"65 Screens"},{"money":"€255,462","country":"Italy","day":"29","month":"05","year":"2016","remarks":"203 Screens"},{"money":"€622,091","country":"Italy","day":"22","month":"05","year":"2016","remarks":"498 Screens"},{"money":"€2,300,359","country":"Italy","day":"15","month":"05","year":"2016","remarks":"858 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"30","month":"04","year":"2015","remarks":null},{"money":null,"country":null,"day":"22","month":"08","year":"2015","remarks":null}],"copyrightHolder":"© 2016 MARVEL"},"technical":{"runtime":["2 hr 27 min (147 min)"],"soundMix":["Dolby Atmos","12-Track Digital Sound (IMAX 12 track)","Dolby Digital","IMAX 6-Track","Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["1.90 : 1 (IMAX version: airport sequence)","2.35 : 1"],"camera":["Arri Alexa 65, Hasselblad Prime 65 Lenses (some scenes)","Arri Alexa IMAX, Hasselblad Prime 65 Lenses (some scenes)","Arri Alexa XT Plus, Panavision C-, E-, G-, T-Series, ATZ and AWZ2 Lenses","GoPro Hero 4 Black","Red Epic Dragon, Panavision G-Series Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["Codex","Redcode RAW (6K)"],"cinematographicProcess":["ARRIRAW (2.8K) (6.5K) (source format)","Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["D-Cinema (also 3-D version)"]},"rating":"7,9","metascore":"75","filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"rated":"PG-13","awards":[{"award":"Screen Actors Guild Awards 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Action Performance by a Stunt Ensemble in a Motion Picture","names":[{"name":"Keith Adams","id":"nm0011121","role":null},{"name":"Chris Jai Alex","id":"nm2213461","role":null},{"name":"Raven-Danielle Baker","id":"nm5229198","role":null},{"name":"Sala Baker","id":"nm1019674","role":null},{"name":"Joanna Bennett","id":"nm4131057","role":null},{"name":"Daniel Bernhardt","id":"nm0076780","role":null},{"name":"Richard L. Blackwell","id":"nm0085949","role":null},{"name":"Shellita Boxie","id":"nm2191224","role":null},{"name":"Jeanette Branch","id":"nm1505294","role":null},{"name":"David E. Brown","id":"nm2248109","role":null},{"name":"Dartenea Bryant","id":"nm1051000","role":null},{"name":"Jwaundace Candece","id":"nm1330195","role":null},{"name":"Shane Cardwell","id":"nm0129787","role":null},{"name":"Vonzell Carter","id":"nm2605366","role":null},{"name":"Kevin Cassidy","id":"nm0144213","role":null},{"name":"Richard Cetrone","id":"nm0149150","role":null},{"name":"Fernando Chien","id":"nm0157312","role":null},{"name":"Alvin Chon","id":"nm5019426","role":null},{"name":"Jason Chu","id":"nm6225783","role":null},{"name":"Tye Claybrook Jr.","id":"nm5703979","role":null},{"name":"Doug Coleman","id":"nm0171018","role":null},{"name":"Stephen Conroy","id":"nm4806678","role":null},{"name":"Brandon Cornell","id":"nm3615599","role":null},{"name":"Brycen Counts","id":"nm0183618","role":null},{"name":"Lateef Crowder","id":"nm1956628","role":null},{"name":"Wally Crowder","id":"nm0189593","role":null},{"name":"Thomas Joseph Culler","id":"nm5138287","role":null},{"name":"Phil Culotta","id":"nm0191622","role":null},{"name":"Chris Daniels","id":"nm0199817","role":null},{"name":"Jaeson M. Daniels","id":"nm6723567","role":null},{"name":"Gui DaSilva-Greene","id":"nm5302031","role":null},{"name":"Elizabeth Davidovich","id":"nm2551144","role":null},{"name":"Keith Splinter Davis","id":"nm0204952","role":null},{"name":"Kent De Mond","id":"nm4939828","role":null},{"name":"Julius Denem","id":"nm2288442","role":null},{"name":"Thomas Dewier","id":"nm0223172","role":null},{"name":"Holland Diaz","id":"nm2187079","role":null},{"name":"Arturo Dickey","id":"nm1158795","role":null},{"name":"Josh Diogo","id":"nm2528649","role":null},{"name":"Alyma Dorsey","id":"nm5219486","role":null},{"name":"Kevin Dyer","id":"nm5843053","role":null},{"name":"Richard Epper","id":"nm0258351","role":null},{"name":"John Escobar","id":"nm0260319","role":null},{"name":"Guy Fernandez","id":"nm3989668","role":null},{"name":"Glenn Foster","id":"nm0287824","role":null},{"name":"Monique Ganderton","id":"nm1244650","role":null},{"name":"Mickey Giacomazzi","id":"nm0316010","role":null},{"name":"Andy Gill","id":"nm0318617","role":null},{"name":"Austin Gill","id":"nm1401381","role":null},{"name":"Jack Gill","id":"nm0318678","role":null},{"name":"Garrett Hammond","id":"nm2467517","role":null},{"name":"Daniel Hargrave","id":"nm5045679","role":null},{"name":"Kandis Hargrave","id":"nm8191717","role":null},{"name":"Sam Hargrave","id":"nm1092087","role":null},{"name":"Regis Harrington","id":"nm1571691","role":null},{"name":"Thayr Harris","id":"nm2401762","role":null},{"name":"Jimmy Hart","id":"nm1097170","role":null},{"name":"Alexander Hashioka Oatfield","id":"nm3246603","role":null},{"name":"Nicholas Hayner","id":"nm6227408","role":null},{"name":"Randy Haynie","id":"nm3022920","role":null},{"name":"Adrian Hein","id":"nm1653175","role":null},{"name":"Zac Henry","id":"nm1597946","role":null},{"name":"Nate Hitpas","id":"nm5508206","role":null},{"name":"Jermaine Holt","id":"nm1627137","role":null},{"name":"Crystal Hooks","id":"nm4492345","role":null},{"name":"Damita Jane Howard","id":"nm3180152","role":null},{"name":"David Hugghins","id":"nm0400374","role":null},{"name":"Jacob Hugghins","id":"nm4998801","role":null},{"name":"Michael Hugghins","id":"nm1299992","role":null},{"name":"Tony Hugghins","id":"nm0400375","role":null},{"name":"Scott Hunter","id":"nm4230389","role":null},{"name":"Duke Jackson","id":"nm0413409","role":null},{"name":"Reggie Jackson","id":"nm1844357","role":null},{"name":"Zee James","id":"nm1995523","role":null},{"name":"Precious Jenkins","id":"nm2266889","role":null},{"name":"Bobby Jordan","id":"nm2468436","role":null},{"name":"Courtney Julien","id":"nm4384994","role":null},{"name":"Antal Kalik","id":"nm2760215","role":null},{"name":"Steve Kelso","id":"nm0447086","role":null},{"name":"Umar Khan","id":"nm5418135","role":null},{"name":"Henry Kingi Jr.","id":"nm0455436","role":null},{"name":"Henry Kingi","id":"nm0455437","role":null},{"name":"Horace Knight","id":"nm0460925","role":null},{"name":"Ralf Koch","id":"nm1241615","role":null},{"name":"Efka Kvaraciejus","id":"nm2788450","role":null},{"name":"Bethany Levy","id":"nm2988896","role":null},{"name":"Cheryl Lewis","id":"nm1647880","role":null},{"name":"Jalil Jay Lynch","id":"nm0528324","role":null},{"name":"Jeremy Marinas","id":"nm3425146","role":null},{"name":"Hans Marrero","id":"nm3450086","role":null},{"name":"Maggie Macdonald","id":"nm4011539","role":null},{"name":"Kyle Mclean","id":"nm4869106","role":null},{"name":"Sarah Molasky","id":"nm4651703","role":null},{"name":"Heidi Moneymaker","id":"nm1355942","role":null},{"name":"Spencer Mulligan","id":"nm5197336","role":null},{"name":"Robert Nagle","id":"nm1103524","role":null},{"name":"Niko Nedyalkov","id":"nm2706049","role":null},{"name":"Phi-Long Nguyen","id":"nm0629071","role":null},{"name":"Dan B. Norris","id":"nm3571476","role":null},{"name":"Marque Ohmes","id":"nm1958803","role":null},{"name":"Eric Oram","id":"nm0649309","role":null},{"name":"Jane Oshita","id":"nm0651932","role":null},{"name":"Allan Padelford","id":"nm0655634","role":null},{"name":"Travis Parker","id":"nm5942663","role":null},{"name":"Denney Pierce","id":"nm0682334","role":null},{"name":"Damion Poitier","id":"nm1364280","role":null},{"name":"Austin Priester","id":"nm0697351","role":null},{"name":"Brian A. Prince","id":"nm8413636","role":null},{"name":"Spiro Razatos","id":"nm0713610","role":null},{"name":"Sarah Reagin","id":"nm3841826","role":null},{"name":"Greg Rementer","id":"nm4609551","role":null},{"name":"Antjuan Rhames","id":"nm8413637","role":null},{"name":"Jimmy N. Roberts","id":"nm0731243","role":null},{"name":"Todd Rogers Terry","id":"nm0856087","role":null},{"name":"Marvin Ross","id":"nm6922607","role":null},{"name":"Maya Santandrea","id":"nm5059887","role":null},{"name":"R. Matthew Scheib","id":"nm7003750","role":null},{"name":"Jordan Scott","id":"nm6937394","role":null},{"name":"Josh Seifert","id":"nm2259454","role":null},{"name":"John J. Shim","id":"nm5522502","role":null},{"name":"Brian Simpson","id":"nm0800923","role":null},{"name":"Buddy Sosthand","id":"nm0815383","role":null},{"name":"Jackson Spidell","id":"nm2144533","role":null},{"name":"Scott Sproule","id":"nm0819837","role":null},{"name":"Daniel Stevens","id":"nm1174894","role":null},{"name":"Larnell Stovall","id":"nm1277586","role":null},{"name":"Eric Stratemeier","id":"nm4067499","role":null},{"name":"Justin Sundquist","id":"nm0839354","role":null},{"name":"C.C. Taylor","id":"nm0852084","role":null},{"name":"Nancy Thurston","id":"nm0862260","role":null},{"name":"Aaron Toney","id":"nm1987604","role":null},{"name":"Amy Lynn Tuttle","id":"nm2102288","role":null},{"name":"Eric VanArsdale","id":"nm2735414","role":null},{"name":"Mark Aaron Wagner","id":"nm0906010","role":null},{"name":"Jennifer White","id":"nm5719937","role":null},{"name":"Joe Williams","id":"nm2784402","role":null},{"name":"Scheryl W Brown","id":"nm4166642","role":null},{"name":"Dante Ha","id":"nm4010586","role":null},{"name":"Nico Woulard","id":"nm0941888","role":null},{"name":"Kofi Yiadom","id":"nm1560081","role":null},{"name":"James Young","id":"nm5102057","role":null},{"name":"Justin Yu","id":"nm4055211","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Comic-to-Film Motion Picture","names":[]},{"category":"Best Director","names":[{"name":"Anthony Russo","id":"nm0751577","role":null},{"name":"Joe Russo","id":"nm0751648","role":null}]},{"category":"Best Actor","names":[{"name":"Chris Evans","id":"nm0262635","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Chadwick Boseman","id":"nm1569276","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]},{"category":"Best Performance by a Younger Actor","names":[{"name":"Tom Holland","id":"nm4043618","role":null}]},{"category":"Best Production Design","names":[{"name":"Owen Paterson","id":"nm0665517","role":null}]},{"category":"Best Editing","names":[{"name":"Jeffrey Ford","id":"nm0285701","role":null},{"name":"Matthew Schmidt","id":"nm0773113","role":null}]}]}]},{"award":"Annie Awards 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Outstanding Achievement in Character Animation in a Live Action Production","names":[{"name":"Steve Rawlins","id":"nm1603114","role":null},{"name":"Ebrahim Jahromi","id":"nm3830227","role":null},{"name":"Cedric Lo","id":"nm3110752","role":null},{"name":"Stephen King","id":"nm1747113","role":null},{"name":"Yair Gutierrez","id":"nm8639369","role":null}]}]}]},{"award":"Awards Circuit Community Awards 2016","titlesAwards":[{"titleAwardOutcome":"2nd place ACCA","categories":[{"category":"Best Stunt Ensemble","names":[]}]},{"titleAwardOutcome":"Nominated ACCA","categories":[{"category":"Best Visual Effects","names":[{"name":"Dan DeLeeuw","id":"nm0216699","role":null},{"name":"Daniel Sudick","id":"nm0837203","role":null},{"name":"Russell Earl","id":"nm0247270","role":null},{"name":"Greg Steele","id":"nm0824555","role":null}]}]}]},{"award":"Broadcast Film Critics Association Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Action Movie","names":[]},{"category":"Best Actor in an Action Movie","names":[{"name":"Chris Evans","id":"nm0262635","role":null}]},{"category":"Best Actress in an Action Movie","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]}]}]},{"award":"Empire Awards, UK 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Thriller","names":[{"name":"Marvel Studios","id":null,"role":null},{"name":"Walt Disney Studios Motion Pictures","id":null,"role":null}]},{"category":"Best Male Newcomer","names":[{"name":"Tom Holland","id":"nm4043618","role":null}]},{"category":"Best Costume Design","names":[{"name":"Marvel Studios","id":null,"role":null},{"name":"Walt Disney Studios Motion Pictures","id":null,"role":null}]},{"category":"Best Visual Effects","names":[{"name":"Marvel Studios","id":null,"role":null},{"name":"Walt Disney Studios Home Entertainment","id":null,"role":null}]}]}]},{"award":"Golden Schmoes Awards 2016","titlesAwards":[{"titleAwardOutcome":"Won Golden Schmoes","categories":[{"category":"Breakthrough Performance of the Year","names":[{"name":"Tom Holland","id":"nm4043618","role":null}]},{"category":"Best Action Sequence of the Year","names":[]}]},{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Favorite Movie of the Year","names":[]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Most Overrated Movie of the Year","names":[]},{"category":"Best Special Effects of the Year","names":[]},{"category":"Coolest Character of the Year","names":[]},{"category":"Coolest Character of the Year","names":[]},{"category":"Best DVD/Blu-Ray of the Year","names":[]},{"category":"Most Memorable Scene in a Movie","names":[]},{"category":"Best Trailer of the Year","names":[]}]}]},{"award":"Guild of Music Supervisors Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated GMS Award","categories":[{"category":"Best Music Supervision for Trailers","names":[{"name":"Sanaz Lavaedian","id":"nm3944234","role":null}]}]}]},{"award":"Hollywood Post Alliance, US 2016","titlesAwards":[{"titleAwardOutcome":"Nominated HPA Awards","categories":[{"category":"Outstanding Visual Effects - Feature Film","names":[{"name":"Russell Earl","id":"nm0247270","role":null},{"name":"François Lambert","id":"nm0483144","role":null},{"name":"Steve Rawlins","id":"nm1603114","role":null},{"name":"Pat Conran","id":"nm0175778","role":null},{"name":"Rhys Claringbull","id":"nm2606524","role":null}]},{"category":"Outstanding Visual Effects - Feature Film","names":[{"name":"Russell Earl","id":"nm0247270","role":"visual effects supervisor"},{"name":"Steve Rawlins","id":"nm1603114","role":"animation supervisor"},{"name":"François Lambert","id":"nm0483144","role":"compositing supervisor"},{"name":"Pat Conran","id":"nm0175778","role":"cg supervisor"},{"name":"Rhys Claringbull","id":"nm2606524","role":"cg lead artist"},{"name":"Industrial Light & Magic (ILM)","id":null,"role":null}]}]}]},{"award":"Image Awards 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Supporting Actor in a Motion Picture","names":[{"name":"Chadwick Boseman","id":"nm1569276","role":null}]},{"category":"Outstanding Directing in a Motion Picture (Film)","names":[{"name":"Anthony Russo","id":"nm0751577","role":null},{"name":"Joe Russo","id":"nm0751648","role":null}]}]}]},{"award":"Jupiter Award 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Jupiter Award","categories":[{"category":"Best International Actress","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]},{"category":"Best International Film","names":[]}]}]},{"award":"Kids' Choice Awards, USA 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie","names":[{"name":"Marvel Studios","id":null,"role":null},{"name":"Walt Disney Studios Motion Pictures","id":null,"role":null}]},{"category":"Favorite Movie Actor","names":[{"name":"Chris Evans","id":"nm0262635","role":null}]},{"category":"Favorite Movie Actor","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]},{"category":"Favorite Movie Actress","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]},{"category":"Favorite Butt Kicker","names":[{"name":"Chris Evans","id":"nm0262635","role":null}]},{"category":"Favorite Butt Kicker","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]},{"category":"Favorite Frenemies","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null},{"name":"Chris Evans","id":"nm0262635","role":null}]},{"category":"#SQUAD","names":[{"name":"Chris Evans","id":"nm0262635","role":null},{"name":"Robert Downey Jr.","id":"nm0000375","role":null},{"name":"Sebastian Stan","id":"nm1659221","role":null},{"name":"Scarlett Johansson","id":"nm0424060","role":null},{"name":"Anthony Mackie","id":"nm1107001","role":null},{"name":"Don Cheadle","id":"nm0000332","role":null},{"name":"Chadwick Boseman","id":"nm1569276","role":null},{"name":"Jeremy Renner","id":"nm0719637","role":null}]}]}]},{"award":"Las Vegas Film Critics Society Awards 2016","titlesAwards":[{"titleAwardOutcome":"Won Sierra Award","categories":[{"category":"Best Action Film","names":[]}]}]},{"award":"Motion Picture Sound Editors, USA 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects and Foley in a Feature Film","names":[{"name":"Shannon Mills","id":"nm0590185","role":"supervising sound editor"},{"name":"Daniel Laurie","id":"nm0491392","role":"supervising sound editor"},{"name":"Jacob Riehle","id":"nm1418683","role":"foley editor"},{"name":"Nia Hansen","id":"nm3614489","role":"sound designer"},{"name":"David C. Hughes","id":"nm0400544","role":"sound designer"},{"name":"Josh Gold","id":"nm2236268","role":"sound effects editor"},{"name":"J.R. Grubbs","id":"nm0344197","role":"sound effects editor"},{"name":"Jeremy Bowker","id":"nm2840352","role":"sound effects editor"},{"name":"John Roesch","id":"nm0736430","role":"foley artist"},{"name":"Shelley Roden","id":"nm1400864","role":"foley artist"}]}]}]},{"award":"North Carolina Film Critics Association 2017","titlesAwards":[{"titleAwardOutcome":"Nominated NCFCA Award","categories":[{"category":"Best Special Effects","names":[]}]}]},{"award":"Online Film & Television Association 2017","titlesAwards":[{"titleAwardOutcome":"2nd place OFTA Film Award","categories":[{"category":"Best Stunt Coordination","names":[{"name":"Doug Coleman","id":"nm0171018","role":null},{"name":"Mickey Giacomazzi","id":"nm0316010","role":null},{"name":"Sam Hargrave","id":"nm1092087","role":null},{"name":"Spiro Razatos","id":"nm0713610","role":null},{"name":"James Young","id":"nm5102057","role":null}]}]},{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Movie Trailer","names":[]}]}]},{"award":"People's Choice Awards, USA 2017","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Movie","names":[]},{"category":"Favorite Action Movie","names":[]}]}]},{"award":"Phoenix Film Critics Society Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Visual Effects","names":[]}]}]},{"award":"Rondo Hatton Classic Horror Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Rondo Statuette","categories":[{"category":"Best Movie","names":[]}]}]},{"award":"Seattle Film Critics Awards 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Seattle Film Critics Award","categories":[{"category":"Best Visual Effects","names":[{"name":"Dan DeLeeuw","id":"nm0216699","role":null},{"name":"Daniel Sudick","id":"nm0837203","role":null},{"name":"Russell Earl","id":"nm0247270","role":null},{"name":"Greg Steele","id":"nm1636234","role":null}]}]}]},{"award":"St. Louis Film Critics Association, US 2016","titlesAwards":[{"titleAwardOutcome":"Won SLFCA Award","categories":[{"category":"Best Action Film","names":[]}]},{"titleAwardOutcome":"Nominated SLFCA Award","categories":[{"category":"Special Merit (for best scene, cinematic technique or other memorable aspect or moment)","names":[]}]}]},{"award":"Teen Choice Awards 2016","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Choice Movie: Sci-Fi/Fantasy","names":[]},{"category":"Choice Movie Actor: Sci-Fi/Fantasy","names":[{"name":"Chris Evans","id":"nm0262635","role":null}]}]},{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Scene Stealer","names":[{"name":"Chadwick Boseman","id":"nm1569276","role":null}]},{"category":"Choice Movie Actor: Sci-Fi/Fantasy","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]},{"category":"Choice Movie Actress: Sci-Fi/Fantasy","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]},{"category":"Choice Movie: Villain","names":[{"name":"Daniel Brühl","id":"nm0117709","role":null}]},{"category":"Choice Movie: Chemistry","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null},{"name":"Scarlett Johansson","id":"nm0424060","role":null},{"name":"Don Cheadle","id":"nm0000332","role":null},{"name":"Paul Bettany","id":"nm0079273","role":null},{"name":"Chadwick Boseman","id":"nm1569276","role":null}]},{"category":"Choice Movie: Chemistry","names":[{"name":"Chris Evans","id":"nm0262635","role":null},{"name":"Sebastian Stan","id":"nm1659221","role":null},{"name":"Anthony Mackie","id":"nm1107001","role":null},{"name":"Elizabeth Olsen","id":"nm0647634","role":null},{"name":"Jeremy Renner","id":"nm0719637","role":null}]},{"category":"Choice Movie: Liplock","names":[{"name":"Chris Evans","id":"nm0262635","role":null},{"name":"Emily VanCamp","id":"nm0885840","role":null}]}]}]}],"votes":"398 807","type":"Movie","companyCreditsSimple":[{"idCompany":"co0051941","name":"Marvel Studios"},{"idCompany":"co0592249","name":"Vita-Ray Dutch Productions (III)"},{"idCompany":"co0053177","name":"Studio Babelsberg"}],"keywords":{"keywords":["marvel cinematic universe","based on comic book","superhero","siberia","bucharest","friendship between men","character name in title","romania","based on comic","accountability","new york city","terrorist bombing","frozen body","black widow the character","disagreement","tragic past","eastern europe","scene after end credits","surprise during end credits","arm cut off","severed arm","prisoner","lack of trust","knife","returning character killed off","1990s","year 1991","death squad","torture","water torture","assassin","mercenary","cryogenics","mind control","brainwashing","media coverage","fugitive","on the run","framed for murder","frame up","rescue","escape","politics","stan lee cameo","ex soldier","world war two veteran","super soldier","africa","london england","vienna","leipzig","berlin","super powers","marvel comics","germany","russia","third part","sequel","captain","widow","king","leader","ant man","black panther","soldier","explosion","mission","murder","witch","widower","recruitment","super power","grudge","kiss","death of parents","lens flare","guilt","miniaturized man","miniaturized superhero","teenage superhero","tunnel chase scene","death of loved one","death of aunt","voice over letter","sentient android","villain arrested","origin of hero","hawkeye the character","english subtitles in original","open ended","bombing","superhero versus superhero","flying man","teenage boy","war machine the character","vision the character","black panther the character","falcon the character","reference to mark fuhrman","epic battle","female gunfighter","force field","waterfall","forest","rainforest","fictional country","ensemble cast","prince","high tech suit","flashlight","reference to youtube","crossover","notebook","solitary confinement","statue","elevator shaft","chess","infighting","robbery","biohazard","biological weapon","paranoia","fear","dark past","dark hero","surprise after end credits","dismemberment","aid worker","stabbed in the chest","social commentary","naval officer","scene during end credits","condominium","interracial friendship","abandoned factory","killing spree","jungle","shot through a door","kicking in a door","cooking","storm at sea","crushed by a car","black ops","scientist","anger","loss of father","loss of mother","orphan","murder of family","death of family","race against time","kitchen","invisibility","falling through the floor","house arrest","reference to star wars","abandoned building","van","shipping container","psychologist","friendship","pizza","disfigurement","power outage","electromagnetic pulse","bare chested male","watching tv","subterfuge","evacuation","hangar","letter","prison break","prison","submarine","u boat","u.s. navy","handcuffs","arrest","maximum security prison","underwater scene","drowning","hanging upside down","parking garage","bodyguard","spy","home invasion","church","funeral","hologram","massachusetts institute of technology","tracking device","fire","machete","threatened with a knife","henchman","hit by a truck","garbage truck","binoculars","rooftop","suicide attempt","suicide","suicide bomber","hand grenade","car bomb","explosive","character's point of view camera shot","subjective camera","leg brace","crash landing","fighting in the air","drone","laser","lasersight","electrocution","gadgetry","gadget","knocked out","2010s","flash forward","crashing through a window","jumping through a window","hostile takeover","interrogation","mountain","african","rampage","security guard","surveillance footage","surveillance","security camera","female agent","female spy","cia agent","cia","sleeper agent","booby trap","subterranean","post cold war","armory","assassination","laboratory","secret laboratory","jail cell","prison riot","prison fight","text messaging","cell phone","regret","abandoned prison","training","blizzard","snow","helicopter accident","airport","helicopter","airplane","maid","prologue","bilingualism","subtitled scene","exploding helicopter","exploding airplane","exploding truck","exploding building","exploding car","exploding body","news report","photograph","armored car","tank","foot chase","chase","car motorcycle chase","police car","fire truck","ambulance","police raid","police chase","car chase","car rollover","car accident","car crash","bathtub","master of disguise","disguise","impostor","mistaken identity","assumed identity","terrorist attack","terrorist plot","terrorist","terrorism","ambush","wisecrack humor","teamwork","leadership","opening action scene","moral dilemma","righteous rage","diplomat","united nations","secretary","double cross","kidnapping","blood","neck breaking","strangulation","levitation","honor","falling down stairs","commando unit","commando raid","special forces","swat team","motorcycle","stealing a car","bombardment","hit by a car","body landing on a car","piano","haunted by the past","father son relationship","american abroad","restaurant","bar","hotel","spiral staircase","falling from height","jumping from height","thrown from a car","wristwatch","sunglasses","pistol whip","disarming someone","apartment","aunt nephew relationship","giant","sabotage","ex convict","undercover","espionage","near death experience","colonel","lieutenant","accidental killing","man punches a woman","man fights a woman","woman kills a man","woman punches a man","woman fights a man","nosebleed","fighting","final showdown","final battle","showdown","fight to the death","black eye","hit in the crotch","mexican standoff","hostage","escape attempt","held at gunpoint","violence","death","hatred","brutality","corpse","shot in the forehead","shot in the head","kicked in the stomach","kicked in the face","punched in the face","punched in the chest","one man army","two against one","head butt","beating","slow motion scene","stylized violence","hand to hand combat","martial arts","mixed martial arts","brawl","fight","fistfight","shot to death","shot in the chest","missile","rocket","gas grenade","grenade launcher","rocket launcher","shotgun","gatling gun","ak 47","machine gun","uzi","pistol","combat","battlefield","battle","shootout","gunfight","blockbuster","anti villain","flashback","redemption","revenge","geopolitics","sinister","intrigue","suspense","revelation","female fighter","female warrior","tough girl","action heroine","warrior","tough guy","friend turned foe","billionaire","playboy","action hero","superhero team","coming out of retirement","bow and arrow","archery","archer","british actor playing american character","teenage hero","crime fighter","teenager","inventor","engineer","hypnosis","android","title at the end","no title at beginning","no opening credits","cameo","wings","costumed hero","masked hero","gas mask","face mask","masked man","shield","fireball","magic","former spy","war hero","transformation","irish","robot","artificial intelligence","manipulation","miniaturization","flying","bionic arm","metal arm","prosthetic limb","robot suit","telekinesis","superheroine","super strength","superhuman strength","supernatural power","russian","vienna austria","cleveland ohio","berlin germany","leipzig germany","bucharest romania","moscow russia","queens new york city","lagos nigeria","marvel entertainment","death of mother","death of father","surprise ending","bomb","unintended consequences","bus","tragic villain","coming of age","betrayal","deception","beaten to death"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:01:03"}}