{"data":{"movies":[{"title":"The Tree That Saved Christmas","originalTitle":"","year":"2014","releaseDate":"20141130","directors":[{"name":"David Winning","id":"nm0003941"}],"writers":[{"name":"Michael J. Murray","id":"nm0615181"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcwNzU4MTY1MF5BMl5BanBnXkFtZTgwODc3NzQ5MjE@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Drama"],"plot":"Molly Logan and Lucas Bishop were childhood friends and high school sweethearts in Danbury Falls, Vermont. Molly's family founded the town two hundred years ago, with her immediately family still living on the same property, where her parents, Gordon and Betty Logan, have continued the family business of operating a Christmas tree farm. Since they were children, Molly knew she wanted to become a writer, a dream which her parents supported. Lucas knew he wanted to become a photographer, something his banker father, Elliot Bishop, vehemently didn't allow him to pursue as a career, he believing only in guaranteed good paying careers like his own. Molly and Lucas broke up years ago when he would not follow her to New York, where they would have pursued their professional dreams. They have not seen each other since. After getting an MBA, Lucas returned to Danbury Falls to work at the bank. Molly works at a publishing house, where her recently widowed boss, Walter Dunlap, treats her more as...","simplePlot":"A woman travels to her Vermont hometown to save her family's Christmas tree farm from foreclosure.","actors":[{"actorName":"Lacey Chabert","urlProfile":"http://www.imdb.com/name/nm0000327","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1Nzc3NzAwMl5BMl5BanBnXkFtZTcwNzY1ODk0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1982","placeOfBirth":" Purvis, Mississippi, USA","birthName":"Lacey Nicole Chabert","height":"5' 2\" (1.57 m)","bio":"Lacey Nicole Chabert was born in Purvis, Mississippi, to Julie (Johnson) and Tony Chabert, a representative for an oil company. She is of Cajun (French), Italian, English, and Scottish ancestry. Chabert started in drama and music performances in and around her hometown in Mississippi from an early age, and was a finalist on Star Search (1983) in 1991. She gained her break in a cough syrup commercial, before successfully auditioning for the Broadway production of Les Miserables, where she played young Cosette for two years. Since then, she has been on a few television series, notably Party of Five (1994), a number of telemovies like Gypsy (1993), and her big-screen debut, Lost in Space (1998). Known for her natural acting skills and charming personality, her cotton candy voice has seen her record many advertising jingles, plus play parts in animated films and TV shows like Nickelodeon's The Wild Thornberrys (1998). A more than capable violinist, she enjoys various activities, especially shoe shopping, and she is particularly fond of Cajun cooking. As a result of her promising career, her family, including two sisters and a brother, have moved from Mississippi to California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1Nzc3NzAwMl5BMl5BanBnXkFtZTcwNzY1ODk0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000327","name":"Lacey Chabert","idIMDB":"nm0000327"},"actorId":"nm0000327","character":"Molly Logan","urlCharacter":"http://www.imdb.com/character/ch0417309","main":true},{"actorName":"Corey Sevier","urlProfile":"http://www.imdb.com/name/nm0786417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MDk4NTQ4NF5BMl5BanBnXkFtZTgwNjgyNDMwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1984","placeOfBirth":" Ajax, Ontario, Canada","birthName":"Corey Daniel Sevier","height":"6' 1\" (1.85 m)","bio":"Born in Ajax, Ontario, Corey's career in front of the camera began as a baby model at the tender age of six months. Modelling soon led to work in commercials. At seven years old, he landed his first acting job in the ABC mini-series \"Family Pictures\", alongside screen veterans Angelica Houston and Sam Neill. The experience convinced young Corey that he had found his passion. Corey's breakout came when he landed the role of \"Timmy\" in the 90's version of the prolific series, \"Lassie\". The show ran internationally for four seasons and earned him a Gemini nomination. Corey was a fairly prolific actor during his childhood. His first starring role in a feature film came in Disney's \"Summer of Monkeys\". The heartwarming family drama premiered at the Toronto International Film Festival and won a coveted Crystal Heart Award. Into his teens, Corey continued to work at a feverish pace, starring in four more consecutive series - the period drama \"Little Men\", where his work as streetwise \"Dan\" earned him back-to-back Los Angeles Youth Award nominations, the futuristic adventure series 2030 C.E., the WB's martial-art drama \"Black Sash\" and FOX's steamy Hawaii-set drama \"North Shore.\" His work in feature films included the period thriller \"Edge of Madness\", the psychological drama \"The Secret\" and the campy sci-fi franchise \"Decoys\". As an adult, Corey has appeared as a guest star in many well known series, including; Psych, CSI: Miami, Smallville, Motive, The Listener, Supernatural, Murdoch Mysteries, Wild Card and Twice in a Lifetime. He has also amassed an impressive list of film credits including; Immortals, The Lost Future, Apartment 1303, Age of the Dragons, Code Breakers, The Jazzman, Conduct Unbecoming, Awaken, A Star for Christmas and 5th & Alameda.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MDk4NTQ4NF5BMl5BanBnXkFtZTgwNjgyNDMwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0786417","name":"Corey Sevier","nicknames":["Cor"],"idIMDB":"nm0786417"},"actorId":"nm0786417","character":"Lucas Bishop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Kevin Anderson","urlProfile":"http://www.imdb.com/name/nm2254636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjM1NzBjNDUtZmQzNy00MDkyLThiYWItZGMwNzU4YTEyMzE0L2ltYWdlXkEyXkFqcGdeQXVyNDAwMjc5MzY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Matthew Kevin Anderson is an actor and writer, known for Impastor (2015), The Flash (2014) and Death Note (2017). He was previously married to Jewel Staite.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjM1NzBjNDUtZmQzNy00MDkyLThiYWItZGMwNzU4YTEyMzE0L2ltYWdlXkEyXkFqcGdeQXVyNDAwMjc5MzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2254636","name":"Matthew Kevin Anderson","idIMDB":"nm2254636"},"actorId":"nm2254636","character":"Ryan Logan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Thorburn","urlProfile":"http://www.imdb.com/name/nm0861184","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDM4NTI2OF5BMl5BanBnXkFtZTgwMDQyNjcxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jim was born in Halifax, Nova Scotia and raised in Calgary, Alberta. With his quiet demeanor, strong work ethic and exemplary talent this actor has proven to be a longstanding player in the entertainment industry, with a multidimensional career spanning over a decade. Growing up close to the Rocky Mountains, Jim trained to be an elite ski racer, competing at an international level until his early twenties. After retiring from ski racing Jim got a job working in the art and set decoration department on the massively successful Fox series \"The X-Files\". It was here he met Chris Carter and David Nutter who gave Jim his very first acting role on the groundbreaking Fox pilot \"Millennium\". Since then Jim has amassed an impressive resume, recurring for two seasons on Showcase's hit series \"Paradise Falls\", on the first season of the award winning Showcase series \"Blackstone\" and in a recurring guest star role on SyFy's hit thriller \"Helix\" as Caleb. Jim has guest starred on multiple shows including, FOX's \"Fringe\", The CW's \"Smallville\", USA's \"Psych\", CTV's \"Degrassi: The Next Generation\", CTV's \"Motive\" and CBC's \"Republic of Doyle\". SyFy also took note of his talents, casting him in \"Continuum\" and \"Merlin and the Book of Beasts\". His film credits include the feature film THE DEAL with Christian Slater and Selma Blair, the Ole Bordenal thriller THE POSSESSION with Jeffrey Dean Morgan and Kyra Sedgwick, and a lead role in THE TREE THAT SAVED CHRISTMAS with Lacey Chabert.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDM4NTI2OF5BMl5BanBnXkFtZTgwMDQyNjcxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0861184","name":"Jim Thorburn","idIMDB":"nm0861184"},"actorId":"nm0861184","character":"Walter Dunlap","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Keenleyside","urlProfile":"http://www.imdb.com/name/nm0444776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MDU3NDI0OF5BMl5BanBnXkFtZTcwMjA5OTgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1957","placeOfBirth":" St. Stephen, New Brunswick, Canada","height":"6' 2\" (1.88 m)","bio":"Born in St. Stephen, New Brunswick, he grew up in London, Ontario, with a year and a half in Brisbane, Australia. He apprenticed at the Stratford Festival after graduating from the University of Windsor. Now living near Vancouver, British Columbia, he and his wife, actress Peg Christopherson, became naturalized US citizens after living in Los Angeles and in upstate Washington for many years. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MDU3NDI0OF5BMl5BanBnXkFtZTcwMjA5OTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444776","name":"Eric Keenleyside","idIMDB":"nm0444776"},"actorId":"nm0444776","character":"Gordon Logan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lini Evans","urlProfile":"http://www.imdb.com/name/nm2546123","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjQyNTkzNV5BMl5BanBnXkFtZTgwMTE5MDU1MDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Born in Calgary, Alberta, Lini's career began after starring in her high school musical \"Grease\". She's a \"triple-threat\" acting, singing and dancing-around-languages like nobody's business. Performing internationally in 8 languages, she was scouted by a talent agent while onstage and soon after booked a U.S. national union TV commercial. Training followed, as did filming over 50 televised works. Lini's episodic TV debut was in late 2010 with Tom Welling and Erica Durance on Smallville (2001). Since then she has been featured acting opposite the leads of Arrow (2012), Fairly Legal (2011), Supernatural (2005), and more. Ironically, Lini's own family barely recognized her with dark brown eyes instead of her actual blue ones when she co-starred with Jorge Garcia and Sarah Jones in J.J. Abrams' Alcatraz (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjQyNTkzNV5BMl5BanBnXkFtZTgwMTE5MDU1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2546123","name":"Lini Evans","idIMDB":"nm2546123"},"actorId":"nm2546123","character":"Betty Logan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Kidnie","urlProfile":"http://www.imdb.com/name/nm0452308","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE3OWU0MGItMTExNC00ZjJlLWI3ZmYtYjc2YTczMjczOGM0XkEyXkFqcGdeQXVyMzgxMzA0NDU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"James Kidnie is an actor, known for Upside Down (2012), Mimic (1997) and The Crush (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE3OWU0MGItMTExNC00ZjJlLWI3ZmYtYjc2YTczMjczOGM0XkEyXkFqcGdeQXVyMzgxMzA0NDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452308","name":"James Kidnie","idIMDB":"nm0452308"},"actorId":"nm0452308","character":"Elliot Bishop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivia Steele Falconer","urlProfile":"http://www.imdb.com/name/nm4004498","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzM2MjAwN15BMl5BanBnXkFtZTgwNjg5MzIyNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Olivia Steele Falconer is an actress, known for Red Riding Hood (2011), The Client List (2010) and Crowsnest (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNzM2MjAwN15BMl5BanBnXkFtZTgwNjg5MzIyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4004498","name":"Olivia Steele Falconer","idIMDB":"nm4004498"},"actorId":"nm4004498","character":"Young Molly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darien Provost","urlProfile":"http://www.imdb.com/name/nm2661003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGExYzhlYzEtOTZmMS00MGZjLWE3MjktNjY2ZWY4ZDJkY2IzL2ltYWdlXkEyXkFqcGdeQXVyMTgzMzMyMzA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Darien Provost is an actor, known for The Day the Earth Stood Still (2008), Tooth Fairy (2010) and I Love You, Beth Cooper (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGExYzhlYzEtOTZmMS00MGZjLWE3MjktNjY2ZWY4ZDJkY2IzL2ltYWdlXkEyXkFqcGdeQXVyMTgzMzMyMzA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2661003","name":"Darien Provost","idIMDB":"nm2661003"},"actorId":"nm2661003","character":"Young Lucas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Holness","urlProfile":"http://www.imdb.com/name/nm0392228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTMxMTIzNl5BMl5BanBnXkFtZTcwMzc2MjE1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Karen Holness is an actress, known for Chicago (2002), Cashing In (2009) and Donovan's Echo (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTMxMTIzNl5BMl5BanBnXkFtZTcwMzc2MjE1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0392228","name":"Karen Holness","idIMDB":"nm0392228"},"actorId":"nm0392228","character":"Tara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yasmeene Ball","urlProfile":"http://www.imdb.com/name/nm6236385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzE4NDkwNV5BMl5BanBnXkFtZTgwOTY1NzgwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6¼\" (1.68 m)","bio":"Yasmeene Ball was born in Vancouver, BC, Canada (ancestry: English, Danish, Icelandic, German) Yasmeene expressed interest in drama at an early age and asked to pursue acting when she was 8.5 years old. She enjoys spending time on set while bringing to life a range of characters. Yasmeene is frequently described as an old soul with instincts and poise beyond her years. When Yasmeene isn't acting she is hanging out with her family and friends; she competes in high level soccer and field hockey; she also loves golfing, horseback riding, swimming, bike riding, singing and is an avid reader. Yasmeene believes strongly in giving back to the community and offers ongoing support to BC Children's Hospital, Animal Rescues and Charities. In the future, Yasmeene hopes to work with Emma Watson, Natalie Portman, Stanley Tucci, Saoirse Ronan, Jennifer Lawrence, Meryl Streep and Leonardo DiCaprio - with whom she wholeheartedly admires and shares a commitment to the craft of acting. Yasmeene Ball is represented by Jennifer Paterson at KC Talent; and Bryan Brucks at Luber Roklin Entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzE4NDkwNV5BMl5BanBnXkFtZTgwOTY1NzgwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6236385","name":"Yasmeene Ball","idIMDB":"nm6236385"},"actorId":"nm6236385","character":"Victoria Dunlap","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alisha Newton","urlProfile":"http://www.imdb.com/name/nm3851019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA3MTc4MF5BMl5BanBnXkFtZTgwNjA0MDE2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 2001","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 4\" (1.63 m)","bio":"Despite her young age, actress Alisha Newton has been appearing in commercials, TV, and film for over a decade. Her first big role came as a series regular for a CW/Warner Bros. pilot ,\"The Wyoming Story\". Immediately following she filmed a spot on the popular television series, \"Supernatural\". Alisha began regular training and played several leads in some independent films before making her big screen debut in Twentieth Century Fox's \"Percy Jackson - Sea of Monsters\" where she played 'Young Annabeth', - young Alexandra Daddario. Currently, Alisha has a lead role on the CBC hit drama series \"Heartland\". She joined the cast at age 10 and over the past 4 seasons of the show, fans have had the pleasure of watching her grow up on screen. Alisha plays the dynamic role of a strong, courageous, yet vulnerable young teen \"Georgie\", who has spent her formative years in and out of foster homes before finding herself at Heartland Ranch. When \"Heartland\" is not in production, Alisha takes on other interesting acting projects. Recently she can be seen in the TV movie, \"The Tree That Saved Christmas\", the TV series \"When Calls The Heart\", and most recently in a horror for SyFy called \"The Hollow\". A talent described as natural, intuitive and professional, Alisha is well respected for her strong and compelling performances. She has starred in a variety of challenging and diverse roles and has been acknowledged and honored with several nominations and awards. In 2013 she won at the Young Artist Awards in Los Angeles for Best Performance in a TV Series for her role as Georgie on \"Heartland\" and was also nominated for 'Best Newcomer' at the prestigious UBCP/Actra Awards for the same role. In 2014 she received another nomination for her role as Georgie at the Young Artists Awards and a win for the same role at the Joey Awards Canada. Alisha has just received a 2015 Joey Award nomination for her work on Heartland. Alisha is very passionate about horses and prefers to spend her spare time at the barn with her horse Aflame. She is an accomplished rider in both English and Western disciplines, but is currently focused on jumping and horsemanship and has aspirations to eventually get into three-day eventing. When not on set or at the barn, Alisha enjoys hanging out with friends and family and working on agility with her Australian Shepherd Zoey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA3MTc4MF5BMl5BanBnXkFtZTgwNjA0MDE2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3851019","name":"Alisha Newton","idIMDB":"nm3851019"},"actorId":"nm3851019","character":"Sofia Dunlap","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christina Jastrzembska","urlProfile":"http://www.imdb.com/name/nm0419363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MzU4OTcxNV5BMl5BanBnXkFtZTgwMzA3MjY1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Christina Jastrzembska is an actress, known for The Twilight Saga: New Moon (2009), Final Destination 2 (2003) and Warcraft: The Beginning (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MzU4OTcxNV5BMl5BanBnXkFtZTgwMzA3MjY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419363","name":"Christina Jastrzembska","idIMDB":"nm0419363"},"actorId":"nm0419363","character":"Cassie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Wattley","urlProfile":"http://www.imdb.com/name/nm0915084","urlPhoto":"","biography":{"height":"6' 2\" (1.88 m)","bio":"Danny Wattley is an actor and producer, known for Watchmen (2009), Kindergarten Cop 2 (2016) and Bird on a Wire (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0915084","name":"Danny Wattley","idIMDB":"nm0915084"},"actorId":"nm0915084","character":"Customer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark McConchie","urlProfile":"http://www.imdb.com/name/nm0566217","urlPhoto":"","biography":{"dateOfBirth":"20 September 1958","placeOfBirth":" Trail, British Columbia, Canada","height":"5' 9\" (1.75 m)","bio":"Born the youngest of five boys, he originally attended the University of British Columbia for both an undergraduate degree in Sociology, 1981, followed by a law degree at the UBC Law School in 1985. He practiced law until 1997 at which time he closed his law practice and went into acting. In 2004, he wrote and directed the film short, Blind Date. As of 2016, he continues to act and write. He also plays guitar and writes his own songs.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0566217","name":"Mark McConchie","idIMDB":"nm0566217"},"actorId":"nm0566217","character":"Mayor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3579250","urlIMDB":"http://www.imdb.com/title/tt3579250","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"02","year":"2014","remarks":null},{"money":null,"country":null,"day":"13","month":"03","year":"2014","remarks":null}],"copyrightHolder":"2014 Farm Road Productions Ltd."},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.5","filmingLocations":[{"location":"Maple Ridge, British Columbia, Canada"}],"awards":[{"award":"The Joey Awards, Vancouver 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Joey Award","categories":[{"category":"Best Actress in a Made For TV/Straight To Video Feature, Leading Role, Age 6-10 Years","names":[{"name":"Yasmeene Ball","id":"nm6236385","role":null}]}]}]},{"award":"WorldFest Houston 2015","titlesAwards":[{"titleAwardOutcome":"Won Platinum Remi Award","categories":[{"category":"Independent Theatrical Feature Films &amp; Videos - Action / Adventure","names":[{"name":"David Winning","id":"nm0003941","role":null}]}]}]},{"award":"Young Artist Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a TV Movie, Miniseries or Special - Leading Young Actress","names":[{"name":"Olivia Steele Falconer","id":"nm4004498","role":null}]}]}]}],"votes":"386","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0492724","name":"Farm Road Production"},{"idCompany":"co0149567","name":"Front Street Pictures"}],"keywords":{"keywords":["christmas"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:48:00"}}