{"data":{"movies":[{"title":"Thor: Ragnarok","originalTitle":"Thor: Ragnarök","year":"2017","releaseDate":"20171103","directors":[{"name":"Taika Waititi","id":"nm0169806"}],"writers":[{"name":"Craig Kyle","id":"nm1219736"},{"name":"Christopher Yost","id":"nm1236653"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Mzc0NTc3MF5BMl5BanBnXkFtZTgwNDQzNTM2OTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Fantasy","Sci-Fi"],"plot":"Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his homeworld and the end of Asgardian civilization, at the hands of an all-powerful new threat, the ruthless Hela.","simplePlot":"Thor must face the Hulk in a gladiator match and save his people from the ruthless Hela.","actors":[{"actorName":"Tom Hiddleston","urlProfile":"http://www.imdb.com/name/nm1089991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNjE0Njg2MTReQTJeQWpwZ15BbWU3MDEyODM1ODc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1981","placeOfBirth":" Westminster, London, England, UK","birthName":"Thomas William Hiddleston","height":"6' 2\" (1.88 m)","bio":"Thomas William Hiddleston was born in Westminster, London, to English-born Diana Patricia (Servaes) and Scottish-born James Norman Hiddleston. His mother is a former stage manager, and his father, a scientist, was the managing director of a pharmaceutical company. He started off at the preparatory school, The Dragon School in Oxford, and by the time he was 13, he boarded at Eton College, at the same time that his parents were going through a divorce. He continued on to the University of Cambridge, where he earned a double first in Classics. He continued to study acting at the Royal Academy of Dramatic Art, from which he graduated in 2005. Whilst at University of Cambridge, he was seen by the agency 'Hamilton Hodell' in the play \"A Streetcar Named Desire\" and was signed. Following this, he was cast in his first television role in The Life and Adventures of Nicholas Nickleby (2001). Hiddleston won his first film role as Oakley in Joanna Hogg's award-winning first feature, Unrelated (2007). His breakthrough role came when he portrayed the nemesis Loki in the Marvel Cinematic Universe feature film Thor (2011). He reprised the character in The Avengers (2012), Thor: The Dark World (2013), Thor: Ragnarok (2017) and Avengers: Infinity War (2018). He has also appeared in Steven Spielberg's War Horse (2011), The Deep Blue Sea (2011), Woody Allen's romantic comedy Midnight in Paris (2011), and the romantic vampire film Only Lovers Left Alive (2013). On television, he appeared on the BBC series The Hollow Crown (2012), in the adaptations of Shakespeare's \"Henry IV\" and \"Henry V\". In theatre, he has been in the productions of \"Cymbeline\" (2007) and \"Ivanov\" (2008). In December 2013, he starred as the title character in the Donmar Warehouse production of \"Coriolanus\" which played until February 2014. He won the Laurence Olivier Award for Best Newcomer in a Play for his role in \"Cymbeline\" while also being nominated for the same award the same year for his role as Cassio in \"Othello\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNjE0Njg2MTReQTJeQWpwZ15BbWU3MDEyODM1ODc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1089991","name":"Tom Hiddleston","idIMDB":"nm1089991"},"actorId":"nm1089991","character":"Loki","urlCharacter":"http://www.imdb.com/character/ch0039559","main":true},{"actorName":"Benedict Cumberbatch","urlProfile":"http://www.imdb.com/name/nm1212722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDkzMDQwOF5BMl5BanBnXkFtZTgwOTE1Mjg1MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1976","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Benedict Timothy Carlton Cumberbatch","height":"6' (1.83 m)","bio":"Benedict Timothy Carlton Cumberbatch was born and raised in London, England. His parents, Wanda Ventham and Timothy Carlton (Timothy Carlton Congdon Cumberbatch), are both actors. He is a grandson of submarine commander Henry Carlton Cumberbatch, and a great-grandson of diplomat Henry Arnold Cumberbatch CMG. Cumberbatch attended Brambletye School and Harrow School. Whilst at Harrow, he had an arts scholarship and painted large oil canvases. It's also where he began acting. After he finished school, he took a year off to volunteer as an English teacher in a Tibetan monastery in Darjeeling, India. On his return, he studied drama at Manchester University. He continued his training as an actor at the London Academy of Music and Dramatic Art graduating with an M.A. in Classical Acting. By the time he had completed his studies, he already had an agent. Cumberbatch has worked in theatre, television, film and radio. His breakthrough on the big screen came in 2004 when he portrayed Stephen Hawking in the television movie Hawking (2004). In 2010, he became a household name as Sherlock Holmes on the British television series Sherlock (2010). In 2011, he appeared in two Oscar-nominated films - War Horse (2011) and La taupe (2011). He followed this with acclaimed roles in the science fiction fiction film Star Trek Into Darkness (2013), the Oscar-winning drama 12 Years a Slave (2013), The Fifth Estate (2013) and August: Osage County (2013). In 2014, he portrayed Alan Turing in The Imitation Game (2014) which earned him a Golden Globe, Screen Actors Guild Award, British Academy of Film and Television Arts and an Academy Award nominations for Best Actor in a Leading Role. Cumberbatch was appointed Commander of the Order of the British Empire (CBE) by Queen Elizabeth II in the 2015 Birthday Honours for his services to the performing arts and to charity. Cumberbatch's engagement to theatre and opera director Sophie Hunter, whom he has known for 17 years, was announced in the \"Forthcoming Marriages\" section of The Times newspaper on November 5, 2014. On February 14, 2015, the couple married at the 12th century Church of St. Peter and St. Paul on the Isle of Wight followed by a reception at Mottistone Manor. They have two sons, Christopher Carlton (born 2015) and Hal Auden (born 2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDkzMDQwOF5BMl5BanBnXkFtZTgwOTE1Mjg1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1212722","name":"Benedict Cumberbatch","nicknames":["Ben"],"idIMDB":"nm1212722"},"actorId":"nm1212722","character":"Dr. Stephen Strange","urlCharacter":"http://www.imdb.com/character/ch0387980","main":true},{"actorName":"Idris Elba","urlProfile":"http://www.imdb.com/name/nm0252961","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1972","placeOfBirth":" Hackney, London, England, UK","birthName":"Idrissa Akuna Elba","height":"6' 2¾\" (1.9 m)","bio":"An only child, Idris Elba was born and raised in Hackney, London, England. His father, Winston, is from Sierra Leone and worked at a Ford motor factory. His mother, Eve, is from Ghana and had a clerical duty. Idris attended school in Canning Town, where he first became involved in acting. He gained a place in the National Youth Music Theatre - thanks to a £1,500 Prince's Trust grant. He worked as a disc jockey in nightclubs under the nickname DJ Big Driis at age 19. However, he began auditioning for television roles in his early twenties. He has starred in both British and American productions. His first acting roles were on the soap opera Family Affairs (1997) and the television serial Ultraviolet (1998). His best known roles are as drug baron Russell \"Stringer\" Bell on the HBO series The Wire (2002) and as DCI John Luther on the BBC One series Luther (2010). He later starred in the films Daddy's Little Girls (2007), Prom Night (2008), RocknRolla (2008), The Unborn (2009) and Obsessed (2009). He also appeared in the films American Gangster (2007), Takers (2010), Thor (2011), Prometheus (2012), Pacific Rim (2013) and Thor: The Dark World (2013). Idris Elba was appointed Officer of the Order of the British Empire (OBE) by Queen Elizabeth II in the 2016 New Years Honours for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0252961","name":"Idris Elba","nicknames":["DJ Big Driis"],"idIMDB":"nm0252961"},"actorId":"nm0252961","character":"Heimdall","urlCharacter":"http://www.imdb.com/character/ch0150888","main":true},{"actorName":"Chris Hemsworth","urlProfile":"http://www.imdb.com/name/nm1165110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2MTI0NTIyNV5BMl5BanBnXkFtZTcwMTA4Nzc3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1983","placeOfBirth":" Melbourne, Victoria, Australia","height":"6' 2¾\" (1.9 m)","bio":"Chris Hemsworth was born in Melbourne, Australia, to Leonie (van Os), a teacher of English, and Craig Hemsworth, a social-services counselor. His brothers are actors Liam Hemsworth and Luke Hemsworth. He is of Dutch (from his immigrant maternal grandfather), Irish, English, Scottish, and German ancestry. His uncle, by marriage, was Rod Ansell, the bushman who inspired the film Crocodile Dundee (1986). Chris saw quite a bit of the country in his youth, after his family moved to the Northern Territory before finally settling on Phillip Island, to the south of Melbourne. In 2004, he unsuccessfully auditioned for the role of Robbie Hunter in the Australian soap opera Summer Bay (1988) but was recalled for the role of Kim Hyde which he played until 2007. In 2006, he entered the Australian version of Dancing with the Stars (2004) and his popularity in the soap enabled him to hang on until show 7 (Dancing with the Stars: Episode #5.7 (2006) when he became the fifth contestant to be eliminated. His first Hollywood appearance was in Star Trek (2009), but it was his titular role in Thor (2011) which propelled him to prominence worldwide. He reprised the character in the science fiction blockbuster The Avengers (2012). Chris's American representative, management company ROAR, also manages actress Elsa Pataky, and it was through them that the two met, marrying in 2010. The couple have a daughter and twin sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2MTI0NTIyNV5BMl5BanBnXkFtZTcwMTA4Nzc3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1165110","name":"Chris Hemsworth","nicknames":["Kip"],"idIMDB":"nm1165110"},"actorId":"nm1165110","character":"Thor","urlCharacter":"http://www.imdb.com/character/ch0560636","main":true},{"actorName":"Jaimie Alexander","urlProfile":"http://www.imdb.com/name/nm1526352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzAzMzQyNl5BMl5BanBnXkFtZTgwMTU3OTA2MDE@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1984","placeOfBirth":" Greenville, South Carolina, USA","birthName":"Jaimie Lauren Tarbush","height":"5' 9\" (1.75 m)","bio":"Jaimie Alexander was born in Greenville, South Carolina, but moved with her family to Grapevine, Texas, when she was four years old. She took theatre classes in grade school as a hobby but was kicked out in high school because she could not sing, and so she took up sports instead. At age 17 she substituted for a friend at a meeting with a scouting agency and she met her manager, Randy James, who sent her some scripts. After graduating from high school she moved to Los Angeles, California, to pursue acting. Her career was launched in 2003 when she was cast in the leading role of Hanna Thompson in the low-budget award-winning film The Other Side (2006). According to the DVD commentary, she was originally at the audition to help out by reading against the male actors, but director Gregg Bishop decided to cast her in the leading role after hearing her perform the lines. Her second role was in 2004 in Squirrel Trap (2004), in which she played the co-lead role of Sara. A year later she was cast as Jessi XX on the ABC Family series Kyle XY (2006), in which she played the role of a superhuman being created by scientists as a laboratory experiment. She was nominated for the Saturn Awards as \"Best Supporting Actress on Television\" for that role in 2008. Her biggest role came in 2011, when she was cast as Lady Sif, a warrior goddess of Asgard, in the blockbuster from Marvel Comics, Thor (2011). She later reprised her role in its sequel, Thor: The Dark World (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzAzMzQyNl5BMl5BanBnXkFtZTgwMTU3OTA2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1526352","name":"Jaimie Alexander","nicknames":["James"],"idIMDB":"nm1526352"},"actorId":"nm1526352","character":"Sif","urlCharacter":"http://www.imdb.com/character/ch0062967","main":true},{"actorName":"Cate Blanchett","urlProfile":"http://www.imdb.com/name/nm0000949","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUyNDMxMzU1OF5BMl5BanBnXkFtZTgwMTY0MzQyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1969","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Catherine Elise Blanchett","height":"5' 8\" (1.73 m)","bio":"Cate Blanchett was born on May 14, 1969 in Melbourne, Victoria, Australia, to June (Gamble), an Australian teacher and property developer, and Robert DeWitt Blanchett, Jr., an American advertising executive, originally from Texas. She has an older brother and a younger sister. When she was ten years old, her 40-year-old father died of a sudden heart attack. Her mother never remarried, and her grandmother moved in to help her mother. Cate graduated from Australia's National Institute of Dramatic Art in 1992 and, in a little over a year, had won both critical and popular acclaim. On graduating from NIDA, she joined the Sydney Theatre Company's production of Caryl Churchill's \"Top Girls\", then played Felice Bauer, the bride, in Tim Daly's \"Kafka Dances\", winning the 1993 Newcomer Award from the Sydney Theatre Critics Circle for her performance. From there, Blanchett moved to the role of Carol in David Mamet's searing polemic \"Oleanna\", also for the Sydney Theatre Company, and won the Rosemont Best Actress Award, her second award that year. She then co-starred in the ABC Television's prime time drama Heartland (1994), again winning critical acclaim. In 1995, she was nominated for Best Female Performance for her role as Ophelia in the Belvoir Street Theatre Company's production of \"Hamlet\". Other theatre credits include Helen in the Sydney Theatre Company's \"Sweet Phoebe\", Miranda in \"The Tempest\" and Rose in \"The Blind Giant is Dancing\", both for the Belvoir Street Theatre Company. In other television roles, Blanchett starred as Bianca in ABC's Bordertown (1995), as Janie Morris in G.P. (1989) and in ABC's popular series Police Rescue (1994). She made her feature film debut in Paradise Road (1997). She also married writer Andrew Upton in 1997. She had met him a year earlier on a movie set, and they didn't like each other at first. He thought she was aloof, and she thought he was arrogant, but then they connected over a poker game at a party, and she went home with him that night. Three weeks later he proposed marriage and they quickly married before she went off to England to play her breakthrough role in films: the title character in Elizabeth (1998) for which she won numerous awards for her performance, including the Golden Globe for Best Actress in a Drama. Cate was also nominated for an Academy Award for the role but lost out to Gwyneth Paltrow. 2001 was a particularly busy year, with starring roles in Bandits (2001), The Shipping News (2001), Charlotte Gray (2001) and playing Elf Queen Galadriel in the \"Lord Of The Rings\" trilogy. She also gave birth to her first child, son Dashiell, in 2001. In 2004, she gave birth to her second son Roman. Also, in 2004, she played actress Katharine Hepburn in Martin Scorsese's film \"Aviator\" (2004), for which she received an Academy Award as Best Supporting Actress. Two years later, she received an Academy Award nomination as Best Supporting Actress for playing a teacher having an affair with an underage student in \"Notes on a Scandal\" (2006). In 2007, she returned to the role that made her a star in \"Elizabeth: The Golden Age\" (2007). It earned her an Oscar nomination as Best Actress. She was nominated for another Oscar that same year as Best Supporting Actress for playing Bob Dylan in \"I'm Not There\" (2007). In 2008, she gave birth to her third child, son Ignatius. She and her husband became artistic directors of the Sydney Theatre Company, choosing to spend more time in Australia raising their three sons. She also purchased a multi-million dollar home in Sydney, Australia and named it Bulwarra and made extensive renovations to it. Because of her life in Australia, her film work became sporadic, until Woody Allen cast her in the title role in Blue Jasmine (2013), which won her the Academy Award as Best Actress. She ended her job as artistic director of the Sydney Theatre Company, while her husband continued there for two more years before he too resigned. In 2015, she adopted her daughter Edith in her father's homeland of America. That same year, she and her husband sold their multi-million dollar home in Australia at a profit and moved to America. Reasons varied from her wanting to work more in America to wanting to familiarize herself with her late father's American heritage. She played the title role of Carol (2015), a 1950s American housewife in a lesbian affair with a younger woman, for which she received an Oscar nomination as Best Actress. While most actresses might slow down in their forties, Blanchett did the opposite by stretching her boundaries even further, such as when she played 13 different characters in Manifesto (2015) and then making her Broadway debut in 2017 in \"The Present\", which is her husband's adaptation of Chekhov's play \"Platonov.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUyNDMxMzU1OF5BMl5BanBnXkFtZTgwMTY0MzQyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000949","name":"Cate Blanchett","idIMDB":"nm0000949"},"actorId":"nm0000949","character":"Hela","urlCharacter":"http://www.imdb.com/character/ch0539060","main":true},{"actorName":"Karl Urban","urlProfile":"http://www.imdb.com/name/nm0881631","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2Njg3MDgyN15BMl5BanBnXkFtZTcwNjgyNTA4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1972","placeOfBirth":" Wellington, New Zealand","birthName":"Karl-Heinz Urban","height":"6' 1\" (1.85 m)","bio":"Originally from Wellington, New Zealand, Karl Urban now lives in Auckland. Born on June 7, 1972, he is the son of a leather-goods manufacturer (who had hoped that Karl would follow in his footsteps). His first acting role was when he was 8 -- he had a line on a television series. However, he did not act again until after high school. He was offered a role in the NZ soap opera Shortland Street (1992) as he was preparing to attend Victoria University. After appearing on the series for the 1993-1994 season, he attended the university for one year, then left to pursue his acting career. Over the next few years, he landed several theater roles in the Wellington area. Eventually, he moved to Auckland, where a number of guest roles in NZ television followed. One of his first roles was that of a heroin addict in the drama series Shark in the Park (1989). He was in a movie as well, entitled Once in Chunuck Bay (aka Chunuk Bair (1992)). Other television roles followed, including a guest-starring role in the series White Fang (1993). Karl's biggest roles include Éomer in the Lord of the Rings trilogy, as well as Dr. Leonard \"Bones\" McCoy in Star Trek (2009), William Cooper in RED (2010) and Judge Dredd in Dredd (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2Njg3MDgyN15BMl5BanBnXkFtZTcwNjgyNTA4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0881631","name":"Karl Urban","idIMDB":"nm0881631"},"actorId":"nm0881631","character":"Skurge","urlCharacter":"http://www.imdb.com/character/ch0159174","main":true},{"actorName":"Anthony Hopkins","urlProfile":"http://www.imdb.com/name/nm0000164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk1NTc5Ml5BMl5BanBnXkFtZTYwMjAwOTI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1937","placeOfBirth":" Margam, Port Talbot, West Glamorgan, Wales, UK","birthName":"Philip Anthony Hopkins","height":"5' 8½\" (1.74 m)","bio":"Anthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre, invited by Laurence Olivier, who could see the talent in Hopkins. In 1967, he made his first film for television, A Flea in Her Ear (1967). From this moment on, he enjoyed a successful career in cinema and television. In 1968, he worked on The Lion in Winter (1968) with Timothy Dalton. Many successes came later, and Hopkins' remarkable acting style reached the four corners of the world. In 1977, he appeared in two major films: A Bridge Too Far (1977) with James Caan, Gene Hackman, Sean Connery, Michael Caine, Elliott Gould and Laurence Olivier, and Maximilian Schell. In 1980, he worked on The Elephant Man (1980). Two good television literature adaptations followed: Othello (1981) and The Hunchback of Notre Dame (1982). In 1987 he was awarded with the Commander of the order of the British Empire. This year was also important in his cinematic life, with 84 Charing Cross Road (1987), acclaimed by specialists. In 1993, he was knighted. In the 1990s, Hopkins acted in movies like Desperate Hours (1990) and Howards End (1992), The Remains of the Day (1993) (nominee for the Oscar), Legends of the Fall (1994), Nixon (1995) (nominee for the Oscar), Surviving Picasso (1996), Amistad (1997) (nominee for the Oscar), The Mask of Zorro (1998), Meet Joe Black (1998) and Instinct (1999). His most remarkable film, however, was The Silence of the Lambs (1991), for which he won the Oscar for Best Actor. He also got a B.A.F.T.A. for this role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk1NTc5Ml5BMl5BanBnXkFtZTYwMjAwOTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000164","name":"Anthony Hopkins","nicknames":["Tony"],"idIMDB":"nm0000164"},"actorId":"nm0000164","character":"Odin","urlCharacter":"http://www.imdb.com/character/ch0036545","main":true},{"actorName":"Tessa Thompson","urlProfile":"http://www.imdb.com/name/nm1935086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk4MDU3NDg4NF5BMl5BanBnXkFtZTcwMjMxMjcwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1983","placeOfBirth":" Los Angeles, California, USA","birthName":"Tessa Lynn Thompson","height":"5' 4\" (1.63 m)","bio":"Tessa Thompson was born on October 3, 1983 in Los Angeles, California, USA as Tessa Lynn Thompson. She is an actress, known for Creed (2015), Dear White People (2014) and When a Stranger Calls (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk4MDU3NDg4NF5BMl5BanBnXkFtZTcwMjMxMjcwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1935086","name":"Tessa Thompson","idIMDB":"nm1935086"},"actorId":"nm1935086","character":"Valkyrie","urlCharacter":"http://www.imdb.com/character/ch0511873","main":true},{"actorName":"Mark Ruffalo","urlProfile":"http://www.imdb.com/name/nm0749263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1967","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Mark Alan Ruffalo","height":"5' 8\" (1.73 m)","bio":"Mark Ruffalo was born in Kenosha, Wisconsin, to Marie Rose (Hebert), a stylist and hairdresser, and Frank Lawrence Ruffalo, a construction painter. His father's ancestry is Italian, and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles. He took classes at the Stella Adler Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume. Bartending for nearly nine years to make ends meet and ready to give it all up, a chance meeting and resulting collaboration with playwright/screenwriter Kenneth Lonergan changed everything. Ruffalo won NY success in Lonergan's play \"This Is Our Youth\", which led to the male lead in Lonergan's film You Can Count on Me (2000), playing the ne'er-do-well brother of Laura Linney. The performance drew rave reviews and invited comparisons to an early Marlon Brando. Notable roles in The Last Castle (2001), XX/XY (2002), and Windtalkers (2002) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite Meg Ryan in In the Cut (2003) and the love interest of Gwyneth Paltrow in the comedy View from the Top (2003). Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 - We Don't Live Here Anymore (2004), Eternal Sunshine of the Spotless Mind (2004), 13 Going on 30 (2004), and Collateral (2004) - which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama. After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: Just Like Heaven (2005), Les fous du roi (2006), Zodiac (2007), Reservation Road (2007), and The Brothers Bloom (2008). In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film Sympathy for Delicious (2010), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple Annette Bening and Julianne Moore in The Kids Are All Right (2010). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor. High-profile roles in Martin Scorsese's Shutter Island (2010) and 'Kenneth Longeran''s long-delayed Margaret (2011) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in Joss Whedon's blockbuster The Avengers (2012). Garnering highly positive reviews for a role in which actors Eric Bana and Edward Norton could not find success in previous films made Ruffalo a box office star in addition to a critically-acclaimed actor. He is expected to reprise the role in the upcoming 2015 sequel, and reunited with former co-star Gywneth Paltrow in the sex-addiction comedy-drama Thanks for Sharing (2012); Ruffalo also will take the lead in Ryan Murphy's adaptation of Larry Kramer's AIDS-drama play The Normal Heart (2014). Ruffalo has been married to actress Sunrise Coigney since 2000; the couple have three children, a son and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MjMwNjAzNF5BMl5BanBnXkFtZTcwMzkyNDg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749263","name":"Mark Ruffalo","idIMDB":"nm0749263"},"actorId":"nm0749263","character":"Bruce Banner / Hulk","urlCharacter":"http://www.imdb.com/character/ch0188716","main":true},{"actorName":"Ray Stevenson","urlProfile":"http://www.imdb.com/name/nm0829032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjczMDYzMV5BMl5BanBnXkFtZTcwMDQzMDIzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1964","placeOfBirth":" Lisburn, Northern Ireland, UK","birthName":"George Raymond Stevenson","height":"6' 4\" (1.93 m)","bio":"Tall, dark, but somewhat gentle-looking actor Ray Stevenson was born in Lisburn, Northern Ireland on 25 May 1964, on a British army base. His father was a British pilot in the Royal Air Force, and his mother is Irish. He moved with his family to Lemington, Newcastle-Upon-Tyne, England in 1972 at the age of eight, and later to Cramlington, Northumberland, where he was raised. As a child, he dreamed to become an actor, but he also thought that dream was impossible. So he pursued his other love, art, and went to art school instead. He was an interior designer with an architectural firm in London when he at 25 decided to try out acting. Eventually he attended Bristol Old Vic Theatre School, graduating at the age of 29. At the beginning of 90s, he began his career on films. He did a few TV films, one of them is The Return of the Native (1994), where he appeared opposite Clive Owen, Catherine Zeta-Jones and Steven Mackintosh. He also filmed The Theory of Flight (1998) Greenwich Mean Time (1999), Green-Eyed Monster (2001) (TV) and a lot of TV guest roles in series. Finally, he made a international breakout with King Arthur (2004), as quiet, but loyal knight Dagonet, again with Clive Owen (who played Arthur), Keira Knightley, Ioan Gruffudd, Mads Mikkelsen, Ray Winstone and Stellan Skarsgard. After a few more TV films, Stevenson's popularity started to rise by each film. But, his real fame came with HBO's \"Rome\" (2005 - 2007), as funny, but heroically fearless legionary Titus Pullo, opposite Kevin McKidd. Another two well-known roles were in the action horror Outpost (2008) and as comic book dark hero The Punisher / Frank Castle in the extremely violent Punisher: War Zone (2008), opposite Dominic West (Jigsaw), Doug Hutchison, Colin Salmon, Wayne Knight (Microchip), Dash Mihok (Det. Marin Soap) and Julie Benz. Stevenson also worked on the stage where he played the part of Christ in the York Mystery Plays in 2000 at York Minster. In 2001, he took the part of Roger in the play Mouth to Mouth by Kevin Elyot, at the Albery Theatre in London with Lindsay Duncan and Michael Maloney. His most well-known part is perhaps that of the Cardinal in The Duchess of Malfi by John Webster with Janet McTeer at the Royal National Theatre in 2003. Ray was married to actress Ruth Gemmell from 1997 to 2005. His girlfriend Elisabetta Caraccia have a son, Sebastiano Derek Stevenson, who was born in 2007. Besides acting, he loves art and has a passion for water color painting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MjczMDYzMV5BMl5BanBnXkFtZTcwMDQzMDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829032","name":"Ray Stevenson","idIMDB":"nm0829032"},"actorId":"nm0829032","character":"Volstagg","urlCharacter":"http://www.imdb.com/character/ch0127921","main":true},{"actorName":"Taika Waititi","urlProfile":"http://www.imdb.com/name/nm0169806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTczNTMzN15BMl5BanBnXkFtZTYwNjYwMzU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1975","placeOfBirth":" New Zealand","birthName":"Taika David Waititi","height":"6' 0½\" (1.84 m)","bio":"Taika Waititi, also known as Taika Cohen, hails from the Raukokore region of the East Coast, and is of Te-Whanau-a-Apanui (father) and Jewish (mother) descent. He has been involved in the film industry for several years, initially as an actor, and now focusing on writing and directing. Two Cars, One Night is Taika's first professional film-making effort and since its completion in 2003 he has finished another short \"Tama Tu\" about a group of Maori Soldiers in Italy during World War 2. As a performer and comedian, Taika has been involved in some of the most innovative and successful original productions seen in New Zealand. He regularly does standup gigs in and around the country and in 2004 launched his solo production, \"Taika's Incredible Show\". In 2005 he staged the sequel, \"Taika's Incrediblerer Show\". As an actor, Taika has been critically acclaimed for both his Comedic and Dramatic abilities. In 2000 he was nominated for Best Actor at the Nokia Film Awards for his role in the Sarkies Brother's film \"Scarfies\". Taika is also an experienced painter and photographer, having exhibited both mediums in Wellington and Berlin, and a fashion designer. He attended the Sundance Writers Lab with \"Choice\", a feature loosely based on \"Two Cars, One Night\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTczNTMzN15BMl5BanBnXkFtZTYwNjYwMzU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0169806","name":"Taika Waititi","idIMDB":"nm0169806"},"actorId":"nm0169806","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stan Lee","urlProfile":"http://www.imdb.com/name/nm0498278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE3Njc5M15BMl5BanBnXkFtZTYwOTY5Nzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1922","placeOfBirth":" New York City, New York, USA","birthName":"Stanley Martin Lieber","height":"5' 11\" (1.8 m)","bio":"Stan Lee was born on December 28, 1922 in New York City, New York, USA as Stanley Martin Lieber. He is a writer and producer, known for Iron Man (2008), Spider-Man (2002) and Iron Man 3 (2013). He has been married to Joan Lee since December 5, 1947. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE3Njc5M15BMl5BanBnXkFtZTYwOTY5Nzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0498278","name":"Stan Lee","nicknames":["The Man","Generalissimo"],"idIMDB":"nm0498278"},"actorId":"nm0498278","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Goldblum","urlProfile":"http://www.imdb.com/name/nm0000156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NzkyODg1Nl5BMl5BanBnXkFtZTYwMTY2OTE0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1952","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Jeffrey Lynn Goldblum","height":"6' 4½\" (1.94 m)","bio":"Jeffrey Lynn Goldblum was born October 22, 1952 in Pittsburgh, Pennsylvania, one of four children of Shirley (Temeles), a radio broadcaster who also ran an appliances firm, and Harold L. Goldblum, a doctor. His father was of Russian Jewish descent and his mother was of Austrian Jewish ancestry. Goldblum began his career on the New York stage after moving to the city at age seventeen. Possessing his own unique style of delivery, Goldblum made an impression on moviegoers with little more than a single line in Woody Allen's Annie Hall (1977), when he fretted about having forgotten his mantra. Goldblum went on to appear in the remake Invasion of the Body Snatchers (1978) and co-starred with Ben Vereen in the detective series Tenspeed and Brown Shoe (1980) before a high-profile turn in the classic ensemble film The Big Chill (1983). The quirky actor turned up in the suitably quirky film The Adventures of Buckaroo Banzai Across the 8th Dimension (1984), which became a 1980s cult classic, starred in the modern-day film noir Into the Night (1985), then went on to a breakthrough role in the David Cronenberg remake The Fly (1986), which also featured actress Geena Davis, Goldblum's wife from 1987-1990 and co-star in two additional films: Transylvania 6-5000 (1985) and Julien Temple's Earth Girls Are Easy (1988). Goldblum was the rather unlikely star of some of the biggest blockbusters of the 1990s: Steven Spielberg's dinosaur adventure Jurassic Park (1993) and its sequel The Lost World: Jurassic Park (1997), as well as the alien invasion film Independence Day (1996). These films saw Goldblum playing the type of intellectual characters he has become associated with. More recently, roles have included critically acclaimed turns in Igby Goes Down (2002) and Wes Anderson's The Life Aquatic with Steve Zissou (2004). In 2009, he returned to television to star in his second crime series Law & Order: Criminal Intent (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NzkyODg1Nl5BMl5BanBnXkFtZTYwMTY2OTE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000156","name":"Jeff Goldblum","idIMDB":"nm0000156"},"actorId":"nm0000156","character":"Grandmaster","urlCharacter":"http://www.imdb.com/character/ch0232195","main":true},{"actorName":"Sam Neill","urlProfile":"http://www.imdb.com/name/nm0000554","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjY1OTA1NF5BMl5BanBnXkFtZTcwNTcxMTAzNQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1947","placeOfBirth":" Omagh, Co. Tyrone, Northern Ireland, UK","birthName":"Nigel Neill","height":"5' 11¾\" (1.82 m)","bio":"Sam Neill was born in Omagh, Co. Tyrone, Northern Ireland, to army parents, an English-born mother, Priscilla Beatrice (Ingham), and a New Zealand-born father, Dermot Neill. His family moved to the South Island of New Zealand in 1954. He went to boarding schools and then attended the universities at Canterbury and Victoria. He has a BA in English Literature. Following his graduation, he worked with the New Zealand Players and other theater groups. He also was a film director, editor and scriptwriter for the New Zealand National Film Unit for 6 years. Sam Neill is internationally recognised for his contribution to film and television. He is well known for his roles in Steven Spielberg's Jurassic Park and Jane Campion's Academy Award Winning film The Piano. Other film roles include The Daughter, Backtrack opposite Adrian Brody, Deux Ex Machina, F2014, A Long Way Down, The Tomb, The Hunter with Willem Dafoe, Daybreakers, Legend of the Guardians: The Owls Of G'Ahoole, Little Fish opposite Cate Blanchett, Skin, Dean Spanley, Wimbledon, Yes, Perfect Strangers, Dirty Deeds, The Zookeepers, Bicenntial Man opposite Robin Williams, The Horse Whisperer alongside Kristin Scott Thomas, Sleeping Dogs, My Brilliant Career. He received Emmy and Golden Globe nominations for the NBC miniseries Merlin. He also received a Golden Globe nomination for One Against The Wind, and for Reilly: The Ace of Spies. The British Academy of Film and Television honoured Sam's work in Reilly by naming him Best Actor. Sam received an AFI Award for Best Actor for his role in Jessica. Other television includes House of Hancock, Rake, Doctor Zhivago, To the Ends of Earth, The Tudors with Jonathan Rhys Meyers, Cruseo, Alcatraz and recently in Old School opposite Bryan Brown, Peaky Blinders alongside Cillian Murphy, The Dovekeepers for CBS Studios.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNjY1OTA1NF5BMl5BanBnXkFtZTcwNTcxMTAzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000554","name":"Sam Neill","idIMDB":"nm0000554"},"actorId":"nm0000554","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3501632","urlIMDB":"http://www.imdb.com/title/tt3501632","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"07","year":"2016","remarks":null},{"money":null,"country":null,"day":"28","month":"10","year":"2016","remarks":null}],"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Arri Alexa 65 (Prime 65 and Vintage 765 Lenses)"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[{"location":"Village Roadshow Studios, Oxenford, Queensland, Australia"}],"awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0047120","name":"Marvel Entertainment"},{"idCompany":"co0051941","name":"Marvel Studios"},{"idCompany":"co0008970","name":"Walt Disney Pictures"}],"keywords":{"keywords":["marvel cinematic universe","norse god","superhero","sequel","based on comic","based on comic book","marvel comics","third part"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:15:50"}}