{"data":{"movies":[{"title":"Jarhead 2: Field of Fire","originalTitle":"","year":"2014","releaseDate":"20140808","directors":[{"name":"Don Michael Paul","id":"nm0666806"}],"writers":[{"name":"Berkeley Anderson","id":"nm2240163"},{"name":"Ellis Black","id":"nm5990253"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUxMTA4Njg0M15BMl5BanBnXkFtZTgwMjcxMDUzMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","War"],"plot":"Battle-scarred and disillusioned by the war, Corporal Chris Merrimette is put in charge of a unit whose next mission is to resupply a remote outpost on the edge of Taliban-controlled territory. While driving through the hostile Helmand province, a Navy SEAL flags down their convoy and enlists the unit on an operation of international importance: they must help an Afghan woman famous for her defiance of the Taliban escape the country. Without tanks or air support, Merrimette and his team will need all the courage and firepower they can muster to fight their way across the war-torn country and shepherd the woman to safety.","simplePlot":"Without tanks or air support, a corporal and his team must muster all the courage and firepower they can to fight their way across war-torn Afghanistan and shepherd an important anti-Taliban woman to safety.","actors":[{"actorName":"Cole Hauser","urlProfile":"http://www.imdb.com/name/nm0369513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTEzNDk2OV5BMl5BanBnXkFtZTgwNDYyMzQwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1975","placeOfBirth":" Santa Barbara, California, USA","birthName":"Cole Kenneth Hauser","height":"6' 1\" (1.85 m)","bio":"Cole Hauser was born in Santa Barbara, California. He is the son of Cass Warner, who founded a film production company (Warner Sisters), and Wings Hauser, an actor. His grandfathers were screenwriters Dwight Hauser and Milton Sperling, and his maternal great-grandfather was film mogul Harry M. Warner, of Warner Bros. His father is of German, Irish, and Belgian (Walloon) descent, and his mother is from a Jewish family (from Austria, Russia, and Poland). He grew up in California, Oregon and Florida. Hauser has had a long and impressive career in acting. He made his big screen debut in \"School Ties\" where many other then up and coming actors had their starts. He next went on to star in Richard Linklater's Cult Classic \"Dazed and Confused.\" Other feature credits include \"Tigerland,\" for which Cole received an Independent Spirit Award nomination, \"White Oleander\" for which he received a Movieline breakthrough performance also, \"Hart's War,\" \"Tears of the Sun,\" \"Higher Learning,\" and \"Too Fast, Too Furious,\" to name a few. In 2014 Hauser will be seen in two anticipated projects. This spring he can be seen opposite Johnny Depp in the Warner Bros release of Transcendence (2014). Immediately following he will star in DirecTV's original drama \"Rogue\" opposite Thandie Newton. The show, in its second season has been a big draw for the network. Earlier this year he was seen in Antoine Fuqua's Olympus Has Fallen (2013), an action ensemble which included Aaron Eckhart, Gerald Butler and Morgan Freeman. Hauser lives outside of Los Angeles with his wife, photographer Cynthia Daniel, and three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTEzNDk2OV5BMl5BanBnXkFtZTgwNDYyMzQwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369513","name":"Cole Hauser","idIMDB":"nm0369513"},"actorId":"nm0369513","character":"Navy Seal Special Ops Fox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Kelly","urlProfile":"http://www.imdb.com/name/nm2320094","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzI5MzU0MV5BMl5BanBnXkFtZTcwMzkzODc1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Josh Kelly is an actor and director, known for One Life to Live (1968), Transformers: Dark of the Moon (2011) and Transformers: Revenge of the Fallen (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MzI5MzU0MV5BMl5BanBnXkFtZTcwMzkzODc1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2320094","name":"Josh Kelly","idIMDB":"nm2320094"},"actorId":"nm2320094","character":"Chris Merrimette","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danielle Savre","urlProfile":"http://www.imdb.com/name/nm1642290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODExNTgwMzk5OF5BMl5BanBnXkFtZTgwNTg2NDYwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1988","placeOfBirth":" Simi Valley, California, USA","birthName":"Danielle Kathleen Savre","height":"5' 6\" (1.68 m)","bio":"Danielle Savre was born on August 26, 1988 in Simi Valley, California, USA as Danielle Kathleen Savre. She is an actress, known for In the Land of Women (2007), Boogeyman 2 (2007) and Bring It On: All or Nothing (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODExNTgwMzk5OF5BMl5BanBnXkFtZTgwNTg2NDYwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1642290","name":"Danielle Savre","idIMDB":"nm1642290"},"actorId":"nm1642290","character":"Danielle 'Danni' Allen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bokeem Woodbine","urlProfile":"http://www.imdb.com/name/nm0940158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDgwMzQwMV5BMl5BanBnXkFtZTcwNDc3NDg2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1973","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Bokeem Woodbine grew up in Harlem New York. At the age of 19, he secured the lead role in the HBO production of Forest Whitaker's directorial debut Strapped (1993). Bokeem moved to Los Angeles shortly after completing the film Jason's Lyric (1994), and has pursued his dream of becoming a noteworthy film actor while balancing a passion for musical expression. Along the way he has appeared alongside Oscar- wining actors and worked with many of today's top directors, producers, and networks. To date he has appeared in biographical movies, like \"Ray,\" comedies like \"Life,\" horror, \"Devil,\" and most recently science fiction, in the much anticipated feature film, \"Riddick.\" Bokeem respects the responsibilities inherent in taking on any role, and enjoys the process.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDgwMzQwMV5BMl5BanBnXkFtZTcwNDc3NDg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940158","name":"Bokeem Woodbine","nicknames":["Bo"],"idIMDB":"nm0940158"},"actorId":"nm0940158","character":"Danny Kettner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ronny Jhutti","urlProfile":"http://www.imdb.com/name/nm0422588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTAzMjYyOF5BMl5BanBnXkFtZTgwMTA2MDIwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1973","placeOfBirth":" London, England, UK","birthName":"Ajay Dhutti","bio":"Ronny Jhutti was born in 1973 in London, England as Ajay Dhutti. He is an actor and director, known for Nina's Heavenly Delights (2006), The Surprise (2015) and Twelfth Night, or What You Will (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTAzMjYyOF5BMl5BanBnXkFtZTgwMTA2MDIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0422588","name":"Ronny Jhutti","idIMDB":"nm0422588"},"actorId":"nm0422588","character":"Khalid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cassie Layton","urlProfile":"http://www.imdb.com/name/nm6478319","urlPhoto":"","biography":{"bio":"Cassie Layton is an actress, known for Jarhead 2: Field of Fire (2014), Pylon (2017) and Lovesick (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6478319","name":"Cassie Layton","idIMDB":"nm6478319"},"actorId":"nm6478319","character":"Anoosh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jesse Garcia","urlProfile":"http://www.imdb.com/name/nm1883803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjQ4MTg4Nl5BMl5BanBnXkFtZTYwMjIzODA3._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1982","placeOfBirth":" Rawlins, Wyoming, USA","bio":"Jesse Garcia Garcia has been widely recognized for his role in the highly acclaimed \"Quincerana,\" winner of the Audience Award and the Grand Jury Prize at the 2006 Sundance Film Festival, and Official Selection for the 2006 Berlin Film Festival. For his performance as Carlos, Garcia was nominated and won the prestigious ALMA Award (American Latino Media Arts) as Outstanding Actor in a Motion Picture in 2007. Garcia, can most recently be seen in Joss Whedon's \"The Avengers.\" Number one opening weekend film of all time, with $200.7 and over $1billion worldwide, to date. Other credits include, \"A Beautiful Life,\" opposite Angela Sarafyan, \"Periphery,\" opposite Steven Grayhm, Tessa Thompson, and Jess Weixler, and \"Days of Wrath,\" opposite Wilmer Valderrama, Jeffrey Dean Morgan, Ana Claudia Talancon and Laurence Fishburne, where he plays Mario, the Kingpin of the Triple Sevens, in a story about the intertwining lives of a teacher, TV news crew and rival gang members. Also, in Hue Rhodes', \"Saint John of Las Vegas,\", opposite Steve Buscemi and Romany Malco. As well as, Youssef Delaras', \"Bedrooms,\" with Julie Benz and Xander Berkeley, Mun Chee Yong's, \"Where the Road Meets the Sun,\" Joshua Homnick's, \"Los Foley Guys,\" with Rainn Wilson and Al Madrigal, the highly anticipated zombie flick \"Re-Kill,\" the Broadway debut of the stage production of \"The Pee-wee Herman Show.\" Garcia also appears in The Sundance 2007 film, \"La Misma Luna,\" also known as \"Under the Same Moon,\" alongside Kate del Castillo and America Ferrera. In addition, Garcia starred in Twentieth Century Fox's, \"The Combacks,\" where he plays a tough \"rich-street kid\" football player with an attitude. Born in Rawlins, Wyoming, Garcia spent most of his childhood in Hanna, WY, a town with a population of just over seven hundred people. His acting debut came in 1987 when he was cast in the challenging role of Brown Bear. With a winter coat turned inside out (to look like brown fur) and construction paper ears pinned to his hood, Garcia recalls that he presented a striking likeness to a real brown bear. With his lines memorized, blocking mastered and adrenaline surging, Garcia (6) was well prepared. He heard his cue line and crawled out of his cave, violently thrashing his head from side to side. With teeth bared and tonsils flaring, he reared up on his hindquarters pawing the air; then he growled with all his might - \"RRRAAAWWWRRR!\" The first graders (sitting on the floor of their small classroom) giggled. It was not exactly the reaction Garcia was aiming for, but from the mouth of that cardboard cave, an actor was born. Following this performance, Garcia took a 15-year hiatus from the show business industry to concentrate on his schoolwork. He received grants and scholarships for Co-Ed Cheerleading at Eastern Wyoming College and the University of Nebraska at Lincoln. In the middle of his first year at U of N, a classmate of Garcia's, Jennifer Jerosik, told him that she was moving to Atlanta, GA to study acting with Judson Vaughn, a filmmaker/actor/teacher who she'd heard speaking at a convention in Chicago. Instantly Garcia's Inner-Bear growled again and he decided he wanted to join her. After a 45-minute telephone interview, Garcia was accepted to study at WHAT Films, the film development/production company and training facility headed by Vaughn. A week later, Garcia dropped out of school, and he and Jennifer packed everything they owned into his 1993, burgundy Mercury Cougar and drove 1,580 miles southeast to Atlanta - not the quickest route to Hollywood, but his years in Atlanta prepared him well for what would become his profession. At WHAT Films he learned to act, write and to direct, and he got sound career advice from Vaughn and from writer/director Ben Taylor (Abgeschminkt!). Others at WHAT who were particularly helpful to Garcia included Roxzane Mims, Lavon Lacey, Chet Dixon and Ralph Price, to name a few. While in Atlanta, Garcia honed his comedic skills performing in \"Sketchworks,\" Bob Harter, Della Cole and Jen Kelly's sketch comedy group. Garcia's first feature film role came when fellow WHAT Films actor Chet Dixon (Cold Mountain, Days of Wrath) prompted director Stacey Childers to cast him her film \"Delivery Boy Chronicles.\" In Dec, 2003, he moved to Los Angeles in hopes of advancing his career. In 2005, he was featured in nine national commercials, including such major brands as McDonalds, Toyota, Avis, MGD, Bud Light, State Farm and others. His television and independent films included such projects as HBO's \"walkout,\" directed by Edward James Olmos, guest spots on FX's Sons of Anarchy, The Sarah Connor Chronicles, ER, The Shield, TNT's The Closer, Law and Order: CI, NCIS, Nickelodeon's Unfabulous, Jerry Bruckheimer's FOX series Justice and FX's Sons of Anarchy. As well as keeping busy with his acting career, Garcia has taken on the challenge of directing and producing. Producer and lead actor in a short feature titled, \"American Identity,\" directed by Stephen Rollins, was honored with opening the Short Film Competition at the 2007 Cannes Film Festival. Also, produced and a lead actor in John Irwin's short film, \"Sold,\" with an all-star cast and crew, a film about the reality of human trafficking. Sold, premiered at the Los Angeles Latino International Film Festival in 2011 and has made the festival circuit around the world. The DBAC, PSA campaign with fellow filmmakers, Doug Spain, Jeremy Valdez, and Walter Perez. Garcia recently wrapped principal photography on his directorial debut, short film, \"The Price We Pay.\" A film about a scarred and depressed soldier coming home from war to find his relationship with his neighborhood, best friend and wife, not how he left it. Shot in a less than conventional manner, with subtle science fiction elements, the film is already stirring up attention in the film making and military communities. Currently, Garcia is in post-production for his short, \"The Price We Pay.\" He is also, writing and has several projects in development as a producer, director and actor. He is also, in development for his feature film directorial debut and is in search of projects to direct in the near future.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjQ4MTg4Nl5BMl5BanBnXkFtZTYwMjIzODA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1883803","name":"Jesse Garcia","idIMDB":"nm1883803"},"actorId":"nm1883803","character":"Rafael Soto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Wong","urlProfile":"http://www.imdb.com/name/nm3438484","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjc4MDQ5ZTctNWVhZi00MmQxLWEzOGUtZmIyNmM5MWZiNjYwL2ltYWdlXkEyXkFqcGdeQXVyMjA5MDgyODA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1986","placeOfBirth":" London, England, UK","bio":"Jason Wong was born on March 24, 1986 in London, England. He is an actor, known for Redemption (2013), Jarhead 2: Field of Fire (2014) and James Bond 007: Bloodstone (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjc4MDQ5ZTctNWVhZi00MmQxLWEzOGUtZmIyNmM5MWZiNjYwL2ltYWdlXkEyXkFqcGdeQXVyMjA5MDgyODA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3438484","name":"Jason Wong","idIMDB":"nm3438484"},"actorId":"nm3438484","character":"Li","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Esai Morales","urlProfile":"http://www.imdb.com/name/nm0005246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODI3NzM1OV5BMl5BanBnXkFtZTcwNjI1NzMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1962","placeOfBirth":" Brooklyn, New York, USA","birthName":"Esai Manuel Morales","height":"5' 10\" (1.78 m)","bio":"Award-winning actor Esai Morales is a graduate of New York's High School for the Performing Arts, began his acting career on the stage, firstly appearing in El Hermano at the Ensemble Theatre Studio and at New York's Shakespeare Festival In The Park in The Tempest. He had his feature film debut in Bad Boys and his breakthrough role in La Bamba made him a star, contributing to making the film the most commercially successful Latino-themed Rock biopic of all time. To this day, his role as Bob Morales continues to uptrend in major social media sites. In 1997 Esai Morales co-founded the National Hispanic Foundation for the Arts, created to advance the presence of Latinos in the media, telecommunications and entertainment industries. The NHFA has provided scholarships to hundreds of Hispanic students in excess of 1 million dollars. Theater performances include Oscar Wilde's Salome with Al Pacino (Broadway) Joe Papp's production of The Tempest with Raul Julia (New York's Shakespeare in the Park Festival) Tamer of Horses (Los Angeles Theater Center) The Exonerated, directed by Bob Balaban and his musical theater debut on The Mambo Kings. Film credits include Bad Boys, La Bamba, Rapa Nui, Mi Familia, Fast Food Nation, Paid in Full, The Line, Atlas Shrugged: Part II, Jarhead II: Field of Fire, The Disappearance of Garcia Lorca and Gun Hill Road a film he starred and executive produced. The film was a grand Jury Nominee at the Sundance Film Festival in 2011. Television credits comprise the Emmy award-winning series NYPD BLUE (ABC) Resurrection Blvd (Showtime) American Family (PBS) Miami Vice (NBC) Fame (NBC) Law and Order: SVU (NBC) The Burning Season: The Chico Mendes Story (HBO) Vanished (FOX) Burn Notice (USA) Jericho (CBS) Caprica (Syfy) Fairly Legal (USA) Criminal Minds (CBS) Major Crimes (TNT) and Saving Westbrook High. Currently, Morales plays the role of President of The United States on The Brink, HBO's new dark comedy about a geo-political crisis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODI3NzM1OV5BMl5BanBnXkFtZTcwNjI1NzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005246","name":"Esai Morales","idIMDB":"nm0005246"},"actorId":"nm0005246","character":"Captain Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Lang","urlProfile":"http://www.imdb.com/name/nm0002332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzYwNTc5Nl5BMl5BanBnXkFtZTcwMzQzOTUyNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1952","placeOfBirth":" New York City, New York, USA","height":"5' 10½\" (1.79 m)","bio":"A stage actor of great recognition, Stephen Lang has shaped a formidable career on and off the various stages of the United States and abroad. Though he is arguably most well-known for his acclaimed performance in James Cameron's Avatar (2009), Lang began his career in theater. Broadway roles include his Tony-nominated performance as Lou in \"The Speed of Darkness\", Happy in the Dustin Hoffman revival of \"Death of a Salesman\", Colonel Jessep in \"A Few Good Men\", and Mike Tallman alongside Quentin Tarantino and Marisa Tomei in \"Wait Until Dark\". Off-Broadway credits include John Patrick Shanley's \"Defiance\", Anne Nelson's \"The Guys\", Arthur Miller's \"Finishing the Picture\" and his own play, \"Beyond Glory\", for which he received numerous accolades. The play premiered in Washington, D.C. and has played the Goodman Theatre in Chicago, the Roundabout in New York City and a USO tour to various military bases and battleships around the world. In the fall of 2010, Lang received the Patriot Award from the Medal of Honor Society in honor of his theatrical and charitable works for the United States military. Television and film credits include celebrated performances as Babe Ruth in Babe Ruth (1991), Stonewall Jackson in Gods and Generals (2003) as well as acclaimed performances in Last Exit to Brooklyn (1989), Tombstone (1993), Gettysburg (1993), Public Enemies (2009), The Men Who Stare at Goats (2009), Michael Mann's hit TV show Crime Story (1986) , the NBC revival of The Fugitive (2000), featuring Tim Daly, and Fox's sci-fi epic Terra Nova (2011). He has been nominated for and won numerous awards including the Grace Prize, Outer Critics Circle, Drama Desk, Helen Hayes, and Tony Awards, as well as acting prizes at 2010's VisionFest and the Buffalo Niagara Film Festival. Stephen was born in New York City, New York, to Theresa (Volmer) and Eugene Lang, a prominent businessperson and philanthropist. He is of Hungarian Jewish and Irish Catholic descent. He is married to Kristina Watson, a costume designer and teacher, with whom he has four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzYwNTc5Nl5BMl5BanBnXkFtZTcwMzQzOTUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002332","name":"Stephen Lang","idIMDB":"nm0002332"},"actorId":"nm0002332","character":"Major Gavins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chad Mountain","urlProfile":"http://www.imdb.com/name/nm1869292","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDI2MDkzOTg3OF5BMl5BanBnXkFtZTgwMDUxNjczODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1981","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Thomas Chadbourne Mountain","height":"6' 4\" (1.93 m)","bio":"Chad Mountain was born on November 23, 1981 in Washington, District of Columbia, USA as Thomas Chadbourne Mountain. He is an actor and producer, known for McFarland, USA (2015), Ghosts of Girlfriends Past (2009) and Jarhead 2: Field of Fire (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDI2MDkzOTg3OF5BMl5BanBnXkFtZTgwMDUxNjczODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1869292","name":"Chad Mountain","idIMDB":"nm1869292"},"actorId":"nm1869292","character":"Soc Cooper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amr El-Bayoumi","urlProfile":"http://www.imdb.com/name/nm3300863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2NlZTg1ZDctMzY3My00M2NkLWIyNWYtMGNkYTdkYjJiM2E5L2ltYWdlXkEyXkFqcGdeQXVyMjA3NzU1Njc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Amr El-Bayoumi is an actor, known for Captain Phillips (2013), The Fifth Estate (2013) and Jarhead 2: Field of Fire (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2Y4YzM1MjgtNDRmYy00YjU2LTg0ZTgtM2U2Y2VlZGJkOTMzXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3300863","name":"Amr El-Bayoumi","idIMDB":"nm3300863"},"actorId":"nm3300863","character":"Police Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Velislav Pavlov","urlProfile":"http://www.imdb.com/name/nm2216703","urlPhoto":"","biography":{"height":"6' 1½\" (1.87 m)","bio":"Velislav Pavlov is a Bulgarian born theater and film actor. He studied and graduated in acting at The Theater Dept of The New Bulgarian University in Sofia, Bulgaria. His first major role in film comes in 2011 as the lead character Alexander in 12 episode criminal TV drama for Bulgarian national Nova TV called Otplata (Payback). He also performs in theater, like one of his most significant appearances are in F. M. Dostoevski's Idiot as Rogozhin (2000), Carlo Gozzi's The King Stag, as Tartaglia (2004), Shakespeare's Hamlet, as Claudius (2009), Sarah Kane's Psychosis 4:48 (2009), etc. Lives in Sofia, Bulgaria.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2216703","name":"Velislav Pavlov","nicknames":["Slavi"],"idIMDB":"nm2216703"},"actorId":"nm2216703","character":"Nafiz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralitsa Paskaleva","urlProfile":"http://www.imdb.com/name/nm5254676","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjI2NDc4OV5BMl5BanBnXkFtZTcwNzY4ODg0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ralitsa Paskaleva is an actress, known for In the Name of the King 3: L'ultima missione (2014), XIa (2016) and Jarhead 2: Field of Fire (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjI2NDc4OV5BMl5BanBnXkFtZTcwNzY4ODg0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5254676","name":"Ralitsa Paskaleva","idIMDB":"nm5254676"},"actorId":"nm5254676","character":"Heather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Straub","urlProfile":"http://www.imdb.com/name/nm2467178","urlPhoto":"","biography":{"dateOfBirth":"24 March 1977","placeOfBirth":" Oviedo, Florida, USA","birthName":"Michael Gene Straub","height":"6' (1.83 m)","bio":"Mike Straub was born on March 24, 1977 in Oviedo, Florida, USA as Michael Gene Straub. He is an actor, known for The Grudge 3 (2009), The Hills Run Red (2009) and Wrong Turn 3: Left for Dead (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2467178","name":"Mike Straub","idIMDB":"nm2467178"},"actorId":"nm2467178","character":"Staff Sergeant Dickson","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3699508","urlIMDB":"http://www.imdb.com/title/tt3699508","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.5","filmingLocations":[{"location":"Bulgaria"}],"rated":"R","awards":[],"votes":"3,759","type":"Movie","companyCreditsSimple":[{"idCompany":"co0386431","name":"BUFO"},{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["male rear nudity","male nudity","taliban","navy seal","afghanistan","army corporal","u.s. military","shower","military","male frontal nudity","war zone","american abroad","helmand province afghanistan","digit in title","second part","numbered sequel","five word title","camouflage","gun","sequel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:27:38"}}