{"data":{"movies":[{"title":"Space Dogs: Adventure to the Moon","originalTitle":"Belka i Strelka: Lunnye priklyucheniya","year":"2014","releaseDate":"20160115","directors":[{"name":"Inna Evlannikova","id":"nm3575075"},{"name":"Aleksander Khramtsov","id":"nm3094147"}],"writers":[{"name":"Maksim Belozor","id":"nm3369372"},{"name":"John Chua","id":"nm1396106"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGVlNmFiMzYtMmUyMS00ZWY5LThkZTgtYmVhY2RiYTc0YWI3XkEyXkFqcGdeQXVyNzg5OTk2OA@@._V1.jpg","countries":["Russia"],"languages":["Russian","English"],"genres":["Animation","Adventure","Comedy","Family"],"plot":"Get ready to blast off to an out-of-this-world adventure with canine teenage astronaut, Pushok, who is determined to find his missing astronaut father. Against all odds, Pushok stows away on a US rocket ship to the moon but soon finds he is not alone, as he is reunited with his mom and encounters a macho monkey and a baby alien. Together, the furry heroes learn the true meaning of teamwork as they join the search for Pushok's dad.","simplePlot":"Get ready to blast off to an out-of-this-world adventure with canine teenage astronaut, Pushok, who is determined to find his missing astronaut father. Against all odds, Pushok stows away ... ","actors":[{"actorName":"Nonna Grishaeva","urlProfile":"http://www.imdb.com/name/nm0342574","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmY2M2Y3ZTgtODVhYS00Y2MyLWEyNDItNDcxZTgxN2QyZTI1XkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1971","placeOfBirth":" Odessa, Ukrainian SSR, USSR [now Ukraine]","birthName":"Nonna Valentinovna Grishayeva","bio":"Nonna Grishayeva is a Russian actress of the Vakhtangov Theatre in Moscow. She was born Nonna Grishayeva on July 21, in Odessa, Soviet Union (now Odesa, Ukraine). Her parents were actors in Odessa. In 1981, at the age of 10, young Grishayeva made her stage debut at Odessa Theatre of Operetta. There she studied singing and dancing. From 1990 - 1994 she studied acting under V. Ivanov at the Shchukin Theatrical School of Vakhtangov Theatre in Moscow, graduating in 1994, as an actress. Since 1994 Nonna Grishayeva has been member of the troupe at Vakhtangov Theatre in Moscow. There her stage partners were such actors as Mikhail Ulyanov, Vasiliy Lanovoy, Yuliya Borisova, Lyudmila Maksakova, Alla Kazanskaya, Irina Kupchenko, Sergey Makovetskiy, Mariya Aronova, Marianna Vertinskaya, Elena Dobronravova, Yuriy Yakovlev, Vladimir Etush, Vyacheslav Shalevich, Nikolai Timofeyev, Aleksandr Grave, Vladimir Simonov, Aleksandr Ryshchenkov, Vladimir Koval, Viktor Zozulin, Evgeniy Karelskikh, Aleksandr Koznov, Vladimir Vdovichenkov, Andrey Zaretskiy, Mikhail Vaskov, Elena Sotnikova, Anna Dubrovskaya, Olga Tumaykina, Maksim Sukhanov, and Viktor Dobronravov, among others. Her most memorable stage performances included such roles as Byanka in the Shakespeare's 'Othello' (1990s), as Smeraldina in 'King-deer' (1990s), Maria Antonovna in 'Revizor' (aka.. Ispector general) based on the classic play by Nikolai Gogol, and as Lisa in 'Queen of spades' based on the eponymous play by Alexander Pushkin, among other plays. In 1995 Grishayeva created the leading character as Sheherazade in 'Ali-Baba i sorok razboinikov' (aka.. The magic tale of Sheherazade) and the play, directed by Vyacheslav Shalevich, has been a continuous success for 12 seasons in a row. Since the 2004 premiere of 'Mademoiselle Nitouche', Grishayeva has been delivering critically acclaimed performances co-starring as Deniza opposite Viktor Dobronravov and Mariya Aronova. Nonna Grishayeva was designated Honorable Actress of Russia (2006). She is living and working in Moscow, Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmY2M2Y3ZTgtODVhYS00Y2MyLWEyNDItNDcxZTgxN2QyZTI1XkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342574","name":"Nonna Grishaeva","idIMDB":"nm0342574"},"actorId":"nm0342574","character":"Belka","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alicia Silverstone","urlProfile":"http://www.imdb.com/name/nm0000224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg4MDQ1MTc2Ml5BMl5BanBnXkFtZTgwOTA2MjQ4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1976","placeOfBirth":" San Francisco, California, USA","height":"5' 5\" (1.65 m)","bio":"Alicia Silverstone was born on October 4, 1976 in San Francisco, California, the youngest of three children. She is the daughter of Didi (Radford), a former flight attendant, and Monty Silverstone, a real-estate investor. Her English-born father is from a Jewish family, while her Scottish-born mother converted to Judaism. Alicia's career began at the tender age of six, when her father took some photos of his young daughter, which eventually led to her getting several television commercials. After a guest spot on The Wonder Years (1988) as a literal \"dream girl\", she moved on to movies. She landed a role in The Crush (1993), a sort of Fatal Attraction (1987) for teenagers in which she portrayed a disturbed young girl obsessed with an older man. The nasty little role did not impress the critical establishment but it wowed its target audience: teenagers. In fact, the role won her the 1994 MTV Movie Award for \"Best Villain\" and \"Breakthrough Performance\". It is interesting to note that during the filming of the movie, Alicia became an emancipated minor in order to get around child labor laws which would have interfered with her working hours. She was a dedicated actress from early on. The film also caught the attention of Aerosmith, who hired her to appear in a string of their music videos. The first of them, \"Cryin'\", was voted the #1 video of all time on MTV. Silverstone was definitely a hit with the MTV crowd, but larger commercial success still eluded her. That all changed when she landed the role of Cher in Amy Heckerling's Clueless (1995). Cher was the antithesis of Alicia's role in The Crush; this time around, she was a rich, naive yet endearing girl from Beverly Hills in search of love in the 1990s. The film was a huge box-office hit and wowed both audiences and critics alike and demonstrated Alicia's strength and bankability. She was hailed as the woman of the hour, and branded the spokeswoman for an emerging young generation. She signed a deal with Columbia TriStar worth $10 million and got the coveted role of Batgirl in the Batman franchise. Also, as part of the package, she got a three-year first-look deal for her own production company, First Kiss Productions. The first film released by First Kiss was Excess Baggage (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg4MDQ1MTc2Ml5BMl5BanBnXkFtZTgwOTA2MjQ4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000224","name":"Alicia Silverstone","nicknames":["Queen Slice"],"idIMDB":"nm0000224"},"actorId":"nm0000224","character":"Belka","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashlee Simpson","urlProfile":"http://www.imdb.com/name/nm1249883","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDA1NDA4NV5BMl5BanBnXkFtZTcwOTUyMjYwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1984","placeOfBirth":" Waco, Texas, USA","birthName":"Ashley Nicolle Simpson","height":"5' 4½\" (1.64 m)","bio":"Ashlee Nicolle Simpson was born on October 3, 1984 in Waco, Texas, to Tina Ann (Drew) and Joe Truett Simpson, a psychologist and Baptist youth minister. Ashlee started dancing at the age of 4 and by the time she was 11 enjoyed the status of being the youngest person ever admitted to the prestigious School of American Ballet. By 14, Ashlee was dancing professionally on the road with her older sister, pop singer Jessica Simpson. Ashlee spent 1999-2001 on tour supporting her sibling and garnering her own fan-base. She appeared on the big screen in the film The Hot Chick (2002) alongside Rob Schneider, and has made television appearances, including a guest-starring role on Malcolm in the Middle (2000). She has also appeared alongside her sister on Saved by the Bell: The New Class (1993), The Rosie O'Donnell Show (1996), The View (1997), The Tonight Show with Jay Leno (1992) and a Disney Christmas show and concert special. She trained with renowned acting coach Janet Alhanti. Ashlee enjoys spending her free time vintage shopping, writing and recording music and hanging out with friends. Her work includes two well-received CDs, \"Autobiography\" and \"I Am Me\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDA1NDA4NV5BMl5BanBnXkFtZTcwOTUyMjYwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1249883","name":"Ashlee Simpson","nicknames":["Ash"],"idIMDB":"nm1249883"},"actorId":"nm1249883","character":"Strelka","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maryana Spivak","urlProfile":"http://www.imdb.com/name/nm3539159","urlPhoto":"","biography":{"bio":"Maryana Spivak is an actress, known for Space Dogs: Adventure to the Moon (2014), Glukhar (2008) and Moskva - Ray (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3539159","name":"Maryana Spivak","idIMDB":"nm3539159"},"actorId":"nm3539159","character":"Strelka","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Evgeniy Mironov","urlProfile":"http://www.imdb.com/name/nm0592491","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk2YWM3YWEtMTc5ZC00M2QwLWE3MzctZWFiNzNhOTcyZmIzXkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1966","placeOfBirth":" Tatishchevo, Saratovskaya oblast, USSR","birthName":"Yevgeni Vitalyevich Mironov","bio":"An accomplished stage actor who, fresh from the theater academy, joined the chosen few of Oleg Tabakov's respected studio theater in 1990, Yevgeny Mironov first appeared on the silver screen in Alexander Kaidanovsky's 1988 film \"The Kerosene Salesman's Wife.\" He went on to pay Prince Myshkin in the popular television series based on Dostoyevksy's \"The Idiot.\" One of the leading Russian stars, Yevgeny Mironov received a Kinotavr award for best parts and a NIKA for best actor in 1994. He was honored with the Kumir prize in 1997. In addition to receiving the Russian State Prize, Mironov has been named both a Distinguished Artist of Russia and a People's Artist of Russia. A graduate of MKhAT, Mironov has been performing with Oleg Tabakov's theater since 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk2YWM3YWEtMTc5ZC00M2QwLWE3MzctZWFiNzNhOTcyZmIzXkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0592491","name":"Evgeniy Mironov","idIMDB":"nm0592491"},"actorId":"nm0592491","character":"Venya","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Witwer","urlProfile":"http://www.imdb.com/name/nm1022429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjQzNDY1Ml5BMl5BanBnXkFtZTgwNjY2NTYyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1977","placeOfBirth":" Glenview, Illinois, USA","birthName":"Samuel Stewart Witwer","height":"6' 1\" (1.85 m)","bio":"Sam Witwer headlines the SyFy series, Being Human, the U.S. adaptation of the popular British television series. The darkly humorous, provocative drama stars Sam as the heroic, \"Aidan\", a sensual and brooding vampire. His excellent work was noticed soon after the show's premiere, as Sam received a Gemini Award nomination for Best Performance by an Actor in a Continuing, Leading Dramatic Role in 2011. Feature film fans remember Sam as the sacrificed \"Wayne Jessup\" in The Mist, Frank Darabont's adaptation of the Stephen King novella. Two independent features in which Sam stars await release: The Return of Joe Rich, starring opposite Armand Assante and Talia Shire and No God, No Master starring with David Strathairn and Edoardo Ballerini. A favorite in the science-fiction world, Sam began his career in the memorable role of \"Lt. Crashdown\" in SyFy's Battlestar Galactica and played \"Davis Bloom/ Doomsday\", the character fated to kill Superman, on CW's Smallville. Star Wars fans and the gaming community will also recognize Sam as Darth Vader's vengeful apprentice, \"StarKiller\" in the LucasArts' video game sensation Star Wars: The Force Unleashed (Parts One and Two). Through high-tech digital referencing and motion capture, Sam has become the voice and face of this LucasArts' creation in which the first title grossed over 500 million dollars. Sam has also done extensive voice work for the fan-favorite Clone Wars, the animated series airing on the Cartoon Network. Working opposite Jon Favreau and Clancy Brown as the voice of \"Darth Maul\" on Clone Wars, Sam received recognition with an Annie Award nomination for Best Voice Acting in an Animated Television/ Broadcast Production in 2012. Outside of sci-fi, audiences remember Sam in his recurring role of \"Neil Perry\" on the Emmy winning Showtime series Dexter. Sam's edge was a perfect compliment to the ground-breaking series in its first season. A Chicago native and a Juilliard-trained actor, Sam is also an accomplished musician who performed in the LA music scene with his band, The Crashtones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjQzNDY1Ml5BMl5BanBnXkFtZTgwNjY2NTYyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1022429","name":"Sam Witwer","nicknames":["Stewart"],"idIMDB":"nm1022429"},"actorId":"nm1022429","character":"Kazbek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kira Buckland","urlProfile":"http://www.imdb.com/name/nm2299231","urlPhoto":"","biography":{"dateOfBirth":"16 July 1987","placeOfBirth":" Anchorage, Alaska, USA","height":"5' 4\" (1.63 m)","bio":"Kira Buckland began voice acting at the age of sixteen after having been introduced to the online voiceover community. She got her start voice acting in flash animations and games, and started getting noticed in the industry after winning Anime Expo 2007's Voice Actor Idol. After moving to Southern California from her hometown of Anchorage, Alaska, she soon landed her first anime roles as Kanae in \"Five Centimeters Per Second\", Eri in \"AIka R-16\" and Nimka in \"Moribito\", and began voice acting in video games such as Castle Crashers, Luminous Arc 2, and Dynasty Warriors 6: Empires. Her big break came when she landed the role of the final boss Bloody Marie in \"Skullgirls\". Most recently, she can be heard as Izumo Kamiki in \"Blue Exorcist\" and Madoka Kyouno in \"LaGrange\". Kira's hobbies include video games, singing, cosplay, espresso, and attending conventions.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2299231","name":"Kira Buckland","idIMDB":"nm2299231"},"actorId":"nm2299231","character":"Push","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Timur Rodriguez","urlProfile":"http://www.imdb.com/name/nm3482756","urlPhoto":"","biography":{"dateOfBirth":"14 October 1979","placeOfBirth":" Penza, Russian SFSR, USSR","bio":"Timur Rodriguez was born on October 14, 1979 in Penza, Russian SFSR, USSR. He is an actor, known for Premiya Muz-TV 2010 (2010), Novyy god v derevne Glukharevo (2010) and Premiya Muz-TV 2012 (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3482756","name":"Timur Rodriguez","idIMDB":"nm3482756"},"actorId":"nm3482756","character":"Banan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sergey Garmash","urlProfile":"http://www.imdb.com/name/nm0307628","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NzYxOTM1OV5BMl5BanBnXkFtZTcwNDQ2MDgwNw@@._V1_UY44_CR36,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1958","placeOfBirth":" Kherson, Ukrainian SSR, USSR [now Ukraine]","birthName":"Sergei Leonidovich Garmash","bio":"Sergey Garmash was born on September 1, 1958 in Kherson, Ukrainian SSR, USSR as Sergei Leonidovich Garmash. He is an actor, known for 12 (2007), Home (2011) and Our Own (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NzYxOTM1OV5BMl5BanBnXkFtZTcwNDQ2MDgwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0307628","name":"Sergey Garmash","idIMDB":"nm0307628"},"actorId":"nm0307628","character":"Kazbek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phil LaMarr","urlProfile":"http://www.imdb.com/name/nm0482851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDIzMTk4MF5BMl5BanBnXkFtZTcwNTg5ODE2Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1967","placeOfBirth":" Los Angeles, California, USA","birthName":"Phillip LaMarr","height":"5' 10\" (1.78 m)","bio":"A Los Angeles native, Phil is a graduate of Harvard-Westlake School, Yale University and The Groundlings Theater and is perhaps best known as one of the original cast members of MADtv (1995) and as Marvin in Pulp Fiction (1994). In addition to numerous appearances on stages across the country, in films and on TV, he also starred in and produced the comedy web series Inside the Legend (2012). He has also been profiled for his extensive voice-over work, which includes regular roles on animated series as well as parts in video games like Middle-Earth: Shadow of Mordor (2014) for which he won the NAVGTR Award for Best Supporting Actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDIzMTk4MF5BMl5BanBnXkFtZTcwNTg5ODE2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0482851","name":"Phil LaMarr","idIMDB":"nm0482851"},"actorId":"nm0482851","character":"Lenny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lev Akselrod","urlProfile":"http://www.imdb.com/name/nm6362470","urlPhoto":"","biography":{"bio":"Lev Akselrod is an actor, known for Space Dogs: Adventure to the Moon (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6362470","name":"Lev Akselrod","idIMDB":"nm6362470"},"actorId":"nm6362470","character":"Pushok","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Iliya Khtamtsov","urlProfile":"http://www.imdb.com/name/nm6362471","urlPhoto":"","biography":{"bio":"Iliya Khtamtsov is an actor, known for Space Dogs: Adventure to the Moon (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6362471","name":"Iliya Khtamtsov","idIMDB":"nm6362471"},"actorId":"nm6362471","character":"Pushok","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stasya Kudyakova","urlProfile":"http://www.imdb.com/name/nm6362472","urlPhoto":"","biography":{"bio":"Stasya Kudyakova is an actress, known for Space Dogs: Adventure to the Moon (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6362472","name":"Stasya Kudyakova","idIMDB":"nm6362472"},"actorId":"nm6362472","character":"Fifi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleksey Kolgan","urlProfile":"http://www.imdb.com/name/nm2366183","urlPhoto":"","biography":{"bio":"Aleksey Kolgan is an actor, known for Bukashki (2002), Ku! Kin-dza-dza (2013) and Alice's Birthday (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2366183","name":"Aleksey Kolgan","idIMDB":"nm2366183"},"actorId":"nm2366183","character":"Tomcat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roman Kvashnin","urlProfile":"http://www.imdb.com/name/nm4671580","urlPhoto":"","biography":{"bio":"Roman Kvashnin is an actor, known for Space Dogs: Adventure to the Moon (2014) and Tikhonya (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4671580","name":"Roman Kvashnin","idIMDB":"nm4671580"},"actorId":"nm4671580","character":"Hare","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3600950","urlIMDB":"http://www.imdb.com/title/tt3600950","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.1","filmingLocations":[],"rated":"G","awards":[{"award":"Golden Eagle Awards, Russia 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Eagle","categories":[{"category":"Best Animation Film","names":[{"name":"Aleksander Khramtsov","id":"nm3094147","role":"director"},{"name":"Inna Evlannikova","id":"nm3575075","role":"director"},{"name":"Vadim Sotskov","id":"nm2966130","role":"director"}]}]}]},{"award":"Motion Picture Sound Editors, USA 2017","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Direct to Video - Animation","names":[{"name":"Paul Hollman","id":"nm1103091","role":"supervising sound editor"},{"name":"Dan Snow","id":"nm0811254","role":"audio lead"},{"name":"Elliot Herman","id":"nm3300185","role":"dialogue editor"},{"name":"Josh Ellis","id":"nm5036695","role":"sound effects editor"},{"name":"Jody Berglund","id":"nm3110771","role":"foley artist"}]}]}]}],"votes":"207","type":"Movie","companyCreditsSimple":[{"idCompany":"co0474444","name":"KinoAtis"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:47:53"}}