{"data":{"movies":[{"title":"Perfect on Paper","originalTitle":"","year":"2014","releaseDate":"20140920","directors":[{"name":"Ron Oliver","id":"nm0646987"}],"writers":[{"name":"Jennifer Notas Shapiro","id":"nm1545296"},{"name":"Bob Sáenz","id":"nm0844554"}],"runtime":"82 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDM1ODQyOF5BMl5BanBnXkFtZTgwMjgyNjc5NTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family","Romance"],"plot":"A young woman moves to Los Angeles with the task of helping a famous author edit her upcoming romance novel. While dealing with the diva's many demands, she meets two men and realizes the best one for her might not necessarily be the one who looks best \"on paper.\"","simplePlot":"A young woman moves to Los Angeles with the task of helping a famous author edit her upcoming romance novel. While dealing with the diva's many demands, she meets two men and realizes the ... ","actors":[{"actorName":"Lindsay Hartley","urlProfile":"http://www.imdb.com/name/nm0005102","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdkMGVhMjctYTBiZS00Y2RkLTliNDUtMzg2ZThhMGNkYjc2L2ltYWdlXkEyXkFqcGdeQXVyMjA4NzM5MDU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1978","placeOfBirth":" Rancho Mirage, Palm Springs, California, USA","birthName":"Lindsay Nicole Korman","height":"5' 3\" (1.6 m)","bio":"Lindsay Hartley is an American actress and singer. She was born Lindsay Nicole Korman in Palm Springs, California, and is of Ashkenazi Jewish (father) and Greek and Italian (mother) origin. Singing since age eleven, Hartley was a national pre-teen talent winner of the Young Miss America Beauty Pageant. At the age of 14, she landed her first professional role, playing Dorothy in the Wizard of Oz, at the Mc Callum Theatre in Palm Desert, California. At 16, Hartley and her family relocated to Las Vegas, Nevada, where she graduated a year early from high school and headlined as the lead vocalist in the Las Vegas Sands Hotel afternoon show, Viva Las Vegas. Shortly after attending the University of Nevada, Las Vegas, Hartley had the great honor to move to New York City and perform on Broadway, in the hit musical, Grease!. Hartley has won several national vocal competitions, including The Los Angeles Philharmonic's Award-Vocal/Opera, Hartley is most notably know for portraying the hopeless romantic, Theresa Lopez-Fitzgerald, on the NBC soap opera, Passions (1999), from 1999-2008. In 2000, she was not only nominated for the Soap Opera Digest Award for Outstanding Female Newcomer, she wrote the song, Kiss Me, for her character, which she performed that year on the show. In 2009, Soap Opera Digest announced that Hartley would join the cast of Days of Our Lives (1965), another NBC soap opera, The following year, Hartley signed on to play the new character of Cara Castillo on All My Children (1970). She was also cast as DC Comics character, Mad Harriet, during Smallville (2001)'s tenth and final season. In 2013, Hartley once again played the role of Dr. Cara Castillo on the new All My Children (2013), being revived by Prospect Park. After landing her first lead in a movie entitled, Perfect on Paper (2014), Hartley joined the cast of Queens of Drama (2015). Look out for Lindsay in her latest films on Lifetime, Nightmare Nurse (2016) , Dying to Be Loved (2016) The Student (2017), It Happened One Valentines Day (2017) as well as Death House (2017), where she takes on the role of the ultimate of all evils, Balthoria, which will be released in theaters in 2017. Lindsay lives in Los Angeles with her daughter, Isabella Justice Hartley, who was born on July 3, 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdkMGVhMjctYTBiZS00Y2RkLTliNDUtMzg2ZThhMGNkYjc2L2ltYWdlXkEyXkFqcGdeQXVyMjA4NzM5MDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005102","name":"Lindsay Hartley","idIMDB":"nm0005102"},"actorId":"nm0005102","character":"Natalie Holland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan Fairchild","urlProfile":"http://www.imdb.com/name/nm0000392","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODQyOTU1MV5BMl5BanBnXkFtZTcwMDY5MjE3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1950","placeOfBirth":" Dallas, Texas, USA","birthName":"Patsy Ann McClenny","height":"5' 4\" (1.63 m)","bio":"This elegant lady defined the television version of the rich, sophisticated businesswoman who knows what she wants, and will do whatever it takes to get it. She was born Patsy Ann McClenny on February 3, 1950 in Dallas, Texas. She began acting as a child, when her mother enrolled her in drama lessons after she was too shy to give a book report in class. From the age of 10, she performed in children's plays. Later, she would do dinner theater and stock productions in Dallas. She chose Morgan as a stage name. In 1973, Morgan decided to pursue a career in television; just 6 weeks after moving to New York, she landed the key role of Jennifer in the daytime soap opera Search for Tomorrow (1951); she stayed on until 1977. Morgan moved to Los Angeles, where she originated the role of Jenna Wade on the wildly popular nighttime soap opera Dallas (1978) (Jenna was later portrayed by Priscilla Presley). Morgan made numerous guest appearances on television series. She played Constance (Weldon) Carlyle in Flamingo Road (1980), and she was nominated for a Golden Globe for Best Actress; that was her breakout series that propelled her to stardom. Morgan continued to perform in live theater, her acclaimed portrayal of Skye in the off-Broadway comedy \"Geniuses\" helped make it one of the \"Top Ten Plays\" of the year according to Time Magazine and the New York Times. Other stage appearances have included productions of \"Goodbye Charlie\" and \"Gentlemen Prefer Blondes.\" On television, she played the naughty Racine in the soap opera Paper Dolls (1984) in 1984. Later, she starred in the soap opera Falcon Crest (1981) from 1985-86, having made a niche for herself playing ambitious beauties. Morgan received an Emmy nomination for a special episode of Murphy Brown (1988). Morgan has shared some of her beauty secrets by authoring the book \"Super Looks\" which is a complete guide that includes makeup, exercise, and diet tips. Morgan is a member of the Entertainment Industry AIDS Task Force. She is an active speaker on environmental issues and helped found the Environmental Communications Office, which encourages entertainment industry professionals to become better educated and more active on environmental issues. Morgan is a collector of movie memorabilia (particularly anything about Marilyn Monroe) and antique clothing. She is a ballet fan and is also interested in anthropology and paleontology; Morgan is truly a brainy beauty.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODQyOTU1MV5BMl5BanBnXkFtZTcwMDY5MjE3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000392","name":"Morgan Fairchild","nicknames":["Little Bird"],"idIMDB":"nm0000392"},"actorId":"nm0000392","character":"Beverly Wilcox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Haley Strode","urlProfile":"http://www.imdb.com/name/nm2973097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDcwMTM4N15BMl5BanBnXkFtZTcwNDAwNjU5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Haley Anne Strode","height":"5' 6\" (1.68 m)","bio":"Haley Strode is versatile actress with a gift for crossing genre and delivering noteworthy performances on both the small and big screens. She was born on June 23, in Owensboro, Kentucky, to Karen, a teacher, and Richard, a farmer. She is the youngest of three, with two older brothers. She grew up on her family's fourth generation farm in the nearby town of Stanley. She attended the The University of Mississippi, spending the next four years studying under her mentor, Joe Turner Cantu, in an immersive acting studio. Starring in several stage productions such as A Streetcar Named Desire as Stella, Noises Off! as Brooke, and The Importance of Being Earnest as Cecily, she received her Bachelor of Fine Arts Degree in Theatre Arts. Upon graduation, Strode moved to Los Angeles. Having a knack for comedy, Strode appeared in several Comedy Central shows and roles on NBC's Whitney and The New Normal. She booked her first series lead on the multi-cam show, for Nick@Nite, Wendell & Vinnie, created by Emmy-Award winner Jay Kogen. With a background in theatre, shooting in front of a live audience was the perfect synthesis of her talents. She starred in 20 episodes of the show. In 2012, Strode filmed the pilot episode of Mob City, executive produced, written and directed by Frank Darabont. That same year, she also appeared in the Warner Bros. release Gangster Squad, directed by Ruben Fleischer. She played the role of Marcia Keeler, alongside Giovanni Ribisi and Josh Brolin. In 2015, Strode portrayed the role of real-life NASA wife Jane Conrad on ABC's drama series, The Astronaut's Wives Club, created by Stephanie Savage. She also starred in ABC's crime drama series Wicked City, created by Steven Baigelman, as Rita Forrester, a 'Marilyn Monroe wannabe', in the 1960's,","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDcwMTM4N15BMl5BanBnXkFtZTcwNDAwNjU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2973097","name":"Haley Strode","idIMDB":"nm2973097"},"actorId":"nm2973097","character":"Avery Goldstein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Costello","urlProfile":"http://www.imdb.com/name/nm1843641","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc3Njg0OTcyNl5BMl5BanBnXkFtZTgwNzQ0OTUxMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1977","placeOfBirth":" Birmingham, Alabama, USA","birthName":"Thomas G. Costello","height":"5' 10\" (1.78 m)","bio":"Tom Costello was born on August 31, 1977 in Birmingham, Alabama, USA as Thomas G. Costello. He is an actor, known for Dark Skies (2013), Peaceful Warrior (2006) and Searching for Fortune (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc3Njg0OTcyNl5BMl5BanBnXkFtZTgwNzQ0OTUxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1843641","name":"Tom Costello","idIMDB":"nm1843641"},"actorId":"nm1843641","character":"Taco Guy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Drew Fuller","urlProfile":"http://www.imdb.com/name/nm0298221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA2ODYyOTczMF5BMl5BanBnXkFtZTgwOTQ3NjYwMDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1980","placeOfBirth":" Atherton, California, USA","birthName":"Andrew Alan Fuller","height":"6' 1\" (1.85 m)","bio":"Drew Fuller was born on May 19, 1980 in Atherton, California, USA as Andrew Alan Fuller. He is an actor and producer, known for Army Wives (2007), Charmed (1998) and The Ultimate Gift (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA2ODYyOTczMF5BMl5BanBnXkFtZTgwOTQ3NjYwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298221","name":"Drew Fuller","idIMDB":"nm0298221"},"actorId":"nm0298221","character":"Coop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katie Gill","urlProfile":"http://www.imdb.com/name/nm0318694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDViMTMtMjg2MC00NTkzLWFmOWMtNDcyYzNmNzBjYWJhXkEyXkFqcGdeQXVyMTU0NTE5MDM@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1985","placeOfBirth":" Santa Monica, California, USA","birthName":"Katharine Elizabeth Gill","height":"5' 6\" (1.68 m)","bio":"Katharine Elizabeth Gill was born in Santa Monica, California. She is the daughter of actress Morgan Brittany, known for the TV show Dallas in the 1980's and stunt coordinator/2nd unit director Jack Gill. After completing schooling at Agoura High School, Katie moved to Osaka, Japan to work for various print agencies. Upon her return, she started acting at the age of 19 and attended the Joanne Baron/D.W. Brown Studio where she graduated with two years of intensive training. She also traveled to London to attend the Royal Academy of Dramatic Art. She returned to California to work on feature films and various TV shows. While pursuing her career, Katie was also attending college at Cal State University Channel Islands where she graduated with a BA in Art History. With her younger Brother as a talented musician, Katie has performed on stage, singing Jazz and various pop songs. She is an avid snowboarder, dancer (Tap, Jazz, and hip hop) and dirt bike rider. She has been all over the world and enjoys her fast-paced lifestyle with her family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDViMTMtMjg2MC00NTkzLWFmOWMtNDcyYzNmNzBjYWJhXkEyXkFqcGdeQXVyMTU0NTE5MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0318694","name":"Katie Gill","idIMDB":"nm0318694"},"actorId":"nm0318694","character":"Isabelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tina Huang","urlProfile":"http://www.imdb.com/name/nm2641271","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3ODc4MDQ1Nl5BMl5BanBnXkFtZTgwNzMyNTMxODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tina Huang is an actress and writer, known for Rizzoli & Isles (2010), The Night Shift (2014) and Shameless (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3ODc4MDQ1Nl5BMl5BanBnXkFtZTgwNzMyNTMxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2641271","name":"Tina Huang","idIMDB":"nm2641271"},"actorId":"nm2641271","character":"Lisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kieren Hutchison","urlProfile":"http://www.imdb.com/name/nm0404456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q4MGFiZTQtZjVmMi00NWIzLTg1OGUtYmMyMWE5ZThmODY4XkEyXkFqcGdeQXVyMjQxMDE5ODc@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1974","placeOfBirth":" Auckland, New Zealand","birthName":"Kieren Robert Hutchison","bio":"Kieren Hutchison was born on October 9, 1974 in Auckland, New Zealand as Kieren Robert Hutchison. He is an actor, known for The Legend of William Tell (1998), One Tree Hill (2003) and Flower Girl (2009). He has been married to Nicole Tubiola since August 10, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q4MGFiZTQtZjVmMi00NWIzLTg1OGUtYmMyMWE5ZThmODY4XkEyXkFqcGdeQXVyMjQxMDE5ODc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0404456","name":"Kieren Hutchison","idIMDB":"nm0404456"},"actorId":"nm0404456","character":"Bob Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryce Clyde Jenkins","urlProfile":"http://www.imdb.com/name/nm3257311","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjIwMTQ5MV5BMl5BanBnXkFtZTcwMzczNDY4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Bryce Clyde Jenkins moved from New Orleans to Los Angeles with his family in 2003 when he was just three years old so Bryce's father could pursue his acting career. At that time, it was unforeseen that Bryce would soon be following in his father's footsteps. In 2008, Bryce landed a lead in the short film, \"My Homework Ate My Dog,\" and since that time, has landed roles in feature films such as \"Easy A\" and \"The To-Do-List.\" Bryce has also appeared on various TV shows such as \"CSI Miami,\" \"Outlaw,\" \"The Mentalist,\" and Hallmark TV movies, \"Have A Little Faith\" and \"The Watsons Go To Birmingham.\" In \"The Watsons Go To Birmingham,\" Bryce plays 11 year old Kenny Watson, from whose perspective the story of the historically factual 1963 Birmingham church bombings is told. Under further guidance from Director Leon, Bryce's greatest accomplishment thus far has been his recent role as Travis Younger in Broadway's A Raisin in the Sun, where Bryce at 13 years old made his Broadway debut performing opposite such greats as Denzel Washington, LaTanya Richardson Jackson and Sophie Okonedo. When he ran for Student Council President of his elementary school, he won hands down. To top off his last year in elementary school, Bryce earned the President's Gold Award for Educational Excellence, receiving the Outstanding Academic Excellence Award. Bryce loves basketball, swimming and playing video games with his friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjIwMTQ5MV5BMl5BanBnXkFtZTcwMzczNDY4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3257311","name":"Bryce Clyde Jenkins","idIMDB":"nm3257311"},"actorId":"nm3257311","character":"Eli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bart Johnson","urlProfile":"http://www.imdb.com/name/nm0424559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzA4Mzg5Ml5BMl5BanBnXkFtZTcwMTEzMDgyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1970","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Barton Robert Johnson","height":"6' 3\" (1.91 m)","bio":"Bart Johnson was born on December 13, 1970 in Hollywood, Los Angeles, California, USA as Barton Robert Johnson. He is an actor and director, known for High School Musical (2006), High School Musical 2 (2007) and High School Musical 3: Senior Year (2008). He has been married to Robyn Lively since September 25, 1999. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzA4Mzg5Ml5BMl5BanBnXkFtZTcwMTEzMDgyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424559","name":"Bart Johnson","idIMDB":"nm0424559"},"actorId":"nm0424559","character":"Ben Goldstein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tico Wells","urlProfile":"http://www.imdb.com/name/nm0920446","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTVhZDllZjYtYjk1OC00M2I1LTg3OGMtNDk0Y2M0YzRkYmIzL2ltYWdlXkEyXkFqcGdeQXVyMjA0NTIzNjA@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Tico Wells is an actor, known for Universal Soldier (1992), The Relic (1997) and The Five Heartbeats (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTVhZDllZjYtYjk1OC00M2I1LTg3OGMtNDk0Y2M0YzRkYmIzL2ltYWdlXkEyXkFqcGdeQXVyMjA0NTIzNjA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0920446","name":"Tico Wells","idIMDB":"nm0920446"},"actorId":"nm0920446","character":"Jake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Wusah","urlProfile":"http://www.imdb.com/name/nm5243917","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk3OGI4YWQtMTc0YS00MmMyLWIwOTctYWRjOTQ1MzFkNGUwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Originally from New York City, Taiwanese-American Actor, Dancer, and Martial Artist John Wusah spent four years in the Entertainment Industry in Taiwan as an actor and top dancer and choreographer before moving to Los Angeles to further his growing film career. His dance credits in Los Angeles included Disney's Shake It Up and the singing show The Voice. His acting career took off with national commercials including Acura, Valvoline and Old Dominion, modeling opportunities, and numerous roles in films and television including the huge, iconic series Mortal Kombat: Legacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk3OGI4YWQtMTc0YS00MmMyLWIwOTctYWRjOTQ1MzFkNGUwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5243917","name":"John Wusah","idIMDB":"nm5243917"},"actorId":"nm5243917","character":"Alfonso","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3630228","urlIMDB":"http://www.imdb.com/title/tt3630228","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 22 min (82 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","filmingLocations":[],"rated":"TV-G","awards":[],"votes":"631","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0045255","name":"Larry Levinson Productions"},{"idCompany":"co0549026","name":"Sandover Productions"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 23:58:53"}}