{"data":{"movies":[{"title":"Irrational Man","originalTitle":"","year":"2015","releaseDate":"20150807","directors":[{"name":"Woody Allen","id":"nm0000095"}],"writers":[{"name":"Woody Allen","id":"nm0000095"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTM0Mzk5Ml5BMl5BanBnXkFtZTgwMzQ3Njc3NTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"A new philosophy professor arrives on a small town campus near Newport, Rhode Island. His name, Abe Lucas. His reputation : bad. Abe is said to be a womanizer and an alcoholic. But what people do not know is that he is a disillusioned idealist. Since he has become aware of his inability to change the world, he has indeed been living in a state of deep nihilism and arrogant desperation. In class, he only goes through the motions and outside he drinks too much. But as far as sex is concerned, he is just a shadow of himself now: depression is not synonymous with Viagra! For all that, he can't help being attracted to one of his students, pretty and bright Jill Pollard. He enters into a relationship with her which remains platonic, even if Jill would not say no to more. The situation remains unchanged for a while until, one day, in a diner, Abe and Jill surprise a conversation that will change the course of their lives dramatically...","simplePlot":"A tormented philosophy professor finds a will to live when he commits an existential act.","actors":[{"actorName":"Joaquin Phoenix","urlProfile":"http://www.imdb.com/name/nm0001618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAzNjg5MDE3N15BMl5BanBnXkFtZTcwMjIxNzU0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1974","placeOfBirth":" San Juan, Puerto Rico","birthName":"Joaquin Rafael Bottom","height":"5' 8\" (1.73 m)","bio":"Joaquin Rafael Phoenix was born in San Juan, Puerto Rico, to Arlyn (Dunetz) and John Bottom, and is the middle child in a brood of five. His parents, from the continental United States, were then serving as Children of God missionaries. His mother is from a Jewish family in New York, while his father, from California, is of mostly British Isles descent. As a youngster, Joaquin took his cues from older siblings River Phoenix and Rain Phoenix, changing his name to Leaf to match their earthier monikers. When the children were encouraged to develop their creative instincts, he followed their lead into acting. Younger sisters Liberty Phoenix and Summer Phoenix rounded out the talented troupe. The family moved often, traveling through Central and South America (and adopting the surname \"Phoenix\" to celebrate their new beginnings) but, by the time Joaquin was age 6, they had more or less settled in the Los Angeles area. Arlyn found work as a secretary at NBC, and John turned his talents to landscaping. They eventually found an agent who was willing to represent all five children, and the younger generation dove into television work. Commercials for meat, milk, and junk food were off-limits (the kids were all raised as strict vegans), but they managed to find plenty of work pushing other, less sinister products. Joaquin's first real acting gig was a guest appearance on River's sitcom, Seven Brides for Seven Brothers (1982). He worked with his brother again on the afterschool special ABC Afterschool Specials: Backwards: The Riddle of Dyslexia (1984), then struck out on his own in other made-for-TV productions. He made his big-screen debut as the youngest crew member in the interstellar romp SpaceCamp (1986), then won his first starring turn in the Cold War-era drama Russkies (1987). In the late '80s, the Phoenix clan decided to pull up stakes and relocate again--this time to Florida. River's film career had enough momentum to sustain the move, but Joaquin wasn't sure what lay in store for him in the Sunshine State. As it happened, Universal Pictures had just opened a new studio in the area and he was cast almost immediately as an angst-ridden adolescent in Parenthood (1989). His performance was very well-received, but Joaquin decided to withdraw from acting for a while--he was frustrated with the dearth of interesting roles for actors his age, and he wanted to see more of the world. His parents were in the process of separating, so he struck out for Mexico with his father. Joaquin returned to the public eye three years later under tragic circumstances. On October 31, 1993, he was at The Viper Room (a Los Angeles nightclub partly-owned by Johnny Depp) when his brother River collapsed from a drug overdose and later died. Joaquin made the call to 911, which was rebroadcast on radio and television the world over. Months later, at the insistence of friends and colleagues, Joaquin began reading through scripts again, but he was reluctant to re-enter the acting life until he found just the right part. He finally signed up to work with Gus Van Sant (who had directed River in My Own Private Idaho (1991) and Even Cowgirls Get the Blues (1993)) to star as Nicole Kidman's obsessive devotee in To Die For (1995). The performance made Joaquin (who had dropped Leaf and reverted to his birth name) a critics' darling in his own right. His follow-up turn in Inventing the Abbotts (1997) scored more critical kudos and, perhaps more importantly, introduced him to future fiancée Liv Tyler. (The pair dated for almost three years.) He returned to the big screen later that year with a supporting role in Oliver Stone's U Turn - Ici commence l'enfer (1997), then played a locked-up drug scapegoat in Return to Paradise (1998). He and \"Paradise\" co-star Vince Vaughn re-teamed almost immediately for the small-town murder caper Clay Pigeons (1998), which Joaquin followed with a turn as a porn store clerk in 8 mm (1999). The film that confirmed Phoenix as a star was the historical epic Gladiator (2000). The Roman epic cast him as the selfish, paranoid young emperor Commodus opposite Russell Crowe's swarthy hero. Determined to make his character as real as possible, Phoenix gained weight and cultivated a pasty complexion during the shoot. He received international attention and an Academy Award nomination for Best Supporting Actor for that role. Later that year, he appeared in two indies, playing a dock worker in The Yards (2000) (which he counts among his favorite experiences--and one of the only films of his that he can sit through) and the priest in charge of the Marquis de Sade's asylum in Quills (2000). He received an Academy Award nomination for Best Actor as the legendary musician Johnny Cash in the biography Walk the Line (2005). He also recorded an album, the film's soundtrack, for which he received the Grammy Award for Best Compilation Soundtrack for Visual Media.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAzNjg5MDE3N15BMl5BanBnXkFtZTcwMjIxNzU0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001618","name":"Joaquin Phoenix","nicknames":["Kitten","Joaq","Leaf"],"idIMDB":"nm0001618"},"actorId":"nm0001618","character":"Abe Lucas","urlCharacter":"http://www.imdb.com/character/ch0525373","main":true},{"actorName":"Emma Stone","urlProfile":"http://www.imdb.com/name/nm1297015","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjM1NDkyN15BMl5BanBnXkFtZTgwODgyNTY1MjE@._V1.._UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1988","placeOfBirth":" Scottsdale, Arizona, USA","birthName":"Emily Jean Stone","height":"5' 6\" (1.68 m)","bio":"Emily Jean \"Emma\" Stone was born in Scottsdale, Arizona, to Krista (Yeager), a homemaker, and Jeffrey Charles Stone, a contracting company founder and CEO. She is of Swedish (from her paternal grandfather), English, German, Scottish, and Irish descent. Stone began acting as a child as a member of the Valley Youth Theatre in Phoenix, Arizona, where she made her stage debut in a production of Kenneth Grahame's \"The Wind in the Willows\". She appeared in many more productions through her early teens until, at the age of 15, she decided that she wanted to make acting her career. The official story is that she made a PowerPoint presentation, backed by Madonna's \"Hollywood\" and itself entitled \"Project Hollywood\", in an attempt to persuade her parents to allow her to drop out of school and move to Los Angeles. The pitch was successful and she and her mother moved to LA with her schooling completed at home while she spent her days auditioning. She had her TV breakthrough when she won the part of Laurie Partridge in the VH1 talent/reality show In Search of the Partridge Family (2004) which led to a number of small TV roles in the following years. Her movie debut was as Jules in Superbad (2007) and, after a string of successful performances, her leading role as Olive in Easy A (2010) established her as a star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjM1NDkyN15BMl5BanBnXkFtZTgwODgyNTY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1297015","name":"Emma Stone","idIMDB":"nm1297015"},"actorId":"nm1297015","character":"Jill Pollard","urlCharacter":"http://www.imdb.com/character/ch0510846","main":true},{"actorName":"Joe Stapleton","urlProfile":"http://www.imdb.com/name/nm1369571","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMTgxNDIyOF5BMl5BanBnXkFtZTcwODYyMjU2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Joe Stapleton is an actor, known for Mystic River (2003), Spotlight (2015) and Irrational Man (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMTgxNDIyOF5BMl5BanBnXkFtZTcwODYyMjU2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1369571","name":"Joe Stapleton","idIMDB":"nm1369571"},"actorId":"nm1369571","character":"Professor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Carroll","urlProfile":"http://www.imdb.com/name/nm7437351","urlPhoto":"","biography":{"bio":"Nancy Carroll is an actress, known for Irrational Man (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7437351","name":"Nancy Carroll","idIMDB":"nm7437351"},"actorId":"nm7437351","character":"Professor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allison Gallerani","urlProfile":"http://www.imdb.com/name/nm7437352","urlPhoto":"","biography":{"bio":"Allison Gallerani is an actress, known for Irrational Man (2015) and Cortex.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7437352","name":"Allison Gallerani","idIMDB":"nm7437352"},"actorId":"nm7437352","character":"Braylin Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brigette Lundy-Paine","urlProfile":"http://www.imdb.com/name/nm6617420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4ODMyMDA1OF5BMl5BanBnXkFtZTgwNTQ4ODM1NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 8½\" (1.74 m)","bio":"Brigette Lundy-Paine is an American actor. She graduated from NYU Tisch from the Atlantic Theatre School in 2016. She considers her acting career to be a side show to her career as a pop star in the Improvisational Voice Band, \"Subtle Pride\" (ft. Mina Walker, Zach Donovan and Misha Brooks). Her parents and Laura and Robert Lundy-Paine, both actors/producers in the Bay Area. Brigette has been performing since birth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk4ODMyMDA1OF5BMl5BanBnXkFtZTgwNTQ4ODM1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6617420","name":"Brigette Lundy-Paine","idIMDB":"nm6617420"},"actorId":"nm6617420","character":"Braylin Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katelyn Semer","urlProfile":"http://www.imdb.com/name/nm7437353","urlPhoto":"","biography":{"bio":"Katelyn Semer is an actress, known for Irrational Man (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7437353","name":"Katelyn Semer","idIMDB":"nm7437353"},"actorId":"nm7437353","character":"Braylin Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betsy Aidem","urlProfile":"http://www.imdb.com/name/nm0014483","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTM2NTI1MF5BMl5BanBnXkFtZTcwMDE5NzMxOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1957","placeOfBirth":" East Meadow, Long Island, New York, USA","bio":"Betsy Aidem was born on October 28, 1957 in East Meadow, Long Island, New York, USA. She is an actress, known for Irrational Man (2015), Margaret (2011) and The Americans (2013). She was previously married to William Fichtner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTM2NTI1MF5BMl5BanBnXkFtZTcwMDE5NzMxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0014483","name":"Betsy Aidem","idIMDB":"nm0014483"},"actorId":"nm0014483","character":"Jill's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ethan Phillips","urlProfile":"http://www.imdb.com/name/nm0680392","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0Mzk3MzUxOV5BMl5BanBnXkFtZTgwMzIxMjU4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1955","placeOfBirth":" Garden City, Long Island, New York, USA","height":"5' 6\" (1.68 m)","bio":"Ethan Phillips was born on February 8, 1955 in Garden City, Long Island, New York as the only boy of six children. He graduated from Boston University with a degree in English Literature and received a Masters Degree in Fine Arts from Cornell University. He began his acting career on stage in both Broadway and off-Broadway shows, recently appearing in the premier of David Mamet's \"November\" with Nathan Lane at Broadway's Ethyl Barrymore and in the title character opposite Peter Dinklage in the all-male cast of \"The Imaginary Invalid\" for Bard College's SummerScape Festival 2012. Also in New York, \"My Favorite Year\" at Lincoln Center, \"Measure for Measure\" for the NYSF, \"Lips Together Teeth Apart\" for Manhattan Theatre Club, and \"Modigliani\" at the Astor Place, as well as new works for Playwrites Horizons, Ensemble Studio Theatre, the Hudson Guild Theatre, the American Jewish Theatre, and many others. During his comprehensive acting career, he also played leading roles for many of the major regional theaters around the country such as San Diego Old Globe, Seattle Rep, Alaska Rep, Actors' Theatre of Louisville, Mark Taper Forum, Baltimore Center Stage, the Geffen in Los Angeles, Pasadena Playhouse, Westport Country Playhouse, the McCarter Theatre, and the Boston Shakespeare Company. He spent ten summers at the Sundance Theatre Lab and is a co-founder of First Stage in Los Angeles, which has been developing new plays for over twenty years. Phillips has been on several popular TV shows and movies, including five seasons on Benson (1979), and seven seasons on Star Trek: Voyager (1995). He has been a guest star on scores of other television shows. Ethan has appeared in many feature films and award winning shorts and has an active voice-over career. Phillips is also a playwright and an author. His original play, \"Penguin Blues\" has been produced more than 150 times throughout USA and Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0Mzk3MzUxOV5BMl5BanBnXkFtZTgwMzIxMjU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0680392","name":"Ethan Phillips","nicknames":["Johnny"],"idIMDB":"nm0680392"},"actorId":"nm0680392","character":"Jill's Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamie Blackley","urlProfile":"http://www.imdb.com/name/nm3284401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1Njc2OV5BMl5BanBnXkFtZTgwNzA5ODkzMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1991","placeOfBirth":" Douglas, Isle of Man, UK","birthName":"Jamie Alexander Blackley","height":"6' (1.83 m)","bio":"Jamie Blackley was born on July 8, 1991 in Douglas, Isle of Man, UK as Jamie Alexander Blackley. He is an actor, known for If I Stay (2014), Irrational Man (2015) and U Want Me 2 Kill Him? (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1Njc2OV5BMl5BanBnXkFtZTgwNzA5ODkzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3284401","name":"Jamie Blackley","idIMDB":"nm3284401"},"actorId":"nm3284401","character":"Roy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leah Anderson","urlProfile":"http://www.imdb.com/name/nm7437354","urlPhoto":"","biography":{"bio":"Leah Anderson is an actress, known for Irrational Man (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7437354","name":"Leah Anderson","idIMDB":"nm7437354"},"actorId":"nm7437354","character":"Student Giving Directions","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Plum","urlProfile":"http://www.imdb.com/name/nm0687560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjEzNTMwOTQ4MF5BMl5BanBnXkFtZTgwNDUyMTMwMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"won Best Actress Award at 1995 Boston Theatre Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjEzNTMwOTQ4MF5BMl5BanBnXkFtZTgwNDUyMTMwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0687560","name":"Paula Plum","idIMDB":"nm0687560"},"actorId":"nm0687560","character":"College President","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Giles","urlProfile":"http://www.imdb.com/name/nm0318481","urlPhoto":"","biography":{"dateOfBirth":"17 July 1960","placeOfBirth":" New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Nancy Giles was born on July 17, 1960 in New York City, New York, USA. She is an actress and writer, known for Big (1988), China Beach (1988) and Working Girl (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0318481","name":"Nancy Giles","idIMDB":"nm0318481"},"actorId":"nm0318481","character":"President's Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henry Stram","urlProfile":"http://www.imdb.com/name/nm0833225","urlPhoto":"","biography":{"dateOfBirth":"10 September 1954","placeOfBirth":" Lafayette, Indiana, USA","bio":"Henry Stram was born on September 10, 1954 in Lafayette, Indiana, USA. He is an actor, known for Requiem for a Dream (2000), Sleepers (1996) and Irrational Man (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0833225","name":"Henry Stram","idIMDB":"nm0833225"},"actorId":"nm0833225","character":"Cocktail Party Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geoff Schuppert","urlProfile":"http://www.imdb.com/name/nm4801913","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MTQzNTkzN15BMl5BanBnXkFtZTgwNTM2MzgyMjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Geoff was born and raised in Middlebury, Vermont. He graduated from Middlebury Union High School in 1987. He then studied Theatre and Archaeology at the University of Vermont, graduating in 1991. He earned his M.F.A. in Acting at the University of North Carolina-Greensboro in 2000. He moved to Brooklyn, NY in 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MTQzNTkzN15BMl5BanBnXkFtZTgwNTM2MzgyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4801913","name":"Geoff Schuppert","idIMDB":"nm4801913"},"actorId":"nm4801913","character":"Cocktail Party Guest","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3715320","urlIMDB":"http://www.imdb.com/title/tt3715320","business":{"budget":{"money":"$11,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$175,312","country":"USA","day":"19","month":"07","year":"2015","remarks":"5 Screens"}],"gross":[{"money":"$3,996,947","country":"USA","day":"11","month":"10","year":"2015","remarks":""},{"money":"$3,970,735","country":"USA","day":"04","month":"10","year":"2015","remarks":""},{"money":"$3,947,220","country":"USA","day":"27","month":"09","year":"2015","remarks":""},{"money":"$3,918,699","country":"USA","day":"20","month":"09","year":"2015","remarks":""},{"money":"$3,875,769","country":"USA","day":"13","month":"09","year":"2015","remarks":""},{"money":"$3,716,077","country":"USA","day":"30","month":"08","year":"2015","remarks":""},{"money":"$3,514,455","country":"USA","day":"23","month":"08","year":"2015","remarks":""},{"money":"$2,203,947","country":"USA","day":"09","month":"08","year":"2015","remarks":""},{"money":"$1,134,297","country":"USA","day":"02","month":"08","year":"2015","remarks":""},{"money":"$175,312","country":"USA","day":"19","month":"07","year":"2015","remarks":""},{"money":"€3,231,872","country":"Italy","day":"17","month":"01","year":"2016","remarks":""},{"money":"€3,180,102","country":"Italy","day":"10","month":"01","year":"2016","remarks":""},{"money":"€2,948,527","country":"Italy","day":"03","month":"01","year":"2016","remarks":""},{"money":"€2,081,614","country":"Italy","day":"27","month":"12","year":"2015","remarks":""},{"money":"€736,258","country":"Italy","day":"20","month":"12","year":"2015","remarks":""}],"weekendGross":[{"money":"$19,232","country":"USA","day":"11","month":"10","year":"2015","remarks":"30 Screens"},{"money":"$15,465","country":"USA","day":"04","month":"10","year":"2015","remarks":"33 Screens"},{"money":"$17,620","country":"USA","day":"27","month":"09","year":"2015","remarks":"30 Screens"},{"money":"$25,971","country":"USA","day":"20","month":"09","year":"2015","remarks":"33 Screens"},{"money":"$35,693","country":"USA","day":"13","month":"09","year":"2015","remarks":"47 Screens"},{"money":"$100,601","country":"USA","day":"30","month":"08","year":"2015","remarks":"91 Screens"},{"money":"$214,314","country":"USA","day":"23","month":"08","year":"2015","remarks":"185 Screens"},{"money":"$836,034","country":"USA","day":"09","month":"08","year":"2015","remarks":"925 Screens"},{"money":"$496,966","country":"USA","day":"02","month":"08","year":"2015","remarks":"135 Screens"},{"money":"$175,312","country":"USA","day":"19","month":"07","year":"2015","remarks":"5 Screens"}],"admissions":[{"money":"970,267","country":"France","day":"26","month":"01","year":"2016","remarks":""},{"money":"937,149","country":"France","day":"08","month":"12","year":"2015","remarks":""},{"money":"833,964","country":"France","day":"10","month":"11","year":"2015","remarks":""},{"money":"744,660","country":"France","day":"03","month":"11","year":"2015","remarks":""},{"money":"603,515","country":"France","day":"27","month":"10","year":"2015","remarks":""},{"money":"354,687","country":"France","day":"20","month":"10","year":"2015","remarks":""},{"money":"85,477","country":"Germany","day":"22","month":"11","year":"2015","remarks":""},{"money":"36,146","country":"Germany","day":"15","month":"11","year":"2015","remarks":""},{"money":"491,206","country":"Italy","day":"31","month":"12","year":"2015","remarks":""},{"money":"112,754","country":"Italy","day":"20","month":"12","year":"2015","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Gravier Productions, Inc."},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam ST, Panavision C-Series Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Kodak Vision3 50D 5203, Vision3 200T 5213, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"6.6","metascore":"53","filmingLocations":[{"location":"Rhode Island, USA"}],"rated":"R","awards":[{"award":"Alliance of Women Film Journalists 2016","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Special Mention Award","categories":[{"category":"Most Egregious Age Difference Between the Leading Man and the Love Interest","names":[{"name":"Joaquin Phoenix","id":"nm0001618","role":null},{"name":"Emma Stone","id":"nm1297015","role":null}]}]}]},{"award":"Jupiter Award 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Jupiter Award","categories":[{"category":"Best International Actress","names":[{"name":"Emma Stone","id":"nm1297015","role":null}]}]}]}],"votes":"39,122","type":"Movie","companyCreditsSimple":[{"idCompany":"co0044777","name":"Gravier Productions"}],"keywords":{"keywords":["teacher student affair","professor","russian roulette","judge","murder","boyfriend","philosophy professor","poisoning","cyanide","age discordant relationship","attempted murder","premeditated murder","gun","affair","continental philosophy","flashlight","elevator","two word title","strong female lead","strong female character","bare chested male","piano","student","jean paul sartre","cello","piano recital","reference to sartre","existentialism","karma","lecture","classroom","laboratory","parents","hannah arendt reference","heidegger reference","chance"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:06:16"}}