{"data":{"movies":[{"title":"Power Rangers","originalTitle":"","year":"2017","releaseDate":"20170324","directors":[{"name":"Dean Israelite","id":"nm2410311"}],"writers":[{"name":"John Gatins","id":"nm0309691"},{"name":"Matt Sazama","id":"nm1948885"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTkxNzc5NF5BMl5BanBnXkFtZTgwOTM2Mzk3MTI@._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"High school outcasts stumble upon an old alien ship, where they acquire superpowers and are dubbed the Power Rangers. Learning that an old enemy of the previous generation has returned to exact vegenance, the group must harness their powers and use them to work together and save the world.","simplePlot":"A group of high-school students, who are infused with unique superpowers,harness their abilities in order to save the world.","actors":[{"actorName":"Dacre Montgomery","urlProfile":"http://www.imdb.com/name/nm4223882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTM4ODlhMTEtMmEyNy00M2RhLWE3MDQtY2RhMGVmNjllM2VjXkEyXkFqcGdeQXVyMjQ0NDA5NDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1994","placeOfBirth":" Perth, Australia","height":"5' 10\" (1.78 m)","bio":"Dacre was born in 1994 in Perth Western Australia. His mother is Canadian and his father is a New Zealander. At the time of his birth both of his parents were working in the film industry and he spent many hours during his childhood on film sets where he developed a love of acting. At the age of 10 he had his first role as an extra in a short film and decided that he would pursue a career as an actor. He began comprehensive acting classes at the age of 12 with a local training school and also with a theatre company and throughout this period was often working in advanced class groups where he was exposed to working and training alongside young adults. Dacre was accepted into a specialist visual and performing arts program after a competitive audition process when he entered Mount Lawley Highschool. Throughout his high school years he took part in many school productions and also attended acting workshops at the Western Australian Academy of Performing Arts (WAAPA) located at the Edith Cowan University campus in Perth. When Dacre graduated from high school he received an \"Oscar\" statuette after having been nominated the best actor at the school during his 5 years there and he became determined to successfully audition to enter the Bachelor of Performing Arts program at the prestigious Western Australian Academy of Performing Arts. Dacre has always admired Hugh Jackman who graduated from WAAPA and lived in Perth during his years at University. He has also has great admiration for Heath Ledger who grew up in Perth and who inspired him to believe that he too could make it all the way to Hollywood. After a gruelling audition process Dacre was accepted into WAAPA to undertake his 3 year Bachelor of Arts in Acting. He graduated with his degree in 2015 on the day of his 21st birthday and knew within weeks that he would be filming 3 projects (A Few Less Men, Safe Neighbourhood and Power Rangers) over the next 6 months.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTM4ODlhMTEtMmEyNy00M2RhLWE3MDQtY2RhMGVmNjllM2VjXkEyXkFqcGdeQXVyMjQ0NDA5NDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4223882","name":"Dacre Montgomery","nicknames":["First name Pronounced Day-ker"],"idIMDB":"nm4223882"},"actorId":"nm4223882","character":"Jason","urlCharacter":"http://www.imdb.com/character/ch0468105","main":true},{"actorName":"Naomi Scott","urlProfile":"http://www.imdb.com/name/nm4305463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ2MDg0NzM4Ml5BMl5BanBnXkFtZTgwMjAzMDUxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1993","placeOfBirth":" London, England, UK","height":"5' 5¾\" (1.67 m)","bio":"Naomi Scott was born in London, England. She first starting singing with the Bridge Church Youth Band and regularly performed in school musicals. Scott was eventually discovered by British pop star Kelle Bryan from the band Eternal who signed Naomi as a client. She then went to work with Xenomania. In 2009, Scott appeared in the Disney Channel UK series \"Life Bites\" as the character Megan. She is best known for her role as Mo Bangaree in the 2011 Disney Channel Original Movie \"Lemonade Mouth\". Naomi Scott most recently co-starred with Jason O'Mara and Shelley Conn in the series \"Terra Nova\". The show was not renewed for a second season.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ2MDg0NzM4Ml5BMl5BanBnXkFtZTgwMjAzMDUxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4305463","name":"Naomi Scott","idIMDB":"nm4305463"},"actorId":"nm4305463","character":"Kimberly","urlCharacter":"http://www.imdb.com/character/ch0468104","main":true},{"actorName":"RJ Cyler","urlProfile":"http://www.imdb.com/name/nm5518972","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDc4OTM4MF5BMl5BanBnXkFtZTgwODY0MDgxNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1995","placeOfBirth":" Jacksonville, Florida, USA","bio":"RJ Cyler, a native of Jacksonville, Florida, was born Ronald Cyler II, the youngest of three boys. RJ has always been an entertainer in some way or form. At the age of 12, he started a dance team with his older brother. In January 2012, RJ heard a commercial for open auditions in the Jacksonville area. RJ was asked to Los Angeles for another acting camp, which at that time RJ's mentor asked his parents to consider relocating to California in order to support a possible future. Feb 22,2013,the family took a leap of faith; he along with his mother, moved to Los Angeles. Shortly after, his father and one brother also relocated as well. With his family behind him, RJ continues to focus on becoming a better young man, comedian & actor, not easily deterred when life comes at him, he is truly the laugh box of his family and to those who met him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MDc4OTM4MF5BMl5BanBnXkFtZTgwODY0MDgxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5518972","name":"RJ Cyler","nicknames":["RJ Cyler"],"idIMDB":"nm5518972"},"actorId":"nm5518972","character":"Billy","urlCharacter":"http://www.imdb.com/character/ch0468107","main":true},{"actorName":"Ludi Lin","urlProfile":"http://www.imdb.com/name/nm5250080","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5OTU0MzA2Nl5BMl5BanBnXkFtZTgwNDg3ODAxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ludi Lin is one of Asia's fastest rising stars and was just cast as Zack The Black Ranger in THE POWER RANGERS, Lions Gate's latest franchise. He can also be seen in the soon to be released Season 2 of Netflix's MARCO POLO and the upcoming Chinese films COME ACROSS LOVE and TAKES ME TO THE ENDS OF EARTH. Ludi's other recent credits include the Chinese MONSTER HUNT and LOST IN HONG KONG - the biggest box office Chinese films released in China to date. Ludi was born in Fuzhou, a city along the southern coast of China. His full immersion into western culture came at the age of 9 when he was sent abroad to Sydney Australia to further his studies. Finally, when he was 17 he moved to Vancouver Canada to complete his university education. The allure to act for Ludi began from an early age when he watched his mother's performances from behind the curtain of a Chinese Theatrical stage. Ironically, she urged him not to follow her footsteps but in spite of her dire warnings, he continued to pursue the art and eventually graduated with a double major in Dietetics and Theatre from the University of British Columbia. After graduating, Ludi took a 2 year souljourn around Asia proper where he refined his martial arts skills in Thailand and Japan; studying Muay Thai and JiuJitsu for extended periods. Subsequently, Ludi returned to Vancouver to work as an actor, and honed his skills on shows such as LEVEL UP! and HOLIDAY SPIN. He was also cast in a number of Chinese co-productions, that put to use his unique language skills, films such as, I'M SORRY, I LOVE YOU (2013) and A Servant of Two Masters. Working in China afforded Ludi the chance learn in a different environment and work with legends of the Chinese industry such as Barbara Wong, a revered female director out of Hong Kong, and Jackie Chan and his stunt fighting team. The welcome he experienced and his deepening impression on Chinese audiences made him decide to continue establishing himself in China. Ludi currently maintains residences in Beijing and Vancouver and is a competitive snowboarder, a Master Scuba diver, and student of different martial art forms. He feels grateful to be an actor who can share his art with the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5OTU0MzA2Nl5BMl5BanBnXkFtZTgwNDg3ODAxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5250080","name":"Ludi Lin","idIMDB":"nm5250080"},"actorId":"nm5250080","character":"Zack","urlCharacter":"http://www.imdb.com/character/ch0468103","main":true},{"actorName":"Becky G.","urlProfile":"http://www.imdb.com/name/nm3121384","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjg0MjgxMF5BMl5BanBnXkFtZTgwMzkyNDM5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1997","placeOfBirth":" Inglewood, California, USA","birthName":"Rebbeca Marie Gomez","height":"5' 0½\" (1.54 m)","bio":"Becky G was born as Rebecca Marie Gomez on March 2, 1997 in California, to Mexican-American parents Alejandra and Frank Gomez. She is the oldest of four children. In 2007, her family lost their home due to financial problems. They moved to the converted garage of their grandparents' home in Los Angeles. There, Gomez posted videos of herself dancing and singing on Youtube. Like most stars, she was discovered on Youtube. Becky is managed by Dr. Luke of Sony Music Entertainment. Her best selling singles include; \"Becky from the Block\", \"Play it Again\" and \"Oath\" (feat.Cher Lloyd).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjg0MjgxMF5BMl5BanBnXkFtZTgwMzkyNDM5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3121384","name":"Becky G.","nicknames":["Becky G","Becky"],"idIMDB":"nm3121384"},"actorId":"nm3121384","character":"Trini","urlCharacter":"http://www.imdb.com/character/ch0468106","main":true},{"actorName":"Elizabeth Banks","urlProfile":"http://www.imdb.com/name/nm0006969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTcxNDU3NV5BMl5BanBnXkFtZTcwOTE0MzEzNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1974","placeOfBirth":" Pittsfield, Massachusetts, USA","birthName":"Elizabeth Maresal Mitchell","height":"5' 4½\" (1.64 m)","bio":"Elizabeth Banks was born Elizabeth Mitchell in Pittsfield, a small city in the Berkshires in western Massachusetts near the New York border, on February 10, 1974. She is the daughter of Ann (Wallace), who worked in a bank, and Mark P. Mitchell, a factory worker. Elizabeth describes herself as having been seen as a \"goody two-shoes\" in her youth who was nominated for the local Harvest Queen. Banks left home to attend college at the University of Pennsylvania--from which she graduated Magna cum Laude--and went on to attend the Advanced Training Program at the prestigious American Conservatory Theater in San Francisco, graduating in 1996. She then moved to New York and worked in the theater, and began getting small roles in films and on television. Seeking more screen work, she moved to Los Angeles and was soon cast in supporting roles. She also had to change her last name, to Banks, in order to avoid confusion with actress Elizabeth Mitchell. Her breakthrough role was as Betty Brant, the secretary of the cantankerous newspaper tycoon in Sam Raimi's Spider-Man (2002). She followed up this performance with small roles in other movies: Swept Away (2002), Steven Spielberg's Catch Me If You Can (2002), Seabiscuit (2003) and The 40-Year-Old Virgin (2005). In 2003 she won the Exciting New Face Award at the Young Hollywood Awards. The winsome, beautiful Banks projected an exceptionally charming screen presence that drew comparisons to Audrey Hepburn, and Hollywood eventually began to take notice, Banks being cast in the lead in such films as Kevin Smith's Zack and Miri Make a Porno (2008) and in Oliver Stone's biopic of George W. Bush, W. (2008), as Laura Bush. In television Banks was a recurring guest star on Scrubs (2001) as Dr. Kim Briggs, the love interest of Zach Braff's J.D. In 2010 she was cast as Alec Baldwin's love interest in season four of 30 Rock (2006). Originally scheduled to appear in only four episodes, she was brought back as a recurring character for two more seasons, and earned Emmy nominations for Outstanding Guest Actress in a Comedy Series for two consecutive years. Banks has more recently appeared in such films as Our Idiot Brother (2011), Man on a Ledge (2012), What to Expect When You're Expecting (2012), People Like Us (2012), and Pitch Perfect (2012). She also won the coveted role as Effie Trinket in The Hunger Games (2012) and The Hunger Games: Catching Fire (2013). Banks married Max Handelman, a sports writer and producer, in 2003. They have two sons, Felix, who was born in March 2011, and Magnus, born in Nov. 2012, both by gestational surrogacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMTcxNDU3NV5BMl5BanBnXkFtZTcwOTE0MzEzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006969","name":"Elizabeth Banks","idIMDB":"nm0006969"},"actorId":"nm0006969","character":"Rita Repulsa","urlCharacter":"http://www.imdb.com/character/ch0026916","main":true},{"actorName":"Bryan Cranston","urlProfile":"http://www.imdb.com/name/nm0186505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjEyMTY4MTVeQTJeQWpwZ15BbWU3MDQ5NDAzNDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1956","placeOfBirth":" Hollywood, California, USA","birthName":"Bryan Lee Cranston","height":"5' 10½\" (1.79 m)","bio":"Bryan Cranston is an American actor, voice actor, screenwriter, director and producer. He is known for portraying Walter White on the AMC crime drama series Breaking Bad (2008), Hal on the Fox comedy series Malcolm in the Middle (2000), Doug Heffernan's neighbor Tim Sacksky on the CBS comedy series King of Queens, Dr. Tim Whatley on the NBC comedy series Seinfeld (1989), astronaut Buzz Aldrin in From the Earth to the Moon (1998), and Ted Mosby's boss on How I Met Your Mother (2005). His role in Breaking Bad earned him four Outstanding Lead Actor in a Drama Series Emmy Awards, five Golden Globe nominations and one win in 2014, nine Screen Actors Guild Awards nominations with four wins, and six Satellite Awards nominations with four wins. In June 2014, he won a Tony Award for Best Actor in a Play for his portrayal of Lyndon B. Johnson in the play All the Way on Broadway. He reprise his role in the television film of the same name, which debuted on HBO in May 2016. For the Trumbo (2015), he received widespread acclaim and was nominated for the Academy Award for Best Actor. Cranston also appeared in several acclaimed films, such as Saving Private Ryan (1998), Little Miss Sunshine (2006), Drive (2011), Argo (2012), and Godzilla (2014). Series for his role in Malcolm in the Middle. Bryan was born in Canoga Park, California, to Audrey Peggy Sell, a radio actress, and Joe Cranston (Joseph Louis Cranston), who was also an actor (and a boxer). His maternal grandparents were German, and his father was of Irish, Austrian-Jewish, and German descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjEyMTY4MTVeQTJeQWpwZ15BbWU3MDQ5NDAzNDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186505","name":"Bryan Cranston","idIMDB":"nm0186505"},"actorId":"nm0186505","character":"Zordon","urlCharacter":"http://www.imdb.com/character/ch0026962","main":true},{"actorName":"Bill Hader","urlProfile":"http://www.imdb.com/name/nm0352778","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3MzgwMjE3N15BMl5BanBnXkFtZTcwNjc2MjE3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1978","placeOfBirth":" Tulsa, Oklahoma, USA","height":"6' 1\" (1.85 m)","bio":"Bill Hader was born on June 7, 1978 in Tulsa, Oklahoma, USA. He is an actor and producer, known for Inside Out (2015), Superbad (2007) and Saturday Night Live (1975). He has been married to Maggie Carey since 2006. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3MzgwMjE3N15BMl5BanBnXkFtZTcwNjc2MjE3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0352778","name":"Bill Hader","idIMDB":"nm0352778"},"actorId":"nm0352778","character":"Alpha 5","urlCharacter":"http://www.imdb.com/character/ch0026913","main":true},{"actorName":"Matt Shively","urlProfile":"http://www.imdb.com/name/nm2397866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjQwMDUwMl5BMl5BanBnXkFtZTgwNzA0OTgxODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1990","placeOfBirth":" Hanford, California, USA","birthName":"Matthew James Shively Jr","height":"5' 11\" (1.8 m)","bio":"Matthew realized he loved to entertain in the 4th grade when he was the lead in the Christmas play at school, The Polar Express. He then went on to such productions as Footloose, Guys and Dolls, How to Succeed in Business Without Really Trying, and Dracula. He then decided to pursue his acting outside of theatre and acquired an agent and a manager. His dream is to entertain people for the rest of his life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjQwMDUwMl5BMl5BanBnXkFtZTgwNzA0OTgxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2397866","name":"Matt Shively","idIMDB":"nm2397866"},"actorId":"nm2397866","character":"Damo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cody Kearsley","urlProfile":"http://www.imdb.com/name/nm4181215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE4ODI3NzUxOF5BMl5BanBnXkFtZTgwNjY5NzM4OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Cody Kearsley is an actor and cinematographer, known for Power Rangers (2017), Riverdale (2017) and Borealis (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE4ODI3NzUxOF5BMl5BanBnXkFtZTgwNjY5NzM4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4181215","name":"Cody Kearsley","idIMDB":"nm4181215"},"actorId":"nm4181215","character":"Hawkeye","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Denman","urlProfile":"http://www.imdb.com/name/nm0219292","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYxMjg1ODU5MV5BMl5BanBnXkFtZTgwMzM2NTYwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1973","placeOfBirth":" Newport Beach, California, USA","birthName":"David Joseph Lamb","height":"6' 4\" (1.93 m)","bio":"Film, TV and stage actor David Denman was born in the Orange County, California suburb of Newport Beach. Denman grew up all over Southern California and spent some time in Sequim, Washington attending 8 different schools along the way. After becoming involved in high school theatrics at Fountain Valley High School, David attended the American Conservatory Theater Summer Training Congress in San Francisco in 1991. He then went on to receive his B.F.A. degree in Drama in 1997 from the famed Juilliard School in NYC. Denman spent numerous seasons doing summer stock before moving back to Los Angeles to pursue film and television. Upon his arrival he was immediately cast on the hit show ER (1994), which lead to numerous TV shows and movies of the week. He made his feature film debut in the Warner Bros comedy The Replacements (2000) with Gene Hackman and Keanu Reeves. While he had supporting roles in some other major productions, his breakthrough role came as \"Roy\" in The Office (2005). The series went on to receive numerous awards including the S.A.G. award for Outstanding Performance by an Ensemble in a Comedy Series. He went on to star in numerous indie films and play supporting roles in many blockbuster features. He starred in the short-lived but critically acclaimed Traffic Light (2011) for FOX and has recurred on many acclaimed television series such as Parenthood (2010) on NBC. Denman is also an avid Shakespeare buff, having seen the entire canon on stage and has performed in dozens of productions. He continues to return to the stage as often as possible.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYxMjg1ODU5MV5BMl5BanBnXkFtZTgwMzM2NTYwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0219292","name":"David Denman","idIMDB":"nm0219292"},"actorId":"nm0219292","character":"Sam Scott","urlCharacter":"http://www.imdb.com/character/ch0538357","main":true},{"actorName":"Robert Moloney","urlProfile":"http://www.imdb.com/name/nm0597235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwOTQzMTMyMF5BMl5BanBnXkFtZTgwNjcyNDIwMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Robert Moloney is a professional actor based in Vancouver, Canada. Known for his versatility, Robert maintains a busy career in film, television, and theatre. Originally from Calgary AB, Robert started acting in High School (Sir Winston Churchill), before moving to Vancouver to study drama at the prestigious Studio 58 Theatre School. He began working immediately upon graduating in popular television shows like The X-Files, The Outer Limits, and Stargate SG1. In his 20 year career Robert has had the Honor to work with some of the best actors and directors in the business, including Leonardo DiCaprio, (The Revenant), William H. Macy, (Door to Door), Robert Altman, (Killer App - Pilot for FOX), Mark Rydell, (Masters of Science Fiction), Zach Snyder, (Man of Steel) and Alejandro Gonzales Inarritu, (The Revenant). His work has taken him across Canada and as far away as Australia where he shot the Dr. Who spin-off, K-9. He has been nominated for a Leo award for the MOW Christmas on Chestnut Street and for two Jessie Richardson Theatre Awards - winning for his portrayal of Steve in Clybourne Park, (Arts Club Theatre). In his down time, Robert is an avid downhill skier, urban cyclist, cigar lover and social and environmental activist. And he is very much in love with his girlfriend Julie Lynn Mortensen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwOTQzMTMyMF5BMl5BanBnXkFtZTgwNjcyNDIwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0597235","name":"Robert Moloney","idIMDB":"nm0597235"},"actorId":"nm0597235","character":"Ted Hart","urlCharacter":"http://www.imdb.com/character/ch0564586","main":true},{"actorName":"Anjali Jay","urlProfile":"http://www.imdb.com/name/nm1420538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzEzMDIzMl5BMl5BanBnXkFtZTcwNTE0NjYwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1975","placeOfBirth":" Bangalore, Karnataka, India","bio":"Anjali Jay is an English actress of Indian descent, mostly known for her roles in Robin Hood and Blind Dating, starring opposite Chris Pine. She currently lives in Vancouver, BC. Anjali come from a strong theatre and dance background. She played Juliet in a national UK tour of Shakespeare's Romeo & Juliet. She also created the role of Jamila in the Royal Shakespeare Company's staging of Salman Rushdie's book Midnight's Children. When she's not in front of the camera or treading the boards, she can be found creating in the kitchen, spending time with her family and playing with the dog.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MzEzMDIzMl5BMl5BanBnXkFtZTcwNTE0NjYwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1420538","name":"Anjali Jay","idIMDB":"nm1420538"},"actorId":"nm1420538","character":"Maddy Hart","urlCharacter":"http://www.imdb.com/character/ch0538881","main":true},{"actorName":"Sarah Grey","urlProfile":"http://www.imdb.com/name/nm4152858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTU0Mzc1M15BMl5BanBnXkFtZTgwNjc1MzgwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1996","placeOfBirth":" Nanaimo, British Columbia, Canada","height":"5' 8½\" (1.74 m)","bio":"Sarah Grey was born on May 19, 1996 in Nanaimo, British Columbia, Canada. She is an actress, known for If I Stay (2014), Power Rangers (2017) and A Mother's Instinct (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNTU0Mzc1M15BMl5BanBnXkFtZTgwNjc1MzgwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4152858","name":"Sarah Grey","idIMDB":"nm4152858"},"actorId":"nm4152858","character":"Amanda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan Taylor Campbell","urlProfile":"http://www.imdb.com/name/nm4479367","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkyNDliMWMtMWU5My00NTAxLTk0ZjUtNWZjMzUyMjhmMGZiL2ltYWdlXkEyXkFqcGdeQXVyMjYzMjc2NzM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1995","placeOfBirth":" Fort McMurray, Alberta, Canada","height":"5' 5\" (1.65 m)","bio":"Morgan was born and raised in Fort McMurray, Alberta along with her two brothers, two sisters and a multitude of pets. Growing up she quit every sport and activity she ever joined. Acting was the only thing that stuck. Morgan was the first actor in the family, but many of her loved ones are artists in their own right. A few months before graduating high school Morgan moved out to Vancouver, finished up her remaining courses and started training steadily under Kate Twa at Railtown Actors Studio where she has been ever since. Morgan has guest starred on Disney XD's \"Mr. Young\" and AMC's \"The Killing\" and recently landed her first leading role starring as Ann Templeton in HUB Network's new series \"Spooksville\". \"Spooksville\" is based on the book series of the same name by acclaimed author Christopher Pike and will premiere October 26th 2013. Morgan was recently cast in the indie mockumentary \"No Men Beyond This Point\", set to do the festival circuit in 2014. Currently Morgan calls Vancouver, BC home base and spends much of her time there kick boxing, playing piano, reading, working with local theatre company The Ninja Pirates, and being weird alongside her best friend.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkyNDliMWMtMWU5My00NTAxLTk0ZjUtNWZjMzUyMjhmMGZiL2ltYWdlXkEyXkFqcGdeQXVyMjYzMjc2NzM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4479367","name":"Morgan Taylor Campbell","idIMDB":"nm4479367"},"actorId":"nm4479367","character":"Harper","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3717490","urlIMDB":"http://www.imdb.com/title/tt3717490","business":{"budget":{"money":"$100,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"01","month":"04","year":"2016","remarks":null},"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["2 hr 4 min (124 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic Dragon"],"laboratory":["Company 3 (digital intermediate)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["DCP (also 3-D version)"]},"rating":"7.1","metascore":"44","filmingLocations":[{"location":"Vancouver, British Columbia, Canada"}],"rated":"PG-13","awards":[],"votes":"13,929","type":"Movie","companyCreditsSimple":[{"idCompany":"co0173285","name":"Lionsgate"},{"idCompany":"co0304366","name":"Saban Brands"},{"idCompany":"co0075704","name":"Saban Entertainment"}],"keywords":{"keywords":["superpower","good versus evil","teenager","cutting own hair","training montage","villainess","interracial friendship","superhero","fight","reboot","alien","based on tv series","power ranger","high school","destiny","power rangers","kiss","origin story","standoff","prank gone wrong","product placement","high school student","jettisoned into space","superhuman strength","super strength","autistic boy","autism","autism spectrum disorder","coastal town","evil woman","evil alien","evil laugh","prologue","alien language","humanoid alien","female alien","alien supervillain","teenage superhero team","morphing","golden power staff","staff weapon","coin","crystal","jumping from height","bully","hit by a train","krispy kreme","giant monster","scene during end credits","dutch angle","gold","reference to spiderman","father son conflict","teenage girl","back from the dead","city in ruins","montage with pop song","spaceship","gold mine","calling someone a freak","car chase","car crash","bully comeuppance","school bully","detention","talking robot","f rated","mean girl","action hero","school teacher","lesbian lead character","super power","megazord","teenage angst","action heroine","homeless man","gold teeth","gold tooth","head butt","cow","prank","high school girl","shot into outer space","fisherman","campfire","reference to the breakfast club","reference to transformers","fishing boat","dock","group of friends","black ranger","pink ranger","yellow ranger","red ranger","blue ranger","alpha 5","zord","green ranger","interdimensional being","staff","jewelry store","homosexuality","lesbian main character","lesbian","violence","giant robot","robot","montage","reference to iron man","father son relationship","overturned truck","teenage boy","explosion","golem","singing in a car","singing nun"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:34:09"}}