{"data":{"movies":[{"title":"Pixie Hollow Bake Off","originalTitle":"","year":"2013","releaseDate":"20140401","directors":[{"name":"Elliot M. Bour","id":"nm1074748"}],"writers":[{"name":"Kate Kondell","id":"nm1009988"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNTkyMjc3OF5BMl5BanBnXkFtZTgwNDE1MzY5MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation"],"plot":"Tink challenges Gelata to see who can bake the best cake for the queen's party.","simplePlot":"Tink challenges Gelata to see who can bake the best cake for the queen's party.","actors":[{"actorName":"Pamela Adlon","urlProfile":"http://www.imdb.com/name/nm0781899","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTgwOTI4N15BMl5BanBnXkFtZTgwMTEyMTExNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1966","placeOfBirth":" New York City, New York, USA","birthName":"Pamela Fionna Segall","height":"5' (1.52 m)","bio":"Pamela Adlon comes from an acting family and began her career in television in 1983. She has appeared in many popular TV shows, including as a voice actress in a number of animated TV series including, most famously, King of the Hill (1997) for which she won an Emmy for her role as Bobby Hill.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTgwOTI4N15BMl5BanBnXkFtZTgwMTEyMTExNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781899","name":"Pamela Adlon","idIMDB":"nm0781899"},"actorId":"nm0781899","character":"Vidia","urlCharacter":"http://www.imdb.com/character/ch0143731","main":true},{"actorName":"Jeff Bennett","urlProfile":"http://www.imdb.com/name/nm0071818","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQwMjU2Ml5BMl5BanBnXkFtZTcwNDQwMzgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1962","placeOfBirth":" Houston, Texas, USA","birthName":"Jeffrey Glenn Bennett","bio":"Jeff Bennett was born on October 2, 1962 in Houston, Texas, USA as Jeffrey Glenn Bennett. He is an actor, known for Johnny Bravo (1997), James Bond Jr. (1991) and Enchanted (2007). He has been married to Susan E. Welby since October 8, 1988. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQwMjU2Ml5BMl5BanBnXkFtZTcwNDQwMzgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071818","name":"Jeff Bennett","idIMDB":"nm0071818"},"actorId":"nm0071818","character":"Clank / Fairy Gary","urlCharacter":"http://www.imdb.com/character/ch0143733","main":true},{"actorName":"Giada De Laurentiis","urlProfile":"http://www.imdb.com/name/nm1373094","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcxMDg4MTU5Ml5BMl5BanBnXkFtZTcwODY0MTQ3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1970","placeOfBirth":" Rome, Lazio, Italy","birthName":"Giada Pamela De Benedetti","height":"5' 3\" (1.6 m)","bio":"Giada De Laurentiis was born on August 22, 1970 in Rome, Lazio, Italy as Giada Pamela De Benedetti. She is a producer and actress, known for Giada at Home (2008), Everyday Italian (2003) and Food Network Star (2005). She was previously married to Todd Thompson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcxMDg4MTU5Ml5BMl5BanBnXkFtZTcwODY0MTQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1373094","name":"Giada De Laurentiis","idIMDB":"nm1373094"},"actorId":"nm1373094","character":"Gelata","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Megan Hilty","urlProfile":"http://www.imdb.com/name/nm2047859","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTgyOTkwMF5BMl5BanBnXkFtZTgwNTE5NjQ2ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1981","placeOfBirth":" Bellevue, Washington, USA","birthName":"Megan Kathleen Hilty","height":"5' 3\" (1.6 m)","bio":"Megan Hilty was born on March 29, 1981 in Bellevue, Washington, USA as Megan Kathleen Hilty. She is an actress, known for The Pirate Fairy (2014), Pixie Hollow Games (2011) and Secret of the Wings (2012). She has been married to Brian Gallagher since November 2, 2013. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTgyOTkwMF5BMl5BanBnXkFtZTgwNTE5NjQ2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2047859","name":"Megan Hilty","idIMDB":"nm2047859"},"actorId":"nm2047859","character":"Rosetta","urlCharacter":"http://www.imdb.com/character/ch0134639","main":true},{"actorName":"Jane Horrocks","urlProfile":"http://www.imdb.com/name/nm0001363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzIxNjI5NV5BMl5BanBnXkFtZTYwMTIyODI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1964","placeOfBirth":" Rossendale Valley, Lancashire, England, UK","birthName":"Barbara Jane Horrocks","height":"5' 2\" (1.57 m)","bio":"Jane Horrocks was born January 18, 1964 in Rawtenstall, Lancashire, England, UK, she is the youngest of three children born to Barbara and John Horrocks. She attended Balladen County Primary School before she enrolled at Oldham College, and later, Royal Academy of Dramatic Art, among her classmates were Imogen Stubbs and Ralph Fiennes. Jane received great reviews for her performance in Life Is Sweet (1990), followed by her award-winning performance in \"The Rise and Fall of Little Voice\", a play directed by Jim Cartwright who had written the play in awe of Jane's singing impressions of Judy Garland, Shirley Bassey and Ethel Merman. The play was adapted into a film in which Jane reprised her role as Little Voice (1998). For her performance in the film, she was nominated a BAFTA Film Award, BSFC Award, British Independent Film Award, CFCA Award, Golden Globe, Golden Satellite Award, Screen Actors Guild Award, and SEFCA Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzIxNjI5NV5BMl5BanBnXkFtZTYwMTIyODI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001363","name":"Jane Horrocks","idIMDB":"nm0001363"},"actorId":"nm0001363","character":"Fairy Mary","urlCharacter":"http://www.imdb.com/character/ch0143734","main":true},{"actorName":"Anjelica Huston","urlProfile":"http://www.imdb.com/name/nm0001378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE1MTAyNDReQTJeQWpwZ15BbWU3MDk5NDI0Mjc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1951","placeOfBirth":" Santa Monica, California, USA","height":"5' 10\" (1.78 m)","bio":"Anjelica Huston was born on July 8, 1951 in Santa Monica, California, to prima ballerina Enrica \"Ricki\" (Soma) and director and actor John Huston. Her mother, who was from New York, was of Italian descent, and her father had English, Scottish, and Scots-Irish ancestry. Huston spent most of her childhood overseas, in Ireland and England, and in 1969 first dipped her toe into the acting profession, taking a few small roles in her father's movies. However, in that year her mother died in a car accident, at 39, and Huston relocated to the United States, where the tall, exotically beautiful young woman modeled for several years. While modeling, Huston had a few more small film roles, but decided to focus more on movies in the early 1980s. She prepared herself by reaching out to acting coach Peggy Feury and began to get roles. The first notable part was in Bob Rafelson's remake of the classic noir movie The Postman Always Rings Twice (1981) (in which Jack Nicholson, with whom Huston was living at the time, was the star). After a few more years of on-again, off-again supporting work, her father perfectly cast her as calculating, imperious Maerose, the daughter of a Mafia don whose love is scorned by a hit man (Nicholson again) in his film adaptation of Richard Condon's Mafia-satire novel Prizzi's Honor (1985). Huston won the Best Supporting Actress Oscar for her performance, making her the first person in Academy Award history to win an Oscar when a parent and a grandparent (her father and grandfather Walter Huston) had also won one. Huston thereafter worked prolifically, including notable roles in Francis Ford Coppola's -Gardens of Stone (1987), Barry Sonnenfeld's film versions of the Charles Addams cartoons The Addams Family (1991) and Addams Family Values (1993), in which she portrayed Addams matriarch Morticia, Wes Anderson's The Royal Tenenbaums (2001) and The Life Aquatic with Steve Zissou (2004). Probably her finest performance on-screen, however, was as Lilly, the veteran, iron-willed con artist in Stephen Frears' The Grifters (1990), for which she received another Oscar nomination, this time for Best Actress. A sentimental favorite is her performance as the lead in her father's final film, an adaptation of James Joyce's The Dead (1987) -- with her many years of residence in Ireland, Huston's Irish accent in the film is authentic. Endowed with her father's great height and personal boldness, and her mother's beauty and aristocratic nose, Huston certainly cuts an imposing figure, and brings great confidence and authority to her performances. She clearly takes her craft seriously and has come into her own as a strong actress, emerging from under the shadow of her father, who passed away in 1987. Huston married the sculptor Robert Graham in 1992, The couple lived in the Los Angeles area before Graham's death in 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE1MTAyNDReQTJeQWpwZ15BbWU3MDk5NDI0Mjc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001378","name":"Anjelica Huston","nicknames":["Angel","Anjel"],"idIMDB":"nm0001378"},"actorId":"nm0001378","character":"Queen Clarion","urlCharacter":"http://www.imdb.com/character/ch0416658","main":true},{"actorName":"Lucy Liu","urlProfile":"http://www.imdb.com/name/nm0005154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxODE0MjI5Ml5BMl5BanBnXkFtZTcwMjkxMzMzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1968","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Lucy Alexis Liu","height":"5' 3\" (1.6 m)","bio":"Born to immigrants in Queens, New York, Lucy Liu has always tried to balance an interest in her cultural heritage with a desire to move beyond a strictly Asian-American experience. Lucy's mother, Cecilia, a biochemist, is from Beijing, and her father, Tom Liu, a civil engineer, is from Shanghai. Once relegated to \"ethnic\" parts, the energetic actress is finally earning her stripes as an across-the-board leading lady. Liu graduated from Stuyvesant High School in 1986 and enrolled in New York University; discouraged by the \"dark and sarcastic\" atmosphere of NYU, however, she transferred to the University of Michigan after her freshman year. She graduated from UM with a degree in Chinese Language and Culture, managing to squeeze in some additional training in dance, voice, fine arts, and acting. During her senior year, Liu auditioned for a small part in a production of Alice in Wonderland and walked away with the lead; encouraged by the experience, she decided to take the plunge into professional acting. She moved to Los Angeles and split her time between auditions and food service day jobs, eventually scoring a guest appearance as a waitress on Beverly Hills, 90210 (1990). That performance led to more walk-on parts in shows like NYPD Blue (1993), ER (1994), and The X-Files (1993). In 1996, she was cast as an ambitious college student on Rhea Perlman's ephemeral sitcom Pearl (1996). Liu first appeared on the big screen as an ex-girlfriend in Jerry Maguire (1996) (she had previously filmed a scene in the indie Bang (1995), but it was shelved for two years). She then waded through a series of supporting parts in small films before landing her big break on Ally McBeal (1997). Liu initially auditioned for the role of Nelle Porter, which went to Portia de Rossi, but writer-producer David E. Kelley was so impressed with her that he promised to write a part for her in an upcoming episode. The part turned out to be that of growling, ill-tempered lawyer Ling Woo, which Liu filled with such aplomb that she was signed on as a regular cast member. The \"Ally\" win gave Liu's film career a much-needed boost--in 1999, she was cast as a dominatrix in the Mel Gibson action flick Payback (1999), and as a hitchhiker in the ill-received boxing saga Play It to the Bone (1999). The next year brought even larger roles: first as the kidnapped Princess Pei Pei in Jackie Chan's western Shanghai Noon (2000), then as one-third of the comely crime-fighting trio in Charlie's Angels (2000). When she's not hissing at clients or throwing well-coiffed punches, Liu keeps busy with an eclectic mix of off-screen hobbies. She practices the martial art of Kali-Eskrima-Silat (knife-and-stick fighting), skis, rock climbs, rides horses, and plays the accordion. In 1993 she exhibited a collection of multimedia art pieces at the Cast Iron Gallery in SoHo (New York), after which she won a grant to study and create art in China. Her hectic schedule doesn't leave much time for romantic intrigue, but Liu says she prefers to keep that side of her life uncluttered.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgxODE0MjI5Ml5BMl5BanBnXkFtZTcwMjkxMzMzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005154","name":"Lucy Liu","idIMDB":"nm0005154"},"actorId":"nm0005154","character":"Silvermist","urlCharacter":"http://www.imdb.com/character/ch0117892","main":true},{"actorName":"Rob Paulsen","urlProfile":"http://www.imdb.com/name/nm0667326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzODc1MTk4MzheQTJeQWpwZ15BbWU3MDY4NjU1MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1956","placeOfBirth":" Detroit, Michigan, USA","birthName":"Robert Fredrick Paulsen III","height":"5' 10½\" (1.79 m)","bio":"Rob Paulsen was born on March 11, 1956 in Detroit, Michigan, USA as Robert Fredrick Paulsen III. He is an actor, known for Animaniacs (1993), Teenage Mutant Ninja Turtles (2012) and The Mask (1995). He is married to Parrish Todd. They have one child. He was previously married to Carol Anne Schnarr.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzODc1MTk4MzheQTJeQWpwZ15BbWU3MDY4NjU1MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0667326","name":"Rob Paulsen","idIMDB":"nm0667326"},"actorId":"nm0667326","character":"Bobble","urlCharacter":"http://www.imdb.com/character/ch0143735","main":true},{"actorName":"Raven-Symoné","urlProfile":"http://www.imdb.com/name/nm0712368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzM4NTA0Nl5BMl5BanBnXkFtZTcwNzMyOTgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1985","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Raven-Symoné Christina Pearman","height":"5' 2\" (1.57 m)","bio":"Raven-Symoné Pearman was born in Atlanta, Georgia, to Lydia (Gaulden) and Christopher Pearman. At a young age, she moved to New York. While there Raven signed with the Ford Modeling Agency. They sent her out on a audition for a movie called Ghost Dad (1990), which also starred the legendary Bill Cosby. She was deemed too young for the role since was only 3 years old, but Cosby could see she had talent. They asked Raven to come back to read lines, and she did so well that she got a starring role as Olivia on the last three seasons of The Cosby Show (1984). After the show finished its run, she decided to try something new like singing. In 1993, she became the youngest person ever to sign with MCA Records. She also went back to acting with a starring role in Hangin' with Mr. Cooper (1992), alongside Mark Curry and a small role in the TV mini-series Queen (1993). After another small role in the feature film The Little Rascals (1994) and the role of Goldilocks in the TV series Happily Ever After: Fairy Tales for Every Child (1995), \"Hangin' with Mr. Cooper\" ended. Raven's singing career was doing well and she landed a role in Doctor Dolittle (1998) alongside Eddie Murphy and a made-for-TV movie called Zenon: Girl of the 21st Century (1999). She also starred in Dr. Dolittle 2 (2001), but she was not available to do Zenon: The Zequel (2001). However, the Walt Disney Company, which made the Zenon movies, wanted her back to do a pilot for a new Disney TV show called \"Absolutely Psychic,\" in which she would be a supporting character. She impressed them so much that they changed the show's premise to be about her and the show's name was changed to That's So Raven (2003). After the show was a hit she did the made-for-TV movie Les Cheetah Girls (2003) and recorded a new album. A movie based on \"That's So Raven\" may be in the works.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzM4NTA0Nl5BMl5BanBnXkFtZTcwNzMyOTgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712368","name":"Raven-Symoné","nicknames":["Rae","Rave"],"idIMDB":"nm0712368"},"actorId":"nm0712368","character":"Iridessa","urlCharacter":"http://www.imdb.com/character/ch0137045","main":true},{"actorName":"Mae Whitman","urlProfile":"http://www.imdb.com/name/nm0926165","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjQxMTU0N15BMl5BanBnXkFyZXN1bWU@._V1._SX600_CR213,1,358,396_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1988","placeOfBirth":" Los Angeles, California, USA","birthName":"Mae Margaret Whitman","height":"5' 1\" (1.55 m)","bio":"Mae was born in Los Angeles, California to Pat Musick, a voice artist, and Jeffrey Whitman, a personal manager and set construction coordinator. She began her career with a voice-over for a Tyson Chicken commercial. Whitman attended Ribét Academy, a private preparatory school in Los Angeles. She was later transferred to Whitefish Bay High School, where she graduated. Whitman made her first silver screen debut playing Meg Ryan's youngest daughter, \"Casey Green\", in When a Man Loves a Woman (1994). Among her notable childhood roles were that of \"Patricia Whitmore\", daughter of the President in Independence Day (1996); George Clooney's daughter, \"Maggie Taylor\", in One Fine Day (1996); and the charming daughter, \"Bernice Pruitt\", of Sandra Bullock, in Hope Floats (1998). As she has grown older, Mae has made several guest appearances in television shows such as JAG (1995), State of Grace (2001), Desperate Housewives (2004), Grey's Anatomy (2005) and Law & Order: Special Victims Unit (1999), just to name a few, as well as some voice-over work. In 2015, she starred in the movie The Duff (2015) portraying a high school student who realized she is the approachable one, the designated ugly fat friend, the DUFF. We should expect to see great things from Mae Whitman as her career progresses, for she has shown what a strong, dynamic, and talented actress she has become.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjQxMTU0N15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926165","name":"Mae Whitman","idIMDB":"nm0926165"},"actorId":"nm0926165","character":"Tinker Bell","urlCharacter":"http://www.imdb.com/character/ch0030675","main":true}],"seasons":[],"idIMDB":"tt3717836","urlIMDB":"http://www.imdb.com/title/tt3717836","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.3","filmingLocations":[],"awards":[],"votes":"195","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0092035","name":"DisneyToon Studios"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:35:48"}}