{"data":{"movies":[{"title":"Guardians of the Galaxy Vol. 2","originalTitle":"","year":"2017","releaseDate":"20170505","directors":[{"name":"James Gunn","id":"nm0348181"}],"writers":[{"name":"James Gunn","id":"nm0348181"},{"name":"Dan Abnett","id":"nm3966115"}],"runtime":"137 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzI1MTg3OF5BMl5BanBnXkFtZTgwNTU3NDA2MTI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"Set to the backdrop of 'Awesome Mixtape #2,' Marvel's Guardians of the Galaxy Vol. 2 continues the team's adventures as they traverse the outer reaches of the cosmos. The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage. Old foes become new allies and fan-favorite characters from the classic comics will come to our heroes' aid as the Marvel cinematic universe continues to expand.","simplePlot":"Set to the backdrop of Awesome Mixtape #2, 'Guardians of the Galaxy Vol. 2' continues the team's adventures as they unravel the mystery of Peter Quill's true parentage.","actors":[{"actorName":"Chris Pratt","urlProfile":"http://www.imdb.com/name/nm0695435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3MTgwOTgzMV5BMl5BanBnXkFtZTgwODIxMTUwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1979","placeOfBirth":" Virginia, Minnesota, USA","birthName":"Christopher Michael Pratt","height":"6' 2\" (1.88 m)","bio":"Christopher Michael Pratt is an American film and television actor. He came to prominence from his television roles, including Bright Abbott in Everwood (2002), Ché in The O.C. (2003), and Andy Dwyer and Parks and Recreation (2009), and notable film roles in Moneyball (2011), The Five-Year Engagement (2012), Zero Dark Thirty (2012), Delivery Man (2013), and Her (2013). In 2014, he broke out as a leading man after headlining two of the year's biggest films: he voiced Emmet Brickowoski, in The Lego Movie (2014), and starred as Peter Quill / Star-Lord in Guardians of the Galaxy (2014). In 2015, he headlined the sci-fi thriller Jurassic World (2015), the fourth installment in the Jurassic Park franchise and his most financially successful film. In 2016, he co-starred in the remake The Magnificent Seven (2016), with Denzel Washington and Ethan Hawke, and appeared with Jennifer Lawrence in the sci-fi drama Passengers (2016). In the near future, he returns as Star-Lord for Guardians of the Galaxy Vol. 2 (2017), with Untitled Jurassic World Sequel (2018) not far behind. He was born in Virginia, Minnesota, to Kathleen Louise (Indahl), who worked at a supermarket, and Daniel Clifton Pratt, who remodeled houses. His mother is of Norwegian descent and his father had English, German, Swiss, and French-Canadian ancestry. Chris grew up in Lake Stevens, Washington state. He is married to fellow Washington State native, Anna Faris, whom he met on the film set of Take Me Home Tonight (2011), and with whom he has one child, Jack Pratt. Chris's hobbies include fishing, hunting and working on cars. He has two older siblings, Cully and Angie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3MTgwOTgzMV5BMl5BanBnXkFtZTgwODIxMTUwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0695435","name":"Chris Pratt","nicknames":["Monkeyboy"],"idIMDB":"nm0695435"},"actorId":"nm0695435","character":"Peter Quill / Star-Lord","urlCharacter":"http://www.imdb.com/character/ch0373829","main":true},{"actorName":"Vin Diesel","urlProfile":"http://www.imdb.com/name/nm0004874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA4MDYxN15BMl5BanBnXkFtZTcwOTI1MDAxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1967","placeOfBirth":" Alameda County, California, USA","birthName":"Mark Sinclair","height":"5' 11¾\" (1.82 m)","bio":"Vin Diesel was born Mark Sinclair in Alameda County, California, along with his fraternal twin brother, Paul Vincent. He was raised by his astrologer/psychologist mother, Delora Sherleen (Sinclair), and adoptive father, Irving H. Vincent, an acting instructor and theater manager, in an artist's housing project in New York City's Greenwich Village. He never knew his biological father. His mother is white (with English, German, Scottish, and Irish ancestry), and his adoptive father is African-American; referring to his biological father's background, Diesel has said that he himself is \"definitely a person of colour\". His first break in acting happened by chance, when at the age of seven he and his friends broke into a theatre to vandalize it. A woman stopped them and offered them each a script and $20, on the condition that they would attend everyday after school. From there, Vin's fledgling career progressed from the New York repertory company run by his father, to the Off-Off-Broadway circuit. At age seventeen and already sporting a well-honed physique, he became a bouncer at some of New York's hippest clubs to earn himself some extra cash. It was at this time that he changed his name to Vin Diesel. Following high school, Vin enrolled as an English major at Hunter College, but dropped out after three years to go to Hollywood to further his acting career. Being an experienced theatre actor did not make any impression in Hollywood and after a year of struggling to make his mark, he returned to New York. His mother then gave him a book called \"Feature Films at used Car Prices\" by Rick Schmidt. The book showed him that he could take control of his career and make his own movies. He wrote a short film based on his own experiences as an actor, called Multi-Facial (1995), which was shot in less than three days at a cost of $3,000. Multi-Facial (1995) was eventually accepted for the 1995 Cannes Film Festival where it got a tumultuous reception. Afterwards, Vin returned to Los Angeles and raised almost $50,000 through telemarketing to fund the making of his first feature, Strays (1997). Six months after shooting, the film was accepted for the 1997 Sundance Film Festival, and although it received a good reception, it did not sell as well as hoped. Yet again Vin returned disappointed to New York only to receive a dream phone call. Steven Spielberg was impressed by Multi-Facial (1995) and wanted to meet Vin, leading him to be cast in Saving Private Ryan (1998). Multi-Facial (1995) earned Vin more work, when the director of The Iron Giant (1999) saw it and decided to cast Vin in the title role. From there, Vin's career has steadily grown, with him securing his first lead role as Richard B. Riddick in the sci-fi film Pitch Black (2000). The role has earned him a legion of devoted fans and the public recognition he deserves. Since then, he has headlined a series of blockbusters, often but not only centered on fast-driving motor vehicles: The Fast and the Furious (2001), xXx (2002), Baby-sittor (2005), Fast & Furious (2009), Fast Five (2011), Fast & Furious 6 (2013), and Furious 7 (2015). He also voiced Groot in Guardians of the Galaxy (2014) and starred in the lower-budgeted courtroom drama Jugez-moi coupable (2006), the latter directed by Sidney Lumet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA4MDYxN15BMl5BanBnXkFtZTcwOTI1MDAxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004874","name":"Vin Diesel","idIMDB":"nm0004874"},"actorId":"nm0004874","character":"Baby Groot","urlCharacter":"http://www.imdb.com/character/ch0361372","main":true},{"actorName":"Sylvester Stallone","urlProfile":"http://www.imdb.com/name/nm0000230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Sylvester Gardenzio Stallone","height":"5' 9½\" (1.77 m)","bio":"This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, Richard Burton or Alec Guinness; however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in New York's gritty Hell's Kitchen, to Jackie Stallone (née Labofish), an astrologer, and Frank Stallone, a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core The Party at Kitty and Stud's (1970), the thriller Klute (1971) and the comedy Bananas (1971). He got a crucial career break alongside fellow young actor Henry Winkler, sharing lead billing in the effectively written teen gang film The Lords of Flatbush (1974). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the Roger Corman-produced Death Race 2000 (1975). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 Muhammad Ali-Chuck Wepner fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. Rocky (1976) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members Talia Shire, Burgess Meredith and Burt Young, and director John G. Avildsen gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star. Stallone followed Rocky (1976) with F.I.S.T. (1978), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and Paradise Alley (1978) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel Rocky II (1979). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films Nighthawks (1981) and Victory (1981) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with Rocky III (1982) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard Mr. T. The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor. The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer David Morrell, and his novel was adapted to the screen with Stallone in the lead role in First Blood (1982), also starring Richard Crenna and Brian Dennehy. The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with Rambo: First Blood Part II (1985), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt Dolph Lundgren in Rocky IV (1985). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by Carl Weathers, at the hands of the unstoppable \"Siberian Express\". Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. Cobra (1986) was a clumsy mess, Over the Top (1987) was equally mediocre, Rambo III (1988) saw Rambo take on the Russians in Afghanistan, and cop buddy film Tango & Cash (1989) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star Kurt Russell. Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in Rocky V (1990) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter Tommy Morrison, the great-nephew of screen legend John Wayne. Sly quickly followed with the lukewarm comedy Oscar (1991), the painfully unfunny Stop! Or My Mom Will Shoot (1992), the futuristic action film Demolition Man (1993), and the comic book-inspired Judge Dredd (1995). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing Cop Land (1997), also starring Robert De Niro and Ray Liotta. It isn't a classic of the genre, but Cop Land (1997) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story Antz (1998), reprised the role made famous by Michael Caine in a terrible remake of Get Carter (2000), climbed back into a race car for Driven (2001), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, Spy Kids 3-D: Game Over (2003). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but Rocky Balboa (2006), and Vietnam veteran Rambo (2008) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand. Love him or loathe him, Sylvester Stallone has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000230","name":"Sylvester Stallone","nicknames":["Sly","Michael","The Italian Stallion","Binky","Sly Stallone"],"idIMDB":"nm0000230"},"actorId":"nm0000230","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Gillan","urlProfile":"http://www.imdb.com/name/nm2394794","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMDQ0NDk1OV5BMl5BanBnXkFtZTcwNDcxOTExNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1987","placeOfBirth":" Inverness, Scotland, UK","birthName":"Karen Sheila Gillan","height":"5' 10\" (1.78 m)","bio":"Karen was born and raised in Inverness, Scotland, the daughter of Marie (Paterson) and John Gillan, who is a singer and recording artist. She developed a love for acting very early on, attending several youth theatre groups and taking part in a wide range of productions at her school, Charleston Academy. At age 16, Karen decided she wanted to pursue her acting career further and, studied under the renowned theatre director Scott Johnston at the Performing Arts Studio Scotlond. She later attended the prestigious Italia Conti academy in London. During her first year, she landed a role in Rebus (2000) and soon appeared in a variety of programs including Channel 4's Stacked (2008) and The Kevin Bishop Show (2008), as well as a two-year stint in the long-running series Doctor Who (2005). Karen also stars in the film Outcast (2010), starring James Nesbitt. Her most recent starring role is as Eliza Dooley in \"Selfie\" (2014), When she's not acting, Karen likes to play the piano and loves rummaging through vintage clothes shops.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMDQ0NDk1OV5BMl5BanBnXkFtZTcwNDcxOTExNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2394794","name":"Karen Gillan","nicknames":["Kaz"],"idIMDB":"nm2394794"},"actorId":"nm2394794","character":"Nebula","urlCharacter":"http://www.imdb.com/character/ch0036556","main":true},{"actorName":"Zoe Saldana","urlProfile":"http://www.imdb.com/name/nm0757855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk1NTA1OV5BMl5BanBnXkFtZTcwMTIzMjQ4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1978","placeOfBirth":" Passaic, New Jersey, USA","birthName":"Zoë Yadira Saldaña Nazario","height":"5' 6½\" (1.69 m)","bio":"Zoe Saldana was born on June 19, 1978 in Passaic, New Jersey, to Asalia Nazario and Aridio Saldaña. Her father was Dominican and her mother is Puerto Rican. She was raised in Queens, New York. When she was 10 years old, she and her family moved to the Dominican Republic where they would live for the next seven years. While living in the Dominican Republic, Zoe discovered a keen interest in performance dance and began her training at the prestigious ECOS Espacio de Danza Dance Academy where she learned ballet as well as other dance forms. Not only did her training provide an excellent outlet for the enthusiastic and energetic youngster, it would also prove to be a fortunate precursor for the start of her professional acting career. At age 17, Zoe and her family moved back to the United States where her love for dance followed and an interest in theater performance became stronger. She began performing with the Faces theater troupe which put on plays geared to provide positive messages for teens with themes dealing with issues such as substance abuse and sex. These performances not only gave her valuable experience but also a source of great pride knowing that she was making a difference in the lives of young people like herself. While performing with the Faces troupe and also the New York Youth Theater, Zoe was recruited for a talent agency and her dance training years before coupled with her acting experience greatly helped her land her first big screen role as Eva Rodriguez, the talented and headstrong ballet dancer in the film Center Stage (2000). Since her professional career began several years ago, Zoe's talent and determination has allowed her to be involved in blockbuster films and act with major actors, actresses and industry insiders at a pace that very few young professionals have experienced. Zoe has not only held her own in major motion picture productions but gained the respect and praise from industry insiders such as Jerry Bruckheimer and Steven Spielberg and actors/actresses such as Tom Hanks, Bernie Mac, Keira Knightley, Ashton Kutcher, Kirsten Dunst and Orlando Bloom. According to many of her co-stars, producers and directors, the sky is no limit for this young star who has incredible range, intense concentration, and a steely determination to be involved with projects that challenge her professionally with wide-ranging subject matters and characters. Just to ask practically anyone who she has worked for or with about her, glowing comments abound and earned friendships and respect are readily revealed. A star has been born, and growing every day.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk1NTA1OV5BMl5BanBnXkFtZTcwMTIzMjQ4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0757855","name":"Zoe Saldana","idIMDB":"nm0757855"},"actorId":"nm0757855","character":"Gamora","urlCharacter":"http://www.imdb.com/character/ch0036555","main":true},{"actorName":"Chris Sullivan","urlProfile":"http://www.imdb.com/name/nm2884388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ0Mzc3OTU2Ml5BMl5BanBnXkFtZTgwMTc3ODE1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Chris Sullivan is an actor and producer, known for The Drop (2014), Morgan (2016) and The Normal Heart (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ0Mzc3OTU2Ml5BMl5BanBnXkFtZTgwMTc3ODE1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2884388","name":"Chris Sullivan","nicknames":["Sully"],"idIMDB":"nm2884388"},"actorId":"nm2884388","character":"Taserface","urlCharacter":"http://www.imdb.com/character/ch0547921","main":true},{"actorName":"Glenn Close","urlProfile":"http://www.imdb.com/name/nm0000335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNDk5MTU2NTNeQTJeQWpwZ15BbWU3MDczNjEzMTM@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1947","placeOfBirth":" Greenwich, Connecticut, USA","height":"5' 5\" (1.65 m)","bio":"Six time Academy Award-nominated actress Glenn Close was born and raised in Greenwich, Connecticut. She is the daughter of Elizabeth Mary Hester \"Bettine\" (Moore) and William Taliaferro Close (William Close), a prominent doctor. Both of her parents were from upper-class northeastern families. Glenn was often seen on Broadway until 1982 when she was cast in her award winning role as Jenny Fields in The World According to Garp (1982) alongside Robin Williams. For this role, a breakthrough in film for Close, she later went on to receive an Academy Award Nomination for Best Supporting Actress. The following year she was cast in the hit comedy The Big Chill (1983) for which she received a second Oscar Nomination, once again for Supporting Actress in the role of Sarah Cooper. In her third film, Close portrayed Iris Gaines a former lover of baseball player Roy Hobbs portrayed by Robert Redford, in one of the greatest sports films of all time, The Natural (1984). For a third and final time, Close was nominated for the Academy Award for Best Actress in a Supporting Role. Close went on to star in films like The Stone Boy (1984), Maxie (1985) and Jagged Edge (1985). In 1987 Close was cast in the box office hit Fatal Attraction (1987) for which she portrayed deranged stalker Alex Forrest alongside costars Michael Douglas and Anne Archer. For this role she was nominated for the Academy Award and Golden Globe for Best Actress. The following year Close starred in the Oscar Winning Drama Dangerous Liaisons (1988) for which she portrayed one of the most classic roles of all time as Marquise Isabelle de Merteuil, starring alongside John Malkovich and Michelle Pfeiffer. For this role she was nominated once again for the Academy Award and BAFTA Film Award for Best Actress. Close was favorite to win the coveted statue but lost to Jodie Foster for Les accusés (1988). Close had her claim to fame in the 1980s. Close starred on the hit Drama series Damages (2007) for which she has won a Golden Globe Award and two Emmy Awards. In her career Close has been Oscar nominated six times, won three Tonys, an Obie, three Emmys, two Golden Globes and a Screen Actors Guild Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNDk5MTU2NTNeQTJeQWpwZ15BbWU3MDczNjEzMTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000335","name":"Glenn Close","nicknames":["Glennie"],"idIMDB":"nm0000335"},"actorId":"nm0000335","character":"Nova Prime","urlCharacter":"http://www.imdb.com/character/ch0392804","main":true},{"actorName":"Pom Klementieff","urlProfile":"http://www.imdb.com/name/nm2962353","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjE5MzY5M15BMl5BanBnXkFtZTgwMDI5ODMxODE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1986","placeOfBirth":" Quebec City, Quebec, Canada","height":"5' 7\" (1.7 m)","bio":"Pom Klementieff was born on May 3, 1986 in Quebec City, Quebec, Canada. She is an actress, known for Old Boy (2013), Hacker's Game (2015) and Loup (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjE5MzY5M15BMl5BanBnXkFtZTgwMDI5ODMxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2962353","name":"Pom Klementieff","nicknames":["Pominator"],"idIMDB":"nm2962353"},"actorId":"nm2962353","character":"Mantis","urlCharacter":"http://www.imdb.com/character/ch0231190","main":true},{"actorName":"Elizabeth Debicki","urlProfile":"http://www.imdb.com/name/nm4456120","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDRmMDctZDdhZS00NzQ3LWEwMTQtNTFhNTI5YjI3MGVmL2ltYWdlXkEyXkFqcGdeQXVyMzU0NzY3NDM@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"August1990","placeOfBirth":" Paris, France","height":"6' 2¾\" (1.9 m)","bio":"Debicki was born in Paris to a Polish father and an Australian mother of Irish descent, who were both dancers. When she was five, the family moved to Melbourne where she grew up with two younger siblings. She became interested in ballet at an early age and trained as a dancer until deciding to switch to theatre. A student at Huntingtower School in Melbourne's east, Debicki achieved two perfect study scores in Drama and English and was the school's dux when she graduated in 2007. In 2010, she completed a degree in drama at the University of Melbourne's Victorian College of the Arts. In August 2009, she was the recipient of a Richard Pratt Bursary for outstanding acting students in their second year of training.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDRmMDctZDdhZS00NzQ3LWEwMTQtNTFhNTI5YjI3MGVmL2ltYWdlXkEyXkFqcGdeQXVyMzU0NzY3NDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4456120","name":"Elizabeth Debicki","idIMDB":"nm4456120"},"actorId":"nm4456120","character":"Ayesha","urlCharacter":"http://www.imdb.com/character/ch0545552","main":true},{"actorName":"Bradley Cooper","urlProfile":"http://www.imdb.com/name/nm0177896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1975","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Bradley Charles Cooper","height":"6' 1\" (1.85 m)","bio":"Bradley Charles Cooper was born in Philadelphia, Pennsylvania. His mother, Gloria (Campano), is of Italian descent, and worked for a local NBC station. His father, Charles John \"Charlie\" Cooper, who was of Irish descent, was a stockbroker. He has a sister, Holly. Immediately after Bradley graduated from the Honors English program at Georgetown University in 1997, he moved to New York City to enroll in the Masters of Fine Arts program at the Actors Studio Drama School at New School University. There, he developed his stage work, culminating with his thesis performance as \"John Merrick\" in Bernard Pomerance's \"The Elephant Man\", performed in New York's Circle in the Square. While still in school, Bradley began his professional career, appearing opposite Sarah Jessica Parker in Sex and the City (1998) and in the series, The Beat (2000). His weekends were spent with LEAP (Learning through the Expanded Arts Program), a non-profit organization that teaches acting and movement to inner city school children. The summers took him all across the globe, from kayaking in British Columbia with Orca Whales to ice-climbing in the Peruvian Andes, while hosting Lonely Planet's Treks in a Wild World (2000) for the Discovery Channel. Bradley had to skip his graduation ceremony from the Actor's Studio in order to star in his first feature film, Wet Hot American Summer (2001). After finishing his second feature, Bending All the Rules (2002), his plans to relocate to Los Angeles were delayed when Darren Star hired him to star in the series The $treet (2000). Bradley went on to win the role of young law student Gordon Pinella in the film Changing Lanes (2002), starring Ben Affleck and Samuel L. Jackson, and also played Travis Paterson in My Little Eye (2002). He finally decided that it was time to forgo his other New York projects and move to Los Angeles when he was cast in Alias (2001). After supporting roles in Wedding Crashers (2005), Failure to Launch (2006), The Comebacks (2007), The Rocker (2008), and Yes Man (2008), Cooper broke out with major roles in He's Just Not That Into You (2009), The Hangover (2009), and Valentine's Day (2010). He co-starred in the action film The A-Team (2010) and headlined the thriller Limitless (2011). Cooper received an Academy Award nomination for Best Actor after starring opposite 'Jennifer Lawrence' in David O. Russell's Silver Linings Playbook (2012), as Pat Solatano. He then received two more consecutive Oscar nominations, Best Supporting Actor for playing Richie DiMaso in Russell's American Hustle (2013) (again opposite Lawrence, though their characters shared no significant screen time), and Best Actor for playing Chris Kyle in Clint Eastwood's American Sniper (2014), the highest grossing film of 2014. During this time period, Cooper also reprised his role in The Hangover Part II (2011) and The Hangover III (2013)_, turned in another strong dramatic turn in The Place Beyond the Pines (2012), and voiced Rocket Raccoon in the third highest grossing film of 2014, Guardians of the Galaxy (2014). In 2015, Bradley headlined two comedies, Cameron Crowe's Aloha (2015), set in Hawaii, and John Wells' Burnt (2015), set in London, and will star opposite Jennifer Lawrence again in David O. Russell's Joy (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177896","name":"Bradley Cooper","nicknames":["Coop"],"idIMDB":"nm0177896"},"actorId":"nm0177896","character":"Rocket","urlCharacter":"http://www.imdb.com/character/ch0258335","main":true},{"actorName":"Kurt Russell","urlProfile":"http://www.imdb.com/name/nm0000621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjkxNzQwMV5BMl5BanBnXkFtZTYwNDk4ODM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1951","placeOfBirth":" Springfield, Massachusetts, USA","birthName":"Kurt Vogel Russell","height":"5' 11\" (1.8 m)","bio":"Kurt Russell was born Kurt Vogel Russell in Springfield, Massachusetts, to Louise Julia (Crone), a dancer, and actor Bing Russell (Neil Oliver Russell). He is of English, German, Scottish, and Irish descent. His first roles were as a child in television series, including a lead role in the Western series The Travels of Jaimie McPheeters (1963). Russell landed a part in the Elvis Presley movie, It Happened at the World's Fair (1963), when he was ten years old. Walt Disney himself signed Russell to a 10-year contract, and, according to Robert Osborne, he became the studio's top star of the 1970s. Having voiced adult Copper in the animated Disney film The Fox and the Hound (1981), Russell is one of the few famous child stars in Hollywood who has been able to continue his acting career past his teen years. Kurt spent the early 1970s playing minor league baseball. In 1979, he gave a classic performance as Elvis Presley in John Carpenter's ABC TV movie Elvis (1979), and married the actress who played Priscilla Presley in the film, Season Hubley. He was nominated for an Emmy Award for the role. He followed with roles in a string of well-received films, including Used Cars (1980) and Silkwood (1983), for which he was nominated for the Golden Globe Award for Best Supporting Actor - Motion Picture. During the 1980s, he starred in several films by director Carpenter; they created some of his best-known roles, including anti-hero army-turned-robber Snake Plissken in the futuristic action film Escape from New York (1981) (and later in its 1996 sequel Escape from L.A. (1996)), Antarctic helicopter pilot R.J. MacReady in the horror film The Thing (1982), and Jack Burton in the fantasy film Big Trouble in Little China (1986), all of which have since become cult classics. The Thing was based on the short story Who Goes There? by John W. Campbell, Jr., which had been interpreted on film before, albeit loosely, in 1951's The Thing from Another World (1951). In Big Trouble in Little China, Russell played a truck driver caught in an ancient Chinese war. In 1983, he became reacquainted with Goldie Hawn (who appeared with him in The One and Only, Genuine, Original Family Band (1968)) when they worked together on Swing Shift (1984). The two have lived together ever since. They made another film together, Garry Marshall's comedy Overboard (1987). His other 1980s titles include The Best of Times (1986), Winter People (1989), and the hit Tango & Cash (1989). In 1991, he headlined the firefighter drama Backdraft (1991), in 1993, he starred as Wyatt Earp in the western film Tombstone (1993), and in 1994, had a starring role in the military science fiction film Stargate - La porte des étoiles (1994). In the mid-2000s, his portrayal of U.S. Olympic hockey coach Herb Brooks in Miracle (2004) won the praise of critics. In 2006, he appeared in the disaster-thriller Poseidon (2006), and in 2007, in Quentin Tarantino's Death Proof (2007) segment from the film Grindhouse (2007). Russell appeared in The Battered Bastards of Baseball (2014), a documentary about his father and the Portland Mavericks, which debuted at the Sundance Film Festival in 2014. He co-starred in the action thriller Furious 7 (2015). In 2015, Russell starred in the western films Bone Tomahawk (2015) and The Hateful Eight (2015), and in 2016, he had a leading role in the dramatization Deepwater (2016). Russell and Goldie Hawn live on a 72-acre retreat, Home Run Ranch, outside of Aspen. He has two sons, Boston Russell (from his marriage to Hubley) and Wyatt Russell (with Hawn). He also raised Hawn's children, actors Oliver Hudson and Kate Hudson, who just call him dad.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MjkxNzQwMV5BMl5BanBnXkFtZTYwNDk4ODM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000621","name":"Kurt Russell","idIMDB":"nm0000621"},"actorId":"nm0000621","character":"Ego","urlCharacter":"http://www.imdb.com/character/ch0036505","main":true},{"actorName":"Dave Bautista","urlProfile":"http://www.imdb.com/name/nm1176985","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjQ5NDA5M15BMl5BanBnXkFtZTgwNDE0MjQzMjE@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1969","placeOfBirth":" Washington, District of Columbia, USA","birthName":"David Michael Bautista Jr.","height":"6' 4½\" (1.94 m)","bio":"David Michael Bautista, Jr. was born on January 18, 1969 in Washington, D.C., to Donna Raye (Mullins) and David Michael Bautista. His father is Filipino, and his mother has Greek ancestry. When WCW officials told him he'd never make it in sports entertainment, Bautista pushed himself to achieve his dream of being a Superstar. In May 2002, he made his debut on SmackDown using the ring name Batista, but it wasn't until a move to Raw and two victories over Kane that \"The Animal\" began to make noise in the WWE Universe. The wins impressed Ric Flair and Triple H, who were looking to align themselves with the industry's brightest new stars. After a lengthy search, they identified Randy Orton and Batista. Collectively the four Superstars became known as Evolution. Batista earned his first championship alongside \"The Nature Boy\" when the duo captured the WWE Tag Team Championships in December 2003. As Evolution dominated WWE, Batista started to emerge from the shadows of Triple H and Ric Flair. By the time Batista won the 2005 Royal Rumble Match, World Heavyweight Champion Triple H viewed him as a serious threat to his title. After a triceps injury at the hands of Mark Henry forced Batista to relinquish the title in January 2006, he vowed to return. Batista successfully regained the World Heavyweight Championship at Survivor Series in 2006. Four months into his second reign, Batista faced the Undertaker at WrestleMania 23. \"The Animal\" took Undertaker to the limit, but was unable to stop the streak of \"The Deadman\" at WrestleMania. Though disappointed, Batista stayed hungry and always managed to keep himself in the championship hunt for the rest of his career. At Bragging Rights in 2009, Batista shocked the world when he blamed Rey Mysterio for a loss to Undertaker, then attacked his former tag team partner. \"The Animal\" then became locked in a tense rivalry with another former friend, John Cena, over the WWE Championship. The grueling match at Over the Limit led to a wheelchair-bound Batista declaring \"I quit!\" the following night on Raw before fading from the WWE Universe in May 2010. Following his departure from WWE, Bautista appeared opposite Vin Diesel in the Universal film Riddick (2013) and RZA's feature directorial debut The Man with the Iron Fists (2012), in which he played the villainous Brass Body and starred opposite Russell Crowe and Lucy Liu. His other film credits include The Scorpion King 3: Battle for Redemption (2012), where he played Argomael; the action film House of the Rising Sun (2011); and Wrong Side of Town (2010) opposite rapper Ja Rule. Two years later, he joined MMA and won his first professional MMA fight. In January 2014, he made his long awaited return to the WWE, before quitting a second time in June of that same year. He did this in order to promote Guardians of the Galaxy (2014), which was released on August 1, 2014, and starred Chris Pratt, Benicio Del Toro, Zoe Saldana, and Djimon Hounsou, alongside Bautista. He will shoot Kickboxer: Vengeance (2016), directed by John Stockwell, and co-starring martial artist Alain Moussi and UFC fighter Georges St-Pierre. The remake of the 1989 Jean-Claude Van Damme film, Kickboxer (1989) is about two brothers David and Kurt Sloan; When David wins the Karate World Championship, a promoter lures him to Hong Kong, despite his brother's protestations that the man is a crook. When Kurt travels to Thailand to meet his brother, he discovers he has died and seeks his revenge.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjQ5NDA5M15BMl5BanBnXkFtZTgwNDE0MjQzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1176985","name":"Dave Bautista","nicknames":["Kahn","Deacon Batista","The Animal","DJ"],"idIMDB":"nm1176985"},"actorId":"nm1176985","character":"Drax","urlCharacter":"http://www.imdb.com/character/ch0036548","main":true},{"actorName":"Aramis Knight","urlProfile":"http://www.imdb.com/name/nm2026536","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NDczNzE5OF5BMl5BanBnXkFtZTgwMjc5OTk1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1999","placeOfBirth":" Woodland Hills, Los Angeles, California, USA","height":"5' 8\" (1.73 m)","bio":"Aramis Knight born October 3, 1999 in Woodland Hills, California. At age 4, his mother, enrolled him in an acting workshop. In 2005, Aramis began acting in commercials and playing minor screen roles. Since then, he has guest starred and appeared as recurring characters on multiple television series, including Rizzoli & Isles, Royal Pains, Psych, NCIS, Lost, Dexter and Cold Case. Aramis has been cast as Bean in the film Ender's Game, which is slated for a 2013 release. His previous film roles include The Dark Knight Rises, Crossing Over and Rendition. Aramis has also done voice acting for multiple projects, including Shrek Forever After and Happy Feet II.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NDczNzE5OF5BMl5BanBnXkFtZTgwMjc5OTk1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2026536","name":"Aramis Knight","idIMDB":"nm2026536"},"actorId":"nm2026536","character":"Boy on Star-Lord's Ship","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nathan Fillion","urlProfile":"http://www.imdb.com/name/nm0277213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODM3ODY2Nl5BMl5BanBnXkFtZTgwMzAyMjU2NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1971","placeOfBirth":" Edmonton, Alberta, Canada","birthName":"Nathan Craig Fillion","height":"6' 1½\" (1.87 m)","bio":"Nathan Fillion was born on 27 March 1971, in Edmonton, Alberta, Canada. He is the younger son of Cookie and Bob Fillion, both retired English teachers. He has an older brother, Jeff. In Canada, he attended Holy Trinity Catholic High School, Concordia University College of Alberta and University of Alberta. Before moving to New York City in 1994, he participated in improv theatre, including Theatresports with Rapid Fire Theatre and improvised soap opera Die-Nasty. He also appeared in a TV Movie Ordeal in the Arctic (1993) starring Richard Chamberlain and in Double enquête à Hamelin (1994). Fillion's first regular role was on a daytime soap opera, One Life to Live (1968), as Joey Buchanan, for which role he was nominated in 1996 for a Daytime Emmy Award. He left the series after three years in 1997. During the late 1990's, he appeared in small roles in the films Saving Private Ryan (1998) and Blast from the Past (1999). Fillion also guest starred on Total Security: Das Bootie, Maggie Winters: Mama's Got a Brand New Bag (1998) and Au-delà du réel - l'aventure continue: Star Crossed (1999). His biggest break by then happened in 1998, when he was cast as Johnny Donnelly on the 2nd season of Two Guys, a Girl and a Pizza Place (1998) opposite Traylor Howard, Ryan Reynolds, Richard Ruccolo and Suzanne Cryer. He starred on the show for 60 episodes. After \"Two Guys\" ended in 2001, Fillion gained critical acclaim and a large cult of fans when he starred as Captain Malcolm Reynolds on the Joss Whedon's Firefly (2002). Unfortunately the show was prematurely canceled in late 2002. He also guest starred on several episodes of two short lived TV shows, Pasadena (2001), as Rev. Glenn Collins and Miss Match (2003), as Adam Logan. In 2003, Whedon gave Fillion another chance to display his range when he cast Fillion as the twisted preacher Caleb, a villain, in the final season of Buffy the Vampire Slayer (1997). Before and after \"Firefly\", Fillion appeared in many movies, Dracula 2000 (2000), Alligator Point (2003), Water's Edge (2003), If Dad Only Knew (2004) and Hollywood Division (2004). Whedon vowed to resurrect \"Firefly\" in some way, and Fillion played Captain Reynolds again in the feature-film Serenity (2005). Fillion followed this film with more big screen leading roles, in the horror-comedy Horribilis (2006), in White Noise 2: The Light (2007), in the indie hit Waitress (2007) opposite Keri Russell and in Trucker (2008). He also continued to be a force in television, starring in the short-lived Fox-TV series Drive (2007) and appearing on a recurring role as Dr. Adam Mayfair on the 4th season of ABC's Desperate Housewives (2004), opposite Dana Delany. He also appeared on Lost: I Do (2006) and was a voice actor on many video games (e.g. Halo 3 (2007)). In 2008, he took his first singing part (and cemented his cult appeal) as Captain Hammer in Whedon's musical Internet smash Dr. Horrible's Sing-Along Blog (2008), with Neil Patrick Harris, Felicia Day and Simon Helberg. In 2009, he was cast as the title character Richard Castle in ABC's hit television series, Castle (2009). The show has aired more than 160 episodes and Nathan Fillion has won four People's Choice Awards for Favorite Dramatic TV Actor, as of 2016. Besides starring on \"Castle\", he has appeared in many movies, in Super (2010) as The Holy Avenger, in Joss Whedon's Much Ado About Nothing (2012) as Dogberry, the incompetent chief of security, in Percy Jackson: Sea of Monsters (2013) as Hermes and in Thrilling Adventure Hour Live (2015). His credits as a voice-actor are numerous: on The Venture Bros.: Bright Lights, Dean City (2010) as Brown Widow, in Wonder Woman (2009) as Steve Trevor, in Green Lantern: Emerald Knights (2011), Justice League: Doom (2012), Justice League: The Flashpoint Paradox (2013) and Justice League: Throne of Atlantis (2015) as Hal Jordan/Green Lantern, in Robot Chicken: DC Comics Special (2012) as Green Lantern/Mr. Freeze, on American Dad! (2005), in Pixar's Monsters University (2013) as Johnny, in Guardians of the Galaxy (2014) as Monstrous Inmate and on Gravity Falls (2012) as Preston Northwest. He also voices the lead, Shojun in the animated movie, Yamasong: March of the Hollows (2017). He has also continued voicing characters in video games, such as in Destiny (2014) and in Halo 5: Guardians (2015). He has also guest starred on The Daly Show: The Daly Superheroes (2012) as himself, on Community (2009) as Bob Waite, on The Big Bang Theory: The Comic Book Store Regeneration (2015) as himself, on Kroll Show: Twins (2015) as Mountie McMinniman, on Con Man (2015) as Jack Moore and on Drunk History: Space (2015) as Wernher Von Braun. He also narrated the documentary, Highway of Tears (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODM3ODY2Nl5BMl5BanBnXkFtZTgwMzAyMjU2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0277213","name":"Nathan Fillion","idIMDB":"nm0277213"},"actorId":"nm0277213","character":"Simon Williams","urlCharacter":"http://www.imdb.com/character/ch0375438","main":true},{"actorName":"Tommy Flanagan","urlProfile":"http://www.imdb.com/name/nm0281107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTQxMzA1Nl5BMl5BanBnXkFtZTgwMTMwOTY1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1965","placeOfBirth":" Glasgow, Scotland, UK","height":"6' 1\" (1.85 m)","bio":"Tommy Flanagan was born and raised in Glasgow, Scotland. In his twenties, Tommy made his living as a DJ for local dance clubs until a violent attack nearly ended his life. In hospital, his friend Robert Carlyle persuaded Tommy to give acting a try. Mr. Flanagan joined Carlyle's Raindog Theatre Company where he made his stage debut in such productions as 'Wasted I and II', 'One Flew Over the Cuckoo's Nest', and 'MacBeth'. Tommy worked in various local and smaller film and television projects until he landed a small role in Mel Gibson's epic 'Braveheart' in 1995. Mr. Gibson was so impressed that he expanded the role of rebel Morrison specifically for Tommy, exposing a worldwide audience to Mr. Flanagan. Following this, Tommy went on to work with an array of top directors in films such as Phillip Noyce's 'The Saint', John Woo's 'Face/Off', and David Fincher's 'The Game'. In 1999, he would get the chance to once again work with Robert Carlyle in 'Plunkett and MacCleane'. That same year, Tommy earned critical praise and numerous 'Best Actor' nominations for his role as 'Da', the troubled father in Lynne Ramsay's 'Ratcatcher'. The film earned 'Best Director' awards by many European film festivals including the London Film Critics Circle and the BAFTA 2000 awards. In 2000, Tommy displayed more facets as an actor, starring in Art Linson's 'Sunset Strip' for director Adam Collis, where he played a mysterious 1970's hearth-throb, rock star. He then played the role of 'Cicero', a faithful retainer of Russell Crowe's character in the Academy Award-winning 'Gladiator' for director Ridley Scott. Tommy's focused and intense portrayal once again earned him praise and recognition. Tommy followed this up with roles in the indie features 'Dead Dogs Lie' and 'Strictly Sinatra', as well as the USA Network mini-series 'Attila' opposite Gerard Butler, New Line's 'All About the Benjamins' opposite Ice Cube, and 'Trauma' opposite Colin Firth. In 2004, Tommy starred in 20th Century Fox's 'Alien vs. Predator' for director Paul W.S. Anderson, and followed that up in 2005 with Miramax films 'Sin City' for director Robert Rodriguez. And in 2006, Tommy played the pivotal role of the 'Stranger' terrorizing Camilla Belle in Simon West's re-make of 'When a Stranger Calls'. Tommy then played the enigmatic hit man 'Lazlo Soot' in Joe Carnahan's 'Smokin' Aces'. In 2008, Tommy joined Charlie Hunnam, Ron Perlman and Katey Sagal in FX Network's drama, 'Sons of Anarchy' (SOA), one of the highest rated shows for the network, running for seven seasons. A huge success with a devoted following, SOA was initially based upon Hamlet by creator / show-runner Kurt Sutter. Often criticized for graphic violence, SOA was snubbed by award panels despite praise by critics and viewers. Mr. Flanagan portrayed Filip 'Chibs' Telford, a stalwart member of the, \"Sons of Anarchy Motorcycle Club, Redwood Original\" (SAMCRO). Scottish by birth and raised in Belfast, Ireland, Chibs joined the IRA and the Belfast Chapter of Sons of Anarchy before events necessitated his transition to SAMCRO. The name Chibs refers to Scottish slang for a knife/ \"street knife\" (per Mr. Flanagan), a choice by Kurt Sutter referencing the real facial scarring Mr. Flanagan received in a near-fatal attack in his native Glasgow. Known as a \"Glasgow smile\" or \"Glasgow grin\" it is a highly distinctive regional form of violence and Sutter utilized it within the show. Mr. Flanagan himself is often questioned about his scarring and was quoted in Vulture 11/12/2014, \"I don't see the scars anymore. They're just ancient history now. It was a horrible thing that happened 20 years ago. I don't give it a second thought. It's just like a big wrinkle on my face.\" Tommy continues to create great roles in other hit series and films, gaining greater visibility and wider dramatic roles, including critically acclaimed UK drama ' Winter' by Heidi Greensmith, in which he plays an emotionally tortured painter trying to keep his family together after the sudden loss of his wife. Among other notable roles, Mr. Flanagan stars in 'The Jesuit' opposite Tim Roth and fellow Braveheart alum Brian Cox. In 2016 he adds 'Sand Castle, set during the Iraq War and 'Running Wild' with Sharon Stone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTQxMzA1Nl5BMl5BanBnXkFtZTgwMTMwOTY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0281107","name":"Tommy Flanagan","idIMDB":"nm0281107"},"actorId":"nm0281107","character":"Tullk","urlCharacter":"http://www.imdb.com/character/ch0537984","main":true}],"seasons":[],"idIMDB":"tt3896198","urlIMDB":"http://www.imdb.com/title/tt3896198","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"02","year":"2016","remarks":null},{"money":null,"country":null,"day":"17","month":"06","year":"2016","remarks":null}],"copyrightHolder":"Disney Enterprises, Inc. © COPYRIGHT MCMXCI, MMI DISNEY ENTERPRISES, INC. All Rights Reserved"},"technical":{"runtime":["2 hr 17 min (137 min)"],"soundMix":["Dolby Digital","Dolby Surround 7.1","12-Track Digital Sound (IMAX 12 track)","IMAX 6-Track","Dolby Atmos"],"color":["Color (ACES)"],"aspectRatio":["1.90 : 1 (IMAX version: some scenes)","2.35 : 1"],"camera":["Leica Summicron-C Lenses","Red Weapon Dragon, Panavision Primo 70 Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Redcode RAW (8K) (source format)"],"printedFilmFormat":["D-Cinema (also 3-D version)"]},"filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0051941","name":"Marvel Studios"},{"idCompany":"co0008970","name":"Walt Disney Pictures"}],"keywords":{"keywords":["marvel cinematic universe","super powers","ensemble cast","misfits","based on comic book","based on comic","superhero","cosmic","marvel comics","space opera","second part","sequel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:14:10"}}