{"data":{"movies":[{"title":"My Beloved Bodyguard","originalTitle":"Wo de te gong ye ye","year":"2016","releaseDate":"201608","directors":[{"name":"Sammo Kam-Bo Hung","id":"nm0005033"}],"writers":[{"name":"Jun Jiang","id":"nm8115248"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTc4ZjA0MzktMTFlNS00N2MyLWE2NTctNDUxMTNiNWExOTVjXkEyXkFqcGdeQXVyMjExMzEyNTM@._V1.jpg","countries":["China","Hong Kong"],"languages":["Mandarin","Cantonese","Russian"],"genres":["Action","Crime","Drama"],"plot":"A retired bodyguard who has settled into a corner of the world where China, Russia and North Korea meet as he suffers from early dementia finds a new friend in a young girl. When her life is threatened by her father's connection with a local crime lord, .the bodyguard must call upon his long forgotten skills to save her.","simplePlot":"A retired bodyguard who has settled into a corner of the world where China, Russia and North Korea meet as he suffers from early dementia finds a new friend in a young girl. When her life ... ","actors":[{"actorName":"Sammo Kam-Bo Hung","urlProfile":"http://www.imdb.com/name/nm0005033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTM3MzM4MzVeQTJeQWpwZ15BbWU3MDIzNjM3NzQ@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1952","placeOfBirth":" Hong Kong, British Crown Colony","birthName":"Hung Kam-Bo","height":"5' 7\" (1.7 m)","bio":"Born in Hong Kong, Sammo Hung's acting career began while he was training in acrobatics, martial arts and dance as a child at the China Drama Academy, and he received acclaim for his performance with a troupe called \"The Seven Little Fortunes.\" He made his feature film debut as an actor at the age of 12, and has worked in numerous martial arts films as an actor, director, producer and/or choreographer, collaborating with Bruce Lee and Jackie Chan, two superstars of the genre. He is now internationally renowned as a pioneer and trend-setter in Hong Kong action films. Hung's big break as a film actor came with a role as a sparring partner in the Bruce Lee film Opération dragon (1973). He established his reputation as a skilled physical comedian in several kung-fu comedies, beginning with \"Enter the Fat Dragon\" (Enter the Fat Dragon (1978)). He also produced and starred in numerous successful films throughout the 1970s and 1980s for Hong Kong's leading film studio, Golden Harvest. Hung collaborated in the 1980s with long-time friend Jackie Chan in a highly successful series of action comedies that cemented Hung's reputation as a consummate actor/director and launched Chan's career as an international star. For a while, Hung also starred in an American TV series, Martial Law (1998). He directed Once Upon a Time in China and America (1997), his first film shot in the US. He and his wife, Mina, now divide their time between homes in Hong Kong and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTM3MzM4MzVeQTJeQWpwZ15BbWU3MDIzNjM3NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005033","name":"Sammo Kam-Bo Hung","nicknames":["Yuen Chu","Big Brother"],"idIMDB":"nm0005033"},"actorId":"nm0005033","character":"Ding","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacqueline Chan","urlProfile":"http://www.imdb.com/name/nm8115247","urlPhoto":"","biography":{"bio":"Jacqueline Chan is an actress, known for My Beloved Bodyguard (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8115247","name":"Jacqueline Chan","idIMDB":"nm8115247"},"actorId":"nm8115247","character":"Cherry Li","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Qinqin Li","urlProfile":"http://www.imdb.com/name/nm0702671","urlPhoto":"","biography":{"height":"5' 7\" (1.7 m)","bio":"Qinqin Li was born in Beijing, China. She is an actress, known for Cala, My Dog! (2003), The Great Wall Is a Great Wall (1986) and My Beloved Bodyguard (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0702671","name":"Qinqin Li","idIMDB":"nm0702671"},"actorId":"nm0702671","character":"Park Seon Nun","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andy Lau","urlProfile":"http://www.imdb.com/name/nm0490489","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQzNDkxMjMxMl5BMl5BanBnXkFtZTYwMzMzODA3._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1961","placeOfBirth":" Tai Po, Hong Kong","birthName":"Lau Fok Wing","height":"5' 9\" (1.75 m)","bio":"Andy Lau Tak-wah, (born 27 September 1961) is a Hong Kong actor, singer-songwriter, presenter, and film producer. Lau has been one of Hong Kong's most commercially successful film actors since the mid-1980s, performing in more than 160 films while maintaining a successful singing career at the same time. In the 1990s, Lau was branded by the media as one of the Four Heavenly Kings of Cantopop. Lau was entered into the Guinness World Records for the \"Most Awards Won by a Cantopop Male Artist\". By April 2000, he had already won a total unprecedented 292 awards. In 2005, Lau was awarded \"No.1 Box office Actor 1985-2005\" of Hong Kong, yielding a total box office of HKD 1,733,275,816 for shooting 108 films in the past 20 years. In 2007, Lau was also awarded the \"Nielsen Box Office Star of Asia\" by the Nielsen Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQzNDkxMjMxMl5BMl5BanBnXkFtZTYwMzMzODA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0490489","name":"Andy Lau","nicknames":["Wah Jai"],"idIMDB":"nm0490489"},"actorId":"nm0490489","character":"Li Zheng Jiu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Lee Guy","urlProfile":"http://www.imdb.com/name/nm6667652","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjI3MDU5OV5BMl5BanBnXkFtZTgwNjM4MTU2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"James Lee Guy is an actor, known for My Beloved Bodyguard (2016) and Reborn (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjI3MDU5OV5BMl5BanBnXkFtZTgwNjM4MTU2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6667652","name":"James Lee Guy","idIMDB":"nm6667652"},"actorId":"nm6667652","character":"Sergei","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tomer Oz","urlProfile":"http://www.imdb.com/name/nm5574325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1MTYyOTY3M15BMl5BanBnXkFtZTgwMzM5Njc1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1979","placeOfBirth":" Israel","bio":"Tomer Oz born on October 4, 1979 in Israel, Tomer start his martial art experience since he was a boy, he start practicing at his hometown and later on he travel around the world pursuing his professional martial art dream to become a professional fighter/trainer. Today Tomer is an action actor who worked beside top action stars from Hollywood and Asia. Tomer personal biggest achievement is staring next to Jackie Chan ( his childhood hero ), Tomer act beside Jackie Chan and JC stunt team in 5 different movies, Dragon Blade was one movie who made his recognition in the industry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1MTYyOTY3M15BMl5BanBnXkFtZTgwMzM5Njc1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5574325","name":"Tomer Oz","idIMDB":"nm5574325"},"actorId":"nm5574325","character":"Vasily","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Shek","urlProfile":"http://www.imdb.com/name/nm0790925","urlPhoto":"","biography":{"dateOfBirth":"17 October 1950","placeOfBirth":" Beijing, China","birthName":"Liu Wei Cheng","height":"5' 9\" (1.75 m)","bio":"Dean Shek was born on October 17, 1950 in Beijing, China as Liu Wei Cheng. He is an actor and producer, known for Drunken Master (1978), Snake in the Eagle's Shadow (1978) and A Better Tomorrow II (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0790925","name":"Dean Shek","nicknames":["Charlie Shek","Shek Tien"],"idIMDB":"nm0790925"},"actorId":"nm0790925","character":"Old Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karl Maka","urlProfile":"http://www.imdb.com/name/nm0538353","urlPhoto":"","biography":{"dateOfBirth":"1944","placeOfBirth":" Taishan, Guangdong Province, China","bio":"Karl Maka was born in 1944 in Taishan, Guangdong Province, China. He is an actor and producer, known for Mad Mission (1982), All the Wrong Clues for the Right Solution (1981) and Heng cai san qian wan (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0538353","name":"Karl Maka","idIMDB":"nm0538353"},"actorId":"nm0538353","character":"Old Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hark Tsui","urlProfile":"http://www.imdb.com/name/nm0007139","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMzg0OTc3NV5BMl5BanBnXkFtZTcwNzI4OTI4OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1950","placeOfBirth":" Saigon, Vietnam [now Ho Chi Minh City, Vietnam]","birthName":"Tsui Man-Kong","height":"5' 9\" (1.75 m)","bio":"Tsui Hark recently became the fourth Chinese film director to join the board of judges for the 57th Cannes Film Festival in the feature films category this year. An internationally acclaimed visionary director, Hark started making experimental movies with 8mm film when he was only 13. After graduating from the University of Texas in Austin, majoring in film, he returned to Hong Kong in 1977 and landed a job working in television. In 1979 he directed his film debut, The Butterfly Murders (1979). It raised a lot of attention, and was hailed by many as the start of a new wave in Hong Kong cinema. After making numerous critically and successful films, he co-founded his own production house, Film Workshop, with his wife, Nansun Shi, in 1984. Although the company was intended to be contemporary, it went on to become one of the most successful production companies in Hong Kong, having produced such classics of Hong Kong cinema as _Sinnui yauwan (1987)_ and A Better Tomorrow (1986), which was directed by John Woo and starred the amazing Yun-Fat Chow. Considered the master of kung-fu action films, Tsui Hark's The Swordsman (1990), _Xiao ao jiang hu zhi dong fang bu bai (1991)_, L'auberge du dragon (1992) and Once Upon a Time in China (1991) created a new era and standard for the \"wuxia\" genre that has now become a trend in filmmaking.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMzg0OTc3NV5BMl5BanBnXkFtZTcwNzI4OTI4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007139","name":"Hark Tsui","idIMDB":"nm0007139"},"actorId":"nm0007139","character":"Old Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Biao Yuen","urlProfile":"http://www.imdb.com/name/nm0950707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWMyNmQ2YzMtNTVlZC00OTI4LTg3YTUtYmUyODM3NTI1NDhkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1957","placeOfBirth":" Hong Kong","birthName":"Hsia Ling-Jun","height":"5' 6¼\" (1.68 m)","bio":"Yuen Biao is regarded as one of the most acrobatic martial artists ever. Unfortunately, he is still underrated and not as popular as other contemporaries such as Jackie Chan, Sammo Kam-Bo Hung, and Jet Li even though he is the most critically acclaimed out of all of them and the most talented as well. And now he is receiving a cult following due to word of mouth. Born of his parents Ha Kwong-Tai (father) and Ha Sau-Ying. Yuen Biao was first enrolled in the China Drama Academy at the age of 5 (he was the youngest there). He met Sammo Kam-Bo Hung and Jackie Chan while attending the Academy. Jackie Chan took him under his wing, and they became lifelong friends. Yuen Biao stayed at the Academy until the age of 16 where he moved with Master Jim-Yuen to America. However, two years later he came back, citing there were no opportunities for Chinese martial artists to star in American films. After being in some bit part roles in films such as Stoner (1974) (aka Stoner), Shing le fantastique Mandchou (1976) (aka Hand of Death), he didn't receive his first major breakthrough role until Sammo Kam-Bo Hung cast him in Knockabout (1979) (aka Knockabout). However, his first role which gave him full exposure and established his status as a A-list star was The Prodigal Son (1981) (aka The Prodigal Son), which also starred and was directed by Sammo Kam-Bo Hung. After that, 'Jackie Chan' cast him in the classic Project A (1983) (aka Project A). After starring in some other films with Sammo Kam-Bo Hung and/or Jackie Chan, he decided to go his own way and to forge his own career to get out of the shadows of Jackie Chan and Sammo Kam-Bo Hung. He met his future wife DiDi Phang Sau-Ha in 1984 while working as a stunt coordinator on the film DiDi Phang was working on: Tai fong siu sau (1982) (aka Carry On Pickpocket). They have two children. His daughter Yi-Bui was born in 1986 and his son Ming-Tsak in 1988. The film On the Run (1988) (aka On The Run) confirmed his abilities as a brilliant actor as his portrayal as a married man seeking vengeance for his wife's brutal murder was critically acclaimed. The following year he starred in probably his best film, The Iceman Cometh (1989) (aka The Iceman Cometh), in which he starred with acclaimed actress Maggie Cheung. The film is regarded as a cult classic and is remembered not only for the fantastic fighting scenes and hilarious comedy, but also the wonderful acting of Biao Yuen and Maggie Cheung and the wonderful simmering sexual chemistry between them. After starring in the acclaimed Once Upon a Time in China (1991) (aka Once Upon a Time in China, in which most of his scenes were cut), he directed his first movie (Xi Zang xiao zi (1992). aka A Kid From Tibet), in which he also starred. In 1994, he worked for the first time in years, with Sammo Kam-Bo Hung in the gloriously titled Mou mian bei (1995) (aka Don't Give a Damn). In recent years, Yuen Biao has complained of poor scripts, so he appears in films sparsely nowadays. He also has a second home in Canada where he spends most of time pursuing his hobby of golf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWMyNmQ2YzMtNTVlZC00OTI4LTg3YTUtYmUyODM3NTI1NDhkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950707","name":"Biao Yuen","nicknames":["Little Brother"],"idIMDB":"nm0950707"},"actorId":"nm0950707","character":"Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Peng","urlProfile":"http://www.imdb.com/name/nm2108643","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkxNzIyMzc3Ml5BMl5BanBnXkFtZTgwNDc4ODI5NjE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1982","placeOfBirth":" Taipei, Taiwan","height":"5' 11¾\" (1.82 m)","bio":"For someone who never really considered becoming an actor, Eddie Peng, who once aspired to be a businessman, has done pretty well for himself in showbiz. His almost meteoric rise from virtual unknown to in-demand heartthrob is the stuff of all wannabe actors' dreams. Born in Taiwan, Peng migrated to Canada with his family when he was 13 and spent the next 10 years there. In 2002, the Economics major at the University of British Columbia returned to Taiwan to attend his grandmother's funeral, and was \"discovered\" by director Yang Da Qing, who cast the 20-year-old as the second male lead in the TV series, Tomorrow. The Taiwanese romantic comedy, which also starred Rainie Yang, Shawn Yue and Christine Fan, is based on Japanese manga series, Asunaro Hakusho, written by Fumi Saimon. Unbeknownst to Peng then, this serendipitous casting marked the beginning of his very enviable and swift rise to fame. The following year, Peng landed yet another lead role in TV drama, Scent of Love, playing a star-crossed lover searching for his soulmate through different lifetimes. But it was his role as Tang Yu in the 2005 TV drama, Chinese Paladin, which truly propelled him onto a bigger stage. Banking on his newfound fame, Peng followed up with more TV roles in Only You (2005), When Dolphin Met Cat (2005), The Young Warriors (2006), Wayward Kenting (2007), Honey and Clover (2008), The Concerto (2009), My Sassy Girl (2012) and Sound of the Desert (2014). In 2006, Peng made his big screen debut in the Taiwanese teen flick, Exit No. 6 (2006), by Yu-Hsien Lin. Hooked by the acting bug, Peng made quick strides and soon proved just how committed he was to his newfound profession. Renowned for his 'take no prisoners' approach to each role, Peng is known to devote weeks and months to intense training. Peng also adheres to old-school method-acting techniques and has a reputation for striving to get under the skin of each character he plays. In Hear Me (2009), released to coincide with the 2009 Deaflympics, Peng played a delivery boy who falls for a hearing-impaired girl. The role required him to use sign language throughout the entire movie. To play a gymnast in the coming-of-age movie, Jump Ashin! (2011), he spent 12 hours a day over an eight-month period practising gymnastics. He endured rigorous workout regimes to play a boxer in Dante Lam's Unbeatable (2013) and put in weeks of gruelling training for his role as a professional cyclist in To the Fore (2015), which co-stars Korean heart-throb Si Won Choi. His dedication to the craft has not gone unnoticed. He's earned nominations for Best Supporting Actor for Only You (2006) at the 41st Golden Bell Award, and Best Male Actor for Wayward Kenting (2007) the subsequent year, Best Newcomer at the 44th Golden Horse Awards for the romcom My DNA Says I Love You (2007), Best Actor for Jump Ashin! (2011), and Best Supporting Actor for Unbeatable (2013). Peng's turn in 2011's inspirational box-office hit Jump Ashin! (2011) proved to be a crucial turning point in his career. It launched his career as an action star and put him firmly on the A-list of hot new Chinese actors. He went on to star in sci-fi flick, Love (2012), Hong Kong police thriller Cold War (2012), romcom A Wedding Invitation (2013) and Unbeatable (2013) opposite Nick Cheung, which also earned him a nomination for Best Supporting Actor at the Hong Kong Film Festival in 2014. That same year, he landed the coveted lead in Rise of the Legend (2014), taking on the role of Chinese martial arts legend Huang Fei Hung. To get into character, Eddie not only had to learn kungfu, he studied others who had also played this role, including Jackie Chan and Jet Li, and had to relearn how to walk, speak and think. Although not director Roy Chow 's first choice, Peng's performance and dedication earned him a Best Actor nomination at the Hong Kong Film Awards in 2015. With his good looks, six-pack abs and new title as this generation's kungfu hero, Peng could've easily become stuck as just another action movie typecast, but he refused to be pigeonholed, seeking out instead varied roles that allow him to portray a spectrum of different characters. Dialling back the alpha male posturing, he went on to star in Back in Time (2015) an emotive adaptation of Jiu Ye Hui's novel of the same name, which follows the journey of six best friends from their youth to their adulthood. Not content to just be an actor, the multi-talented Peng has also dabbled in music, releasing five songs on an EP called Must Love in 2009 with a photo book. He has also appeared in several music videos for well-known pop artists such as Maggie Chiang, Fish Leong, Fiona Sit and A-Lin. Now known affectionately as Taiwan's most successful million-dollar man, Peng's celluloid success has led to a strong of commercial sponsorships, including Longines, where he joins the elite ranks of Kate Winslet, Simon Baker, Chi Ling Lin, Aaron Kwok and Aishwarya Rai as Ambassador for Elegance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkxNzIyMzc3Ml5BMl5BanBnXkFtZTgwNDc4ODI5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2108643","name":"Eddie Peng","nicknames":["Yuyan Peng"],"idIMDB":"nm2108643"},"actorId":"nm2108643","character":"Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jun Hu","urlProfile":"http://www.imdb.com/name/nm0432425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDc3Njk1MzYtYjQ5NS00N2VhLWFjYTctZmZmNDFhOTQwMmM3XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1968","placeOfBirth":" Beijing, China","height":"6' 0¾\" (1.85 m)","bio":"Jun Hu was born on March 18, 1968 in Beijing, China. He is an actor and producer, known for Red Cliff (2008), Bodyguards & Assassins (2009) and Red Cliff II (2009). He has been married to Fang Lu since May 1, 1999. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDc3Njk1MzYtYjQ5NS00N2VhLWFjYTctZmZmNDFhOTQwMmM3XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0432425","name":"Jun Hu","idIMDB":"nm0432425"},"actorId":"nm0432425","character":"Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jia Song","urlProfile":"http://www.imdb.com/name/nm2346095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ3ZGRiMTYtYTVlMC00MzJjLThkM2MtOGJiODk1MmJiNDI3XkEyXkFqcGdeQXVyNDg5Mzk5Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1980","placeOfBirth":" Harbin, China","height":"5' 7\" (1.7 m)","bio":"Jia Song was born on November 13, 1980 in Harbin, China. She is an actress, known for Red Cliff (2008), The Final Master (2015) and Falling Flowers (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ3ZGRiMTYtYTVlMC00MzJjLThkM2MtOGJiODk1MmJiNDI3XkEyXkFqcGdeQXVyNDg5Mzk5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2346095","name":"Jia Song","nicknames":["Xiao Song Jia"],"idIMDB":"nm2346095"},"actorId":"nm2346095","character":"Cherry's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shaofeng Feng","urlProfile":"http://www.imdb.com/name/nm2682046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM0MDRhYzctYTA5Ni00YjVmLWJkOWMtNjc5MWQ2MTdkNTQ1XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1978","placeOfBirth":" Shanghai, China","birthName":"Wei Feng","height":"5' 10\" (1.78 m)","bio":"Feng was born in an affluent family of Shanghai. He displayed his interests in acting and performance from a young age. Influenced by his mother, an art enthusiast, Feng entered the Shanghai Theater Academy and studied acting. After he graduated in 2001, Feng chose an acting career and worked as a television actor for ten years before rising to fame overnight with his performance in a period drama, Palace (2011). Feng soon turned his focus to film, and intends to pursue a diverse mix of roles. In White Vengeance (2011), he gives a distinctive performance by playing a tragic hero, Xiang Yu. Feng challenges himself in Détective Dee II: La légende du dragon des mers (2013) with intensive Kung Fu fight scenes. In the award-wining biopic The Golden Era (2014) directed by Ann Hui, Feng plays a controversial left-wing writer, Xiao Jun, and develops a love-hate relationship with one of China's greatest modern writer, Xiao Hong. Feng also displays his comedian talents in box-office hits like Painted Skin: The Resurrection (2012) and The Continent (2014). Handpicked by director Jean-Jacques Annaud, he stars the Chinese-French corporation Le dernier loup (2015), which is adapted from the renowned best-seller of the same name. Feng played a college student went to inner Mongolia during the Cultural Evolution. Feng also develops an interest in fantasy films after filming The Monkey King 2 (2016), in which he plays the famous Monk Tang Sanzang, along with megastar Li Gong and Aaron Kwok, going on the journey to the West. He stars China's first Sci-Fi movie, The Three-Body Problem: I (2017), based on the first translated novel winning the Hugo Award. Further, Feng takes producing duties behind the scenes in the fantasy TV shows that he stars, such as Ice Fantasy (2016) and Na pian xing kong na pian hai (2017). Shaofeng Feng is now one of the leading actors of his generation by keeping a balance between commercial hits and artistic films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM0MDRhYzctYTA5Ni00YjVmLWJkOWMtNjc5MWQ2MTdkNTQ1XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2682046","name":"Shaofeng Feng","idIMDB":"nm2682046"},"actorId":"nm2682046","character":"Doctor Hu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wah Yuen","urlProfile":"http://www.imdb.com/name/nm0950757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTYwOTUwM15BMl5BanBnXkFtZTcwNTYwNzAyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1950","placeOfBirth":" Hong Kong, China","birthName":"Kai Chi Yung","bio":"Wah Yuen was born on September 2, 1950 in Hong Kong, China as Kai Chi Yung. He is known for his work on Kung Fu Hustle (2004), Police Story 3: Supercop (1992) and Australia (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTYwOTUwM15BMl5BanBnXkFtZTcwNTYwNzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950757","name":"Wah Yuen","nicknames":["Wah Ko"],"idIMDB":"nm0950757"},"actorId":"nm0950757","character":"Mail Man","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt4076934","urlIMDB":"http://www.imdb.com/title/tt4076934","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT Plus, Zeiss Ultra Prime, Fujinon Alura and Angenieux Optimo Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak)","D-Cinema"]},"rating":"5.8","filmingLocations":[],"awards":[],"votes":"1,132","type":"Movie","companyCreditsSimple":[{"idCompany":"co0305837","name":"Edko Films"},{"idCompany":"co0023264","name":"Focus Films"},{"idCompany":"co0233420","name":"Irresistible Films"}],"keywords":{"keywords":["bodyguard","dementia","criminal","kung fu","martial arts"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:04:13"}}