{"data":{"movies":[{"title":"Animal Crackers","originalTitle":"","year":"2017","releaseDate":"20170901","directors":[{"name":"Tony Bancroft","id":"nm0051643"},{"name":"Scott Christian Sava","id":"nm1762349"}],"writers":[{"name":"Dean Lorey","id":"nm0520893"},{"name":"Scott Christian Sava","id":"nm1762349"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE0ZWNlYzMtMDVhZi00NzBkLWJiZGMtZDZiMjE0ZjMyMTdmXkEyXkFqcGdeQXVyNTY0MTg1NTE@._V1.jpg","countries":["USA","Spain","China","South Korea"],"languages":["English"],"genres":["Animation","Adventure","Comedy","Family","Fantasy"],"plot":"A family must use a magical box of Animal Crackers to save a run-down circus from being taken over by their evil uncle Horatio P. Huntington.","simplePlot":"A family must use a magical box of Animal Crackers to save a run-down circus from being taken over by their evil uncle Horatio P. Huntington.","actors":[{"actorName":"Emily Blunt","urlProfile":"http://www.imdb.com/name/nm1289434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY4MTMzM15BMl5BanBnXkFtZTcwMjg5NzM2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1983","placeOfBirth":" Roehampton, London, England, UK","birthName":"Emily Olivia Leah Blunt","height":"5' 7\" (1.7 m)","bio":"Emily Olivia Leah Blunt is a British actress known for her roles in The Young Victoria (2009) and The Devil Wears Prada (2006). Blunt was born on February 23, 1983, in Roehampton, South West London, England, the second of four children in the family of Joanna Mackie, a former actress and teacher, and Oliver Simon Peter Blunt, a barrister. Her grandfather was Major General Peter Blunt, and her uncle is MP Crispin Blunt. Emily received a rigorous education at Ibstock Place School, a co-ed private school at Roehampton. However, young Emily Blunt had a stammer, since she was a kid of 8. Her mother took her to relaxation classes, which did not do anything. She reached a turning point at 12, when a teacher cleverly asked her to play a character with a different voice and said, \"I really believe in you\". Blunt ended up using a northern accent, and it did the trick, her stammer disappeared. From 1999 - 2001, Blunt went to Hurtwood House, the top co-ed boarding school where she would excel at sport, cello and singing. She also had two years of drama studies at Hurtwood's theatre course. In August 2000, she was chosen to perform at the Edinburgh Festival. She was signed up by an agent, Kenneth Mcreddie, who led her to the West End and the BBC, scoring her roles in several period dramas on stage as well as on TV productions, such as Foyle's War (2002), Henry VIII (2003) and Empire (2005). In 2001, she appeared as \"Gwen Cavendish\" opposite Dame Judi Dench in Sir Peter Hall's production of \"The Royal Family\" at Haymarket Theatre. For that role, she won the Evening Standard Award for Best Newcomer. In 2002, she played \"Juliet\" in \"Romeo and Juliet\" at the prestigious Chichester Festival. Blunt's career ascended to international fame after she starred as \"Isolda\" opposite Alex Kingston in Warrior Queen (2003). A year later, she won critical acclaim for her breakout performance as \"Tamsin\", a well-educated, cynical and deceptive 16-year-old beauty in My Summer of Love (2004), a story of two lonely girls from the opposite ends of the social heap. Emily Blunt and her co-star, Natalie Press, shared an Evening Standard British Film award for Most Promising Newcomer. In 2005, she spent a few months in Australia filming Irresistible (2006) with Susan Sarandon and Sam Neill. Blunt gave an impressive performance as \"Mara\", a cunning young destroyer who acts crazy and surreptitiously provokes paranoia in others. She also continued her work on British television, starring as \"Natasha\" in Stephen Poliakoff's Gideon's Daughter (2005), opposite Bill Nighy, a role that won her a 2007 Golden Globe Award for Best Performance by an Actress in a Supporting Role. She continued the line of playing manipulative characters as \"Emily\", a caustic put-upon assistant to Meryl Streep's lead in The Devil Wears Prada (2006). Blunt's performance with a neurotic twist added a dimension of sarcasm to the comedy, and gained her much attention as well as new jobs: in two dramas opposite Tom Hanks, then in the title role in the period drama, The Young Victoria (2009). Her most recent works include appearances as antiques dealer \"Gwen Conliffe\" in The Wolfman (2010) and as the ballerina in The Adjustment Bureau (2011). Emily Blunt is a highly versatile actress and a multifaceted person. Her talents include singing and playing cello; she is also skilled at horseback riding. She was in a relationship with Canadian singer Michael Bublé, whom she met at the Australian Logie Awards in 2005 and, again, a few months later, backstage at his Los Angeles concert. Their relationship ended in 2008. Blunt's friend, Anne Hathaway, introduced her to John Krasinski, and they have been together since November 2008. On August 28, 2009, Blunt and Krasinski announced their engagement. The couple married on July 10, 2010, at the estate of their friend, George Clooney, on Lake Como in Italy. Emily Blunt and John Krasinski are living in the Los Angeles area, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY4MTMzM15BMl5BanBnXkFtZTcwMjg5NzM2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1289434","name":"Emily Blunt","nicknames":["Em"],"idIMDB":"nm1289434"},"actorId":"nm1289434","character":"Zoe","urlCharacter":"http://www.imdb.com/character/ch0549070","main":true},{"actorName":"Sylvester Stallone","urlProfile":"http://www.imdb.com/name/nm0000230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Sylvester Gardenzio Stallone","height":"5' 9½\" (1.77 m)","bio":"This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, Richard Burton or Alec Guinness; however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in New York's gritty Hell's Kitchen, to Jackie Stallone (née Labofish), an astrologer, and Frank Stallone, a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core The Party at Kitty and Stud's (1970), the thriller Klute (1971) and the comedy Bananas (1971). He got a crucial career break alongside fellow young actor Henry Winkler, sharing lead billing in the effectively written teen gang film The Lords of Flatbush (1974). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the Roger Corman-produced Death Race 2000 (1975). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 Muhammad Ali-Chuck Wepner fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. Rocky (1976) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members Talia Shire, Burgess Meredith and Burt Young, and director John G. Avildsen gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star. Stallone followed Rocky (1976) with F.I.S.T. (1978), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and Paradise Alley (1978) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel Rocky II (1979). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films Nighthawks (1981) and Victory (1981) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with Rocky III (1982) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard Mr. T. The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor. The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer David Morrell, and his novel was adapted to the screen with Stallone in the lead role in First Blood (1982), also starring Richard Crenna and Brian Dennehy. The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with Rambo: First Blood Part II (1985), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt Dolph Lundgren in Rocky IV (1985). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by Carl Weathers, at the hands of the unstoppable \"Siberian Express\". Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. Cobra (1986) was a clumsy mess, Over the Top (1987) was equally mediocre, Rambo III (1988) saw Rambo take on the Russians in Afghanistan, and cop buddy film Tango & Cash (1989) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star Kurt Russell. Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in Rocky V (1990) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter Tommy Morrison, the great-nephew of screen legend John Wayne. Sly quickly followed with the lukewarm comedy Oscar (1991), the painfully unfunny Stop! Or My Mom Will Shoot (1992), the futuristic action film Demolition Man (1993), and the comic book-inspired Judge Dredd (1995). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing Cop Land (1997), also starring Robert De Niro and Ray Liotta. It isn't a classic of the genre, but Cop Land (1997) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story Antz (1998), reprised the role made famous by Michael Caine in a terrible remake of Get Carter (2000), climbed back into a race car for Driven (2001), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, Spy Kids 3-D: Game Over (2003). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but Rocky Balboa (2006), and Vietnam veteran Rambo (2008) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand. Love him or loathe him, Sylvester Stallone has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000230","name":"Sylvester Stallone","nicknames":["Sly","Michael","The Italian Stallion","Binky","Sly Stallone"],"idIMDB":"nm0000230"},"actorId":"nm0000230","character":"Bullet-Man","urlCharacter":"http://www.imdb.com/character/ch0549071","main":true},{"actorName":"John Krasinski","urlProfile":"http://www.imdb.com/name/nm1024677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY3MjQ3OV5BMl5BanBnXkFtZTcwODI3NjQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1979","placeOfBirth":" Newton, Massachusetts, USA","birthName":"John Burke Krasinski","height":"6' 3\" (1.91 m)","bio":"Tall, handsome American film and television star John Krasinski is probably best known for his role as sardonic nice guy \"Jim Halpert\" on NBC's popular TV series, The Office (2005), for which he won a 2007 and 2008 Screen Actors Guild Award for outstanding performance by an ensemble in a comedy series. Born John Burke Krasinski on October 20, 1979, in Newton, Massachussetts, USA, he is the youngest of three brothers. His mother, Mary Claire (Doyle), is a nurse, and his father, Ronald Krasinski, is an internist. His father is of Polish descent and his mother is of Irish ancestry. His first stage experience was starring in a satirical high school play, written and cast by B.J. Novak. Also good at sports, he played on the same Little League baseball team as B.J. Novak, now a writer and co-star on The Office (2005). After graduating from Newton South High School in 1997, Krasinski planned to be an English major and deferred his first semester of college to teach English in Costa Rica. He attended Brown University, graduating in 2001, as a playwright with honors, then studied at the Eugene O'Neill National Theatre Institute in Waterford, Connecticut. During the summer of 2000, he worked as a script intern on Late Night with Conan O'Brien (1993). Krasinski made his big screen debut in 2002, then played several small roles like \"Ben\" in Kinsey (2004), and \"Bob Flynn\" in Duane Hopwood (2005). He appeared as \"Corporal Harrigan\" in Jarhead (2005), by director Sam Mendes, then played a supporting role as \"Ben\" in The Holiday (2006), a romantic comedy by director Nancy Meyers. He is billed as the voice of \"Lancelot\" in Shrek the Third (2007). Krasinski co-starred opposite Robin Williams and Mandy Moore in the romantic comedy License to Wed (2007), as well as with George Clooney and Renée Zellweger in the football screwball comedy, Leatherheads (2008). He is also director and writer of Brief Interviews with Hideous Men (2009), a big screen adaptation of the eponymous collection of short stories by David Foster Wallace. Krasinski was featured in People Magazine's Sexiest Men Alive issue of 2006. He claims Los Angeles as his current home but travels to New York City and his hometown of Newton, MA, frequently.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MzY3MjQ3OV5BMl5BanBnXkFtZTcwODI3NjQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1024677","name":"John Krasinski","idIMDB":"nm1024677"},"actorId":"nm1024677","character":"Owen","urlCharacter":"http://www.imdb.com/character/ch0549072","main":true},{"actorName":"Ian McKellen","urlProfile":"http://www.imdb.com/name/nm0005212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjgyNjk3MV5BMl5BanBnXkFtZTcwNTA3NTY5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1939","placeOfBirth":" Burnley, Lancashire, England, UK","birthName":"Ian Murray McKellen","height":"5' 11\" (1.8 m)","bio":"Widely regarded as the one of greatest stage and screen actors both in his native Great Britain and internationally, twice nominated for the Oscar and recipient of every major theatrical award in UK and US, Ian Murray McKellen was born on May 25, 1939 in Burnley, Lancashire, England, to Margery Lois (Sutcliffe) and Denis Murray McKellen, a civil engineer. He is of Scottish, Northern Irish, and English descent. During his early childhood, his parents moved with Ian and his sister Jean to the mill town of Wigan. It was in this small town that young Ian rode out World War II. He soon developed a fascination with acting and the theater, which was encouraged by his parents. They would take him to plays, those by William Shakespeare, in particular. The amateur school productions fostered Ian's growing passion for theatre. When Ian was of age to begin attending school, he made sure to get roles in all of the productions. At Bolton School in particular, he developed his skills early on. Indeed, his first role in a Shakespearian play was at Bolton, as Malvolio in \"Twelfth Night\". Ian soon began attending Stratford-upon-Avon theater festivals, where he saw the greats perform: Laurence Olivier, Wendy Hiller, John Gielgud, Ralph Richardson and Paul Robeson. He continued his education in English Drama, but soon it fell by the wayside as he concentrated more and more on performing. He eventually obtained his Bachelor of Arts in 1961, and began his career in earnest. McKellen began working in theatre over the next few years. Very few people knew of Ian's homosexuality; he saw no reason to go public, nor had he told his family. They did not seem interested in the subject and so he saw no reason to bring it up. In 1988, Ian publicly came out of the closet on the BBC Radio 4 program, while discussing Margaret Thatcher's \"section 28\" legislation which would make the \"public promotion of homosexuality\" a crime. It was reason enough for McKellen to take a stand, and he has been active in the Gay Rights movement ever since. Ian resides in Limehouse, where he has also lived with his former long-time partner Sean Mathias. The two men have also worked together on the film Bent (1997) as well as in acclaimed stage productions. To this day, McKellen works mostly in theater, and was knighted by Queen Elizabeth II in 1990 for his efforts in the arts. However, he has managed to make several quite successful forays into film. He has appeared in several productions of Shakespeare's works including his well received Richard III (1995), and in a variety of other movies. However, it has only been recently that his star has finally begun to shine in the eyes of North American audiences. Roles in various films, Cold Comfort Farm (1995), Apt Pupil (1998) and Gods and Monsters (1998), riveted audiences. The latter, in particular, created a sensation in Hollywood, and McKellen's role garnered him several of awards and nominations, including a Golden Globe and an Oscar nod. McKellen, as he continues to work extensively on stage, he always keeps on 'solidifying' his 'role' as Laurence Olivier's worthy 'successor' in the best sense too, such as _King Lear (2008)_ directed by Trevor Nunn and in a range of other staggering performances full of generously euphoric delight that have included \"Peter Pan\" and Noël Coward's \"Present Laughter\", as well as Samuel Beckett's \"Waiting for Godot\" and Harold Pinter's \"No Man's Land\", both in acclaimed productions brilliantly directed by Sean Mathias. McKellen found mainstream success with his performance as Magneto in X-Men (2000) and its sequels. His largest mark on the big screen may be as Gandalf in The Lord of the Rings film trilogy directed by Peter Jackson, which he reprised in The Hobbit trilogy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjgyNjk3MV5BMl5BanBnXkFtZTcwNTA3NTY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005212","name":"Ian McKellen","idIMDB":"nm0005212"},"actorId":"nm0005212","character":"Horatio P. Huntington","urlCharacter":"http://www.imdb.com/character/ch0549084","main":true},{"actorName":"Patrick Warburton","urlProfile":"http://www.imdb.com/name/nm0911320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzc5OTExN15BMl5BanBnXkFtZTcwOTU0MzYwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1964","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Patrick John Warburton","height":"6' 2½\" (1.89 m)","bio":"Patrick Warburton is known to many for the role of \"Puddy\" in the hit NBC comedy \"Seinfeld,\" the laconic, enigmatic, quirky Saab salesman and Elaine's boyfriend. Warburton starred for 7 seasons on the hit CBS comedy \"Rules of Engagement\" with David Spade, Oliver Hudson, and Megyn Price about two couples and their single friend, all at different stages in their relationships dealing with the complications of dating, commitment, and marriage. He is now set to star in NBC's newest sitcom series entitled \"Crowded,\" premiering Sunday, March 20th, about an empty nest couple (Warburton & Carrie Preston) who find out their adult daughters want to move back home with them. Patrick also played \"Guy\" in the international blockbuster comedy Ted and recently completed shooting the highly anticipated sequel Ted 2 where he reprises his role. Warburton starred on the ABC hit comedy \"Less than Perfect,\" as \"Jeb Denton,\" an opinionated network anchorman; and on the hit show \"NewsRadio\" as \"Johnny Johnson\" the unscrupulous business rival who takes over the station. Warburton starred in Disney's major motion picture, live action comedy Underdog, as the archenemy \"Cad,\" based on the 1964 cartoon television series. He is also perhaps the busiest voiceover artist in Hollywood for his many characters including the role of the paraplegic and over-zealous cop, \"Joe Swanson,\" on the hit comedy \"Family Guy.\" Warburton was the lead in the independent film The Civilization of Maxwell Bright, in which he stared as a vicious and self-destructive anti-hero who desperately needs to save his soul. The film won numerous festival awards in which Warburton captured Best Actor at the Beverly Hills Film Festival, New York VisionFest, and the Boulder International Film Festival. The film's other honors include Viewer's Choice at the Beverly Hills Film Festival, the Special Jury Award at WorldFest Houston and at the Florida Film Festival, Grand Jury Prize at the Florida Film Festival, and the Vision Award for David Beaird at WorldFest Houston. This festival favorite is essentially a modern re-telling of \"Beauty and the Beast\" that explores what happens when a modern Neanderthal is locked in close proximity with a kind and loving woman. Written and directed by David Beaird, The Civilization of Maxwell Bright co-stars Jennifer Tilly, Marie Matiko, Simon Callow and Eric Roberts. In addition, Warburton starred in the independent feature film I'll Believe You alongside Fred Willard, Thomas Gibson, and Chris Elliott, a comedy for young adults/teens about a hunt for an alleged alien living in a small town after a mysterious phone call is received on a radio broadcast. The film was released in April of 2007 to 1,500 theaters nationwide, quite the accomplishment for a small independent film. To complement his animated films, Warburton voiced the hit cartoon series \"Scooby-Doo! Mystery Incorporated\" and the animated feature Bee Movie with Jerry Seinfeld, Renée Zellweger, Uma Thurman and Oprah Winfrey. He played the character \"Rip Smashenburn\" in the UPN animated series \"Game Over,\" the voice of \"Brock Samson\" in the animated adult series \"The Venture Brothers,\" and the voice of \"Mr. Barkin\" on the Disney Channel's \"Disney's Kim Possible.\" He plays the character of Ian, \"the ultimate alpha-male,\" in the Sony animated film Open Season opposite Ashton Kutcher and Martin Lawrence. Playing in both regular theaters and Imax 3-D, it was a box office smash on its opening week as #1 and held top spots following its debut. Warburton's voice can also be heard alongside that of Sarah Michelle Geller, Sigourney Weaver, George Carlin, Andy Dick, and Freddie Prinze Jr. in the animated feature film Happily N'ever After, from the producers of Shrek, where he plays the voice of \"Prince Humperdink.\" As the voice of the \"Savior of the Universe\" in Disney's animated Saturday morning TV series \"Buzz Lightyear,\" Warburton's voice graced the big screen in the Disney animated film The Emperor's New Groove, Kronks New Groove and \"The Emperor's New School.\" Warburton started his television career appearing regularly on the CBS sitcom \"Dave's World,\" with Harry Anderson and Mesach Taylor and originally guest-starred on \"Seinfeld\" as the painted-faced New Jersey Devils' fan and Jerry's mechanic, only to become one of the show's funniest fixtures. He also did commercial spots for American Express (as the voice of \"Superman\" alongside Seinfeld), Cadillac, and M&Ms. Warburton starred in The Woman Chaser, which received critical acclaim at the prestigious New York Film Festival and The Sundance Film Festival, as well as opposite Sam Neill in The Dish, an Australian production about the first man on the moon. Barry Sonnenfeld directed Warburton in the Columbia Tri Star half-hour comedy \"The Tick,\" which continues to have a huge cult following since its release on DVD. The show gained its popularity with audiences due to its relaxed, adult-friendly comedy. \"The Tick\", in addition to the DVD, has released action figures, t-shirts, and Quaker Oat Life cereal boxes with \"The Tick\" character adorning the cover. He also paired up with Tim Allen in Sonnenfeld's feature films Big Trouble and Joe Somebody, and also appeared in Scream 3 and Men in Black 2. A native Californian, Patrick grew up in Huntington Beach and resides in Los Angeles with his wife Cathy and four children Talon, Alexandra (Lexie), Shane, and Gabriel. When talking about his children, Patrick's face lights up as he describes them as the ultimate joy and love of his life. With what little spare time he has, Patrick gets in a game of golf or tennis, does activities with his children, and spends time in his cabin on the Rogue River in Oregon with his family. Warburton also hosts the annual charity golf tournament \"Golf for Kids,\" a Celebrity Tournament to benefit St. Jude Children's Hospital each year in Palm Springs, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzc5OTExN15BMl5BanBnXkFtZTcwOTU0MzYwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911320","name":"Patrick Warburton","idIMDB":"nm0911320"},"actorId":"nm0911320","character":"Brock","urlCharacter":"http://www.imdb.com/character/ch0549085","main":true},{"actorName":"Danny DeVito","urlProfile":"http://www.imdb.com/name/nm0000362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1944","placeOfBirth":" Asbury Park, New Jersey, USA","birthName":"Daniel Michael DeVito Jr.","height":"4' 10\" (1.47 m)","bio":"Danny DeVito has amassed a formidable and versatile body of work as an actor, producer and director that spans the stage, television and film. Daniel Michael DeVito Jr. was born on November 17, 1944, in Neptune, New Jersey, to Italian-American parents. His mother, Julia (Moccello), was a homemaker. His father, Daniel, Sr., was a small business owner whose ventures included a dry cleaning shop, a dairy outlet, a diner, and a pool hall. While growing up in Asbury Park, his parents sent him to private schools. He attended Our Lady of Mount Carmel grammar school and Oratory Prep School. Following graduation in 1962, he took a job as a cosmetician at his sister's beauty salon. A year later, he enrolled at New York's American Academy of Dramatic Arts so he could learn more about cosmetology. While at the academy, he fell in love with acting and decided to further pursue an acting career. During this time, he met another aspiring actor Michael Douglas at the National Playwrights Conference in Waterford, Connecticut. The two would later go on to collaborate on numerous projects. Soon after he also met an actress named Rhea Perlman. The two fell in love and moved in together. They were married in 1982 and had three children together. In 1968, Danny landed his first part in a movie when he appeared as a thug in the obscure Dreams of Glass (1970). Despite this minor triumph, Danny became discouraged with the film industry and decided to focus on stage productions. He made his Off-Broadway debut in 1969 in \"The Man With the Flower in His Mouth.\" He followed this up with stage roles in \"The Shrinking Bride,\" and \"Lady Liberty.\" In 1975, he was approached by director Milos Forman and Michael Douglas about appearing in the film version of One Flew Over the Cuckoo's Nest (1975), which would star Jack Nicholson in the leading role. With box office success almost guaranteed and a chance for national exposure, Danny agreed to the role. The movie became a huge hit, both critically and financially, and still ranks today as one the greatest movies of all time. Unfortunately, the movie did very little to help Danny's career. In the years following, he was relegated to small movie roles and guest appearances on television shows. His big break came in 1978 when he auditioned for a role on an ABC sitcom pilot called Taxi (1978), which centered around taxi cab drivers at a New York City garage. Danny auditioned for the role of dispatcher Louie DePalma. At the audition, the producers told Danny that he needed to show more attitude in order to get the part. He then slammed down the script and yelled, \"Who wrote this sh**?\" The producers, realizing he was perfect for the part, brought him on board. The show was a huge success, running from 1978 to 1983. Louie DePalma, played flawlessly by Danny, became one of the most memorable (and reviled) characters in television history. While he was universally hated by TV viewers, he was well-praised by critics, winning an Emmy award and being nominated three other times. Throughout the 1980s and 1990s, Danny maintained his status as a great character actor with memorable roles in movies like Romancing the Stone (1984), Ruthless People (1986), Throw Momma from the Train (1987) and Twins (1988). He also had a great deal of success behind the camera, directing movies like The War of the Roses (1989) and Hoffa (1992). In 1992, Danny was introduced to a new generation of moviegoers when he was given the role of The Penguin/Oswald Cobblepot in Tim Burton's highly successful Batman Returns (1992). This earned him a nomination for Best Villain at the MTV Movie Awards. That same year, along with his then-wife Rhea Perlman, Danny co-founded Jersey Films, which has produced many popular films and TV shows, including Pulp Fiction (1994), Get Shorty (1995), Man on the Moon (1999) and Erin Brockovich (2000). DeVito has many directing credits to his name as well, including Throw Momma from the Train (1987), The War of the Roses (1989), Hoffa (1992), Death to Smoochy (2002) and the upcoming St. Sebastian. In 2006, he returned to series television in the FX comedy series It's Always Sunny in Philadelphia (2005). With a prominent role in a hit series, Devito's comic talents were now on display for a new generation of television viewers. In 2012, he provided the title voice role in Dr. Seuss' The Lorax (2012). These days, he continues to work with many of today's top talents as an actor, director and producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000362","name":"Danny DeVito","idIMDB":"nm0000362"},"actorId":"nm0000362","character":"Chesterfield","urlCharacter":"http://www.imdb.com/character/ch0549086","main":true},{"actorName":"Raven-Symoné","urlProfile":"http://www.imdb.com/name/nm0712368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzM4NTA0Nl5BMl5BanBnXkFtZTcwNzMyOTgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1985","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Raven-Symoné Christina Pearman","height":"5' 2\" (1.57 m)","bio":"Raven-Symoné Pearman was born in Atlanta, Georgia, to Lydia (Gaulden) and Christopher Pearman. At a young age, she moved to New York. While there Raven signed with the Ford Modeling Agency. They sent her out on a audition for a movie called Ghost Dad (1990), which also starred the legendary Bill Cosby. She was deemed too young for the role since was only 3 years old, but Cosby could see she had talent. They asked Raven to come back to read lines, and she did so well that she got a starring role as Olivia on the last three seasons of The Cosby Show (1984). After the show finished its run, she decided to try something new like singing. In 1993, she became the youngest person ever to sign with MCA Records. She also went back to acting with a starring role in Hangin' with Mr. Cooper (1992), alongside Mark Curry and a small role in the TV mini-series Queen (1993). After another small role in the feature film The Little Rascals (1994) and the role of Goldilocks in the TV series Happily Ever After: Fairy Tales for Every Child (1995), \"Hangin' with Mr. Cooper\" ended. Raven's singing career was doing well and she landed a role in Doctor Dolittle (1998) alongside Eddie Murphy and a made-for-TV movie called Zenon: Girl of the 21st Century (1999). She also starred in Dr. Dolittle 2 (2001), but she was not available to do Zenon: The Zequel (2001). However, the Walt Disney Company, which made the Zenon movies, wanted her back to do a pilot for a new Disney TV show called \"Absolutely Psychic,\" in which she would be a supporting character. She impressed them so much that they changed the show's premise to be about her and the show's name was changed to That's So Raven (2003). After the show was a hit she did the made-for-TV movie Les Cheetah Girls (2003) and recorded a new album. A movie based on \"That's So Raven\" may be in the works.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzM4NTA0Nl5BMl5BanBnXkFtZTcwNzMyOTgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712368","name":"Raven-Symoné","nicknames":["Rae","Rave"],"idIMDB":"nm0712368"},"actorId":"nm0712368","character":"Binkley","urlCharacter":"http://www.imdb.com/character/ch0502523","main":true},{"actorName":"Tara Strong","urlProfile":"http://www.imdb.com/name/nm0152839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk3MTI1Nzk2OF5BMl5BanBnXkFtZTYwODQzNDEz._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1973","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Tara Lyn Charendoff","height":"5' 2½\" (1.59 m)","bio":"Tara Strong was born on February 12, 1973 in Toronto, Ontario, Canada as Tara Lyn Charendoff. She is an actress, known for My Little Pony: Friendship Is Magic (2010), The Fairly OddParents (2001) and Princess Mononoke (1997). She has been married to Craig Strong since May 14, 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk3MTI1Nzk2OF5BMl5BanBnXkFtZTYwODQzNDEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0152839","name":"Tara Strong","idIMDB":"nm0152839"},"actorId":"nm0152839","character":"Talia","urlCharacter":"http://www.imdb.com/character/ch0549087","main":true},{"actorName":"Wallace Shawn","urlProfile":"http://www.imdb.com/name/nm0001728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1943","placeOfBirth":" New York City, New York, USA","birthName":"Wallace Michael Shawn","height":"5' 2\" (1.57 m)","bio":"American character actor and writer Wallace Shawn has one of those fun, mischievously homely faces just made to entertain. Though he got out of the starting gate rather slowly, he has since excelled on stage, television and film while managing to turn himself into a winner with his loser-type looks. Woody Allen's character in the movie Manhattan (1979) amusingly describes Wallace's character as \"a homunculus\", which is a pretty fair description of this predominantly bald, wan, pucker-mouthed, butterball-framed, slightly lisping gent. Wallace made his movie debut in Allen's heralded classic playing Diane Keaton's ex-husband. Born to privilege on November 12, 1943 in New York City, Wallace was the son of renowned editor William Shawn of \"The New Yorker\" fame and educated at both Harvard University, where he studied history, and Magdalen College, Oxford. Wallace initially taught English in India on a Fulbright scholarship, and then English, Latin and drama back in New York. However, a keen interest in writing and acting soon compelled him to leave his cushy position and pursue a stage career as both playwright and actor. During his distinguished career, Wallace turned out several plays. \"Our Late Night\", the first of his works to be performed, was awarded an off-Broadway Obie in 1975. \"A Thought in Three Parts\" (1976); \"The Mandrake\" (1977), which he translated from the original Italian and in which he made his acting debut; \"Marie and Bruce\" (1979); \"Aunt Dan and Lemon\" (1985) and \"The Fever\", for which he received his second Obie Award for \"Best New Play\" during the 1990-91 season, then followed. A popular support player in both comedy and occasional drama, his assorted kooks, creeps, eggheads and schmucks possessed both endearing and unappetizing qualities. He earned some of his best early notices partnered with theatre director/actor Andre Gregory in the unique Louis Malle-directed film My Dinner with Andre (1981). Shawn co-wrote the improvisatory, humanistic piece and his brother, Allen Shawn, was the composer. Shawn and Gregory would collaborate again for Malle in another superb, original-concept film Vanya on 42nd Street (1994). Among the quality offbeat filming involving has been Bruce Paltrow's A Little Sex (1982); James Ivory's The Bostonians (1984); Stephen Frears' Prick Up Your Ears (1987); Rob Reiner's The Princess Bride (1987); Alan Rudolph's The Moderns (1988) and Mrs. Parker and the Vicious Circle (1994); Paul Bartel's Scenes from the Class Struggle in Beverly Hills (1989); and several others for Woody Allen: Radio Days (1987), Shadows and Fog (1991), The Curse of the Jade Scorpion (2001) and Melinda and Melinda (2004). Of late, he has lent his vocal talents to a considerable number of animated pictures including A Goofy Movie (1995), Toy Story (1995) (and its sequel), The Jungle Book: Mowgli's Story (1998), The Incredibles (2004), Chicken Little (2005) and Happily N'Ever After (2006). Over the decades, Shawn has scurried about effortlessly in a number of television guest appearances including Taxi (1978), Homicide: Life on the Street (1993), Ally McBeal (1997), Law & Order: Criminal Intent (2001) and Desperate Housewives (2004), and has drummed up a few recurring roles for himself in the process, including The Cosby Show (1984), Murphy Brown (1988), Star Trek: Deep Space Nine (1993) and Crossing Jordan (2001). In the series Clueless (1996), based on the highly successful of the same name Clueless (1995), Shawn revisited his role as the owlish high school teacher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001728","name":"Wallace Shawn","idIMDB":"nm0001728"},"actorId":"nm0001728","character":"Mr. Woodley","urlCharacter":"http://www.imdb.com/character/ch0549088","main":true},{"actorName":"Gilbert Gottfried","urlProfile":"http://www.imdb.com/name/nm0331906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2OTI1NDA3OF5BMl5BanBnXkFtZTcwMjU3MzE3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1955","placeOfBirth":" Brooklyn, New York, USA","height":"5' 5\" (1.65 m)","bio":"At the young age of 15, Gilbert Gottfried began doing stand-up at open mike nights in New York City and, after a few short years, became known around town as \"the comedian's comedian\". After spending several years mastering the art of stand-up comedy, producers of the legendary NBC late-night comedy show, Saturday Night Live (1975), became aware of Gottfried and, in 1980, hired him as a cast member. It wasn't until a few years later when his true notoriety would begin when MTV hired him for a series of improvised and hilarious promos for the newly formed channel. This led to several television appearances on The Cosby Show (1984) and Late Night with David Letterman (1982). Gottfried's work in television soon led to roles in film. Most notable was his improvised scene as business manager \"Sidney Bernstein\" in the hit sequel, Beverly Hills Cop II (1987), for which the New York Daily News said that \"Gilbert Gottfried steals the picture with a single scene\". Aside from his glowing reputation in comedy clubs, Gottfried began to gain a reputation as the king of quirky roles in both movies and television. He appeared in such movies as Problem Child (1990), Problem Child 2 (1991), Look Who's Talking Too (1990) and The Adventures of Ford Fairlane (1990). He was also the host of the very popular late night movie series, Up All Night (1989). After his stellar performance as the wise cracking parrot, \"Iago\", in the Disney classic, Aladdin (1992), Gottfried became one of the most recognizable voice-over talents. His signature voice can be heard in several commercials, cartoons and movies, including the frustrated duck in the AFLAC Insurance commercials. Gottfried also is the voice of \"Digit\" in the long- running PBS Series, Cybermatt (2002). Gottfried has been a regular on the new Hollywood Squares (1998) and is a frequent guest on The Tonight Show with Jay Leno (1992) and Howard Stern on Demand (2005). Gottfried recently appeared in the hit comedy documentary, The Aristocrats (2005), with Entertainment Weekly saying that \"out of the 101 comedians who appear on screen, no one is funnier - or more disgusting - than Gilbert Gottfried\". \"Gilbert Gottfried Dirty Jokes\" was recently released on both DVD and CD, featuring 50 non-stop minutes of Gottfried telling the funniest and filthiest jokes, ever. The show was filmed live at the Gotham Comedy Club in New York City. Also featured on the DVD are some of the funniest bonus features ever, including wild stories, indignant ranting and celebrity impressions that will leave viewers crying for more. For this live performance, Gottfried puts aside political correctness and fires an onslaught of jokes that know no boundaries. At the end of the show, Gottfried tells what is known among comedians as the \"Dirtiest Joke of All Time\", which is also the basis for The Aristocrats (2005). Gottfried is one of the most sought-after comedians, and regularly performs live to sold-out audiences across North America.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2OTI1NDA3OF5BMl5BanBnXkFtZTcwMjU3MzE3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0331906","name":"Gilbert Gottfried","nicknames":["America's Creepy Uncle"],"idIMDB":"nm0331906"},"actorId":"nm0331906","character":"Mario Zucchini","urlCharacter":"http://www.imdb.com/character/ch0549090","main":true},{"actorName":"Harvey Fierstein","urlProfile":"http://www.imdb.com/name/nm0001213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MzgzOTI3Nl5BMl5BanBnXkFtZTcwNzE3MjU4Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1954","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2½\" (1.89 m)","bio":"Harvey Fierstein was born on June 6, 1954 in Brooklyn, New York City, New York, USA. He is an actor and writer, known for Mrs. Doubtfire (1993), Independence Day (1996) and Mulan (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MzgzOTI3Nl5BMl5BanBnXkFtZTcwNzE3MjU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001213","name":"Harvey Fierstein","idIMDB":"nm0001213"},"actorId":"nm0001213","character":"Esmerelda","urlCharacter":"http://www.imdb.com/character/ch0549089","main":true},{"actorName":"James Arnold Taylor","urlProfile":"http://www.imdb.com/name/nm0852517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODA4ODg5Ml5BMl5BanBnXkFtZTgwOTQ1NzY1MDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1969","placeOfBirth":" Santa Barbara, California, USA","birthName":"James Arnold Taylor","height":"5' 4\" (1.63 m)","bio":"James Arnold Taylor's versatile vocal range has given him success in every facet of the voice-over industry. His voice is heard all of the world daily, and you would never know it's one person. His list of credits range from leading roles in major summer blockbuster films, starring roles in the hottest animation on television, a promo voice for Fox, Spike, G4, and national ad campaigns in commercials for TV and radio, from the voice of a Mini Wheat to the current voice of Fred Flintstone. You can literally play the \"Six Degrees of...\" game with James and be only one degree from just about every name in Hollywood today. James' most notable credits are: Obi-Wan Kenobi from Star Wars: The Clone Wars (2008), Leonardo from Teenage Mutant Ninja Turtles (2012), Johnny from Johnny Test (2005), Green Arrow from Batman: The Brave and the Bold (2008), Harry Osborn from The Spectacular Spider-Man (2008), Milo Thatch from Atlantis: Milo's Return (2003), Wooldoor Sockbat and the Producer from Drawn Together (2004), The Fallen from Transformers: Revenge of the Fallen (2009), Tidus from Final Fantasy X (2001), Final Fantasy X-2 (2003) and Dissidia: Final Fantasy (2008) video games, Ratchet from the Ratchet & Clank (2002) video game series, Gabe Logan from the Syphon Filter (1999) video game series, and Ash from The Animatrix (2003). James also voice-doubles for many of today's biggest names, including _Johnny Depp_, _Ewan McGregor_, _Shia LaBeouf_, _Christopher Walken_, _Michael J. Fox (I)_, _David Spade_, _Daniel Radcliffe_, _Clive Owen (I)_, _Nicolas Cage_, _Christian Bale_, _Steve Carell_, _Matthew McConaughey_, _Justin Timberlake_, _James McAvoy_, _Alec Baldwin_, _Billy Bob Thornton_, _Seann William Scott_, _Denis Leary_, _Robin Williams (I)_, and _Ron Howard (I)_. Having voices in some of the biggest franchises in movies, TV, and video games, he has had a successful career ultimately doing what he loves most: entertaining.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODA4ODg5Ml5BMl5BanBnXkFtZTgwOTQ1NzY1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852517","name":"James Arnold Taylor","idIMDB":"nm0852517"},"actorId":"nm0852517","character":"Buffalo Bob","urlCharacter":"http://www.imdb.com/character/ch0549091","main":true},{"actorName":"Kevin Grevioux","urlProfile":"http://www.imdb.com/name/nm0340485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM1MzMzMjI0OV5BMl5BanBnXkFtZTcwOTMzNTcyMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1962","placeOfBirth":" Chicago, Illinois, USA","height":"6' 3\" (1.91 m)","bio":"Hailing from Minneapolis, Minnesota, Kevin Grevioux was born in Chicago, Illinois and raised in various other states including Alaska, Oklahoma, Massachusetts (Boston), and New Jersey. He graduated from Howard University in Washington, D.C. with a degree in Microbiology, afterwards attending graduate school and this time working towards a Masters in Genetic Engineering. While studying, he congruently took screenwriting and cinematography classes as well, and by the time his first semester of grad school had finished, Kevin had chosen film as his preferred career and moved to Los Angeles, where he began to work as a writer in earnest. To this end he has written several scripts in various genres and has written and directed two short sci-fi films Indigo and Thanatos. Kevin met 'Underworld' director Len Wiseman while working on the sci-fi hit Stargate - La porte des étoiles (1994), when Len was a prop assistant and Kevin an extra. The two formed a friendship and later collaborated on a host of other ideas and concepts leading to the completion of two scripts, one of which was Underworld (2003). The idea for the concept was Kevin's; in addition, he wrote the original screenplay and treatment for the film in 2000. Kevin has also studied acting and has had several small roles in television, film and commercials. Most recently in Planet of the Apes (2001), Charlie's Angels (2000), Marvel Comics' The Hulk and in Underworld (2003), playing the formidable Lycan character Raze. He also serves as an Associate Producer on the film and is working on several other screenplays as well as his first novel, a science fiction thriller.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM1MzMzMjI0OV5BMl5BanBnXkFtZTcwOTMzNTcyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0340485","name":"Kevin Grevioux","idIMDB":"nm0340485"},"actorId":"nm0340485","character":"Samson the Strongman","urlCharacter":"http://www.imdb.com/character/ch0549092","main":true},{"actorName":"Cam Clarke","urlProfile":"http://www.imdb.com/name/nm0164682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA0MjY3MTkxMV5BMl5BanBnXkFtZTcwMDM3NDQwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1957","placeOfBirth":" Los Angeles, California, USA","birthName":"Cameron Arthur Clarke","height":"6' (1.83 m)","bio":"Cam Clarke was born on November 6, 1957 in Los Angeles, California, USA as Cameron Arthur Clarke. He is known for his work on Big Hero 6 (2014), Teenage Mutant Ninja Turtles (1987) and Masters of the Universe vs. the Snake Men (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA0MjY3MTkxMV5BMl5BanBnXkFtZTcwMDM3NDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0164682","name":"Cam Clarke","idIMDB":"nm0164682"},"actorId":"nm0164682","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brianne Brozey","urlProfile":"http://www.imdb.com/name/nm0369981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDczMjcyMF5BMl5BanBnXkFtZTcwNTA3MjYzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1963","placeOfBirth":" West Virginia, USA","birthName":"Brianne Siddall","bio":"Brianne Brozey was born on August 25, 1963 in West Virginia, USA as Brianne Siddall. She is known for her work on Jungle Shuffle (2014), Power Rangers Time Force (2001) and Tarzan (1999). She has been married to Deven Chierighino since April 4, 1987.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDczMjcyMF5BMl5BanBnXkFtZTcwNTA3MjYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369981","name":"Brianne Brozey","nicknames":["Bree"],"idIMDB":"nm0369981"},"actorId":"nm0369981","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt4155534","urlIMDB":"http://www.imdb.com/title/tt4155534","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[],"awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0323915","name":"Beijing Wen Hua Dong Run Investment Co."},{"idCompany":"co0357194","name":"China Film Co."},{"idCompany":"co0507990","name":"Landmark International"}],"keywords":{"keywords":["circus","animal crackers","computer animation","magic","daredevil","cowboy","monkey","giraffe","workaholic","biscuits","clown","hippo","elephant","bear","tiger","lion","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:37:26"}}