{"data":{"movies":[{"title":"Stevie Wonder: Live at Last","originalTitle":"","year":"2009","releaseDate":"20090310","directors":[{"name":"Hamish Hamilton","id":"nm0357895"}],"writers":[],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGFjZGE3YmMtZmViZi00MDg4LTk3NmMtNGZmYjUyMzViYzA0XkEyXkFqcGdeQXVyMTQ0MjgzODU@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Music"],"simplePlot":"","actors":[{"actorName":"Dwight Adams","urlProfile":"http://www.imdb.com/name/nm5183654","urlPhoto":"","biography":{"bio":"Dwight Adams is known for his work on The 25th Anniversary Rock and Roll Hall of Fame Concert (2009), Stevie Wonder: Live at Last (2009) and BBC Stevie Wonder 1981 Documentary.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5183654","name":"Dwight Adams","idIMDB":"nm5183654"},"actorId":"nm5183654","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle Bolden","urlProfile":"http://www.imdb.com/name/nm7662527","urlPhoto":"","biography":{"bio":"Kyle Bolden is known for his work on Stevie Wonder: Live at Last (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7662527","name":"Kyle Bolden","idIMDB":"nm7662527"},"actorId":"nm7662527","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimberly Brewer","urlProfile":"http://www.imdb.com/name/nm0108190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTQ5NzMyNF5BMl5BanBnXkFtZTcwNzk4NzEzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Kimberly Brewer is known for her work on Jungle Fever (1991), Ticker (2001) and Stevie Wonder: Live at Last (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTQ5NzMyNF5BMl5BanBnXkFtZTcwNzk4NzEzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0108190","name":"Kimberly Brewer","idIMDB":"nm0108190"},"actorId":"nm0108190","character":"Backing Vocals","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Errol Cooney","urlProfile":"http://www.imdb.com/name/nm3754454","urlPhoto":"","biography":{"bio":"Errol Cooney is known for his work on The 25th Anniversary Rock and Roll Hall of Fame Concert (2009), Stevie Wonder: Live at Last (2009) and BBC Stevie Wonder 1981 Documentary.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3754454","name":"Errol Cooney","idIMDB":"nm3754454"},"actorId":"nm3754454","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fausto Cuevas","urlProfile":"http://www.imdb.com/name/nm6184096","urlPhoto":"","biography":{"bio":"Fausto Cuevas is known for his work on Jennifer Lopez: Dance Again (2014), Britney Spears Live from Miami (2004) and Stevie Wonder: Live at Last (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6184096","name":"Fausto Cuevas","idIMDB":"nm6184096"},"actorId":"nm6184096","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dejah Gomez","urlProfile":"http://www.imdb.com/name/nm3753778","urlPhoto":"","biography":{"bio":"Dejah Gomez is an actress, known for Young American Gangstas (2009), Stevie Wonder: Live at Last (2009) and Stevie Wonder: In Performance at the White House - The Library of Congress Gershwin Prize (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3753778","name":"Dejah Gomez","idIMDB":"nm3753778"},"actorId":"nm3753778","character":"Backing Vocals","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darryl Munyungo Jackson","urlProfile":"http://www.imdb.com/name/nm0413887","urlPhoto":"","biography":{"bio":"Darryl Munyungo Jackson is known for his work on Ocean's Twelve (2004), Into the Sun (2005) and Candyman: Day of the Dead (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0413887","name":"Darryl Munyungo Jackson","idIMDB":"nm0413887"},"actorId":"nm0413887","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith John","urlProfile":"http://www.imdb.com/name/nm0424188","urlPhoto":"","biography":{"birthName":"D. Keith John","bio":"Keith John was born as D. Keith John.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0424188","name":"Keith John","nicknames":["Keeker"],"idIMDB":"nm0424188"},"actorId":"nm0424188","character":"Backing Vocals","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roman Johnson","urlProfile":"http://www.imdb.com/name/nm7662528","urlPhoto":"","biography":{"bio":"Roman Johnson is known for his work on Stevie Wonder: Live at Last (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7662528","name":"Roman Johnson","idIMDB":"nm7662528"},"actorId":"nm7662528","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Kilgore","urlProfile":"http://www.imdb.com/name/nm5183374","urlPhoto":"","biography":{"bio":"Ryan Kilgore is known for his work on The Fighting Temptations (2003), The Country Bears (2002) and The 25th Anniversary Rock and Roll Hall of Fame Concert (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5183374","name":"Ryan Kilgore","idIMDB":"nm5183374"},"actorId":"nm5183374","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aisha Morris","urlProfile":"http://www.imdb.com/name/nm1187312","urlPhoto":"","biography":{"bio":"Aisha Morris is known for her work on Stevie Wonder Songs in the Key of Life an All Star Grammy Salute (2015), An Evening of Stars: Tribute to Stevie Wonder (2006) and The 25th Anniversary Rock and Roll Hall of Fame Concert (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1187312","name":"Aisha Morris","idIMDB":"nm1187312"},"actorId":"nm1187312","character":"Backing Vocals","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Randolph","urlProfile":"http://www.imdb.com/name/nm5183582","urlPhoto":"","biography":{"bio":"Stanley Randolph is known for his work on The 25th Anniversary Rock and Roll Hall of Fame Concert (2009), 2015 NBA All-Star Game (2015) and Stevie Wonder: Live at Last (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5183582","name":"Stanley Randolph","idIMDB":"nm5183582"},"actorId":"nm5183582","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Theodore","urlProfile":"http://www.imdb.com/name/nm7662529","urlPhoto":"","biography":{"bio":"Victoria Theodore is an actress, known for Stevie Wonder: Live at Last (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7662529","name":"Victoria Theodore","idIMDB":"nm7662529"},"actorId":"nm7662529","character":"Backing Vocals","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nathan Watts","urlProfile":"http://www.imdb.com/name/nm0915209","urlPhoto":"","biography":{"dateOfBirth":"25 March 1954","placeOfBirth":" Detroit, Michigan, USA","birthName":"Nathan Lamar Watts","bio":"Nathan Watts was born on March 25, 1954 in Detroit, Michigan, USA as Nathan Lamar Watts. He is known for his work on Jungle Fever (1991), Standing in the Shadows of Motown (2002) and The Woman in Red (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0915209","name":"Nathan Watts","idIMDB":"nm0915209"},"actorId":"nm0915209","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stevie Wonder","urlProfile":"http://www.imdb.com/name/nm0005567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5NzQwOTU4OF5BMl5BanBnXkFtZTYwMTk3MTk0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1950","placeOfBirth":" Saginaw, Michigan, USA","birthName":"Stevland Hardaway Judkins","height":"6' (1.83 m)","bio":"Born Stevland Hardaway Judkins in Saginaw, Michigan, United States, to Calvin Judkins and Lula Mae Hardaway. Due to being born six weeks premature, Stevie Wonder was born with a condition called retinopathy of prematurity, which made him blind. Stevie Wonder, even with this disability, made his landmark to be a pioneer and innovator in the music industry. Stevie Wonder's mother, Lula Mae Hardaway left her husband and moved herself and her children to Detroit. Due to her leaving Lula Hardaway Judkins changed her name to Lula Hardaway and changed Stevie's surname to Stevland Morris. Stevland Morris growing up played various instruments such as the piano, harmonica, drums, and bass. Stevland Morris never played a lot of outdoor activities due to his protective mother. Stevland Morris due to his musical talent was also strongly apart of the church choir. Stevland Morris was originally discovered by Gerald White who often persuaded his brother, soul singer Ronnie White to visit the talented Stevland Morris. Ronnie White after seeing Stevland Morris brought Stevland and his mother to MoTown Records to visit Berry Gordy. Berry Gordy stated he was not impressed by Stevland's singing,or drumming,bongo skills and then he played the harmonica, which astounded Berry Gordy and Stevland Morris in 1961 at the age of eleven signed onto MoTown Records with the stage name, Little Stevie Wonder. The reason why Stevie Wonder had gotten that stage name was because many people were astounded by his ability to play numerous instruments and his ability to sing doing both at the same time, and people called Stevie \"A Little Wonder\". Stevie Wonder released his first album called,The Jazz Soul Of Little Stevie at the age of twelve followed by an additional album, Tribute To Uncle Ray dedicated to Ray Charles. In 1963, Stevie Wonder released a hit-song called, Fingertips Pt(2). The song reached number one on the Billboard Pop Charts. Stevie Wonder became the first singer to have a number one album and single simultaneously. In the song were several percussion instruments played by Stevie Wonder and this song was added to the album,Recorded Live: The Twelve Year Old Genius. Stevie Wonder was then referred to as the child prodigy. Stevie Wonder in 1964 made in film debut in the movie, Muscle Beach Party as well as the sequel Bikini Beach both directed by William Asher. In this movie Stevie Wonder shows off his musical talent singing the songs, Happy Street and Happy Feeling (Dance And Shout). Stevie Wonder also dropped \"Little\" from this stage name as his voice started to change and he could no longer sing songs which Clarence Paul had written for him, as they were all written in a higher pitched note. Stevie Wonder then started focusing more on songwriting and came out with genuine hits like Uptight (Everything's Alright),With A Child's Heart, Blowing In The Wind, and a song which he wrote for Smokey Robinson and The Miracles, Tears Of A Clown. Several other songs which were smashing hits in the 60's and 70's were I Was Made To Love Her, Signed Sealed And Delivered I'm Yours, which Stevie stated was an idea he had gotten from his mother,and For Once In My Life. In 1970 Stevie Wonder left MoTown and recorded two independent albums by himself. Berry Gordy was shocked to hear this by Stevie Wonder and Berry Gord agreed to Stevie Wonder's demand of more independence and full creative control and rights to all his songs. In 1972 Stevie Wonder returned to MoTown records and signed a thirteen million dollar contract with MoTown Records. This entitled Stevie Wonder to a higher royalty rate and more full creative control and the rights to his own songs, which few artists had gotten at that time period. This contract unleashed Wonder's songs to now talk about controversial issues such as poverty,war,drugs, and politics.Stevie is known for writing and performing political songs such as, You Haven't Done Nothing, which took a political stab at Richard Nixon. The first album he had released with his new agreement with MoTown was, Music Of My Mind in 1972. In late 1972 Stevie Wonder released an album which today is known as a historic piece in music,Talking Book. Which included the number one hit-song, Superstition. This song featured the clavinet which Stevie Wonder was credited pioneer of, he later used the electric amplified keyboard instrument in many of his other albums along with the synthesizer. The song Superstition was seen as a significant contribution to the Funk genre. Talking Book also featured, You Are The Sunshine Of My Life which also peaked at number one. Stevie Wonder also toured with The Rolling Stones in 1972 which contributed to his album's success. Stevie Wonder struck a controversial issue with the album, Innervisions in 1973 with singles such as Living For The City which talked about poverty and was credited to African Americans.The album also included singles such as Golden Lady, and All Love Is Fair. On August,6, 1973 Stevie Wonder was in a car accident. The twenty-three year old Stevie Wonder was in the passenger seat of a 1948 Dodge Flatbed Truck,he was sleeping and had his headphones on, the driver distracted by something, and failed to notice the truck ahead of them and crashed. This sent Stevie Wonder into a coma for several days. In a biography entitled, The Miraculous Journey Of Lula Mae Hardaway she retells the story, \"There was a great, grinding screech as metal hit metal and, then, impossibly, as if in some lavishly produced Hollywood action movie, one of the great logs disencumbered itself of the truck and came crashing through the windshield, spearing Stevie square in the forehead.\" Wonder was sent to a hospital immediately after the accident, and was placed under intensive care, with what they described a \"bruise on the head\" Wonder then made a successful recovery and in 1974 released Fullfillingness' First Finale and which song topped number one on the Billboard Pop Charts was the political song, You Haven't Done Nothing. By the age of twenty-five he was a multiple Grammy-Award winner, winning Grammies for albums such as Talking Book, Inner Vision, and Fullfillingness' First Finale and at the age of twenty-five with several talent musicians he was on the verge of making what came to be one of this most admirable masterpieces, an album called, Songs In The Key Of Life. The double-album, Songs In The Key Of Life was released in 1976 and the album became the first of an American artist to debut straight at number one where it remained for fourteen consecutive weeks. The album contained two tracks which rose to number one on the Billboard Charts,I Wish and Sir Duke. The album also contained an extraordinary sentimental song about his daughter Aisha Morris called,Isn't She Lovely\". It also contained the song which focused strongly on poverty called, Village Ghetto Land. Rolling Stones listed the album as the 56th Greatest Album Of All Time out of 500. In 1979, Wonder released a soundtrack album called Journey Through The Secret Life Of Plants. It was featured in the film The Secret Life Of Plants. Wonder also wrote the song,Let's Get Serious for Jermaine Jackson who left The Jacksons and was starting his own solo career. The song was ranked by Billboard to be the number one rhythm and blues song of 1980. In 1980, Stevie Wonder released the album called Hotter Than July. On this album was a song called Happy Birthday. That song was dedicated to Martin Luther King Jr, and Stevie Wonder was one of the pioneers to getting Martin Luther King Jr a national holiday. Stevie Wonder in 1985 received an Academy Award for his song, I Just Called To Say I Love in the film, The Woman In Red. In 1986, Stevie Wonder made a guest appearance on the hit-show The Cosby Show. It was during this episode in which people were astounded toward what the synthesizer could really do. In 1987 Stevie Wonder made a duet with Michael Jackson on his Bad album with the single, Just Good Friends. In the same year Michael Jackson did a duet on Stevie Wonder's characters album. In 1991, Stevie Wonder recorded a soundtrack album for Spike Lee in his new movie, Jungle Fever. The album was entitled, Jungle Fever and the hit-song on it was entitled Jungle Fever. Other singles that came from this album were Gotta Have You,Feeding Off The Love Of The Land,and These Three Words. Stevie Wonder continued releasing new material throughout the 90's such as Natural Wonder, and Conversation Piece. In 1996 Stevie Wonder's A Song In The Key Of Life album became a documentary subject, and several of the musicians who contributed to the success of the album had a reunion. In 1997 Stevie Wonder collaborated with Babyface on the single, How Come How Long. In 2000 Stevie Wonder contributed to two sound track songs for Spike Lee's film Bamboozled. The two soundtrack songs were Misrepresented People and Some Years Ago. In 2006, Stevie Wonder's inspiration of his life, his mother, Lula Mae Hardaway died on May,31,2006. Stevie Wonder then in 2007 announced his tour, A Wonder's Summer Night 13 concert tour- this was his first in over ten years, and he states, he wants to take all the sadness he feels,turn it around and celebrate. Stevie Wonder in 2008 was very involved in the Presidential Campaign, and why he thinks Obama will be a great president for America. Stevie Wonder talked at several press conferences about Obama and why America should vote for him. Stevie Wonder in 2009 was named the United Nations Messenger Of Peace.On February 23,2009 Stevie Wonder received the Gershwin Prize For Pop Music awarded to Stevie Wonder by Barack Obama. On June,25,2009 one of his best friends,Michael Jackson had died. Stevie Wonder attended the memorial and performed the song, Never Dreamed You'd Leave In Summer at the Staple's Center. Stevie Wonder recently in 2011 can be heard playing harmonica on Drake Graham's album Take Care. Stevie Wonder's songs have been sampled by artists such as Jon Gibson,Red Hot Chilli Peppers,Mary J Blige and several other artists were inspired by Stevie's musical talent. Stevie Wonder will forever be known as a pioneer in music a philanthropist, and a messenger of peace addressing controversies in music which very few artists did at that time. Stevie Wonder has touched the hearts of millions through his music and his philanthropic generosity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5NzQwOTU4OF5BMl5BanBnXkFtZTYwMTk3MTk0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005567","name":"Stevie Wonder","nicknames":["\"Little Stevie\" Wonder"],"idIMDB":"nm0005567"},"actorId":"nm0005567","character":"Singer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt4238910","urlIMDB":"http://www.imdb.com/title/tt4238910","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min) (Netherlands)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.0","filmingLocations":[{"location":"The O2 Arena, London, England, UK"}],"awards":[],"votes":"8","type":"Movie","companyCreditsSimple":[{"idCompany":"co0104239","name":"Done and Dusted"},{"idCompany":"co0169945","name":"Universal Motown Records Group"}],"keywords":{"keywords":["live performance","concert film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:21:44"}}