{"data":{"movies":[{"title":"Twin Peaks: The Missing Pieces","originalTitle":"","year":"2014","releaseDate":"20170127","directors":[{"name":"David Lynch","id":"nm0000186"}],"writers":[],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E4NjgyOWQtMGQyMS00ZWViLTlhNTAtODZjNTliOWM4NzE1XkEyXkFqcGdeQXVyMjc2NTc3NDA@._V1.jpg","countries":["USA","France"],"languages":["English"],"genres":["Drama","Horror","Mystery","Romance","Thriller"],"plot":"Twin Peaks before (1990) and at the same time not always and entirely in the same place as (1992). A feature film which presents deleted scenes from (1992) assembled together for the first time in an untold portion of the story's prequel.","simplePlot":"Twin Peaks before (1990) and at the same time not always and entirely in the same place as (1992). A feature film which presents deleted scenes from (1992) assembled together for the first time in an untold portion of the story's prequel.","actors":[{"actorName":"Chris Isaak","urlProfile":"http://www.imdb.com/name/nm0001389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTM2ODE2M15BMl5BanBnXkFtZTYwNjc4NDYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1956","placeOfBirth":" Stockton, California, USA","birthName":"Christopher Joseph Isaak","height":"6' 1\" (1.85 m)","bio":"Chris Isaak was born on June 26, 1956 in Stockton, California, USA as Christopher Joseph Isaak.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTM2ODE2M15BMl5BanBnXkFtZTYwNjc4NDYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001389","name":"Chris Isaak","idIMDB":"nm0001389"},"actorId":"nm0001389","character":"Special Agent Chester Desmond","urlCharacter":"http://www.imdb.com/character/ch0032275","main":true},{"actorName":"Kiefer Sutherland","urlProfile":"http://www.imdb.com/name/nm0000662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MjI5ODI3Nl5BMl5BanBnXkFtZTcwNTQzOTM0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1966","placeOfBirth":" Paddington, London, England, UK","birthName":"Kiefer William Frederick Dempsey George Rufus Sutherland","height":"5' 8½\" (1.74 m)","bio":"Kiefer Sutherland was born in London, England, UK, to Canadian actors Shirley Douglas and Donald Sutherland, who moved to California shortly after his birth. His maternal grandfather, Tommy Douglas, was a Scottish-born Canadian politician who was a Premier of Saskatchewan for over 17 years and led the national NDP party for almost 10. Kiefer got his first film role in the comedy drama Max Dugan Returns (1983). Sutherland's first major role was in the Canadian drama Un printemps sous la neige (1984), which earned Sutherland and director Daniel Petrie, Genie award nominations for best actor and best director, respectively. Following his success in The Bay Boy, Sutherland eventually moved to Los Angeles and landed television appearances in \"The Mission\", an episode of Amazing Stories (1985) and in the telefilm Trapped in Silence (1986) with Marsha Mason. In 1992, Sutherland starred opposite Ray Liotta and Forest Whitaker in Article 99 (1992) and in the military drama A Few Good Men (1992) also starring Jack Nicholson and Tom Cruise. Later, in 1994, he starred with Jeff Bridges and Nancy Travis in the American version of The Vanishing (1993) for 20th Century Fox. In 1997, he co-starred with William Hurt and Rufus Sewell in Dark City (1998), directed by Alex Proyas, which was a special presentation at the Cannes Film Festival. Sutherland also added his second directorial credit and starred in Truth or Consequences, N.M. (1997) alongside Kevin Pollak, Mykelti Williamson, Rod Steiger and Martin Sheen. He stars in the Fox drama series 24 (2001) as Jack Bauer for which he has earned a Golden Globe for Best Actor in a Drama Series. Most recently, he has been seen in the movie Phone Booth (2002) as a man who calls up someone at a phone booth and threatens to kill them if they hang up.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MjI5ODI3Nl5BMl5BanBnXkFtZTcwNTQzOTM0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000662","name":"Kiefer Sutherland","idIMDB":"nm0000662"},"actorId":"nm0000662","character":"Sam Stanley","urlCharacter":"http://www.imdb.com/character/ch0009677","main":true},{"actorName":"C.H. Evans","urlProfile":"http://www.imdb.com/name/nm0262602","urlPhoto":"","biography":{"bio":"C.H. Evans is an actor, known for Twin Peaks: Fire Walk with Me (1992), Twin Peaks: The Missing Pieces (2014) and Dead in the Water (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0262602","name":"C.H. Evans","idIMDB":"nm0262602"},"actorId":"nm0262602","character":"Jack at Hap's","urlCharacter":"http://www.imdb.com/character/ch0052108","main":true},{"actorName":"Sandra Kinder","urlProfile":"http://www.imdb.com/name/nm0454278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzM3MzUzNV5BMl5BanBnXkFtZTcwMjQ1MTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sandra Kinder is an actress, known for Twin Peaks: Fire Walk with Me (1992), Twin Peaks: The Missing Pieces (2014) and Playing God (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzM3MzUzNV5BMl5BanBnXkFtZTcwMjQ1MTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0454278","name":"Sandra Kinder","idIMDB":"nm0454278"},"actorId":"nm0454278","character":"Irene at Hap's","urlCharacter":"http://www.imdb.com/character/ch0052062","main":true},{"actorName":"Rick Aiello","urlProfile":"http://www.imdb.com/name/nm0014519","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjM3MzM2Nl5BMl5BanBnXkFtZTcwNjQ2ODMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1958","placeOfBirth":"","height":"6' 2\" (1.88 m)","bio":"Rick Aiello was born in 1958. He is known for his work on Do the Right Thing (1989), Sex and the City (2008) and Twin Peaks: Fire Walk with Me (1992). He has been married to Arlene Anne Urichich since 1990. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjM3MzM2Nl5BMl5BanBnXkFtZTcwNjQ2ODMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0014519","name":"Rick Aiello","idIMDB":"nm0014519"},"actorId":"nm0014519","character":"Cliff Howard","urlCharacter":"http://www.imdb.com/character/ch0052067","main":true},{"actorName":"Elizabeth McCarthy","urlProfile":"http://www.imdb.com/name/nm0565124","urlPhoto":"","biography":{"bio":"Elizabeth McCarthy is an actress, known for Twin Peaks: Fire Walk with Me (1992), Twin Peaks: The Missing Pieces (2014) and The Delinquents (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0565124","name":"Elizabeth McCarthy","idIMDB":"nm0565124"},"actorId":"nm0565124","character":"Giggling Secretary","urlCharacter":"http://www.imdb.com/character/ch0111546","main":true},{"actorName":"Steven Beard","urlProfile":"http://www.imdb.com/name/nm7845021","urlPhoto":"","biography":{"bio":"Steven Beard is an actor, known for Twin Peaks: The Missing Pieces (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7845021","name":"Steven Beard","idIMDB":"nm7845021"},"actorId":"nm7845021","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Bullock","urlProfile":"http://www.imdb.com/name/nm0120147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTE5NjU3NV5BMl5BanBnXkFtZTYwNzE5NDAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Born July 19, 1941, and raised in Elizabethton, Tennessee. His father, Robert Bullock, was a great movie fan, and Gary got to see a lot of movies when still a small boy, from Fred and Ginger, Bogart and Bacall, to Gary Cooper and of course, Roy Rogers. Fascinated with acting, he nonetheless had an earlier career as a computer programmer, working at the Smithsonian Astrophysical Observatory, and the Millstone Radar site, in New England. He abandoned that career path to become an actor later in life, and met his wife, Mil Nicholson, during a stage production of The Crucible. She is the love of his life. Mil and Gary now record audio books, with Mil performing all the characters of Charles Dickens' novels, while Gary is in the process of narrating a documentary of the 325th Fighter Group of World War 2, \"The Checkertails\". Gary has also authored two screenplays, \"Elsewhen\", a sci-fi romance, and \"Ridge Runner\", and true Civil War story, with others in the works. He is also writing a novelization of the screenplay \"Elsewhen\". In his spare time, he builds and flies model aircraft, numbering about 35, and growing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTE5NjU3NV5BMl5BanBnXkFtZTYwNzE5NDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0120147","name":"Gary Bullock","idIMDB":"nm0120147"},"actorId":"nm0120147","character":"Sheriff Cable","urlCharacter":"http://www.imdb.com/character/ch0052064","main":true},{"actorName":"Kyle MacLachlan","urlProfile":"http://www.imdb.com/name/nm0001492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Mzk3OTg3MF5BMl5BanBnXkFtZTYwMTk0MDkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1959","placeOfBirth":" Yakima, Washington, USA","birthName":"Kyle Merritt McLachlan","height":"5' 11¼\" (1.81 m)","bio":"The \"boy next door, if that boy spent lots of time alone in the basement\", is how Rich Cohen described Kyle MacLachlan in a 1994 article for \"Rolling Stone\" magazine. That distinctly askew wholesomeness made MacLachlan a natural to become famous as the alter ego of twisted director David Lynch. MacLachlan was born and raised in Yakima, Washington, to Catherine Louise (Stone), a public relations director, and Kent Alan McLachlan, a lawyer and stockbroker. He has Scottish, English, Cornish, and German ancestry. MacLachlan graduated from the University of Washington in 1982. The darkly handsome actor made his feature film debut when he starred in the big-budget David Lynch adaptation of Frank Herbert's Dune (1984), but only enjoyed real success after appearing in a second Lynch project, the moody and perverse classic, Blue Velvet (1986). The following year saw MacLachlan appearing as an otherworldly FBI agent in the cult classic sci-fi film, The Hidden (1987). This turned out to be a sign of things to come, as MacLachlan soon took on another oddball G-man, \"Special Agent Dale Cooper\", on Lynch's cryptic ABC-TV series, Twin Peaks (1990), perhaps, along with Blue Velvet (1986), his most famous role. MacLachlan's remarkable work as Agent Cooper earned him a Golden Globe award and a pair of Emmy nominations, as well as steady work in television and films, including a part as Ray Manzarek in the Oliver Stone film, The Doors (1991), and villain \"Cliff Vandercave\" in the live action version of The Flintstones (1994). His career took a hit after he appeared in the infamous flop, Showgirls (1995). However, MacLachlan returned to prominence in the early 2000s with a re-occurring role on HBO's Sex and the City (1998), as well as a starring role in the TV movie, The Spring (2000), and a turn as \"Claudius\" in director Michael Almereyda's version of Hamlet (2000). MacLachlan later took advantage of his resemblance to Cary Grant, when he played the classic actor's spirit in Un soupçon de rose (2004). MacLachlan has remained a popular actor with independent filmmakers, and he has also been a familiar face on television, appearing on the ABC-TV shows, In Justice (2006) and Desperate Housewives (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Mzk3OTg3MF5BMl5BanBnXkFtZTYwMTk0MDkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001492","name":"Kyle MacLachlan","idIMDB":"nm0001492"},"actorId":"nm0001492","character":"FBI Special Agent Dale Cooper","urlCharacter":"http://www.imdb.com/character/ch0009681","main":true},{"actorName":"David Bowie","urlProfile":"http://www.imdb.com/name/nm0000309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTE3MTYzOF5BMl5BanBnXkFtZTcwNDM4OTcyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1947","placeOfBirth":" Brixton, London, England, UK","birthName":"David Robert Haywood Jones","height":"5' 10\" (1.78 m)","bio":"David Bowie is widely regarded as one of the most influential writers of pop music. Born David Jones, he changed his name to Bowie in the 1960s, to avoid confusion with the then well-known Davy Jones (lead singer of The Monkees). The 1960s were not a happy period for Bowie, who remained a struggling artist, awaiting his breakthrough. He dabbled in many different styles of music (without commercial success), and other art forms such as acting, mime, painting, and playwriting. He finally achieved his commercial breakthrough in 1969 with the song \"Space Oddity,\" which was released at the time of the moon landing. Despite the fact that the literal meaning of the lyrics relates to an astronaut who is lost in space, this song was used by the BBC in their coverage of the moon landing, and this helped it become such a success. The album, which followed \"Space Oddity,\" and the two, which followed (one of which included the song \"The Man Who Sold The World,\" covered by Lulu and Nirvana) failed to produce another hit single, and Bowie's career appeared to be in decline. However, he made the first of many successful \"comebacks\" in 1972 with \"Ziggy Stardust,\" a concept album about a space-age rock star. This album was followed by others in a similar vein, rock albums built around a central character and concerned with futuristic themes of Armageddon, gender dysfunction/confusion, as well as more contemporary themes such as the destructiveness of success and fame, and the dangers inherent in star worship. In the mid 1970s, Bowie was a heavy cocaine abuser and sometime heroin user. In 1975, he changed tack. Musically, he released \"Young Americans,\" a soul (or plastic soul as he later referred to it) album. This produced his first number one hit in the US, \"Fame.\" He also appeared in his first major film, The Man Who Fell to Earth (1976). With his different-colored eyes and skeletal frame, he certainly looked the part of an alien. The following year, he released \"Station to Station,\" containing some of the material he had written for the soundtrack to this film (which was not used). As his drug problem heightened, his behavior became more erratic. Reports of his insanity started to appear, and he continued to waste away physically. He fled back to Europe, finally settling in Berlin, where he changed musical direction again and recorded three of the most influential albums of all time, an electronic trilogy with Brian Eno \"Low, Heroes and Lodger.\" Towards the end of the 1970s, he finally kicked his drug habit, and recorded the album many of his fans consider his best, the Japanese-influenced \"Scary Monsters.\" Around this time, he played the Elephant Man on Broadway, to considerable acclaim. The next few years saw something of a drop-off in his musical output as his acting career flourished, culminating in his acclaimed performance in Merry Christmas Mr. Lawrence (1983). In 1983, he recorded \"Let's Dance,\" an album which proved an unexpected massive commercial success, and produced his second number 1 hit single in the US. The tour which followed, \"Serious Moonlight,\" was his most successful ever. Faced with this success on a massive scale, Bowie apparently attempted to \"repeat the formula\" in the next two albums, with less success (and to critical scorn). Finally, in the late 1980s, he turned his back on commercial success and his solo career, forming the hard rock band, Tin Machine, who had a deliberate limited appeal. By now, his acting career was in decline. After the comparative failure of Labyrinth (1986), the movie industry appears to have decided that Bowie was not a sufficient name to be a lead actor in a major movie, and since that date, most of his roles have been cameos or glorified cameos. He himself also seems to have lost interest in movie acting. Tin Machine toured extensively and released two albums, with little critical or commercial success. In 1992, Bowie again changed direction and re-launched his solo career with \"Black Tie White Noise,\" a \"wedding\" album inspired by his recent marriage to Iman. He released three albums to considerable critical acclaim and reasonable commercial success. In 1995, he renewed his working relationship with Brian Eno to record \"Outside.\" After an initial hostile reaction from the critics, this album has now taken its place with his classic albums. In 2003, Bowie released an album entitled 'Reality.' The Reality Tour began in November 2003 and, after great commercial success, was extended into July 2004. In June 2004, Bowie suffered a heart attack and the tour did not finish it's scheduled run. After recovering, Bowie did not release any new music, but did a little acting. In 2006, he played Tesla in The Prestige (2006) and had a small cameo in the series Extras (2005). In 2007, he did a cartoon voice in SpongeBob SquarePants (1999) playing Lord Royal Highness. He has not appeared in anything since 2008; however, after a ten year hiatus from recording, he released a new album called 'The Next Day.' Bowie has influenced the course of popular music several times and influenced several generations of musicians. His promotional videos in the 1970s and 80s are regarded as ground-breaking, and as a live concert act, he is regarded as the most theatrical of them all.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTE3MTYzOF5BMl5BanBnXkFtZTcwNDM4OTcyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000309","name":"David Bowie","nicknames":["The Thin White Duke","Ziggy Stardust","The Picasso of Pop","The Dame","The Master of Reinvention","The Chameleon of Rock","Aladdin Sane","Major Tom","The Starman"],"idIMDB":"nm0000309"},"actorId":"nm0000309","character":"Phillip Jeffries","urlCharacter":"http://www.imdb.com/character/ch0032273","main":true},{"actorName":"Hirsh Diamant","urlProfile":"http://www.imdb.com/name/nm1045187","urlPhoto":"","biography":{"bio":"Hirsh Diamant is an actor, known for Twin Peaks: The Missing Pieces (2014) and Northern Exposure (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1045187","name":"Hirsh Diamant","idIMDB":"nm1045187"},"actorId":"nm1045187","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stefano Loverso","urlProfile":"http://www.imdb.com/name/nm7845022","urlPhoto":"","biography":{"bio":"Stefano Loverso is an actor, known for Twin Peaks: The Missing Pieces (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7845022","name":"Stefano Loverso","idIMDB":"nm7845022"},"actorId":"nm7845022","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeannie Bonser","urlProfile":"http://www.imdb.com/name/nm7845023","urlPhoto":"","biography":{"bio":"Jeannie Bonser is an actress, known for Twin Peaks: The Missing Pieces (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7845023","name":"Jeannie Bonser","idIMDB":"nm7845023"},"actorId":"nm7845023","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Samorano","urlProfile":"http://www.imdb.com/name/nm7845024","urlPhoto":"","biography":{"bio":"Alex Samorano is an actor, known for Twin Peaks: The Missing Pieces (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7845024","name":"Alex Samorano","idIMDB":"nm7845024"},"actorId":"nm7845024","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael J. Anderson","urlProfile":"http://www.imdb.com/name/nm0027199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDgwODE5MF5BMl5BanBnXkFtZTgwNTM0Nzc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1953","placeOfBirth":" Denver, Colorado, USA","height":"3' 7\" (1.09 m)","bio":"Michael Anderson was born in Huron, South Dakota, at 10:30 P.M., on Halloween night. Subject to a genetic anomaly known as Osteogenesis Imperfecta, he grew up in a wheelchair. After graduating high school, he traveled America, singing for tips and living in his car. For six years, he attended the University of Colorado where he majored in numerous subjects ranging from philosophy to microbiology. After college, he began working for Martin Marietta, trouble-shooting the N.A.S.A. computers in the ground-support system of the space shuttle. During this time, he made the documentary \"Little Mike,\" which won a silver medal in the International Film and Television Awards. Soon thereafter, he moved to New York City, where his film and television career began. For many years, Anderson was most well-known among fans of director David Lynch for his work as a backwards-talking dream figure on the cult favorite T.V. series Twin Peaks (1990). Anderson also worked with Lynch for the experimental performance piece Industrial Symphony No. 1: The Dream of the Brokenhearted (1990) and the T.V.-pilot-turned-feature film Mulholland Drive (2001). Anderson gained further recognition and success in recent years for his work on the H.B.O. series La caravane de l'étrange (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDgwODE5MF5BMl5BanBnXkFtZTgwNTM0Nzc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0027199","name":"Michael J. Anderson","idIMDB":"nm0027199"},"actorId":"nm0027199","character":"Man From Another Place","urlCharacter":"http://www.imdb.com/character/ch0009707","main":true}],"seasons":[],"idIMDB":"tt5334704","urlIMDB":"http://www.imdb.com/title/tt5334704","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"1","country":"USA","day":"16","month":"07","year":"2014","remarks":""}],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"04","month":"09","year":"1991","remarks":null},{"money":null,"country":null,"day":"01","month":"11","year":"1991","remarks":null}],"copyrightHolder":"© 2013 Twin Peaks Productions, Inc. - Co-producer and distributor: MK2"},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.1","filmingLocations":[{"location":"534 Lewis Street, Monroe, Washington, USA"}],"awards":[],"votes":"1,547","type":"Movie","companyCreditsSimple":[{"idCompany":"co0192417","name":"Absurda"},{"idCompany":"co0068754","name":"MK2 Diffusion"}],"keywords":{"keywords":["deleted scene","dwarf","diary","dead girl","corpse","sheriff","deputy sheriff","salvation","club","based on tv series","red curtain","pink","nightmare","deja vu","pacific northwest","small town","serial killer","rape","secret","based on cult tv series","one armed man","investigation","1980s","sex scene","sequel","prequel","fbi agent","fbi","violence","creamed corn","murder","surrealism","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:22:40"}}